{
  "company": "accenture",
  "post_count": 64,
  "exported_at": "2026-01-18T17:44:53.251Z",
  "posts": [
    {
      "title": "Accenture Tech Analyst New Grad Final Round",
      "body": "I have my final round interview at Accenture for a tech analyst (advanced application engineering) new grad role coming up and was just wondering if anyone had any tips for it. There are two rounds, one being a presentation/scenarios portion and a skills/strength portion. Any advice would be appreciated, thanks!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/yct52b/accenture_tech_analyst_new_grad_final_round/",
      "comments": [
        {
          "body": "Search for Accenture on this sub and then withdraw your application",
          "score": 10
        }
      ]
    },
    {
      "title": "Is Accenture a good place for new grads?",
      "body": "The chair of my department emailed us about a new opening of an Accenture office and they're seeking new grads. They do consulting and I've heard mixed things about about that on this sub. Anybody work at Accenture as a new grad and have a good experience? How's the work/life balance?",
      "subreddit": "cscareerquestions",
      "score": 22,
      "url": "https://reddit.com/r/cscareerquestions/comments/3uhdb1/is_accenture_a_good_place_for_new_grads/",
      "comments": [
        {
          "body": "No, they're not.\n\nEDIT: Bad pay, bad culture, lack of respect for tech people... why would you even think about it having real tech companies?",
          "score": 54
        },
        {
          "body": "I'm currently a manager at Accenture who still codes and does alot of hands on work on the federal side of things.  Currently, I'm working on a nodeJS application with an AngularJS/bootstrap frontend which will integrate with some backend APIs and possibly some natural language parsing technologies.\n\nAccenture is a huge company much like IBM, Deloitte, PwC, etc.  Your experience is really going to vary by project.  Accenture has over 250K people and the work varies from location and project.  Accenture also does a lot of management consulting, IT strategy and outsourcing.\n\nBad sides to Accenture: \n\nFor the most part, Accenture is a run of the mill IT consulting firm, it's probably better than other contracting companies like CSC, SAIC, etc but it really depends on the project and client.  The interviewing process can vary but from my experience, the interviews are probably 1/10 the difficulty of a google/facebook/major product shop interview.  From my experience, the better technical talent here always seems to leave after a few years due to Accenture's focus on sales and project management.  Accenture's culture tends to promote the project manager type and sales as opposed to deep technical talent. \n\nWork life balance can be brutal (but it really depends on the project).  Accenture is highly political and it pays to political, they value client facing roles over deep technical roles.  You can build a system from scratch with everything that the client loves but if you don't prove yourself to be capable of doing sales, you'll always get passed over by somebody that can up sell the client.  Since Accenture is a consulting firm, they tend to be pretty formal and even business formal...so nothing like startup cultures and software engineering cultures.\n\nAccenture also tends to shoehorn people that aren't exactly the right fit.  Because Accenture doesn't pay top dollar and really doesn't have deep technical expertise, you will be working with alot of people who bullshit and aren't really capable of doing the job...this is extremely frustrating when  you're trying to deliver and work with a team that is somewhat technically inept.\n\nGood sides\n\nAccenture has been doing alot of IT development and has a lot of opportunities if you have the skillset and the willingness to learn.  If you're astute and know the technology pretty well, you can raise up fast as a fresh graduate (you'll hit a wall at the manager level though, which is about atleast 6 years in).  If you want to travel, Accenture (like any other consulting firm) can be great...you can rack up the points and travel perks.  Personally, I have alot of liberties with my project where I can work from home on a pretty frequent basis.\n\nIn a nutshell\n\n* Accenture has mediocre technical talent for the most part, I've seen some pretty capable people but the vast majority of them end up leaving for greener pastures (especially in software engineering).\n\n* Accenture doesn't have that much of a threshold for becoming an expert in a technology, they will train you and may throw you off the deep end.\n\n* Accenture does have good benefits, about 25 days vacation (if you're in the consulting work force), 6% 401K matching after a year with the company, have about 4-17% bonus and above health insurance plans.\n\nIf you have the options to work with the bigger name companies like facebook, google, amazon , etc...I'd say they carry a much bigger weight for software development.  If you want something more formal and potentially go for a MBA and want to go into consulting, Accenture maybe better.  But I don't think Accenture carries as much prestige as Bain, McKinsley, Boston consulting, etc or Google, facebook.\n\nedit: formatting\n\n",
          "score": 16
        },
        {
          "body": "[deleted]",
          "score": 24
        },
        {
          "body": "As there's lots of negative here, I do have a friend there who really loves it.  She has to travel a lot, but enjoys racking up the hotel points and airline miles.  She also basically only has to be present 4 days a week, but does have to work 10-12 hours on those days.  But it basically means lots of free time on the weekends to go visit people all around the country.  She is not a software engineer, though, and is more on the PM side of things.  \n\nShe's also taking a 3-month unpaid sabbatical, less than 2 years in.  It's basically just an unpaid vacation, where she's using all of the airline miles she racked up to go around the world, and then gets to go back to work without having to hunt for a job.  Pretty nice perk if you ask me!   ",
          "score": 14
        },
        {
          "body": "I mean, it depends on what you're looking for. I, personally, don't like to work for large companies where the development cycle is often slow and there are many layers between you and the client. That being said, someone very close to me has worked there (programming) for 5+ years and he finds that the benefits outweigh how \"uncool\" it is to work there. Between decent insurance, stock options, almost yearly promotions, and the luxury of a true home and work-life balance (compared to my small consulting business, he has infinite more free time), he doesn't mind dealing with some of the incompetence that one inevitably runs into when exposed to a large set of coworkers. Also, it really depends on what project you get placed on. You may end up on a project you hate (which is true in most consulting gigs). However, at Accenture, you have a career counselor who can help you transition onto new roles. If there is a way for you to get insight on the project you will be placed on before you get there, that might help you make your decision.\n\ntl;dr It always depends on what you are looking for in your career! Accenture isn't the worst place to work, it's just not the best for everyone.",
          "score": 10
        },
        {
          "body": "One of my wife's college friends has worked there for about 13 years now.  He's \"going for partner\", whatever the hell that even means at a publicly-traded company.\n\nHe lives in Chicago but works in some small town in Iowa.  This means he flies out Sunday evening, then back home late Friday afternoon and lives out of a hotel during the week.  I'm sure they make it worth his while (I've seen their house!) but I wouldn't want to live like that for any amount of money.\n\nOh, and his project in Iowa?  The one he's been working on for at least five years?  He manages a team of COBOL programmers.  Yes, really.",
          "score": 4
        },
        {
          "body": "Accenture was rated the 4th best place to work in the UK by Glassdoor, right after Microsoft.\n\nhttps://www.glassdoor.co.uk/Best-Places-to-Work-UK-LST_KQ0,22.htm ",
          "score": 14
        }
      ]
    },
    {
      "title": "ACCENTURE FAKE INTERVIEWS",
      "body": "",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1pnr0q4/accenture_fake_interviews/",
      "comments": [
        {
          "body": "It's not fake.  Accenture is functionally an Indian company with Indian work culture and this is what it looks like.",
          "score": 1
        }
      ]
    },
    {
      "title": "I had a phone interview with Accenture for an analyst position on Friday April 27, and I've yet to hear back other than a reply to my thank you email. Is this a bad sign?",
      "body": "In the email, the hr rep just said thanks and that she will be getting back to me soon for the next step, but I haven't heard back in a week and I'm pretty nervous. I would also like to add that I was interviewed for a different position than I actually applied for, if that means anything. \n\nIs it appropriate to send a follow up email, or should I wait it out? And is this a bad sign?\n\nUPDATE: I guess I should have just emailed before I freaked out a little. Apparently, the hr rep told me that she's waiting to hear back from the senior exec, who's away on vacation, to see if there is a position available, and that there may be openings for another position as well.\n\nThanks for the help everyone!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/td9di/i_had_a_phone_interview_with_accenture_for_an/",
      "comments": [
        {
          "body": "I work placing people at Accenture.... I hate to break it to you but it is a bad sign. Accenture usually identifies quickly and moves quickly. On the flip side, they also are notorious for jobs \"disappearing.\" Most major services companies that are heavily invested in project work will try to staff before they have the SOW to get their ducks in a row. If the SOW doesn't come through, the job simply \"disappears.\"",
          "score": 4
        },
        {
          "body": "Email now.  Don't wait any longer.",
          "score": 2
        },
        {
          "body": "I've always taken the path of, \"No news is good news.\"  No news is more encouraging than a straight up, \"No!\"\n\nCompanies can take a real long time to hire someone.  Often offers have to cycle through several layers of approvals before they are extended.  If someone in the approval chain is on vacation, it could delay it. \n\nI think a weekly, \"Hey recruiter, I was just emailing to follow up to see if you had any questions or if there is any way I might be of service...\" would be okay.\n\nEDIT: Oh yeah, don't stop looking.  Keep the hunt up to make sure you have options.  It would suck to wait all this time just to find out you didn't get the job and not have a plan \"B\" in the works.",
          "score": 2
        },
        {
          "body": "Send an email but avoiding Accenture in the future helps too. I'm kidding, they are a fine company.\n\nFollow the directions, apply, and forget it. If they want you, they'll let you know. ",
          "score": 2
        },
        {
          "body": "&gt;Is this a bad sign?\n\nIt's no sign. \n\nCan't think about such things that way... or at all. You're trying to read something into nothing. \n\nEmail her back and just go from there. Don't play 'what if' with your job search. It's not worth it and will get you nothing but more stress.",
          "score": 2
        }
      ]
    },
    {
      "title": "Still haven't found a job 2 years after graduating, what now?",
      "body": "tl;dr need to move out within 3 months; should I pursue entrepreneurship, develop more hireable projects, or apply to absolutely any company even witch/consulting to get a job quickly without experience?\n\nBackground:\n\n* Bachelor's in CS from top 100 school in US, never did an internship, good GPA, currently located in extremely active tech region in US\n* Took a year-long career break upon graduating to focus on music, but it wasn't making money\n* First software-related activity after my break: full-stack Next.js site. Launched that, did a couple more projects in React/TypeScript, and feel much more knowledgeable and passionate about the software world than when I was in uni.\n\nJob search:\n\n* Applied to \\~400 jobs (2 interviews, 3 assessments)\n* Loosened requirements over time (may relocate anywhere in US, on-call, 5+ employee startups/companies)\n* [Resume](https://imgur.com/a/bK1dimB)\n\nI have not been, and am not, willing to:\n\n* Attend graduate school, especially online: extremely unfulfilling to me, would much, much rather enter workforce as quickly as possible. (exception: Stanford - not happening lol)\n* Apply to internships: worthless to me - it's for students and very short term. Instead, I apply to apprenticeships and early career jobs, which is where I fit. Maybe I'm wrong.\n* Freelance: I really don't want to.\n\nEverything is getting worse quickly. My current priority is income and moving out within 3 months. My long-term goal is just to work on meaningful things; whether as a team member at a company or solo, doesn't matter. I have been considering (and **this is where your input would be appreciated in what direction to go**):\n\n* Entrepreneurship: one of my projects is something I see very in-demand among... regular people, and I met someone to work with. It is absolutely something that can make money. If I did this, I would want to take up a part-time gig doing something unrelated to cs for a while. I am absolutely ready to commit to getting this in the hands of the public, but I'm looking for nuanced perspectives from this community to base my decision on (and to cite to my mom lol).\n* Optimizing my resume: Do more projects using languages/frameworks in high demand like Java/Spring. The bad thing about this is that it's not work experience, so recruiters still give negative fucks. It would also be slow and painful, maybe a couple of months, and nothing is guaranteed. Easily the worst option, but I mention it to indicate my awareness.\n* Apply to companies like Accenture/Revature/WITCH: I was closed off due to the stigma and bad things I've heard, but you could convince me.\n* Keep applying: 400 jobs is nothing, many have applied to thousands. I'll find something in 3 months. Right?\n\n-----\n\nEdit: All of your insights have been valuable and every comment is appreciated, even the insults to my character. I haven't been very social in a while, so you probably have a point.\n\nIn retrospect, I wasn’t applying to the aforementioned companies because\n\n1. I was holding out for any cs-adjacent job at another type of company, but I am (and have been for a while) obviously at a point where just getting started is the most pressing matter. \n2. I viewed them as dead-end and even scams rather than valuable opportunities due to some of the discussion I saw around them online and the abundance of proprietary development positions I tended to see from them, the latter of which mainly led to my view of them as dead-end. (Very particular I know, but I feel the need to point out my unconscious biases as others in my position may hold them, so I would like to urge them to assess their situation and see if it’s really worth holding on to.)\n3. Personally, I will be keeping my mind open and adopting a more humble and urgent attitude.\n\n**I’ve applied to those companies** of course and there is no sense of dread.\n\nPreviously, I also only applied to jobs that fit where my skills fit, but your insight justifies me dropping that requirement. **I will be applying to anything entry-level.**\n\nAs for internships,\n\n1. Some have twisted my statement as \"I have always viewed them as worthless, even as a student,\" when there was no reason behind why I didn't do any beyond ignorance and laziness, I just didn't do them.\n2. I called them \"worthless\" in my case because the vast majority of internship postings require you to be a currently enrolled student or very recently graduated. At first, I didn't care and applied to them anyway, but I always got rejected, so I thought my time was better spent applying to more full-time roles, which I had already seen chances from. \"Worthless\" is a harsh word, but I felt it accurately described what came of my efforts.\n3. I understand not doing them in college was a grave mistake. There is no point for me to lament further. I am moving forward.",
      "subreddit": "cscareerquestions",
      "score": 198,
      "url": "https://reddit.com/r/cscareerquestions/comments/1e07pr7/still_havent_found_a_job_2_years_after_graduating/",
      "comments": [
        {
          "body": "FYI the reputation of witch being easy to get into is from back when money was cheap and they were getting tons of contracts. But that's no longer true and Im pretty sure some of them are still on hiring freeze. So basically if witch is your backup plan, you might want to start thinking about a backup backup plan.",
          "score": 147
        },
        {
          "body": "Accenture really isn’t that bad. Given the state of the economy, it is extremely competitive. Revature/WITCH aren’t great, but it’s your best bet at getting a job fast. Some of these companies were on hiring freezes over the past year tho, so idk if they are hiring at the moment. Good luck. You’re going to need it",
          "score": 175
        },
        {
          "body": "Your resume looks neat and I like the descriptions but I think you can drop 1 or 2 projects. Your resume is a little long for no job/internship experience. \n\n\n&gt; I have been considering…\n  \nWhy not do all 4 things you listed? Optimize your resume, apply to contracting companies, do projects using in-demand frameworks, and get a part-job (you need **a** job, it doesn’t have to be related to CS). \n\nYou aren’t employed so you have time.",
          "score": 39
        },
        {
          "body": "Get all your ducks in a row w.r.t. moving. Figure out where you're going, roommates, moving truck vs. putting everything in your car, everything.\n\nI would not bank on landing a CS job in 3 months. I'm at 5 YOE and I don't think I could reliably land one in that time. Even a WITCH company. When I was applying for jobs in early 2023 all of the WITCHes ghosted me. They can't get clients so they're not hiring much",
          "score": 74
        },
        {
          "body": "I worked at a consulting company that was purchased by a WITCH. Really good way to put a bunch of interesting things on your resume and get trained in how to tell a story with your resume. It is absolutely not the disqualifing resume stain people here make it out to be.",
          "score": 57
        },
        {
          "body": "This aversion to witch companies and contracting/freelancing is wild to me. \n\nI've contracted/freelanced for nike making 190k a year and have worked at witch making 145k as a senior when I had to. Funny enough I only averaged 20 hours a week of work at witch so the money I made per hour was awesome! These are salaries are in a LCOL area.\n\n95% of people don't work in faang, people need to get off the internet.\n\nYou mention top 100 school which is also wild to me, I've had colleagues with masters degrees from ivy league at witch companies.\n\nNo project or internship will beat real life experience even one from witch or freelancing.\n\nEdit: Also why don't you have any internships on your resume? That's the most important part of your degree unless you go to a top 10 school. As a hiring manager there is no way I would consider you based on your resume.\n\nYou and so many other people on this sub just seem delusional with your expectations.",
          "score": 188
        }
      ]
    },
    {
      "title": "Got a second interview at Accenture which should be technical. I have a few questions.",
      "body": "I posted a few days ago that I had a video interview with Accenture and went to panic mode because they only gave me a few hours notice. Turns out it was a simple screening interview asking me about myself and If I'm ok about traveling. Now I have a second interview this sunday and they sent me an email spicifically stating \"The interview is going to be both technical and about personality traits\". This is my first ever interview at a large company and I've been searching the sub for any tips and I found what huge companies like Google and Microsoft interviews are like and I have to admit I'm very intimidated and nervous right now. I have almost no experiance at coding outside college and my graduation project, right now I'm reading through all the top posts in this sub.\nMy question is: Does anybody have any experiance about the tech interview at Accenture? How is it going to be compared to interviews at Google or Microsoft?\n\nEDIT: It's in Saudi Arabia. I live there.",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/37kzfq/got_a_second_interview_at_accenture_which_should/",
      "comments": [
        {
          "body": "You should definitely check out glassdoor\n\nEDIT: In case you didn't know about glassdoor http://www.glassdoor.com/Interview/Accenture-Interview-Questions-E4138.htm#",
          "score": 4
        },
        {
          "body": "[removed]",
          "score": 3
        },
        {
          "body": "Ask your recruiter if there are topics or particular themes the interview will cover, they often send out a list of topics or knowledge the interview will cover so that you're able to be fresh on them \n\nAlso accenture where? they have offices all over the world, recruiters might be different in each area",
          "score": 2
        },
        {
          "body": "What job title would this be for? I recently interviewed at Accenture for an Automated QA position.",
          "score": 2
        },
        {
          "body": "It's hard to give a lot of advice without knowing more about the position.  Accenture is a very broad company, and there's people working in many different languages and programs.  Going over the interview questions on glassdoor is a good idea.  Other than that, they tend to just look for smart, capable people, as others have pointed out, so if you prove to them the you're generally capable at problem solving, it'll go a long way.\n\nOther than that, if you're still unclear about exactly what they expect you to do, ask.  (A good way to ask this without looking uninformed is to ask them what an average workday is like in the position you're applying for.)  Also, seeing as Accenture is a consulting company, confidence and good people skills will probably help more a little more than usual.",
          "score": 2
        }
      ]
    },
    {
      "title": "(US) Which companies have the lowest standards when it comes to hiring entry level software engineers?",
      "body": "I’ve been applying for quite a bit with no luck. At this rate I just want to cut my losses, get my foot in the door and take anything I can get. Don’t really care about how bad the corporate culture is or how low the pay is at this point. \n\nSo, what kinds of companies should I apply to if I just want to maximize my chances of getting hired?",
      "subreddit": "cscareerquestions",
      "score": 339,
      "url": "https://reddit.com/r/cscareerquestions/comments/rl0n63/us_which_companies_have_the_lowest_standards_when/",
      "comments": [
        {
          "body": "[removed]",
          "score": 71
        },
        {
          "body": "At General Motors, the technical challenge was some super basic string manipulation challenge, but they do require HireVue video recordings as part of the interview process. All of the questions asked in the HireVue interview were behavioral/STAR questions, and you have 2 or 3 chances to record/re-record your response. Pay here isn't the best but it's atleast something to get your foot in the door in the field. \n\nAlso check other Fortune 500 companies where technology isn't their core product. I find that these companies have large internal software needs writing boring software and don't have the insane interview requirements that tech companies do. \n\nAlso, defense contractors (Northrup Grumman, Lockheed Martin, Raytheon) have so many non-technical requirements for their employees due to the nature of being a government contractor (must be a US citizen and not a dual citizen of any other country, must be able to obtain a security clearance) that they don't put up a huge technical hurdle. I was asked a few questions about what Linux commands I would use to accomplish different tasks.",
          "score": 193
        },
        {
          "body": "Wipro\n  \nInfosys\n  \nTata Consultancy\n  \nCognizant\n  \nHCL \n  \nand I guess throw in Revature and Accenture too\n  \nI'm willing to bet there's a very high chance that 1 of those 7 will definitely take you",
          "score": 249
        },
        {
          "body": "Defense, government, and tiny startups. Source: Worked in defense. No code questions in the interview.",
          "score": 33
        },
        {
          "body": "Hi, I’ve had the easiest interviews and received offers from the following companies:  beaconfire, pyramid consulting, Infosys, Hcl, bti solutions, itilize.  Other companies that seem easy include mthree and cogent infotech.",
          "score": 34
        },
        {
          "body": "Try local companies if you can. Some rarely get competent candidates and they'll be willing to take anybody who applies.",
          "score": 89
        },
        {
          "body": "You can try your hand at banks. Standards are higher than say Revature but much lower than FAANG companies.",
          "score": 86
        }
      ]
    },
    {
      "title": "Passed the online form stage. Passed the phone interview. Face to face interview coming up for the Accenture ATS Graduate Scheme! Any tips?",
      "body": "hey guys,\n\ni was wondering if anyone had any tips or actually worked at ATS for accenture who could help. i am in my final year studying computer science at the university of hull, and i had my phone interview this morning which went well. \n\ndetails of recruitment process can be found here: http://careers.accenture.com/Microsites/uk-graduate/apply/Pages/ats-process.aspx\n\nthank you so much!",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/18tw7i/passed_the_online_form_stage_passed_the_phone/",
      "comments": [
        {
          "body": "how was the whole experience? did you manage to get a job with them?",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone had experiences with ICF?",
      "body": "I have a 2nd interview round for a Junior Microsoft Applications Developer position coming up, wondering what the process is like and the types of questions they'll ask for a developer position.\n\nAlso ICF is a large consulting firm like Accenture and the likes so... I know it's better than nothing in this market, but jobs in these kinds of companies are not conducive to a \"real\" SWE career I take it? idk how bad the reputation of programmers coming from consultancies are like, so I'm a bit worried this might hurt my career more in the end. My time would probably be better spent finding a more product-focused role.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1afy6hm/anyone_had_experiences_with_icf/",
      "comments": [
        {
          "body": "Ask about mentoring, what types of people will be leading your team, and what type of management/career development help you'll be getting. I worked at a consulting company that used to recruit experienced people for their entry role, and then switched to recruiting from schools, but expected new grads to have the same skills as people with a few years of work experience. It didn't go well, and they were confused as to why. \n\nI'm hoping since it has \"junior\" in the title, they have some awareness and mindfulness of this, but you never know. Obviously you should word it as carefully as you can compared to what I wrote. \n\nThere's a chance you'll be doing real dev work and writing code, etc. And there's a chance you'll be doing weird things. Depends on the company and the kind of work they can sell.",
          "score": 3
        },
        {
          "body": "Wowwee, small world. I've worked at ICF before. I don't want to dox myself, so I'm going to keep some details vague.\n\n\nThe tech interview depends on the team, if you're going to be working for one of their subsidiaries, etc. A lot of teams skip the Leetcode and go for more practical exercises. You should ask, tbh. Expect to be able to answer to whatever is on your resume, projects you've done in the past, some basic DS&amp;A, etc.\n\n\nMake sure you're going to be writing actual code. Since this is a consultancy firm, you can be shuffled around teams and some teams are better than others. It can be hard to move from a bad one because that's the nature of contracts sometimes.\n\n\nThere was a looooot of legacy code when I left, with quality running the gamut. Since you're junior, you probably won't get exposed to the really horrifying codebases. (Some of these projects need to be completely scrapped and remade--they aren't even in a refactorable state. I don't know if they've been improved or what since I left.)\n\n\nI really liked the autonomy they gave me to improve bad code as long as I could prove the changes didn't break things. But this is also team-dependent. I got moved to a team where any large refactoring required a lot of sign-off and some of the most critical code bases needed to be lit on fire.\n\n\nIt's typical corporate culture with the added \"you're just a warm body\" that comes with business models like ICF. It's not good, but it's not horrible, either. Perfectly serviceable for an early-career job.\n\n\nI had no problem getting another job after I left ICF. No raised eyebrows, no concerns, nothing. ICF has a decent reputation. With how hard it is to get your foot in the door these days, I would recommend taking the role if it's code-heavy or starts your career in the general direction you want to go.\n\n\nIf you get put on a code-light team and that's a concern for you, make plans to leave. Try to get to a code-heavy team again, but start interviewing. Hopefully that won't happen since the code-light teams were more concerned with mid-level and senior-level topics, but just stay sharp, OK?\n\n\nGood luck on starting your career!",
          "score": 3
        },
        {
          "body": "ICF is a reputable firm and experience there can be valuable, especially for a new grad. Consulting roles often provide exposure to diverse projects and technologies, which can be a great start for your career. Don't worry too much about reputations; focus on gaining solid experience and skills that you can leverage for future opportunities.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Op how did it go? I have an interview with tjem",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Job Interviewer wants me to submit an original technical white paper as part of the application process. Feels fishy.",
      "body": "[Update] Role is completely legit. I retained full control and copyrights over the paper.\n\nI am in a technical field, and I have written white papers before however I have never written them for free.\n\nThis company is similar I would say to a Accenture or a Dragos. \n\nWhat can I do to protect myself and my work? \n\nHas anyone else ever had to submit a white paper as part of a job application interview process?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1nbscdl/job_interviewer_wants_me_to_submit_an_original/",
      "comments": [
        {
          "body": "NO. Show them a sample white paper from your portfolio.\n\nThank them for the opportunity for you to provide new work, but you must be compensated. \n\nOr they can onboard you as a contract for a trial period.",
          "score": 9
        },
        {
          "body": "They’re probably not hiring at all and are fishing for free work.",
          "score": 6
        },
        {
          "body": "This does indeed seem strange to me",
          "score": 2
        }
      ]
    },
    {
      "title": "Women who left tech, when did you leave and why?",
      "body": "I don't know if this is the right sub to post this but here goes:\n\nStatistics show the following:\n\n1. Only 20% of computer science professionals are women.\n2. 50% of women abandon technology careers by the age of 35 \n3.  Women are leaving tech roles at a 45% higher rate than men \n\n *(according to data by Accenture and Girls Who Code)*\n\n  \nWhat made you leave tech and when did you do so in your career?  Did you ever regret your decision?  If you're thinking about leaving tech, what is making you consider that decision?",
      "subreddit": "cscareerquestions",
      "score": 949,
      "url": "https://reddit.com/r/cscareerquestions/comments/pxtkhg/women_who_left_tech_when_did_you_leave_and_why/",
      "comments": [
        {
          "body": "I'm 28f and leaving tech soon to go back to school. It wasn't a toxic environment for me, I love my coworkers and my company treats me great. I also don't have kids. The main reason I'm leaving is because after 6 years I've kinda realized it's not what I love to do anymore. I want a job that's more collaborative and engaging with people.",
          "score": 184
        },
        {
          "body": "My fiancée was going to school for an EE degree and she just didn't like it. She was great at it, but it just wasn't her thing. The final straw for her was her internship at Intel, where she realized how much she hated it and was just chasing a paycheck. After her intern presentation, she had a conversation with her mentor (also a woman) and her mentor told her \"I know you don't like this job and I know it's not for you, but whatever you do decide to do, make sure you're helping other people, because you are incredible at that\"\n\nSo, she became an elementary school teacher and she fucking loves it\n\nShe works way more and way harder than I do and she makes way less money, but she loves her job and she's happy, and ultimately that's what matters the most\n\n**tl;dr** My fiancée wanted to be an EE, discovered she didn't like it, became a teacher instead. Nothing to do with workplace toxicity (just in this case, I'm not suggesting that's true everywhere) or raising a family, the tech world just wasn't her cup of tea",
          "score": 88
        },
        {
          "body": "[deleted]",
          "score": 1307
        },
        {
          "body": "I haven’t left tech, but I’ve been on and off considering it. \n\nThe first time I wanted to leave, I realized I wanted to leave my environment and my team, not my field. Now, I have an awesome team, an amazing manager and I still feel myself wanting to leave at times. Tech was never a passion of mine. I wanted a high paying job  and had family pressures to go into a good career. \n\nI feel like I’ll stick around a while for a few reasons:\n\n1. I make double what my husband earns, and while we’re good with finances, losing 2/3 income would be difficult. I also feel the need to keep my own income. My mom was a SAHM, but when my dad lost his job my mom hadn’t worked since she got married 10+ years prior. My dad couldn’t find another job paying that well and we took a big financial hit. If my dad was unable to work, they would’ve been in a terrible situation with young children. I was young, but fully aware of what was happening, and I’m terrified of losing the security I have now. \n\n2. I worked so hard to get my bachelors and masters, climb up in my role, take high stress high profile projects to gain the name recognition that I feel like I can’t abandon that. \n\n3. When I do have kids, I don’t want to be defined just as a mom. I feel like I need to have something separate from family to be fulfilled. I respect the hard sacrifice of SAHM, but in my heart I’m afraid I’ll regret leaving my career. I’m also afraid of not having the financial means to have a family if I left.\n\n4. I’m in a really good team, which I feel is very rare. My manager reminds us not to go over 40 hours unless it’s an emergency, requires us to take PTO to avoid burnout, and every meeting circles back to where we want to be and what opportunities I would like. The team is super flexible, and most of my teammates are also parents, so when we do start a family I know everyone is supportive and flexible.",
          "score": 124
        },
        {
          "body": "My wife's career fits in the second bullet-point (i.e. \"50% of women abandon technology careers by the age of 35\") and the reason is plain-simple: child birth -&gt; parental leave (3 years) -&gt; reassessment of life values...",
          "score": 622
        },
        {
          "body": "I'm a woman, I don't know if I \"left tech\" but I left software engineering. Honestly, I didn't like it. It was fun at first, I love computers. But over time I had trouble finding a job that wasn't endless meetings and \"agile\" crap. Plus the awful time-consuming interviews. It's funny everyone I know hates this stuff but no one does anything about it. It's like a brain disease or something. Most of my women friends dream of leaving tech but can't find anything else that pays as well. \n\nI also really hated the tech I worked with most of the time. As someone who coded for fun before working in it, it's not always a good thing. It just means I wish I were working on my own projects and not some garbage where you have to argue with a product manager about fixing a serious security flaw. People will say \"find a better job\" but they all put on a song and dance in the interviews so it's not easy!\n\nI moved into marketing teams and work as a freelancer now. I do hobby coding and occasionally will pick up coding work if the client isn't annoying. I like to keep my skills fresh because I work in technical content. I do kind of wish I could move out of technical content because often I do encounter clients who want to force you to do weekly meetings with them.  But I have enough clients that I can say no to this.",
          "score": 39
        },
        {
          "body": "While the reasons mentioned in the comments are totally valid (child care, spending more time with family, etc.), I'm wondering if it's actually applicable to any other industry? \n\nFurthermore, CS looks like a good place for above mentioned cases - more remote work options, flexible working hours, ...\n\nSo I'd also be very curious to hear from women who left tech.",
          "score": 216
        },
        {
          "body": "I am a woman in tech and as time goes by, I am getting more and more determined that I should work hard and strive for excellence in this field. I really like working in tech, but I hate to admit that I have felt some prejudice towards me because of my gender.  I look at it as a personal attitude problem from certain individuals, not problem in tech in general because I know a plenty of woman who are greatly valued in this field. \n\nBut on the other hand, I have some other interests in career which are not connected to tech so if I ever leave this field,  the reason will be to pursue my dreams.",
          "score": 253
        }
      ]
    },
    {
      "title": "Just got rejected by the company that hires everyone.",
      "body": "Hey all!  \nThis is quite literally just a rant about the job industry right now and how I can't believe I got rejected from a company that is referred to as the \"Chinese workshop of it\".\n\nI applied to  Accentures Java software engineer boot camp, which is meant for people without experience in the field ... I went in and applied with experience and projects to show for it.\n\n  \nI went to 2 interviews, the first one was just a presentation about the company, I nailed the questions they asked me, the recruiter and I were really connecting and I even asked some questions about the company that I had written down and got good answers to.\n\nThe second interview was a group interview with other people where we had to do an English test ( which was actually ridiculously easy ) and a technical test. In the technical test I nailed all the test questions with multiple choice ( because last year when finishing my degree I studied theory 24/7 ) and then there were 3 questions that you gave free form questions. These were also easy and i nailed them. the questions were...\n\n1) Create a function that lets you input 3 numbers and return the sum of the 2 largest numbers\n\n2) Create a function that bubble sorts an array\n\n3) Give us any projects you have made\n\n&amp;#x200B;\n\nI don't want to sound like one of those people who say that they did something with 100% accuracy and actually did it with like 60%, but I really did do everything. While doing this test I even got the feeling that I am way overqualified. But yet, today I got an automated email saying \n\n\"Firstly, we would like to thank you for patience with result communication, the interest this season has been higher than ever, thus the process has taken us more time than expected.  \nWe have reviewed your test results for Java/Software engineering Bootcamp. We wish we had better news for you, but after carefully reviewing test results, we regret to inform you that you have not qualified for a place in Accenture Bootcamp.\"\n\n&amp;#x200B;\n\nI actually have no idea what to do. I am currently working an IT job on a temporary 6 month contract that ends in a week. I have been applying to jobs left and right since last June and feel like the options and time are running out..\n\n Thank you for listening to my unstructured rant that I am writing 5 minutes after getting rejected by most peoples safety net job.",
      "subreddit": "cscareerquestions",
      "score": 335,
      "url": "https://reddit.com/r/cscareerquestions/comments/1begqge/just_got_rejected_by_the_company_that_hires/",
      "comments": [
        {
          "body": "Mate, if you think Accentur hires everyone, you are wrong as fuck.",
          "score": 853
        },
        {
          "body": "Accenture didn’t even reply to my three job applications. I thought I really sucked. Three months later I got hired in big tech",
          "score": 111
        },
        {
          "body": "Have you considered that you were considered over qualified for the program? Why hire someone for a no experience needed program if they have a bunch of experience. My bet is that they thought once you got a bit of job experience you would be straight out to a better opportunity which is most likely the case.",
          "score": 299
        },
        {
          "body": "Got an update from the recruiter. I did fantastic with a 100% on the English test and 98% on the java technical test .... my only mistake on java technical test, and I joke you not... they said that I put the curly brackets on a new line, but in accenture they prefer them to be on the same line as the function... WHAT?!?!?!?",
          "score": 237
        }
      ]
    },
    {
      "title": "Accenture just called me for a video-call interview which is in two hours from now. Help.",
      "body": "This is my first job after getting my CS degree. I know very little about the company. Can someone give me an idea about what ware they going to ask me? I don't have a lot of experiance.\n\nI live in Saudi Arabia and the office is going to be there.",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/372mg3/accenture_just_called_me_for_a_videocall/",
      "comments": [
        {
          "body": "Look on glassdoor.",
          "score": 5
        },
        {
          "body": "Wear pants.",
          "score": 6
        },
        {
          "body": "How did it go? ",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview Process",
      "body": "Hi All,\n\nI attended an interview for the Application Developer role {Accenture} on 27th September, and I noticed that the status in Workday still shows as \"Interview.\" Could you please let me know when I can expect to hear back regarding the outcome? Also, I’m curious if any other candidates who interviewed on the same day have received further updates.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1od4p81/interview_process/",
      "comments": []
    },
    {
      "title": "Interview in Accenture: Business and Systems Integration (Analyst). How to prepare?",
      "body": "\n\nHey All, \nI am a fresh CS graduate and I was called in for an interview by Accenture for the above mentioned position. The job description attached was quite vague and other than reading up on the company and its products/services as well as go through some tips on how to give good interviews I am unsure on how I should prepare. \n\nWhat should i be doing to prepare for my interview in 3 days? \n\nAny advice would be appreciated. Thanks :) \n\nEdit 1: I should also mention that I had a really brief phone interview with them and it was mentioned that the job is a customer facing one.\n\nI read somewhere that it's better for CS graduates to take something that can be presented like a project or something of the sort. Unfortunately, other than the projects I did in coursework(most of them group work) i don't have anything to show.  This worries me because it makes me feel like I'm behind the competition even before it's started. What can I do to stand out and be considered as a serious candidate?\n\nAll feedback and advice is greatly appreciated. Long live.  ",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/2rmxh3/interview_in_accenture_business_and_systems/",
      "comments": []
    },
    {
      "title": "I currently work at Accenture as a service now developer how difficult  would it from me to switch to a FAANGS company",
      "body": "So i have been studying data structures for a bit now and i am ready to study what ever i need to for these companies. But at times i have some self doubt regarding if its even possible ? What if i study all this and don't even get selected for the interview process ?  \nOther info-  \n1. I have a masters degree in computer science.  \n2. in a few months i will have 3 years of experience as a developer at Accenture.\n\nThank you for you answers!!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1k609bs/i_currently_work_at_accenture_as_a_service_now/",
      "comments": [
        {
          "body": "About as easy as it would be for me to start a glass blowing side hustle. \n\nI know the theory and some of the techniques, just gotta do the work. ",
          "score": 13
        },
        {
          "body": "Very difficult",
          "score": 6
        },
        {
          "body": "Depends if you’re actually good or not. Accenture, like all consulting firms, there is a vast difference in quality person to person.\n\nGet a referral and prep hard",
          "score": 5
        },
        {
          "body": "Essentially impossible to do directly, even in a better market.\n\nYou'll need to jump to a lower-tier company working as a generalist (non-app-specialized) software engineer for a couple of years to be considered, and probably also get out of the consulting ghetto.\n\nIn theory you still could, but in practice, everyone is cherry-picking the candidates who are the closest to unicorns for their immediate needs.  \n\nEven if you can get hired as a generalist software developer somewhere else there is no clear amount ofseniority that will get top tier BigTech or even extended BigTech companies.\n\nWork on moving to a generalist role in Accenture.\n\nWhile doing so, apply to a very broad bunch of companies to jump to a generalist role.\n\nHope that the overall market improves by the time you are in a a generalist role at a smaller company for a while.",
          "score": 5
        },
        {
          "body": "hard cause theyre firing primarily rather than hiring",
          "score": 4
        },
        {
          "body": "I mean Amazon sends out technical assessments like candy. \n\nI’m a SN dev and got them sent a couple times recently. \n\nI know DSA but def not to that level so didn’t even bother so I’d say it’s at least possible to get a look. Passing the technical is the hardest part",
          "score": 3
        },
        {
          "body": "If you're good it's easier, if you're not... it's harder.",
          "score": 2
        },
        {
          "body": "Right now? About impossible due to climate/market.",
          "score": 2
        },
        {
          "body": "I believe that working from Accenture has value (I mean that's how I got bombarded with job offers from LinkedIn), but it means virtually *nothing* when your aim is a FAANG; the reason being that Accenture, like many other consultancy companies, often doesn't even do technical interview to hire people; there is no guarantee (or even a good chance) that an Accenture employee is going to be decent, regardless of how long that employee has been in Accenture and regardless of what he was doing in there.\n\nAnd I say this as someone who has left the company just a couple weeks switching to a new job, for every great and knowledgeable person there is, there are 20 (if not more) incompetent idiots; the clients know, but the alternatives are simply just as bad; and therefore FAANG head hunters know this too.\n\nThe only thing you can do is study and study hard, \"data structures for a bit\" is a start, but far from FAANG requirements. Consider that it's not just about what the FAANG wants, but about the sheer amount of people applying and the knowledge they have.\n\nThere are guides to get into a FAANG, the most known one being \"Cracking the Code Interview\", which is essentially a collection of topics that a developer should know, it's probably a good start, I myself have to go through it.\n\nI have also heard that open source contributions to large projects can be fairly valuable, just like self made large projects can be.\n\nOne thing's for sure, now it's not exactly the best part to look at being hired at a FAANG.",
          "score": 2
        }
      ]
    },
    {
      "title": "Post on my journey as a CS major",
      "body": "Graduated as a CS major in 2016. Bachelors of course. \n\nFailed many interviews. Finally got a job as a test engineer at Accenture in 2016. Pay was low but worked at one for 3 years. Eventually made it to 26 bucks an hour. In Texas. Took a hiatus and moved to Japan and worked there for 2 years.\n\nCame back to the states and got a job as a software developer for 31 an hour. 2.5 years there until got fired after a PIP plan. \n\nI was depressed for quite a while. Next job at 44 an hour for the VA. Still there. Anything is possible. \n\nNever give up.",
      "subreddit": "cscareerquestions",
      "score": 29,
      "url": "https://reddit.com/r/cscareerquestions/comments/16zsgp3/post_on_my_journey_as_a_cs_major/",
      "comments": [
        {
          "body": "If you find yourself in a difficult place in your life, we urge you to reach out to friends, family, and mental health professionals. Please check out the resources over at /r/depression, /r/anxiety, and /r/suicidewatch. Feel free to [contact the /r/CSCareerQuestions mods](https://www.reddit.com/message/compose?to=%2Fr%2Fcscareerquestions&amp;subject=&amp;message=) for more information or help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Amazing grit. Congrats on your (continuing) success!",
          "score": 4
        },
        {
          "body": "You can always count on low performers to be optimistic",
          "score": -20
        },
        {
          "body": "Just interviewed at lockheed for a testing position.\n\nI'm trying, but getting that experience is freaking ridiculous.",
          "score": 1
        }
      ]
    },
    {
      "title": "Suspect Offer - what to do?",
      "body": "Hello,\n\nToday I received an offer from Accenture (I've read many opinions about Accenture and am still thinking about them but this post is about something else) and the entire process has been kind of sketchy/giving red flags. I wanted to post and see what others thought about it.\n\nFirst, there was no live interview. Everything was done in a really long Online Assessment where I basically wrote down answers to interview questions about my experience and past. I didn't get to ask anything about what the company or job is like and essentially just have to read the job description, or read reviews online. Second, there have been punctuation/capitalization mistakes throughout the all the emails sent to me. I found this really strange and it was enough to turn me away from the company until I got the offer. Third, I have been in contact with a recruiter who I wasn't able to find on LinkedIn. The recruiter is also emailing from a non-company email, just a standard gmail account.\n\nThey haven't asked for any sus information such as SSN or Bank Account Number, and in the final offer email it did seem more formal but the whole process was still strange. Please let me know what you guys think and whether you guys agree with my thoughts. Thanks in advance.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/14uec1l/suspect_offer_what_to_do/",
      "comments": [
        {
          "body": "A recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface .\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n&amp;#x200B;\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of r/reddit.com, who are the admins of the site: message [/u/reddit](https://www.reddit.com/u/reddit/): submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on [r/reddit](https://www.reddit.com/r/reddit/), such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at [r/ModCoord](https://www.reddit.com/r/ModCoord/) \\- but please don't pester mods you *don't* know by simply spamming their modmail.\n3. **Boycott** ***and*** **spread the word...to Reddit's competition!** Stay off Reddit as much as you can, instead, take to your favorite *non*\\-Reddit platform of choice and make some noise in support! \n\nhttps://discord.gg/cscareerhub\n\nhttps://programming.dev\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Definitely scam. There’s no reason for any of this to happen. Interviews should always be live. Emails should rarely have grammar issues. \n\nAnd most importantly no one would use a gmail account for work. \n\nI’ll bet they’ll hire you. Then send you a check to use to buy home office equipment. They’ll tell you to cash the check, buy the equipment, then send the remaining balance back to them. \n\nYou’ll find out a few days later that the check was fake and you’re now on the hook for the full amount.",
          "score": 18
        },
        {
          "body": "There is no way accenture would hire you without taking to you. 100% a scam. if you dont do zooms, etc... its 100% a scam.",
          "score": 4
        },
        {
          "body": "100% scam. You can always try emailing or calling Accenture HR on the official site to confirm though.",
          "score": 3
        },
        {
          "body": "This is a scam. I had someone try to run this on me. Challenge them. Ask them (nicely and professionally) to email you from their Accenture account not a gmail.",
          "score": 2
        },
        {
          "body": "Being contacted with a non-company email is 100% a scam. I think you might be searching for reasons why this isn’t a scam, but it definitely is.\n\nReceiving recruiter emails from a non-company domain is like going to a website without the company domain name in the url and expecting it to be the company’s legit website.",
          "score": 2
        },
        {
          "body": "If you can't verify the 'recruiter's domain then it's a scam. anything gmail outlook yahoo etc is a scam. You should know better being in this sub. If you really fall for it then you deserve it. You're a liability if you're a swe that fall for such obvious scam.\n\nExcept microsoft, their 3rd party recruiter icims email are so fucking sussy, but it's legit. The recruiter are shitty too so it fit.",
          "score": 3
        },
        {
          "body": "Sounds very scammy... Just to make sure, maybe worth reaching out to Accenture HR to make sure?",
          "score": 1
        },
        {
          "body": "scam\n/r/cscareerquestions/comments/14szflb/daily_chat_thread_july_07_2023/jr1m9mw/",
          "score": 1
        },
        {
          "body": "Definitely scam",
          "score": 1
        }
      ]
    },
    {
      "title": "mthree training program with guaranteed position at JPMC to start in January?",
      "body": "Hello! \n\n&amp;#x200B;\n\nI graduated in May, and was just reached out to by a recruiter at mthree saying that they are \"on the lookout for ambitious 2020 graduates to join \\[their\\] Alumni Graduate Program, kick-starting \\[my\\] tech career within an entry-level Java Development role with JP Morgan Chase in Jersey City\". \n\n&amp;#x200B;\n\nIt says that JPMC will interview me first before I start training with them (mthree I assume), and that \"should I be successful\" in my interview process (I think), I'll have a \"guaranteed job at the end of it at JPMC.\n\n&amp;#x200B;\n\nI've read that mthree is similar to companies like Revature, and I don't want to end up stuck in a 2 year contract doing temp jobs.\n\n&amp;#x200B;\n\nWhat do you think?\n\n&amp;#x200B;\n\nThanks!\n\n&amp;#x200B;\n\nPS: I already have a signed offer with Accenture, but being a SE at JPMC is more interesting for me. I'm just worried that I'll start this \"training program\" and end up stuck there, and not at JPMC.",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/jyd7ck/mthree_training_program_with_guaranteed_position/",
      "comments": [
        {
          "body": "Why not just apply to JPM directly? If you can pass the interview, you’ll have a job no problem.",
          "score": 8
        },
        {
          "body": "Hi, I’m not familiar with mthree but it sounds like another contracting firm effectively. If this is one of the normal JPMC new hire roles then it’ll be a normal job you can leave whenever. However, it sounds like you’ll be working within JPMC through M3 as a contractor. In that case, I’m not really sure what the “contract” entails. \nI’ve worked with a couple contractors before and sometimes they’re contractors for hire and end up being able to stay, but depending on the contract it sounds like some of them are on a year-by-year basis. Might not be what you’re looking for if you want a more steady full time job without contracts this might not be what you’re looking for",
          "score": 3
        },
        {
          "body": "I’d avoid if I can, they’d pimp you out at a high rate and only have a contract for as long as things go well.\nClient might dump them because of price or various other reasons.\nTry and get direct first or manage on your own and as last resort look at that type of arangements.",
          "score": 2
        },
        {
          "body": "Did you get their assessment with a bunch of ridiculous non-coding problems?",
          "score": 2
        }
      ]
    },
    {
      "title": "Received 2 Job Offers",
      "body": "Hello, I graduated 5 months ago and recently received two job offers and I am having a really hard time deciding between them.\n\n&amp;#x200B;\n\n**Small Web Development Company**\n\nWeb Developer Position\n\nNew company, started about a year ago\n\nIt is nearby home so I could continue to live with my parents (Arizona)\n\nThere are about 10 people in the company, 3 developers\n\nI've met all the people, they are all super nice and the developers are excited to train me\n\nThey build custom WordPress templates and build the sites from that template for their clients\n\n9-5 job, seems relaxed, everyone is young and I feel they would treat me really well\n\nMostly focused on Front-end development\n\n– PHP– CSS / SASS– Javascript– Gulp– Webpack– WordPress\n\n35k/year, 14 days PTO, Paid Holidays off, basic health benefits\n\nI have until Thursday to respond (2 days)\n\nI also have an interview with a 3rd company on Friday which I did not mention. I asked if they could give me one week but they said they really need an answer by the end of the week Thursday.\n\n&amp;#x200B;\n\n**InfoSys Consulting Company**\n\nAssociate Software Engineer Position\n\nReally large multinational company, seems like there is mostly Indian workers according to Reddit?\n\nThey are giving me location preference on where I would like to work (anywhere in the U.S.) but I have read stories about how they may just put you wherever they want/need you after you finish training.\n\nSuggestions for places to live?\n\n2 months training\n\nUnsure of what technologies I'll be trained on / what client or projects I'll be working on\n\nMy vacations and schedule will probably be determined by clients\n\nI've read a lot of bad stuff about them here on Reddit\n\n57k/year, 4k signing bonus, and I can't remember but I think it's 10 PTO, basic health benefits.\n\nThe pay will be the same regardless of where I choose in the U.S.\n\nI don't have the official offer letter yet because I haven't told them where I would like to work since relocation assistance is based on where I want to go. Once I give them my location they will send me the official offer.\n\nI have 2 weeks after I receive the e-mail to accept.\n\n&amp;#x200B;\n\nI'm really torn between them so any advice/thoughts would be appreciated.",
      "subreddit": "cscareerquestions",
      "score": 15,
      "url": "https://reddit.com/r/cscareerquestions/comments/9qx2dt/received_2_job_offers/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 28
        },
        {
          "body": "Shit $35,000 a year? Lol that's pretty much working at McDonald's money scratching your ass all day. If you have a CS degree that's beyond ridiculous",
          "score": 19
        },
        {
          "body": "I would recommend against InfoSys though.",
          "score": 7
        },
        {
          "body": "What are your career goals and what are you interested in? That should help you decide.\n\nLike others have said $35k in the AZ market is crazy low. For your first gig it's important to grt a competitive rate as it sets you up for future jobs. If you start off lower then market rate for your years of exeand skill set, it's really hard to get out from under that.\n\nIf you want to stay in AZ, the market is really good right now in the Phoenix area. Keep looking at companies there. ",
          "score": 7
        },
        {
          "body": "Congratulations on the two offers.\n\nThe gap in salary is a heck of a lot. I would agree that $35K/yr in Arizona while living with your parents is financially better than $57K/yr renting a shared apartment with roommates in, say, San Jose. If Infosys can place you in an area with a low cost-of-living / no state income tax, then I think it is almost unquestionably the better option.\n\nYou can grind out your first year and use the experience as a springboard in to your next job.",
          "score": 12
        },
        {
          "body": "FWIW - I am in Phoenix and am making 85k to do web development. First job. The first company is full on shit-tier pay.",
          "score": 5
        },
        {
          "body": "I would lean towards company 1 to be honest. If they are willing to train you and seem nice so far, it will be a smoother start into your career. Also, if the company grows in future, with only 10 people there may be opportunities for you to assume a leading role, if the company hires more employees.  \n\n\nAlso, as far as I can read from your post, you have a good gut feeling about company 1, but you don't have a good feeling about company 2. This is an indicator I use most of the time. When I get a bad feeling about a company during the interview or prior to that, I don't continue with them. This has been a good strategy so far, mostly for when it's time to leave a company since I got validation from former coworkers that things started to go really bad once I was gone, but so far I think that I also made the right choices for being hired.  \nSo you should go with your gut feeling and take the job with company 1. Maybe you can negotiate a raise after a year or so, or apply for another better paying job.",
          "score": 5
        }
      ]
    },
    {
      "title": "Which internships do you know of? Compiling Summer of 2015 Internship List",
      "body": "Loved [this idea](http://www.reddit.com/r/cscareerquestions/comments/2gi4zv/is_there_currently_or_could_we_somehow_compile_a/) from yesterday's thread on CS internships, so I started working on a **list of summer 2015 computer science internships.** \n\nSubmit **[companies and their program deadlines here](https://docs.google.com/forms/d/1KsJJGivuep_bubEYUX-QeCT8qq0to5Ju2BPpRnnkh4o/viewform?usp=send_form)**^1:\n\nhttps://docs.google.com/forms/d/1KsJJGivuep_bubEYUX-QeCT8qq0to5Ju2BPpRnnkh4o/viewform\n\nWhen there are a solid handful of responses I'll clean it up and post it. If you're feeling extra lazy and would like to just hear when the list is done, [sign up here](https://docs.google.com/forms/d/1-NRdrJtxG_HbRZ-5UNoP7G7TLJmtIBjxLy1G8mVIA2M/viewform?usp=send_form) and I'll notify you when it's ready.\n\n*[1]: As a thanks to submitters of more than 5 internships, I'll send a copy of the [Coding for Interviews](http://codingforinterviews.com) archive to help prepare for interviews this year.*\n\n----\n\nIf you're looking to submit more items, here's a quick list of the companies already submitted:\n\n```\nAccenture\nAdobe\nAkamai\nAmazon\nApple\nBloomberg\nBox\nCerner \nCoursera\nDropbox\nEA\neBay\nEvernote\nFacebook\nFast Enterprises\nGoDaddy\nGoogle\nIBM\nIndieGoGo\nIntel\nIntuit\nKhan Academy\nKoch Industries\nMicrosoft\nMozilla\nOSIsoftq\nPalantir\nPinterest\nQuora\nSpaceX\nSquare\nState Farm Insurance\nStripe\nSynapse Product Development\nTexas Instruments\nTwitch.tv\nTwitter\nVMware\nYelp\nZappos\n```",
      "subreddit": "cscareerquestions",
      "score": 62,
      "url": "https://reddit.com/r/cscareerquestions/comments/2gkdic/which_internships_do_you_know_of_compiling_summer/",
      "comments": [
        {
          "body": "I posted a few I was able to find including one I'm in the process of applying for (Microsoft). Hopefully more people contribute to help make this a solid list!",
          "score": 3
        },
        {
          "body": "I'd love to contribute, but I don't really know if the programs I submit have already been submitted.",
          "score": 3
        },
        {
          "body": "Thanks for compiling this list! I submitted 5 companies.",
          "score": 3
        },
        {
          "body": "Would you like this to be US only or shall I send in some UK opportunities?",
          "score": 3
        },
        {
          "body": "If you list your name and email will that be listed, should we put the position contact or what? I see it's optional, just don't know if that type of stuff would be helpful.",
          "score": 2
        },
        {
          "body": "Is there an estimate on when this list will come out? ",
          "score": 2
        }
      ]
    },
    {
      "title": "What will it be? Accenture? What does consulting mean",
      "body": "Hello,\n\nI kind of walked away from coding/programming for 4 months. After graduating from college with a BS in Comp sci, i did not want to see a line of code again. I struggled in University(I am well aware of that thread that says if you struggle so hard in this field maybe you should not be in it. But for now i am stuck in it). I slowly got back into it with learning some react on free code camp and Udemy. I am currently working on a personal project(only one i have of substance). It just basically involves React + node. Getting data from Spotify's API and rendering the data. I am hosting it on Heroku.\n\nThe reason why I am here: \n\nSo I am getting pressure from my parents to GET A JOB. I applied to Accenture a few months ago and got an email back from a recruiter at Accenture saying he will like a 15 minute phone call with me. The position is Accenture Entry Level Technology Associate for a role in their Cloud Innovation Center. I realize I am jumping the gun here considering the fact that I have not even had the phone call with the recruiter yet. I looked at the job requirements and:\n\n \"Interned at work OR at school with programming languages (Java, Perl, Python, Ruby) \"\n\nis there\n\nI haven't worked with Java since the fall semester of 2018(it was intense). I have not worked with the rest ever. I have not touched Leetcode since i got back into coding. I am going to try and scramble in as much as i can of it before the phone call. The past few months has just been me struggling with building my project and the hair pulling it entailed. Does anybody know what a phone call with an Accenture recruiter is like? What are they going to ask me? OOP questions? \n\nI keep seeing things about how Accenture is bad. One thing I am confused about is that most people say Accenture is mostly consulting and you should not waste your time doing that but should focus on getting into an SWE job(i will take anything i can at this point it doesn't matter to me) but what does consulting entail vs SWE?",
      "subreddit": "cscareerquestions",
      "score": 41,
      "url": "https://reddit.com/r/cscareerquestions/comments/f77m61/what_will_it_be_accenture_what_does_consulting/",
      "comments": [
        {
          "body": "The phone call screen is usually very non technical. It is just to assess if you:\n\nAre interested in the job.\nYou are a feasible hire. You have the qualifications and work permits.\n\nTo tell you about the position. \n\nAnd maybe a little bit about college and your projects and why you're interested in the company.\n\nThere may be also some HR STar questions which you need to prepare. \n\nTbh I really enjoy phone screens they are usually relaxed and fun.\n\nWhatever you do don't ask them what consulting is. I blew an interview that way in the beginning.",
          "score": 32
        },
        {
          "body": "Accenture is alright. Not the best consulting firm but far from the worst. You’ll be fine having them as a stepping stone.",
          "score": 31
        },
        {
          "body": "Don't worry about it.  \nMost job requirements are actually more flexible than most people realize.\n\nI once saw an ad for the company and job I was currently working.  I read the job requirements and I couldn't meet many of them....yet there I was working that same job and doing quite well according to my boss and performance reviews.  haha   so don't worry about what they say.....just be honest in the interview.\n\nAccenture isn't bad.  But they will work the dog piss out of you.\n\nThe times we've hired them, most people travel in on Monday, arriving after lunch and get right to work.  I heard they have team meetings at 10 or 11pm in the hotel and then it's up by 6am with the first meeting at 7am.  They do this through noon on Thursday when they all flew out again.  Friday was in their home cities and was generally 8-5 with weekends off....but most managers were working over the weekends.\n\nIt's busy and intense but you get exposed to a LOT and the pay is outstanding.  And you'll make an amazing number of contacts and have some really cool experiences if you can hang.  \n\nIf I were just starting out, I would fucking totally do it and I'd give everything I had to that job.  It's one place that if you can make it to the 5 year mark, you'll have some seriously solid experience that many companies will pay big bucks for.  So you sacrifice a few years in your late 20s or early 30s so you can find a better job, make bank and not have to travel nearly as much.",
          "score": 30
        },
        {
          "body": "Consulting means that you are employer of company A but works for projects of company B. Nothing inherently bad about that, but with companies like Accenture you may not get placed on roles that are actually SDE.",
          "score": 8
        },
        {
          "body": "I work for Accenture. Honestly people's experience in the firm varies tremendously based on what project they are on. A lot of times people will get stuck on shitty projects (outdated tech or death marches). Other times they'll get on cooler and more interesting projects. \n\nYour ability to get on the cool projects is largely based on your ability to network and sell yourself to Senior Managers/Managers at different projects. If you're not good at that, then a consulting firm can be a bit risky cause after you get hired you'll have a few months to get onto a project. If you have hard time networking your way onto a project then you might get pushed into a boring project (i.e. test automation).\n\nAlso try to shoot for analyst rather than associate. Associates get paid crap.",
          "score": 6
        },
        {
          "body": "I just interviewed with Accenture Technology and the nice this was they did not ask me any coding questions.\n\nI would recommend having good responses for \"Why Accenture,\" \"Why Consulting,\" and \"What do you think a consultant does?\"\n\nThe final round also consists of a case study question so check out some case study books so you can be super prepared for that.",
          "score": 10
        }
      ]
    },
    {
      "title": "Feeling discouraged after rejections",
      "body": "Hi guys, I would love for anyone to give me some advice here. In the past, every internship interview I've had I've done well on and got offers from. However, I didn't get a return offer this past summer from my internship and am graduating this May. I've had multiple interviews this year, with companies like Accenture, Chevron, Comcast, and others and haven't gotten a single offer. I feel super discouraged and my confidence in my interview skills has taken a huge blow. I really don't know what to do, I feel as if I'm doing the same thing as I did in my internship interviews where I was able to get offers. Any help and advice would be great.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/193fr8b/feeling_discouraged_after_rejections/",
      "comments": [
        {
          "body": "It genuinely isn’t you, it’s the market, and the answer is to keep going and keep networking. These new grads are probably the most qualified (and overqualified) I’ve ever seen in terms of credentials and I know quite a few in a similar position as you. If I was graduating this year vs 2018, I wouldn’t have stood a chance. The only thing you can do is keep trying and don’t let the negativity get to you too much (get off this sub if you need to) and to remember this is a season.",
          "score": 6
        },
        {
          "body": "Its a number game, a harder one because of the current market, but still. Keep applying, you’ll get an offer eventually",
          "score": 1
        }
      ]
    },
    {
      "title": "What is TCS (Tata Consultancy Services) recruitment process like in the U.S",
      "body": "So I recently applied for a job on LinkedIn through a TCS job posting. I'm just a little concerned as to how the process works, what websites they make you go to and what the offer letter looks like. I received emails from like 3 different people and had to navigate between [nextstep.tcs.com/campus/us](https://nextstep.tcs.com/camus/us) and [campuscommune.tcs.com](https://campuscommune.tcs.com). If anyone has any experience with this company and their U.S hiring process I would be greatly appreciative.",
      "subreddit": "cscareerquestions",
      "score": 17,
      "url": "https://reddit.com/r/cscareerquestions/comments/i19hpj/what_is_tcs_tata_consultancy_services_recruitment/",
      "comments": [
        {
          "body": "1) Check pulse.\n\n2) Get hired!",
          "score": 38
        },
        {
          "body": "Look up WITCH companies here and on Google. These are not the type of companies you want to be looking for unless you are extremely desperate. These are body shops that throw warm bodies at client problems and then dispose of them.",
          "score": 22
        },
        {
          "body": "Step 1: Phone screen\n\nStep 2: Technical/Managerial Interview\n\nStep 3: Fill out a form with your info(education,relocation preference,references, etc)\n\nStep 4: HR interview\n\nStep 5: Offer",
          "score": 11
        },
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "I would definitely recommend to not join TCS, even during these times. There are way better companies still hiring. I got an offer from them, but then rejected it because of all the red flags that led to it. For example; texting me at 12am, calling me without notice, linkedin messages from random TCS employees, and telling me to facetime the recruiter out of no where... I hated every single \"interview\" given.",
          "score": 4
        }
      ]
    },
    {
      "title": "Accenture",
      "body": "Is working for accenture really that bad? they seem to get dunked on quite a bit here. My final interview is soon and tbh they are my best chance at a getting a job. I just need experience and I will take what I can get",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/vp3fpf/accenture/",
      "comments": [
        {
          "body": "Accenture is fine, especially if you have no other offers\n\nPeople dunk on them because it’s tech consulting and they pay relatively low. It’s a good stepping stone regardless",
          "score": 28
        },
        {
          "body": "Accenture is not great compared to the big tech obsession over here. Still a pretty decent place and there is nothing wrong with starting your career wherever you can.",
          "score": 8
        },
        {
          "body": "Consulting firms, also known as contract slave farms, have a pretty dicey reputation for a reason. That said, Accenture is one of the few that isnt consider to be complete dogshit.\n\nIf you're just trying to get into tech or dont have much experience yet, or just having trouble standing above the competition for full-time roles in general, go ahead and do it. Just know that you won't have much control career-wise for a while.",
          "score": 6
        },
        {
          "body": "Shit pay but good for getting your foot in the door. Honestly, don't be one of those morons who expects like $120k for your first fucking job straight outta college. Just understand that you gotta start low somewhere and build your way up.",
          "score": 5
        },
        {
          "body": "You will learn a lot, don't sweat it too much. If you don't like it for whatever reason you can still keep looking but remember, so take the job, try to enjoy it and if this is your first job congratulations!",
          "score": 3
        },
        {
          "body": "Also beware, these consulting firms like to offer a sign-on bonus, but it's usually contingent on staying with the company for some minimum amount of time (maybe 12 months). So if you decide to leave the company early, you may be required to pay back that sign on bonus. Read your contracts and make sure you're okay with the terms.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Got an offer with a way higher salary than what I'm currently earning, hesitant to accept the offer because of the following reasons.",
      "body": " So I applied last May as a software developer and I got accepted which is where I'm currently at right now, the work culture is great, the people are nice and my boss is the best leader that I've ever worked with.\n\nBut I recently got an interview request which is quite late since I've sent that application almost a year ago, but I still tried my luck.\n\nThe interview turned out good and I received an offer yesterday (Accenture), for which I would give them the decision by tomorrow.\n\nThe pay is almost double compared to what I'm currently earning in my present company, but I'm too hesitant to leave due to many uncertainties, plus my current company and my co-workers trained me for at least 6 months before I can work without supervision and to leave them after just less than a year seems isn't a good gesture. And that I'm currently afraid that the new culture , workload that I will be going into isn't gonna be good.\n\nI'm a breadwinner so I really need a good compensation if it's not the case , I really wanna stay on my company right now because they have the best people.\n\nAny thoughts that I should consider ? because I can't sleep right now thinking about all this.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/mu2eto/got_an_offer_with_a_way_higher_salary_than_what/",
      "comments": [
        {
          "body": "Your company will let you go one day when it suits them.  Don’t show undue loyalty.  I personally would take care of my family and double the salary.  If you decide to go that route, I doubt they would judge you for pursuing that level of financial security.",
          "score": 38
        },
        {
          "body": "[deleted]",
          "score": 16
        },
        {
          "body": "If you got hit by a bus tomorrow, your company would send your next of kin flowers, offer “thoughts and prayers”, have an open req out before your body got cold and forget you ever existed within a month besides when your name shows up in a “git blame”.  You owe no loyalty to a company.",
          "score": 11
        },
        {
          "body": "I feel like most of the replies here glossed over the fact that it’s Accenture. Just how low are you making right now that they were able to give you double? It’s an interesting decision for sure, I’d think twice about the culture there. \n\nIMO if the growth and learning potential at your current place is pretty good, you’re not in need of immediate money, and it’s your first job, I’d ride it out for a year at least just so I wouldn’t have to work at Accenture. You can easily double your salary at a much better place later on anyways, all the while keeping your sanity.",
          "score": 8
        },
        {
          "body": "&gt;plus my current company and my co-workers trained me for at least 6 months before I can work without supervision and to leave them after just less than a year seems isn't a good gesture\n\nYou shouldn't concern yourself with this. The company isn't some scorned ex who is going to Facebook stalk your new company. They'll forget about you in short order.",
          "score": 8
        },
        {
          "body": "[deleted]",
          "score": 4
        }
      ]
    },
    {
      "title": "Fired from first software engineer job, can't find anything else",
      "body": "I graduated college in December 2014 with a BS in Computer Science. I interviewed with a lot of companies in early 2015, I was even lucky to fly out to Google in March and interview at San Bruno. I did good at all four interviews, but they told me I needed more experience and would be glad to have me back in 2016. I ended up narrowing my choices down to IBM or Accenture... I chose Accenture, since IBM would take me to Texas. This ended up being the worst decision of my life.\n\nAccenture put me on the bench as soon as I started. They told me they were anticipating demand and I would soon get on a role. Well, four months go by with nothing, and finally I get notified I'm being let go because there just wasn't any projects to put me on. \n\nSo now I'm desperate and trying everything I can, even e-mailing my IBM recruiter. All I seem to be getting so far is recruitment spam from India - they keep offering me outlandish salaries (over 100,000 without even interviewing me) but fall short of mentioning which client they're hiring for. One of them wants me to go to an interview on Saturday, but I've never heard of a weekend interview and they haven't even told me what client it is or what I'd be doing. I just don't trust any of this.\n\nOther than that, I'm getting little to no responses from other companies. I've tried applying to any \"new graduate\" positions I can find at some companies, I've scoured through dice.com and monster.com, even craigslist. I feel like such an idiot for not taking the IBM offer, but here I am and I'm just not sure what to do. My student loans and other bills are piling up, and Accenture more or less wasted the past four months of my life. \n\nShould I try to go back to school for a master's degree? Should I try some bootcamp like App Academy? My friend from college went through App Academy and is now working as a contractor for Google, but I don't have the deposit money for App Academy nor can I just take three months off with my financial situation as is. \n\nI think I'm having such a hard time finding something else because I have this four month employment at Accenture with little to show for it - recruiters might be wondering why I was fired after such a short time. Thing is, I'm eligible for re-hire at Accenture because I was let go through no fault of my own, but I don't know if I would ever want to work for Accenture again after what I went through. \n\nGuess I'm not sure what I'm suppose to do at this point. Any advice is appreciated. Thank you",
      "subreddit": "cscareerquestions",
      "score": 37,
      "url": "https://reddit.com/r/cscareerquestions/comments/3nq0jb/fired_from_first_software_engineer_job_cant_find/",
      "comments": [
        {
          "body": "You were not fired, you were laid off.\n\nThere is a tremendous difference between the two.\n\nNo advice for you because I'm not sure what the recent grad market looks like, but you definitely weren't fired.",
          "score": 93
        },
        {
          "body": "Okay, so India actually handles a lot of IBM recruiting stuff. I know from experience that I was contacted by IBM India when they hired me for my internship. \n\nI would literally go on IBM's website and just apply to the positions. I'm not sure where exactly you want to work, but IBM has locations all over the country. \n\nDon't limit yourself to NEW GRAD positions. Just apply to literally everything. ",
          "score": 9
        },
        {
          "body": "- LinkedIn, and place C# and Java keywords on your profile, and the recruiters will come to you.\n- Does your university have any resources? Mine has its own job portal for students and alumni. Also is there a career development dept? they can look at your resume, or help you look.\n- Can you do freelance in the mean time?\n- How willing are you to relocate? Don't restrict yourself unless you are truly tied down, you never know what adventure lies in another city.",
          "score": 6
        },
        {
          "body": "[deleted]",
          "score": 7
        },
        {
          "body": "What did you do during those four months? Did you build stuff on your own spare time?",
          "score": 5
        }
      ]
    },
    {
      "title": "Advice on job offer from TCS",
      "body": "I've been working at a remote IT helpdesk for a few months (5 months) and applying to SE jobs on the side, as I now have an interest in working in development. I don't have a CS degree but a bachelors in IT. And only gotten an offer from TCS. \n\nI don't really feel like I've been learning very much from my helpdesk position and was wondering if TCS is any better. At least the pay is better, my current salary is \\~40k, while TCS pays around \\~60k. However, from what I've heard from this subreddit, it seems like the work experience is awful. I also heard that they could ghost me after accepting the offer. \n\nShould I take the offer and possible make the decision to continue? Also will they blacklist me after I take the offer and decide to go back on it?",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/mfqzqj/advice_on_job_offer_from_tcs/",
      "comments": [
        {
          "body": "You can take it as a stepping stone for something else in the future :)",
          "score": 3
        },
        {
          "body": "Lol I got ghosted. I even did a second first round interview. If you get the job and it’s better than what you are doing now, take it.",
          "score": 2
        },
        {
          "body": "Have you meet the manager/CEO as part of the interview proccess? You can tell what the work culture is like by speaking with them. If they are fun and chill half of the time while remaining professional, it is a good sign. If they happened to be nasscistic and the atmosphere is intimidating, then probably avoid.\n\nMoney wise, I would totally take the 60k over the 40k.",
          "score": -2
        },
        {
          "body": "stepping stone for you since you dont have a CS degree and are in help desk atm.\n\ntake it try your best to learn try to get a good project leave 1-2 years :)",
          "score": 1
        }
      ]
    },
    {
      "title": "I applied to over 80 positions within the month of August as a self taught software developer. Here are the results.",
      "body": "As you can see I mainly focused on Python roles. As of today(September 9th) none of the applied positions have gotten back to me while most of the rejections are due to not having a security clearance(I live in the DMV area). I only got 1 single interview and the only reason I landed a job was because of a direct reference from a senior engineer.",
      "subreddit": "jobs",
      "score": 1347,
      "url": "https://reddit.com/r/jobs/comments/1ncjksp/i_applied_to_over_80_positions_within_the_month/",
      "comments": [
        {
          "body": "100% success with referenced. Wow",
          "score": 721
        },
        {
          "body": "Wow, there are 80 positions for this where you live? Not bad... around here are about 4-5 per month max. and then Senior with at least 100000 yoe",
          "score": 80
        },
        {
          "body": "I’ve been doing the same thing coordinating it like this. Has made me very depressed after I have applied to over 150 jobs. Got 3 offers but all are around an hour and a half commute ☠️",
          "score": 109
        },
        {
          "body": "Hiring manager here.  Specifically one who does hire for python roles.  How are you self taught and how do you present your skills, talents, accomplishments?  I'm also self taught so I definitely tell recruiters to not discriminate against those without a traditional degree background but a 4 year degree candidate is often different from a boot camp or self taught candidate so while a good engineer CAN come from any background, it's easier to find in some backgrounds so you need to really distingish yourself.",
          "score": 28
        }
      ]
    },
    {
      "title": "Got an interview tomorrow for Application Tech Support Practitioner at Accenture what kind of questions should I expect?",
      "body": "",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ov5jcm/got_an_interview_tomorrow_for_application_tech/",
      "comments": []
    },
    {
      "title": "Skills Interview - Accenture",
      "body": "Hi All,\n\nI have an upcoming Skill Interview with Accenture—a delivery consulting position. \n\nI had the screening interview a week prior. \n\nI have relevant experience again it comes to implementation, designing solutions for stakeholders as internal advisor, but not really consulting experience. \n\nI would appreciate it some advice on how to do well in this interview.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/n9i1xp/skills_interview_accenture/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Accenture Assesment Centre",
      "body": "This was for a Graduate Consultant role that I completed in an Accenture Assesment centre. I did an individual assessment in a digital environment. These were the problems I had to solve in person on the teams meeting while an interviewer was watching.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ox4ydg/accenture_assesment_centre/",
      "comments": []
    },
    {
      "title": "Getting a JOB after 40+ rejections",
      "body": "Being a non-engineer studying Economics at my undergraduate, I had pre-planned like others to do an MBA.I had the option of going for masters but I did not as I wanted to explore further and had a career in finance and portfolio management.\n\nSo, after applying to a lot of MNC's via LinkedIn, Glassdoor, Naukri, Cold emailing and what not I lost count of the number of \"regret letters\" that I had received and if I count the number of times I have not heard from anyone after applying it would easily be 40+\n\nThen comes into my life Accenture. I had applied for a tech role and never expected to get it until I got it. I gave a aptitude test, followed by a technical round and a HR interview only to pass at every stage shockingly.\n\nMy sister said she was shocked seeing how a non-engineer got such a job.\n\nBut there it did not end. I had to go through the **PRIMERS** exam(where I had to learn JAVA,GCP,MONGO DB) and I score 15/20 surprisingly. Next they assigned me a stream known as \"TESTER\". We had **4 MCQ tests** there and the criteria was to get 60% as the passing marks. And to my shock I got exactly 60% at the last 2 tests and it was followed by a **\"HANDS-ON ASSESMENT\"** for which I did not know anything being from a non technical background. But to my shock I scored exactly 60/100 and passed my exam.\n\nAnd I was all set to join Accenture.\n\n  \nLearning: Expect results from the most un-expected placed as the universe sometimes works UNO-Reverse.",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1jlopwz/getting_a_job_after_40_rejections/",
      "comments": [
        {
          "body": "Happy for you, i wish if i also could join accenture",
          "score": 1
        },
        {
          "body": "Well done bro, what’s your role btw?",
          "score": 1
        }
      ]
    },
    {
      "title": "Feeling helpless and lost ",
      "body": "\nHey Reddit,\nI don’t know where else to vent, but I’ve been feeling really down lately. I’ve been job hunting for months, and nothing seems to work out. I’ve sent out countless applications, tailored my resume, and prepared endlessly for interviews, but I just keep getting rejections—or worse, silence.\n\nI’ve worked hard in the past and have solid experience under my belt. I even worked at Accenture as an Infra Managed Service Associate, where I managed infrastructure services and gained valuable technical and problem-solving skills. I put my all into that role and learned so much, but ever since leaving, I’ve been struggling to find my next opportunity.\n\nIt feels like I’m stuck in a cycle of trying so hard and getting nowhere. It’s hard not to take it personally.\n\nI’m trying to stay positive, but honestly, I feel so defeated. I’m scared I’ll never land a job, and it’s starting to feel like I’ll never be good enough.\n\nIf anyone has advice or even just words of encouragement, I’d really appreciate it. Thanks for reading this.\n",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1i1dbr4/feeling_helpless_and_lost/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Well you're not getting help from me. I'm pushing 6 months of job finding. Closest I've ever gotten to an interview were DMs from very few hiring managers",
          "score": 0
        }
      ]
    },
    {
      "title": "Suggestions to choose company",
      "body": "Asking for friend \nShe currently has two offers, one is pending \nLives in Pune \n\n\nAccenture - 13.5fix and 0-21% variable hyd location \n\nDeltek - 13.7 fix and 6% variable - remote - but it's 5.30 pm to 2.30 am shift \n\nRole is automation SRE\n\nDeltek is kind of product based firm. \n\nJoining for both is 14th of july \nBut deltek is asking for confirmation asap, they would send laptop before joining and that's their kind of norm. \n\nOne of the interview for other company is pending,\n\nWhich one to prefer ? Any opinions please ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1lqhuj9/suggestions_to_choose_company/",
      "comments": [
        {
          "body": "Deltek has government contracts as they use CostPoint for their ERP software and certain branches of the government require their suppliers to use it as well. \n\nWhat, exactly, would she be doing for them?",
          "score": 1
        }
      ]
    },
    {
      "title": "How to break the \"Better candidates than you\" interview rejection cycle? It's driving me to breaking point!!",
      "body": "Unemployed since June.\n\nI'm beyond frustrated.  \nI barely land interviews, and when I do, it's always the same story: \"*Thanks, but others were better / closely matched the JD*.\"  \nSeriously, what gives?\n\nI'm sick of the vague feedback, or that the other person has closer experience/skills to the JD etc and feeling like I'm not good enough.  \nWhat am I doing wrong?  \n What are these \"better candidates\" bringing that I'm not?  \nHow do you get past this stage!!!!\n\nThis cycle of disappointment is driving me nuts.\n\nAnyone else been through this?  \nLet's commiserate because I can't be the only one tearing my hair out over this!?!?!  \n\n\n***EDIT:*** Just to also add,  I've interviewed in the last year for creative/tech type roles at Accenture, Meta, EY, UCL + other smaller companies– solid opportunities.   \nI know I'm qualified. !",
      "subreddit": "jobs",
      "score": 26,
      "url": "https://reddit.com/r/jobs/comments/18d0lhw/how_to_break_the_better_candidates_than_you/",
      "comments": [
        {
          "body": "It’s just the job market. Lots of big tech companies laid off thousands of employees this year and you’re going up against those candidates so competition is stiff. A lot of times those automatic rejection letters will say the better candidate line but they could have rejected you for any other reason. Don’t take it personally, just continue to apply until you hit something.",
          "score": 15
        },
        {
          "body": "Exact same position. I've had 4, maybe 5 finals so far.\n\nCompany 1 even ran the background check and confirmed my references with no offer (which I thought was strange) only to ultimately offer the role to someone else.\n\nCompanies 2 and 3 I felt strongly about, but same spiel. The last interviewer at company 2 even ended by asking how soon can I start and told me the pay. The pay he said was lower than what the recruiter originally told me, and when I mentioned it, I felt the entire tone shift. Maybe that was why they rejected me. \n\nCompany 4 I would have bet money I'd get. It was a different team with my old company (that laid me off). The hiring manager immediately told me he was moving me forward. He said he can hear my passion. Which is true because it was my dream company. I researched all the next interviewers, one whom bought Taylor Swift concert tickets during our interview. Even had a VP recommendation. All for nothing. \n\nCurrently waiting to hear back from company 5. But it's been a week with no response, so given past experience, i think that means they're persuing someom else. But it was the same situation- the hiring manager immediately loved me and said she's moving me forward. When I mentioned a book to one of the interviewers, she shared she was actually researching the book and its applications to the work. Idk wtf these employers want. I see why ppl drop out the labor market.",
          "score": 5
        },
        {
          "body": "&gt;EDIT: Just to also add, I've interviewed in the last year for creative/tech type roles at Accenture, Meta, EY, UCL + other smaller companies– solid opportunities.\r  \nI know I'm qualified. !\n\nOP - these are extremely competitive places of employment. You'll basically be competing with the best candidates in your country and probably further afield.\n\nSorry to say but with these, there's simply no room for *\"I know I'm qualified\"*. These companies are looking for the best in the market - which now includes many laid off people.\n\nIf your standard is meeting the requirement then, in regards to companies like the above, that is not a very high bar for other candidates to be \"better\".",
          "score": 3
        },
        {
          "body": "Hope it gets better for you\n\nI was unemployed from Jan through March this year, and it was very much the same. Then got 3 offers at once after all those months of grinding, so you never know when things will turn around",
          "score": 2
        },
        {
          "body": "I'm still trying to figure this out and I'm typically applying to jobs where I have about 3x the required # of years experience. I lowered my desired salary about 15% - I'm hoping that works.",
          "score": 2
        },
        {
          "body": "Exaggerate your experience more than it actually is?",
          "score": 0
        }
      ]
    },
    {
      "title": "Am I hired or not?",
      "body": "So I recently went through the entire interview process at Accenture South Africa, had dummy payslips/payment sent through and was told officially congratulations I essentially got the job on an email from the recruiter.\n\nThen told they're waiting on final approval to send through my contract and then that's that.\n\nAlthough that wasn't the case, a day or 2 later I received a call from my recruiter saying that ACN global has called for restructuring internally for level 11 employees. So I was told this isn't a no and that they really want to hire me but can't yet...indefinitely...until further contact/approval that hiring will be active again?\n\nSo can anyone please explain to me what this means and what I should expect? Was super duper excited to start in their Song department but now I just feel like this has been quite unprofessional no?\n\nAlso it's been 2 months so I feel like waiting forever isn't doing me any favors either",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1dpr5oz/am_i_hired_or_not/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Looking for post-undergraduate advice",
      "body": "I have recently finished my undergraduate degree at a top university in Italy, and I was looking towards working for a couple of years in consulting to get a better idea of what interests me before specializing through a graduate degree. The situation in Europe's been pretty bleak though, and most of the jobs available are unpaid internships if you want to go down the corporate route, and I've struggled to even secure interviews for those. Plus, most of them want you to be doing or have completed your masters, at least that's what I've seen in Italy and to a lesser extent in Spain and Germany. I've struggled to find a job as a result, and have thus started to apply for a few MSc programs. My question is, do you all have any suggestions on what I should aim for or any insights that might help me choose which path I could go down? Here is a bit of clarifying information:  \n\n\n* I completed my bachelor's in International Politics and Government, minoring in Economics. My final grade was just a bit above average (98/110, not a lot in the Italian system)\n* I see myself eventually working somewhere demanding both geopolitical and economic knowledge. Probably in strategy/geopolitical consulting (Accenture, MBB, Politico) or in an international organization (WFP, IEA). These are aspirations, not the only places I have been applying to.\n* I see energy markets and supply chains as two areas I'd be interested in specializing more into.\n* I am looking at an MSc which reflects my work aspirations, and applying to places in Western Europe\n* I have a GRE score of 332\n* I am Brazilian but have European citizenship\n* I am fluent in English and Portuguese, and proficient in Italian, Spanish, and German\n* Some of the masters that piqued my interest are the following:\n   * Supply Chain Management at WU (Vienna)\n   * Global Management and Politics at Luiss University (Rome)\n   * International Affairs and Governance at St. Gallen University (St. Gallen, Switzerland)\n   * Politics &amp; Technology at TUM (Munich, Germany)\n   * Economics in SSE (Stockholm, Sweden)\n   * International Economics at Erasmus University (Rotterdam, Netherlands)",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1950run/looking_for_postundergraduate_advice/",
      "comments": []
    },
    {
      "title": "Always being rejected with Accenture for unknown reason…",
      "body": "I have been applying for an intership at accenture in Austria for many times , and I always get rejected even though my profile fits exactly for what are they looking for . What is stranger is  they post everyday on LinkedIn and other carriers website that they are looking for a Trainees…\nIf I have the qualifications for this job , and the job is still free, and they make announcements everyday that they are looking for trainees.. why am I always getting rejected ?\nI am starting to feel that it could be something related to  nationality , religion, race… etc",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/ofti7a/always_being_rejected_with_accenture_for_unknown/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "If your name is very non-European sounding, you should try to reapply with a nickname (and a different email address). \n\nYour post is a little vague: are you located in the city where the internship is? Are you authorized to work in Austria?",
          "score": 2
        },
        {
          "body": "We all like to think we are perfect for every role. The reality is that we aren’t. There are also tons of applicants to each role. Instead of constantly re-applying, keep looking elsewhere.",
          "score": 1
        },
        {
          "body": "What are they looking for and how do you match the description?",
          "score": 1
        }
      ]
    },
    {
      "title": "I like my company enough but got a job offer from one of the top companies in my field.",
      "body": "I like my current company a lot, the worklife balance they provide is great, they are flexible, I'm one of their go-to developers and I feel I have grown a lot there and can grow into a leadership role there too. Been there for 2 years now, real close to that senior role.\n\nI entertain job interviews all the time, because I get contacted quite a bit. I got one from Accenture Federal Services, a subsidiary of like the top provider in my field, but my issue with Accenture was that they had no career growth, this position does.\n\nThe pay is about the same, but this new role would see me as a senior role and a lead, one step away from manager. The new company provides better resources and more in-depth training. I lose out on the people I like at my job and unlimited PTO, but I would pick up more seniority and responsibility.\n\nThe thing is I think I can hit all that at my current company in like a years time.\n\nMy current pay is about 90k with bonus coming up and the new job offered 95k with sign-on bonus of 5k. I feel like I should only really switch if they offer 100k or more?\n\nNew job provides better training resources and a more defined methodology. Both are remote.\n\nWhat do you guys think?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/s0y82d/i_like_my_company_enough_but_got_a_job_offer_from/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Similar to you, I recently agreed to talk to a recruiter. Ended up being offered a 25% increase in pay and a more enticing job title. I accepted, although I also really liked my current employer, felt valued there, and had plenty of growth opportunities ahead of me. It was hard to make that choice and I still had a rough time defining my reasons for leaving. I wouldn’t have accepted if the pay increase was any less. \n\nDo you think you could leverage your offer to get the salary/title bump up with your current employer?",
          "score": 1
        },
        {
          "body": "For the pay difference and upward mobility a year away with the current company, no. I wouldn’t move. I’d need 15% minimum but would rather 20",
          "score": 1
        }
      ]
    },
    {
      "title": "Waiting for updates",
      "body": "Hello !! I'm a fresher and I completed the last round of interview of Accenture on 29th May.Its been almost 3 months yet I didn't recieve any updates. Everytime I raise a ticket, they tell me to wait for the updates. But it's been too long. What should I do at this point? Should I give up on it? Well it's not like I can do anything about it anyway.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1er2oq7/waiting_for_updates/",
      "comments": [
        {
          "body": "You've been ghosted. I hope you've been actively pursuing other opportunities.",
          "score": 1
        }
      ]
    },
    {
      "title": "Sometimes I feel like the \"job finding\" game is rigged...",
      "body": "\"You have too much experience\", \"You don't have enough experience\", \"Were looking for someone with experience in X, and we wont train you\" or \"This position is an unpaid internship\". The gap between the rich and the poor is at its highest since the great depression. In Los Angeles alone, the unemployment rate is 12%. Youth unemployment is around 15%. Scumbag Recruiters tell you they will call you next week with an answer about the job interview, then never call. Politicians consistently talk about how they care about you, the \"regular hard-working American\", while in the meantime they're taking kickbacks from every corporation under the sun so they can pass laws that fuck you, the consumer, over and inflate Lumberg's stock price by a quarter of a point.\n\nI'm 28 and thank god I have parents that are understanding and willing to support me, but frankly its embarrassing that at 28 I have to live with my parents and ask for fucking Gas money. I am fucking sick of sending out resume's and cover letters only to hear crickets. In 3 days I applied to 23 Jobs and have heard nothing. NOTHING. I'm a scientist for Christ's sake, remember me,the employment sector that Clinton and Bush gave big speeches about, the \"critical work force\" that America was running out of? Yeah, well I call bullshit, because Biotech's are now outsourcing R&amp;D because some douche-analyst at Accenture thought that would be a \"great\" idea, even though in the long-term it probably costs more money than it saves.\n\nSo my solution? Fuck it. Im going around the corner, grabbing my medical marijuana prescription, and guess what Im going to do when I run out of money? Im going on unemployment. Why? Because fuck it.\n\nI tried to \"play the game\" the way its supposed to be played. I got my degree, I graduated at the top of my class, worked a good job for 4 years, went back to grad school, and was met by a big wall of corporate \"Fuck you\".\n\nSo fuck it.\n\nSorry, not trying to have a pity party, just had to vent. ",
      "subreddit": "jobs",
      "score": 37,
      "url": "https://reddit.com/r/jobs/comments/idl64/sometimes_i_feel_like_the_job_finding_game_is/",
      "comments": [
        {
          "body": "I feel like a scumbag because I'm unemployed.  I'm killin myself out here everyday trying to find leads and apply to as many places as I can.  Its really annoying.  ",
          "score": 15
        },
        {
          "body": "I'm right behind you buddy, this rat race is stupid",
          "score": 5
        },
        {
          "body": "&gt;In Los Angeles alone, the unemployment rate is 12%. Youth unemployment is around 15%.\n\nIt's worse, in fact. Those are just the official numbers. Official numbers lie pretty terribly. National average is a lot closer to 17-22%. LA, I'm certain, is a *lot* higher than average.",
          "score": 6
        },
        {
          "body": "bastard!\nyou better call me when youre drawing unemployment, with that mmj.\nI've been searching in denver for 2 months-and this random ass sign spinning job i applied for a month and a half ago just called and hired me today-  I  have a b.s. in psychology. sometimes i feel the bs may as well stand for bull shit, or bad spend (of time and money)\n",
          "score": 7
        },
        {
          "body": "Dude... we're the same person",
          "score": 3
        },
        {
          "body": "May i ask what you got a degree in, and what was your masters in? I am in a very similar situation man. It's really shitty and i can't even give you any advice. If you look at my comment history you'll see how fucked up things are for me right now. My mind is going in so many different directions its not even funny. I came home today and started looking for jobs and the hardest part is seeing that they all want different shit that would take me years to get. They used to want one year of experience, now they want 5. ",
          "score": 3
        }
      ]
    },
    {
      "title": "Any advice for Accenture Service Desk Associate?",
      "body": "Hello, any idea po kung ano salary range ng Service Desk Associate sa ACN for fresh grad? And is it true po ba na may basis po sila (if may latin) sa salary offer? \n\nASE role po kasi sana talaga desired ko kaso wala na raw po open kaya inoffer po sakin sa email yung other role which is Service Desk Associate. So ang balak ko po while waiting sana na magkaroon ulit ng opening for ASE is itake ko muna yung Service Desk role. What can you advice po? Good decision po kaya yung gagawin ko? For experience lang din po kaya may part na want ko sya itake while waiting. \n\nAlthough, I applied to other company as well for jr dev roles din and waiting parin naman po so.. ayun po. Inaalala ko lang rin po if gaano po kaya katagal yung aantayin ko before mabigyan ng start date? Aabutin po kaya ulit ng ilang months?\n\n\n\nSum up ko nalang din po yung questions ko:\n\n-salary starting range for Service Desk Associate (fresh grad with latin)\n\n-okay po ba yung plano ko na itake muna kung ano yung inoffer sakin for now which is Service Desk Associate while waiting for my desired role na ASE? If good decision po.\n\n-iinterviewhin po ba nila ako ulit for the SDA role even na HR interview na ko before during sa application process of ASE role?\n\n-how long po yung waiting time to get the info about sa start date for the Service Desk role? \n\n\nThank you po sa advices in advance!",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/17ypo9p/any_advice_for_accenture_service_desk_associate/",
      "comments": []
    },
    {
      "title": "Should I just give up on this job? A few months ago I got an offer for a \"FT\" job at a company",
      "body": "that sends \"consultants\" onsite to clients. The consultants work for the client but get paid by the company. So really it's like Accenture or any other temp agency although they provided me with an \"offer letter\" for a FT job and they provide benefits. The manager said the offer was contingent on finding me a role with a client. So I'm like OK I'm not quitting my current (boring) contract job until something is final.\n\nSo I hear nothing for several weeks. Then about a month ago they say they finally have an open role for me at Company A (A well known large Fortune 50 company) so I interview for the job. I think I'm qualified and what I didn't know I can learn. The manager recommended me but the hiring manager decided to pass on me for unknown reasons although she recommended for a different role in Comms (the role I interviewed for was change mgment) Ok so I was disappointed but agree to interview for that role but the consultant who was in that role was fired and I never like to take a job where someone has been fired because although it could have been their fault it's often a bad sign. I interviewed with the hiring manager 2 weeks ago. They need someone now. The role is open.\n\nThe manager said last week she finally got back to him but didn't have a final decision on whether to bring me on or not. Then he said she would have a final decision on 4/25. Today I got an update from him that she liked me but they still need to \"work some stuff out\" so don't have a final decision yet. Should I just give on this role? My current job is a contract role at a well known respectable (but not exciting) company and I have very little work to do. Should I just stay here while I continue applying for FT jobs? Thanks.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/ubzn0n/should_i_just_give_up_on_this_job_a_few_months/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Yes, you should stay in your current job until you find a new job.\n\nYou don't have to only apply for one new job at a time. I'm not sure what you mean by giving up on this one. Just let it simmer along until they've made a final decision, but apply for others at the same time.\n\nIf your current job isn't very demanding, then this may be an opportunity for you to become /r/overemployed.",
          "score": 1
        }
      ]
    },
    {
      "title": "Graduated last august with degree in Accounting. Had good internships. Quit my college sales job to focus on applying. Still no luck with a good job. Want to work in tech, or as a BA.",
      "body": "Need some help on what to do. I Graduated August of 2017 with a Bachelors in Accounting (Good school for Accounting, but not top tier). I had an internship at big4 accounting firm but hated it so decided not to go with it when I was in school. I had a sales job throughout college at a mobile carrier earning ok money, but it was taking away too much time from networking and applying so I quit in May of 2018.\n\nI've had multiple interviews at different prestigious companies, but never been given an offer. I'm applying 3-5 jobs a day, but getting around one interview a month. \n\nIdeally I'd like to work as a BA, consultant or sales at a tech company like Salesforce, IBM, Microsoft, Accenture. However, I'd be okay working in any analytical role such as financial, operations, or business analyst. \n\nI'm getting very frustrated that I haven't found a \"real\" job out of graduation. I'm not sure what I'm doing wrong. My interviews go well, and I've made it to multiple rounds with different companies, but I just haven't gotten an offer. \n\nWhen I apply I cant seem to find positions that I'm qualified for. There's nothing entry level (0-2 years), and I've already missed the window for jobs looking for people still in college (expected graduation within 1-2 years). \n\nI've been offered a job at a nice car dealership, where I know I can make money, but I'm worried this will ruin my chances of later getting into tech consulting or BA roles. I'm not sure which job I can take that will not hurt my chances of where I'd like to work later which are the tech companies/tech consulting. \n\nWhat should I do to land interviews at these tech/consulting companies? I'm not meeting the requirements, but I'm not sure how I can get those requirements if there are no entry level positions?\n\nShould I take the job at a car dealership? \n\nShould I go back to school and get a mba/masters in technology?\n\nWhat jobs wont hurt my chances of getting into tech/consulting later?\n\nHow do I explain leaving my mobile carrier sales job? Ive been out of work for 3 months now, and I'm worried this will hurt my chances? Should I still say I'm employed there on my resume?",
      "subreddit": "jobs",
      "score": 9,
      "url": "https://reddit.com/r/jobs/comments/95r0xa/graduated_last_august_with_degree_in_accounting/",
      "comments": [
        {
          "body": "I have a Accounting degree and work as a BA at a Tech company. \n\nConsulting, if you want this you should have done B4 Consulting. MBB Consulting is mostly MBAs, although they do hire strong undergrads as BAs. That said, there are smaller consulting shops out there hiring for all kinds of things.\n\nFor BA at Tech: how good are you at tech? You need SQL minimum, like working experience level. We don't hire BAs that need to be trained in the basics. I was pursuing my CS degree and had 1.5 years work experience in audit and still had to work my way up from operations and prove myself. I'm able to pick up languages like Python/R on the fly, do statistical analysis using regression, and break down both technical issues and business problems into understandable issues from the software side, statistical science side, and business side. While not every BA has my skill set, I'd be surprised if they hire any BA who's not somewhat technical. \n\nI'd say focus on improving your tech skills: SQL, Python, R, Tableau. Interviewers want to know they don't need to risk you not knowing how to create dashboards they can read with just access to a database. Then work on some LEAN type stuff if you like consulting - a Yellow/Green Belt in Kaizen could be a start if you can afford it. ",
          "score": 4
        },
        {
          "body": "Car Dealer: NO\n\nMasters: MAYBE, do a masters in Accounting and go Deloitte (or other big4, sorry you hate it but its the way it is, and they drink hard on weekends)\n\nJobs for future: Apply for places in SF\n\nExplain leaving: 3 months is not a long time, say exactly what you said here. Nobody cares about a college job. ",
          "score": 6
        },
        {
          "body": "You have to network. Knowing someone will on the inside will get you that extra push towards a job offer.",
          "score": 2
        },
        {
          "body": "The route of sales is a good one. There are a lot of accounting sales positions open for NetSuite and a host of other smaller finance and reporting startups all over. They need people who know accounting and finance for sales. \n\nAlso, take a look at smaller accounting firms. You may not like the work, but it's gonna look good on a resume. Try for mid-level regional ones. Ask to speak directly to the principals and see if they are hiring. ",
          "score": 1
        },
        {
          "body": "Meetup.com\n\nTemp agencies ",
          "score": 1
        },
        {
          "body": "If I were you I'd just try and get my foot in the door of a company you want to work for instead of finding an ideal job at that company.  Then in a year or two you could start applying for your ideal roles.  \n\nAt my company we have a couple departments that are always looking for people.  I started out in one, got to know a manager in a better department, then transitioned to it.  ",
          "score": 1
        },
        {
          "body": "Get your foot in the door any way you can and then network yourself to your ideal role from there. ",
          "score": 1
        },
        {
          "body": "I got my masters in entrepreneurial management basically tech right after getting a BBA in economics... hasn't helped me at in locking a job down because I don't have that 2+ year experience...  definitely sparked a passion though.\n\nI have found that skills are the most important, Im constantly taking Udemy classes or workshops at General Assembly to up these skills, definitely learn SQL if you don't know it. I just got a Udemy class for $10 I think they are having a sale \n\nBUT I am also having trouble finding these positions, it is so frustrating. I am going to a ton of networking events in the next few weeks which I think is essential.\n\nReach out to people for informational interviews on linkedin a lot of people are willing to help.\n\nI feel your pain though, this is the most disheartened I've ever been. Mind me asking what city you are looking in?",
          "score": 1
        }
      ]
    },
    {
      "title": "The good ol' Linkedin lying thread... (marketing case)",
      "body": "So here we are... decades later, and it's still going on. I was happy to read in an older thread that people in general thought it is a bad idea back then and will be found out.  \n\n\nBut how does the land lay now?  \n\n\nYou see, I'm at a cross roads (read fired during Corona), and one of the first things I did was take a look at my own Linkedin profile.  \nFor the change I'm contemplating, I don't have the perfect resumé. It tastes a bit like it,  but I have been studying on the side learning a lot about marketing and am especially focused on behavioural design and digital marketing.  \nI have never lied about my previous workplaces or responsibilities, but I do know how to word them to make the most of those responsibilities (and no... I still don't mean lying).  \n\n\nOf course when you start taking an interest in something the AI of google kicks in and you are constantly served ads that relate to your interests. (which is part of what I'm studying).  \nAnd then I come across these very young companies, who hit the gold streak on FB or Instagram and are now telling others what to do.  \n\n\nBut what made me write this, is because this young copenhagen company recently hired another young person who they boasted came directly from Pinterest where he server as a partner manager for the nordics. Also boasted that he had worked as an attaché for Google....  \nFor the fun of it, I started looking into him. Something just wasn't right about it.  \n\n\nAnd this is where the whole thing about \"lying always gets found out\" chimes in.\n\nIf you don't pay attention to your SoMe posts, you WILL get found out. In this case, it turns out the guy had never worked for Pinterest, had never worked for google. He was employed by Accenture in Northern Ireland.  \nNow I know what Accenture is, because I have been using them myself as a manager. And working for Accenture as \"Google Ads Client support &amp; Optimizer\" does not mean you worked for Google. That means you were a callcenter support with a specialty in Google Ads. The so-called pinterest job was also an Accenture position, which means Pinterest hired accenture to support them and he got the task.  \n\n\nBut this info was still on his damn FB profile publicly visible...  \n\n\nAnd now this up and coming online marketing business is promoting him as a former google and Pinterest employee? I mean... one thing is if he lied at the interview, because then they just bought into the lie and his \"fixed up\" Linkedin account, but if they are aware of it.....   \n\n\nWould you take advice from a company like that?  \n\n\nI know marketing is about communication and selling, but in my opinion marketing can be done right without lying. That is what the whole core of marketing is about.  \nHave we really reached the point where no-one gives a damn anymore?  \nA point where \"all is well that ends well\"?  \nWhere obvious lying has replaced good strong communication?  \n\n\nPlease say no... Please tell me, we as people still have some decency left.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/llyhji/the_good_ol_linkedin_lying_thread_marketing_case/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 0
        }
      ]
    },
    {
      "title": "Been an unemployed grad for a while now... got an offer for a content review analyst job, but not really feeling like it would be worth it to accept it...",
      "body": "I am an IT Management graduate and have been applying for ages now and a couple weeks ago received a message on LinkedIn from Accenture HR recruitment. In it the lady advertised to me a content review analyst position where the knowledge of an additional language at a fluent level would be very beneficial for the position. I accepted the challenge and decided ehh why not, let’s see how this goes. One of the issues with this is the position is in another country so I would have to move which wouldn’t really be an issue if the job was actually worth it. I’ll try to keep this short... \n\nI ended up passing all their 3 stage tests/interviews (which was a red flag in itself to me as I generally found these very easy, bit too easy imo). Yesterday I was finally offered the job. I didn’t accept it straight away and said I would need a couple days to think it over... everyone around me is telling me that I should be thanking god for giving me this opportunity, whereas I actually feel like this is some kind of a trap? Here are some reasons why I think this position isn’t something worth going for, let me know if I’m crazy or have too insane requirements... \n\n1.) content review analyst is basically a call centre job (same atmosphere and way of working) where I will be coming in along with other 70 people doing 24/7 operations making sure no one is posting porn/insensitive crap on the App Store etc \n\n2.) they claim it’s 40h per week max, but they reserve the right to make me work one weekend a month for no pay + 2 weeks of night time shifts randomly. The night time shifts are paid 25% more but that doesn’t seem like it’s worth it considering the health issues resulting from 8-5am shifts. \n\n3.) this is a big one for me... I was under the impression that I was applying to work for Accenture, after getting the offer it seems like they are contracting people... and my actual employer is a random recruitment consultancy (this ones the biggest issue for me, as I just do not want to work for a recruitment consultancy...). Meaning that this won’t even look that great on my cv. \n\n4.) I see no future prospects doing this... from what I’ve read the job is very repetitive, you literally do exactly the same thing everyday for 8 hours no difference at all. I’m not sure how I would learn anything useful or advance while working a job like this. Just seems like a waste doing a job like this (I’ve got a Bachelors and a masters in IT and management, people in my field should be earning at least 40-50k not 24k..). I would like to use my brain somehow at my job, and not just do mindless shit day in day out for a measly pay... \n\n\nWhy is everyone around me working their dream jobs, while I’m stuck debating if I should just give up and work this crap job I was offered. Am I crazy for wanting more? Has anyone worked a job in this field before, is there any point to it? Will I learn anything? Because honestly, I’d rather stay unemployed and just take some classes and learn something useful to actually advance myself and not just waste my time for a salary that will all go on rent and food. \n\n",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/9n8k28/been_an_unemployed_grad_for_a_while_now_got_an/",
      "comments": [
        {
          "body": "Since it is another country, I would not take the risk. Keep trying! Good luck!",
          "score": 4
        },
        {
          "body": "From the sound of it there seem some questionable things in there. Think especially if your gut feeling strongly advices you to run for the hills you maybe should not take it. Especially since it sounds like you could probably get something a bit less shitty somewhere else",
          "score": 2
        },
        {
          "body": "All your points are valid. Except comparing your track to others. ",
          "score": 2
        },
        {
          "body": "Are you working now? Is this a job? Take it. ",
          "score": 1
        }
      ]
    },
    {
      "title": "6 month performance review postponed by 3 months because my first 3 months I was on probation? Does this sound like BS?",
      "body": "I started at a new company May 21st. My first 3 months were probation, meaning they reserved the right to let me go at any time without a heads up. Before I accepted the job, the salary negotiations went poorly since I was uninformed of industry averages. I ended up getting offered 40k but told them I wanted a salary review in 6 months instead of a year. They agreed. \n\nSo yesterday is my 6 months review at the company and the first thing my manager tells me is that, \"Oh it seems like we're doing this a month early because your 6 months review is after the 3 month probation period since you weren't really a permanent employee at that time. It's fine though, we'll just move your second 6 month review down a month.\"\n\nWtf? Is this actually a thing because it just sounds to me like they're trying to find an excuse to delay giving me a pay raise. \n\nAnyways, at this salary review, I come prepared in industry averages, the job description and my 3 month eval, tell them how I've gone past the description, how I've addressed everything in the 3 month review, and printed out copies of industry averages from two separate sites. The exact same sites they sent me when they first offered me the job and I had mentioned the low salary. \n\nBefore I get the chance to present any of this, they tell me they are raising my salary from 40k to 44k. \n\nI tell them \"I feel like compensation is still an issue\" present them the region averages for a level 1 business analyst with 0-2 years experience and how I am on the lowest end of that scale. With their 44k it brings me to the 10th percentile. I told them I wanted 50k, still under average but respectable. \n\nThis same manager then starts asking me, \"Well simkessy, what if you were in accounting (I graduated in both and did co-ops in accounting, now I'm in Information Management/IT consulting) how much would you be making there?\" \n\n\n...what? I couldn't even believe that was his line of questioning. I responded with \"I don't know, I'm not in accounting, I'm in IT\" \n\nHe goes into all this BS about how I'm inexperienced (even though my performance is excellent), how other companies offer you the moon but here I have more freedom to study and training and learn the technologies I want, etc etc. Which is true. I do like working there and find I have more freedom then I would working for Accenture and Deloitte, which I turned down interviews for. \n\nIt was basically going no where. Eventually the company owner (in the room the whole time) is like \"okay okay, we just want to make you happy so I'll give you 45k\"...at that point it I realized it was like pulling teeth with these people to get the salary I was asking for, which was still below average.  I haven't been looking for new jobs really so it's not like I could not accept but the whole thing just really pissed me off. \n\nCan they really say your 6 month performance review is 6 months after the first 3? I started in May so I would have expected my 1 year review to be May but now it's going to be end of August because of this bullshit. I have to go to Europe for a wedding July 25th...I think I'm just going to quit before the wedding since I can't take has much time off as I'd like to in Europe (3 weeks is what I want to go for). So I'm thinking can take the rest of the month off and get a job when bigger firms are looking and I'll have had been there for a **full year** by that time which doesn't look as bad on my resume. \n\n&lt;/rant &gt;",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/1vus89/6_month_performance_review_postponed_by_3_months/",
      "comments": [
        {
          "body": "So the moving around of reviews is lame. I'll give you that. Being unhappy with a 12.5% raise, without getting a promotion, after working there for 6 months makes you sound like a baby. You accepted the initial 40k they offered so no reason to be mad about that value. That's what your career is based off of now. A 25% raise after 6 months is an unreasonable request.",
          "score": 8
        },
        {
          "body": "Time to start looking",
          "score": 9
        },
        {
          "body": "I'm unclear,  is the 50k number you're giving for your area the average pay for the job, or is it the average pay for someone entering that job market?\n\nI've got to be honest with you, it sounds to me like it's the average pay for the job in which case 40-45k entry level isn't a bad pay rate.  If everyone entered at the \"average\" pay, then the average pay would just go up.  Pretty much everyone entering the market will be paid below the average pay because they haven't proved their value (over the course of years).",
          "score": 3
        },
        {
          "body": "I had this happen to me and a resigned on the spot. I decided that if they didn't feel that my contribution was valuable after I had already taken a paycut to go from being a rockstar graphic designer at an city based ad firm to a production level guy to avoid a commute, that it was not going to get any better.",
          "score": 1
        },
        {
          "body": "Dude, you're one person in a private company. As long as you're making at least minimum wage, management can pretty much do what they want.",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm countering a job offer I think a low. I drafted a letter and was looking for some input.",
      "body": "I got a job offer as a Jr Business Analyst. I graduated with an A- average, April 2013 in Commerce (Accounting/Info Systems &amp; Co-op). So I have some experience in the field and using the tech they need. They offered me 40k but they expect me to have a car for work within 3 months. They told me this after they asked me what my minimum expectations were, I said 37-45k. Now, that I know more about industry averages and other grad offers in similar fields I feel like 40k is pretty low. I wrote and email to counter.\n\n&gt;Hello V., \n&gt;\n&gt;Thank you for your offer to join X Company, I am very excited about the opportunity as it is an excellent fit for my current skill set and goals, which  I believe will allow me to quickly contribute to the organization. This is a field I am very passionate about and I can really see myself growing within and with X Company.\n&gt;\n&gt;Before providing you with a formal acceptance I would like to discuss two items with you. \n&gt;\n&gt;The contract makes no mention of the benefits available to me once the probationary period is complete. During the interview process, it was briefly mentioned that phone bills and certification fees would be covered, but other benefits (dental, healthcare, pension, etc) we're not discussed and are not addressed in the offer. Is there a formal document which outlines all X Company benefits available to me following probation? I expect to be with the organization for the long-term and would feel more comfortable if all this information was outlined within the contract. \n&gt;\n&gt;Also, given a variety of factors I believe an annual salary near $52,000 per annum to be a more consistent with industry norms. This figure takes into account: industry standard in Ottawa for similar positions, recent offers to graduates in similar consulting fields, cost of living and the required purchase my own vehicle (with business insurance as per the contract) within 3 months of employment. Considering I also have a student loans to repay, it would make it challenging for me to live comfortably at this current offer. \n&gt;\n&gt;Again, thank you for your offer and I look forward to your response. I am confident that we can reach a mutually satisfactory agreement that will allow me to start at X Company as soon as possible. \n&gt;\n&gt;Sincerely,\n&gt;Me\n\nIs this an okay way to counter? \n\n**EDIT: Tried to negotiate. The comment below shows theirreply. They didn't seem like they wanted to move. I decided to accept but plan to leave in the Fall during recruiting period. Right after accepting I got an email from Accenture saying they want to interview me. Based on my schools information they've offered recent grads from 60-65k. How, am I suppose to deal with this now?**",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1eie9m/im_countering_a_job_offer_i_think_a_low_i_drafted/",
      "comments": [
        {
          "body": "so they ask you what you want.\nyou give them a range.\nthey give you an offer that is in the middle of your range.\nNow you counter with 12k increase\n\nI am not a fan of emailing a counter offer, pick up the phone.\n\n",
          "score": 6
        },
        {
          "body": "What's your target salary? What's your reservation salary (what you will ultimately accept)? Do you have a BATNA (plan B) if you can't reach your reservation?\n\nI think you revealed too much when you told them a range, honestly, but I guess we're working with $45 as your target, and $37k as your reservation.  What is your plan B? Maybe you should apply for other positions if they won't budge.  Also, don't lie about a plan B, that could be considered fraud, just tell them what you need, they will cut some from it, and you'll fall within your target.",
          "score": 2
        },
        {
          "body": "Im a business Analyst. I have gone on a fair number of MID LEVEL business analyst interviews, so I know what the going salary is.\n\nand 52k is average for a mid level position.(2-3) years experience.  You would easily be in top 5 percent of business analyst with 0 years experience at that salary.\n\n45k a year for an entry level position would be a great and fair offer.  I live in Atlanta, Georgia if that matters.  Big city but no NYC cost of living wise.\n\nHowever 40k is too low. My first job that is what I made as a junior business analyst.  If  you dont get promoted after that first year and only get standard 2-3 percent raise, you pretty much are just forced to leave your company. As pretty much every interview you go on will offer you 20-30 percent more.\n\n",
          "score": 1
        },
        {
          "body": "52k is a bit high for an entry level/just graduated with a BS a month ago analyst.\n\n44-46k would be a better bet.\n",
          "score": 1
        }
      ]
    },
    {
      "title": "Does any one got interview results from Accenture 2026 batch",
      "body": "I had completed my interview on 17 th when I can expect the result",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p0lwo3/does_any_one_got_interview_results_from_accenture/",
      "comments": [
        {
          "body": "Someone i talked to from reddit completed their interview a month ago and they haven't received any update so don't expect much.",
          "score": 1
        },
        {
          "body": "when ur communication was done.. mine on 8th nov still no update on interview",
          "score": 1
        }
      ]
    },
    {
      "title": "Got an interview tomorrow for Application Tech Support Practitioner at Accenture what kind of questions should I expect?",
      "body": "Hey everyone,\nI've got an interview scheduled for the Application Tech Support Practitioner role at Accenture tomorrow. I'm a bit nervous and was hoping someone who's been through it (or knows about it) could share what kind of questions they usually ask.\nIt's an entry-level position (0-2 years of experience). The job description mentions Service Desk Management and Voice Support as key skills.\nDo they focus more on technical questions, or is it mostly communication and scenario-based stuff?\nAny tips or examples would be super helpful!",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1ov5il9/got_an_interview_tomorrow_for_application_tech/",
      "comments": [
        {
          "body": "For an entry-level tech support role at Accenture, expect a mix of scenario-based questions and communication skills evaluation. They'll likely assess your conflict resolution and problem-solving abilities through role-playing typical support situations. Make sure you understand basic Service Desk concepts and voice support processes. Prepping with the STAR method for behavioral questions can also help. Good luck!",
          "score": 1
        },
        {
          "body": "Can you please share your experience? I have an interview for the same role in 2–3 days, so it would be a great help.",
          "score": 1
        },
        {
          "body": "Hey! 😊\nIf you don’t mind sharing, could you tell me what questions they asked you in the interview for the Application Tech Support Practitioner role at Accenture?\nIt would really help me prepare. Thanks a lot!",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone recently interviewed at Accenture",
      "body": "For the Salesforce position 3years experience,\nActually I completed with my interview on 16th oct but still didn’t receive anything yet , the status is still showing interview anyone has an idea about it ?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ocnj09/anyone_recently_interviewed_at_accenture/",
      "comments": [
        {
          "body": "You should have followed up with them 48 hours after the interview date to ask the next steps in the process. I would email them now to get an update on the next steps. Then keep emailing them weekly up to 2-3 weeks while you search for jobs.",
          "score": 1
        }
      ]
    },
    {
      "title": "Two mails one to schedule second round and other mail demand closed",
      "body": "I gave interview for same job role on 18th of November. After this, I received two mails today.\nOne was \n\nHi Sakshi,\n\nCongrats on making it to the next stage for the role of Custom Software Engineer! You’re one step closer to joining a team of people creating lasting change around the world.\nThis stage of the process will be the Final interview\n\nBut I was unable to schedule second round.\n\nAfter this, I received immediately another mail \n\nThanks for your interest in the role of Custom Software Engineer at Accenture. However, we regret to inform that due to certain recent developments, we are no longer recruiting for this role.\n\nIf there are any new open positions that match your profile, we will get in touch with you.\n\nDon’t know what to do\nAnyone faced the same situation ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p6bdkc/two_mails_one_to_schedule_second_round_and_other/",
      "comments": [
        {
          "body": "That's rough dude, sounds like they had budget cuts or the project got cancelled between sending those emails. Happens more often than you'd think especially at big consulting firms like Accenture\n\n  \nI'd still reply to the first email just to acknowledge it and maybe ask if there are other similar roles opening up soon - worst they can say is no",
          "score": 1
        },
        {
          "body": "I got same , that they are not hiring then they sent another mail for selecting slot for final interview, which i already gave earlier 😅",
          "score": 1
        }
      ]
    },
    {
      "title": "Accenture Baltic’s interview - data engineer lead",
      "body": "Hi folks,\n\nI have been shortlisted for Accenture lead role for Latvia - 10+ years exp in GCP , ETL data engineering.\nPlease help me with  interview questions for each round.\n1 technical, 1 with manager and final HR ( cultural fit etc) .\n\nWhy i am asking is , i have attended Accenture india but for the first time, i am interviewing for Latvia and also for a lead position ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p1zfhy/accenture_baltics_interview_data_engineer_lead/",
      "comments": [
        {
          "body": "For the Accenture Baltics lead DE role, expect tech to center on GCP design and tradeoffs: walk through a data lake on GCP, late arriving data handling, BigQuery cost tuning, CI/CD for ETL, and how you’d lead code reviews. Manager round usually probes stakeholder management, estimation, and mentoring juniors. HR leans on culture, feedback style, and cross‑cultural teamwork. What helped me was doing timed mocks with Beyz coding assistant alongside prompts from the IQB interview question bank, then trimming answers to about 90 seconds. I also kept a quick STAR story bank for conflict, failure, and influence without authority. Do one dry run explaining a recent pipeline end to end, out loud.",
          "score": 1
        },
        {
          "body": "I am curious how did your inteeview go. Although, guessing it was a long way ago. I have one scheduled in a few weeks and unable to find anything on the interviews. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Accenture interview",
      "body": "I gave skill interview at Accenture when do they usually reply or give the results of interview does anyone attended any recently??",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oshp60/accenture_interview/",
      "comments": []
    },
    {
      "title": "Anyone have experience interviewing for Senior Hybrid Mobile Developer at Accenture ?",
      "body": "Hello all,  \nI was reaching out to see if anyone knew what to expect from a Senior Hybrid Mobile Developer interview at Accenture. A little bit of background on me: I worked with flutter in multiple capacities: developer, quality assurance engineer and engineering manager mainly in the social media space. I am a bit nervous because all of the developer interviews I have done have been vastly different.  \nThank you for any feedback you can provide in advance.  ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oaqu8w/anyone_have_experience_interviewing_for_senior/",
      "comments": []
    },
    {
      "title": "Accenture Data Engineer Managerial Round",
      "body": "My managerial round lasted only 15 minutes. After that, the interviewer wrapped up the call. I was confident that I answered all the questions well, but I’m wondering why the interview ended so quickly. Kindly anybody share any insights you might have about this.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1o6gxm2/accenture_data_engineer_managerial_round/",
      "comments": [
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Accenture Rejected Me After Months of Effort – Is Their Hiring a Trap?",
      "body": "I’m a 3rd-year IT engineering student, and I spent more than 4 months engaging in Accenture’s program—solving quizzes, watching courses, and gaining XP for the Go for Gold initiative, all in hopes of getting selected for an internship. I cleared every round—cognitive and behavioral assessments, technical interviews, and coding tests.\n\nMy interview went exceptionally well—the interviewers seemed impressed, kept asking me more questions, and I answered everything confidently. Yet, I still received a rejection letter.\n\nConfused, I reached out to someone working at Accenture. What they told me was shocking:\n\n- Accenture prefers average candidates who will stay 5-6+ years without switching.\n\n- They avoid top performers who might seek better opportunities.\n\n- Their system is designed to retain employees who won’t question too much.\n\n-The person I spoke to wants to quit but feels trapped, and they haven’t even completed 2 years at the company yet.\n\n\nIt feels like they trap people into working under their rigid structure. If you’re actually skilled and ambitious, you might not be what they want.\n\nHas anyone else faced this?",
      "subreddit": "interviews",
      "score": 16,
      "url": "https://reddit.com/r/interviews/comments/1jgiq7q/accenture_rejected_me_after_months_of_effort_is/",
      "comments": [
        {
          "body": "Accenture sucks! No life work balance. Low pay. Every person that I know who worked there hated it and quit. You dodged a bullet.",
          "score": 9
        },
        {
          "body": "Accenture just [announced](https://www.cnbc.com/amp/2025/03/20/accenture-is-doges-first-corporate-casualty-as-shares-dive-on-warning-contracts-will-be-cut.html) that their revenue will be highly impacted by recent cuts to U.S. government spending, and their stock price went down 7%. Consulting in general isn’t in a great place as many companies are uncertain about the future. Many consultants are struggling to get staffed on projects even if they are hired.  \n\nI wouldn’t take the rejection personally, it’s more likely they just had a very limited number of spots. New grads and interns are generally the first hiring to be frozen when a company is in a bad place financially.",
          "score": 5
        },
        {
          "body": "Yeah it fucking sucks, seems like they have no ethics. Companies like these will never go ahead in their market based on this kind of internal mentality. Companies like these will stay stuck being average and will be replaced soon by better working companies, it's better to reject companies like these than be sad about getting a rejection letter from them.",
          "score": 1
        },
        {
          "body": "After completion of all the process Some of my friends got rejection mail and acceptance mail but I neither received a rejection mail or an acceptance mail is it because I am ghosted by the company or something?",
          "score": 1
        }
      ]
    },
    {
      "title": "Stressed about interview result",
      "body": "I attended my accenture interview on November 12th and few of my friends receiving rejection mails.. now I’m so stressed about it… I didn’t receive anything.. and it’s my dream job… what if i get rejection mail too… \n\n",
      "subreddit": "interviews",
      "score": 8,
      "url": "https://reddit.com/r/interviews/comments/1grvs7n/stressed_about_interview_result/",
      "comments": [
        {
          "body": "don’t worry too much, no news could be good news. Give it a week or two because they might still be interviewing candidates.",
          "score": 8
        },
        {
          "body": "Worrying never adds a minute to our lives. What God has for you is something no one else can take away ❤️I pray you get this and that the role is full of recognition and opportunities that you deserve x",
          "score": 6
        },
        {
          "body": "If you don't get it, then you find something else for now and apply there again later.",
          "score": 1
        },
        {
          "body": "I’m a lawyer and a negotiator. I also interview for Yale admissions \n\nSpend this time writing out your Thank you letter for opportunity to meet with (use name, familiar “Jane” if you two used first names, otherwise Ms. Smith), and use the body to hit your highlights quantified of a tangent field that you have metrics that prove success. Aim for intimate funny tone while still formal. Not supplicant though \n\nMs Jones, thank you so much for your time! Our conversation really made me think more deeply about the matter of XYZ, especially our critique about XYZ. I’d love to stay in conversation with you about that.\n\nI, of course, wish you great success with your new hire. May I ask you to please keep my résumé on file, and for you to please let me know if you see a potential fit for me? \n\nLastly, I don’t think we spoke about this (as it was not directly on point for this job: I am also an expert in fundraising with high stakes donors/shareholders/boards, with 73 individual endorsements for my fundraising skills on LinkedIn. FAVORITE? When we launched the PAC for New Yorkers Against the Death Penalty, we raised 4x the previous greatest event monies. I produced the event from soup to nuts, from polishing gold leaf ceiling to teak floors. So anything in press relations, newsletter, development. Etc. \n\nThank you again for your investment of time and energy in my candidacy\n\n\nOK SUPER OVER-WRITTEN ON PURPOSE SO YOU CAN SEE WHERE I DID THE “inserts” in a Thank You Letter\n\nDo something \nWorry is useless\n\nUseless \n\nAll you do above becomes a Substack post or something \n\nFocus \n\n\nI’m also a lawyer and a negotiator) anything come up in whichthat I love and the name a tangent field that you have a number for like social media marketing where I raise the SCO of a fortune XY company XYZ .",
          "score": 1
        },
        {
          "body": "I’m waiting to hear back on a job as well. No news is better than bad news. It still means you’re in the running :)",
          "score": 1
        },
        {
          "body": "Won't be the end of the world. I got my 1st regret from the 1st dream job I ever applied to.  I am doing just fine today.",
          "score": 1
        },
        {
          "body": "Any update? i gave interview on 26 nov",
          "score": 1
        }
      ]
    },
    {
      "title": "Initial screen interview at pfizer",
      "body": "Hello guys,\n\nI have applied to associate data engineer job at Pfizer, and now I am having the first interview with the hiring manager.\n\nI am a little bit nervous because it will be my first proper interview ( I work at Accenture as data engineering Associate but I was selected through a training that I had participated).\n\nHas anyone had a similar experience as me?\nAnd what are your advice on a situation like this? \nI suppose that it will be a little bit of behavioural and technical interview.\n\nThank you very much ☺️",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/15bo8i1/initial_screen_interview_at_pfizer/",
      "comments": [
        {
          "body": "My wife used to work at Merck so although not Pfizer, same industry. You’re very likely to get a mix of behavioral and technical/critical thinking questions. But since this is your first interview, expect intro questions like what are you looking for in your next job? And why specifically are you interested in Pfizer? \n\nSince it’s your first proper interview, I recommend you get some mock practice interview sessions in! Search for online mock interview tools but if you want my recommendation you should check out the free Whiz app: \n\nhttps://www.trywhiz.com\n\nBest of luck with your interview prep!",
          "score": 3
        }
      ]
    },
    {
      "title": "Interview in 7 hours can’t sleep",
      "body": "I have an interview with accenture federal services tomorrow I’m fairly confident but I’m losing sleep over the case study portion? Any tips?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/midpwa/interview_in_7_hours_cant_sleep/",
      "comments": []
    },
    {
      "title": "What should I expect",
      "body": "Just done with Accenture Strategy and consulting final interview last week , the interview was on Thursday, I engaged in long conversation with a partner as well , I won't say I performed the best , the partner asked me every detail he could about my studies and life and future plans passion interests etc , looked like he was interested , didn't heard back , texted a senior manager on Sunday , and he was like for now sit tight we'll get back with next steps , and now its been a week since I heard from them , I'm already expecting a rejection now but they could be clear about that right after the interview or on Monday itself. Its killing me from the inside as I still have 1% hope left ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1llbp7t/what_should_i_expect/",
      "comments": []
    },
    {
      "title": "Accenture Cyber Security Summer Internship",
      "body": "Hey everyone,\n\nI was recently invited to interview for the Cyber Security Summer Internship at Accenture in Ireland. I’m curious about the overall interview process, especially in these areas:\n\n- Technical Questions: What kind of cybersecurity or network security questions did you face? \n- Assessments: Were there any coding challenges, case studies, or online tests? What topics were covered?\n- Behavioral Questions: What type of behavioral or situational questions came up?\n\nI’d appreciate any insights or tips from those who’ve been through this process. Thanks in advance for your help!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1iy1dg3/accenture_cyber_security_summer_internship/",
      "comments": [
        {
          "body": "[40 Accenture Internship Interview Questions &amp; Answers](https://www.mockquestions.com/company/Accenture/Internship/)",
          "score": 2
        },
        {
          "body": "On the technical side, expect questions about network protocols, encryption methods, common vulnerabilities, and security best practices. They might ask you to explain concepts like firewalls, intrusion detection systems, or how you'd approach securing a network. There's often a focus on current cybersecurity trends and threats, so staying up-to-date with the latest news in the field can be beneficial.\n\nFor behavioral questions, Accenture tends to explore your problem-solving skills, teamwork abilities, and how you handle challenges. They might ask about a time you worked on a difficult project, how you deal with conflicting priorities, or your approach to learning new technologies. Some candidates have reported case studies or scenario-based questions where you're asked to analyze a security situation and propose solutions. Preparation is key - practice articulating your experiences and thought processes clearly.\n\nIf you're looking for more targeted practice, try this [interview assistant](http://interviews.chat) to prepare for tricky interview questions like these. It's an AI tool that simulates interview scenarios and provides real-time feedback. Full disclosure, I'm part of the team that developed it, but I've found it really helpful for navigating complex technical and behavioral questions in interviews.",
          "score": 2
        }
      ]
    },
    {
      "title": "Need Help To Respond A Company",
      "body": " \n\nHey everyone, first of all I would like to thank this sub for helping me out on my resume. I'm trying to get an interview from Accenture to get inside their AI or Tech consulting team. They recently responded to my job application email. Here's some summary of my study and employment background:\n\n1. Bachelor in Civil Engineering with 2.4 CGPA.\n2. 2 years of Project Management experience in Construction company (6 years ago).\n3. Presently self-employed since 5 years ago. Started my own f&amp;b business, trade cryptocurrency as my side income and am a full-time gaming content creator.\n4. I am a tech enthusiast, I love gadgets and computer hardware. On my free time, I usually play flight simulator games, play drums and guitar, scuba diving (pre-pandemic) and I enjoy getting updates and news on the tech industry.\n5. After a year of working in the construction industry, I found out that it was not something that I wanted to pursue as a career. It was not something I was passionate about doing and learning so I fail to see myself progressing even further. Also the fact that my boss was stressing me out every single day giving me insane amount of workload, I decided to quit and find what I really wanted to do, which leaves me here. I've had no luck in trying to get an interview in any tech-related company. I want to do my best on this one.\n\nSo I was given these few sets of question by them 2 days ago and I am planning on replying to them tomorrow:\n\n1. What are you pulling/pushing factor for you to seek for another employment\n2. What are your passion?\n3. What is your current and expected salary? (Will ask my friend for the average salary since she's working there).\n4. If you were to resign, how long notice are you required to serve?\n5. May I have your academic transcript? (Will include my full degree transcript).\n\nI've been unemployed for almost 5 years, so I've lost touch in how to respond to these professionally. Any ideas on what's best to answer them? Especially no. 1, 2 and 4. I'm sorry if my English is bad. Hoping to get a response from you guys!\n\nThank you so much.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/o42qhs/need_help_to_respond_a_company/",
      "comments": []
    }
  ]
}