{
  "company": "adobe",
  "post_count": 59,
  "exported_at": "2026-01-18T17:44:53.253Z",
  "posts": [
    {
      "title": "Am I delusional",
      "body": "I recently had a final round for Adobe about a month ago. I thought things went pretty alright and they told me to fill out a form regarding my offers and deadlines and that I should hear back in about 3 weeks.\n\nI told them I had 3 offers 1-2 weeks after the interview. On the deadline of the offer I reached out to them — no response. I turned down the other offers being hopeful.\n\nI got another offer this week and it’s already been 4 weeks since Adobe interview. I let them know I had another offer deadline at the end of the week — still no response.\n\nDo I just accept my current offer? I mean the compensation is competitive in regard to Adobe but it doesn’t have as much clout. It’s also in the same place. Am I delusional for holding out? I feel like at least send me a rejection or respond to my emails as a courtesy.",
      "subreddit": "cscareerquestions",
      "score": 39,
      "url": "https://reddit.com/r/cscareerquestions/comments/1pndgj7/am_i_delusional/",
      "comments": [
        {
          "body": "Accept your offer.\n\n\nIts not uncommon to be ghosted",
          "score": 177
        },
        {
          "body": "Don't ever give them all the offers you have I'd only tell them about 1. Keep any and all information that is beneficial to yourself in your privacy.",
          "score": 45
        },
        {
          "body": "Take the offer that’s on the table. If Adobe eventually gets back later with another offer just say sorry but you took too long and I’m happy to revisit in another 6-12 months. They’ll understand.",
          "score": 38
        },
        {
          "body": "You’re delusional to not take offers on the table unless you live in a situation where money isn’t a concern",
          "score": 36
        },
        {
          "body": "Jesus you turned down offers in hand while being actively ghosted by adobe?\n\nBrother, accept the other offer. If Adobe comes through and you absolutely want to work there you can renege.",
          "score": 11
        },
        {
          "body": "adobe's behavior could mean one of these\n\n\\-ur the 2nd choice so ghosted until their 1st choice makes a decision, if he rejects the offer then they give u one\n\n\\-buncha people on vacation so no decision made",
          "score": 12
        },
        {
          "body": "&gt; I turned down the other offers being hopeful.\n\nOof - yes, no response is your response.  It may not be that they didn't like you, it may be that they're just so bogged down in bureaucratic BS that they like you but can't figure out how to hire you.  You should definitely accept the offer on the table.  Maybe try back with Adobe again in a 3-5 years - you'll still be plenty young.",
          "score": 4
        },
        {
          "body": "Just accept the other offer and renege/quit on Adobe's start date. Can't believe you turned others down with no actual offer from Adobe. Yes you are delusional.",
          "score": 3
        },
        {
          "body": "Just because you accept an offer at one company doesn’t mean you have to end the interview process with the other companies. You’re not obligated to stay at a company.",
          "score": 3
        },
        {
          "body": "Adobe has rejected you buddy, why do you think they haven't answered?\n\nYou gave them a deadline and they ghosted you, you were seriously an absolute fool to decline the other offers at this point.",
          "score": 5
        }
      ]
    },
    {
      "title": "Has anyone interviewed at Adobe for a summer internship?",
      "body": "I tried searching in this subreddit and couldnt find much. Has anyone interviewed for a summer internship with Adobe? What kind of questions were you asked, what is their interview process?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/449pnk/has_anyone_interviewed_at_adobe_for_a_summer/",
      "comments": []
    },
    {
      "title": "Adobe Technical Interview Forum? Anyone have any experience?",
      "body": "I posted some time ago about an on-campus interview with Adobe, and it went well! I received back an invitation to Adobe Technical Interview Forum. Glassdoor was limited in responses concerning this topic, so I was wondering if anyone here had any experience with it and could help give some insight into the process. It doesn't seem like a guaranteed-offer type of situation, or is it? How should I prep for it? Is there something specific I need to keep in mind?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/45iorv/adobe_technical_interview_forum_anyone_have_any/",
      "comments": []
    },
    {
      "title": "I got the job! - Jr Frontend Developer",
      "body": "I'm happy to say that I finally got a job offer (I accepted) and will be starting in mid August. I'm beyond excited that I finally broke into the industry after deciding on a career change not too long ago. I've decided to tell my story, outline my learning journey and give any tips that helped me land this job.\n\nThis will most likely be a long post but I want to share what helped me in detail because it's what I would have wanted when I was still trying to land my first job.\n\n**Background:**\n\nI'm based in the West Coast, US. I graduated with a bachelors degree in Exercise Sports Science, Pre-Physical Therapy and was originally planning on pursuing a doctorate degree as well. I had no technical background whatsoever. Adobe PS, Canva, Microsoft Office, DaVinci Resolve, and Excel were the only software programs I had really used on a daily basis. I was always able to find my way around new technologies and would consider myself pretty tech-savy but other than that I knew nothing about programming.\n\n**Journey:**\n\nMarch 2021:\n\nI started off on FreeCodeCamp and went through their responsive web design course (HMTL / CSS) and completed it in July 2021. I put a lot of time into this, about 3 hours after work, and \\~1 hour during work (I was lucky enough where I had downtime to bring in my laptop and go through the course at work). I completed their projects, got the certificate and published it on my LinkedIn. I really enjoyed their web design course and gained most of my HTML/CSS foundations through that course. For about 2 months I played around with making forms, static websites, and even messing around with google chrome dev tools trying to edit the front page of my work's website - nothing special, just changing fonts, colors, title heading, etc.\n\nOctober 2022:\n\nI finally had the courage to tackle JavaScript. I began with FreeCodeCamp's JavaScript Algorithms and Data Structures - Basic JavaScript. This section / course was a bit different and not as enjoyable as their responsive web design course. I got the grasp of most of the concepts pretty well but the downfall was that it mainly only taught you syntax. At the time, I was having a hard time making a connection on how certain functions would relate to programming. Nevertheless, I completed their Basic JavaScript and ES6 sections (took me about 3-4 months), which had 113 challenges and 29 challenges respectively. Again, I spent about 2-3 hours after work and sometimes \\~30min - 1 hour during work going through the challenges. More than a few times I took several days off, sometimes a few weeks, and was not as consistent as I would have liked from October - December.\n\nJanuary 2022:\n\nI decided to do a soft reboot on my studying and promise myself that i'd get a job this year. I bought a course on Udemy - Angela Yu's  Complete Web Development Bootcamp course. Honestly, some of the material was a bit outdated (Bootstrap, Postman, Mailchimp, and a couple others) but her way of teaching was what kept me going. Her JavaScript DOM sections was really well explained and helped me grasp the larger concept of programming that I was having trouble with when doing FCC's course. I also ended up working with Node.js, Express, MongoDB, Git and Github and some API's (although her API sections is pretty weak and not very comprehensive at all. I'd recommend looking elsewhere). She had challenges and small projects (drumkit, static websites, etc.) that I would publish on my Github account once i finished them.\n\nApril 2022:\n\nThe course took me through a to-do app challenge / project and honestly it was a wreck. At this point she wasn't covering topics in detail like the HTML / CSS sections, and as someone who had no experience with backend, I was lost. Somehow I managed to get through this section and onto the blog website challenge. I learned how to use EJS and actually had a lot of fun (to this day i'm still working on it).\n\nMay-July 2022:\n\nI finally felt like I had a basic grasp on most technologies that I learned while going through the course (I have not yet completed it - 65% done) and so I decided to polish my Github, LinkedIn, build a resume specifically for frontend and start sending out applications. I mainly used Indeed and LinkedIn to apply for jobs because they both have 'easy apply' options. I made a cover letter but never sent it out apart from one or two times. I think I sent out about 60+ applications to postings that mentioned anything that I had worked with and anything with 0-5 years experience. I didn't expect to receive any calls back so I put a pause on the course and kept working on the Blog Website the course started me on but I added my own features, designs, and twist to it (I looked at real life website to get an idea of today's aesthetic). I figured that if i did get a call back I would use this as my 'big project' and talk in-depth about it. I also made a detailed ReadMe file of it with versions and updates to the website (not published yet, just using localhost) so hiring mangers could follow my progress if they chose to look at my Github. 2 weeks before 4th of July weekend I got a call from a small - medium sized company interested in interviewing me.\n\nInterview Process:\n\nBefore my interview (3 days total) I prepared as best as I could. I researched the company, goals, agenda, purpose, and even the HR lady who was going to interview me. I looked up FAQ for junior frontend developers on google and rehearsed my answers a couple times. If anyone is interested in what questions I decided to practice with I can reply in the comments or through DM. One thing is did NOT do was Leetcode. I figured this was a first round interview and since it was just me and the HR lady, I figured it was more based on who I was as a person and if it was someone they wanted to potentially work with. Because I had no prior experience she mainly asked me about my current job and problems I helped solve and what I did and did not like about it. I was also asked why I decided on a career change and my story. Overall I felt like I did well. A day after the interview I sent out a thank you letter and a recap of what we talked about.\n\nI didn't hear from them for about 2 weeks. Thankfully the interviewer liked me and asked me in for a second interview \\~4 weeks after the first one. Second interview was with the lead developer and the digital manager. Again, I didn't do any Leetcode, only about 1 hour worth of CodeWars before my interview. This time around I did a little bit of research on my interviewers and reviewed my code and projects on Github in case they asked about them. The questions ranged from \"what projects have you built?\" to \"How do you learn\" to \"What makes you stand out\" and so on. A lot of soft skill questions. When asked if I had published anything online or worked with any specific technologies I was always honest. I was asked if I had worked with WordPress before and I said no but that since interviewing last time I had tried to learn some basic skill and I think that really surprised them and they liked my eagerness to learn. I also asked about 4 questions to them that I had prepared. I made sure to throw in some light-hearted jokes only when appropriate and I think it worked well for me. I was not asked any technical questions.\n\nThe next day I got the call and they offered me the position. They mentioned that they really liked my energy and that they were looking for someone they could bring on to the team that would fit the culture and work well with.\n\nI should also mention that I used my Github as my portfolio and didn't make a portfolio website.\n\nTips from a newbie to another newbie:\n\n\\- Always be honest. About technologies you use, about your personality, about your projects, what you do and don't know, and about your background (self-taught, bootcamp, degree, etc.) One thing i put on my resume header was the words 'self-taught' so that employers knew right off the bat what my technical background was and there were no surprises during interviews.\n\n\\- Stay consistent but also take breaks. Don't burn yourself out trying to cram in more than a few hours each day. This is a marathon not a sprint.\n\n\\- Better your social skills, better your social skills, better your social skills! This is what I believe got me the job. I was personable, charismatic, and easy to talk to. Even if you don't have the best technical skills if you are a person people want to work and be around with that will take you far.\n\n\\- If you do follow projects from courses make sure you tweak it and make it your own. Add more features than what the course gives. And, publish to Github. It doesn't have to be everyday / week but make sure to showcase small projects, big projects, whatever, just publish something that shows the skills you put on your resume. If you take a course on SQL but have not implemented it anywhere do NOT put it on your resume.\n\n\\- Be active on LinkedIn. Increase your LinkedIn connections with people in the same field. I chose to connect with other junior developers because a lot of the time mid and senior level developers did not add me back (although I never reached out to them). Comment on posts, share resources, and so on. Employers will look at your LinkedIn and will most likely like to see something related to their position. I think I shared 2 posts from Github and commented on another software related post. Nothing fancy, just enough to make me look like I'm here, active, and alive.\n\n\\- Make your resume looks good. Again, I can share my resume through DM for those interested. Link to your LinkedIn and Github or your own personal website.\n\nCurrently:\n\nI'm teaching myself some WordPress and React because they mentioned they work with both of those technologies. I'm also still diving deeper into JS and continuing to work on my own personal projects.\n\nAgain, this was my personal journey and understand that people live completely different lives than me and not everything on here may be feasibly for everyone (like the amount of time I had at work to continue studying) but I hope it helps at least one person land a job or get an interview. My DM's are open and if anyone has any questions they'd like me to answer I can do so through comments as well :)",
      "subreddit": "cscareerquestions",
      "score": 541,
      "url": "https://reddit.com/r/cscareerquestions/comments/wfcr9o/i_got_the_job_jr_frontend_developer/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 84
        },
        {
          "body": "[deleted]",
          "score": 17
        },
        {
          "body": "Long ass post, I read none of it. Congrats though! Wishing you much success in your career ahead.",
          "score": 59
        },
        {
          "body": "pics or didnt happen",
          "score": 42
        },
        {
          "body": "Congrats OP!!!! Thanks for making the post. Very difficult to guess what somebody’s level and timeline looks like before they get a job. Your post laid it all out perfectly. Wish you all the best with the new gig. Please please pleeaaseeeee don’t let the imposter syndrome get to you. You earned this job. Good luck!",
          "score": 12
        },
        {
          "body": "[deleted]",
          "score": 8
        },
        {
          "body": "Congrats!",
          "score": 3
        }
      ]
    },
    {
      "title": "Should I complain during my performance review?",
      "body": "My company does an annual performance review with employees. It's basically a time when you and your manager go over the work you did for the year. Some people use that opportunity to get a promotion or pay a bonus out of it. The thing is that I'm doing work way above my pay grade and I feel so used.\n\nMy background is in mechanical engineering and I was hired at this engineering company as a data analyst with the promise of doing engineering work that will help me get my professional license in mechanical engineering. Come to find out, I'm not doing any of that. The unit doesn't even do any engineering work. I've been doing business-related data analytics work and for the majority of time, full-stack software engineering work building websites for them. They know from my resume I've built a startup before. I am 70% done building a full fledge Django web app for them and now that they've seen that I'm actually good at building websites, they literally had me stop building this project and told me to build a whole other corporate web app for them by April 1st. They're even asking for stupid things like semantic search when they know the timeframe is already short and that they need a data migration and consolidation of old hard-copy data that's scattered everywhere too. They are way over their heads and full of non-technical people. They even literally told me to build a mockup without user research or functional requirements. I've told them several times to do user research first and to make the project scope as short as possible.\n\nThey didn't listen to me, they instead told me to at least build a wireframe for them in 5 days using Adobe XD (which I told them I haven't used before) and to do user interviews alongside. I'm basically doing the work of a UI/UX designer too. And after that, they want me to start building the front-end dev. They said that they promise to hire more 'developers' but they know it takes at least 2 months+ of security clearance until someone new comes along. So for my 6 months there, I've built 2 Power Apps, 2 Power BI dash app, and near on my way to building 2 full fledge Web Apps for them by myself. I'm not even getting paid that much for this...77k. This is way below the medium pay for full-stack developers at the company and what I would have asked for a project like this...most likely 100k+. I'm soo angry and feel so used at this point but I'm trying to play my cards right.\n\nI've started looking for new opportunities in other units successfully booking meetings with the mechanical engineering managers. The company has a release policy saying that you can't leave your old unit until a time your manager wants you to leave. So I'm afraid that my manager will try and keep me in his unit for as long as possible (End of April). I've sacrificed so much to be here cause this would be the best place to get my mechanical engineering license where I live. I declined much higher-paying job offers from the ministry, a department of energy national laboratory, and other prestigious companies just to be here and get my license. I honestly don't want to leave the company. I want to leave the unit. I don't know if I should keep quiet during my upcoming performance review this December and wait for all this to unfold or just complain and demand higher pay now even though I still plan on leaving the unit anyway.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/z59spu/should_i_complain_during_my_performance_review/",
      "comments": [
        {
          "body": "Never complain. \n\nData, facts, and assertiveness.",
          "score": 16
        },
        {
          "body": "There’s nothing wrong with saying: “Bossman, this role just isn’t for me, I’m more interested in Mech Eng. You’re a great manager, and I like the team, but I’d like to explore opportunities in other departments”. \n\nI would hope any mgr would understand this.\n\nDon’t say anything about leaving the company or salary/etc. If you know you want to leave, then that’s none of the old managers business anyway.",
          "score": 8
        },
        {
          "body": "Which country are you in?  Cultural norms will impact the strategy.\n\nIn USA I would recommend a 1:1 way ahead of the annual review. Outline your achievements, demonstrate how your role, pay, and responsibilities are not aligned.\n\nTell the manager you want this resolved as a product of the annual review.\n\nThey’ll either value you or not.",
          "score": 5
        },
        {
          "body": "Complaining is rarely a good strategy in any situation, but you could use the review as an opportunity to discuss the expectations of your current role. They may not (and likely don't) have the same perception of your performance as you do or they just have a max pay range for it and it doesn't really matter how well you perform. Either way, you're probably on the right track to find another job.",
          "score": 2
        },
        {
          "body": "The real advice is to start looking for an employer that will show their appreciation for your work by ensuring that you are adequately compensated and provided a career path with reasonable expectations.",
          "score": 2
        }
      ]
    },
    {
      "title": "Adobe On-Campus Interview Questions",
      "body": "Hopefully this is fine to post here. I checked the FAQ and I think it is?\n\nI just got an on-campus interview with Adobe. Does anyone have any experience with it? My googling can only do so much and I'd like to hear from someone who's got a personal experience with it. Were the questions asked logistical questions, technical questions, or both? What were the questions? How did you do? How would you suggest I prep?\n\nFor more info, this is my second tech interview in my whole life so I'm really nervous, hahaha. I definitely don't have much experience with it.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/441jr9/adobe_oncampus_interview_questions/",
      "comments": [
        {
          "body": "Glassdoor is your best bet.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Has anyone interviewed/worked at Adobe? What's your experience like?",
      "body": "",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/46qo6w/has_anyone_interviewedworked_at_adobe_whats_your/",
      "comments": []
    },
    {
      "title": "Latest adobe intern start date?",
      "body": "Currently interviewing with Adobe- prob won’t get it but just daydreaming here haha. I have an intern RO at another company for summer 2026, trying to see if I could somehow do both. \n\nAnyone know what start dates adobe offers? ",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1orzaao/latest_adobe_intern_start_date/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Adobe SDE FTE experience? US based",
      "body": "\nHi, got an invite for interview for SDE role at Adobe with a hiring manager. Has anyone done this? Any insights will be helpful to what I can expect and what following rounds could be!",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1lqe62y/adobe_sde_fte_experience_us_based/",
      "comments": [
        {
          "body": "The hiring manager screen focuses heavily on behavioral questions and your past experience rather than hardcore technical challenges. They'll want to understand your problem-solving approach, how you work in teams, and your motivation for joining Adobe specifically. After this round, you're looking at 2-3 technical rounds that include coding problems, system design discussions, and more behavioral questions mixed in. The coding questions tend to be medium difficulty on the LeetCode scale, focusing on data structures, algorithms, and sometimes Adobe-specific scenarios around their creative tools or document processing.\n\nThe interviewers at Adobe are generally pretty friendly, but they do dig deep into your thought process and want to see how you handle ambiguity since their products serve such diverse user bases. System design rounds often involve scalability questions related to handling large files, real-time collaboration, or content delivery networks. The key is showing you can think beyond just writing code to considering user experience and system reliability. I'm actually on the team that built [interview prep AI](http://interviews.chat), and we've helped quite a few people prepare for Adobe interviews by practicing those tricky behavioral questions and system design scenarios that can catch you off guard.",
          "score": 3
        },
        {
          "body": "Hi congratulations on getting an interview. I am tired of applying to Adobe even with a referral it's a reject! Can you please tell me what helped you get an interview. Also what county are you applying to?",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "You can try mock interviews on - [www.easymock.pro](http://www.easymock.pro)",
          "score": 1
        }
      ]
    },
    {
      "title": "Lying to employers about GPA/past experience/projects",
      "body": "So, before you down vote me into oblivion, know that I have NOT done this and NEVER plan on doing it.\n\n\nHowever, I recently had a conversation with a friend of mine. His GPA at some mid-tier (ranked ~70 by US News; I'd still say mid-tier by CS standards) is a 2.79. He told me that he lied about his GPA, said it was a 3.5, and now has had a few internship interviews/successful offers in \"IT project manager\" positions (not software dev, but somewhat related). On one hand, as someone who has worked his ass off in a really tough, top-tier CS program to get a good GPA, I'm really pissed off. On the other hand, it really has me thinking: how hard is it to lie? And not even small exaggerations, but complete fabrication.\n\n\nI mean, as far as I know, someone could just get shitty grades, lie about their GPA, and even lie about past internships and projects. This coupled with understanding of LeetCode problems/Cracking the Coding Interview could definitely get you decent internship/job offers if you go to a decent university (none of these companies hiring young software devs check your GPA or call any references).\n\n\nIn fact, my friend did lie, and said that he was doing projects with IBM/Microsoft/etc and then gave some cookie cutter answer as an overview. When asked about the details, he said he was under NDA. This resulted in offers from Johnson and Johnson, Merrill Lynch, and some other small Boston tech company.\n\n\nDoes anyone else feel like this is f***ed up? I feel like employers need to be verifying at least some data from resumes. Obviously, not enough people are lying for this to be a major issue and warrant change, but its troubling. I mean, sure lying is wrong, but if it saves you thousands of hours of studying and even potentially tens of thousands of dollars in tuition and is so easy with little to no consequences, then people must be doing it.\n\n\nJust like you, I'm not into coding because its lucrative: I love coding and would do it for a fraction of the pay. But, doesn't it piss anyone else off that its so easy for someone else to lie and potentially take your spot in an interview/position?",
      "subreddit": "cscareerquestions",
      "score": 52,
      "url": "https://reddit.com/r/cscareerquestions/comments/5zmf2o/lying_to_employers_about_gpapast/",
      "comments": [
        {
          "body": "Someone once said that the key to getting a job is to list the most amount of unverifable things you can. I personally know someone who lied to get an internship, and I've had people advice me to lie.  I don't do it.  Maybe that's why I'm unemployed.",
          "score": 60
        },
        {
          "body": "That's life.\n\nYou can either choose to do things the hard way, live by your principles.\n\nOr \n\nYou can do anything to get what you want.\n\nThere is no point focussing on what other people do.  They don't have principles. No point ranting or getting frustrated by them.\n\nYou are wasting your energy by talking or ranting about this.\n\nThe industry is the same, you will meet people who won't do any substantial work, lie and extend timelines. Take credit for your work, and just be difficult to work with. \n\nSo doesn't matter what they do or how they get there. If you want to forge it like the other guy, you can, noone will judge you for that. Just focus on yourself and don't believe in the cause and effect theory too much.\n\nIn his respect he did what he needed to get interviews, he lied about his GPA. A bad GPA is generally ousted as a stupid person by many companies but that's generally not the case. I don't agree with his lying about projects though.\n\nI have had someone rip off my Android apps and get a senior Android engineer position whilst I am still struggling to get a junior position in tech. I have forgotten about it.\n ",
          "score": 23
        },
        {
          "body": "Of course you can lie, but you take an enormous risk. You'll probably suck at your job if you had to make up your entire profile in order to get a job at a competitive company, and if you get caught you're unemployed without references (at minimum). ",
          "score": 20
        }
      ]
    },
    {
      "title": "CS Career reality as a new grad from a nothing school",
      "body": "Firstly I would like to say that I’ve been applying from January 2023 until now. That’s my experience with the current market. I went, and graduated from, the University of Maryland Global Campus December 2023. Most of my knowledge came from the University of Utah. I had to leave my previous school because of new commitments and troubles with a divorce. An online school was necessary for me.\n\nThe market I have been applying to is solely remote and SLC, Utah market. My experience is as a Financial analyst as an active duty Marine. About 4 1/2 years. I have a large gap of 6 years of non work due to school and being a dad. This was an issue.\n\nThe market is absolute trash for new grads. Especially in big companies I’ve applied to such as Adobe, L3Harris, and other big companies. I even focused on government contractors but it was still difficult. \n\nNow I did receive 5 interviews for SWE or extremely similar roles. I did not receive offers for any of them. They were all from mid level companies. This is probably due to weak leetcode skills. 4/5 I moved to the second screen so it’s not like I was immediately discounted.\n\nI received all roles from CS equivalent jobs that included to and not limited to Code tester, QA tester,support engineer, and network engineer. All roles pay ranged from 50-60k. Not the best but it’s not bad considering the economy for these jobs.\n\nI also went through financial jobs and got offers on all of them ranging from 55-65k.\n\nThe job I have now is as a Business analyst that I was able to leverage my experience and the skills I learned in my studies. This is a position paying 80k + stocks and all that stuff.\n\nWhy I wanted to post this was for others to stop limiting yourself to the “popular” jobs. Look everywhere. Jobs in big companies are harder to get. Pay will be much lower if you’re not in VHCOL areas. \n\nIMPORTANT: Soft skills. \n\nI have very good soft skills probably because I dealt with high ranking individuals on a daily basis and I managed a small group of Marines.\n\nGood luck to all of you. Don’t just be a machine. Be human. Leverage anything you can and fit it to your job hunt. Don’t limit your job hunt and expand it.\n\nEdit: autocorrect grammar corrections\n\nEdit 2: some negative feelings about this post from others. I hope this reaches the target audience I tried to convey here. Good luck everyone in finding a good job. ",
      "subreddit": "cscareerquestions",
      "score": 45,
      "url": "https://reddit.com/r/cscareerquestions/comments/1954xdx/cs_career_reality_as_a_new_grad_from_a_nothing/",
      "comments": [
        {
          "body": "Damn i didn’t know you could get software skills dealing with high ranking individuals",
          "score": 19
        },
        {
          "body": "Despite some of the negative responses, I agree with you completely. I got hired on as an IT Business Analyst, making what I consider very good money. I'll have my CS degree completed in May. Where I work also often has direct CS related jobs open, so I'll be able to transition to one of those if I choose (most likely for an initial pay cut so who knows). \n\nWith lots of people out of jobs and struggling to find something in tech, there are parallel tracks and ones that may converge and that is something people could consider.",
          "score": 9
        },
        {
          "body": "&gt; The market I have been applying to is solely remote and SLC, Utah market\n\nYou have already self selected yourself out of many roles with these requirements. Therefore you cannot say the 'market is absolute trash for new grads' when you're not looking at all the roles. \n\nCold reality is that new grads don't want to work as software developers for non-tech companies in the middle of Small Town USA starting off at 50-60K a year.\n\nThe vast majority of students and new grads on this sub have an unrealistic view that they are going to get 100-200K jobs straight out of school when they are not 100-200K candidates.",
          "score": 38
        },
        {
          "body": "You are not exactly a new grad. Also veteran background helps a lot.",
          "score": 5
        }
      ]
    },
    {
      "title": "Rejected by Facebook",
      "body": "Hi guys!\n\nI started applying to a lot of companies in the last few days, and I was just rejected by Facebook for an interview. The recruiter said that \"This was a tough decision since there are so many talented candidates, but I'm afraid we will not be moving forward with your candidacy.\". I really wanted to get an interview, and did the best I could to make a have a great application:\n- I was recommended by a Facebook FTE\n- I have 3 internships at top companies doing interesting projects\n- I made a nice cover letter (see below)\n- I go to a \"target school\" for my country, where we had Microsoft, Google, Facebook, Twitter, Palantir and other companies come and recruit.\n\nI consider myself good at programming and interviewing, I'm good at algorithms, I passed interviews with Microsoft and Google in the past, and I was very confident about my chances.\n\nHere's my summary:\n\"\nI am a Senior Computer Science student with extensive experience in industry given by my 3 internships in top software companies. I am very passionate about programming and want to become the best software engineer I can be.\n\nI am comfortable at all levels of the programming stack, from assembly to python, from embedded programming (Microsoft) to distributed systems (Adobe), although I prefer lower level programming. I care a lot about proper design and making things correct, fast and scalable.\n\nI am looking for an internship after my graduation in June 2016, and thinking about full time employment if I find a team where I feel I can work hard and make a big impact.\n\".\nI also wrote some stuff about some volunteering work and some other achievements in the proper boxes. Here's my [resume](https://www.dropbox.com/s/7c8byo5qxzdhmhc/resume.pdf?dl=0) .\n\nPlease let me know if you have any advice about what I could have done better.\n\nThanks.\n\n\nEdit: I forgot to mention, I applied for an internship as a Software Engineer.",
      "subreddit": "cscareerquestions",
      "score": 26,
      "url": "https://reddit.com/r/cscareerquestions/comments/3opbud/rejected_by_facebook/",
      "comments": [
        {
          "body": "&gt;I am looking for an internship after my graduation in June 2016\n\nMost companies will not allow this. Take a look at [this job posting](https://www.facebook.com/careers/jobs/a0IA000000Cy2AKMAZ/) and note the following requirement:\n\n&gt;Must be currently enrolled in a full-time degree program and returning to the program after the completion of the internship\n\nIt's possible that you were rejected because you simply did not meet their basic requirements. Did you apply for a full-time position as well?\n\nEDIT: If I saw your application, I would suspect that you already had a full-time position lined up for September in your home country. ",
          "score": 26
        },
        {
          "body": "I strongly recommend you mask/remove the personal information on your resume before making it publicly available on reddit.\n\nTo be honest the resume is incredibly short and vague, you don't really explain what you were doing at any of your previous internships or what you have learned - you can't assume recruiters/companies have any knowledge about these organisation specific teams/tasks.",
          "score": 44
        },
        {
          "body": "/u/OldBronzebeard has it right, your resume is nothing special.\n\nApart from that, you could also just shoulder the rejection better. It looks like you've been quite successful in the past with internships. But rejections are going to happen. Its just a part of applying. Big company, small company, doesn't matter. Best you can do is shore up your resume, prep your interview skills, and reapply. We all got rejections. Its actually nothing against your skills or drive. Its just life. \n\nAlso, I'd recommend getting a job after you graduate. Do not get an internship. Experience as a full time employee will be 1000x more valuable to you and to any future employers you have. ",
          "score": 14
        },
        {
          "body": "&gt; I am looking for an internship after my graduation in June 2016\n\nInternships are only for if you're going to be returning to school afterward.",
          "score": 13
        },
        {
          "body": "A lot of comments saying your resume is really great and others saying it isn't great.  I just want to make it painfully clear: \n\nYou have great experience for your level.  Your experience probably isn't the problem.\n\nBut you have not written the resume well to reflect your great experience.  For example, your title for each job clearly states \"Intern\", your first bullet doesn't need to reiterate that you interned there.  \n\nTake some time to flush out your bullet points.  Your current bullet points are too high level.  They focus too much on facts that describe where in the organization you interned.  They don't show off your talent or passion.  What did you do, at a finer level?  Yes, you ported a module, but how?  Why did you port the module? What did you learn? What did you accomplish?  ",
          "score": 7
        },
        {
          "body": "Your resume isn't really special to be honest and just like your recruiter said, there's more than enough applicants and some were stronger candidates, that's life.\n\nMost employers don't hire interns who return back to school anyways, I doubt you'll be able to secure an internship after graduation, especially as foreigner. ",
          "score": 16
        },
        {
          "body": "I think your resume is pretty solid. The aesthetics and formatting could use a bit of work, but you have very solid work experiences under your belt. Of course some companies are going to reject you, but if you continue trying I'm sure you'll land something good.",
          "score": 4
        },
        {
          "body": "You're about to graduate. An internship isn't going to happen. Go for full-time - you'll probably get an interview. ",
          "score": 3
        },
        {
          "body": "&gt; The recruiter said that \"This was a tough decision since there are so many talented candidates, but I'm afraid we will not be moving forward with your candidacy.\".\n\nThis is a 100% canned response that doesn't really say anything. It could either mean that they've filled their internship quota, or that you truly were rejected based on your resume alone.\n\n&gt; I was recommended by a Facebook FTE\n\nThere are two sorts of recommendations:\n\n1. I'll submit your resume to our internal referral site, and I'll get a bigger paycheck if you are getting hired.\n2. I'll sell you and your resume to a hiring manager myself, and I'll put my reputation on the line for you.\n\nFirst one will only guarantee that \"someone\" will read your resume. Second one is what really can boost your chances of getting hired.\n\n&gt; I go to a \"target school\" for my country, where we had Microsoft, Google, Facebook, Twitter, Palantir and other companies come and recruit.\n\nDepending on who read your resume; it probably doesn't mean anything. A big name only has impact if the reader recognises it. \"Best College in X\" rarely makes a difference, unless you are looking for a job around X, or if X is equal to \"The World\".\n\n&gt; I consider myself good at programming and interviewing, I'm good at algorithms, I passed interviews with Microsoft and Google in the past, and I was very confident about my chances.\n\nYour resume is what failed you this time. Interview performance is only half of the picture. Luckily; fixing your resume is a lot easier than improving your interview skills.\n\n&gt; I am a Senior Computer Science student with extensive experience in industry given by my 3 internships in top software companies.\n\nThis gives me the impression that you are overselling your resume. \"Extensive\" is a fluff word that doesn't mean anything to the recruiter, and three *internships* can hardly be classified as \"extensive experience in industry\". Even if you had three *years* of experience, you probably still shouldn't use that word. It may be OK once you are a Software Architect with 10+ years of experience, but anything lesser than that only makes you sound pompous.\n\n&gt; I am comfortable at all levels of the programming stack, from assembly to python, from embedded programming (Microsoft) to distributed systems (Adobe), although I prefer lower level programming. I care a lot about proper design and making things correct, fast and scalable.\n\nThese too are just fluff.\n\nWeak resumes need to be sold in a \"used car\"-fashion, but strong resumes benefit a lot more from a modest approach. You should have the history to make your resume a strong one. Don't use a cover letter to put words into its metaphorical mouth. Let the resume speak for itself.",
          "score": 3
        }
      ]
    },
    {
      "title": "My company wants me to be a full stack developer, UI/UX designer, product manager &amp; project manager all at once for 2 projects simultaneously!!",
      "body": "I was hired at a mechanical engineering company 6 months ago. They promised me I'll just be doing VBAScripting and they'll help me do work that will advance my career in mechanical engineering. That's the only reason I accepted the role. I haven't done any sort of VBASciripting or mechanical engineering work ever since I got the job.  They're literally making me do web development projects for them because I have it on my resume. I spent the last 2 years building a startup and I'm trying to get back into mechanical engineering.\n\nThey have me first doing UI/UX work for them building wireframes &amp; mockups with Adobe XD (basically a UI/UX designer), then user interviews, user stories, sprint backlogs &amp; requirement management (product manager). Then, I  have to build the entire full-scale website both backend &amp; frontend development by myself!!. They even force stupid requirements on me in the middle of development.  Oh, plus, I also have to host weekly updates with clients &amp; share the project status and live demos, and also consult on the project direction (basically doing project management)..It's crazy.  Now, guess what..they now want me to stop what I'm doing and do a whole corporate project for them.. simultaneously with the current website I'm doing for them....Plus work 2 hours overtime... every day for the next 20 days. Enough is enough. They're only paying me $37 an hour. I'm definitely planning on leaving the company for another one but in the meantime, I'm going to demand they re-issue my contract and pay me more.. \n\nI just don't know how much to ask them for? I know mid-level full-stack developers in Toronto on average make $65 an hour but I'm obviously doing more than full-stack development at this point. I'm basically a whole product agency. I don't know. Should I ask for more? What's the typical rate for this kind of thing.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/za7qcf/my_company_wants_me_to_be_a_full_stack_developer/",
      "comments": [
        {
          "body": "There is no typical rate for \"doing the work of several different kinds of professionals all at once\" because that's not an industry standard job. You 'deserve' the pay of several people because you're doing the work of several people. But that company won't pay you what you deserve, because they were too cheap to hire the several people that they realistically should have hired to do your job.\n\nI'd say, learn what you can from the experience and start interviewing.",
          "score": 5
        },
        {
          "body": "\"No\" is a complete sentence.\n\nThis is completely unreasonable and I don't care how good you are, you **will** fail because you've been set up to fail, and fail hard.\n\n&gt;they now want me to stop what I'm doing and do a whole corporate project for them.. simultaneously with the current website I'm doing for them\n\nThe proper response here is \"it is impossible for a single person to do both of these things. I need you to decide which one is the top priority, and I will work on that thing until it's completed.\"",
          "score": 4
        },
        {
          "body": "Wow, think of how much you're going to get paid doing 8 jobs at once. You'll break 7 figures, certainly.\n\nGreat deal!",
          "score": 2
        },
        {
          "body": "Considering what kind of people you're dealing with, safe to assume that whatever you ask for, they won't give you.",
          "score": 2
        },
        {
          "body": "VBAScript is not a big loss, frankly. Just shoot for a manager position with all these. You are spread to thin. You end up screwed if you will have to look for a job in any individual of them.",
          "score": 1
        }
      ]
    },
    {
      "title": "I got into DevOps from zero experience but now I'm lost. Could use some advice how/if to continue this path",
      "body": "Warning: wall of text.\n\nI'm a 31 year old guy who originally studied game-design and applied-psychology. Worked at a computer store and have spent a lot of my life on computers but mostly as a consumer (gaming).\n\nAfter my studies I had no clue what I wanted to do(story of my life). I lived abroad for a while and did a season as a ski/snowboard instructor. When I came back I wanted to have a serious career and buy a house. Luckily for me tech people are so high in demand there was a while where some traineeship companies would hire you purely based on a capacity/personality test and not based on your degree. I did well at the test and we had a good interview and I was hired. How it worked is they would find me a job in IT where I would \"learn on the job\". So no technical bootcamp. After 2 years I would then be officially hired by the company I was working for.\n\nEventually they found me a job at a credit card company. Finance seemed super boring to me at first but the interview actually gave me a really good vibe and I was very lucky to get into a super fun team. I was together with 2 other juniors and 2 very senior technical coaches would basically train us and put us to work.\n\nThe start was very hard. I literally didn't know anything. Barely ever used the terminal or an IDE before unless you count adobe flash/ActionScript. But again I was very lucky to have the senior coaches that would put a lot of effort into us.\n\nOver the last 2 years I learned how to use Git, gitlab-ci, Ansible, ssh, Python, bash, Docker, docker swarm and linux. We also spent time on core concepts such as networking, containerization &amp; VM's. \n\nWhat we did was build CICD pipelines for the dev teams and deploy &amp; maintain developer tooling such as GitLab, nexus repository, nexus-IQ, Sonarqube, and a bunch of others. We also wrote 2 simple Pythons app's to help with automation of certain tasks. During all of this we try to lead by example and use best practices such as clean code, test driven development (when building the python apps), document everything, automate everything and run everything in docker containers.\n\nAs you can imagine after about 2 years I am no expert in any of the above(however I can get very creative with bash, gitlab-ci &amp; docker). This is nagging at my confidence as someone with no previous ops or dev experience.\n\nAfter almost 2 years working from home is starting to take its toll on me. The two technical coaches are long gone (they had temporary contracts) and my teamlead also left about 4 months ago. I feel it has left our team without aim and I have a very hard time staying motivated.\n\nI'm not one to build an app or do kubernetes the hard way purely as a hobby/in my hours I have left over at work. Instead I piss away those many hours watching youtube/twitch or scrolling reddit. It has left my memory &amp; focus in a very poor state making it even harder to do my work. The worst part is I am getting away with it. But I feel guilty about being unproductive (mostly to myself) and it makes me unhappy. Any personal projects I started I never ever finish (also story of my life). I did the azure fundamentals (doable) but the azure administrator training was so boring I don't even dare to try the exam.\n\nI would love to use all this paid time I have more productively but this whole situation has left me doubting if I am even cut out for this work. I've used computers to distract/escape reality all my life and now it's biting me in the ass. I would love to hear of any of you ever had a similar situation and if you were able to get out of it (by changing companies perhaps) or if you maybe even switched careers.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/sis5bb/i_got_into_devops_from_zero_experience_but_now_im/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "Sounds like you should try a different job before you change career. Maybe try something less devopsy. You sound depressed anyways and should fix that first before you do any rash decisions. Go to the doctor, get your blood analyzed, start working out, start socializing somehow. Do small changes gradually and you will see results in your mood",
          "score": 3
        },
        {
          "body": "It's not clear to me what you do day in day out. Ideally you'd make two lists, daily tasks and tickets (so the stuff that breaks) and then the other one for larger-scale projects that you could work on or contribute on. If daily stuff isn't taking up most of your day (it shouldn't) then there could be big projects you can start.\n\nNot everyone is great at coming up with their own work and they own projects. If you're not being employed fully because your company doesn't see extra needs and neither do you, you might need to look for work in a bigger structure and something with a bit more supervision?",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "What's it like to intern at Adobe?",
      "body": "I've accepted a summer internship offer from Adobe to work at their San Jose offices this summer and since this is my first time interning at such a big tech company I was just wondering what I can expect from it and if anyone has interned or even worked there before just to have an idea what to expect.",
      "subreddit": "cscareerquestions",
      "score": 17,
      "url": "https://reddit.com/r/cscareerquestions/comments/aznwn3/whats_it_like_to_intern_at_adobe/",
      "comments": [
        {
          "body": "One word: Exhilarating.\n\nIt's very modern and the space is extremely dynamic. Depending on which team you're on it's going to be very challenge yet extremely rewarding.\n\nI worked on the Premiere team.\n\nIt was very exciting and I learned **so** much about C++ the 3.5 years I was at school at the time did not do justice to.\n\nFull disclosure: unfortunately, I did not get a call back to become FTE when I graduated, but the opportunity was definitely a once-in-a-lifetime opportunity for me.\n\n Having Adobe on my resume definitely opened up a lot of things for me as well.\n\nIt's been about 7 months since I graduated but, I'm currently grinding that leetcode for my first FTE job but the first thing most recruiters want to know is about my time at Adobe.\n\nDefinitely do it! \n\nCongratulations!!",
          "score": 23
        },
        {
          "body": "Also interned their as a Biz Analyst on the ADLS team. Good opportunity and the name definitely opened a ton of doors.  They provide you with really nice benefits while there. Just network as much as possible to secure that return FTO. \n\nFeel free to PM me if you have any other questions ",
          "score": 4
        },
        {
          "body": "Hey, I literally just signed my offer to intern with Adobe in San Jose as well this summer. Let's connect. Congratulations ",
          "score": 3
        }
      ]
    },
    {
      "title": "Salary Question: $180k + equity for a Senior Site Reliability Engineer role at a large tech company?",
      "body": "I'm currently interviewing a bunch of places (Adobe, Zoom, MongoDB, Crowdstrike, Digital Ocean, FirstData, Freshly and similarly sized businesses), and I wonder if I've screwed myself on a [Senior SRE role's](https://www.redhat.com/en/topics/devops/what-is-sre) salary because I am generally ignorant of salary bands. \n\nI'm a Linux Systems Engineer by trade, with ~10 years of relevant experience. I've worked myself up from a help desk type role, and I've been into computers since I was a kid, so I have a variety of interesting contextual experience to talk about in an interview that make me sound better than I actually am. \n\nDuring a first interview with HR, I stupidly answered their \"so, what are you thinking for compensation?\" question with an actual number (180k-ish) instead of pushing back and having them state their own in-house salary expectations. \n\nThe recruiter excitedly jumped at $180k and said \"Oh well we can definitely hit that mark!\" in a way that made me instantly regret saying a number. I know better than to do that, I've negotiated my two previous salaries by getting a number from them first, and I'm at a loss for what the hell happened. But, I digress.\n\nDoes $180k + equity + benefits sound High, Low, or Just About Right for a position like this? They're a company used to paying SF/NYC salaries (I live in the Philly metro, so my cost of living is a step or two down from those cities) so they are used to compensating people well. \n\nAre Senior level SRE's making mid-$200's low $300's and I just shot myself in the foot?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/unecab/salary_question_180k_equity_for_a_senior_site/",
      "comments": [
        {
          "body": "Honestly 180k base is reasonable for Philly I think. The recruiter probably thought you meant 180 total comp though.\n\nBut yes 200-300k TC is reasonable for these type of large companies \n\nJust my two cents though\n\nYou can take a look at levels.fyi but idk how good their data is for SREs",
          "score": 7
        },
        {
          "body": "So I think I can help with this. I'm currently helping build out an SRE team at a fintech company. Currently our senior range is 300-400k roughly, and tbh if you have 10yoe as a systems eng you could easily qualify for staff level, which should put you even higher.",
          "score": 5
        },
        {
          "body": "I’m a senior SRE. It depends on your area. I make 220k. What’s your TC?",
          "score": 2
        }
      ]
    },
    {
      "title": "Adobe final round questions",
      "body": "I have a final round interview with Adobe for technical account manager role. If someone has gone through this, please share your experience. It would be much appreciated. Thanks.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/yoo5i5/adobe_final_round_questions/",
      "comments": [
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Adobe Software Engineer Interview Preparation Tips",
      "body": " Hi everyone,\n\nI'm interviewing with Adobe for a software engineer position next week. The interview will be with a panel of engineers, and it will include a design review, a code review for a coding challenge, and a technical interview. I'm wondering if anyone has any tips or advice on how to prepare.\n\nI've already been through the online assessment, which consisted of a coding challenge and a few behavioral questions. I think I did pretty well on the coding challenge.\n\nI'm mostly worried about the design review and code review. I've never had to do either of these in an interview before, so I'm not sure what to expect. I'm also worried about being grilled by multiple engineers at once.\n\nAny advice would be greatly appreciated!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/14qubef/adobe_software_engineer_interview_preparation_tips/",
      "comments": []
    },
    {
      "title": "I did an interview even though I was in a bad place mentally &amp; it lead to me getting a remote job and making twice my previous salary.",
      "body": "I was employed in West Virginia as a graphic designer for $36,000 with 8 years of experience at my place of employment (I had worked there since right out of college basically). Been looking for a job since August after they refused to get my salary to at least market rate. I had a few interviews and one job offer that wasn't good enough so I just kept applying anywhere I could up through January.\n\nStarting in March I was dealing with a lot of depression and anxiety and could not fathom doing an interview.  Later that month I got an invite to interview for a remote graphic design position in another state. I accepted it reluctantly, then REALLY wanted to cancel it completely because I was worried if it went badly I would spiral even further into a mess. But thankfully my husband encouraged me to do it even if it goes bad \"just to have the practice.\" Again I reluctantly decided to do the initial interview. \n\nI thought I interviewed ok and I had a great chat with the HR person and they sold me on their company - the best part was that they said the salary range was $60-65,000. I honestly never thought I'd make more than $50,000 anytime soon. (In WV we rank #5 for lowest median incomes - I had very low expectations haha.) Anyway - I didn't think I'd hear back from them.\n\n1 month later I got an email for a second interview, by that time I had my depression under control (ty meds) and was feeling better. That interview went well and led to 3 more interviews with different people and I got a job offer for a starting salary of $70,000!  I accepted and I start next week! \n\nSo yeah - always do the interview I guess? \n\nSide note - Shout out to the /jobs discord for helping me out with my different interview questions :)",
      "subreddit": "jobs",
      "score": 1205,
      "url": "https://reddit.com/r/jobs/comments/v5o910/i_did_an_interview_even_though_i_was_in_a_bad/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Congratulations!!",
          "score": 57
        },
        {
          "body": "Congratulations and thank you, you have no idea how much I needed to hear that",
          "score": 42
        },
        {
          "body": "Any help landing a job like that? Where would I even begin looking?",
          "score": 25
        },
        {
          "body": "Congrats! You definitely deserve better.",
          "score": 30
        },
        {
          "body": "Congratulations!!! That's so fantastic! Take care of your health, doing graphic design , you need an awesome new padded and supportive chair. Maybe get a desk that lets you stand and sit. Take some breaks to move around. Wow, this money will change your life and you deserve it!!!!👍😊",
          "score": 12
        },
        {
          "body": "Congratulations. 5 interviews though in total for one job? What a joke on the company’s behalf. Why make it so difficult?",
          "score": 11
        },
        {
          "body": "Congrats!!! I did the same recently and it feels like hard work finally paid off 🤗\n\n I will also take this time to remind everyone that more than 5 years at any employer is TOO long!! The longer you stay (without huge promotions and moving up of course), the lower your effective salary because of inflation (even more so recently). Unless you land that employer who gives you a giant bonus and/or raise evey year to make up for that deficit, make sure you're ways aware and looking to see what the market looks like!",
          "score": 10
        }
      ]
    },
    {
      "title": "It’s been a year and a half, and over 300 job applications, and I still can’t land a job. What am I doing wrong?",
      "body": "I’ve applied to over 300 jobs since last May, and out of those, I’ve gotten 4 interviews, then no word after the interview. It’s always the same thing; \"sorry we have decided not to move forward at this time\". I think my interview etiquette is fine, I'm not a jackass, I make eye contact, I answer the questions in full, I don't say \"ummm or uhhhh\" a lot. I would like to think as myself as personable but I'm starting to doubt that. \n\nI graduated from a state school with a B.S. in Criminal Justice (thanks for scholarships and whatnot) with a 3.5GPA. I was a member of the honor society, but wasn’t able to get any internships my senior year. Since I commented over 2 hours a day to school 3 times a week, I didn’t really care for extracurricular like other frats or clubs. I barely made friends since all I wanted to do was go to class and get everything over with so I could go home and do my day job so I can afford to live. \n\nHere’s another problem, my last actual job was in 2013. I worked retail for 6 months, then had a 6-month contract stint at a biotech firm doing data entry thanks to my dad. When I moved to go to college, I moved furniture on my own through Craigslist, helped stage houses, and do yard work all under the table. I didn’t pay taxes on that money earned, which is why I don’t include it in my resume. Which has kinda sucked since I’ve been applying to state and federal jobs and I don’t want to risk putting it on there. \n\nI’ve applied to over 300 state and federal level jobs in Criminal Justice. I would like to do something related to the degree, but not get shot at. Since I’m fat, I also don’t want to join the police department. I’ve also applied to probably 100 or so insurance adjustor entry level positions or entry level bank fraud positions and the **only** call back from those I’ve gotten is an interview to cold-call sell life insurance through some sketch insurance company I’ve never heard of. \n_____\n\nIt’s honestly depressing, and I don’t know how much more I can take of this. To be rejected over 300 times for this bullshit make me want to go into the woods and not come out. \n\nI’m in Virginia, and 200 or so of the job applications have been in the VA / DC / research triangle, area. 100 or so have been as far south as Georgia, and as far north as Pennsylvania. I’ve been trying to stay on the East Coast because that’s where my family is, and I can commute to the job interview, but that hasn’t happened yet. However, at this point, I’d move to Colorado or Utah if I could get a job. I have no debts, and would consider moving ANYWHERE at this point. \n\nI’ve used USAJobs, state job boards, Governmentjobs.com, Indeed, Snagajob, and nothing has helped. I’m honestly ready to throw in the towel. \n\n\nI would classify myself as intermediate with Office Suite, I know how to do a lot with Excel and Word, except Pivot tables and VBA scripts, I’m still trying to learn that. I know how to use Adobe’s Suite, and have considerable knowledge with PS, AE, Premiere, and Illustrator, but I doubt I will ever use Adobe’s Suite in a workplace setting. \n\n**[Here’s my Resume]( https://i.imgur.com/BRD3Q9K.png).** What am I doing wrong? What can I do to improve my chances of getting a call back? \n\n______________\nRant: Yesterday was the tipping point, where I had applied to a low level government intelligence job over the summer and had a phone interview. It went great, the interviewer and I vibed (as much as I hate that word), and I was selected for the next round. I waited a month for their HR division to email me and yesterday I got an email asking for my transcripts so they could move forward. An hour later I get a recall notice for the email from HR. I thought nothing of it and sent my transcript and asked if there was anything else they needed from me. This morning HR got back to me with “The email was sent in error. Unfortunately you were not selected for a position with XXXXX. I apologize for the inconvenience.” That was literally a dream job and to get selected for the 2nd round then apparently not just pissed me off. \n\n\nI honestly don't know what to do now, and I think I just wrote all of this to get it all off my chest because my parents and friends don't know that I'm struggling this fucking hard to get a job. All my friends have careers at this point, and I'm still moving furniture and doing odd jobs to make ends meet, and I still don't declare anything on taxes since I live in a room in my uncle's condo that he rents out. If I were to declare my income I wouldn't be able to pay rent, and eat rice and beans. It's a good thing I graduated without any debt. ",
      "subreddit": "jobs",
      "score": 359,
      "url": "https://reddit.com/r/jobs/comments/9la95t/its_been_a_year_and_a_half_and_over_300_job/",
      "comments": [
        {
          "body": "I'm running late for work just to reply to this so my feedback will be quick and dirty\n\n&amp;#x200B;\n\n1. Your resume is as plain as white bread. Do yourself a favor. Find a modern and professional resume template. It doesn't have to be fancy but it should be more than just your name and some bullet points. If I have to review 100+ resumes (I've had to before, its not unrealistic) then each resume gets a 15 second cursory look from me. If the resume format and content within doesn't catch my eye in 15 seconds... it goes in the bin\n2. Your resume is copy pasta. You need to customize your resume for EACH job you apply for. You also should be mirroring some of the language in the job posting in one or two of your bullet points in your resume. For example, if I read in the job posting: **Strong Leadership skillset with a focus on people management** then I may find a piece of my experience that mirrors that. I might have a bullet point that says **As youth staff director for Cub Scouts of America, demonstrated leadership skillset with a focus on people management**\n3. Your resume is a bit forgettable. It doesn't stand out, it doesn't wow me. And it could. [Here are a few simple observations](https://i.imgur.com/TWcKI8z.png) (I could give you more but late for work).\n4. Lastly, what is your networking like? 300 applications and no hits? Time to move beyond simply applying. What field are you trying to break into? I'd suggest the following\n\n* **LinkedIn** \\- search for and add people in your desired field (even if you dont know them). Look for them to post opportunities.\n* **Temp agency** \\- Find a temp or contracting agency that can get you into a company that works in your field. Bust ass then get hired on full time.\n* **Get certification in your field** \\- Your field is bound to have certifications. Find out what they are, pay to take them, and get certifications that are desirable to your company. And if you are taking in-person classes, network with folks in those classes\n* **Network Network Network -** Jobs are sometimes.... and often more about who you know. Period. Know someone in the field or company you are trying to get into.\n\n**Edit:**\n\nAdded this below but in case you don't see it:  \n\n\nI am also going to add in this. I think your approach is wrong. State and Federal are nice but I think if you wanted to get in there, you should have been an intern for those things while you were in college. Since you are going down criminal justice... look for entry level investigation jobs. Many banks will have fraud investigators. Many stores will have physical security or fraud investigators. Many insurance companies have investigative roles. But I'd say you need to get in some real world experience first. Getting 5 years experience in investigations field will open you up to get your foot in the door at government agencies.",
          "score": 408
        },
        {
          "body": "[deleted]",
          "score": 119
        },
        {
          "body": "I am a hiring manager (VP).  I would not hire you, or select this resume for further review or phone screen.\n\nIt has no detail; no facts, no metrics, nothing that comes through as \"I did this and I'm proud of it\".\n\nSorry if this comes across as critical or blunt.  Thought you'd rather know the truth.  If you are not offended, and would like to discuss further, pm me and we can talk.",
          "score": 159
        },
        {
          "body": "I don't understand how colleges are letting kids graduate without giving them the skills to find a job. And I don't understand how people keep doing the same thing and expect different results. You would think you would learn after not getting a response after say, 100 applications? \n\n Your resume is...not good. You need to invest some time into updating your resume and bettering your skills instead of wasting your time applying to 300 jobs you aren't going to get. Also, applying to jobs online is the worst way to get a job. Start reading some books and doing research on hiring trends in your field and best practices for job searching. \n\nReach back out to your school and get career help from the alumni department. That's what they are there for. ",
          "score": 38
        },
        {
          "body": "It’s worth noting that the entry level job market is atrocious and unfair—Genuine entry level jobs don’t exist anymore. Most college grads struggle to find relevant work unless they have some sort of connection into a company. I know a Physics grad who’s working at Macy’s. It’s unreal. Welcome to the new economy. You’re not at all alone. \n\nI graduated with honors in applied mathematics, have lots of technical skills, a pretty good resume, and yet I still can’t get a job. It’s just the way things are now.",
          "score": 47
        },
        {
          "body": "&gt;I’ve applied to over 300 state and federal level jobs in Criminal Justice\n\nTarget non-profits in the Criminal Justice system. Volunteer in one if you have to. \n\n&gt;Here’s another problem, my last actual job was in 2013.\n\nThis is a red flag unfortunately, because a lot of individuals go straight to the work experience first, and then to the education (most jobs just want you to have A degree, regardless of majors). A typical resume is read for 10 seconds before it is toss. You have to get something recent. ANYTHING, but it has to be recent. Don't worry if its volunteering. Hit the ground running with non-profits. I really think that's where you can get in. \n\n&gt;I know how to do a lot with Excel and Word, except Pivot tables and VBA scripts, I’m still trying to learn that\n\nLearn them. And put them on your resume. It will make you more marketable. \n",
          "score": 24
        },
        {
          "body": "Federal government jobs are the some of the hardest jobs to get into honestly. Though you have to tailor your resume to each job using the critical skills listed on the posting. Honestly for that kind of work without any experience it's going to take forever because your competition most likely all has federal and local government experience already so I would just keep trying and do what the other people said about your resume and Networking look up Meetups and stuff like that. Someone just knowing your name makes you more likely to get an interview.",
          "score": 20
        }
      ]
    },
    {
      "title": "These job requirements are getting ridiculous",
      "body": "Job Description\nLooking for someone who knows all shortcut keys for Adobe Illustrator and is so proficient they are a 15 on a scale of 1-10.\nMust be able to do 51 things at once, blindfolded with your hands tied behind your back.\nDeal with ridiculous deadlines and get a full weeks work out, every day.\nIf you have what it takes, we need you now.\n\nEdit : yes this is actually on indeed",
      "subreddit": "jobs",
      "score": 300,
      "url": "https://reddit.com/r/jobs/comments/hyv5w2/these_job_requirements_are_getting_ridiculous/",
      "comments": [
        {
          "body": "Job hunting is just bs now.\n“Please upload your resume” \nUploads resume \n“Please fill out this 45 minute, 15 page questionnaire for no reason. “",
          "score": 104
        },
        {
          "body": "Customer support representative (phone)\n\nRequirements: Master’s degree in STEM field, preferably from top university.  5-10 years experience\n\nPart time as needed, $16/hr",
          "score": 216
        },
        {
          "body": "Ya whenever i filter to entry level positions i get some that requires 5+ years experience wtf. And the pay is 40-50k a yr with designation too. It makes 0 sense if i had a designation and 5+yrs experience why would i take a 40-50k jobs when i can easily get 80k+. \n\nEntry level positions should be 0-2yrs max imo",
          "score": 60
        },
        {
          "body": "Okay, I just got a message for an entry level IT position asking me to make a video for them about why I want to work for the company. The expletive is this expletive? You’re going to pay me $12/hr, what I could make flipping burgers at McDonalds, and you want me to go out of my way to write a script and audition for your job before I even get a chance to have a phone screen? I thought COVID was going to mess up the job market, but it’s getting crazy out there.",
          "score": 115
        },
        {
          "body": "\"Salary: $10/hr or minimum wage, whichever is lower\"",
          "score": 56
        },
        {
          "body": "HR depts are stupid. Must have 30 years of experience! \nFull availability! $12 an hour\n\nLooking for a paralegal ninja!\n5 attorneys\n12 years of exp\nEXCEL A HUGE PLUS\n$15 an hour\nGET WRECKED\n\nLooooool",
          "score": 38
        }
      ]
    },
    {
      "title": "The qualifications for content creation jobs is insane",
      "body": "I’m trying to transition from Graphic Design roles into more Content Creation roles and the qualification are insane. I have experience in Graphic Design and content creation but a lot of full-time jobs are asking for qualification lists like this:\n- Proficient in Adobe (Photoshop, Illustrator, InDesign)\n- Film experience (DSLR, phone recording, audio)\n- Video editing (Premiere, CapCut)\n- Social Media Management (scheduling, Hootsuite, etc)\n- Google Analytics, Facebook Analytics\n- HTML/CSD/Wordpress\n- Interviewing Skills (like being a reporter)\n- Established Influencer status for yourself and company brands \n- 5 years experience \n\nAnd they’re paying like 50k a year. Like holy shit that’s like 3 full-time jobs in one. My last design job paid like $59k for only the proficiency in Adobe softwares. I don’t get it. \n\nSorry little rant.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1nzv7k3/the_qualifications_for_content_creation_jobs_is/",
      "comments": [
        {
          "body": "I have a BA in COM. I used to know the entire Adobe Creative Suite, Lightwave 3D, but I couldn't be creative to save my life.",
          "score": 3
        },
        {
          "body": "Hahaha…yup\n\nI started off as a photo editor. By the time I left my job, I was required to know Photoshop, illustration, design (layout, color theory, typography, accessibility), animation, video editing for social media (“Can you make us go viral?” sure let me dig out my magic viral wand and wave it around), audio engineering (podcasts!!!!) and have proficiency in JavaScript. Was slowly iced out because I couldn’t make beautiful web apps on the fly. \n\nI’m glad to have all these skills now but it’s truly ridiculous",
          "score": 1
        }
      ]
    },
    {
      "title": "Unable to Get a Job, Unsure What to Do",
      "body": "I've applied for jobs at multifarious places, including retail stores, fast-food restaurants, and parks. I also applied to various student jobs (not Federal Work-Study—I didn't get that award) at my university. But I've gotten none but a few rejections and one interview, a few days after which (today) I was rejected.\n\nMany of the places to which I applied haven't gotten back to me, so I visited some of them in-person—namely, Publix, Ross, and Five Below: Publix isn't hiring. Ross told me to apply online (I did) and wait until they get back to me; Five Below said the same.\n\nI'm an 18-year-old male with no job experience. I did volunteer at two different places during my junior year of high school, and I have an Adobe Premiere Pro certification, but that's about it. I'm starting to fear that not accumulating work experience over the course of high school has strained my prospects of acquiring a job in futurity.\n\nTo make matters worse, I need a job quite urgently.\n\nI might try to visit the CVS, Target, and AutoZone locations near me, but other than that I'm not sure what to do. Any advice?\n\n(My caregiver, my grandmother, won't let me apply to 7-Eleven/Speedway or any gas station, so that's off limits. Furthermore, I live in South Florida \\[I'm not sure whether it's necessary that I mention that but I thought I should just in case\\].)",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/1ncoxbu/unable_to_get_a_job_unsure_what_to_do/",
      "comments": [
        {
          "body": "Go over to the r/jobs discord server and ask them to take a look at your resume.  If you have trouble getting interviews it is most often a bad resume.  If you get interviews and still fail ask for interview advice.",
          "score": 2
        },
        {
          "body": "Golf course",
          "score": 1
        }
      ]
    },
    {
      "title": "DFIN Company Interview via Teams",
      "body": "Hello, i recently got a mail from some company saying that \"We at DFIN Solutions acknowledge your interest in Data Analysis and we are excited to invite you to interview for our paid Data Analysis Internship position.  \nWe received your application via Handshake's School Recommendation &amp; Network Management and we are delighted to inform you that you have been considered for the position. Your background and education were satisfactory upon review of your resume by our recruitment specialists and we have shortlisted you to advance to the interview phase. To participate and hear more about DFIN Solutions and the Internship position, you are to connect with our recruitment panel over Microsoft Teams.  \nWe require that you set up an account with Microsoft Teams and download its application on your mobile device or desktop. After this process, you are expected to reply to this email stating your Microsoft Teams email address. Our hiring team will then reach out to you for your interview briefing and other comprehensive details. Please note that we sometimes encounter glitches with connections to generic email addresses, so a Teams account with an institutional domains is most preferred.\"\n\nand after i gave my mail id, one woman texted me on teams and the whole interview happened in text. here  are few pictures attached. now, is it real or is it scam? i felt scam bcoz of interview in teams but they say they are providing pay even for training period. so, what do i do now\n\nhttps://preview.redd.it/u4qwa86ksmhf1.png?width=1262&amp;format=png&amp;auto=webp&amp;s=f635bb58664027b9337e94e4c57fb87ba7cdf90b\n\nhttps://preview.redd.it/4nuhfg6ksmhf1.png?width=1241&amp;format=png&amp;auto=webp&amp;s=a265f6a94e53526b9e2d0ec1d7ce53331cfbff8e\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1mk64ak/dfin_company_interview_via_teams/",
      "comments": []
    },
    {
      "title": "Weird Job Offer",
      "body": "I've been looking for work for about a month. Day before yesterday I received a brief email that said this company got my application via LinkedIn and they had some questions about how I approach Project Management. I've applied to probably a hundred or more PM roles in the last few weeks, so I didn't really remember the JD, though I do remember applying to remote PM roles based out of the same state.\n\nI thought it was some pre screening thing, responded to the questions to the best of my ability, figuring it was some kind of screening process and they'd call or email to schedule a proper interview.\n\nThis morning I got an email saying they were going to mail me a check to purchase equipment for a home office, I would begin virtual training nearly immediately. The pay rate is hourly and competitive. I'm supposed to email them my information to get a copy of an offer letter.\n\nThis feels really weird and I'm not sure if I need to do something to protect myself in case this is a scam. I've googled the company name and they do not have much of an online presence The domain associated with the company on LinkedIn resolves to a website with a different company name.\n\nDoes anyone know if this is a scam?\n\nEdit: Thanks for your responses everyone. I will not be providing any additional information to these people. I'm going to wait until Monday to see if they actually send the alleged offer letter so I can include it in my FTC complaint. Kind of a bummer since I thought for a second there my job search was over.\n\nEdit 2: Got the “offer letter” and whoa. Here’s a sample in case anybody is curious:\n\nCongratulations!!!\n\nThe attached is your Letter Of Employment, kindly append your signature and revert with a copy signed.\nKindly Note, that, on the appenditure of your signature means your acceptance of the job offered to you by DeVilliers Technology Solutions.\nConsequently, you are required to take the delivery of the following equipment: this is a standard process to ensure your home office is set up according to our employee standard working environment.\nDeVilliers Technology Solutions takes responsibility for providing funds for the purchase of the equipment prior to delivery. The standards includes but not limited to the following: iMac Pro 27-inch Retina 5K Display 32GB DDR4 ECC Memory 1TB SS Storage Hp LaserJet Pro M15w Printer. External Hard Drive/Backup System, Headset with Microphone, Network Router, Surge Protectors and Automated Time Tracker, Adobe Dreamweaver CC, Crimson Editor, Surround Sound Studio Speaker, Ultra Wide Video Monitor, Color Grading pad.\nYou may include other equipment you deem necessary to enhance your working environment.\nNOTE: Kindly attach a copy of your ID and send via email to me (alongside with the signed employment letter: this is for your ID verification for employment confirmation purposes.\nUpon the receipt of a signed copy of the Letter Of Employment, DeVilliers Technology Solutions shall mail to you a check to the tune covering the total cost of equipment. Training commenced as soon as equipment are delivered. Your time management skill is required here and subject to further discussion.\nAll other vital aspects of the company policies shall be treated on a separate induction day.\n\nEdit 3: They called me so I have their number. I told the guy I wasn't interested any longer and hung up on him.",
      "subreddit": "jobs",
      "score": 294,
      "url": "https://reddit.com/r/jobs/comments/12u8t0c/weird_job_offer/",
      "comments": [
        {
          "body": "That screams scam",
          "score": 384
        },
        {
          "body": "Scam. Never do that equipment thing.",
          "score": 93
        },
        {
          "body": "This is a known scam. Do not attempt to cash the check",
          "score": 75
        },
        {
          "body": "Anything involving a check you have to cash is a scam. Period. Real companies send you equipment.",
          "score": 57
        },
        {
          "body": "Scam. They'll give you a check, then ask you to send the rest back. The check will bounce after you sent the money.",
          "score": 47
        },
        {
          "body": "Scam.  They want you to purchase supplies from their vendors.  Their vendors are part in d the scam.  They will pressure you to send money to the vendors before the check actually clears your account.  The check will bounce and you will be on the hook for all the money you sent to the “vendors” and all the fees charged by the bank.",
          "score": 32
        }
      ]
    },
    {
      "title": "Interview for a position that requires Adobe &amp; Mac experience",
      "body": "Hi all,\n\nI have a second interview for an administrative assistant position that requires Adobe and Mac experience.  I have some experience but it's been about a year since I used either Adobe programs or a Mac and would like to re-familiarize myself with both. Are there any how-to guides, videos, or websites that anyone could recommend?  I've googled and gotten some decent results but I figured it never hurt to ask for other people's recommendations.\n\nAny tips and tricks are greatly appreciated as well.  This job pays over twice as much as I currently make and it's in my dream city so my hopes are high with this one.   ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/az45eo/interview_for_a_position_that_requires_adobe_mac/",
      "comments": [
        {
          "body": "Apple’s discussion/support communities are a pretty good resource. One thing though is if they’re asking for experience in those systems they’re probably going to want examples of times and projects that you used those programs in the work environment. ",
          "score": 2
        },
        {
          "body": "Udemy?",
          "score": 2
        }
      ]
    },
    {
      "title": "realized mid-way through \"job interview\" that the job is a scam",
      "body": "# Context: I was writing this post WHILE DOING AN \"INTERVIEW\" for a sketchy data entry job for a real company. I wanted opinions to see if this job was real or not and I've realized it's obviously fake.\n\nI wanted to see the whole thing out for funsies and to provide warning signs. They seemed super sketchy at first but I was like MAYBE they're real and just unprofessional because they're a real startup. I realized it was fake when they said they'd provide me with an \"Apple laptop\" and \"The company will **provide the funds** needed to purchase all equipment.\"\n\nI got an email from a company I didn't apply to, the recruiter reached out to me. The company is real but their domain name is different from the recruiter's (Outlook) and (info\\_at\\_acmetruck.work). These are all the signs that this is a scammy ass jobs:\n\n* The email has replaceable details in brackets, like \\[Job Title\\] and Date and Time: \\[Monday - Friday 9am-5pm EST\\] rather than a specific time/title.\n* The PDF for the job attached is wonky af. Like they converted a pdf to word and back multiple times.\n   * The responsibilities section and the qualifications section has different spacing.\n   * Sentences run into the margins\n   * Headings and paragraphs are not aligned. Like they start at different points\n\nlike\n\nthis\n\n* These are the benefits: \"medical, dental, vision, and life insurance, plus short and long-term disability coverage. **Our 401(k) plan offers automatic enrollment along with a dollar-for dollar matching, up to the first 15.5%** of your eligible pay contributed, as well as, Student Loan and Credit Card debt settlement, stock options, and financial planning assistance.\"\n* I can't find the recruiters or hiring manager's name online for shit\n* Paychecks are weekly, recruiter mistakenly told me bi-weekly until I corrected it\n* They had me do an \"online interview\" via Microsoft Teams and just started it without really even asking if this time is okay (6:30 PM EST)\n* \\[Company\\] is excited to announce that we have engaged in a $40 million Series A financing round. This milestone will help propel our mission forward as we work to address the pressing medical needs in cancer treatment and beyond. With this funding, we aim to expand our capabilities and continue developing next-generation therapies that can improve the lives of patients worldwide.\"\n   * \"I will make every detail of the open position known to you so **your keen and undivided attention is stipulated**\"\n   * Reasoning for online interview: **Good, The online interview is a new system used in most firm due to the fact that there is a large number of job searchers and COVID-19 outbreak , with this system it is easier and faster to be interviewed but after the online interview, you will be meeting your supervisors face to face if you qualify for this job. It would have been done via telephone and Microsoft Teams app chat would be convenient and Easier....I believe this process will be more convenient for you?**\n* General HR questions: \n   * Next is your interview questions and you are to answer each question asked briefly, Once done with your answers simply write (DONE) Are you ready ?\n   * 4. Payroll Interval? (Weekly or Bi-weekly) 5. Payroll Method (Direct deposit, Credit card transfer or check? ) 6. What are the names of the Banks which you currently operate with so as to see if it tallies financially with the company's official salary payment account ? 7. How long have you been banking with your banks?\n   * ( 2)What is your **phone carrier and are you on a prepaid or post plan** ? (3)**What do you understand about company policy, privacy and code of conduct.?** **^(()**^(??????))\n   * you will also receive your employment form and w4 form  You would be eligible for Benefits after 1(one) Month of working with the company. This Job offers Flexible hours but you are to report online daily  by  8 am daily for duties, tasks, and assignments...UNDERSTOOD?\n   * You will be undergoing (2) Two week paid training and orientation which will commence as soon as you have all working materials and you are rest assured that you will be paid for it...  You will be getting your paper work and HR document during your orientation and training from your supervisor, you are to fill, sign and send back to us, we take out taxes....UNDERSTOOD ?\n   * We take our work very seriously, but that doesn’t mean we don’t have fun too! We strongly believe that your work should enrich your life and not deplete it so we organize year-round social committee events, flex-time, and mediation, as well as, volunteer opportunities. All these and more are what make working at \\[Company Name\\] a thrilling and career-balancing experience. We work hard and play hard. You are free to work as much as 45hrs and span your hours through the weekends for overtime. If your services will be needed for overtime anytime, you will be notified ahead of schedule so you can plan accordingly. Overtime mainly occurs when there is excess work to be completed and every hour worked overtime is paid in full plus 50%. You’ll be receiving your salary weekly through direct deposit. UNDERSTOOD ?\n   * BS 1 Accounting software which is to be purchase This week.  Peach Tree Software (US Patent Single Users Pack)  4 in one (fax, scanner, copier and printer).  Zebra ZM400 Bar-code printer and cards, 4 drawer cabinet and office desk, Apple iMac 24” (M1 Chip), and MacBook Pro 16” (M1 Max).  Blu-ray Drive, Vista Premium), myob business essentials software 2005, For Peach Tree premium 2010 US Patent Single Users Pack.  Simply accounting 2009, Adobe Photoshop 52011, Adobe Acrobat 8 2012, Ariba 8 2012ASP 32007,CSS 6 2012,Dreamweaver 7 2011, HTML 11 2011, Illustrator 3 2009.  NOTE: The company is in position to provide you with everything needed to start work with including the materials listed above….Understood ?\n\n# Then they hired me immediately. \"congratulations you're hired\" made me laugh out loud\n\n**Great News! We are pleased to inform you that you have officially been selected for the Data Entry position — congratulations, you’re hired!** 🎉\n\nI just responded that I'm reporting them to the authorities, they saw the message and didn't respond lol.\n\nFor reference, I had another job interview today for a legit company and a recruiter submission. ***They're making me do four rounds and meet the entire team. I applied 17 days ago---this is normal.***\n\nedited for formatting",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1pbucjx/realized_midway_through_job_interview_that_the/",
      "comments": [
        {
          "body": "Was this for a remote data entry job?\n\nFor anyone reading this, ‘data entry’ positions in this era are basically always going to be on site. Remote data entry jobs are almost never an actual thing, as the only data entry being done anymore is converting physical records to a digital format. \n\nTLDR: ‘Remote Data Entry’ positions are a scam 99.999% of the time in 2025. ",
          "score": 7
        }
      ]
    },
    {
      "title": "Packaging design| Interview questions for a Mid-weight designer",
      "body": "Hey everyone! \n\nI want to reliably prep for my upcoming interview and since it's been a very long time since I've been at one for graphic design, I would like to pick your brains about what I can expect.\n\n(Would especially love to hear from people in the packaging design industry)\n\nA little bit about me: 10+ years of graphic design experience, which came to a bit of a halt after I moved to the UK and the pandemic hit. Since then I've been \"stuck\" in hospitality (with good progression, got from back of house to manager in three years). Now I started to go back to my graphic design ambitions.\n\nMy experience was primarily DTP (publications for various organisations and student societies, all non-profit, with most of them spanning for about 4 years), promotional design for events, digital promotional asset design and some (very light) branding design.\n\nDuring my time as graphic designer, I was also in theatre for 11 or so years (relevant for job position I'm going for)\n\nI would say the amount and quality in my portfolio is quite decent. My only concern while applying was the experience gap (haven't really done much except for photography since 2021 due to time constraints with hospitality).\n\nSo I was honestly surprised when I got the invitation to the interview for the mid-weight packaging designer.\n\n\nQuickly about the position itself:\nMid-weight Packaging Designer to create engaging packaging and brand assets for toys, books, and crafts. The role involves designing across product ranges, collaborating with editorial and marketing teams, and preparing artwork for production. Candidates should have 3–5 years of design experience (packaging/branding preferred), a strong portfolio, and proficiency in Adobe Creative Suite. The team values creativity, collaboration, and designs that connect with kids and reassure parents.\n\n\nThere will of course be three stages: 1st interview, design test, and 2nd interview.\n\nSince i have nearly zero paclaging design experience, I've already googled and researched possible questions etc. And even got myself the \"Packaging the brand\" by Gavin Ambrose and Paul Harris to prep. Even if I dont get the position, it will be a good think to learn from i think.\n\nAnd at this point I would love to hear from YOU all:\n1. What sort of questions can I expect at the interview? \n2. What does a design test usually involve?\n\n(Oddly enough, in 10+ years and 4-6 different projects I've worked with, there was never a test involved, I've completely promoted myself with the portfolio and it was enough. But that was back in the early 2000s to late 2010s, so times changed)\n\nWould LOVE to hear your thoughts!\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1o3vieg/packaging_design_interview_questions_for_a/",
      "comments": [
        {
          "body": "You should definitely post this in r/design. You’ll get more answers there. \n\nI’m a fashion designer, not a packaging designer so I can only give you answers based off of my experience. Still, it can’t be that different. \n\nThese are the questions that they usually ask:\n- Tell me about yourself\nYou’ll want to stick to just work experience, and be sure to mention that relevant theater experience! Don’t harp too much on the time you spent out of design and definitely focus on any transferable skills. \n\n- What is your proficiency with X software?\nBest to be honest here, but the answer they want is always a confident “I’m very proficient!” You should strive to be super proficient with whichever ones you use most, anyway (I imagine Indesign, Photoshop, Illustrator)\n\n- What role do you prefer to play in a team? \nAnother one to answer honestly. Some people are great leaders, others are better supporters, some are great at boosting morale, others are good motivators. Me, myself, I’m the calm, pragmatic one. \n\n- What brands inspire you?\nBe ready for this one bc your mind will always draw a blank if you’re not prepared! Try to choose brands closely aligned with the look of the brand you’re interviewing at, but more elevated. \n\n- They may also want you to walk them through your portfolio, so be prepared for that. \n\n——\n\nI know in some industries it is frowned upon to require design tests/projects. In my industry it is still a prerequisite, mostly in entry and mid-level roles. \n\nFor a design test, they will usually give you 4-10 days to do some sort of prototype to see what you will design for them. It’s a way for them to see your skill set and understanding of the brand’s DNA. As a fashion designer, I usually do this entirely in Illustrator and structure it as though I were presenting it to a client, so presentation skills really matter here! \n\nThe basic structure is title page, moodboard, color, then the actual work. Unlike a client presentation, you’ll also want to include your process and iterations—this is really important for them to see how you work! \n\n—— \n\nI’ll finish by including the types of questions I usually ask them! \n\n- What softwares do you use?\n- What cross-functional teams do you work with? \n- How many members are on the team currently?\n- How many styles (garments) do you work on a season? \n- What did you like about my background? \n- When can I expect to hear back? \n\nGood luck!!!!",
          "score": 2
        }
      ]
    },
    {
      "title": "What can I apply to? Career Change",
      "body": "Post Grad i’ve pretty much just been in social work, case planning. While this company i’m at now is not bad i am burnt out, I can’t do it anymore, Im putting on 15-20 hours of OT a week.\n\nI do want to pursue a masters eventually but i never want to do case planning again. What can I switch into with my degree and “experience” that’s entry level with room for growth? \n\nhere is my resume for reference, how can i tweak it to be more marketable to other fields? i’m fine working in other social work sectors must not case planning because the sheer amount of field work and OT.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1o26esx/what_can_i_apply_to_career_change/",
      "comments": [
        {
          "body": "Have you considered being a cashier for fast food?",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "58, Art Director, laid off late last year, found job March 17",
      "body": "I spent time in this community while job searching. Was encouraged by some of the posts. Wanted to return to encourage those still looking. The economy is rough and a bit destabilized, but there are positions out there. \n\nGet up every morning at the time you would for your job, dress like you would for work, network like hell, you never know where a lead will come from. Get to be friends with claude.ai and ask questions. maintain attitude of hyper-optimistic salesman, “Every no is closer to a yes”. It’s not profitable to beat yourself up or to let negative thoughts rule your mind. Clear those out. If you believe in Jesus, keep praying, make a list of things you are grateful for and add one to it every day. I believe this was an answered prayer, IMO. you have skills and personality that some employer wants and needs.\n\nIn the end, I found my job from a LinkedIn post. it was a position that I was qualified for and enthusiastic about. found out a little about the HR person who was going to do screening interview. Had a strong portfolio that I created with Adobe portfolio app. Second interview, we went through my portfolio and I answered questions. Not really many behavioral questions that I had been anticipating. offered position three days later.",
      "subreddit": "jobs",
      "score": 38,
      "url": "https://reddit.com/r/jobs/comments/1k3kfjs/58_art_director_laid_off_late_last_year_found_job/",
      "comments": [
        {
          "body": "Thanks for posting.  People need to hear that there are jobs out there and people are getting them.  It's just a lot harder than it used to be.",
          "score": 13
        },
        {
          "body": "Thank you for sharing some positive news in this super negative space, go you!",
          "score": 2
        },
        {
          "body": "Congrats Payle! Best of luck to you. :) Waiting for my congratulations as well.",
          "score": 1
        }
      ]
    },
    {
      "title": "Struggling as a 23 year old with a Masters Degree",
      "body": "Hi, I am a 23 year old with a Masters Degree and have been working full-time for 6 years. I have worked in a variety of fields, mostly public service and then for non-profits. I mainly have experience in project management and fundraising. I feel like the struggle with coming from the non-profit world is that while my title may be XX, I have been forced to wear the hats and do the job duties of 4 different roles in almost every job I've ever had. It's so difficult to explain that on a resume and cover letter because while the title of a job posting is looking for Y, and my official title is X, even though a significant portion of my job could have been Y duties or Y adjacent duties, I feel like I'm not even making it past the ATS systems. I tailor my resume to almost every job, and I make a new cover letter for every job I apply to.  I have worked a lot of short-term contract and consulting jobs, while doing a main full-time job because the non-profit field pay is trash. I have no idea how to also explain that the reason I have so much experience is because of all the hands on learning I have done with my contract work.\n\n  \nFor example, my main full-time job, I'm basically a fundraising grunt / secretary for my boss and I doubt she'd ever let me progress much further than that. \n\nBut for one of my contract jobs, I am our entire development and fundraising team. I do it all, with the full trust and support of our Executive Director, who constantly gives me positive feedback and I have very good performance and output with them. \n\nI have attached my resume as screenshots with all the important info redacted. Jobs 1, 3&amp;4 are all contract / consulting work. I worry it looks bad on me to have such short time spent at the jobs, but for my contracts, I work until they end or until I've met all the metrics they need me for. The longest I have ever stayed at a full-time job is my current full-time role, but I am starting to hate it and looking for alternative work. For so many of the roles I have applied to that I think I am qualified for, I either never hear back or get the generic rejection letter. I think I have submitted upwards of 80 applications and have only gotten 2 interviews. \n\nIs this normal? I feel so frustrated by the entire process. I feel like I did everything right, rushed to finish my education, have worked full-time since I was 17, grinded and picked up extra jobs for money, and yet it all feels hopeless. Outside of working to get a Project Management Certification or a Fundraising Certification, I'm not sure what else I could do to make myself more appealing. I interview very well, but it feels impossible to even get to that point with the constant stream of rejections. \n\nhttps://preview.redd.it/ar9xadn2avef1.png?width=872&amp;format=png&amp;auto=webp&amp;s=6762f208e53505dd2b08df77ebdf09f9792dcede\n\nhttps://preview.redd.it/rsv19924avef1.png?width=878&amp;format=png&amp;auto=webp&amp;s=506fdcc6b7561fecf005513bc16b83ae215cd230\n\n  \nUpdate: I guess I doom and gloomed too early. I have found a new job that is a step up from my old one and will begin on August 11th. Thank you to everyone that commented. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1m8cr4i/struggling_as_a_23_year_old_with_a_masters_degree/",
      "comments": [
        {
          "body": "Change all the \"Remotes\" to the city where the business is located, and reduce it to one page. Your working experience doesn't warrant two pages.",
          "score": 2
        },
        {
          "body": "Impressive. I’m 25 with BS+MS and 1.5 yrs full time exp. You are way ahead of the game.",
          "score": 1
        },
        {
          "body": "This is way more common than people admit, especially coming from non-profits where everyone juggles a ton of responsibilities under generic titles. Honestly, ATS filters are brutal and don't pick up on the cross-functional stuff you did. You might want to try platforms like Hiredar where recruiters actually reach out to you based on your whole experience, not just keywords. It can take some of the pain out of getting noticed for what you actually do, not just what your title says. Hang in there, most of us have been through the grind.",
          "score": 1
        }
      ]
    },
    {
      "title": "I cannot think of a better person for the position, and I still got rejected.",
      "body": "32H Bilingual Part-time Tech-Trainer of a county library system.\n\nMy last 4 years of Tech background inclues 3 years of self-employment, and 1 year at CounterPunch Studios as a Character Animator. I lost my CounterPunch gig due to the Post-Covid layoffs (due to having to open operations in-location, which implies adjusting budget). Since then, all of my artistic/tech time is spent on personal projects. Film, animation, previs, etc.\n\nThis means I have robust knowledge about 3D Modeling software. Autodesk Maya is the amalgamation of all my previous software experience.\n\nThe Adobe Suite, DaVinci Resolve, Houdini, UE4. Aside from that, my MoCap work using Faceware/DynamiXYZ. My degree covered everything from Modeling (Hard and Soft surface), UV mapping, Texturing the models with Substance Painter, and even coding the textures with Substance Designer. Rigging, Blend Shaping, Animating, VFX, Lighting, layout, and a liiiiitle bit of Rendering.\n\nSome knowledge with DAW's. Primarily FL Studio, but a bit of Ableton Live. \n\nHell, I was starting to take tutorials for Visual Studio.\n\nFor my teaching background, I did a year and a half at an elementary school as a PE Paraprofessional. I could not have been better at my job there. But I was laid off last in, first out, due to them miscalculating student count for budgeting. It's the place where I get the best recommendations.\n\nCustomer Service: a year at Sam's Club as cashier/cart attendant/meat department/membership services, gas attendant, and produce. Another at Nordstrom Rack in the warehouse and on the floor, constantly stocking and helping customers.\n\nBilingual: Born and raised in Puerto Rico for 18 years, until I went to study abroad for technical art jobs. My family is old-school and we mainly speak spanish in my house. My spanish is significantly better than my english in all aspects.\n\nBack to the 32H Tech Trainer position I was rejected from today, I passed the initial online screening for the bilingual questions and program knowledge check.\n\nI even got an interview. Best interview I've had in my entire work history. All I needed to do was a basic presentation for Microsoft Word. Every single question I was asked, not only did I know, but I knew multiple ways of accomplishing it. I answered everything very wholeheartedly, with enthusiasm, absolute delight, and appreciation.\n\nApparently that wasn't good enough.\n\nThe job had a minor need for Fabrics knowledge. Textile stuff, sewing, knitting, just some very irrelevant bullshit. And coding which I'm just new at, but still got some knowledge.\n\nI'm not sure if I was rejected for just those two missing skills, or whatever the hell...\n\nCounterPunch was my only salaried job at $50k. This job was paying $22 an hour, which should just be in the $40k's annually.\n\nThis is my 20th rejection this month, 3 of them had interviews.. It doesn't matter if it's a $17/hr job, or a $22/hr job. I'm not fitting ANYWHERE.\n\nLiving with my parents is the only way to exist right now, but I have nothing. I am a slave of the house.\n\nMy only \"job\" is with QKids, which is teaching English to Chinese kids. Extremely poor hours. It's what I use to not have my parents handle my debts.\n\nOh yeah.\n\nI have massive school debts, so I don't go out, I don't eat out, I don't spend on anything, other than debt and my art licenses.\n\nAnd from the bottom of my heart, I don't give a fuck about any of that.\n\nThe only thing I want to do is work on my movie and at least have a single fucking Patreon on my decade long project. But it's so niche, there's no chance.\n\nEveryone (who gets to see it) in the Silent Hill community loves it, but I am a nobody. I don't have social media because it distracted me from working on my project. And every artist I've tried to collab with is doing their own thing.\n\nThis is a rant. It's not a plea, it's not a cry for help. I welcome any advice, direction, or even motivational words.\n\nBut I will carry on. What other choice do I have?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1mygzb1/i_cannot_think_of_a_better_person_for_the/",
      "comments": []
    },
    {
      "title": "Is it normal to be the only one with skills on your team?",
      "body": "I work at a large, notable B2B company with 5,000+ employees.\n\nThere are only 3 people on our communications team, including me. I am the only person on our team that knows how to use Adobe products, film &amp; edit video, Canva, etc.\n\nMy senior manager is a visionary, but that’s about it. She’s very strategic but essentially uses AI for almost everything, from writing to preparing interview questions, etc.\n\nThe other employee actually used to be my manager, but she got demoted. She severely struggles with writing and does not have a wide skillset.\n\nI am feeling isolated &amp; overwhelmed because I am getting pushed to do all our newsletters, video, etc simply because I’m the only person who knows how to do it. I get absolutely zero skills-based development.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1me6sgi/is_it_normal_to_be_the_only_one_with_skills_on/",
      "comments": [
        {
          "body": "Yep, totally normal, especially in the communications sector. There's a reason why communications majors are often the butt of jokes.",
          "score": 1
        }
      ]
    },
    {
      "title": "Adobe senior software engineer Interview",
      "body": "I have an interview with adobe, and the focus will be on Nodejs, system design and (kubernetes, ci/cd...), anyone have any examples on any of these and what should I expect? thank you",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1nyu66s/adobe_senior_software_engineer_interview/",
      "comments": [
        {
          "body": "I went through a senior loop with a similar stack recently. What helped me was doing two timed dry runs: design a simple rate limited content API in Node and walk through how I would deploy it on Kubernetes with rolling updates, requests and limits, liveness and readiness probes, and HPA.\n\nFor CI and CD, be ready to talk trunk based flow, canary with feature flags, and what you roll back vs roll forward. I practiced out loud using prompts from IQB interview question bank while timing myself with Beyz coding assistant. Keep system design answers around 90 seconds per section, state an SLA, estimate QPS and storage, and call out tradeoffs explicitly.",
          "score": 2
        }
      ]
    },
    {
      "title": "Adobe Interview for MLE (Firefly) team.",
      "body": "I have an interview with Adobe on Friday for MLE and for the first round, recruiter mentioned this in the mail to prepare. \n\nROUND 1-Logical,Aptitude,Algorithms,Server Architectures\n\nWhat type of questions can I expect in this round. Is this Leetcode or questions on ML. \n\nAny help is appreciated \n\nThank You",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1julw9r/adobe_interview_for_mle_firefly_team/",
      "comments": [
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "The \"Logical, Aptitude, Algorithms\" part suggests you'll encounter some classic coding problems, possibly similar to LeetCode-style questions. These could range from data structures and algorithms to problem-solving scenarios. The \"Server Architectures\" component hints at system design questions, where you might be asked to design scalable solutions or discuss architectural trade-offs.\n\nGiven that it's for a Machine Learning Engineer role, expect some ML-specific questions too. They might not be as in-depth as later rounds, but you should be prepared to discuss basic ML concepts, model evaluation metrics, and perhaps some practical applications of ML in server architectures. It's a good idea to review both your coding skills and ML fundamentals before the interview.\n\nIf you're looking for extra practice with tricky interview questions, you might want to check out [interview helper AI](http://interviews.chat). I'm on the team that created it, and it's designed to help people navigate challenging interview scenarios and boost their confidence. Good luck with your Adobe interview!",
          "score": 2
        },
        {
          "body": "I have also given same interview recently.\nIf you want we can connect on WhatsApp ",
          "score": 1
        },
        {
          "body": "Hi which location was that for? Can I dm you?",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "You can try mock interviews on - [www.easymock.pro](http://www.easymock.pro)",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone recently interviewed or cleared Adobe SDE 4 Frontend role? Looking for insights and prep guidance!",
      "body": "Hi everyone,\n\nI’m preparing for an interview for **SDE 4 Frontend role at Adobe in US (Adobe Express team)** and was wondering if anyone here has gone through the process recently or has tips to share.\n\nWould love help with:\n\n* What the interview rounds looked like (online/onsite, number of rounds)?\n* The focus areas for this Frontend role – is it mostly UI Coding **o**r LeetCode questions as well?\n* For UI Coding, is it JavaScript or React based questions?\n\nAlso, any suggested prep resources or mock interview pointers would be greatly appreciated!\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1miutct/anyone_recently_interviewed_or_cleared_adobe_sde/",
      "comments": [
        {
          "body": "You'll typically face 4-5 rounds including a phone screen, technical rounds focusing heavily on React and JavaScript fundamentals, system design for frontend architecture, and behavioral questions. The technical portions lean more toward practical UI coding challenges rather than pure LeetCode grinding, though you should still be comfortable with data structures and algorithms. Expect questions about React hooks, state management, performance optimization, accessibility, and building scalable component libraries since Adobe Express deals with complex UI interactions.\n\nThe system design round will likely focus on frontend architecture decisions like how you'd structure a large-scale design tool, handle real-time collaboration, or optimize rendering performance for graphics-heavy applications. They care deeply about code quality, so practice explaining your thought process clearly and writing clean, maintainable code during live coding sessions. Mock interviews are essential here because the pressure of coding while explaining your approach can trip up even experienced developers. I'm on the team that built AI for [job interview questions](http://interviews.chat), which helps candidates practice these exact scenarios with AI-powered feedback, especially useful for nailing those tricky technical explanations and system design discussions that Adobe values so highly.",
          "score": 1
        }
      ]
    },
    {
      "title": "Found a job after 7 months of being unemployed",
      "body": "Hi everyone. This post might seem somewhat unusual to many of you, however, I’ve already seen dozens of similar posts here, so I guess it will be okay if there’s one more post of that kind. Personally I don’t really consider this thing motivational/inspirational or anything, but at the same time I believe that everything written below might actually help some people or at least cheer them up regardless of circumstances. I would want everybody to read this until the end. I know it might be time consuming, but still...\n\nI worked in the tourism industry for nearly 4 years and managed to build a pretty successful career there within such a short time, all on my own, without anybody’s help (I’m not trying to show off or whatsoever). At the very beginning I felt like that was exactly what I wanted to do, I actually thought it was 100% my thing. I wish you knew how wrong I was, but at the end of the day, can a 17-year-old with little life experience be smart? I don’t think so. I was absobloodylutely fascinated by each and every single aspect of the job I had and neglected all the limitations. I started as a Tour Guide and finished as a Senior Operations Manager. I couldn't even imagine myself working at a travel agency as the start was pretty much unexpected and impromptu.\n\nAs far as you all know, work in this particular industry implies loads of constant communication with people from all over the world (including those you don't know). At 17 I was an extravert, so I have to admit that I was super chuffed. Later I realised how silly and wrong I was. Hundreds of mental clients whose requirements and desires were just otherworldly, aggressive colleagues (I can understand them though), toxic environment overall... all of this started to bring me down and literally opened my eyes. Every summer I had to work super hard 24/7. I'm a multitasker used to working in a busy environment, but I also need spare time for personal stuff. Work-life balance was nonexistent. \n\nObviously some of you who work(ed) in the tourism industry might have had a completely different experience which is understandable. I believe that tourism could be a good career start, but I don't think that it's exactly what one should dedicate their whole life to. Again, it's just my personal opinion, so if you have a different point of view, it's absolutely okay. If a person is social and enjoys constant communication as well as loves meeting new people every now and then, tourism might actually be very good for them. \n\nHowever, I feel like those 4 years have almost completely changed my personality. Once an open, friendly and social teen, and now a distant and somewhat aloof guy. At the same time I have to admit that it was a great lesson for me. The whole thing helped me sort out my priorities and determine what exactly I wanted to do, which field I desired to grow in. I've gained and developed loads of useful skills that do help in real life. Negotiation, active listening, verbal and written communication... the list could go on and on. I also managed to significantly improve my German and Spanish. I mastered Excel, Amadeus and many other software programmes, high proficiency in which is needed almost everywhere now.\n\nIt was a great start, but I just feel like I could actually make a career change much earlier, perhaps at 19. Last December (when I was 20) I had two burnouts in a row because I couldn't cope with all that stuff at work anymore. It was so damn overwhelming, holidays didn't help at all. Anxiety and depression started to creep up on me. I ended up being rushed into hospital and getting medical treatment there. That was the moment I decided to quit. Forever. \n\nAfter Christmas holidays I gave my boss a resignation letter. He was really upset, but understood me and wished me good luck. I took a notice period and then left. I'm currently doing my Master's (one more year left), so I focused on my studies and chose not to look for a job. Moreover, I sort of knew and could predict that covid-19 was going to spread across the globe and damage every country's economy. I also knew that tourism would collapse and consequently fall apart. It's happened. All of my former peers are unemployed at the moment.\n\nI promised myself and everybody else that I would never get back to tourism no matter what. I needed a career change. I'm a naturally creative person with decent copywriting, editing and proofreading skills, so I though that it would help. I've been doing a lot of freelance work in the past 5 years, and this definitely has improved my creative skills. In addition, the second travel agency I worked for often asked me to collaborate with their marketing department in case they wanted to launch another campaign. I really enjoyed it, and both my boss and the head of marketing department started to assign loads of various tasks to me including making videos, writing advertising articles, launching marketing campains etc. I'm good at video content creation/development probably because it's been one of my primary interests for years now. I started to work with Sony Vegas and Adobe Premiere Pro when I was a teen. I loved it, I really did. I've been making so much stuff using these two since then... I had never even though that one day it would become my job.\n\nIn March I started to look for a job. I was afraid that I would never find a job in a different industry, at the same time I didn't want to work at a call centre nor be a cleaner/waiter etc, although I could. I started to apply to various jobs, I literally lived on LinkedIn, Indeed, Glassdoor and other websites as well as kept monitoring different companies' websites in order to stay updated on new vacancies. Guess what? Either rejected or ignored! No calls/emails, no interviews... absolutely nothing! I felt so devastaded, so I desperately started to apply to all jobs ignoring things like company's name, job description and employee reviews. There was still nothing.\n\nI've been quite active here as well since then. I've been trying to get help/advice here. In June I received 7 calls and 4 emails, proceeded to 3 interviews with 3 different companies. I was ghosted by the first two after the inital interview, the third one first said they liked me and then they rejected me for no reason and didn't really explain anything. I couldn't deal with it any longer and wanted to die. Rejection followed by another rejection followed by ghosting and so on. \n\nAt the beginning of August I had an interview with a small IT company, and they made me a job offer, but there was absolutely no info about them on the Internet, plus I found people who worked for them on LinkedIn, they told me that the turnover rate was quite high, working conditions were poor etc. I rejected the offer. I even started to think about getting back to tourism or a similar thing, but then I accidentally came across a website of a pretty large well-known company that was founded back in late 1940-s.\n\nThere was a role I liked. I sort of knew it was useless to apply, but still did. Suddenly a person from the marketing department called me, we had a very brief phone conversation, and the guy said that he'd passed my data on to the HR managers. They called me later that day, and we had a phone interview. I thought it was the end, but... they arranged a Skype interview with me, the hiring process started. I honestly didn't expect that. I feel much better now. They made me an offer, and I accepted it. I've already finished my very first week at work, I have to admit that I’ve enjoyed every moment of it! The whole process has been extremely complicated, but it's all in the past now. Great people, good working conditions, opportunities for career growth, loads of benefits, nearly 3 months off, high salary, work-life balance... what else do I need?\n\nI've already written a lot of stuff, so I just want you guys to know that you shouldn't worry about anything. Apply, keep applying. I know it's tough, especially now, but please go for it! You never know what can happen. A job can come from a place you'd never thought it would come from. Believe in yourself, forget the phrase 'to underestimate oneself'. Tailor your CV, write cover letters, your time will come. Be genuine, honest and modest, always tell the truth. Try to be as friendly and polite as possible. Employers admire it. I would also recommend to apply directly on the company's website or by emailing them, it might significantly boost your chances. Don't overthink. If you want more advice or have ay questions, do not hesitate to contact me. Remember: each person is great and unique in their own way. Work hard, and it will pay off. Do your best. Very best of luck to everyone x",
      "subreddit": "jobs",
      "score": 408,
      "url": "https://reddit.com/r/jobs/comments/imxgw3/found_a_job_after_7_months_of_being_unemployed/",
      "comments": [
        {
          "body": "It's not about finding a job. It's about finding the right job in the right company. Congratulations (I'll send you the post to see what I mean).",
          "score": 28
        },
        {
          "body": "Congrats, well done! It is nice to hear some positive outcomes in these crazy times. It is good encouragement that we all need to hear",
          "score": 8
        },
        {
          "body": "I've been unemployed since January and was going to look at starting work in March. Something horrible happened to me and I needed to heal. Big time. \n\nI start a job I actually want on Tuesday. Congrats op. I cheers  you!",
          "score": 14
        },
        {
          "body": "Congratulations I’m so happy for you! I’m 30 now and thinking about changing careers (haven’t left my job yet) because it also changed me into someone I don’t recognise anymore. I’ve hated every job I’ve been in and I just want to find something I’m good at and a good workplace. I don’t really know where to start but your story is inspiring. What did you study for your masters?",
          "score": 5
        },
        {
          "body": "CONGRATULATIONSSSS 🤑🤑🤑🥳🥳🥳",
          "score": 4
        },
        {
          "body": "Nice story man! Just curious though, what type of job/role did you end up landing?",
          "score": 3
        },
        {
          "body": "Thanks for your post! I’m in copywriting/editing/proofreading too and struggling really hard. Hopefully something good happens soon",
          "score": 3
        },
        {
          "body": "Congratulations! A great story to help the rest of us continue with applications. It can be demoralizing at times.",
          "score": 3
        }
      ]
    },
    {
      "title": "Adobe Video Interview",
      "body": "Hello Everyone,\nI got an invite for Data role (Adobe) for 15 min interview. I have no clue regarding this…. \nCan anyone help me out what exactly can I expect here. \nThanks in advance",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ow6mrt/adobe_video_interview/",
      "comments": [
        {
          "body": "Congrats on the invite! For a 15-min chat, it's likely a screening to assess your communication and cultural fit. You might get asked a couple of basic technical questions or past experiences related to data work, but mainly be ready to explain your interest in Adobe and this role quickly and clearly. Good luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "Has anyone heard back from Adobe 2026 Software Engineer Intern - Techincal Interview?",
      "body": "",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p01gqi/has_anyone_heard_back_from_adobe_2026_software/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Adobe Interview",
      "body": "I have an Adobe round 1 interview, where the recruiter mentioned that it would be Leetcode style questions and System Design questions, and mentioned that preferred language is JS/TS. So what exactly will this round be?, this is more of frontend role, with less backend. Any help appreciated!, Thanks",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1nb9enn/adobe_interview/",
      "comments": [
        {
          "body": "For a frontend role at Adobe, expect Leetcode-style JS/TS coding challenges that test problem-solving skills (e.g., data structures, algorithms). System design questions might focus on architecture and user interface design. Practice coding efficient solutions and review key principles of frontend system design in JS/TS.",
          "score": 1
        },
        {
          "body": "The Leetcode questions will likely be medium difficulty problems focusing on data structures and algorithms, but since they prefer JS/TS, expect questions that test your understanding of JavaScript fundamentals like closures, promises, event loops, and array/object manipulation. The system design portion won't be the typical backend distributed systems stuff - instead, you'll probably design frontend architectures like a component library, state management system, or how you'd build a scalable React application with proper data flow.\n\nThe tricky part about Adobe interviews is they expect you to think about performance and user experience even during the coding challenges. They might ask you to optimize your Leetcode solution for browser performance or discuss how your system design handles real-world constraints like network latency and browser compatibility. Since this is frontend-heavy, be ready to explain concepts like virtual DOM, bundling strategies, and how you'd structure components for reusability. I'm on the team that built [AI for interview practice](http://interviews.chat), and we've seen these types of hybrid technical rounds become more common - having a tool to work on articulating your thought process for both coding problems and system design questions can really help you nail the communication aspect that Adobe values highly.",
          "score": 1
        }
      ]
    },
    {
      "title": "Job interview at Adobe",
      "body": "Role is bizops. \n\nI got an email Monday and the latest time slot I could book was Thursday morning, so not a lot of time to prep. \n\nI am wondering if anyone here has interviewed or started working for Adobe lately and has any suggestions on how to prepare. I will be watching YouTube videos that people posted as well and practicing answering typical questions. \n\nI will ask the recruiter on Thursday about the process as I am wondering about take home assignment. \n\nHas anyone tried using those AI tools during interview? Any luck? This first round is audio only. \n\nAny and all help/suggestions are welcome. Thanks in advance! ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mclpjc/job_interview_at_adobe/",
      "comments": [
        {
          "body": "YouTube videos and practicing [common bizops questions](https://www.interviews.chat/questions/business-operations-manager) will serve you well for a this role at Adobe. The good news is that business operations interviews tend to focus on analytical thinking, process improvement, and cross-functional collaboration, so prepare examples that showcase how you've solved complex problems, streamlined operations, or worked with different teams to drive results. Adobe values innovation and customer-centricity, so frame your experiences around how you've contributed to business growth or improved user experiences.\n\nRegarding AI tools during interviews - yes, they can be incredibly helpful, especially for audio-only rounds where you won't be on camera. Since you'll have that advantage, you can absolutely leverage technology to help you navigate tricky questions and ensure you're giving comprehensive answers. The key is having something that provides real-time support without being obvious or distracting from your natural conversation flow. I'm actually on the team that built [AI interview assistant](http://interviews.chat), which is designed exactly for situations like yours - it listens to interview questions and provides instant suggestions to help you give stronger, more complete responses during the conversation.",
          "score": 2
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "You can - \n\nyou can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com/)\n\nand do mock interviews on for free - [www.easymock.pro](http://www.easymock.pro)",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "You can try mock interviews on - [www.easymock.pro](http://www.easymock.pro)",
          "score": 1
        }
      ]
    },
    {
      "title": "Adobe Senior Software Engineer Interview Front end",
      "body": "I have an Adobe Senior Software Engineer full loop scheduled for a front end position on React. The recruiter did not provide enough details about the specific of each round. This is the info I got from Recruiter: Algorithmic and coding round, React and web pack based round, behavioral round\n\nIn another email, recruiter mentioned there would be a design interview too. Not sure whether it is a low level object oriented design or high level system design\n\nCan anyone please let me know how does Adobe Senior Software Engineer full loop works and what would each round consists of",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1m1v9q2/adobe_senior_software_engineer_interview_front_end/",
      "comments": [
        {
          "body": "Your algorithmic round will likely focus on medium to hard LeetCode-style problems with an emphasis on data structures you'd actually use in frontend work - think arrays, hashmaps, and tree traversals. The React/webpack round is where they'll test your practical skills with component architecture, state management, performance optimization, and build tooling knowledge. For the design round, given it's a frontend role, expect it to lean more toward component design and frontend architecture rather than distributed systems - they'll want to see how you structure scalable React applications, handle data flow, and make decisions about component hierarchies.\n\nThe behavioral round will dig into your experience with cross-functional collaboration, handling technical debt, and leadership situations since this is a senior role. They're looking for someone who can mentor others and drive technical decisions, not just code well. The whole process is designed to see if you can think systematically about frontend problems at scale, which is exactly what Adobe needs for their complex web applications.\n\nI'm on the team that built [AI interview copilot](http://interviews.chat), and it's designed specifically to help with these kinds of multi-round technical interviews where you need to articulate your thought process clearly across different types of questions.",
          "score": 2
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "You can try mock interviews on - [www.easymock.pro](http://www.easymock.pro)",
          "score": 1
        }
      ]
    },
    {
      "title": "Adobe Frontend Developer Interview(Location: USA)",
      "body": "Hello everyone,\n\nI have an upcoming onsite interview with Adobe's Firefly team for a Full Stack Software Engineer role with a strong focus on frontend. The interview includes two 45-minute rounds, both centered around frontend topics.\n\nHas anyone recently interviewed for a Frontend Engineer or Full Stack Engineer (frontend-leaning) role at Adobe? If so, I’d appreciate any insights on what to expect, along with any tips or suggestions for preparation.\n\nThank you in advance for your help!\n\nUpvote1Downvote1Go to comments  \n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1m14um4/adobe_frontend_developer_interviewlocation_usa/",
      "comments": []
    },
    {
      "title": "Adobe CS2 Frontend Interview",
      "body": "I have my Adobe CS2 Frontend interview scheduled soon. Can anyone share their experience. What questions were asked? How many rounds were there.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mamovq/adobe_cs2_frontend_interview/",
      "comments": [
        {
          "body": "They typically follow a multi-round structure with 3-4 stages including a phone screen, technical coding round, system design discussion, and final behavioral interview. You'll face questions about JavaScript fundamentals, React/Angular frameworks, CSS specifics, and Adobe's creative tools ecosystem. Expect to code live solutions for DOM manipulation problems, discuss how you'd architect a photo editing interface, and explain your approach to handling large file uploads or real-time collaboration features. The interviewers often ask about performance optimization, accessibility standards, and how you'd integrate with Adobe's Creative SDK.\n\nThe behavioral portion focuses heavily on creativity, collaboration with designers, and handling ambiguous requirements since you'd be working on tools that creative professionals depend on daily. They want to see that you understand the user experience from a creator's perspective, not just the technical implementation. Be ready to discuss times you've worked with design teams, handled complex user interfaces, or solved problems where the requirements weren't crystal clear. The process can be intense but they're genuinely looking for people who are passionate about building tools that empower creativity.\n\nI'm on the team behind [interviews.chat](http://interviews.chat), which helps candidates navigate these kinds of technical and behavioral questions in real-time during interviews.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "You can - \n\nyou can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com/)\n\nand do mock interviews on for free - [www.easymock.pro](http://www.easymock.pro)",
          "score": 1
        }
      ]
    },
    {
      "title": "In person interview loop at Adobe",
      "body": "I have an in-person interview loop scheduled in a week for Software Developement Engineer position (3 - 4yrs of exp) with Adobe. These are the rounds which recruiter listed:\n\nJava/Coding Part 1\n\nJava Coding Part 2\n\nLinux and Troubleshooting Operations\n\nSecurity, Cloud, and CI/CD\n\nSo is it common for Adobe to set the interviews in-person? \nAnyone out there had gone through this before? What kind of questions can I expect in each of these rounds? Especially Linux and Troubleshooting Operations (I have never worked in a Linux environment before, so totally zero knowledge about it)?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ibnuyu/in_person_interview_loop_at_adobe/",
      "comments": []
    },
    {
      "title": "My Adobe interview ",
      "body": "My Adobe interview \n\nRecently I gave an interview at Adobe for the post of software quality engineer (automation).\nThe interview consisted of 3 rounds.\n1st round: interview asked for introduction and started with writing codes.\nFirst code was there is array like this [1,0,0,1,1,1,0]\nO/p\n[1,1,1,1,0,0,0]\nI was nervous and struggled for 15mins, then I had used arraylist to solve it, provided the time and space complexity\nNext was palindrome string, which was easy\nExplained code with few testcases and similarly provided the tc and sc respectively.\nAfter few days I got interview for second round\nAfter a brief introduction,\nWe again started with writing codes\n1st code:This time it was to find the min and max element in an array\nProvided code\nAnd explained with few usecases\n2nd code: find the mist repeated element in an array\nUsed hashmap to solve the problem\nRecruiter told hr round will be scheduled soon\n\nDuring hr interview time I was again asked to write a code, where we have to return a third array consisting of elements of Array A and B alternately, which I solved within 5 mins, and one selenium code which I wrote half as he stopped me in between saying he got it what I am going to write. And just asked how much comfortable I am in coding, how good i am in debugging etc.\nWhen he asked any questions? I asked him if he atleast can tell something about the package for the position, there i got to know that he is hiring manager not hr. Still now I am in doubt, bcz they told me that it will be hr round. \nEventually after few days when I followed up, I got to know that I was rejected since my skills didn't match the position.\nI wondered what skills are they looking for? During interviews, i wasn't asked a single questions on Java ,oops or automation and selenium concepts, entire focus was on coding.\nEven though I was little positive that I might get selected since I was able to answer most of the coding questions, but that hope was shattered.currently interview calls are very less , most of my applied applications are getting rejected.\n\nSo guys need one opinion.\nWHERE DO YOU THINK I WENT WRONG DURING THE INTERVIEW?\nI am not yet able to figure it.\nPlease suggest what improvements I still need and how to get calls from product based companies?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1bv1h2s/my_adobe_interview/",
      "comments": []
    },
    {
      "title": "Business Intelligence and Automation Analyst role at Adobe",
      "body": "Hey Guys,\n\nI have an interview coming up for the Business Intelligence and Automation Analyst role at Adobe. I know the job involves data analytics and process improvement, but I’m not sure how to prepare. If anyone has interviewed for this role before, please share your experience or tips.\n\nWhat should I focus on to get ready and do well?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1owfohw/business_intelligence_and_automation_analyst_role/",
      "comments": [
        {
          "body": "For this BI plus automation interview at Adobe, I’d focus on showing you can turn messy data into actions and automate the boring parts. What helped me was doing timed SQL reps on window functions, complex joins, and CTEs, then building a quick demo where I automated a weekly KPI report with Python and scheduled it. I practiced stakeholder translation by narrating a dashboard walkthrough and tying it to a clear metric lift and time saved. I ran timed mocks with Beyz coding assistant using prompts from the IQB interview question bank, and kept behavioral answers to about 90 seconds using STAR. If you can explain tradeoffs and show one small automation win, you’ll come across strong.",
          "score": 1
        },
        {
          "body": "May I ask which round this interview is for?",
          "score": 1
        }
      ]
    },
    {
      "title": "Competency Assessment Interview - IBM",
      "body": "Hi all,\n\nI have received the email from IBM regarding the recorded competency interview for the Associate Adobe Consultant! Does anyone know what questions will be asked?\n",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1omq62v/competency_assessment_interview_ibm/",
      "comments": [
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Adobe interview tips ",
      "body": "tech screening round anyone would like to share their experience in the US branch ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1f8ilrt/adobe_interview_tips/",
      "comments": [
        {
          "body": "  \nFor the technical screening round of an Adobe interview, especially in the US, it’s important to be well-prepared for questions that test both your problem-solving skills and your knowledge of specific technologies related to the role. It’s also helpful to brush up on any Adobe-specific technologies or products that are relevant to the role.\n\n**If you're looking to practice your interviewing skills and get feedback on your answers, consider using TrueInterviewAI.** **You can enter your job title or description to get the most relevant questions, select the question and record your answer, and let the AI model analyze your responses. You'll receive a score, feedback, and targeted recommendations on different indicators to improve your performance. You’ll also receive recommendations on TrueInterviewAI’s unique 7 strategies to make your answers more authentic, relatable, and personable.**",
          "score": 1
        },
        {
          "body": "Adobe's tech screening round typically involves a mix of technical questions and coding challenges. You can expect questions about data structures, algorithms, and problem-solving. They might ask you to write code on a shared screen or whiteboard, so be prepared to explain your thought process as you work. Focus on demonstrating your problem-solving skills and ability to communicate technical concepts clearly.\n\nIt's crucial to brush up on your fundamentals and practice coding problems beforehand. Adobe values innovation and creativity, so don't be afraid to think outside the box when approaching solutions. If you're unsure about something, ask for clarification – they appreciate candidates who can communicate effectively. I've found that using tools like [interviews.chat](http://interviews.chat) can help you prepare for tricky technical questions and boost your confidence. As someone on the team that created it, I've seen how it can ease the stress of job interviews by providing tailored practice questions and real-time suggestions.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview tips",
      "body": "Hey guys! I have a Product Analyst interview coming up with Adobe soon. I passed the HR round, but are there any specific topics I can focus on or any interview tips I can follow for this director-level interview?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1pmv158/interview_tips/",
      "comments": [
        {
          "body": "  \nOla!! 🤗 Congrats on getting to the director level interview at Adobe!  That’s a great achievement already. For a Product Analyst role especially at a senior or director level, your interview will likely focus on a mix of technical skills, product thinking, and leadership/communication abilities.\n\nA few tips you might find useful\n\n* Know the role, company, and culture- Review Adobe’s products and recent launches, understand their business model, revenue streams, and key metrics, and be aware of their culture of innovation, collaboration, and customer focus.\n* Focus on core skills and experience-  Be ready with SQL, Excel, statistics, and data visualization; understand product metrics, prioritization, and customer behavior; and prepare examples demonstrating leadership, collaboration, and impactful decisions.\n* Prepare for questions and communication-  Practice case-style and behavioral questions (using STAR), data interpretation, and product sense scenarios.  Use Nora AI  to rehearse how you explain your process, insights, and results clearly, while also preparing thoughtful questions for the interviewer.\n\nRooting for you!! ❤️",
          "score": 3
        },
        {
          "body": "Nice work getting past HR! For director level at Adobe you'll def want to brush up on product metrics and KPIs - they love asking about how you'd measure success for their Creative Cloud suite. Also be ready to walk through a case study where you had to influence stakeholders without direct authority, that's huge at that level",
          "score": 1
        },
        {
          "body": "Congrats on getting through the HR round! For a director-level Product Analyst role at Adobe, focus on discussing your strategic vision and how you drive product success. Be ready to tackle high-level business metrics, user persona insights, and product lifecycle management. Practice the STAR method for behavioral questions, and make sure you can articulate recent industry trends and how you've leveraged analytics for impactful decisions. Best of luck!",
          "score": 1
        },
        {
          "body": "director level at adobe shud be a lil serious i guess. probably gonna grill you hard on analytics frameworks - think about how you'd structure problems around user engagement metrics, conversion funnels, cohort analysis etc. adobe loves candidates who can bridge technical analysis with business impact so prep stories where your analysis directly influenced product decisions. also expect case studies on their creative cloud products - how would you measure success for photoshop vs illustrator users, what metrics matter for subscription retention, that kind of thing. behavioral will dig deep into stakeholder management and how you've influenced without authority since directors need to work across multiple teams. i work at prepfully and we've got some adobe PM who coach specifically for these roles - might be worth doing a mock or two to get feedback on your approach especially for the product strategy portions. they also love when you can talk about experimentation frameworks and how you'd design A/B tests at scale",
          "score": 1
        },
        {
          "body": "I get why you’re feeling the pressure with a director-level interview at Adobe. Focus on storytelling with your product examples and practice aligning your answers with Adobe’s core values. I built InterviewIQ to keep your prep front and center when you need it most.",
          "score": 1
        },
        {
          "body": "At director level the convo usually leans more on how you set direction and influence than pure hands on. I’d line up a few STAR stories around leading a messy analytics initiative, resolving conflicting stakeholder goals, and how you picked a north star metric and defended tradeoffs. Keep answers around 90 seconds and explain your reasoning before the numbers. I’ll pull a couple prompts from the IQB interview question bank and practice out loud with Beyz interview assistant, timed, so I don’t wander. Also be ready to walk a simple experiment design end to end, including risk, data quality checks, and what you’d do if results are inconclusive.",
          "score": 1
        }
      ]
    },
    {
      "title": "Adobe SA role Prep",
      "body": "I recently passed the recruiter screen for a Senior Solutions Architect role at Adobe for Firefly team and now have an upcoming hiring manager round. The recruiter mentioned it will be a mix of technical + behavioral questions.\n\nI come from a cloud / AWS background and have been in customer-facing, architecture-focused roles. Would love to hear from anyone who has interviewed for Adobe (especially Solutions Architect / Consulting roles) on:\n1&gt; What types of technical depth they expect?\n2&gt; Common behavioral themes?\n\t\n\nAny tips or prep advice would be really appreciated. Thanks in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p3pn1s/adobe_sa_role_prep/",
      "comments": []
    },
    {
      "title": "Red flag?",
      "body": "Hey guys,\n\nThe job market is rough right now! (Stilll at my current job just the company ain’t doing well financially). \n\nI’ve already been ghosted by two interviewers lol. Anyway, I had an online interview last week (thankfully online) for a marketing role at a startup.\n\nThe interviewer was about 6 minutes late which I didn’t mind, and he started off by thanking me for having a clear, precise CV. But then things got weird.\n\nHe didn’t really ask me about myself or my experience, he just jumped straight into technical stuff and started asking for ideas on how their company could break into the food and drink industry. Apparently, their current strategy isn’t working.\n\nThey’re selling a protein bar that’s covered in beeswax instead of packaging. Interesting concept, but I mentioned (politely) that most consumers don’t prioritize sustainability enough for that to be the main selling point. He kept pressing for more ideas, saying other candidates didn’t have much to offer. I suggested looking into edible packaging or an edible coating, and he said he was thinking of using a tin. I just said okay, well if you’re thinking of a tin then there’s your answer.\n\nHe also asked how they could make the brand more relatable. I stammered a little trying to get my point across but said they should focus on making their content appeal to everyday people rather than just athletes. I even mentioned they could open a TikTok shop and send products to snack and drink creators to get their honest verdicts. Looking back, maybe I shouldn’t have said much at all ,feels like a waste of time now.\n\nBefore the interview, I did some LinkedIn research and noticed they already have someone listed as a Marketing Executive, which confused me because that’s the exact role I was applying for. So I was already getting the sense something didn’t add up.\n\nAt one point, he asked if I had any issues using Adobe software and what I didn’t like about it. I said I didn’t really have any issues aside from my laptop occasionally lagging while using it. He said he hates the alignment feature because he can never get it right, which caught me off guard but I didn’t think much of it. There were a few other questions like that which just took me by surprise, though nothing terrible.\n\nHe did congratulate me for winning a social media award (which was really nice of him) and asked how I achieved it. I explained the campaign and results, and also mentioned that I’m currently the only marketer in my role so I already “wear different hats.”\n\nThen he brought up their social media presence and said they have a good number of followers. I told him that having followers doesn’t always translate to sales, I’ve never cared much about follower counts because engagement and conversions matter more. He asked what I focus on most: likes, comments, or shares. I said shares, because likes don’t mean people will buy. You can scroll, like something, and keep it moving. But when people share content, it’s more likely others will click, check out the account, and maybe even buy. He nodded and said he looks more at shares too and then moved on to comments.\n\nHe also talked a lot about himself throughout the call ,his experiences, frustrations, and opinions then later remembered to ask me questions again.\n\nAt one point, he said he needs someone who “listens to instructions” and “doesn’t ask a lot of questions,” which felt like a red flag.\n\nMidway through the 45-minute chat, he literally got up and left the screen without saying anything. I just sat there talking to a blank camera talking to him. I felt kind of insulted, like, if you can’t stay engaged during an interview, what’s the work culture like?\n\nAt the end, I asked some questions and about next steps. He said they’d send me two videos to create and if I pass that, I’d then meet the owner. Honestly, it just sounded like they’re interviewing tons of people to squeeze out free ideas before closing the job.\n\nThis was my first interview in about two years, so even though it wasn’t the job I wanted, I’m trying to see it as a learning curve. But wow… the job market is so tough right now. Guess I just have to keep practicing.\n\nSo, am I overanalyzing this or does this whole thing sound off to you too?\n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1ois6vd/red_flag/",
      "comments": [
        {
          "body": "This sounds like 3 coked up badgers in a trench coat.\n\nIt could be fine but that’s a lot of desperation from an interviewer",
          "score": 1
        }
      ]
    },
    {
      "title": "Is this job offer a scam?",
      "body": "I was contacted through my email address associated with job hunting only by an HR Coordinator at Cal-Am Properties for a graphic designer position. Her email address seemed legit, @calamproperties.homes , which maybe the .homes is less so? I did a text-based interview through Microsoft Teams, and then they offered me the job the next day. \n\nThey're offering a signing bonus to purchase a computer and Adobe Suite with. It all feels very fast, and I thought I'd have to do more interviews. So far they haven't asked me for any personal info outside my phone and address, but I am quite suspicious, as they're offering quite a good salary. Not outrageously good, but still. \n\nI have found this HR director on LinkedIn, and the company has a legit looking website. However, all they have is a contact form for potential homeowners to respond to. The job listing isnt listed on their careers page either. \n\nWhat should I do to ensure I am not being scammed? Should I stop responding? Would it be worth it to message through their contact form?\n\nThanks!! ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nin9mh/is_this_job_offer_a_scam/",
      "comments": [
        {
          "body": "[Calamproperties.homes](http://Calamproperties.homes) is not their real domain email address. They use a .com email address domain. This is actually a scam as they have a signing bonus to purchase a computer and Adobe Suite. There is no such thing as a signing bonus for a new PC and Adobe suite.",
          "score": 2
        }
      ]
    },
    {
      "title": "Marketing internship Interview Questions ",
      "body": "Hey y’all I just did an interview today for a company that works for the city. They wanted someone that was in a business/ marketing major to help with flyers and promoting online. Some questions they asked me was. \n1. Why did you choose us and why does our company stand out? \n2. What group projects have you done? \n3. Have you done any independent projects and how did you handle that? \n4. What do you see your career as in 3 to 5 years? \n5. Do you have any experience working in a booth ?\n6. Do you have any experiences in Microsoft suite, Microsoft office? \n7. Do you have any experience in media creations and media video editing/production?\n8. Do you have any experience in adobe illustration, canva , or photoshop? \n9. How would you explain something complex to someone who doesn’t know anything about the subject ?\n10. What makes you stand out from the rest of the candidates? \n\nThey were somewhat like that. Just posting this to  help anyone study / expect for an internship interview lol.",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1gela0n/marketing_internship_interview_questions/",
      "comments": [
        {
          "body": "Thank you for this!",
          "score": 1
        }
      ]
    },
    {
      "title": "Adobe SDE-2 Position \"On Hold\" After Round 3 - What to Expect?",
      "body": "Hey everyone,\n\nInterview Timeline: 15-25 july  \nPoisition Onhold Timeline: 4th august  \nFollow up timeline: still\n\nApplied to Adobe SDE-2 (Noida) back in July, went through 3 rounds of interviews. Round 3 was on Monday 21st july.\n\nFollowed up with HR twice - both times got \"I'll get back to you when I have your review.\"\n\nOne day(4th august) i called a different HR, he finally told me the real reason behind the delay that **position went on hold**. When I asked them today if there's still a chance, they said they'll \"check and let me know.\"\n\nHas anyone been in a similar situation with Adobe? What are the realistic chances when they say \"position on hold\" after final rounds?\n\nI'm continuing my job search but just curious about others' experiences - will the role eventually open up or was this a soft rejection?\n\nThanks!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nkch6k/adobe_sde2_position_on_hold_after_round_3_what_to/",
      "comments": [
        {
          "body": "Just follow up with the HR once more",
          "score": 1
        },
        {
          "body": "Keep applying for other companies bro... Don't waste your time waiting for them.",
          "score": 1
        }
      ]
    },
    {
      "title": "Need advice for final F2F client round at Adobe (Bangalore) for Java Full Stack role",
      "body": "Hi everyone,\n\nI'm a developer with 4 YoE and I need some guidance for an upcoming interview.\n\nI've cleared the L1 (technical) and L2 (technical) rounds for a **Java Full Stack Developer (Java + React)** position. The interviews were conducted by ACL Digital, but the end client is **Adobe (Bangalore)**.\n\nThe next round is a **face-to-face interview at the Adobe office**, which I believe is the final client/techno-managerial round.\n\n**I would really appreciate it if anyone could help me with,**",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nmwnob/need_advice_for_final_f2f_client_round_at_adobe/",
      "comments": [
        {
          "body": "Expect questions about how you've handled challenging projects, worked with cross-functional teams, and dealt with tight deadlines. They'll probably ask about your experience with their tech stack and how you stay updated with evolving technologies, plus some behavioral questions about conflict resolution and leadership potential.\n\nThe key is demonstrating that you can think beyond just writing code - Adobe wants to see that you understand the bigger picture of product development and can communicate technical concepts to non-technical stakeholders. Be ready to discuss specific examples from your 4 years of experience, particularly any projects involving both Java and React, and prepare thoughtful questions about Adobe's engineering culture and growth opportunities. Since this can be an intense final round with potentially tricky technical and behavioral questions, I actually work on [interview practice AI](http://interviews.chat), which is designed specifically to help candidates navigate these challenging interview situations and provide real-time guidance for exactly these kinds of high-stakes conversations.",
          "score": 1
        }
      ]
    },
    {
      "title": "Preparing for Adobe Noida C++ Developer Role - What Questions Should I Expect?",
      "body": "Hello Reddit community,\n\nI'm gearing up for an interview with Adobe Noida for a C++ Developer position with 2+ years of experience and I want to make sure I'm thoroughly prepared. I'd appreciate any insights from those who have been through the process or have experience with similar roles.\n\nSpecifically, I'd like to know:\n\n1. What technical questions related to C++ should I be prepared for?\n2. Are there any common algorithm and data structure problems they focus on?\n3. What are some examples of system design questions that might come up?\n4. Should I expect any questions on software development practices or design patterns?\n5. Any tips on how to best showcase my experience and skills during the interview?\n\nAdditionally, if there are any resources or study materials that you found particularly helpful, please share them.\n\nThank you in advance for your help!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1dufq7e/preparing_for_adobe_noida_c_developer_role_what/",
      "comments": [
        {
          "body": "For technical questions, brush up on C++ fundamentals like object-oriented programming, memory management, and common library functions. Expect algorithm and data structure questions too - think sorting algorithms, searching, and maybe some tree or graph problems. System design questions could involve designing a small system or component, so revisiting design patterns is a good idea. To really stand out, discuss projects where you applied your C++ skills and highlight your problem-solving process. Good luck with the interview! And if you want to practice for those tricky C++ questions and get feedback on your answers, check out Interviews Chat, a tool I built to help people prep for interviews (https://www.interviews.chat).",
          "score": 2
        },
        {
          "body": "Hey man! How was your interview? Do you remember and can you share some questions they asked?",
          "score": 1
        }
      ]
    },
    {
      "title": "Recruiter asking for Portfolio",
      "body": "I applied for a marketing coordinator position, and the recruiter is asking for a portfolio before setting up an initial interview. I don't have an online portfolio as I don't have access to the work I did for my previous job. I have a year of experience working as a marketing coordinator. \n\nThe email also says :  \n\"We will be looking for examples of creating content, focused on text and images similar to a proposal or magazine spread. If you are able to create this in Adobe inDesign, this would also be a benefit for evaluating your ability to use this software.\"\n\nI know how to use InDesign, but I am not an expert.\n\nWhat should I say in this email??",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1cnd97c/recruiter_asking_for_portfolio/",
      "comments": []
    },
    {
      "title": "What happens if I own an LLC but choose not to include it on my resume?",
      "body": "TLDR: if I own a single-member LLC but leave it off of my resume, could it appear in a background check and can the interviewer legally ask me to elaborate about or confess to owning the LLC? What public info can they see about the LLC (such as yearly earnings, even though it’s $0)?\n\nBackstory:\nI (27F) have a BS in Business Analytics but I own an LLC (small baking business startup) which has been a struggle to get off the ground. It was more of a side project kind of thing that became increasingly difficult. I haven’t earned any money through it yet, however I have no plans to dissolve it and hope to at least get it off the ground even if it brings in minimal income. I don’t want an employer to use the LLC against me for “having no time to dedicate to the company” or for salary reasons, if they assume that I earn money from the business. If I say I earned $0 from the business (which is true), that would also look bad/failed on my part too.\n\nAll of my work towards this LLC showcases some of my skills from my minor in college, being logo design (Adobe suite) &amp; graphic design. I am conflicted because I’m not sure if I should even bother including the LLC or the formal name of it on my resume at all since I don’t want them to look it up online or on social media as there won’t be any results.\n\nI am conflicted on what to do since removing it from my resume leaves a 1-year gap which I would have to strategically fill up with other work I did during that timeframe.\n\nThank you for any opinions provided!",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1af9200/what_happens_if_i_own_an_llc_but_choose_not_to/",
      "comments": [
        {
          "body": "Same…. \n\nIt looks like either was lazy and didn’t work. Meanwhile I was crazy working 24/7 maintaining a business\n\nSomeone give us answers!!",
          "score": 5
        },
        {
          "body": "Your choice. A background check only checks for the companies and dates you give them (either by filling a form, or they take the data from your resume). If you leave it, they will not check and you have to explain the gap some other way. Background check companies will not go look for LLCs you own or houses you own etc. just employment check (dates and companies) and criminal background check. If the jobs you are applying to are competitors of your baking business (I.e. you may have a conflict of interest working there) then you should make it known. Otherwise, side businesses are ok.",
          "score": 3
        },
        {
          "body": "If you are comfortable with lying, it could be an idea to to include it as a startup owned by someone else. That way you can include all the aspects that show your experience but you’re not tied to it’s success or income. You could say someone you know launched a startup and they knew you had the right skill set and you wanted to get involved as you knew it would be good experience and wanted to also learn about starting a business etc?",
          "score": 1
        }
      ]
    }
  ]
}