{
  "company": "amazon",
  "post_count": 70,
  "exported_at": "2026-01-18T17:44:53.255Z",
  "posts": [
    {
      "title": "A m a z o n is cheap",
      "body": "Was browsing around to keep tab on the job market and talked to a recruiter today about a senior engineer role. The role expects 5 days RTO, On call rotation 24/7 every 4-5 months for a week. I asked for flexibility to wfh at least during the on call week and the recruiter fumbled.\n\nI’ve been in industry for close to 10 years now and first time talking to Amazon. I thought faang paid more. Totally floored to find out I’m already making 13% more than the basic being offered for the role. And you’re also expecting me to go through a leetcode gauntlet?\n\nNo thanks. \n\nI feel like our industry as a whole is getting enshittificated. If you already got a job and have good team/manager, focus on climbing the ladder and if you’re ever on the side of interviewing, stop the leetcode style stuffs and focus more on digging the experience of a person? That’s how I been interviewing and got really good candidates. ",
      "subreddit": "cscareerquestions",
      "score": 2245,
      "url": "https://reddit.com/r/cscareerquestions/comments/1jacea9/a_m_a_z_o_n_is_cheap/",
      "comments": [
        {
          "body": "One week of on call every 4-5 months? Damn you know how good that is lol",
          "score": 2079
        },
        {
          "body": "I’m convinced 80+% of the posts on this Reddit anymore are trolling",
          "score": 103
        },
        {
          "body": "That’s a generous oncall schedule tbh. ",
          "score": 974
        },
        {
          "body": "An L6 at Amazon clears $400k/yr, where are you working that pays more than that as a non-FAANG?",
          "score": 249
        },
        {
          "body": "Most faang have low base pay.  The money is in the stock.  Plus, you'll have additional ways of making money, like employee stock purchase plans.",
          "score": 361
        }
      ]
    },
    {
      "title": "I think Amazon overplayed their hand.",
      "body": "They obviously aren't going to back down. They might even double down but [seeing Spotify's response](https://fortune.com/europe/2024/10/08/spotifys-hr-chief-remote-staff-flexible-work-policy/). Pair that with all the other big names easing up on WFH. I think Amazon tried to flex a muscle at the wrong time. They should've tried to change the industry by, I don't know, getting rid of the awful interviewing standard for programming",
      "subreddit": "cscareerquestions",
      "score": 2639,
      "url": "https://reddit.com/r/cscareerquestions/comments/1g2bwbt/i_think_amazon_overplayed_their_hand/",
      "comments": [
        {
          "body": "I think the motivation at Amazon for the RTO is to get people to quit voluntarily.  That's a lot less expensive than laying them off.",
          "score": 2217
        },
        {
          "body": "&gt;I think Amazon tried to flex a muscle at the wrong time.\n  \nno, I think they very well know what they're doing, and it's working so far: to get people angry and pissed off, this way they'll quit on their own = no need to do layoffs or pay severance",
          "score": 756
        },
        {
          "body": "Unless it’s to reduce headcount without doing a layoff as some people suspect. Then it’s going exactly to plan.",
          "score": 166
        },
        {
          "body": "I’ve heard rumours it was motivated by the fact that the cities they built HQ2 in provided them with tax incentives in order to bring employees - and by extension, business activity for tax revenues. However, these deals were sealed prior to the pandemic creating a sticky situation for Amazon and their relationships with state governments.",
          "score": 132
        }
      ]
    },
    {
      "title": "Hacks to get hired at Amazon",
      "body": "Hey, I’m a software engineer at Amazon and want to share some hacks on getting hired.\n\nCouple points: \n1) Please do not message me\n2) I have participated in many interviews, this is my experience, the morals of these cheats or whether you have success is up to you.\n\n\n\n First, the coding rounds (not including OA) does not allow you to run your code, it’s basically a blank text editor. Many interviewers cannot really tell if your code will run, they just see if it “looks correct”. I’ve seen a lot of candidates get hired by borderline writing pseudocode. The lesson here is to waste zero time wondering about nit-picky details like if your loop is off by one, or what that built in method to convert an int to a string is… they care about SPEED and just that you have the right idea.\n\nSecond, Amazon treats their LPs like the holy texts. But the only thing that really matters is delivering to please your superiors no matter what. This means put customer obsession, deliver results, and ownership above all else. These are the rules you live by. You tell these people that you skipped Christmas because you had to fix an open source dependency to unblock some random guy in Indian if you have to…\n\nHonestly I hate this company but if this helps you get hired I’m happy for you, just know that if you do get hired and you BS’d using my tried and true formula, you may get pipped.",
      "subreddit": "cscareerquestions",
      "score": 2509,
      "url": "https://reddit.com/r/cscareerquestions/comments/1i8p6am/hacks_to_get_hired_at_amazon/",
      "comments": [
        {
          "body": "You know this guy is legit when he uses acronyms like LP. Every shit company I’ve ever worked at used stupid acronyms for everything and could never just say entire words",
          "score": 1354
        },
        {
          "body": "LPs = Leadership Principles?",
          "score": 430
        },
        {
          "body": "Ha! Just passed an Amazon loop and realized that they never run the code. They never seemed to care about several obvious syntax errors that I made",
          "score": 270
        }
      ]
    },
    {
      "title": "I've walked away from software development.",
      "body": "Throwaway for obvious reasons.\n\nI've spent the last year planning my exit strategy. I moved to somewhere with a lower cost of living. I lowered my expenses. I prepared to live on a fraction of my income.\n\nThen I quit my job as a Principal Software Engineer for a major tech company. They offered me a promotion, I said no. I have zero plans of ever getting another job in this industry.\n\nI love coding. I love making software. I love solving complex problems. But I hate the industry and everything it's become. It's 99% nonsense and it manufactures stress solely for the sake of manufacturing stress. It damages people, mentally. It's abusive.\n\nI'm sick of leetcode. I'm sick of coding interviews. I'm sick of everyone being on Adderall. I'm sick of wasting time writing worthless tests. I'm sick of fixing more tests than bugs. I'm sick of endless meetings and documents and time tracking tools. I'm sick of reorgs. I'm sick of how slow everyone moves. I'm sick of the corporate buzzwords. I'm sick of people talking about nebulous bullshit that means absolutely nothing. I'm sick of everyone above middle management having the exact same personality type. I'm sick of worrying about everyone's fragile ego. I'm sick of hissy fits. I'm sick of arrogance. I'm sick of political games. I'm sick of review processes that encourage backstabbing. I'm sick of harassment and discrimination. I'm sick and I'm tired.\n\nAnd now I don't have to deal with it anymore.\n\nI've never felt happier. It's as if I've been freed from prison.\n\nI won't discourage anyone from pursuing a career in software, but I will encourage everyone who does to have an exit plan from day one. One day, you'll realize that you're rotting from the inside out.\n\n**Edit**\n\nI wasn't expecting this many responses, so I'll answer some questions here.\n\nI'm in my early 40's and I've been doing this since college.\n\nI didn't get a large sum of money, I simply moved to a small place in a small town where I'll be taking a part time job working outdoors. I was living in a tech center with a high cost of living.\n\nI've worked at 7 companies, including Microsoft and Amazon. The startups were much nicer, but they become more corporate over time.\n\nFinding a good company culture is mostly luck, and I'm tired.\n\n&amp;#x200B;",
      "subreddit": "cscareerquestions",
      "score": 5925,
      "url": "https://reddit.com/r/cscareerquestions/comments/kfcmbj/ive_walked_away_from_software_development/",
      "comments": [
        {
          "body": "My exit plan is simply to hold out until I get fired which surprisingly hasn't happened yet despite my abysmal performance at my job. I'm not about to just walk away from my good salary though with nothing lined up especially during a pandemic.",
          "score": 1573
        },
        {
          "body": "Sounds like you’re coming from amazon",
          "score": 109
        }
      ]
    },
    {
      "title": "Is tech job market really cooked ?",
      "body": "I am SWE with 8 YOE. Nothing too niche, full stack developer that knows a few web dev tech stacks with most recent titles of senior and tech lead. No AI or ML. I was laid off in June. Prepared hard, polished my resume with AI many times, applied to between 200-300 jobs in the span of 2 months. Got about 15 interviews, 4 offers. I think I could get more offers tbh but after I found the company I really liked I accepted an offer and stopped the interview process with the rest. I interviewed with Capital One, Visa, UKG, Amazon, Circle, Apollo, Citadel, FICO, GM and some no names or startups. That’s all to say that after reading reddit I was anxious to even apply but I think I got a decent amount of interviews and negotiated my offers to be either at the higher end of the salary range for the role or even above advertised. I do recognize it’s much harder for junior engineers these days but is there really a shortage for experienced engineers? I haven’t felt that. I’m not even a native English speaker although I do speak English fluently. I’m in the US. I also didnt lie on resume or cheated during coding rounds. Some of them I solved 100%, some not. For example for C1 I got 450/600 points on CodeSignal and still got a callback and an offer after clearing their power day. Ask me anything I guess. Happy to help someone if I can. No referrals though, sorry. I’ve just started a few weeks ago, too early to refer especially someone I don’t personally know. Here are a few things that I believe gave me an edge or worked in my favor:\n- referrals from my network\n- local jobs that required hybrid schedule\n- tailored resumes\n- soft skills\n- activity on LinkedIn (mostly commenting)\n\nI also tried to outsource the filling out job applications part so I can focus on preparing and interviewing but I didn’t have much success with freelancers from Fiverr. I was also approached by a “do it for you” company but they charge % of your first year salary + a fixed fee and I decided to just do it myself.",
      "subreddit": "cscareerquestions",
      "score": 676,
      "url": "https://reddit.com/r/cscareerquestions/comments/1npw1h9/is_tech_job_market_really_cooked/",
      "comments": [
        {
          "body": "Not everybody has the same experience in a given job market and those that are struggling tend to speak the loudest.",
          "score": 383
        },
        {
          "body": "I have 7 YOE and my experience doing a job search after getting laid off recently was very similar. Ended up with 3 offers all willing to give me a very big raise, and I had to cancel many interviews.     \n\nThe market for experienced people living in a tech hub willing to work from an office is not bad. I didn't even needed to apply, I just refreshed my resume/LinkedIn, set LinkedIn open to work (and got LinkedIn premium) and then I had 2-3 recruiters reaching out daily.     \n\nI think the new grad market is cooked. If you don't have internships, it's going to be really rough. And this sub is filled out with new grads.",
          "score": 468
        },
        {
          "body": "How difficult were the LC questions? And what kind of prep did you do? I haven't done much LC but now I hear even if you solve all the questions sometimes you don't get an offer. Appreciate any help!",
          "score": 34
        },
        {
          "body": "It really depends on your area you're applying in too. getting your foot in the door is typically the hardest so 8 YOE is pretty good for finding jobs",
          "score": 25
        },
        {
          "body": "There's two worlds for CS. The exceptionally skilled, and everyone else. You need to be on the tail end of the bell curve to have evergreen demand, and that means 70%+ of developers are a lot more easily replaceable.\n\nWhen people think about CS jobs they think of the experience of the 30%, but they don't know the amount of hard work and skill needed to get there and they are disappointed when they don't have that experience when they're in the bulky part of the bell curve. \n\nThe people I know who are exceptionally skilled all have experiences similar to you. I'm sure you're in the tail of the bell curve.",
          "score": 75
        },
        {
          "body": "Challenge to this sub: stop posting that the industry is \"cooked\" every 10 minutes",
          "score": 51
        }
      ]
    },
    {
      "title": "What are some harsh truths that r/cscareerquestions needs to hear?",
      "body": "Title.",
      "subreddit": "cscareerquestions",
      "score": 1392,
      "url": "https://reddit.com/r/cscareerquestions/comments/vfifnq/what_are_some_harsh_truths_that/",
      "comments": [
        {
          "body": "Just because recruiters are reaching out to you doesn't mean you're qualified for the job and/or will get an offer from. Aka don't determine your employ-ability based off of them.",
          "score": 1339
        },
        {
          "body": "A good chunk of you need to grind your social skills more than your LeetCode.",
          "score": 2871
        },
        {
          "body": "This sub mainly consists of college students and people wanting to get in the field but aren't in it yet. A lot of the information on this sub is misleading or downright incorrect. Same with the information that tech influencers on tiktok and youtube give out. \n\n\nThis sub also has a lot of people who haven't found a job yet but are looking which makes a lot of topics on here quite negative. Lots of people don't have much trouble finding jobs or don't have much to complain about apart from the normal complaints of working any corporate job- but most of them aren't on this sub posting/commenting all the time.",
          "score": 2211
        },
        {
          "body": "Even if you’re lucky enough to land a 6-figure SWE job at a FAANG company, that achievement will just become another mundane part of your life, so find hobbies and interests outside of software development.",
          "score": 576
        },
        {
          "body": "I just got laid off , but I have enough money in the banks to survive for like 5 years so I  planning for a 6 months holiday no laptops ides no hacker rank no Leetcode. So here's the first lesson .always save you are just 1 email away from termination",
          "score": 339
        },
        {
          "body": "[deleted]",
          "score": 484
        }
      ]
    },
    {
      "title": "UPDATE (again): Just got fired. What to do next?",
      "body": "Hey everyone!  About eight months ago, [I was fired](https://old.reddit.com/r/cscareerquestions/comments/oz52ww/just_got_fired_what_to_do_next/) for what I thought was a pretty minor infraction of company policy (I loaned a $100 voucher for merchandise to my spouse when only I was supposed to use it.) In my [last update](https://old.reddit.com/r/cscareerquestions/comments/qv7shz/update_just_got_fired_what_to_do_next/), I mentioned I had rebounded, joining a great company and increasing my total compensation from $110k to $205k.\n\nAs another update, the company I've been with has been absolutely great with an amazing culture and awesome teammates, but the stock price has taken a hit, so I was a little open to considering other options.  Out of the blue, a FAANG recruiter reached out to me on LinkedIn and asked if I wanted to go through the interview process.  I figured it wouldn't hurt to at least try, and after a couple interviews I'm pleased to say I've accepted an offer with a FAANG!  Despite being down-leveled from senior to mid-level, my new total compensation is now $315k, which is nearly *triple* what I was getting paid at the place that fired me.\n\nThis past year has been a whirlwind and I can't say I'm eager to repeat it, but I'm really excited about this new opportunity!  So, again, if you find yourself unexpectedly fired like me, just know that it's not the end of the world.  In fact, it may be the beginning of something great!\n\nEDIT: As many have pointed it, the title makes it sound like I was fired AGAIN and definitely seems like clickbait.  I promise that wasn't my intention!  I just wanted to give an update to the original post, and since I had already given an update before, I used the word \"again\" in the title.\n\nEDIT 2: Some people think I didn't do any practice for the interview.  That's not true and I didn't mean to give that impression.  I studied very hard for about two weeks, doing about 150 LeetCode questions and going through the whole Grokking the Coding Interview course.  I also read through the systems design chapter in Cracking the Coding Interview and watched supplementary YouTube videos.  In addition, I prepared some pretty extensive notes for behavioral questions.  I just figured it was worth studying anyhow so even if I didn't get the job it was time well spent.",
      "subreddit": "cscareerquestions",
      "score": 2106,
      "url": "https://reddit.com/r/cscareerquestions/comments/v3xxqf/update_again_just_got_fired_what_to_do_next/",
      "comments": [
        {
          "body": "tender alive sleep telephone truck grab dependent snails automatic governor\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 1949
        },
        {
          "body": "[removed]",
          "score": 229
        },
        {
          "body": "How many YOE do you have?",
          "score": 117
        },
        {
          "body": "[deleted]",
          "score": 50
        }
      ]
    },
    {
      "title": "At this point is my SWE career close to being over? What can I even do?",
      "body": "So I am now in like code red and afraid for my life. \n\nI was laid off from my job at Github on March 25th 2025 after starting November 15, 2021 as backend engineer, my first job in New York.\n\nI took a 3 - 4 month break because I had a good amount saved and got severance, but think really underestimated how hard the market is. Then after 2 - 3 months of searching and failing, I got a offer at Amazon, and they rescinded my offer. And then the holidays hit and I failed so many other interviews, and I backed out of lot of interviews because I had gotten Amazon.   \n  \nIm now almost 10 months unemployed, and I feel like now I'm low-key screwed. My career dwindling, and the gap a huge red flag. What to do? How screwed is my career? \n\n",
      "subreddit": "cscareerquestions",
      "score": 374,
      "url": "https://reddit.com/r/cscareerquestions/comments/1qf6uvm/at_this_point_is_my_swe_career_close_to_being/",
      "comments": [
        {
          "body": "You just said you backed out of a lot of interviews. So go get more interviews. Since you were getting them before in a shitty market it is likely you can get them again.",
          "score": 352
        },
        {
          "body": "You have three years of experience at Microsoft, you should have no problems getting a job at a F500 even with the unemployment gap.",
          "score": 634
        },
        {
          "body": "Same shoes man. Kinda hit like a freight train, after getting close and then rejected so many times. The market (as in experiencing it) is not in a great spot. I had an easier time finding my first SWE role than I am now. Just wanted to say hang in there, I gotta see someone succeed so I believe in you!",
          "score": 49
        },
        {
          "body": "Why did they rescind your offer",
          "score": 75
        },
        {
          "body": "Did you not reach out to the companies you backed out of after Amazon rescinded? First thing I would have done",
          "score": 23
        },
        {
          "body": "You could say you did freelance or tried to build your own start up or something to fill in the gap.",
          "score": 74
        }
      ]
    },
    {
      "title": "Noticing AWS recruiters emailing/calling multiple times per day, how bad are things over there?",
      "body": "So just speculation, but Amazon is looking a bit desperate. The past few months I notice I get multiple AWS recruiters [reaching out daily](https://imgur.com/F5j9RPn).\n\n\n\n\n\n\n\nI keep telling them I’m not interested but the recruiters just say schedule a short 15 min slot to see if they can change my mind. This makes me wonder wtf is happening over there that’s causing these recruiters to be relentless?Is the turnover horrendous or something?",
      "subreddit": "cscareerquestions",
      "score": 1116,
      "url": "https://reddit.com/r/cscareerquestions/comments/vf8bg5/noticing_aws_recruiters_emailingcalling_multiple/",
      "comments": [
        {
          "body": "You know all that talk about grind culture and PIPs for engineers? Well, it applies to recruiters too.",
          "score": 1487
        },
        {
          "body": "People told me once I had my first job recruiters would be knocking my door down. They didn't say they'd all be from Amazon.",
          "score": 935
        },
        {
          "body": "I'm was an SDE at Amazon (on the retail side, not AWS). AWS gets a bad rep and some of it is well deserved, but it's a huge company. I know of AWS teams that are super chill, and some that are a grind house. Every team in the company runs basically independently, so team cultures vary drastically from team to team.",
          "score": 372
        }
      ]
    },
    {
      "title": "Looking for Tips: Amazon SDE Virtual Interview (3 Round in 1 Day)",
      "body": "Hey everyone,\n\nI just received an invite for the final virtual interview round for the Amazon SDE (Software Development Engineer) role. It’ll be 3 back-to-back technical interviews in one day, each about an hour long.\n\nAccording to the email, the interviews will cover design, data structures, algorithms, and basic coding. I’ve completed the online assessment, and this is the final step.\n\nI’d love to get any tips, strategies, or what to expect:\n\n1. What type of questions are typically asked in each round?\n\n2. How deep should I go into system design (since it's an SDE role, not SDE II)?\n\n3. Any must-review topics or red flags to avoid?\n\n4. Ideal length and structure of an answer.\n\nThanks in advance for the help. Would really appreciate insights from anyone who's been through it recently.  ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1lqvq9r/looking_for_tips_amazon_sde_virtual_interview_3/",
      "comments": [
        {
          "body": "LP + DSA + LLD. What was your timeline?",
          "score": 2
        },
        {
          "body": "Each round typically focuses on different aspects - one will be heavy on data structures and algorithms with medium to hard LeetCode-style problems, another will test your system design thinking but at a more basic level than SDE II (think designing a URL shortener or chat system rather than Netflix's architecture), and the third often combines coding with behavioral questions using their leadership principles. They love asking about trade-offs, so when you're coding or designing, always mention time/space complexity and alternative approaches even if you don't implement them.\n\nThe key is talking through your thought process out loud and asking clarifying questions before jumping into solutions. For system design as an SDE I, focus on the basics like load balancing, database choices, and API design rather than getting lost in advanced topics like sharding strategies or microservices orchestration. Practice coding on a whiteboard or shared screen since the environment feels different than your usual IDE, and prepare specific examples for their behavioral questions that demonstrate ownership, customer obsession, and bias for action. If you want extra support navigating those tricky technical questions and system design scenarios, I helped build [AI interview assistant](http://interviews.chat) which can give you real-time guidance during the actual interview process.",
          "score": 2
        },
        {
          "body": "Congrats on making it to the final round! That's already a huge accomplishment.\n\nFor the 3 rounds, expect a mix but usually goes something like: 2 rounds heavy on coding (data structures/algorithms) and 1 that leans more toward system design concepts. The coding rounds will be similar to what you've probably prepped for - arrays, trees, graphs, basic DP. Amazon loves asking variations of classic problems rather than straight leetcode copies.\n\nFor system design as an SDE1, don't overthink it. They're not expecting you to architect Netflix. Focus on basics like how you'd structure a simple service, talk through scalability at a high level, mention databases/caching when relevant. Think more \"design a URL shortener\" level, not \"design distributed systems for millions of users.\"\n\nFew things that trip people up:\n\n\\- Spend too much time on optimal solution instead of getting a working solution first\n\n\\- Not talking through their thought process enough\n\n\\- Forgetting to test edge cases out loud\n\n\\- Writing messy code (they really care about clean, readable code)\n\nKeep each coding solution to 20-30 lines if possible, comment as you go, and always walk through a few test cases. For system design, 10-15 minutes is usually enough depth.\n\nThe candidates we placed, who do best aren't necessarily the strongest coders - they're the ones who communicate clearly and stay calm under pressure. You've got the skills already or you wouldn't be there.\n\nAre you considering roles in smaller startups as well?\n\nGood luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "About amazon SDE (software development engineer) full time interview",
      "body": "has anyone taken online assessment for full time sde? \nout of nowhere i got an invitation to take online assessment for full time position and took online assessment a week ago(debugging, 1 coding, reasoning) after getting all problems,\nreceived another online assessment about work simulation (90min) and  coding(2 question 60min) has anyone done this?\nI don't know what work simulation test is about,.. Thaknyou ",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/3cln67/about_amazon_sde_software_development_engineer/",
      "comments": [
        {
          "body": "Hey,\n\nI took the  online test Part 1 two weeks ago.Today I received the same online assessment part 2 which consists of work simulation (90min) and coding(2 question 60min).I am also looking for an answer to your question",
          "score": 2
        },
        {
          "body": "The first online assessment has how many questions in the debugging and reasoning section? Can someone give a hint on what type of questions are asked in these sections?",
          "score": 2
        },
        {
          "body": "Hey I'm in pretty much the exact same position here. I have no idea what a work simulation is. I have to finish this assessment before within a week.",
          "score": 1
        },
        {
          "body": "I'm in the same situation. Just wondering what kind of tests these are so I can prepare/practice a bit.",
          "score": 1
        },
        {
          "body": "Why don't you guys just make a sacrifice and then everybody knows the answer...",
          "score": 1
        },
        {
          "body": "cmon guys, someone make the sacrifice!",
          "score": 1
        }
      ]
    },
    {
      "title": "What am I doing wrong?",
      "body": "Got laid off from FAANG a year ago (with no severance, those bastards) and I've had zero luck with finding a job since then.\n\n300+ job applications and nothing to show for it.\n\nI have 3 years of experience, an established portfolio with multiple projects, and a wide skillset.\n\nIs the market oversaturated? Is my resume not making it through the AI filters?\n\nI am stumped.\n\nEdit: Since there seems to be some confusion, I just want to clarify that I've worked at other places aside from FAANG in my 3 years and that I'm mainly a server engineer with some software dev experience. The bit about severance is a throwaway line and you guys need to chill.\n\nI appreciate the tips on networking and expanding my reach.",
      "subreddit": "cscareerquestions",
      "score": 306,
      "url": "https://reddit.com/r/cscareerquestions/comments/1m3e0t8/what_am_i_doing_wrong/",
      "comments": [
        {
          "body": "For anyone in this thread: OP is a Project manager, which explains the long time without being able to get a job. Pretty much every non software engineering role I know who has been let go...it's taken them 8-15 months to find something new.",
          "score": 131
        },
        {
          "body": "People don’t really get laid off from faang jobs with no severance. Why did you get fired? No one is going to be able to help you if you aren’t at the point you can admit that.",
          "score": 437
        },
        {
          "body": "Honestly I have no idea. \n\n\nI tend to ignore Reddit trends because of the pretty huge potential for bias - as someone else put it in an earlier post, people who got a job without struggling don't tend to post about it and don't get upvoted much if they do. \n\n\nIn my personal circles, I know both people who lost jobs and got back in without issues (myself included, thankfully) and people who have had a really hard time of it (both with and without work experience).\n\n\nI haven't noticed a correlation for skill or experience, I _have_ noticed that the best cases are the ones where networking was involved. But I'm not convinced that that's the One Magic Trick™ separating the people who have it easy from the ones who don't.",
          "score": 32
        },
        {
          "body": "Here’s the conclusion I’ve come to: many FAANG grads are struggling to land jobs now because they were hired during a boom when top companies were scooping up talent, even those without real, developed skills, just to meet the demand of a rapidly digitalizing world.\n\nRemember, before COVID and the work-from-home shift, many legacy companies were still doing accounting on paper and hadn’t even integrated Excel into their workflows. Modernizing these dinosaur companies in such a short timeline was a massive undertaking, made possible by near-zero interest rates and tax breaks on developer salaries. It created a tech hiring bubble.\n\nMany grads hired into FAANG during this time barely had a chance to gain real experience before being laid off. And what does that signal to recruiters? Fair or not, it suggests you were in the bottom performance tier and got cut. It’s rough but not necessarily your fault. You were supposed to have time to grow, learn, and move up or out. That chance was taken away.\n\nNow you're competing with other laid-off peers and fresh grads some of whom companies may prefer because they're seen as more malleable and come without the layoff baggage. And if you have under four years of experience, you're often not seen as experienced enough for mid-level roles, but no longer \"new\" enough for new grad positions either.",
          "score": 157
        },
        {
          "body": "&gt;I have 3 years of experience\n\nYou have 3 years of FAANG experience and no network? At the very least an Amazon recruiter should have reached out",
          "score": 19
        }
      ]
    },
    {
      "title": "I really hate online coding assessments used as screenings",
      "body": "I've been a SWE for 15+ years with all kinds of companies. I've built everything from a basic CMS website to complex medical software. I recently applied for some jobs just for the hell of it and included FAANG in this round which led me to my first encounters with OA on leetcode or hackerrank.\n\nIs it just me or is this a ridiculous process for applicants to go through? My 2nd OA question was incredibly long and took like 20 minutes just to read and get my head around. I'd already used half the time on the first question, so no way I could even get started on the 2nd one.\n\nI'm pretty confident in my abilities. Throughout my career I've yet to encounter a problem I couldn't solve. I understand all the OOP principles, data structures, etc. Anytime I get to an actual interview with technical people, I crush it and they make me an offer. At every job I've moved up quickly and gotten very positive feedback. Giving someone a short time limit to solve two problems of random meaningless numbers that have never come up in my career seems like a horrible way to assess someone's technical ability. Either you get lucky and get your head around the algorithm quickly or you have no chance at passing the OA.\n\nI'm curious if other experienced SWE's find these assessments so difficult, or perhaps I'm panicking and just suck at them?\n\nEDIT: update, so I just took a second OA and this one was way easier. Like, it was a night day difference. The text for each question was reasonable length with good sample input and expected output. I think my first experience (it was for Amazon) was just bad luck and I got a pretty ridiculous question tbh. FWIW I was able to solve the first problem on it and pass all tests with what I'm confident was the most optimal time complexity. My issue with it was the complexity and length of the 2nd problem's text it just didn't seem feasible to solve in 30-45 minutes.",
      "subreddit": "cscareerquestions",
      "score": 1020,
      "url": "https://reddit.com/r/cscareerquestions/comments/upgaof/i_really_hate_online_coding_assessments_used_as/",
      "comments": [
        {
          "body": "I think the process is so hard because the industry is far more concerned about false positive candidates than they are about false negative ones.\n\nAlso, not being able to solve it leaves room open for discussion in the interview process, where the candidate might elaborate on his thinking process and solve something rather than to spit out a definition about a certain topic.\n\nThe real tragedy is that the major part of the interview process will never be used in any of the jobs who use it to screen for viable candidates.",
          "score": 642
        },
        {
          "body": "[deleted]",
          "score": 99
        },
        {
          "body": "They're pretty difficult. Any company going to great lengths to filter people out like FAANG does is going to require a hell of a lot more studying than a measly 2 hour OA, even if you're a fantastic senior staff engineer. \n\nSo the OA doesn't bother me. It's a drop in the bucket. \n\nNo one likes jumping through the artificial hoops like a show dog. But I can't think of any easier way of earning $300k+/yr and the ability to work on projects that are or could easily become household names.",
          "score": 187
        },
        {
          "body": "I’m convinced that these OAs get harder the further away from college you are. So while they filter out the weaker fresh grads, they also filter out senior engineers who haven’t had to even think about Kadane’s algorithm in 10 years.",
          "score": 20
        },
        {
          "body": "I just started with a new company. Sr Software Engineer, 100% remote. They're based in western United States. $140k base salary. There was no coding assessment just 5 long zoom calls, 3 with other engineers, 1 with the VP of engineering.\n\nIt's pretty awesome to just talk shop to other engineers. A good engineer can recognize another one.",
          "score": 19
        }
      ]
    },
    {
      "title": "I am a REAL bad software developer and this is my life",
      "body": "I just saw a post on r/programming titled [\"I am a bad software developer and this is my life\"](https://www.reddit.com/r/programming/comments/11756hp/i_am_a_bad_software_developer_and_this_is_my_life/) and it was obvious to me that this is just a guy who was bad at the interview process but who is actually a fine software developer. As a real bad software developer, I wanted to tell my story so you can learn from it:\n\nI was always good at standardized exams that I studied for. The first time I took the SAT college entrance exam in the US, I scored a perfect 800 on the math and a 720 on the critical reading, for an SAT score of 1520 out of 1600 - a Harvard admissions level SAT score (note I think my writing was 660, which is good but not great, but colleges didn't look at the writing score as much and the essay section isn't even on the SAT anymore). Anyway, I graduated with a bachelor's in computer science from the best public university in my state and was able to pass the coding interviews after studying the book \"Cracking The Coding Interview\" and practicing LeetCode problems, but despite having done well at interviews, I was always a worthless programmer. My first real job in 2016 was an entry level software engineering position at Amazon on the East coast of the US, and despite it being entry/junior level, I started out with a 130k base, 20k bonus issued in monthly installments, and some vesting stock (I had multiple competing offers and negotiated up).\n\nDuring my two years at Amazon, almost every task followed the same pattern. I would let my manager or senior engineer pick out an \"easy\" task for me in the queue (from Jira). I would ask my senior engineer where in the codebase the change needed to be made (because I could never learn my way around a codebase I didn't write). I used \"git blame\" to find who wrote or worked on that code before me (all code at Amazon was code reviewed and the name of the Jira issue was in the git commit so if I couldn't ask the person who wrote the code I could ask the person who reviewed it) and I would go to their desk or message them asking them questions about the code because I could not learn a codebase or navigate/remember code written by other people for the life of me (I was also unable to read long SQL statements with multiple different joins in it and had other particular cognitive troubles like being unable to navigate without a map). Then after I established in what file or function the code change needed to be made I would put print statements in between every single line of code (because I couldn't figure out how to hook up the debugger to the running Java server) and I would run the code over and over, asking my senior engineer (Matt Barr, mattbar@amazon.com ) for help when I got stuck or didn't know what to do, which was frequent. I would try to ask questions of people other than that senior engineer guy so that all the questions weren't focused on just one person, and I would sort of do a rotation of people to spread out the load of helping me. I had a good relationship with my whole team - we all played board games together every day during lunch so they were generally helpful. Eventually I managed to finish the task, but in the process I took up so much of other, more experienced people's time that they could have just completed my task in about the time I spent receiving help.\n\nI never became able to complete any work independently at any real coding job (even with the regular use of StackOverflow and Google). I never even was able to contribute to any open source project that I wasn't the sole author of despite having tried to get into various different open source projects multiple times. Despite that, I failed up, going from a job at Amazon that paid me $150,000 to another job that paid $86 an hour on W2 in a small city where my rent was $1,350 a month walking distance from work. I did not complete a single task in my three months of time there before I was fired for schizoaffective/bipolar manic psychosis. I tried one more tech work attempt but had the same problems as I did at Amazon (this codebase was in Scala, a programming language I like more than Java, which was used at Amazon, but the Scala code was even harder for me to read and navigate than the Java code so I didn't do any better) and my mental health had issues so I basically gave up on programming work entirely. After that I tried to get minimum wage work in places like food service but they didn't want to hire me with my history, and also I eventually developed some neurological symptoms that made very basic things like walking very hard for me and sometimes impossible.\n\nEventually (like at the age of 25, after less than 3 years of work) I ended up receiving government disability benefits due to psychiatric/neurological brain issues. I now live with my parents (who charge me about $150 a month in rent, or the amount of the water bill, for the bedroom I grew up in) and collect $2950 a month in SSDI from the government, which I intend to keep doing for the rest of my life (assuming I don't get kicked off benefits during a Continuing Disability Review which the government is supposed to conduct regularly).\n\nPerhaps the brain issues contributed to me being a sucky programming employee. Despite my cognitive issues (I have very specific cognitive issues like being unable to navigate at all without Google Maps), I did well on the coding tests and could write an impressive sounding resume and exaggerate/lie my way through behavioral questions, which is what I was judged on. There's also a system design question on the interview but if you study the GitHub system design primer, some sample system design problems on YouTube or AlgoExpert, and maybe read some books about designing applications, the system design section shouldn't be too bad. As a junior developer I never actually did any system design work anyway. That being said, I am a real bad software developer (as far as being a good, useful employee goes). If you're having a hard time getting a job but you're regularly making contributions to open source projects and independently contributing to the codebase at work, you're probably not a bad programmer - you're probably just not as good at coding problems, studying for the interview, and convincingly exaggerating/lying on the behavioral section as I was.",
      "subreddit": "cscareerquestions",
      "score": 1056,
      "url": "https://reddit.com/r/cscareerquestions/comments/117mev0/i_am_a_real_bad_software_developer_and_this_is_my/",
      "comments": [
        {
          "body": "Honestly I'd be more concerned about the mental breakdown leading to you getting fired than lack of dev skills",
          "score": 442
        },
        {
          "body": "I don't think the problem is that people here fail to recognize that they are bad, tbh.\n\nI'm amazed that you were able to get disability with your description of what you managed to do. You essentially managed your coworkers into doing your work for you. Couldn't you easily be a manager or PM?",
          "score": 648
        },
        {
          "body": "If that guy in the link is bad then i hold the official title of the worlds biggest clown dev.\n\nIn all seriousness. I do think i am a bad developer too, i always think there must be a quick and easy way to do everything...",
          "score": 148
        },
        {
          "body": "Bro you weren’t a bad engineer you were a junior engineer. That’s what they do.  I’m serious. You were likely better than 50% of them. You weren’t a rock star or anything, but honestly you sound like did exactly what I would expect or a not complete shit jr engineer. \n\nI think you were so used to acing things when you did average at your job you assumed you sucked. \n\nThere’s this weird thing where kids who were amazing at school meet kids who weren’t amazing at school but are better at (something) they have an existential crisis or mental breakdown. \n\n\nFucking relax dude, it’s ok to be just “fairly smart”.",
          "score": 366
        }
      ]
    },
    {
      "title": "Name and Shame: Epic Systems, for Unnecessarily Increasing Risk of COVID Transmission",
      "body": "Just as an FYI to anybody looking into working here:\n\nThe healthcare organization Epic Systems is pushing over 2,000 software developers to be back on campus by August 24th, and will have all of it's **10,000** employees on campus by **September 21st**, even though many of our employees have successfully been working remotely for the past 3 or 4 months. Anybody at increased risk for COVID will have to be back by November 2nd.\n\nThey did a recent [interview](https://www.youtube.com/watch?v=EwQCVIXmJok) with CBS on this recently, although I have no idea why they agreed to this.\n\nHonestly, before this COVID response I really enjoyed my time at Epic. The tech stack was a bit outdated, sure, but I was given lots of responsibility and was given lots of chances to grow. Unfortunately, the company's push to have its employees work on campus *(for the sake of \"culture\" according to our CEO)*, combined with the fact that this increases the risk of a COVID outbreak in Madison, has made me lose a lot of respect for our company as a healthcare organization.",
      "subreddit": "cscareerquestions",
      "score": 1608,
      "url": "https://reddit.com/r/cscareerquestions/comments/i3n1cy/name_and_shame_epic_systems_for_unnecessarily/",
      "comments": [
        {
          "body": "I would also like to add that the CEO has included in an email to its employees, that if they don’t feel “comfortable” coming back to campus, they could request a leave of absence. However, their position isn’t guaranteed when they want to come back.",
          "score": 500
        },
        {
          "body": "[deleted]",
          "score": 280
        },
        {
          "body": "This is a proper name and shame; there's proof of the claims and this is behavior that should be publicized to put pressure on the company\n\nand yeah, Epic's customers  should know about this because it puts more work on them\n\nAlways heard not so great things about Epic but this takes the cake...",
          "score": 284
        },
        {
          "body": "I didn’t realize how popular this company was. They had a job posting on my schools job board for CS students and I mistakenly thought they were Epic Games. So I applied to them but as I was talking to the recruiter via a phone screening I realized my mistake and hung up lol",
          "score": 121
        },
        {
          "body": "&gt;healthcare organization\n  \nironic...",
          "score": 145
        }
      ]
    },
    {
      "title": "My experience interviewing in 2025 with 5 YOE",
      "body": "https://imgur.com/a/iRI5FRT\n\nI wanted to share my experience interviewing for the past two months in this market.  \n\nI have a Bachelors of Science in a field unrelated to computer science and graduated in 2020, straight into COVID-world. I'd taken a few computer science courses, so I spent my last semester of university looking for software engineer roles knowing we were probably going to be remote for a while.\n\nI've been working for five years, with most of that time at Amazon. I've been a mid-level engineer for roughly 1.5 years, but feel that I should've been promoted sooner. Despite what people say about working at Amazon, I've enjoyed my four years here. I lucked out with finding a good team and manager.\n\nMy main reasons for leaving are:\n\n- Amazon comp philosophy is bad. You are assigned stock to meet a target compensation number, with the assumption that the stock will increase 15% YoY. The stock has actually gained 10% YoY since I've started, which means I'm paid less than my target. The solution to this is Amazon assigns more stock that vests the following years to make up for the gap. This means you'd have to stay longer to meet your target compensation. The reverse is also true. If your actual compensation surpasses your target because of stock gains, then you are assigned fewer/no additional stock vests for the next few years. The employee loses when the stock does well and when the stock does poorly.\n- Layoffs were coming. The volume of posts about layoffs occurring later this year dramatically increased across Blind, internal Slack, r/amazonemployees, various Discords, etc. Morale was already bad since we did two layoffs prior to 2025.\n- My work was getting stale.\n- I felt there was no path to senior for me in the next four years.\n- I distrust my org's leadership.\n- I'm in Seattle for Amazon and I've accepted it's not my city. I'd like to move to New York City or San Francisco.\n\nMost of the jobs I applied to came from LinkedIn, but I applied manually through the employer's website. I targeted midlevel engineering roles if they were available, otherwise, I applied for senior. Towards the tail end of my job search, I used a browser extension called Simplify to autofill applications. I highly recommend this since you can also use it to keep track of your applications, scrum board style. I spread out my applications so that I would have interviews for the two following weeks.\n\nTo prepare for my interviews, I bought a year of Leetcode premium and a lifetime subscription to HelloInterview premium. I also joined a Slack server targeted towards engineering leadership career development and participated in mock interviews there. My friends generously offered their time to mock interview me as well. These were great because they gave me very candid feedback. I also searched through Glassdoor for other peoples' interview experiences to get an idea of what to expect for companies I was highly interested in. My weakest round is probably the coding round; I completed 160 Leetcode during this interview cycle and felt that was sufficient. I should note that I would've practiced more Leetcode if I were interviewing with large tech companies like Google or Microsoft, but I didn't hear back from them. I also had never done a system design interview before this job application cycle, so I studied that hard. I read every HelloInterview system design article and felt I overprepared.\n\nManaging emotions around rejection was pretty difficult, I'm thankful I have good friends I could talk to. I got rejected from my top 3 target companies and I bedrotted for weeks beating myself up over it. If I were to have done anything different, I would've front-loaded my interviews with companies I cared less about. I felt much more comfortable in my later interviews. I also would've spaced out my interviews more. It was difficult balancing them and a full-time job. I tried to do early morning interviews (I even had two 2AM ones!), but found that my performance really suffered in the morning. I'd block out time in the afternoon instead to do interviews and pray no one at work wanted to schedule over them. I'd often work after hours to catch up on work I'd neglected during the day.\n\nI ended this interview cycle with 5 offers: 2 senior and 3 mid-level. Two of these offers were at late stage SF-based AI startups (not any of the big names). I accepted one of these. I don't want to reveal exact numbers, but I'll say that my base comp exceeds my total comp at Amazon, and I am extremely happy with it.",
      "subreddit": "cscareerquestions",
      "score": 341,
      "url": "https://reddit.com/r/cscareerquestions/comments/1or3gyj/my_experience_interviewing_in_2025_with_5_yoe/",
      "comments": [
        {
          "body": "5 offers from 9 onsites is very solid, congrats",
          "score": 227
        },
        {
          "body": "I don’t believe you lol 2AM interviews  , right \n\nThis is an ad for the server or simplify ",
          "score": 98
        },
        {
          "body": "How long did you study LC and System Design before applying? Do you find the Hello Interview subscription to be worth it?",
          "score": 27
        },
        {
          "body": "Applied 73 with 5 offers and you were bed rotting? Those numbers are ridiculously good. Respectfully, gfy.",
          "score": 22
        },
        {
          "body": "If you are concerned about the compensation structure of Amazon, I would recommend Netflix. You get paid in base salary and the compensation should be better than what you are getting at Amazon.",
          "score": 7
        },
        {
          "body": "At amazon rn, also despise my leadership, and also trying to move out of Seattle to SF -- this post is super encouraging. Congrats!!!! You deserve it !",
          "score": 6
        }
      ]
    },
    {
      "title": "Amazon Interview Loop - Interview Prep Techniques",
      "body": "Hey everyone,   \n\n\nI have an amazon interview loop coming for a Level 4  Project Management role, I understand that I need to focus on my STAR storytelling method alongside the 14 LPs.  \n\n\nI have come across 2 online resources which seem to maximise your chance on passing the interview:  \n\n\n* [Day One Careers  -  Amazon Interview Whizz + AI Coach](https://www.dayone.careers/amazon-interview-whizz#pricing1)\n* [PMDiego - Diego Granados -The Product Interview Operating System](https://www.pmdiego.com/the-product-interview-operating-system-get-an-offer#section-1664229227865)  \n\n\nEach one of these would costs around a couple of hundred dollars, for anyone who has been through and/or passed the amazon interview loop, would you recommend investing in any of the above?  \n\n\nAlternatively should I just focus on just having enough detailed stories ?  \n\n\nAny help, tips, guidance, mock interview is truly appreciated.  \n\n\nThank you for reading.",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1ahscqv/amazon_interview_loop_interview_prep_techniques/",
      "comments": [
        {
          "body": "Been through the loop.\n\nI wouldn't pay for anything. There are thousands of completely free resources out there, don't get taken for a ride by somebody looking to make a buck off you.\n\nThe STAR bullshit is the hardest part. Look up some examples of the STAR questions, and then come up with some bullshit stories that make you sound like an absolute rock star. Seriously, just make some shit up. They won't be able to verify any of it (nor will they attempt to.)\n\nI didn't know that going into the loop, so I made the mistake of being honest about my experiences when in reality I should have just made shit up.",
          "score": 6
        },
        {
          "body": "Each interview has 2 lps. Each question is an LP. Try to figure out what they are trying to get at via the question.",
          "score": 2
        },
        {
          "body": "Hi, I am wondering how long does it take for them to schedule your technical interview? I was wondering because I had a phone screen on 6/14/2024 and immediately I got an email from the recruiter that I am moving forward to the next step which is the technical interview and got a link to submit my availability but they haven't scheduled my technical interview yet even to this date and I followed up with the recruiter last week but she hasn't responded yet. Is this normal? does it take a long time for you to schedule the next round of interview (the technical interview)?",
          "score": 1
        },
        {
          "body": "Does anyone know how many rounds do you need to make it through to the loop out of 4. I believe that I messed up the logic and maintainable round but performed well in rest of them solving their questions and answering leadership questions.",
          "score": 1
        },
        {
          "body": "Amazon loops the STAR method and knowing the LPs inside out is the biggest thing. Most of the external coaches will just drill you on stories and polish. Honestly you don't need to drop hundreds unless you really want someone holding you accountable. I ended up using Interview Coder as a cheaper backup, it runs on desktop and gave me nudges during live practice so I didn’t freeze. Paired that with writing out 2 solid examples per LP and it worked fine.",
          "score": 1
        },
        {
          "body": "Had a similar amazon loop last year. They mostly care that your stories are clear n structured, not super fancy. I didnt pay for any course tbh. Just practiced a ton. used interview coder a bit for mock q's n timing, helped me see where i was rambling too much lol.",
          "score": 1
        }
      ]
    },
    {
      "title": "CS Rich Kids vs Poor Kids",
      "body": "In my opinion I feel as if the kids who go to high-end CS universities who are always getting the top internships at FAANG always come from a wealthy background, is there a reason for this? Also if anyone like myself who come from low income, what have you experienced as you interview for your SWE interviews? \n\nI always feel high levels of imposter syndrome due to seeing all these people getting great offers but the common trend I see is they all come from wealthy backgrounds. I work very hard but since my university is not a target school (still top 100) I have never gotten an interview with Facebook, Amazon, etc even though I have many projects, 3 CS internships, 3.6+gpa, doing research. \n\nIs it something special that they are doing, is it I’m just having bad luck? Also any recommendations for dealing with imposter syndrome? I feel as it’s always a constant battle trying to catch up to those who came from a wealthy background. I feel that I always have to work harder than them but for a lower outcome..",
      "subreddit": "cscareerquestions",
      "score": 1274,
      "url": "https://reddit.com/r/cscareerquestions/comments/kg2g24/cs_rich_kids_vs_poor_kids/",
      "comments": [
        {
          "body": "This isn't like some CS exclusive thing. It's the truth in every field. People who start off with more start off with a head start",
          "score": 2193
        },
        {
          "body": "Speaking as someone who definitely is privileged, I had a number of advantages. My father programs as part of his work, so I was exposed to it early. I owned computers from an early age and could play around with them at my leisure. My parents were always willing to buy me books on programming or electronic parts. I never had to work a job during school, so I had time to learn.\n\nMore egregiously, my first internship was through family connections. The first internship is the hardest to get, so that helped a lot. That internship was unpaid, again something I couldn't have done without their support. They also encouraged me to take a gap year, which was when I did my first two internships.\n\nMy parents also taught me, whether intentionally or not, various skills that are extremely useful in the professional world. They taught me to be comfortable with writing professional emails. I'm not afraid of sending an email to anybody. They've demonstrated how to negotiate, how to avoid revealing too much. They've encouraged ambition. I don't feel any class differences between my coworkers/bosses and me. Likely interviews go smoother for me simply because I'm speaking the same social-cultural language as my interviewer.\n\nIt's incredibly tempting while writing this comment to write some caveat like \"but I worked really hard for it!\". And yeah, I suppose I did. I have classmates with similar privileges who aren't as successful as me. Yet that's kind of bullshit. I could have worked as hard or harder, but were it not for my background, I'm not sure I would have succeeded.\n\nSo yes, rich kids do have better luck. It's not your imagination.",
          "score": 651
        },
        {
          "body": "When I was in high school I transferred to a private school. My classmates’ parents were doctors and lawyers while mine worked in a restaurant and owned a small hair salon. I was the only student paying my own tuition. I think I’d bought into this idea that if I worked hard, I’d do better than the lazy rich kid trope, but instead I learned that my new peers worked just as hard as I did, if not harder, and had had the good education for ten years already. I was pretty below average at my new school. \n\nI ended up barely sliding into my dream school (accepted off the waitlist in June) and got into a grad school at a top university (CMU) in a department that wasn’t really related to CS, but I was kind of able to spin that by taking like two CS classes. \n\nI then applied to 300 jobs, got one onsite, which was an offer making 100k or so in SF, then after a year and a half, was laid off due to COVID. I got hired at my current job making double my first job, and I really love the company I’m at! I think it was mostly luck.",
          "score": 108
        },
        {
          "body": "[deleted]",
          "score": 508
        },
        {
          "body": "Do your best. You can’t do any better than that.",
          "score": 330
        },
        {
          "body": "1. forget faang — focus on trying to find a job you enjoy, half of the people in faang complain about it; if you have a well paying job with a culture you like, you've got something most of faang would want anyways\n2. top 10 cs schools → interviews with faang; why? it's kinda obvious, but faang gets countless applications, and the sad reality is its easier for them to do an initial culling of the crowd by university (then followed by metrics that actually matter). While countless great engineers don't go to a top tier school, there's a higher statistical liklihood of finding them at a top tier school, and so companies don't give 3 shits.\n3. if you *really* wanna work at faang (again, see 1, and think about why it is you want to work there, and why some other company won't do the same), note that it's ALL about networking. So make friends with people in faang. Get mentors. Ask them where you can improve ; while interviewers/ recruiters are useless for feedback, normal people love giving advice, and learn from them (and get their referrals) to try to get into FAANG.",
          "score": 29
        }
      ]
    },
    {
      "title": "What is going on in this job market???",
      "body": "Currently working as senior software engineer at a no-name non-tech medium sized company. After much leetcoding I was able to jump ship to a much more favorable company. As part of my exit I recommended HR to post a Jr Software Engineer position to careers portal to fill easier part of my day to day tasks. I specifically told HR expect zero to no applicants, as I thought the market is hot - everyone should be applying to FAANGMULASS. Less than a week later I was told there is 200+ applicants plus dozen more on LinkedIn.\n\nOriginally I was hoping to do meaningful non-leetcode interview rounds with lot of behavior introspection. Now it's impossible to filter the pool with just 2 Software Engineers, so most likely we have to go through automated HackerRank style leetcode Online Assessments.\n\nJust want to share the craziness of the current job market. Huge condolences to all the new grads out there this year.\n\nEDIT: I thought the market is hot because accordingly to TeamBlind everyone is getting 400k+ TC offers with FAANGMULASS. I guess not.\n\nEDIT: Facebook Amazon Apple Netflix Google Microsoft Uber Lyft Airbnb Stripe Square\n\nEDIT: After screening 30 or something resumes I found some dude interned at Google two years ago applying to be at this no name company. Wow",
      "subreddit": "cscareerquestions",
      "score": 1176,
      "url": "https://reddit.com/r/cscareerquestions/comments/j6t7ge/what_is_going_on_in_this_job_market/",
      "comments": [
        {
          "body": "I think this has been the norm for entry level positions for a long time now.",
          "score": 1121
        },
        {
          "body": "What made you think entry level positions would get no applicants lol",
          "score": 657
        },
        {
          "body": "You expected almost no applications to a Jr SWE position? Are you living under a rock dude? We're down like 20 million jobs in the USA and desperate senior/mid level engineers are coming in and taking roles they're over qualified for for less pay.\n\nThis shit was bad BEFORE the pandemic, I would almost never see a posting that had less than 50 applicants. I can only imagine it's significantly worse now.",
          "score": 273
        },
        {
          "body": "&gt;I specifically told HR expect zero to no applicants, as I thought the market is hot\n\nImagine being so out of touch",
          "score": 419
        },
        {
          "body": "What’s FAANGMULASS, or rather MULASS? first time I hear it. I’m guessing Microsoft, Uber, Lyft, Airbnb, Slack and Stripe ? personally I’d leave it at FAANGM, not to keep adding letters.",
          "score": 212
        },
        {
          "body": "Almost 2 years out of college, no job. Idk what to do, I don’t even code anymore. I lost all motivation because of all these emails “ Thank you for applying to our XYZ position, unfortunately....”. I wasted 4 years.",
          "score": 69
        }
      ]
    },
    {
      "title": "Is working at AWS really as bad as everyone says it is? Should I take an offer there anyway if only to use it as a stepping stone?",
      "body": "I'm in the final interview stage with Amazon for a SDE1 fresh grad position and (not to sound too overconfident) I have alot of professional experience for a fresh graduate so I'm confident I can pass the interview and hopefully get the offer. \n\n\nI have other offers that are quite good but they are at very small companies that don't have the name recognition Amazon does. I feel that having Amazon SDE on my resume would be a huge boon for my employability but there are some actual horror stories I've heard coming out of AWS, especially from fresh grads. \n\nDoes anyone here work there or have any advice on how to proceed? Is the work environment there as sweatshoppy as people say? If it is horrible is it worth it to just suck it up for a year and do it anyway for the resume line?\n\n\nEDIT:\n Thanks for the tons of responses guys. Can't respond to everyone but I've read almost all the comments. Great advice all around",
      "subreddit": "cscareerquestions",
      "score": 938,
      "url": "https://reddit.com/r/cscareerquestions/comments/oyouql/is_working_at_aws_really_as_bad_as_everyone_says/",
      "comments": [
        {
          "body": "Think about it as two more years of the most valuable education you'll ever get, but now you're being paid instead of paying. Two years at AWS opens more doors than any university program on earth.",
          "score": 199
        },
        {
          "body": "Like a lot of people have said, it largely depends on your team and your manager. I've heard horror stories of bad managers. I have personally gone through a lot of team churn, but that's pretty normal for Amazon. That being said, I've also heard of a lot of people with decent WLB.\n\nHaving the name on your resume is huge (which is why I'm still here) but a lot of people find that it isn't their cup of tea. Good pay relative to other companies (not other FAANG), but definitely some of the worst golden handcuffs",
          "score": 247
        },
        {
          "body": "My worst days at Google are better than my best days at Amazon.\n\nBut I wouldn't have my best days at Google if it weren't for my worst days at Amazon.\n\nSo unless you can get another FANG-like offer, take it as a stepping stone and move on after a year or two.",
          "score": 546
        },
        {
          "body": "There's an old saying, where there's smoke, there's fire.  There are lots of smoke around Amazon working conditions.\n\nSome may be exaggerated online hyperbole. But, the sheer number of complaints are far greater than any other tech companies, of similar size.",
          "score": 810
        },
        {
          "body": "Just left Amazon after 4 years. Run. The pay and name recognition isn't worth the stress. You will be judged against your peers on things like number of commits, lines added, and lines removed, among other things. If you're on a team with a large legacy code base, you're fucked from the start. On call can easily become overwhelming. There were times where it wasn't out of the ordinary to work 60-80+ hr while on call.\n\nThe biggest thing though is you will not code as much as any other dev role anywhere else. At Amazon your expected to be full stack+. From my experience, you don't have dev ops, QA, UI/UX developers, front end, back end, scrum masters, etc, and are expected to do all of those roles and more. The documentation culture is shit, and you'll spend weeks writing a \"6 pagers\" design doc to satisfy management instead of actually writing code. \n\nWhen you finally do get around to writing code, you'll quickly become blocked by an Amazon wide mandate to upgrade dependencies because Amazon has the worst fucking case of \"not built here\". Amazon internal is a clusterfuck of broken equivalents to industry standards, that will eventually become out of date because Amazon will not actually support that team, which will lead to Amazon building a new industry equivalent that still sucks and is worse in pretty much every way. You don't have slack, you've got \"chime\", you don't have Jira you've got \"SIM\", you don't have a functioning CD/CI workflow with actual autoscaling, you've got Pipelines with Apollo where you have to order more EC2 hosts from fleet management.\n\nI was put on a PIP less than 12 hours after I announced I was leaving, and told that I would never be able to work at Amazon again. It's not a company that you should work for, or even really support.",
          "score": 1370
        }
      ]
    },
    {
      "title": "21M, CS + Data Science major unable to find full-time job, even in the NYC metro area. Am I doomed?",
      "body": "So I'm soon to become one of those \"unemployed CS majors\" everyone keeps talking about once I graduate. I've been struggling to find meaningful employment, and don't have a job lined up. The way things are currently heading, after graduation I'm likely just heading back to my mom's house and maybe working some shitty retail job with 0 upward mobility. This is a future some people (including some friends) from my high school have achieved without attending college, and if that's my future, it means my mom will have wasted 4 years on an expensive degree that ended up being worthless.\n\nI'm well aware that it only gets harder and harder to find a full-time job the longer you wait after graduating. Which is why I'm frightened of being jobless or underemployed once that happens, and then having an awkward gap in my resume to have to explain, which only gets more and more awkward the longer I wait.\n\nThe roles I've been applying to include SWE, data analysis, data engineer, and data science. While my undergraduate internship grinds have been very hit-or-miss, I have some \"roundabout\" experience (multiple unpaid internships + paid research) on my resume, some of it ongoing (and my performance there has been satisfactory), which I've been told is enough to land me interviews, which I have. It's just that I've been struggling to pass these interviews. I've known people who've managed to hand-wave themselves in through interviews just by talking a bit, but I've somehow failed even one of those when given one (though that was partially my fault since my reference waved me through without even giving me the JD).\n\nMy clear metric for \"success\" is having enough money to *be able to* move away from home and afford a non-shitty apartment if I wanted to (and in the event I don't, it'll be because the job is in my metro area, aka NYC). If I don't achieve this, I'll have failed. I wouldn't say I'm asking for much, and I feel like this is a quite reasonably low bar to clear, and if I don't clear it, I'm a failure.\n\nNow that it's Christmas already and I still don't have any kind of post-college offer in hand, things are not looking up. I've barely applied to any positions between Thanksgiving and Christmas and have secured 0 new interviews therein. I barely even grind Leetcode anymore, since it just makes me disappointed whenever I fail questions that are supposedly \"Easy\" or \"Medium\". If you gave me a Leetcode-style interview or OA right now, I'd probably fail it. I've yet to actually receive such an *interview* (OAs I have, with mixed performance), but I'm well aware that many companies do ask them. A lot of what I've failed so far is behavioral, though I've passed a few.\n\nI've received mixed messaging on whether to consider grad school. My parents aren't going to pay for it and I'll have to take out expensive loans if I do go for it. And I know cheap online programs like OMSCS exist, but I don't know if they're right or if it'll be too challenging, and I'm not even sure if it's something I'm seriously invested in either. The whole field just seems like a sinking ship with AI and all, and people seem to be right about there being no need to hire any more juniors.\n\nI just want to know what to do, because things seem absolutely grim, and people who've been through 2008 keep calling me entitled and telling me that the job market now isn't nearly as bad as 2008. Keep doing what I'm doing and hope something lands? But if nothing lands, what then? Certmaxx and pivot to IT? Push boxes in some Amazon warehouse alongside people without college degrees, rendering the degree worthless?",
      "subreddit": "cscareerquestions",
      "score": 102,
      "url": "https://reddit.com/r/cscareerquestions/comments/1puwtmr/21m_cs_data_science_major_unable_to_find_fulltime/",
      "comments": [
        {
          "body": "&gt; I barely even grind Leetcode anymore, since it just makes me disappointed whenever I fail questions that are supposedly \"Easy\" or \"Medium\". If you gave me a Leetcode-style interview or OA right now, I'd probably fail it.\n\nI mean sounds like you know exactly what you’d have to do to turn things around but are hoping that we’d offer u a secret solution that doesn’t involve that. \n\nSorry but there’s no such magic wand and more importantly no one’s coming to save you. \n\nTo put it bluntly, put in the hours now or stay cooked, you owe it to your future-self, good luck.",
          "score": 159
        },
        {
          "body": "I had to take a gas station job near me for 5 months before I finally got my first job. I was jobless out of college for 9-10 months before I got my first position out of college. No shame in getting money in your pocket, even if it is not utilizing your degree. You gotta do what you gotta do. But during that time, you have to be diligent with sending out applications and staying up to date with projects and leetcode.",
          "score": 97
        },
        {
          "body": "If you're not applying to jobs on the grounds of past results being demoralizing, then yeah, you kinda got what was coming for you. You land zero shots if you don't take any. So get back to applying, at the very least.\n\nSecond, your view seems both overly reductionist and lacking focus. Lacking focus in the sense that \"SWE, data analysis, data engineer, and data science\" are all \\*very\\* different types of roles. SWE alone is an enormously broad field, and employers want people who can progressively become subject matter experts in some narrow-ish complex area, not someone who's just superficially mehhh about everything. So figure out what that area is for you, your internships/research should hopefully be a nudge in some direction, at a minimum.\n\nBy reductionist, I mean that life isn't just a boolean choice between CS or working at Walmart. Software took over the world \\*because\\* it integrates deeply with just about every industry you can think of, and all of the ones you can't. This ties back to the comment about broadness, there's a lot of software in a lot of places that you wouldn't think to look. This means there are paths into it that relate to seemingly non-software related aspects of your life (hobbies, your uncle's business, whatever) or are seemingly serendipitous. You may need to exercise some creativity to identify these kinds of opportunities, beyond just the standard job application grind.",
          "score": 22
        },
        {
          "body": "I only took a quick scan, 2 problems with your post\n  \n&gt;21M, CS + Data Science major unable to find full-time job, even in the NYC metro area. Am I doomed?\n  \n\"even in the NYC metro area\"? NYC metro area is like the 2nd most competitive place in the entire USA to get jobs (pretty much just behind SF Bay Area/Silicon Valley in terms of competitiveness), if you being unable to secure a job in NYC region as a fresh grad means you'll consider yourself a failure, bad news for you: be mentally prepared that you will be a failure, in NYC region you're not competing against people with 0 YoE 0 internships, you're competing against 5+ YoE ex-big techs\n  \n&gt;I have some \"roundabout\" experience (multiple unpaid internships + paid research) on my resume, some of it ongoing (and my performance there has been satisfactory), which I've been told is enough to land me interviews, which I have. It's just that I've been struggling to pass these interviews.\n  \nthis is slightly different problem, you're being given chances, but you kept throwing them away, don't know what kind of answer are you expecting besides... just... don't fail those interviews? and do whatever you need to do to actually pass them?",
          "score": 46
        },
        {
          "body": "I’m not sure what you want people to say. You talk about these success metrics but have stopped leetcoding and grinding it out. What happens if a bunch of companies want to interview you and yoy fail them all because of some easy and medium questions. You just need to learn the patterns and over time easier and mediums are very very doable. I have a few friends who didn’t get an offer until a full year after graduation and kept grinding while working a normal job and got good offers.",
          "score": 16
        },
        {
          "body": "Sounds like you have a lack of drive, have trouble embracing failure, and employers are picking up on it. \n\nIf you don't study in your free time, and are not open to trying new things, you will be cannon fodder, even if you have 10 YoE.\n\nUnless there is a specific need/niche, a masters is a waste of time. A new grad in the right job, will be running circles around you, in their sleep, by the time you finish your Masters. Furthermore, the lack of drive, and related, will still be apparent in interviews, and you will get rejected.",
          "score": 35
        },
        {
          "body": "Don't do a masters.\n\n\\&gt; I've barely applied to any positions between Thanksgiving and Christmas and have secured 0 new interviews therein. I barely even grind Leetcode anymore, since it just makes me disappointed whenever I fail questions that are supposedly \"Easy\" or \"Medium\". If you gave me a Leetcode-style interview or OA right now, I'd probably fail it. I've yet to actually receive such an *interview* (OAs I have, with mixed performance), but I'm well aware that many companies do ask them. A lot of what I've failed so far is behavioral, though I've passed a few.\n\nI think you know what the answer is here: go and grind how to pass both leetcode and behavioural interview prep asap before you've been unemployed for an extended period of time.\n\nOtherwise you can continue wallowing in your own misery and end up pivoting to IT or pushing boxes at amazon.",
          "score": 9
        },
        {
          "body": "You need to get some kind of job just to have money coming in and to get your mind off the situation. Working in an Amazon warehouse isn't ideal but it is better than just staying in your room all day starting at a screen. You need to keep applying and deal with the rejection, there is no other way.",
          "score": 9
        },
        {
          "body": "Would you be interested in working in the DMV area? There are many contracting companies in need of entry level software engineers. If you have a clean background you can aim to get a clearance. Get your foot in the door and get a Top Secret.",
          "score": 8
        }
      ]
    },
    {
      "title": "I think I just took a fucking iq test",
      "body": "So I'm interviewing with this company. It's not like, a faang or a huge household name company or anything like that, it's a regular degular company. Who's glassdoor reviews seem to be kind of shite if you look past the ones that just give them 5 stars. First of all this interview process has been incredibly long. 1. Initial phone call 2. 2 hour hackerrank 3. In person with the engineering manager. 4. In person technical with programmers 5. A FUCKING COGNITIVE TEST. If I hadn't been studying for the gre a couple months ago I would have been caught with my pants completely down. Honestly this is absurd. Do they think they're NASA? does a place like NASA even have people go through a process like this? And I'm pretty sure there are more interviews after this one. If I was still unemployed I would be at the mercy of this company's whims. What makes companies feel like they can get away with shit like this? This has left an awful taste in my mouth. I mean, I'm used to some really big name places having kind of a long procedure and various different stages. Amazon, tesla, citibank. But this is like... This is crazy to me.",
      "subreddit": "cscareerquestions",
      "score": 1109,
      "url": "https://reddit.com/r/cscareerquestions/comments/m5wzzl/i_think_i_just_took_a_fucking_iq_test/",
      "comments": [
        {
          "body": "&gt; does a place like NASA even have people go through a process like this?\n\nAs someone who worked for NASA five years ago the interview was the chillest I've ever done. We just shot shit for thirty minutes and then they asked me when I can start.",
          "score": 693
        },
        {
          "body": "NASA doesn’t do that.",
          "score": 470
        },
        {
          "body": "I've been a dev for nearly 3 years at my latest company and I've learned a ton.  But stories such as yours still make me dread trying to interview for another dev job somewhere else.  \n\nMy day to day work is very different than interview challenges.  I validate requirements with stakeholders, read documentation, do code reviews and yes, I also write code- but I have days to write good quality solutions.  I don't have to solve a complex problem with some specific algorithm that I know by heart in 10 to 15 minutes.  These pressure-cooker leet code interviews are nothing like the day to day work of a dev.",
          "score": 139
        },
        {
          "body": "When I applied to IBM, they made me take their IPAT test.\n\nIt consisted of stuff like, \"Complete this number series,\" and 8th grade algebra questions like:\n\n&gt; Janet is at the local pub drinking a White Russian. This cocktail is usually made of coffee liqueur (40 to 50 percent), cream (10 to 25 percent), and vodka. Vodka contains 40% alcohol, and coffee liqueur contains 10% alcohol. If the whole drink equals 200ml, how much alcohol does Janet consume by drinking it (in ml)?\n\nWith a multiple choice answer.\n\nDidn't pass. Oh well.",
          "score": 490
        },
        {
          "body": "&gt; I mean, I'm used to some really big name places having kind of a long procedure and various different stages. Amazon, tesla, citibank. But this is like... This is crazy to me.\n\nYeah, this is nothing new.  Every company wants to subject candidates to endless assessment so they can claim they hire \"top talent\".  But very few of them actually make it worth it for one to pass these assessments and work there.\n\nThere's no point to entertain the processes of these companies when they're just a ver-batim copy of FAANG interviews.  If I'm being subjected to that, why not go interview at a real FAANG and get the salary that goes along with it?\n\nI went through this exact same scenario almost 4 years ago now where Company A asked a bunch of Leetcode Medium algorithmic questions, I passed the interview and their TC was $95k.  A few weeks later I interviewed at Amazon and passed their interview and was offered TC of $155k.\n\nThese podunk software shops have no business conducting interviews this way.",
          "score": 195
        }
      ]
    },
    {
      "title": "Landing a job has nothing to do with technical skills",
      "body": "Piggybacking off [the discussion in this post](https://reddit.com/r/cscareerquestions/comments/xxg9ag/now_i_understand_why_it_took_me_so_long_to_land/) to give some advice to those frustrated with landing an internship or full time interview. \n\n___\n\nFirst, a bit of background:\n\n1.\tWent to a medium sized university with a mediocre CS program\n2.\tLanded an internship at a large non-software company in their IT department from going to a career fair\n3.\tUpon graduating, had an offer from Amazon for SWE and an offer from the company I interned at, among others not worth mentioning\n4.\tTook the cushiony non-software company position and couldn’t be happier. Years later, I’m very involved in our college recruiting process. \n\n\nBased off the above, I would like to think that I’ve figured out the important pieces to landing an interview relatively well. The biggest advice I can give is as follows:\n\n\n**Landing an Interview**\n\nAs pointed out in the aforementioned post, most job openings have hundreds of applicants, of which only a handful get interviewed. Usually those in the handful have referrals. A referral does *not* necessarily mean your friend or family member works at the company. The most common referral, in my experience, is one where a recruiter got a positive impression of a candidate and passed their resume along with a positive note. \n\n-\tGo to career fairs, events, clubs, etc. Even if you hate meeting new people, find a way to get yourself out there. Quantify it, gamify it, whatever you need. \n-\tAt career fairs, have copies of your resume to hand out, and use the resources on this sub and elsewhere to make your resume stand out. \n-\tI feel like I shouldn’t have to say this, but PLEASE, take a shower and put on a business casual outfit for any networking. It’s astonishing how many unpresentable people we see at career fairs. If you can’t put in the effort to present yourself, we damn well won’t be hiring you. \n-\tSmile, make eye contact, stand up straight, speak with confidence. Many take these things for granted as they come naturally, but for those that they don’t, practice these things. \n-\tFollow up! If you met a recruiter, gave them your resume, and had a quick convo, reach out to them on LinkedIn! It puts your name in their head again, and shows your interest in the position. \n\nWhile most of these may seem obvious, the overarching theme is this: landing the interview has almost nothing to do with your resume, and everything to do with networking. I hate that it’s true, but I would rather hire a personable, outgoing, mid-tier student than a technical genius who can’t communicate. \n\n\n**Passing the Interview**\n\nOnce you’ve got the interview, you’ve already beat 90-95% of applicants (pulled that number out of my ass but still), so go into it with *confidence.*\n\n-\tIf you’re remote, have your resume open. When answering questions you can refer to your experience directly on your resume, asking the interviewer to do the same. “If you have my resume handy, position X mentions Y. In that role…” This is huge, you’re painting a picture of yourself and your experience, help us use the tools available to paint that picture. \n-\tSmile, make eye contact, stand up straight, laugh if they make a joke, share an anecdote where appropriate, etc. Most companies are hiring for culture fit, so rather than getting bogged down by the details, show that you’re someone they would enjoy working with. \n-\tFor technical interviews: vocalizing your thought process is #1, so practice this. Also, if you don’t know an answer, share how you would find it. In my Amazon technical interview I didn’t get a working solution at all, and literally said “if I was solving this for work rather than for an interview I would google ‘&lt;exact query&gt;’.” I “failed” the technical interview, but still got a handsome swe offer because of the other things. \n-\tShow that you have a passion for tech. If you aren’t passionate about it and just want a paycheck, *pretend.* \n\n\nHopefully this helps, and I will be glad to answer any questions! At the end of the day, there are countless applicants, many with great resumes, and many with awful resumes - the main thing that will set you apart is everything that isn’t on your resume. Hell, the #1 candidate I’m looking at right now has 0 relevant experience, but he was the most enjoyable to talk to, showed a passion for problem solving and tech, and showed he’s eager to learn. It’s the intangibles that count!\n\n\nEdit: \nI definitely should’ve worded my title differently - it’s not so much that you can be a great person with no technical expertise and land a SWE role. It is more so that the technical skills you build are your foundation, but that is the same foundation every other grad is building. The tips above are things that allow you to differentiate yourself from all the other qualified resumes in the stack. \n\nAlso should’ve mentioned in experience that I interviewed with multiple FANG companies and countless tech-adjacent/non-tech companies during my undergrad. The Amazon role and my current role (which includes recruiting) were just most relevant anecdotally.\n\nFinally, this is just my advice from my experiences - by no means do I think this is all encompassing, but I hope it helps a student or two land a job!",
      "subreddit": "cscareerquestions",
      "score": 1557,
      "url": "https://reddit.com/r/cscareerquestions/comments/xy0kfl/landing_a_job_has_nothing_to_do_with_technical/",
      "comments": [
        {
          "body": "Honestly this isn’t too far off. \n\nThe only caveat is that there is a hard floor to the technical ability. Programming is still a part of it, and if you can’t do what’s expected, you won’t get anywhere applying to SWE positions. \n\nBut once you meet basic competency for the job (which depends on the job) the focus quickly shifts to “can I stand to be in a room with this guy 8-10 hours a day” and “can I trust my customers to this person”.",
          "score": 683
        },
        {
          "body": "Excellent advice: I would supplement with my biggest advice: think about your identity and your past and **prepare stories about yourself**. \n\nStories show that you self-reflect and learn from experiences. And when you get that stupid, \"Tell me about a time when...\" question that you don't have a direct anecdote for, you're not just speechless. It's totally okay to say, \"Well, I haven't experienced that exact scenario, but that is similar to...\" Tell one of your related stories, and at some point, make it clear why you think it's similar. The primary purpose of those questions it to get a feel for how you think and that you can learn from your experiences; the actual content is not that important as long as it's not just a stupid answer.\n\nEdit: I should add, your stories don't have to just be related to CS experiences. If you have ever worked any other jobs, prepare stories about what you learned there, stories about school, really anything. \"Tell me about a time when you had a conflict with a coworker\" could apply to any job you've held, some school group project, maybe even a sibling or friend if you pitch it right, etc. Again, the purpose of the question is to get how you think in general.",
          "score": 237
        },
        {
          "body": "Saying it has *nothing to do with technical skills* definitely isn't true.  If you're the most charismatic, wonderful candidate and can't solve a problem to save your life, you will not get hired.\n\nHowever, there are a ton of great tips here and really good advice in general.\n\nThe better way to look at this is most hiring managers would rather hire someone that's technically decent and works extremely with the team, and is extremely personable (all the things you describe) than someone who is technically excellent and can't work with others to save their lives.",
          "score": 171
        },
        {
          "body": "As someone who has failed countless technical interviews (and have been told to come back with more prep), I would push back on this title a ~~bit~~ lot, lol.",
          "score": 29
        },
        {
          "body": "[deleted]",
          "score": 99
        },
        {
          "body": "Um.\n\n&amp;#x200B;\n\nSo which part here is actually about landing a job? Basically what I got from here is:\n\n&amp;#x200B;\n\n1. Shower\n2. Be presentable\n3. Smile and Laugh\n4. Communicate well\n5. Network\n\n&amp;#x200B;\n\nAs someone who conducts interviews - These are nowhere near sufficient. Necessary, yes - but these are *basic* requirements to land any job post-graduation in any degree program. You need to have enough technical acumen appropriate for the role as displayed on your resume, *and I will also ask you those questions* \\- even at the entry level.\n\n&amp;#x200B;\n\nFurthermore - you're kind of just forwarding this stereotype that SWEs don't know how to shower or dress themselves by pointing these obvious things out. I've never in my career encountered any issues or problems here.",
          "score": 75
        }
      ]
    },
    {
      "title": "Gave Amazon Interview (India). Haven't heard back in 2 weeks.",
      "body": "I interviewed for a content related role at a Amazon early November, and had an interview exactly two weeks ago. The interview went well, the interviewers were smiling, I feel like I gave the right answers. \n\nThis Wednesday, I sent a polite WhatsApp message asking if a decision had been made. He saw it and did not reply, his read receipts are off. It has now been a full two weeks with no update at all.\n\nI am getting worried because I really needed this break and I am trying to move my career forward. \n\nAll my friends are doing their MBA or LLB and I feel stuck after a bad academic year. I am trying hard to get a job before applying for MBA programs because I want solid experience. My family is not very supportive of this plan either so I am stressed from all sides.\n\nIs this level of silence normal? Should I assume it is a rejection? Should I message again or just move on and keep applying. I genuinely do not know what is considered normal in hiring anymore.\n\nAny advice would help a lot.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1pf3ab9/gave_amazon_interview_india_havent_heard_back_in/",
      "comments": []
    },
    {
      "title": "Today, I cross the Rubicon",
      "body": "I (45M) have been unemployed since July. I am in IT and live in SF. I have a home, a wife, a daughter, two step-daughters, a step-grandson, a cat, a dog, two guinea pigs, a lizard, a bat, a hat, and something stuck in the roof crawl-space. Oh, and and ailing parent whose rent is 4k a month. \n\nAnyhow, I've maxed my cards, taken an 800 credit score so low it would win in a strip club, sold what I can, and, through the graces of God, other God, Woman God, God's Plural, and Dragon Gods have somehow made it to round four of interviews--the stated final round.\n\nThe job would (theoretically) put me back to where we left off when we committed to all of this pre-pandemic. It would at least keep us housed and moms off the street.\n\nI don't know what the point of this post is other than, if any of you have some karma to spare, I need it today. I promise to update and share what I have left in return.\n\n*whoo-sah* and best of luck to you all.\n\nEDIT 1: The responses have filled me with so much pride and joy to be a part of this community, even when I troll. When people say, \"Mrg, the internet is a hell hole, mar Mar mar,\" or whatever, I'll point those dry ass people here. Humans have humans back. Everything else is a construct \n\nUPDATE: Had the interview. 45 mins. Longest one yet. I feel like I whiffed on a few questions. He's an engineer, and I am not. I also feel like we are connected as humans. The interview went over schedule by 30 mins. I ran out of questions to ask, other than \"You need a back rub, my dude?\" And so called a stop to the interview, which I know is a no-no but in my mind, wasting the time of someone on the clock is a bigger no-no.\n\nFUCK!!! I HAVE NO IDEA WHAT THE FUCK IS ABOUT TO HAPPEN.\n\nI need need need this.\n\nUPDATE 2: it could be a week before I know what happens next, but two things happened today:\n\n1) I did my best\n\n2) A huncka chunka strangers came out of nowhere with 100%  love and positivity (read the comments), thus reminding  me that there's hope no matter what. I fucking love all of you.\n\nUPDATE 3: I was gonna wait for a happy ending to drop this on you but eff it, I wrote a book (an epic really) that doesn't suck (entirely). So have a crack at it if you're into sci-fi/cyberpunk. Just protect my reviews. It's damn near all I have left.\n\nhttps://www.amazon.com/Burning-World-1-Berkley-Hinton/dp/1098339509?ref=d6k_applink_bb_dls&amp;dplnkId=83fee8fd-a9a0-4863-994f-71cd717a512d\n\nAlso, the paperback is $12.00 on EBay, which is half the Amazon price.",
      "subreddit": "jobs",
      "score": 1694,
      "url": "https://reddit.com/r/jobs/comments/18gn3la/today_i_cross_the_rubicon/",
      "comments": [
        {
          "body": "You already have the job.  \n  \nGo to the last interview like it was your first day and start asking questions and suggesting ways you will solve problems.  Tell them you are eager to get to work. \n  \nGL",
          "score": 441
        },
        {
          "body": "This job is yours to win. Pay attention to the nuances, it’s not about your skill set at this point. You got this!",
          "score": 55
        },
        {
          "body": "Don’t forget the close! “Is there anything standing in the way of being chosen for this position?” \n\nGood luck, Op!",
          "score": 125
        },
        {
          "body": "You got this op. That thing in your crawl space can’t handle being homeless",
          "score": 42
        }
      ]
    },
    {
      "title": "I interviewed with Amazon for a Senior FedRamp Compliance Analyst Role went through 6 interviews and wasn’t selected. I guess there was too much competition. Can’t let it defeat me !",
      "body": "I was a little discouraged but I know that others have been rejected by Amazon as well so good luck to all in your future endeavors ",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/1lvnowx/i_interviewed_with_amazon_for_a_senior_fedramp/",
      "comments": [
        {
          "body": "Blessing in disguise",
          "score": 2
        },
        {
          "body": "Not allowing this to be a reason to feel defeated: BEST reaction. Well done OP",
          "score": 1
        },
        {
          "body": "6 interviews? YIKES!",
          "score": 1
        },
        {
          "body": "That sucks. But as someone that took 11 months to get a job, it impresses me that you can get that far in a process because I would bail like after the 3rd one.",
          "score": 1
        },
        {
          "body": "I just got contacted for this exactly job and role title. Wtf, 6 interviews? I think I'm gonna reject before an interview with this. They gave an option between Arlington VA and Seattle. I probably have way less exp than you and zero project management skills",
          "score": 1
        }
      ]
    },
    {
      "title": "Role as Planner with Amazon. No interview?",
      "body": "A recruiter reached out to me on Linkedin. He's from India, so I'm already skeptical of a scam. But I know Amazon employs alot of workers in India...\n\nHe says there is no interview for the role. Just an \"excel test\" and if I pass I will then be offered the position immedeately. Is this normal for Amazon?\n\nHe sent me the link to the test. Do I even click on it?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1m5uhy1/role_as_planner_with_amazon_no_interview/",
      "comments": [
        {
          "body": "It’s a scam. This is not how interviews happen.",
          "score": 3
        },
        {
          "body": "fuel aware cautious person beneficial historical water kiss deserve march\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 2
        },
        {
          "body": "SCAM",
          "score": 2
        },
        {
          "body": "Red flag. Scenario like this is why I quit LinkedIn because I got similar random recruiters coming at me at least once a week with sketchy vibes.",
          "score": 1
        }
      ]
    },
    {
      "title": "Looking for Tips: Amazon SDE Virtual Interview (3 Round in 1 Day)",
      "body": "Hey everyone,\n\nI just received an invite for the final virtual interview round for the Amazon SDE (Software Development Engineer) role. It’ll be 3 back-to-back technical interviews in one day, each about an hour long.\n\nAccording to the email, the interviews will cover design, data structures, algorithms, and basic coding. I’ve completed the online assessment, and this is the final step.\n\nI’d love to get any tips, strategies, or what to expect:\n\n1. What type of questions are typically asked in each round?\n\n2. How deep should I go into system design (since it's an SDE role, not SDE II)?\n\n3. Any must-review topics or red flags to avoid?\n\n4. Ideal length and structure of an answer.\n\nThanks in advance for the help. Would really appreciate insights from anyone who's been through it recently.  ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1lqvwwh/looking_for_tips_amazon_sde_virtual_interview_3/",
      "comments": [
        {
          "body": "Try posting in r/amazonemployees",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview process for Amazon, microsoft and other MNCs which are in India",
      "body": "Can anyone from India tell me what types of questions does IT MNCs ask during interviews, I'm a Masters student and I'm a fresher...want to work with Microsoft and Amazon but want to know how much and what type of DSA questions they ask ??\nGive me overall brief!!\n\nThankuu so much !!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1l3unol/interview_process_for_amazon_microsoft_and_other/",
      "comments": []
    },
    {
      "title": "Amazon Interview",
      "body": "I recently completed 5 interviews in one day with 5 different people almost an hour each for a role in Amazon. The next day they told me I didn’t get the role. I understand there’s a lot of competition but they said they “couldn’t provide feedback at this time”. I have some self awareness so I can see some issues or perhaps misalignment but I don’t think it’s fair that I didn’t get feedback. They said “reapply in a year”",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1hya1az/amazon_interview/",
      "comments": [
        {
          "body": "This is how all the FAANG companies operate. They use bullshit, highly subjective interview processes and criteria that they know can be gamed. That's why they don't provide any feedback, to prevent people from gaming the interview process.",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon SDE1 Interview – LP Round Ended Early Due to Technical Issues. What Should I Do?",
      "body": "Hey everyone,\n\nI recently interviewed for the SDE1 Graduate role at Amazon. I did well in both coding rounds, solving all the questions asked. However, during my Leadership Principles (LP) round, I had trouble hearing the interviewer. I pointed this out three times, but the issue persisted. Surprisingly, the interview, which was scheduled for an hour, was ended after just 25 minutes.\n\nNow, I’m unsure about my next steps. Since I wasn’t assigned a recruiter, I don’t have a direct contact to follow up with. I’m considering reaching out to Amazon’s hiring support team, but I’m not sure how effective that would be.\n\nHas anyone been in a similar situation? Do you think they might reschedule the LP round, or is this likely a rejection? Any advice on how to proceed would be greatly appreciated!\n\nThanks!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1io68jj/amazon_sde1_interview_lp_round_ended_early_due_to/",
      "comments": []
    },
    {
      "title": "Internal offer from VP vs. Amazon interview in progress – career advice?",
      "body": "I'm currently a financial analyst (~5 years experience) at a large multinational +50bn in annual sales. A VP recently approached me with an offer for a new internal role—Business Operations Consultant—which he’s creating and wants me to take on. He shared his own career journey, mentioned someone once gave him a similar opportunity, and said he’d like to do the same for me. He’s already spoken to senior leadership and wants to fast-track the move.\n\nAt the same time, I’m interviewing with Amazon for a Senior Financial Analyst position. I’ve completed the first round, and the loop is coming up. They haven’t shared the salary range, but they did proceed after I shared my expected number—which I gave before the internal VP offer came up—so I assume it’s aligned or close.\n\nThe dilemma:\n\nThe internal role offers mentorship, senior visibility, and fast growth—but I worry it could limit future mobility outside the company.\n\nAmazon offers a stronger brand, probably more money, and broader long-term options—but it might take years to reach the same level of exposure and trust I have internally.\n\n\nHas anyone faced a similar internal vs. external fork in the road? Would love to hear how you thought it through.\n\n",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1jwy4zm/internal_offer_from_vp_vs_amazon_interview_in/",
      "comments": [
        {
          "body": "The wibble tasted snizzleflap till the glorp frosting goober-melted from inside the snorf ovenfloop.",
          "score": 5
        },
        {
          "body": "&gt;The internal role offers mentorship, senior visibility, and fast growth—but I worry it could limit future mobility outside the company.\n\nWhy?",
          "score": 1
        },
        {
          "body": "The VP handpicked role is much better vs being just another worker bee at Amazon. \n\nBeing promoted within a company is very attractive to other companies. It shows that you can grow if they hire you and give you a chance. \n\nOftentimes it also allows you to break into titles and roles you wouldn’t get just interviewing randomly at other companies. \n\nDon’t turn a positive relationship with the VP into a negative one.",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon Corporate Job Interview...4-6 hours!?",
      "body": "After 97 applications, I got an interview with Amazon (let's say it's corporate and nothing to do with IT). I've been told I'll have at least (maybe 2) phone interviews that will be between 45-60 minutes and then a final interview that would be between **4-6 HOURS.** \n\nUm...wtf? Has anyone ever had this type of interview with Amazon? I understand there are some companies that require interviewees complete work/tasks related to the job, but the email about the interviews I received did not give specifics, so just curious what this 4-6 hour interview would include?? \n\nAppreciate any insights offered. ",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/1jlt0lq/amazon_corporate_job_interview46_hours/",
      "comments": [
        {
          "body": "It’s the loop and you should definitely read up on it. Applying for Amazon has never been for the faint of heart.",
          "score": 5
        },
        {
          "body": "It's not just Amazon that does this. Many corporate positions will require the candidate come in and meet with different department heads, HR, etc. for a few hours. We normally reserve those types of interviews for Director or above roles but other companies have done it for any role.",
          "score": 2
        }
      ]
    },
    {
      "title": "Phone interview with Amazon",
      "body": "I have a phone interview with Amazon for Business Analyst role tomorrow. It's set to be about LP principles. I'm using Chatgpt to practice some questions for all the principles. Honestly I'm freaking out, like what do you say for \"tell me about a time when you had to balance customer satisfaction and company policy\"... Wtf!! I have 3 years experience, I havent done anything like that...\n\nCan anybody please tell me what principles are they mostly focusing on?\n",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/1fjgovh/phone_interview_with_amazon/",
      "comments": [
        {
          "body": "Be ready to talk about how you exhibit these principles in STAR format. These are gonna be the softs they’re gonna ask about but you’ll probably have more technical questions, that I can’t help with. https://www.amazon.jobs/content/en/our-workplace/leadership-principles\n\nI interviewed and got a job as an area manager in one of their warehouse via a college graduate track, so my interview was probably a lot easier than yours will be. Amazon is customer obsessed and they don’t mean just shoppers on Amazon. My customers were the employees I managed and obviously the actual customers. So be ready to know who and how your role will affect your “customers”. I just made up stories and had details about the details to be prepared to expand on my responses.",
          "score": 2
        },
        {
          "body": "I’ll preface this by saying that by the time I had the phone interview I had already decided I didn’t want the job.  I had applied for the position right before Amazon announced the elimination of remote and hybrid roles and the expectation that employees would come into the office 5 days a week, which would have meant I would have had to relocate, plus people I spoke to who had moved to Amazon gave me a negative impression of its work culture that corresponded to what I had read online about it.  The role I was applying for would have involved sustainability initiatives for vendors, and I was having a hard time imagining how I could push other companies to be more sustainable, especially for human rights in their supply chains, when Amazon’s own practices are so abysmal in this area.  It would feel hypocritical.  But the whole interview process felt like nonsense to me. The online assessment (which I apparently passed) tested me on scenarios that had nothing to do with the job I was applying for and the “right” answers seemed arbitrary.  The. In the actual phone interview the person I was supposed to interview with was sick so they subbed in someone else at the last minute.  Again the scenarios he threw at me had nothing to do with the job I was interviewing for, and neither the questions themselves nor the scenarios from my past lent themselves well to the “STAR” method, especially the idea of collecting “data” on improving team morale when I never really had a problem where my job was to fix team morale.  So I think my examples did not fit well with the arbitrary questions the interviewer asked.  And I probably talked myself out of the role by asking if the work culture was really as intense as I had read and heard about. The interviewer’s answers didn’t fill me with a lot of confidence.  Nor did his answers about the role itself, which seemed to indicate the role was more of a bs role that didn’t have the real influence and ability to make change in the Amazon supply chain that the job description made it sound like.  The final nail in the coffin was probably the fact that I compared Amazon to the Sears and Roebuck of the 21st Century, which the interviewer bristled at; I guess he didn’t know about Sears and Roebuck’s outside influence on American culture in the 18th century that I was referring to.  But like I said, I had already decided I didn’t want the job before the interview, and the whole interview processs confirmed that Amazon is not a company I would want to work for.  I withdrew from the other two positions I was in consideration for right after the interview. ",
          "score": 2
        },
        {
          "body": "How’d it go?",
          "score": 1
        }
      ]
    },
    {
      "title": "Upcoming Brand Specialist Interview at Amazon! ",
      "body": "Hello! I have an interview for the brand specialist role at Amazon and would appreciate any insight on how it is conducted and what to expect. I wasn't told there is an excel component yet, but looks like there might be one based on other people's experiences. Will I be expected to solve something during the call or will they let me know in advance? Can others share their past experience please? ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1ezypwe/upcoming_brand_specialist_interview_at_amazon/",
      "comments": [
        {
          "body": "Your recruiter should prepare you. There are also hundreds of resources online about how to prepare for an Amazon Loop interview.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Hi u/Slytherinstark01 !  \nSo you gave any update on how your online assessment went? what all parts were there and some information on the types of question?  \nAlso, what was the duration of the test?",
          "score": 1
        },
        {
          "body": "Hello there! How did the interview go?",
          "score": 1
        },
        {
          "body": "I've same excel interview, would you mind sharing your experience please?",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon loop Interview - SDE USA",
      "body": "Hi everyone,\n\nI’m preparing for the Amazon SDE 1 loop interview and would love to get some insights from those who’ve gone through it recently.\n\nHow many rounds should I expect?  \nWhat does each round typically focus on?  \nAny recommendations for resources to prepare effectively?\n\nAny tips or personal experiences would be super helpful. Thanks in advance for sharing your insights.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1ht6wqi/amazon_loop_interview_sde_usa/",
      "comments": [
        {
          "body": "www.google.com",
          "score": 2
        },
        {
          "body": "All of this info exists on dozens of blogs and websites. Additionally, all of your questions can be answered by your recruiter. I would suggest you re word this to focus on personal experience if you can’t find previous posts about it.",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon Business Analyst Loop interview help.",
      "body": "Hi everyone, I have a loop interview coming up at Amazon for a Business Analyst position with the Amazon Fresh team. While the job description mentions SQL, Excel, and similar tools as key requirements, my initial interview hinted that the role might be a hybrid between a traditional BA and a BI Analyst. I’d greatly appreciate any advice from those who have gone through similar interviews or tips on how to best prepare for the technical components. Thank you!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1hhxh16/amazon_business_analyst_loop_interview_help/",
      "comments": []
    },
    {
      "title": "Interview at Amazon",
      "body": "Hey everyone,\n\nI’ve got two interviews (30 minutes each) scheduled back-to-back for an Operations Lead position. I’ve been preparing using the STAR method, focusing my answers around the company’s leadership principles.\n\nAny tips on what else I should do to prepare, especially for managing two consecutive interviews and staying sharp throughout? Also, what kind of follow-up or situational questions should I expect after answering the basics?\n\nAppreciate any advice from those who’ve been through similar multi-interview panels!",
      "subreddit": "interviews",
      "score": 22,
      "url": "https://reddit.com/r/interviews/comments/1nyu1j7/interview_at_amazon/",
      "comments": [
        {
          "body": "Figure out how many ping-pong balls will fit in a 747.  Yes it's an actual Amazon interview question.",
          "score": 8
        },
        {
          "body": "[removed]",
          "score": 7
        },
        {
          "body": "one of the things I do, is copy and paste the job description into AI and have it come up with questions that pertain to the job and company. I then Taylor them a bit more so they don't sound so \"robotic\". \nHave clear and consise answers and good questions, research the position as well. Check Glassdoor for the over all temperature of the company. Be confident, and you'll be fine!\n\nGood luck!",
          "score": 2
        },
        {
          "body": "I'd use Claude vs. Chatgpt",
          "score": 2
        },
        {
          "body": "[https://www.auralyze.ai/blog/post/amazon-interview-questions-2025-complete-guide-to-landing-your-aws-dream-job](https://www.auralyze.ai/blog/post/amazon-interview-questions-2025-complete-guide-to-landing-your-aws-dream-job)",
          "score": 1
        },
        {
          "body": "Warehouse ops or Sales/Business ops?",
          "score": 1
        },
        {
          "body": "Back to back 30 min interviews are brutal. I've seen candidates nail the first one then completely tank the second because they're mentally exhausted. amazon ops lead interviews are particularly draining since they dig so deep on each LP example. For situational questions they love the likes of \"what if your team disagreed with you\" or \"how would you handle conflicting priorities from different stakeholders\" type stuff. We actually have a few Amazon ops managers on Prepfully who coach for these exact interviews - they know a LOT and can guide you based on exactly where you are at wrt to amazon's expectations - worth giving a try if the reward is high :)",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewed for Amazon L5 BIE role, Now Being Considered for L4",
      "body": "Hello All, \n\nI have recently completed my interviews with Amazon for the L5 Business Intelligence Engineer role. After a few days, the recruiter contacted me saying I'm inclined for the L4 role, and they need to find a team match and a Hiring manager who is recruiting for those roles. Anyone who has gone through similar circumstances, did you receive an offer letter? How long does this process usually take? and what are the chances of me getting an offer letter?\n\nAny responses are appreciated. \n\nThank you",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1eqp90j/interviewed_for_amazon_l5_bie_role_now_being/",
      "comments": [
        {
          "body": "Can you please share your experience.\nIt would be really helpful",
          "score": 1
        },
        {
          "body": "Yes, this exact situation happened with me. Usually it can take a month but is dependent on where you are located. Since they have hubs in Seattle and Dallas, finding teams for BIE's is easier there than other locations.",
          "score": 1
        },
        {
          "body": "What is the update on this here ? I am here in a similar situation ?",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon business analyst - interview questions help",
      "body": "Hey guys - I have an interview for Business analyst role at Amazon in the next two days. Honestly, i am not prepared because i havent slept in two three days due to project issues in the current work. Even though i am fairly good with the business analyst work and i can manage it, i am not sure of the sql part. This is the first round of the interview.\n\nWhat are some of the websites which can help me brush up sql for amazon interview?\nWhich topics do they usually ask in the first round for sql? I can do the basic queries of group by, aggregates, joins etc. But have never worked on triggers or functions and such.\n\nI don't know if i will do well or not, but i dont want to embarrass myself by missing basic questions. Any help will be greatly appreciated.\n",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/1e55zp6/amazon_business_analyst_interview_questions_help/",
      "comments": [
        {
          "body": "Leetcode or hackerrank are decent prep\n\nTheir SQL test is straightforward, you’ll be fine with the knowledge that you have.",
          "score": 2
        },
        {
          "body": "How did it go for you? Any tips or feedback on the process would be really appreciated. Thanks!",
          "score": 1
        },
        {
          "body": "\n\n\nHey i saw your thread on amazon BA loop interview. I have my loop interview scheduled in a week . I would like to get some insights regarding the technical round. It would be really helpful for my prep. \nThanks in advance!",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon SWE - Software and Networking Developer Interview Scheduled, Tips Needed",
      "body": "Hey everyone,\n\nI have an interview scheduled in a week for a Software and Networking Developer role, and I'm looking for some advice or to hear about your interview experiences.\n\nI've been preparing by working through Leetcode questions from an Excel sheet I found online and reviewing the Amazon Leadership Principles. The interview email mentioned that there will be a System Design component, so I plan to brush up on that once I finish my current prep.\n\nDoes anyone have any tips or insights on what to expect, especially for the networking aspects? Any particular topics I should focus on or resources you recommend?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ec0mpc/amazon_swe_software_and_networking_developer/",
      "comments": [
        {
          "body": "How did you interview go? I have a possible interview for this position",
          "score": 1
        }
      ]
    },
    {
      "title": "Part Deux of the Top Post Of All Time™ on /r/jobs: \"I'm an ex-recruiter for some of the top companies in the world. I've screened tens of thousands of resumes, and today I published my preferred resume format, free to download as a Word doc, along with some general resume advice.\"",
      "body": "**2024 edit:** after 7 years of answering thousands of career questions in my spare time, I've since created [SheetsResume.com](http://SheetsResume.com) as a continuing passion project. There, I've written much more [resume and job advice](https://sheetsresume.com/advice) like this. I also continue to update my famous [free resume template](https://sheetsresume.com/resume-template) used by millions, publish new candidate-friendly tools like my [free cover letter generator](https://sheetsresume.com/cover-letter), and even built and trained an [AI Resume Builder](https://sheetsresume.com/builder).\n\nI'm so grateful that my Reddit posts continue to help so many people looking for resume and job help! You can ask me new questions on the r/jobs subreddit discord, or as a new post on my [subreddit](https://www.reddit.com/r/SheetsResume).\n\n**Original post:**\n\nColin here.\n\nIt's been 10 weeks since, on a random Saturday morning, I wrote what would become the [**top post of all time on** **/r/jobs™**](https://www.reddit.com/r/jobs/comments/7y8k6p/im_an_exrecruiter_for_some_of_the_top_companies/). The response was overwhelming – my resume has been used millions of times now! It kind of caught me off guard how much it resonated with so many of you, but it was really incredible to see just how many people it helped.\n\nWhen I posted my [resume template](https://sheetsresume.com/resume-template) free to download as a Word doc (*delete the footer* before sending out) and Google Doc, I did it because I didn't have time to help a couple dozen people on Reddit that had PM'd me their resume on another post.\n\nHuge mistake.\n\n6,500 upvotes, [669 comments](https://www.reddit.com/r/jobs/comments/7y8k6p/im_an_exrecruiter_for_some_of_the_top_companies/), and probably over 1,000 PMs since then, I've realized that I'll never catch up to the deluge of questions. I've answered hundreds of PMs, but there are probably about 75 or so of you still waiting on a response. Sorry to the folks I haven't been able to get to :/\n\nSO, I wanted to make this follow-up post to answer the **top 10-ish resume / job FAQs** I got from all those messages. I figured it was great to help people 1-on-1, but the wider community might benefit from it, too. Long long post, so Ctrl+F will be your friend from here on out.\n\nThere is also specific job hunting advice here (question #1) that's the best I can give.\n\n**Without further ado, here are my Top 10-ish Resume FAQs:**\n\n# 1. Nice. Thanks for the resume. Now how do I go about finding a job?\n\n* Search startup jobs on [Wellfound](https://wellfound.com) (make a terrific, full profile first), corporate jobs on LinkedIn / ​Glassdoor / Indeed, ​and an additional good software engineering job board is StackOverflow. Those are the best sites (*2023 edit:* StackOverflow's business model is getting hit pretty hard by AI, but I still think their job board is solid).\n* [We have a full list of niche job boards here, listed out by category.](https://sheetsresume.com/advice/where-should-i-look-for-jobs/) Also written as a [reddit post about job boards](https://www.reddit.com/r/jobsearchhacks/comments/1jzb956/where_to_look_for_jobs_here_are_40_niche_job/).\n* Make sure your LinkedIn profile is spruced up and filled out so you get poached by recruiters (it should match your resume pretty closely in content). ​You should put your technical skills in the skills section (recruiters use a lot of keywords and boolean search strings when hunting).\n* Find a recruiter in the industry you want to be in and maybe reach out to them, or apply to jobs on a recruiter's website vs directly on a company's website. It's in a recruiter's best interest to get you hired, so it's always nice to have a direct path to the hiring manager and a financially motivated advocate on your side.\n* Also apply for jobs on your college's job board. I know it may seem weird, but the companies advertising there are​ already​ looking for ​your school's grads. There will likely be senior roles listed alongside entry-level roles.\n* In any applicant email or cover letter, make sure it's not cookie-cutter. Write them all from scratch. Obviously recycled cover letters are a bad look. They only have to be about a paragraph (2-6 sentences IMO is fine) and should match the tone of the company's culture. Since writing this post, I have trained a [free cover letter generator](https://sheetsresume.com/cover-letter) that you can use unlimited times that'll write a fresh fun cover letter for any job description.\n* When you get down to the nitty gritty, make the hiring manager's life as easy as possible. You want them to say \"yes.\"\n* “When can you start?\" -&gt; \"When do you need me to start? ​...​Sounds good.\" (Unless there's a huge problem.)\n* “How much money do you want?\" -&gt; \"Well salary is important to me​ because I'm looking at owning a home and setting up roots here, so it'll definitely be a component of wherever I decide to go, but first and foremost I'm looking for a job that I'll be happy in and that I think advances my career to where I want to be in the long term.\" Make them give you the first number; they should be able to tell you the job's range.\n* “If they push on salary, it's very easy to say, \"Well, I wouldn't consider the job for less than X, and I'd likely make the move for Y, and I'd be thrilled to come to work every day for Z.\" You want them to give you a number in between Y and Z. Don't give them only X because it's the bare minimum you'd work for. Give them multiple choices and make them choose. Here is my comprehensive write-up on [**salary negotiation**](https://www.reddit.com/r/Salary/comments/1jbbp8f/im_an_exrecruiter_who_was_paid_by_some_of_the/).\n* Use [Glassdoor.com](http://Glassdoor.com) to apply to jobs and prep for interviews – most jobs at big companies have all the interview questions on there already.\n   * Make sure you know 95% of the questions coming at you before they're asked. Since writing this post, I have created an [AI interview practice tool](https://sheetsresume.com/ai-interview-practice) that you can try out.\n\n# 2. How do I explain away a gap in my work history on my resume?\n\nIt's ok to have a job on your resume that says:\n\nCompany: **Independent Consultant**\n\nRole: *\\[X\\] Consulting for Multiple Clients*\n\nDates: *Year last worked elsewhere - Present*\n\nThen just have one bullet point that says, \"Needed scheduling flexibility to take care of some personal matters, so I worked as an \\[independent consultant\\] for a year.\"\n\nIf you don't have *any* side work during your time off, just have a bullet point under your last job (very last bullet point) that says \"Needed scheduling flexibility to take care of personal family matters, which is why I left this role.\"\n\nNo one will ask about the personal matters, and you can just handwave it away as \"Some family items that needed to be sorted out\" if they do. That way, you don't have to explain why you took a break in the rat race, and you can phrase it as \"but now I'm ready to jump back into a full-time position in the area I'm most experienced in and enjoy the most.\" Don't feel the need to over-compensate for the gap -- people value simplicity and like it when people are straightforward, and they don't like overdone bullet points or long-winded explantations by phone. 10 seconds or less during the interview, move on, excited and ready for the new gig.\n\n# 3. Are cover letters useful?\n\n[Not if your resume is bad](https://www.reddit.com/r/jobs/comments/7y8k6p/im_an_exrecruiter_for_some_of_the_top_companies/dueht7p/). They can be a nice differentiator if your resume is good.\n\nUnless it's required, I wouldn't write any type of long formal cover letter. They won't read it unless your resume is strong and they already think you can do the job.\n\nI'll put it this way: your cover letter can't save you from a bad resume. If the resume is bad, they'll skip reading whatever letter you wrote. If your resume is good, a nice, short, original (never cookie-cutter), company-specific letter can improve your odds, separate you from similar applicants, and make a great first impression.\n\nThe best cover letters are short (1 paragraph), written from scratch, and have the same tone as the company's culture. If you want to save yourself a few hundred hours and a lot of annoyance, use my [free AI cover letter maker](https://sheetsresume.com/cover-letter) and thank me later.\n\n# 4. How do I move horizontally in my career (i.e., make a career switch)? Should I embellish my current experience as a front desk person?\n\nI wouldn't gussy things up on the resume. Don't try to make a non-glamorous job sound like anything other than what it is. Describe it quickly: are you a bartender? Put \"Tend bar full-time at local restaurant that can require 60+ hour work weeks.\" You can show you're a hard worker, but you don't need to say things like, \"Provide outstanding and exemplary customer experience in a top-10 Austin fine dining establishment.\"\n\nPeople tend to embellish on resumes to compensate for what they view as bad experience, but I advise people to lean into it; otherwise, you can't confidently talk about what you've done in the past.\n\nYou'll want to look at job descriptions online in your experience range (i.e., # of years in the workforce) for companies you want to work for, look at the skills they require, and then go learn them before applying. Maybe do some side projects. I'm talking skills that can be learned in a month - Google AdWords, Amazon AMS, Google Analytics, Shopify website design and marketing, Facebook marketing, Instagram marketing, viral marketing on reddit, etc. Look at sales jobs, biz dev jobs, marketing jobs, customer service – those are all more lenient to people with differing backgrounds. You'll have to get at least 1-2 years of a good company name or good experience on your resume before you \"move up\" to a dream job or a non-monotonous job.\n\nIf you like graphic design, take some Adobe Creative Cloud courses on Udemy and build a portfolio of projects on Fiverrr.\n\nIf you want to move into programming, use Codecademy, G School, General Assembly, or another program like that (some cost $$, some don't, all are around 3 - 9 months long to learn any type of useful programming skill that looks good on a resume). Do as much coding as you can in your spare time on public projects and include your Github profile as a link on your resume.\n\nAlso, look at startup jobs on AngelList – startups are a little more lenient when it comes to hiring people from various backgrounds.\n\nStuff like that will go a long way towards a career trajectory shift.\n\nA lot of people put objectives that say they want to make a career change, but honestly... I don't know if an objective will help here. If you applied for a job that's an obvious career change, the screener will see that and know that. You're either qualified or not, and I find objectives that say, \"I'm looking to make a change\" or something like that come off as a little desperate. I prefer someone be confident and just apply to the job with a normal resume without any explanations – you shouldn't hope to get passed through for a job you're not qualified for, and an objective won't change that. I would focus more on side and freelance projects in the field to show that you have at least some relevant experience or deep interest in the field.\n\n# 5. I had multiple roles within my last company; I've been promoted; I'm a consultant and I work a bunch of temp jobs. How do I show this in a good way?\n\nTo show multiple roles or promotions at the same company, I really like structuring it as I do in my [resume template](https://sheetsresume.com/resume-template). Basically, put the main date range in bold that you worked at the company overall, and then put the date range for each role in italics next to the role's title, like this:\n\n*Most Recent Job Title | YYYY - YYYY*\n\n* Bullet points for each job.\n* 2nd bullet point.\n\n*Previous Job Title | YYYY - YYYY*\n\n* Bullet point #1.\n* Bullet point #2.\n\n[**Preview image of what I mean.**](https://imgur.com/gallery/resume-advice-multiple-roles-same-company-qoSvata)\n\nThen rinse and repeat until you have all roles outlined. If gives you continuity up top at first glance (\"ok they've been at the same company for a while\") while still showing your upwards trajectory or all the hats you've worn. You can skip roles that are less relevant, or combine them into similar titles (i.e., if you worked as a \"Junior Designer\" for 6 months and then was promoted to \"Designer\" and then \"Senior Designer,\" you can just fold the 6 months as a Junior Designer into your Designer title as your first stop at that company).\n\nFor **temp jobs,** the thing to do is just put it on the resume as normal in my template -\n\n**Company Name**\n\n*Position Name*\n\nAnd as the last bullet point after listing all your responsibilities and accomplishments, put:\n\n* Temporary placement via \\[Name\\] staffing agency\n\nIf you have a ton of temp placements, I would structure it like this:\n\n**Staffing Agency**            \\[alignment spacing\\]   **Overall Date - Date**\n\n*Most Recent Placement*  \\[alignment spacing\\]   *Date - Date*\n\n* Bullet Points\n\n*Prior Placement*  \\[alignment spacing\\]   *Date - Date*\n\n* Bullet Points\n\n*Prior Placement*  \\[alignment spacing\\]   *Date - Date*\n\n* Bullet Points\n\nSo that way in bold, it looks like you have lots of continuity at one job (looks good), and then in italics you explain where you've been at each temp stop.\n\n# 6. A one page resume doesn't leave enough room for my 20-year-long work history. What can I do?\n\nGood [comment chain here](https://www.reddit.com/r/jobs/comments/7y8k6p/im_an_exrecruiter_for_some_of_the_top_companies/dufntpn/) about this. Excerpt:\n\n&gt; Parse down by trimming bullet points to just 1 or 2 per past job, remove most of the stuff under education aside from your degree and school name, and reduce the font to 8pt and widen the margins. Definitely don't remove past positions unless you put a catch all like putting \"Various Companies and IT Positions\" for the first 10 years after you graduated school, and then list out the companies (with the role in parentheses next to each company) as the bullet point. So you can display the last 10-15 years fully, but then truncate the first 5-10 years of your career that may not be as relevant at this point.\n\n# 7. I didn't complete college. How do I show that in a good way?\n\nWithout knowing your specific situation to give exact advice, I would follow my resume format (but move **Education** below **Skills &amp; Interests** so you can first show your chops) and set it up as such:\n\n**College Name** \\[spacing to align right\\] **Year Start - Year You Left**\n\n*Major: \\_\\_\\_\\_\\_\\_* \\[spacing to align right\\] *Location*\n\n* Relevant coursework: \\_\\_\\_ , \\_\\_\\_ , \\_\\_\\_ , \\_\\_\\_ , \\_\\_\\_\n* Left college prior to graduation in order to pursue my career.\n\n# 8. How can I 100% get through an ATS automatic screening system?\n\nDon't think about it like this. You might get past the initial screen, but you may harm your chances of actually getting the job, even if qualified. If you list too many or unrelated skills, people will think you're full of shit as soon as they get human eyes on that resume haha. I'd list a decent amount of skills you're confident you have that also match up with what they're looking for in the job description, but don't just throw spaghetti at the wall and see what sticks.\n\n# 9. I'm 16. How do resume? Can I job?\n\nYou're young! Go walk into somewhere and ask if they're hiring and fill out an application, or go on their website and apply. Restaurants and retail are your best friends. You can use my resume format; it will just have a lot more whitespace! Add a volunteering section, list your high school under Education, student clubs, sports, extracurriculars, etc.\n\n# 9a. I'm interviewing for my first job out of college. Any advice?\n\n* When they ask what your biggest weakness is, give an honest response. Don't say that you work too hard, or that you're a perfectionist. That's BS. Talk about a time that it's bitten you, what you're doing to try to overcome it, and an example of how you've been making sure you stay conscious of your weaknesses and work around it.\n* Be professional but also yourself. You're young, so they'll wonder about your work ethic, emotional maturity, and ability to handle adversity. I'd keep that in mind and stay centered, don't get flustered, but also crack a joke or two at the right time and make sure they know you're also someone they'd like spending time with every day.\n* Negotiate salary by phone, and then follow up via email. Don't. Negotiate. Over. Email. Things will get lost in translation and you can lose an offer if you're not careful at this stage. Always negotiate by phone (also negotiate more than salary – bonuses, parking, fringe benefits if any, vacation policy (if flexible, don't push if not), that sort of thing.\n* Don't burn any bridges, ever. If you ever get rejected, take it in stride, and never say anything (especially in writing) that you can't take back.\n\n# 10. I want to relocate. How can I apply for jobs in different cities without being at a disadvantage for living out of town?\n\nInstead of your current city, or alongside it, put \"Moving to: City, State\" at the top of your resume for whichever location you're applying to so they know that you're already dead-set on relocation.\n\n# 11. How do I discuss reasons for leaving a job in an interview?\n\n[Here's a good response, with some relocation reasons baked in.](https://www.reddit.com/r/jobs/comments/8hhpw8/how_best_to_answer_why_im_leaving_my_current/dyjvr2x/)\n\n# 12. Do you do 1:1 resume reviews?\n\nYes - after many years of fielding PMs asking me for a trustworthy professional resume review service, I've finally set up my own [resume builder](https://sheetsresume.com) to try to help even more people with their job search in my spare time.\n\nI didn't anticipate that these posts would go on to change so many people's lives, and I am so grateful to be able to help others on their journey.\n\nAnd there you have it. Hope this is helpful to all of you in the middle of job hunts and resume revisions! Here's that [resume template](https://sheetsresume.com/resume-template) one more time.\n\n**08/08/2018 edit:** if I don't get back to your PM, please don't hate me. I just have too many to respond to (get about 5 new ones a day at this point), especially on top of my full-time work. Many people have PM'd me telling me that the resume format and this advice helped them get a new job, and that's really an indescribably good feeling. I'd help everyone personally if I could!",
      "subreddit": "jobs",
      "score": 1837,
      "url": "https://reddit.com/r/jobs/comments/8hs6xc/part_deux_of_the_top_post_of_all_time_on_rjobs_im/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Any advice or tips on learning proprietary software or software that is only available at the enterprise level? (aka no free public release)\n\nFor example, I have no experience with Salesforce and it's my #1 hang-up when recruiters say no and toss out my application. I do have experience with other CRMs, but a lot of companies are looking for Salesforce-specific experience.\n\nI can't gain that software experience unless it was a tool I used in a past role. So how do I overcome this hurdle?",
          "score": 43
        },
        {
          "body": "Do you have any advice for teachers? I'm an elementary teacher (K-1st grade) trying to change careers and I have no idea how to make my resume more relevant to non-teaching positions. I've been looking for jobs in my skillset, like training/curriculum development and office/advisor positions at the local university.",
          "score": 30
        },
        {
          "body": "This is probably a question already covered and I’ve just missed it somehow, but... what if the gap in your employment is more than a year or so, closer to like, 7 years or so (lived a semi-charmed kinda life I reckon) with a brief fast food stint (think 6mo tops) just for some variety about halfway through that? How do you manage to spin that?\nAsking for a friend, obvs.",
          "score": 18
        },
        {
          "body": "Personal update: hi! I am a marketer with 17 years of experience. I have have progressive experience, a great performance record, excellent references, an advanced degree and an in-demand skill set; yet I am not getting interviews. I have even hired and interviewed dozens of people, so I just didn't get it. I spent several hours re-doing my resume based on this advice. I applied to 8 jobs and have 2 interviews! \n\nThis *could* be a coincidence. Regardless, THANK YOU. Job hunting is hard and this was just the boost I needed to push me through! You are the best. In hindsight all the fluff on my resume was probably diluting my experience. Thanks again. I used the cover letter tips too. ",
          "score": 19
        }
      ]
    },
    {
      "title": "Amazon Loop interview for  App Security Engineer",
      "body": "hello folks , This forum has been immensely helpful . I  got selected for Amazon loop interview after a grilling phone screening round! position is of app sec engineer. I am pretty nervous . not sure what to expect ! is there technical rounds or just LP rounds in loop? please share experiences if anyone went through the same in past 6 months",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1clny0u/amazon_loop_interview_for_app_security_engineer/",
      "comments": [
        {
          "body": "How was your interview? did you get the position?",
          "score": 1
        }
      ]
    },
    {
      "title": "Have an Amazon. SDE1 interview in 4 days, need tips",
      "body": "Title says it.\nI have 6months experience as an sde1.\n\nWould love any sort of information in DM that can help. \nPS: it's a virtual interview on chime. (So.. ykwin, any help is appreciated)",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1q5uqmi/have_an_amazon_sde1_interview_in_4_days_need_tips/",
      "comments": [
        {
          "body": "Bro the leadership principles are everything at Amazon, know them cold. They'll ask behavioral questions tied to each one so have solid examples ready. For coding just grind leetcode mediums and know your data structures inside out\n\n  \nAlso pro tip - test your setup beforehand, chime can be janky and you don't want tech issues during the interview",
          "score": 1
        },
        {
          "body": "4 days is enough to sharpen your edge. Since it's a 1-hour slot for an SDE1 role, it’s highly unlikely they’ll grill you on heavy System Design but technical questions in your major. \n\n  \nYou shouldn't spend all your time on LeetCode because it mainly tests basic algorithms and data structures, which requires long-term practice. Try to find real-world questions from companies like Amazon instead. There are tools like [AI Interview](https://chancely.ai/practice-questions) that let you search by company and role to see what they actually ask. It’s a much more targeted approach.",
          "score": 1
        },
        {
          "body": "congrats on landing the interview, first of all. when i prepared for an amazon interview, i focused on dsa topics like dfs, recursion, trees. for system design, e-commerce related stuff like ratings/reviews system have come up. then for behavioral questions, they're closely tied to amazon's leadership principles so make sure to study up on those &amp; prepare a story bank! definitely check out an [amazon sde interview guide](https://www.interviewquery.com/interview-guides/amazon-software-engineer) you can find sample questions and advice that can help you frame your answers logically and prep more effectively.",
          "score": 1
        },
        {
          "body": "Yeah, classic Amazon style - expect behavioral Qs using the STAR method and some coding probs typical to SDE1 roles. Sharpen up on data structures and algo basics. Do a quick mock interview, focusing on clear, structured responses. You got this!",
          "score": 1
        },
        {
          "body": "Nice, four days is tight but workable for sharpening the basics. I’d do daily 4560 min timed drills where you talk through your approach out loud, aim to land a clean first pass, then quickly check edge cases and complexity. I usually pull a few prompts from the IQB interview question bank and then run a mock in Beyz coding assistant to keep my pacing honest. Since it’s on Chime, test your setup, keep notes nearby with 23 quick behavioral stories, and practice concise answers around 6090 seconds so you don’t ramble, fwiw. That cadence should steady you fast.",
          "score": 1
        },
        {
          "body": "Is it onsite interview?",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon SDE Intern Interview Experience will i be reject?",
      "body": "So, interviewer came 20 minutes late then it starts with introduction then she send me link of live code of amazon where i got first question leetcode hard based on linked list on seeing the question it was doable at first sight i told my brute approach she told me what’s the time complexity i told him she said not exactly but yeah similar can you think of optimisation of your approach so i am thinking but not getting idea then she gave little bit hint i didn’t catch from it but in second hint i understand and then i started coding after her approval my code was not perfect but logic is correct as 25-30 mins passed interviewer told me that time passed a lot we have to finish second question fast she discussed time and space complexity and this time i told correct she said okay but it seems she is not satisfied then i got second question of tree medium level i told my brute force approach and told time and space complexity and she told me to optimisation i told my approach and code it there is a logical bug in a code she told me to dry run my code and see if your code is fine i dry run it and told answer I could not able to catch the issue then she gave hint is this line is correct then i got the bug and correct it and at end i think she is satisfied she said is this your final code i said yes and discuss TC and SC again not sure she is satisfied my this question or not because she re asked me is your code is completed i am panicked though i did both questions on time and asked 2-3 good questions to interviewer what suggestions will i be reject or get offer??",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1o9vja1/amazon_sde_intern_interview_experience_will_i_be/",
      "comments": [
        {
          "body": "Don’t stress too much! From what you’re describing, you did the right things: you communicated your approach, worked through hints, corrected bugs, and asked thoughtful questions. Interviews are rarely perfect, and interviewers expect candidates to think on the spot.\n\nEven if your code wasn’t perfect, showing problem-solving skills, ability to take hints, and reasoning about time/space complexity matters a lot. It doesn’t automatically mean rejection. Be patient sometimes they’re just tough graders.\n\nFocus on what you learned from this experience and be ready for the next round. You gave it your best shot!",
          "score": 3
        },
        {
          "body": "when was your interview??? was it through the hackon ??? please do let us know if you get the results overall i feel your interview was good and high chances you might get the + results",
          "score": 1
        },
        {
          "body": "Are you from the sept 26-oct 24th batch??  \nand can you share the questions you were asked please",
          "score": 1
        },
        {
          "body": "hey bro, was the interview through amazon hackon?",
          "score": 1
        }
      ]
    },
    {
      "title": "Seeking Advice: Amazon Data Scientist GenAI interview",
      "body": "Hey everyone, I’m looking for advice as I’ve cleared the phone screen and now have a 5-round Amazon GenAI Data Scientist interview scheduled next month: 1. ML Breadth 2. ML Depth 3. Python + SQL 4. GenAI Applications 5. Leadership Principles\n\nWhat kind of questions and problems can I expect in each round , especially GenAI and ML depth? Will I need to build ML algorithms from scratch, focus on pandas/SQL, or design GenAI applications? If you’ve interviewed for a GenAI/Data Scientist role at Amazon, your insights would be hugely appreciated!\n\nThanks folks!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1m10ov4/seeking_advice_amazon_data_scientist_genai/",
      "comments": [
        {
          "body": "You're looking at a comprehensive technical gauntlet that Amazon uses to separate the real practitioners from the resume fluffers. The ML Breadth round will test your understanding across different algorithms, model evaluation metrics, and when to use what approach - expect questions about bias-variance tradeoff, overfitting solutions, and comparing different model types. ML Depth goes much deeper into the mathematical foundations, so you'll likely need to derive algorithms from scratch, explain backpropagation, or walk through gradient descent optimization. The Python + SQL round is straightforward data manipulation - think complex pandas operations, window functions in SQL, and optimizing queries for large datasets.\n\nThe GenAI Applications round is where things get interesting since this field moves so fast - you'll need to demonstrate understanding of transformer architectures, prompt engineering strategies, RAG systems, and how to evaluate LLM outputs. They'll probably ask you to design a GenAI solution for a business problem, discussing everything from data preprocessing to deployment considerations. The Leadership Principles round isn't just behavioral fluff at Amazon - they genuinely use these to make hiring decisions, so prepare specific examples that demonstrate ownership, customer obsession, and diving deep into problems. I'm on the team that built a tool for [AI interview practice](http://interviews.chat), and we've seen a lot of people use it to practice these exact types of technical deep-dives and tricky scenario questions that Amazon loves to throw at candidates.",
          "score": 2
        },
        {
          "body": "\"Congrats on making it this far! For GenAI and ML depth, expect to dive into algorithm optimization, model selection, and maybe even coding tasks to demonstrate your problem-solving skills—pandas/SQL will be key for data wrangling, and for GenAI, focus on application design and real-world problem-solving scenarios.\"",
          "score": 1
        },
        {
          "body": "ML Depth focused on model assumptions, trade-offs, and failure modes. I got quizzed on regularization intuition, overfitting in tree models, and evaluation metrics beyond accuracy.\n\nPython + SQL was hands-on: pandas manipulations, filtering edge cases, and writing joins or CTEs. Speed matters, but so does clean code.\n\nHonestly, pulling behavioral and technical questions from IQB interview question bank helped me see how they phrase things. I also used Beyz interview assistant to practice STAR answers for LPs, especially ownership and invent-and-simplify.",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon SDE1 - Automated Rejection After Final Interview Loop – Is This Normal?",
      "body": "Hey everyone,\n\nI had my final interview loop this Tuesday, and today, I received an automated rejection email. I’m wondering if this is normal. I was expecting the recruiter to personally reach out with feedback or at least inform me directly, considering it was the final round.\n\nThe issue is that the application portal has shown “not under consideration” for all the roles I applied to from the start, so I’m not sure if the rejection is for the role I just interviewed for or some other application.\n\nHas anyone experienced something like this? Should I trust the email, or is it possible the rejection is for a different role entirely? Would it be worth reaching out to the recruiter to clarify, or is this just part of the process?\n\nAny advice or similar experiences would be really appreciated. Thanks!\n\nhttps://preview.redd.it/zvdnqdp6ztsd1.png?width=1538&amp;format=png&amp;auto=webp&amp;s=05a82b98714af56fafc7c378f3583020e1ea5e11\n\n",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1fwdv34/amazon_sde1_automated_rejection_after_final/",
      "comments": [
        {
          "body": "Hey any update?",
          "score": 1
        },
        {
          "body": "did you reach out?",
          "score": 1
        }
      ]
    },
    {
      "title": "Seeking interview advice for Amazon LOOP - Role is Senior Financial Analyst - NACF",
      "body": "Hi everyone,\n\nI’ve cleared the hiring manager round for the Senior Financial Analyst role in North American Customer Fulfillment (NACF) Finance at Amazon, and I’m now preparing for the LOOP interview.\n\n**What types of questions should I expect?** Both technical and behavioral.\n\nCould someone walk me through what a typical LOOP interview might look like? I've never done one before and would really appreciate any advice or insights!\n\nI was told in the phone interview by a proxy manager that these roles are Excel-heavy. Should I focus my stories around Excel and also prepare for questions on Excel? The job description also mentions SQL—would framing stories about using SQL be beneficial?\n\nAlso, are there any specific Leadership Principles (LPs) that I should focus on for this role?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1f59s1j/seeking_interview_advice_for_amazon_loop_role_is/",
      "comments": []
    },
    {
      "title": "Seeking Advice for Amazon Interview: Selling Partner Support Associate Role ",
      "body": "Hey everyone,  I’m gearing up for an interview with Amazon for the position of Selling Partner Support Associate, and I could use some guidance. I’m feeling a bit nervous and would appreciate hearing about your experiences and any tips you might have to offer.  If you’ve interviewed for a similar role at Amazon, I’d love to know what the interview process was like for you. What kind of questions did they ask? Were there any unexpected twists or aspects of the interview that caught you off guard?   Also, I’m curious about the salary range for this position. I have over a year of experience in e-commerce, specifically as an online operations executive, which involved tasks similar to those of the Selling Partner Support Associate role, so I’ve checked requirements and I suit it.  Any insights or suggestions you can provide would be incredibly helpful as I prepare for this opportunity. Thanks in advance for your help! ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ch4fgv/seeking_advice_for_amazon_interview_selling/",
      "comments": [
        {
          "body": "Were you able to get in? Did you get the job?",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon job application changed from \"under consideration\" to \"Application Submitted\" after onsite interview",
      "body": "What could this mean?",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/bbliby/amazon_job_application_changed_from_under/",
      "comments": [
        {
          "body": "It sounds like you may have been taking out of consideration, but honestly who knows. Those applications hubs never have the right status for me until I've been rejected with an email or hired. The interim is a mess.",
          "score": 8
        },
        {
          "body": "[deleted]",
          "score": 5
        },
        {
          "body": "I wouldn't worry unless the status says Not moved forward. Otherwise there is still hope",
          "score": 3
        },
        {
          "body": "It could mean anything. Maybe you were taken out of consideration. Maybe it's the message displayed when they advance it to the next step. Who knows? Just keep applying for shit.",
          "score": 2
        },
        {
          "body": "I had a good rapport with the recruiter so she called me.",
          "score": 2
        },
        {
          "body": "Sadly it probably just indicates that the system is set up for their convenience, not yours.  Something to think about - if things are this opaque and annoying now, what will it be like once you start working for them?",
          "score": 1
        },
        {
          "body": "Do you have a recruiter you're working with?  Maybe shoot him/her an email",
          "score": 1
        },
        {
          "body": "Any update on this? I am in the same position",
          "score": 1
        }
      ]
    },
    {
      "title": "Does anyone have experience the \"Problem solving interview\" from Revolut? Also looking for someone who has exprience in Amazon's hiring process",
      "body": "Hi,\n\nCurrently in a few hiring process, some are really long and though like the one at Revolut, I already pass the screen call, the home task and the skills interview, I have dedicated a lot of time to this process and I do not want to be dismissed when I am so close to completing the entire process., so I'm looking for advice? how I can be successful during this round, I heard  that this is trhe stage that make som many people dismissed of the process, can anyone give me suggestions?\n\nThe other process I'm in is at Amazon México, does anyone have experience on how is the process? is it rigorous? how many rounds does they ussually have? now I have to complete the Amazon Online Assessment, I believe that this si nothing like the CCAT but any advise?\n\nEDIT: I've been receiving many DMs regarding this post, I want to specify that I was participating in the recruitment process for the regulatory affairs manager role, so the questions they asked me in the skills interview and online assessment or home task stages were specifically related to the position and my previous experience, in the case of the problem solving interview stage, the problem I had to answer was related to an operational manager of an airport that was having problems due to bad reviews from customers and who wanted to \"match\" the rating of other airports, my recommendation for that interview is that you study the MECE framework, watch videos on youtube related to Mckinsey case studies and train chatGPT to help you prepare with this and other examples, it is important that you keep track of the time because you only have 45 minutes to ask questions and present 3 conclusions of probable root causes, any questions regarding the time that will have during the inteview (in case the meeting starts late), clarify it from the beginning, they do not give you much data, even if you ask for it (at least in my case this is how it was), so if you come to simple conclusions it is better to present them on time, than to wait to have more information, because there probably isn't any, take the lead of the meeting from the beginning and you set the tone for each stage of the interview, be structured in your reasoning, if the interviewer does a lot of pushback it is important that you remain calm (it is part of what they want to see), these are all the recommendations that I can make from my experience, it has been a few months since I did it, so I don't remember any more details of the interview, I hope it helps.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1llx9qy/does_anyone_have_experience_the_problem_solving/",
      "comments": [
        {
          "body": "Can't help with Revolut specifically but I can definitely speak to Amazon's process since I was a Bar Raiser there for years.\n\nAmazon Mexico follows the same general process as other Amazon regions - expect 4-6 rounds total after the OA. The online assessment is just the first gate, and you're right that it's different from CCAT. It's more focused on coding problems and behavioral questions around leadership principles.\n\nThe process is rigorous but totally beatable with proper prep. Most people underestimate how much the behavioral portion matters - even if you crush the technical rounds, weak leadership principle stories will get you rejected. For Amazon Mexico roles they still evaluate on all 16 leadership principles so make sure you have solid STAR stories that show real ownership and results.\n\nSince you're juggling multiple processes, I'd recommend focusing your Amazon prep on both the technical side (leetcode medium/hard problems) and really dialing in your behavioral responses. The behavioral round is often the deciding factor when candidates have similar technical performance.\n\nI actually built Score My Interview specifically because so many technically solid people get rejected on the behavioral portion. The AI can help you practice and score your STAR responses using the same standards Amazon applies internally.\n\nFor the technical prep, focus on clean code, edge cases, and optimization. Amazon cares a lot about code quality and scalability thinking even for individual contributor roles.\n\nDon't get discouraged by the length of these processes - companies that invest this much in hiring usually offer better long-term opportunities. The fact that you're making it through multiple rounds at both places is a good sign.",
          "score": 2
        },
        {
          "body": "The Revolut problem-solving interview is where many candidates get filtered out, but you're already past three rounds which shows they're seriously considering you. This round typically involves complex business scenarios, data interpretation, and logical reasoning under time pressure. The key is thinking out loud, showing your structured approach to breaking down problems, and being comfortable with ambiguity. They want to see how you handle real-world challenges you'd face on the job, so focus on demonstrating clear reasoning rather than just getting the \"right\" answer.\n\nFor Amazon México, their process follows the global Amazon standard which means expect multiple rounds focused heavily on their Leadership Principles - have specific examples ready that demonstrate each principle. The Online Assessment is indeed different from CCAT; it's more about work simulation scenarios and logical reasoning rather than pure cognitive ability testing. Amazon's process can be lengthy with typically 4-6 rounds including phone screens, technical assessments, and the final loop, but they're generally consistent in their approach. Since you're dealing with these high-stakes interviews, I'd suggest checking out [interviews.chat](http://interviews.chat) \\- I'm on the team that built it and it's designed specifically to help candidates navigate these tricky problem-solving questions and behavioral scenarios that companies like Revolut and Amazon are known for.",
          "score": 2
        },
        {
          "body": "I did it today 😱 first time I've done an interview like this, and even with the training suggestions they provided I bombed. I'm a senior tech manager and this was about improving HR processes, so thinking peripherally around the problem was pretty awkward because I was just guessing at stuff basically. I got to the point where I was asking for stats and stages, and there turned out to be a ton of additional data provided from the interviewer, and I misunderstood one of the sets of figures pretty badly, which threw me off, and someone rang the fucking doorbell halfway through as well which threw me too, so all in all I think i dropped the bag which is super disappointing because it's been 3 years since I last worked and I really needed this.",
          "score": 2
        },
        {
          "body": "Hi, Can you please help me with the interview process at Revolut. I believe you went through it. I had my screen call 2 days back and awaiting the results. The HR told me that the next one is problem solving and raising the bar. So, if you could give a brief of what type of questions are asked in these rounds, I'll really be grateful. Thanks in advance!",
          "score": 1
        },
        {
          "body": "I feel like I screwed at the interview :D No feedback about it yet, though.",
          "score": 1
        }
      ]
    },
    {
      "title": "One Medical Interview process by Amazon",
      "body": "Any body, had interviews with One Medical by Amazon?, I have a second a virtual interview with multiple people back to back and was asked to sign HIPAA/NDA agreement, how does their process work?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p727l3/one_medical_interview_process_by_amazon/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Had a similar setup with them last year. The back-to-back virtual rounds are pretty standard - usually a mix of behavioral, technical, and case studies depending on the role. The HIPAA/NDA is normal since you'll likely discuss patient data scenarios.\n\nHonestly the process can drag on after this round, they're not great with follow-up timing. If you're not confident with panel interviews, I'd suggest prepping with mock interview tools. I used Final Round AI's mock interview feature when I was going through similar healthcare tech interviews and it really helped me get comfortable with the format.\n\nGood luck, the waiting game after these panels is brutal.",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon loop interview waiting for results",
      "body": "Had an Amazon loop interview last Monday and Tuesday and they said they'll get back in 5 days. 5 days was yesterday if you factor in weekend. And still not heard back. I thought I did pretty well and hoping for the best but as I've not heard back I'm starting to panic. What do you think?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1npez2t/amazon_loop_interview_waiting_for_results/",
      "comments": [
        {
          "body": "Ugh, that waiting period is the absolute worst part of the job search, and Amazon's five-day timeline can feel like an eternity. It's completely normal to feel a mix of hope and panic, especially since you felt good about your performance. The good news is that a delay doesn't necessarily mean a \"no.\" Amazon's hiring process is highly structured, and the debrief meeting where all the interviewers' feedback is collected and a final decision is made can be difficult to schedule. It's not uncommon for these meetings to be pushed back due to Bar Raiser availability, multiple candidates being considered, or simply the busy schedules of the hiring team. The fact that you haven't received a rejection, which is often sent faster, is actually a positive sign. While you wait, it's wise to continue interviewing with other companies to keep your options open. If you want to know more about the typical Amazon hiring timeline and when it's appropriate to follow up with your recruiter without being pushy, I've got a detailed guide on navigating the post-interview silence. You can find it here: [https://www.pihrate.com/careers/amazon-careers/landing-job-at-amazon-2025/](https://www.pihrate.com/careers/amazon-careers/landing-job-at-amazon-2025/)",
          "score": 1
        },
        {
          "body": "Hang tight, it's common for companies like Amazon to take a bit longer, especially with high volume of candidates. If you haven't heard back in the next couple of days, it's totally fine to send a polite follow-up email to HR. Just a quick note expressing your continued interest and checking in on the timeline should do.",
          "score": 1
        },
        {
          "body": "So I sent the recruiter that first contacted me a message yesterday and got an automatic response that she's out till Monday. I sent the same to the second one that arranged my loop interview and she hasn't responded. But in the evening I saw the job I interviewed for reposted again. I guess it's all over at this point",
          "score": 1
        },
        {
          "body": "any updates buddy??",
          "score": 1
        }
      ]
    },
    {
      "title": "Has anyone given Amazon SDE-2 Linux interview?",
      "body": "* What type of questions do they ask?\n* Do they also test **DSA/algorithms**, or is it completely **Linux-focused**?\n* For the **system design round**, what kind of problems do they expect when the role is Linux-heavy?\n* Any tips/resources to prepare specifically for this interview?\n\nWould appreciate any insights from people who have gone through it recently 🙏",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1novy5m/has_anyone_given_amazon_sde2_linux_interview/",
      "comments": [
        {
          "body": "They ask about Linux internals, memory management, and some scripting. You should still brush up on DSA since coding questions can come up. Practice debugging and real-world scenarios too.",
          "score": 1
        },
        {
          "body": "The interviews are definitely a mixed bag that goes beyond just Linux commands and system administration. You'll face a combination of data structures and algorithms questions alongside Linux-specific scenarios, so don't expect it to be purely systems-focused. The coding rounds typically include medium-level LeetCode-style problems, but they'll also throw in questions about process management, file systems, networking, and shell scripting. They love asking about debugging production issues, performance optimization, and how you'd troubleshoot system bottlenecks using Linux tools.\n\nFor the system design portion, expect problems that leverage Linux environments heavily - think designing distributed logging systems, monitoring infrastructure, or deployment pipelines that need to handle scale. They want to see how you'd architect solutions that take advantage of Linux's strengths in containerization, process isolation, and resource management. The interviewers are looking for candidates who can bridge the gap between software engineering fundamentals and deep systems knowledge. I'm on the team behind [interviews.chat](http://interviews.chat), and we built it specifically to help candidates practice these kinds of multi-faceted technical interviews where you need to think on your feet about both algorithmic problems and system-level challenges.",
          "score": 1
        },
        {
          "body": "checkout past interviews - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "Can you check your dm?",
          "score": 1
        }
      ]
    },
    {
      "title": "Help with Principal Product Manager interview opportunity at Amazon",
      "body": "Hi All,\n\nIt’s my first time interviewing with Amazon or any MAANG and would appreciate any kind of insights on what and how to prepare for a technical Principal PM role at Amazon. (L6/L7)\n\n1st round is a 1 hour phone interview.\n\nI have kind of 1.5 weeks to prepare. Any recommendations on what all to prepare, what resources to use and what will be a good strategy to approach this?\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1liuoy3/help_with_principal_product_manager_interview/",
      "comments": [
        {
          "body": "Amazon PM interviews have a very specific structure that's different from other MAANG companies, and the principal level adds some unique wrinkles.Don't treat this as a regular MAANG interview. \n\nAmazon PM interviews are heavily structured around their Leadership Principles (LPs). You need to have concrete STAR examples for each LP, especially Customer Obsession, Ownership, Dive Deep, and Bias for Action. At principal level, they'll also focus heavily on Think Big and Deliver Results. Amazon evaluates every answer through this framework.\n\nSince this is a technical principal role, expect deep dives into:\n\nSystem design discussions (not coding, but understanding technical tradeoffs).\n\nHow you've worked with engineering teams to make architectural decisions.\n\nTechnical debt prioritization and communication to leadership.\n\nAPI design considerations if relevant to the role.\n\nFirst rounds are typically LP-focused, behavioral with some product sense. Have 2-3 detailed STAR stories ready that showcase senior/principal-level impact. They want to see you've influenced without authority across large, complex organizations.\n\nProduct Alliance has really solid Amazon specific content that breaks down the LP framework in a PM context. Their approach to structuring STAR responses is particularly helpful for Amazon's interview style. They also have good technical PM content that bridges the gap between pure product strategy and technical execution. The content of their modules are pretty accurate compared to what interviewers usually ask.\n\nRemember this, they're not just evaluating your PM skills, they're evaluating whether you can operate in their specific culture. The LPs aren't just interview fodder, they're actually how decisions get made day-to-day.\nGood luck.",
          "score": 9
        },
        {
          "body": "They'll absolutely grill you on their Leadership Principles - these aren't just nice-to-know concepts, they're the backbone of every single question you'll face. You need to have rock-solid STAR method stories ready that demonstrate each principle, especially \"Customer Obsession,\" \"Ownership,\" and \"Dive Deep\" since those are critical for Principal PM roles. They'll ask you to walk through complex product decisions you've made, how you've handled ambiguous situations, and how you've influenced without authority. The technical depth they expect at L6/L7 is significant - you should be ready to discuss system design, data analysis, and how you've used metrics to drive product decisions.\n\nYour 1.5 weeks should be laser-focused on crafting compelling stories from your experience that showcase leadership at scale, because that's what separates Principal PMs from regular PMs. Practice explaining complex technical concepts simply, prepare for case study questions about Amazon's actual products, and be ready to discuss how you'd approach building something from zero to millions of users. The phone screen will likely focus on a couple of Leadership Principles and a technical deep-dive, so make sure your examples are crisp and quantified with real impact numbers. I'm on the team that built [AI interview assistant](http://interviews.chat), and it's designed specifically to help with these kinds of high-stakes interviews where you need to nail complex behavioral and technical questions under pressure.",
          "score": 2
        },
        {
          "body": "Focus hard on Amazon’s Leadership Principles, back every answer with a clear STAR story, and prep to deep-dive on metrics, tradeoffs, and product strategy like you already own a billion-dollar roadmap.",
          "score": 2
        },
        {
          "body": "Principal roles at Amazon are L7 and a significant step up from the typical PM bar - they'll expect you to demonstrate system-level thinking and influence across multiple teams/orgs.\n\nFor the phone screen, expect 2-3 leadership principle questions focused on ownership, customer obsession, and delivering results at scale. The scenarios will be more complex than L5/L6 - think \"tell me about a time you had to drive alignment across multiple stakeholder groups with conflicting priorities\" or \"describe how you've influenced technical architecture decisions.\"\n\nKey differences for Principal level:\n\n\\- Your examples need to show impact across multiple teams, not just your immediate scope\n\n\\- They want to see strategic thinking - how did your decisions affect the broader business?\n\n\\- Technical depth matters more. You should be able to discuss system design trade-offs, scalability challenges, etc.\n\n\\- Expect questions about building processes/frameworks that others can use\n\n1.5 weeks definitely doable. Focus on:\n\n1. 4-5 really strong STAR examples that show principal-level scope and impact\n\n2. Practice articulating your technical decision-making process \n\n3. Have specific metrics ready - revenue impact, user growth, efficiency gains\n\n4. Be ready to go 2-3 levels deep on any example\n\nThe phone screen is usually behavioral + one technical deep-dive on a product you've shipped. They might ask you to walk through architecture decisions or explain how you'd scale something.\n\nSince this is your first MAANG interview, I'd strongly recommend practicing your responses out loud. The bar for communication clarity is really high at this level. Score My Interview can help you get your STAR responses dialed in quickly if you need fast feedback on your examples.\n\nWhat domain is the Principal PM role in? That'll help determine what technical areas to brush up on.",
          "score": 1
        },
        {
          "body": "How did it go? Any helpful tips and lessons learned?",
          "score": 1
        }
      ]
    },
    {
      "title": "Is there an AI tool which can help me prepare for interviews, I input \"Amazon frontend interview questions and answers\" and this tool gets me all the previous questions and answers all over the internet including, related videos, blogs, articles?",
      "body": "",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1nv8dsw/is_there_an_ai_tool_which_can_help_me_prepare_for/",
      "comments": [
        {
          "body": "try out [https://acejobi.pro/](https://acejobi.pro/)",
          "score": 1
        },
        {
          "body": "checkout past interviews - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewing for Amazon delivery",
      "body": "I have an interview soon with a partner that works for Amazon delivery and am just wondering anyone who've been in the position. What questions have you been asked? How hard is the interview?\n\n\nThanks in advance\nI have only had one interview in my job past and it was basically can you breathe. So I don't know how a real interview goes...",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nkhvlg/interviewing_for_amazon_delivery/",
      "comments": [
        {
          "body": "They asked about my driving record, weekend availability, how I handle a dog at the door or a lost package, lifting a 50-pound load, and my comfort level using a scanner and GPS. I practiced 60-90 second STAR questions and quickly read aloud my route plan to demonstrate that I considered safety and timing. I rehearsed with Beyz interview helper and found questions from the IQB interview question bank. Bring your driver's license information, clearly state your shift flexibility, and emphasize that safety decisions are more important than speed.",
          "score": 1
        },
        {
          "body": "Welp ya'll were right, she mostly just talked about the company and how they do things and only asked me my background and why i want to join and then offered me a position.  Lol",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone interview recently for Ops Engineer at Amazon (WA)? LPs focus: Deliver Results &amp; Bias for Action",
      "body": "Hey all,\nI’ve got a phone interview coming up for an Operations Engineer role in WA. The recruiter mentioned the focus will be on the LPs Deliver Results and Bias for Action.\n\nAnyone interviewed for this role recently?\n\t•\tWhat kind of questions should I expect?\n\t•\tHow deep do they go into metrics/results?\n\t•\tAny tips on how best to prepare?\n\nWould really appreciate any insights!\n",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1miu0ol/anyone_interview_recently_for_ops_engineer_at/",
      "comments": [
        {
          "body": "expect behavioral Qs drilled to the bone  \nthey’ll push for specifics: what you did, how fast, what impact, what numbers  \n“bias for action” means they want initiative without hand-holding  \n“deliver results” means metrics or it didn’t happen\n\nprep stories that show:\n\n* you moved fast with limited info\n* you owned the outcome, not just the task\n* you fixed something broken without being told\n* you made tradeoffs under pressure and still hit target\n\nuse STAR but keep it tight  \nskip fluff  \nlead with outcomes\n\n[**NoFluffWisdom Newsletter**](https://NoFluffWisdom.com/Subscribe) has some tactical takes on owning interviews and showing value under pressure  \nworth a peek if you want to level up quick",
          "score": 3
        },
        {
          "body": "Hey guys, I just got selected for the final loop. From research I've seen people say not to repeat answers across interviews in the final loop (i understand why). Does that also mean i shouldn't use the STAR answers that i used in my phone interview in my final interview?\n\nAlso any other tips would be welcome as well!",
          "score": 2
        },
        {
          "body": "Get ready to talk numbers and concrete outcomes. They'll ask you to walk through situations where you had to make quick decisions with incomplete information (Bias for Action) and then drill down on exactly what metrics improved as a result (Deliver Results). Expect questions like \"Tell me about a time you had to act without all the data you wanted\" or \"Describe a situation where you delivered results under pressure.\" They're not looking for vague answers about teamwork - they want to hear about the actual systems you optimized, the percentage improvements you achieved, and how you measured success.\n\nThe interviewers will push back on your examples and ask follow-up questions about why you chose that approach over alternatives, what the business impact was in dollars or efficiency gains, and how you knew your actions were working. They love hearing about automation you implemented, incidents you resolved quickly, or processes you streamlined with measurable outcomes. Practice telling your stories with the STAR method but focus heavily on the specific results and metrics - Amazon lives and breathes data, so come armed with numbers that show your impact.\n\nI'm on the team that built [AI interview helper](http://interviews.chat), and it's designed exactly for situations like this where you need to nail specific behavioral questions and leadership principles that companies like Amazon are known for.",
          "score": 1
        }
      ]
    },
    {
      "title": "Upcoming interview in Deloitte for Role - Consultant - Amazon Web services. What questions I can expect? Anyone has any experience of this interview?",
      "body": "Anyone has given Consultant -AWS web services interview in Deloitte?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n7jj9a/upcoming_interview_in_deloitte_for_role/",
      "comments": [
        {
          "body": "I think the usual for aws: IAM, VPC, S3, lambda as concepts, then architecture tradeoffs like cost, reliability, performance, ops. You could look into IaC and CI/CD and monitoring ops.\n\n  \nAlso, do mock interviews until this feels routine. With a friend or even an AI that simulates the real technical convo. Try it here, no sign up: [voice.neuraprep.com](https://voice.neuraprep.com/) (I am the founder, for full transparency). It takes interview questions from glassdoor (this job exactly or similar) and you have a discussion with the AI the same way you do in a real interview. Feedback appreciated!",
          "score": 1
        },
        {
          "body": "You'll likely face questions about core AWS services like EC2, S3, RDS, Lambda, and VPC configurations, plus cloud migration strategies and cost optimization approaches. They'll also test your understanding of enterprise architecture patterns and how you'd design scalable solutions for different business needs. Expect behavioral questions around managing client relationships, handling project challenges, and demonstrating leadership in technical implementations.\n\nThe consulting aspect is just as important as the technical side, so prepare for case study scenarios where you'll need to recommend AWS solutions for hypothetical client situations. They might ask how you'd approach a cloud transformation project, handle resistance from client stakeholders, or present complex technical concepts to non-technical executives. Deloitte values consultants who can bridge the gap between technology and business value, so practice explaining AWS benefits in terms of ROI and business outcomes rather than just technical features.\n\nI'm on the team that built [interview AI copilot](http://interviews.chat), and it's designed specifically to help with these kinds of multi-faceted technical consulting interviews where you need to balance technical depth with business acumen.",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon SDE 2 interview (FBA). How to prepare LPs?",
      "body": "Basically the title. I have an interview coming up and wanted to know what skillset specifically to highlight for SDE 2 LPs. \n\nShould I focus more on soft skills or tech skills?\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ov36ry/amazon_sde_2_interview_fba_how_to_prepare_lps/",
      "comments": [
        {
          "body": "For an SDE 2 role at Amazon, you'll need a solid combo of both tech and soft skills. Tech skills are crucial, especially in coding, system design, and problem-solving. But don't underestimate the importance of soft skills - Amazon loves when you demonstrate leadership principles in real scenarios. Balance is key, focus on relevant examples that tie these skills together with their LPs like Customer Obsession and Deliver Results. Good luck!",
          "score": 1
        },
        {
          "body": "This [Amazon SDE interview guide](https://www.interviewquery.com/interview-guides/amazon-software-engineer) may be of interest to you, as it has sample questions for tech skills like coding &amp; system as well as behavioral/LP questions to help you balance your prep. For example, you might be asked how to influence technical decisions, to which your answer must be tied to key values like earning trust and navigating conflict.",
          "score": 1
        }
      ]
    },
    {
      "title": "Front end Engineer-2 interview with Amazon",
      "body": "Hello guys, I had my front end interview-2 today with Amazon. Only a part of the interview is done and the rest of interview is scheduled for tomorrow. But had a small enquiry, where I had interviewed with two persons one was with title Software Dev Engineer-3 and the other was Principal Software Engineer. The sde-3 person was not the part of the team that I was interviewing for, she explicitly mentioned this, she was part of the Backend Team and asked only behavioral questions(LP around 7-8 scenarios) and the interview with the principal guy(he is the same team that I was interviewing for) went well asked 3-4 behavioural questions and 1 coding question along with adding some other additional  requirements on the fly. The reason for this post and the thing that is bothering me is during the interview with sde-3 I kind of blacked out for almost like 20-30 sec thinking about a story or scenario to explain. Is that considered to be a flag now or how does the interviewer generally take that into account? Because this is kind of bothering me and unable to feel like motivated for the next 3 rounds that are scheduled tomorrow. Any insights are much appreciated.\n\nP.S: I have 3 rounds still yet to be interviewed, one with Front End Engineer and the other 2 are with the Software Development Manager. Any insights on this are appreciated as well. Thanks",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o05dnw/front_end_engineer2_interview_with_amazon/",
      "comments": [
        {
          "body": "Something similar happened to me during the first round, right at the first question. I was expecting a brief intro exchange, but the interviewer jumped straight into a behavioral question. Honestly, I fumbled my response. After that, I paused for about 5–10 seconds, and before the next question, I politely asked if I could take a quick sip of water. From there, I made sure to take a moment to think before answering, and things went much smoother. In later rounds, I handled both behavioral and coding questions quite well.\n\nSince you still have time to prepare, I’d recommend going through your stories carefully—most follow-up questions aim to probe gaps or unclear areas. In two of my rounds, I wasn’t asked any follow-ups for three of the behavioral questions, which I took as a good sign. If you do well with the Bar Raiser and potentially the Hiring Manager, there’s a strong chance you’ll get an incline. Good luck!",
          "score": 1
        },
        {
          "body": "The blanking out thing happens to everyone - i wouldn't sweat it too much. More concerning is that you've got 3 more rounds including 2 with the SDM which feels like overkill for FE-2 level. At prepfully we see this pattern sometimes where teams stack interviews when they're not aligned on what they're looking for. The principal going well is what matters since they're on the actual team. For tomorrow just prep a few more stories that cover different leadership principles - the SDMs will probably dig into how you handle conflict, deliver results under pressure, that kind of stuff. Also weird they split your interview across 2 days, that usually means scheduling conflicts not anything about your performance.",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon SDE I Interview Questions 2025 — What’s REALLY Being Asked?",
      "body": "Prepping for Amazon SDE I and noticed most question lists online are outdated for 1 or 2+ years. Anyone know the new, frequently asked coding + system design questions trending in interviews right now? Would help me (and others) a ton!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nslc5q/amazon_sde_i_interview_questions_2025_whats/",
      "comments": [
        {
          "body": "There isn’t some secret 2025-only list. For SDE I, Amazon is still pulling mostly LeetCode mediums, and the patterns haven’t changed: sliding window and two pointers for strings/arrays, heaps for “top K” and streaming, BFS/DFS for grids and trees, plus binary search on answer problems like ship capacity or split array largest sum. Monotonic stacks keep popping up in variants of daily temperatures and largest rectangle, and the classic DP set shows up in simpler forms. Expect the OA to be two to three easy-mediums plus a short debugging section and a work style/simulation piece. Phone/virtual rounds are 1-2 mediums in 45 minutes; talk through edge cases, prove correctness with a couple of targeted tests, then tighten complexity. They care less about flashy tricks and more about a clean approach, tradeoffs, and you steering the discussion.\n\nFor “system design,” SDE I usually gets design-lite: build a tiny service such as a URL shortener, a simple rate limiter, a feature-flag service, or a key-value store with TTL. Nail the APIs, data model, indexes, and the first scaling step: caching, pagination, avoiding hot keys, idempotency, and how you’d monitor and degrade gracefully. You won’t be judged on reinventing Dynamo; you will be judged on clarity, pragmatism, and how you reason under constraints. Leadership Principles matter a lot, so have tight STAR stories with concrete metrics, a real failure you owned, and a disagreement you resolved. If you want structured reps on these patterns and the LP behavioral traps, [interview helper AI](http://interviews.chat) is good for navigating the tricky stuff and getting you interview-ready - I’m on the team that made it.",
          "score": 1
        },
        {
          "body": "Most Amazon SDE I interview questions in 2025 focus on a combination of technical problem-solving and behavioral questions tied to the company's **Leadership Principles (LPs)**. The interview loop typically includes an online assessment and several technical rounds, which can be a mix of coding, system design, and behavioral questions. [https://www.pihrate.com/category/careers/amazon-careers/](https://www.pihrate.com/category/careers/amazon-careers/)\n\n# Behavioral Questions (Leadership Principles)\n\nThis is a non-negotiable part of the Amazon interview. You will be asked about 5-6 of the **16 Amazon Leadership Principles**. Prepare stories using the **STAR method** for principles like:\n\n* **Customer Obsession**: A time you went out of your way to help a customer.\n* **Ownership**: A project you owned from start to finish.\n* **Invent and Simplify**: A time you simplified a complex process.\n* **Learn and Be Curious**: A time you learned a new technology and applied it.\n* **Bias for Action**: A time you made a quick decision with incomplete data.\n\nYour answers should be specific, concise, and clearly demonstrate the principle they are asking about. [https://acejobi.com/the-star-method-explained-step-by-step-guide/](https://acejobi.com/the-star-method-explained-step-by-step-guide/)",
          "score": 1
        },
        {
          "body": "checkout past interviews - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon interview Finance Manager - help &amp; advice request",
      "body": "Amazon Finance Manager L6 Interview\n\nHi! Prepping for an interview loop with Amazon for Finance Manager L6 (IC only) and was hoping to get advice how to prep for it! Will there be technical questions involved? Also curious about the overall culture and how it is like working for Amazon as a Finance Manager? This team is specifically within Amazon Stores - would appreciate all the feedback! ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ns6jp7/amazon_interview_finance_manager_help_advice/",
      "comments": [
        {
          "body": "Expect a loop that is 70% Amazon Leadership Principles and 30% finance depth. You’ll get a bar raiser, hiring manager, peers, and cross-functional partners probing for Customer Obsession, Ownership, Dive Deep, Have Backbone; Disagree and Commit, and Deliver Results. Be ready to walk through a P&amp;L at the category or program level, build or explain a simple forecast, do variance analysis, and talk unit economics for Stores - drivers like traffic, conversion, units, ASP, take-rate, COGS, shipping, vendor funding, inventory turns, and free cash flow. Some teams want SQL basics, many do not, but you must be data-native and very strong in Excel with comfort on sensitivity analysis. Have 8-10 tight STAR stories with quantifiable outcomes, and expect to go three layers deep on numbers and mechanisms. They care a lot about written narratives, influencing senior stakeholders without slides, and spotting a million-dollar issue before it hits the WBR.\n\nCulture-wise, it’s high ownership, document-first, and fast-paced, with heavy spikes around OP1/OP2, Prime Day, quarter close, and Q4. You’ll get real scope and smart partners, but hours can stretch and ambiguity is real, so ask pointed questions about planning cadence, support resources, SQL expectations, and how they measure success for L6 ICs in Stores. If you can show you catch defects early, invent mechanisms, and move a P&amp;L with data-backed decisions, you’ll land it. If you want a clean way to rehearse LP stories and practice handling tough follow-ups without fluff, check out [interviews.chat](http://interviews.chat) \\- I’m on the team that built it and we designed it to help navigate tricky interview questions and ace job interviews.",
          "score": 2
        },
        {
          "body": "checkout past interviews - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon India SDE-1 Interview Experience",
      "body": "Hey everyone! I wanted to give it back to the community and here is my Amazon India SDE-1 interview experience.\n\n# Timeline\n\n* **Applied:** 30th June 2025\n* **OA Invitation:** 17th July 2025\n* **OA Cleared:** 21st July 2025\n* **Round 1:** 13th August 2025\n* **Round 2:** 28th August 2025\n* **Round 3 (Bar Raiser):** 6th October 2025\n* **Offer Call:** 7th October 2025\n* **Offer Letter:** 8th October 2025\n\n# Online Assessment\n\nThe OA had 2 greedy problems to solve in 70 minutes on hackerrank, along with Work Simulation and Workstyle Simulation sections. I managed to solve both coding questions in around 50 minutes.\n\n# Round 1\n\n**Interviewer:** SDE with \\~7 years of experience\n\n* Started with quick introductions and two Leadership Principle discussions (about 15 mins):\n   1. A time I solved a problem I initially didn’t know how to approach.\n   2. A time I stepped out of my comfort zone.\n* **Coding Questions:**\n   1. A variation of *Diameter of Binary Tree*\n   2. A *Matrix problem involving Heaps*\n* I solved both optimally. Initially misunderstood the first one, but clarified during dry run and fixed my approach.\n* Explained time and space complexity clearly for both.\n* Ended by asking a few genuine questions about the team and Amazon’s culture.\n\n# Round 2\n\n**Interviewer:** SDE with \\~3 years of experience\n\n* Began with introductions and discussion about my past experiences.\n* One Leadership Principle question discussed in depth.\n* **Coding Questions:**\n   1. *Clone a Graph* — asked to first dry run the idea before writing code. I implemented the optimal approach and explained TC/SC.\n   2. *Next Palindromic Number* — came up with the logic and explained it clearly (skipped coding due to time).\n* Wrapped up with a short project discussion and my questions for him.\n* The round extended by around 15 minutes since our discussion went long.\n\n# Round 3\n\nOriginally planned for 11th September but rescheduled since the interviewer couldn’t join that day.  \n**Interviewer:** SDM with 14+ years of experience\n\n* This round was purely behavioral, no coding.\n* Started with short intros, then only 2 Leadership Principles, but both were discussed in great detail with multiple follow-ups and “what-if” scenarios (\\~40 minutes).\n* The remaining 20 minutes focused on one of my projects and the questions I had for him.\n\nThanks for reading, and good luck to everyone preparing!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o8c1sf/amazon_india_sde1_interview_experience/",
      "comments": []
    },
    {
      "title": "Amazon BIE II Technical Interview – Need Advice",
      "body": "Have an Amazon BIE II tech interview coming up. Recruiter said:  \n  \n15 min Data Viz (projects, dashboards, metrics, Tableau/Power BI)  \n10 min Leadership Principle (Dive Deep or Deliver Results)  \n40 min Advanced SQL (live coding)  \n  \nQuestions:  \n  \nWhat kind of Data Viz questions to expect?  \nSQL difficulty level on LeetCode?  \nOther good SQL practice sites?",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1mphewp/amazon_bie_ii_technical_interview_need_advice/",
      "comments": [
        {
          "body": "For data viz expect questions around describing your dashboards, metrics impact, and how you handle data quality or ambiguous data. They might ask how a viz helped decision-making. For SQL, Amazon usually leans toward medium-hard problems on LeetCode that test joins, aggregations, window functions, and subqueries. Practice with both performance and correctness in mind. Besides LeetCode, check out HackerRank and Mode Analytics SQL tutorials for solid hands-on exercises. For leadership, prep real quick stories showing you 'Dive Deep' into data inconsistencies or 'Deliver Results' under tight deadlines. Good luck!",
          "score": 2
        },
        {
          "body": "The data visualization portion will likely focus on your ability to tell a story with data rather than just technical skills. Expect questions about how you've designed dashboards for different stakeholders, what metrics you chose and why, how you handled conflicting requirements from business teams, and specific examples of when your visualizations led to actionable insights. They'll want to hear about trade-offs you made between simplicity and detail, and how you ensured your dashboards actually drove business decisions rather than just looking pretty.\n\nFor the SQL portion, you're looking at medium to hard LeetCode difficulty, with heavy emphasis on window functions, complex joins, CTEs, and performance optimization. Amazon loves questions involving ranking, running totals, cohort analysis, and multi-level aggregations. Beyond LeetCode, HackerRank has solid SQL practice, and StrataScratch focuses specifically on data science SQL problems that mirror real business scenarios. The leadership principle discussion will expect concrete examples with measurable outcomes, so prepare stories where you either went deep into root cause analysis or delivered results under pressure with specific metrics to back up your impact. I'm on the team that built a tool for [AI interview questions](http://interviews.chat), which can help you practice articulating these technical concepts clearly and handle the pressure of live coding while explaining your thought process.",
          "score": 2
        }
      ]
    },
    {
      "title": "My experience interviewing for an L5 BIE role at Amazon (and tips for future candidates)",
      "body": "I leaned pretty heavily on this sub and others while prepping, so wanted to give back by sharing my experience interviewing for an L5 BIE (Business Intelligence Engineer) role at Amazon.\n\n**TL;DR** – Recruiter reached out through LinkedIn. I wasn’t thoroughly prepared but gave it my best shot. The online assessment mostly gauges if you know SQL decently well — if you work with it regularly, you’ll be fine. **Practice a ton before the technical phone screen** — know how to live code without a compiler and seriously, practice, practice, practice. Good luck!\n\n\\------\n\nA recruiter contacted me on LinkedIn about an L6 BIE role, but after the hiring manager reviewed my resume, I was assigned to an L5 role.\n\nThere was a generic recruiter phone screen, post which I received the online assessment (OA), which included 2 medium-difficulty SQL coding questions and 10 SQL multiple-choice questions (syntax, functions, clauses, etc.)\n\nOnce I passed that, I had a 75-minute technical phone screen with a BIE manager. I was told it would be a mix of technical questions and a live SQL coding round. I was also given 2 Leadership Principles in advance to prep behavioral stories for.\n\nThis was my first interview in 3 years, so I guess I was rusty because I completely **bombed** the live coding part. They gave me a sample dataset and explained the business case, which was interesting, but when it came to actually writing the code, I went blank.\n\nThe questions weren’t super hard, I’d rate them medium-hard — and on a normal day, I would've figured it out. But not being able to run/validate my code really threw me off. I spent \\~50 minutes trying to get through 2 questions that should’ve taken maybe 15. They skipped the behavioral questions entirely and ended the interview early. (Not surprised — I laugh now, but it was pretty embarrassing.)\n\n**Some takeaways/tips (for myself and others):**\n\n* PLEASE get comfortable writing out the entire code without taking breaks in the middle to run/compile. I got into that bad habit when practicing on LC/Stratascratch, so when I had to write code and present it as my final solution without being able to validate results, I was stuck.\n* Interviewing is an art. I know how to solve these questions and can breeze through them on a regular workday - without any of the external factors. The stress, the composure you need to maintain, talking out loud, needing to backtrack in favor of a more optimal solution - all these things add to the overhead. Interviewing itself takes a lot of practice.\n* This was my first ever interview after 3 years at my current role. Interviewing for an internal transfer is definitely miles apart from interviewing externally. It will take time, effort, and some (maybe even a lot) of failed tries before something sticks.\n* Finally, this is a reminder that your performance in an interview is not a reflection of your skills and strengths! Practice makes perfect.",
      "subreddit": "interviews",
      "score": 11,
      "url": "https://reddit.com/r/interviews/comments/1lkhh3w/my_experience_interviewing_for_an_l5_bie_role_at/",
      "comments": [
        {
          "body": "Pretty great tips here!",
          "score": 1
        },
        {
          "body": "Well written &amp; detailed post with non fluff advice. Can I dm you? I am in a sort of a similar spot right now!",
          "score": 1
        },
        {
          "body": "Thanks for sharing! Just to understand how they move from the first to the second SQL question. Did you have a working solution for the first? Were they looking for a specific solution and not the one you provided?",
          "score": 1
        },
        {
          "body": "How long should I wait for the results of OA",
          "score": 1
        },
        {
          "body": "Great tips! I have an upcoming interview Can i DM you?",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon sde-1 interview",
      "body": "I recently had my interview loop for sde1 role. For the first interview I got 2 LC questions for which I gave optimal solutions. 2nd round: had 1 LP and 1 LC questions. I think the LP was good but for the LC question I just provided the brute force approach. 3rd round: I think this was the bar raiser, it was just a behavioural round where I was asked 3 LP questions with follow up for each. I think out of all 3 round was the best for me.\n\nNow I am not sure if providing only the brute force approach can get me rejected.\n\nAny thoughts regarding this is appreciated.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ll97xy/amazon_sde1_interview/",
      "comments": [
        {
          "body": "Hey, can you please provide us with some deeper insights. It will be really helpful for the preparation. Thanks",
          "score": 1
        },
        {
          "body": "can you share your application timeline",
          "score": 1
        },
        {
          "body": "for first round, they will let you know there will be 2 LC question ? or he did not mention",
          "score": 1
        },
        {
          "body": "Hi,\n\nI have given 4 rounds in the past few weeks for sde1 FTC for Amazon, the last round as it was mentioned in the mail was given 3 days ago. \nI have not heard from the team since then, i have performed well in my first and the last interview rounds, but was not satisfied with my 2nd interview round.\nIs there a possibility that i may get the role, should i be worried.",
          "score": 1
        },
        {
          "body": "after first interview when did you got the results for the same that you have cleared first round because I gave my first interview this thursday and haven’t got any update after that",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon RTH / SOFI Interview",
      "body": "Hello, I was asked to move to Seattle as part of Return to Hub policy at Amazon. If I am not willing to move then I’d have 60 days to search for external or internal role. I was given 30 days to tell my decision. I am based out of Dallas and not in a position to move to Seattle.\n\nI now have an interview scheduled with SOFI for Senior Data Engineer position (BI Focused) and need help to prepare for the interview. Can anyone who works at SOFI as data engineer please help me with the interview process for DE position?  ( Initial Technical Screening) ??",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n4yml5/amazon_rth_sofi_interview/",
      "comments": [
        {
          "body": "SOFI's technical screening for Senior Data Engineer roles typically focuses heavily on SQL proficiency, data modeling concepts, and ETL pipeline design since it's BI-focused. They'll likely ask you to solve real-world data problems on the spot, walk through how you'd design a data warehouse for financial metrics, and explain your experience with tools like Snowflake, dbt, or similar platforms that SOFI commonly uses.\n\nThe good news is that your Amazon experience will carry serious weight, especially if you can speak to handling large-scale data systems and working under pressure with tight deadlines. SOFI values candidates who can translate business requirements into technical solutions, so be ready to discuss specific projects where you've done exactly that. They might also probe into your understanding of financial data and regulatory compliance, given their industry focus.\n\nI'm actually on the team that built [interview AI copilot](http://interviews.chat), and it's designed specifically for situations like this where you need to nail tricky technical questions and behavioral scenarios that come up in senior-level interviews.",
          "score": 2
        }
      ]
    },
    {
      "title": "Is my resume strong enough to get an interview for Amazon Data Engineer I?",
      "body": "Hey all,  \nI’m aiming to break into Amazon as a Data Engineer I. I’ve attached my resume below (comments and roast are welcome—I want the real feedback). For context:\n\n* I’m AWS Certified (Cloud Practitioner + AI Practitioner, prepping for Data Engineer cert)\n* Solid with Python, SQL, and have hands-on AWS project experience (S3, Glue, Redshift, EMR)\n* Worked in data-focused role and have built a couple of data pipelines from scratch\n\n* Graduated recently, so I’m entry-level/fresher\n\n**My questions:**\n\n* Is this resume good enough to get me an interview call at Amazon for DE-I?\n* Anything glaringly missing that would make it a “no” from a recruiter?\n* Should I tailor my resume more for ATS/keywords or just focus on projects/impact?       Happy to return feedback if you drop your resume as well. Thanks in advance for any honest input—no offense taken!\n\nhttps://preview.redd.it/82kv3kw4jqff1.png?width=796&amp;format=png&amp;auto=webp&amp;s=735a3e65e55f779bf9a539b51b49731d208758db\n\n  \n",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1mc1cdv/is_my_resume_strong_enough_to_get_an_interview/",
      "comments": [
        {
          "body": "your resume sounds solid but no resume gets you in alone at Amazon  \nyou gotta play both sides: ATS keywords *and* impact-driven projects  \nrecruiters skim fast—they want buzzwords that hit their checklist *and* stories that show you can actually deliver\n\ndon’t just list tools, show results  \n“built data pipeline X that improved Y by Z%”  \nmake every bullet a mini brag\n\nalso tailor for the role description, not just generic AWS stuff  \nif the job screams “Redshift expertise,” highlight that front and center\n\nfinally: a clean, scannable format beats fancy design every time\n\nThe [NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some no-BS tips on crafting resumes that beat bots and humans worth a peek!",
          "score": 1
        },
        {
          "body": "Hello bro, your from mysore ?",
          "score": 1
        },
        {
          "body": "checkout past interviews - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Amazon interview issues/experience",
      "body": "I just spent hours upon hours over the last three weeks preparing to go through the Amazon interview process. For those I don’t know (short version) they have 16 principles that you need to present a STAR story for each one of them plus have backups. \n\nIt took so much time to set everything up and tell the stories so that I could regurgitate them back. \n\nI had an interview today at 11 and got on the call. No one showed up 15 minutes and I emailed the Recruiter and she told me to disconnect and she get back to me.  \n\n10 minutes later she sent an email saying: very sorry they filled that position and they will present my résumé to other departments and get back to me if they find something.  \n\nOf course I was disappointed and  relieved to stop being stressed out.  \nPutting together all the star stories is something I should’ve been doing months ago. So it was a good learning experience. But I did hear and make up!!🤣\n\nAnyone have the same experience and actually get called back??\n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1n8i07f/amazon_interview_issuesexperience/",
      "comments": []
    }
  ]
}