{
  "company": "amd",
  "post_count": 68,
  "exported_at": "2026-01-18T17:44:53.256Z",
  "posts": [
    {
      "title": "Questions to ask interviewer to help me stand out",
      "body": "I'm interviewing for my first potential remote position with Allstate Insurance tomorrow, and want to ask good questions when they ask if I have any questions for them. Any suggestions? So far I have these: \n\n-Given that leads aren't provided, are any tools provided to assist in finding leads ?\n\n-Are one-call closings common in this role? \n\n-Are there any certain KPIs (Key performance indicators) that will be used to measure my performance? If so, how often will they be measured?\n\n\n\nThese are okay, but I struggle with this kind of thing, amd the pressure is really on to ask good questions and at least sound like you know what you're talking about. \n\nThanks ahead of time for any and all suggestions!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/wlwxm8/questions_to_ask_interviewer_to_help_me_stand_out/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "In addition to the questions suggested by u/ChienLov3r, I also ask what the interviewer likes about the company (I might word it as “what are your favorite things about working for AllState?”, “what made you initially interested in working for Allstate?”) to get a feel for the culture of the company. As others mentioned you are also wanting to make sure this is a good fit for you, and I always have good success with this question. Good luck!",
          "score": 3
        },
        {
          "body": "Those are great questions.. don't forget about the simple ones regarding day-to-day work life. What are their expectations for the person who fills the role, what might be the most challenging aspect of the job for a new person, what kind of leadership style does the supervisor have? What kind of workplace do they promote?",
          "score": 2
        }
      ]
    },
    {
      "title": "Have an offer from a good company that expires on Monday, my dream company reached back out after 2 weeks and wants to finish the interview process..how should I handle it?",
      "body": "So i had an amazing opportunity that was squashed by the recruiter for the position vanishing off the face of the earth.\n\nI have a inside high up contact there and shes been keeping me updated amd pushing for me. \n\nMeanwhile I got a good offer with a good company and great benefits but it expires on Monday.\n\nToday that first company reached back out to apologize for me basically getting screwed with the recruiter leaving. They have all the info from my 4 interviews and wants to wrap up a last round in the coming days so really excited about that.\n\nSince it's Thursday and the 1st company may not move or offer until next week, do I sign with the first and if that dream one comes up just back out before start date?  Obviously feels like a dick move but at least it would be before my start date and I have to do what's best for me and they are very understanding of that",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/ue2f85/have_an_offer_from_a_good_company_that_expires_on/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Yes, take the offer from the first company and if the company you prefer offers you, then you submit your resignation, assuming you started, for the first company (the shorter you've been there, you'll be asked to leave right away instead of serving a 2 week notice period and burn bridges) or take back your offer.  Yes, dick move as you noted, but know that this kind of scenario comes up at least once a day from other people faced with the same kind of situation.",
          "score": 6
        },
        {
          "body": "Take the offer. There's a whole process post offer that is time-consuming. \n\nAlso, remember these red flags that this dream company is showing.",
          "score": 2
        },
        {
          "body": "Accept the offer and do the interview. Bail if your dream comes through.",
          "score": 1
        }
      ]
    },
    {
      "title": "Finally got a full time job after 5 years of looking. Story inside.",
      "body": "So here is my story (from a cellphone)\n\nI graduated high school back in 2006. I went to the University of Kentucky where I earned my B.A. I double majored in international economics and Japanese language. I graduated in December of 2009. The economy had stroked out and was still doing poorly. I wasn't lucky enough to be one of the people that had jobs calling them. From Dec 2009 until Feb 2013 I was unemployed. \n\nI never understood depression until I became depressed. If it wasn't for family and my now wife helping me through I would have not been able to survive. I applied for thousands of jobs. I had only a handful of interviews. Finally got a job stocking shelves. Realizing they were not going to promote me, like they claimed, I decided to go back to school. \n\nI went back to school this time going much closer to home to save money. I went to Western Kentucky University and earned my M.A. in Applied Economics. Now granted this wasn't easy because I was working now only a few days a week earning less than 100$ each week. My wife luckily had a job but it was only bringing in 3-400$ a week much of which went back into the gas tank. Now i didnt and still dont have internet at home. I used my phone for internet amd had to go early everyday to campus to actually do the majority of my homework. During my classes I had two family deaths to deal with, my wife's nephew and my grandma. I was unable to miss class for any reason in fear of falling behind so the days surrounding those events were tough. \n\nNow in may of 2014 i started putting bread out at my job each morning. Big deal right? Well no actually. The company i work for had taken over the bread instead of having a merchandiser come in to do it. The GM for the original bread company however was still the one that was contacted and dealt through. I was able to do a good enough job that when his normal merchandisor moved i got to take his job working the local Walmart. This guys wife also was a merchandisor for another company so i got lucky enough to land both openings. So since November i have been working 3 part time jobs with 1 side job doing extra bread pull ups. Bringing home 510-530$ a week.\n\nAfter graduating in December. I started looking for a new job because 7 days a week running bread gets old and I would like to use the education I earned/bought. Well this past week I was offered a job as a Forecast Analyst at the corporate office of a nearby company. The pay isn't amazing, i will earn 7000$ more a year than I was earning with bread, but the position is entry level and I can actually earn some relevant experience. \n\nI can finally say that something will eventually happen if you just keep trying. \n\nTlDr: College then 3 years unemployed back to college then 3 jobs now a full time corporate job. Shit gets better just keep trying. ",
      "subreddit": "jobs",
      "score": 69,
      "url": "https://reddit.com/r/jobs/comments/306zb2/finally_got_a_full_time_job_after_5_years_of/",
      "comments": [
        {
          "body": "Wow, congrats dude. Not having a full-time job is the worst and I wouldn't wish it on anyone who needed one.\n\nIt takes a toll on you after a while. I'm sure after you start work, you'll have a lot less stress then before. Just driving between 3 PT jobs sounds crazy.\n\nBTW I used to have two part-time jobs. It was terrible. I drove an hour and a half for one. Then would drive to my second job which was in the direction of where I lived. \n\nI only worked the first job during the week though. So whenever I had to work the second job on weekends I drove like an hour just to make $9 an hour for a 4-5 hour shift. ",
          "score": 10
        },
        {
          "body": "Hats off to you and your perseverance. You're due to start having some good things come your way.",
          "score": 5
        },
        {
          "body": "good for you.  its easy getting down on yourself.  this stuff inspires me and really makes me grateful at times too.  congrats and i hope your hard work pays off.",
          "score": 4
        },
        {
          "body": "&gt; I double majored in international economics and Japanese language.\n\nTo be honest, my first reaction was that this is either an unfortunate combination, or the most brilliantly crazy gamble of saving Japan's economy ever.",
          "score": 3
        },
        {
          "body": "Wow...are you sure you're not me? \n\nI have a BA in economics and an MA in applied economics. I haven't been unemployed but I've been doing administrative assistant-type jobs for really shitty pay. Can I ask what company you're working for?",
          "score": 2
        }
      ]
    },
    {
      "title": "Looking for AMD interview experiences",
      "body": "Hi,\nI have an upcoming interview with AMD GPU team for embedded software profile. Has anyone gone through the process recently? Looking for preparation guide as not much information is present on this online.\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1j04mm8/looking_for_amd_interview_experiences/",
      "comments": []
    },
    {
      "title": "For fellow Canadians who got their first job in the US, how did you go about it? Struggling to start in Canada",
      "body": "Hi everyone, just like every other new grad in CS right now I'm struggling to find full time. I managed to get 2 years of internships during my bachelors (1 year at AMD, 1 year another lesser known company) hoping it'd give me an edge but I'm not finding success at all here in Canada, after around 400 applications I've been given like 4 technical assessments and 1 interview only. While I know I'll be spammed with '400 isnt nearly enough' I still want to do what I can to improve my odds, of course I am still applying and will continue to till I get something.\n\nI have heard its better to look in the US. I was already considering this due to having a lot of family in NY and was applying from linkedIn to both Canada and NYC. I know to check the 'authorized to work here' as yes and to check 'sponsorship needed' as no (then later explain that you're a Canadian and a TN visa is far easier) but despite that I've only gotten 1 response from the US. \n\nI'm sure my resume isn't perfect, but I've had some Sr engineers that I've gotten to know over the years as well as a recruiter I know well look it over and say its quite good for a new grad especially the 2 years of industry experience so I don't think its holding me back.\n\nI've heard someone mention to apply to US from LinkedIn you need to buy a US phone number or you get filtered instantly. Furthermore I've noticed of course my LinkedIn profile has my location as within Canada, I figure I'd have to change this too but currently I'm applying everywhere in Canada and in NY and I worry doing that will then blacklist me from Canadian roles and I just don't know if that's a good idea? I also worry that maybe thats just uneeded steps and has nothing to do with why I'm hearing nothing from the US applications.\n\nAny advice on how to proceed would be greatly appreciated. While I would love to be picky with a job the reality is I'm graduating in a few days and I need income asap to support myself and start my career, at this point I just want to break into the industry idc where or the salary I just need to get my foot in the door.",
      "subreddit": "cscareerquestions",
      "score": 14,
      "url": "https://reddit.com/r/cscareerquestions/comments/1lbicho/for_fellow_canadians_who_got_their_first_job_in/",
      "comments": [
        {
          "body": "It's probably harder to get a job in USA as a Canadian than a job in Canada as a Canadian. \n\nIf you have senior engineers who can help review your resume, can they refer you?",
          "score": 21
        },
        {
          "body": "&gt;I know to check the 'authorized to work here' as yes and to check 'sponsorship needed' as no\n  \nuh... depends on what the exact wording is\n  \nare you legally authorized to work for any employer in US? you answer no\n  \ndo you require visa sponsorship now or in the future? you answer no, UNLESS company say things like \"such as TN\", then you answer yes, my experience is some company consider \"any lawyers involved\" as yes, for those companies just treat it as not a good fit and move onto other companies\n  \n&gt;apply to US from LinkedIn you need to buy a US phone number or you get filtered instantly\n  \nnot needed and untrue, I've done all of my university internships + new grad interview while having my Canadian number, I didn't switch to US number until like 6+ months after my full-time job\n  \nif you're getting interviews then it sounds like your resume isn't the issue, I remember I shotgunned like 800+ applications and that was before covid 2020, nowadays the competitions is probably like 20x more fierce\n  \n&gt;I have heard its better to look in the US. I was already considering this due to having a lot of family in NY and was applying from linkedIn to both Canada and NYC.\n  \nyou do realize NYC is probably the 2nd most competitive tech hub in the entire US (just a bit behind San Francisco/Silicon Valley region), yes? I remember when I was new grad I had like 10+ US cities on my radar, so although most of my applications went to SF region (and is ultimately where I got my offer from), I was ok with other cities too as backup plan",
          "score": 3
        },
        {
          "body": "&gt;I know to check the 'authorized to work here' as yes and to check 'sponsorship needed' as no (then later explain that you're a Canadian and a TN visa is far easier)\n\n\nYou are marking the wrong thing. You are not authorized to work here if you don't already have US citizenship, green card, or an existing US visa. If you don't already have an active TN visa, you are not currently authorized to work in the US. You would need to check Yes for sponsorship needed. It's very easy to get it, but it's still sponsorship because the enployer needs to go through visa process.",
          "score": 2
        }
      ]
    },
    {
      "title": "Embedded Software Developer : Project Ideas",
      "body": "Hello, I am a third year computer science student, my only internship I have is a test developer position I did on an appliance team at a decent company. Through this position I learned what area I want to focus on : I am  targeting roles within embedded systems and OS development, specifically those emphasizing low-level hardware/software integration. (I want to be able to have a hardware product that I will be able to touch).\n\nNow that I kind of have a vague idea of what I want to be I was wondering if anyone could give me some recommended projects in this field that I can work on that will at least make me a better candidate for internships in these positions. Currently, I have been working with some Arduino, esp32, and thats the extent of which I've done things (I realize this is not much which is why I want recommendations). In terms of os, only took a course on it.\n\nI did do an interview with amd for a firmware developer intern position but didn't get the job. I want to be a better candidate (not only for amd but any other similar companies).\n\nAlso would be great if you could tell me what to prioritize on.",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/1oz7lye/embedded_software_developer_project_ideas/",
      "comments": []
    },
    {
      "title": "What to say if asked why I left last job?",
      "body": "Hi all,\n\nI work in tech and had a pretty good job in FAANG. I got fired last month due to poor perfromance. It wasnt a good fit for either side. I was there for 3 years and mistakes were amde on my end and even their end. \n\nTo give some reasons of how it was for my last company. I felt like the company was very 24/7, senior and prinicipal engineers works 60+ hours, taking their laptops everywhere, taking calls on vacation, etc. Even as a Jr Engineer I was working 50-60 hours a week and would've worked more but I wanted to respect my WLB. It had the vibe of do everythign for the company. One of my coworkers left last year and he said the project we were in was the worst organization he ever saw and senior engineers were barely willin gto help junior engineers. The job was remote and they promoted WLB so for the first year I kept it to a 9-5 schedule (sometimes went 9+ hours if needed) but when it came across to me that I was underperforming after a year and a half there, I upped my time and was working 10+ hours almost everyday for a year. Unfortunately I had already dug myself in a bad hole and got a few bad reviews and then got the boot last month. I acknowledge maybe I could've done differently but I will use this experience to be better at my next job.\n\nI have an interview with a hiring manager tomorrow. According to the recruiter, it's just going to be question based to see if I seem like someone who they may like. It's my first interview in 4 years so im a bit nervous. The recruiter said there will be like 5 stages after my meeting tomorrow assuming I pass each one. If tomorrow goes well,a technical interview follows (likely a leetcode question) than a recruiter interview, then an interview with 4 teams, then a team match then a C-suite interview. Online it says that if asked why I left I should keep it short, but im unsure as to what to say exactly.\n\nWhat would you recommend I say if asked why I left? Should I mention I got fired due to poor performance?\n\nAlso as a side note, what is a C-suite interview? Dont think i ever had that.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1inb1k1/what_to_say_if_asked_why_i_left_last_job/",
      "comments": [
        {
          "body": "General rules...\n\n1) Don't badmouth your previous company.\n\n2) Definitely don't badmouth yourself.\n\nSay positive things but that it was time to move on and that you were looking for new opportunities that working at &lt;blank company&gt; can offer based on their tech, or the interesting industry they are in.",
          "score": 18
        },
        {
          "body": "You spend 3 years there, poor performance should be the reason for the first 6 months.\n\nFor what i can see you did your part, and for junior position that's not the best of the environments.\n\nIf they ask, you said you left, that you were putting 10+ hours daily, and it was time for a break and something else.\n\nIf you think about it, is a kinda of a white lie.\n\nAnd hope they white lie about the job and company too, and not straight up lie.",
          "score": 14
        },
        {
          "body": "Rainforest?\n\nFor at least the first month or two, I would apply as if I still worked there lmao. It's close enough.\n\nIf you've already told them you're no longer working there, I would just vaguely say something brief about MANGAs restructuring in January.",
          "score": 4
        },
        {
          "body": "Spin it, find something good about the company you’re applying for that they have that the other one doesn’t have and say that’s why you left.\n\n“I discovered I wanted to have broader impact on my company’s product that I think I can find in a company like Vandelay Industries instead of being one cog in a large system”\n\n“I’m looking for a smaller team where I can get to know everyone instead of a huge department like at Microzon.”\n\n“I really am seeking a place where I can openly talk with leaders like yourself with ideas on improvement instead of being drowned out by the levels of corporate hierarchy”",
          "score": 4
        },
        {
          "body": "Had sex with the cleaning lady",
          "score": 3
        },
        {
          "body": "C Suite interviews are interviews with the people of the C Suite (CEO, CTO, etc)",
          "score": 2
        },
        {
          "body": "3 years is a long time in a tech job, no issues with moving on to something else to grow",
          "score": 2
        },
        {
          "body": "Tell them you outgrew the role and there were no internal opportunities to advance at the time. Say you were interested in technology “X” and they would never consider implementing it due to their technology stack, you noticed their job description mentions technology “X” and it really piqued your interest and aligns with your career trajectory.",
          "score": 2
        },
        {
          "body": "Same thing as always: While the work was interesting, you wanted a new challenge that allows you to bring more value to your company.",
          "score": 2
        }
      ]
    },
    {
      "title": "Recruiter told me to ask for the job",
      "body": "I just got to the 5th and final round of interviews for a SWE position I really like the sound of. The recruiter told me it's be a fantastic idea to ask for the job at the end of the interview because it shows I want the job and also shows confidence, enthusiasm, and clarity about your interest in the role. But I'm not sure how to phrase it. Do I literally say like \"id formally like to ask for the job\"? I've never been in this position before, in the past I always got an offer after a couple rounds amd never had to ask",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/1khay9g/recruiter_told_me_to_ask_for_the_job/",
      "comments": [
        {
          "body": "Seems odd. It’s a 5th interview, you obviously want the job..",
          "score": 21
        },
        {
          "body": "You can politely reaffirm your interest in the position and how you'd be excited to join the company.",
          "score": 11
        },
        {
          "body": "Sounds like terrible advice lol",
          "score": 5
        },
        {
          "body": "It sounds like someone with a background in sales switched careers to recruiting. “Ask for the sale” is drilled hard into new salespeople everywhere.\n\nA classic sales pitch ends with a nudge like “so let’s go check you out” or “how many can I put you down for?” It’s pushy but it works. Your recruiter might think “ask for the job” is equivalent advice.\n\nSure I guess? It’s a little weird though because in a technical interview you’re never going to close the deal with a handshake right there. It’s always a call back later or the next step in the process.\n\nI wouldn’t get hung up on this. It’s odd advice. You do you.",
          "score": 5
        },
        {
          "body": "Maybe you can prepare something on why you are excited about the role and the company.\n\nDon't say the obvious stuff about the company. For instance, if you are interviewing for Meta, you can't say I like using IG because millions of people use IG LOL Try to do some research to come up with something you are really excited about.\n\nAlso, mention what you bring, and for that, just look at the job post and make it more relatable without repeating your resume.",
          "score": 1
        }
      ]
    },
    {
      "title": "Does anyone know what AMD's online assessment test for software internships are like?",
      "body": "I am in contact with a recruiter for a software engineering internship at AMD. He told me that before the interview round, there will be an online assessment test which I'll have to give. Does anyone here who have recently applied for software intern position at AMD let me know what these online assessment will be like?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1jpne88/does_anyone_know_what_amds_online_assessment_test/",
      "comments": [
        {
          "body": "Your best bet is to practice on platforms like LeetCode, HackerRank, or Codewars. Focus on common data structures and algorithms, and try to simulate a timed environment to get used to the pressure.  Don't stress too much about the specifics – solid fundamentals will carry you far.\n\nPreparing for the unknown can be unsettling, so focusing on what you \\*can\\* control is key.  Sharpen your coding skills, review core computer science concepts, and practice explaining your thought process clearly.  If you're looking for a way to practice answering technical questions and navigating tricky interview scenarios, you might find [interview prep](http://interviews.chat) AI helpful. I'm on the team that built it, and we designed it to help people ace their interviews.  Good luck with your AMD application!",
          "score": 3
        }
      ]
    },
    {
      "title": "Going to final round at top company for position I’m not particularly interested in, at a rate that’s negligible from my last job, should I move forward? How bad would it be to accept and then quit within a few weeks for a better position?",
      "body": "So I was a contract engineer in a middling seniority position at my last job at a top 5 prestigious company, I did great work but after 2 years I had to go, and I didn’t feel motivated to apply for an FTE at the company even though my bosses encouraged me as I just didn’t care for the company although the perks and pay were excellent for where I was in my career I think.\n\nThe recruiter from my last job reached out with a new opportunity at another top 5 company, which is very attractive, but, the contract company is only offering a 2.5% raise over my last job, I assume since they knew my previous salary. I asked for a bump up to 9% even though that was higher than the upper limit they said they could offer, they said they could make that work, I’m about to go into a final round and the recruiter just said they haven’t gotten final permission from the hiring company but said they could get it, and asked if I’m willing to move forward with just the 2% for now amd sort out the difference after a couple weeks. This has moved extremely quickly so I can believe that, but tbh I think it’s odd for them to come back with this question after saying they could make the higher rate work (esp given that their profit is whatever the difference is between my pay rate and what they charge the company and they make a lot of money from that).\n\nThe thing is, 1. I don’t know I actually want another contract position, if I’m honest being a contractor absolutely sucked compared to when I was FTE in my last last job, and you were constantly reminded of being a second class citizen even when you might be better than your FTE peers 2. I’m interviewing with other places who are offering a *lot* more money and FTE positions, like anywhere from 50 to 100 percent more on what’s admittedly already an incredible income, but, I’ve taken my time leisurely since my last contract ended a couple months ago because I wanted to enjoy the holidays and travel a bit, and I’m a bit worried how long it can take to get a job, how bad is the market? I haven’t really been looking but my LinkedIn still gets a lot of views and a couple recruiters reaching out each week usually. I assume I’d basically never be invited back to this company if I accepted a job and then quit after 2-4 weeks if a future interviewer there ever figured out I had done that.\n\nWhat does /r/cscareerquestions think?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1iuz413/going_to_final_round_at_top_company_for_position/",
      "comments": []
    },
    {
      "title": "AMD offer via TCS",
      "body": "The below post is from a friend’s perspective.\n\nI cleared 3 interview rounds with AMD for ML Engineer role. They want to hire me through TCS. I cleared the first TCS interview with all AMD interviews and had the next round 2 weeks ago. The interviewer asked me completely irrelevant questions to the job description provided as well as wasn’t able to pronounce the name of an algorithm that they were expecting me to answer with.\n\nThe AMD HM has already told that they will be disregarding the outcomes of the TCS interview since they are highly satisfied with the AMD interview rounds outcomes. However, since I’m going to be hired on TCS’ payroll, there has been a 2 week delay including Thanksgiving holidays.\n\nWhat would be the best advice forward? The AMD HM assured me that they are handling proceedings but there has been a long delay and I am a little worried that they might be considering other TCS candidates. What can I do? Should I push back through the AMD HM onto TCS or should I push back onto TCS directly or should I just do nothing?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1h683rd/amd_offer_via_tcs/",
      "comments": [
        {
          "body": "Nothing you can do. You wait. Good luck.",
          "score": 8
        },
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "lol \"ta ta!\" (farewell)",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm angry bro.",
      "body": "I'm angry that hard work is barely paying atm in this field. I'll be shameless here and say that the other final year students in my college are getting placed at much higher packages than I am because they are cheating on online tests (don't even question how i know this, these people brag about how easy it was for them to get that job by cheating in online tests) or because of nepotism. You have no idea how fucking stupid these people are irl.\n\nAnd I took 4 months, built a project in a team of 4 members in which I did all the work because the others didn't care enough. I'm like that stupid honest hard worker in films that's always left behind and laughed at.\n\nI'm also realising what a snake everyone is. My own flatmate got the news that an interview was being conducted in our college campus, we were not sent any email by the college, only select students whose parents are wealthy were called into this interview. My flatmate left silently amd didn't even fucking tell me about it cuz he knew id become his competition and ive been preparing hard.\n\nI've decided to do competitive programming in a real fucking competitive manner now. I hope in some time I'll surpass some of these idiots. Yeah this a rant. And those of you who have experience in this field, you should share your views.\n\nEdit: Yeah well done downvoting this, I bet you've cheated like these lowlifes and don't like being criticized.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/r5exrm/im_angry_bro/",
      "comments": [
        {
          "body": "CS is one the most merit based profession, you can get interviews with Google with a referral but if you can't LEETCODE, they aint accepting that person even if they have a PHD from Stanford or Harvard. Compare to Finance, Accounting and Medicine those are really HUGE on nepotism. You chose the right profession with CS because here its mostly about your skills as in Big N companies",
          "score": 26
        },
        {
          "body": "My experience is that you'll be less jaded when you aren't a student anymore. Literally all this crap is competition for entry level that you don't have to deal with after a couple years of experience",
          "score": 16
        },
        {
          "body": "[deleted]",
          "score": 6
        },
        {
          "body": "People gonna do what they gotta do to get ahead. The ones that can pull it off will last, the rest won't. Focus on being one of the ones that lasts. Once you've got a couple years of experience it's really pretty easy. Demand for experienced engineers is massive right now.",
          "score": 4
        },
        {
          "body": "Honestly your post reads as if it was written by a child.   You sound severely emotionally stunted. Worry about yourself. Stop discussing other people. Focus on getting a girlfriend",
          "score": 3
        },
        {
          "body": "Leetcode is the game man , i came from a tier 3 college and still got in uber after few years in usa. Noone really cares where you came from , only leetcode matters .",
          "score": 3
        },
        {
          "body": "You have a better chance of being successful than them in the long run. These things happen, bide your time, learn from it and move on.",
          "score": 2
        }
      ]
    },
    {
      "title": "Getting hired as a remote frontend developer",
      "body": "Message to mods: This is a crosspost from my blog, but I've removed all the links to my own content.\n\n# Disclaimer\n\nThis post is about getting hired in Europe. Hiring practices in other parts of the world may differ. This post reflects my personal journey and is by no means a definitive guide to getting hired.\n\nAround eight months ago I started feeling like I'm stagnating at work. My commute was also seriously wearing me down. And because I was already enjoying 2 days of homeoffice per week  I decided to try switching to a fully remote position.\n\nAt that moment I had already received and declined a couple of offers from local companies and as a result felt pretty confident in my skills.\n\nI was wrong.\n\n# Competition is heavy\n\nWhen applying to remote positions you are essentially competing with hundreds of different candidates from around the world. Some of them will have more experience. Some of them will have impressive open-source contributions. Some of them will have serious background in design. And some of them will have much lower salary expectations because of their location.\n\nSuddenly what was considered impressive in your local job market becomes average at scale.\n\nI never struggled with being hired in my life so the barrage of constant rejections was totally new to me. I became really discouraged by these rejections and even thought about giving up on this idea altogether. I thought maybe I [don't have it](https://www.youtube.com/watch?v=C13JC_YP2Q8).\n\nJob-hunting requires a completely different mindset though, let's call it \"dungeon grinder\". You wander into the dungeon with basic gear, die, lose nothing but gain valuable experience in the process.\n\n&gt;The idea is that you [apply to roles you may not even want](https://www.reddit.com/r/cscareerquestions/comments/amuqhq/in_response_to_a_common_question_a_success_story/) just to score an interview or two, then go on those interviews as a way of getting familiar with the interview process and the kinds of questions you'll need to be able to answer\n\nThis quote  sums it up pretty nice.\n\n&gt;You can learn so much on the internet for the low price of your ego\n\nYou'll have to grow a thick skin though. Prepare to be rejected without feedback via automated email messages. Prepare to be ghosted. Prepare to be ignored after you wrote a perfect cover letter where you describe your favourite science fiction book (yes, it was one of the questions).\n\n## The interviews\n\nI am talking about senior positions here. In fact, junior remote jobs are very rare and I wouldn't recommend it anyway.\n\n&amp;#x200B;\n\n**Things I did NOT encounter:**\n\n* Leetcode/Hackerrank challenges\n* Tricky questions about prototypes, events, closures, `this` etc\n\n&amp;#x200B;\n\n**Things I encountered:**\n\n* General functional programming questions\n* General system design questions\n* Practical event loop exercises\n* Some OOP design\n* Describe a challenge you encountered and how you solved it\n* Describe different CSS methodologies and their pros and cons\n* Why are ES6 modules better than CommonJS/AMD?\n\n&amp;#x200B;\n\nMost of the frontend developer positions required React knowledge, so I was also asked some [React-specific questions](https://medium.com/@baphemot/a-react-job-interview-recruiter-perspective-f1096f54dd16) about immutability and different state management strategies. Many wanted to know how I feel about Redux.\n\nI was also asked how I would approach debugging and fixing a performance problem in a React application.\n\nMost of the interviews also involved 1-4 hour take-homes. These take-homes were usually pretty reasonable, like creating small single-page applications which meet specific requirements. Some of them required a candidate to not use any frameworks. Some required usage of Redux and redux-saga. Once I was asked to use styled-components and React Hooks.\n\nOne of the most popular questions I got after completing a take-home was \"How would you scale this?\" or \"What would you change if you had more time?\".\n\nOverall I felt like the whole process was not as \"broken\" as we often read online, although I did encounter some questionable stuff along the way. For example one company invited me to their slack workspace with 100 other candidates and an #introductions channel. And everyone was sitting there writing stories about how great they are compared to others.\n\nAnother company only wanted candidates with \"25+ stars github repo\".\n\nMy main problem though was the following: *I just wasn't as good as I imagined*.\n\n## Frontend+\n\nYou will get bonus points if you have another field of expertise. Here are some of the combinations I've encountered:\n\n* UI/UX + JS\n* Ruby + JS\n* PHP + JS\n* AWS stuff + JS 🤔\n\nSo typically experience in some backend technology (Node, Ruby, Python, PHP) or having an \"eye for design\" will open up a lot more options for you.\n\nFramework knowledge is almost always mentioned and React is dominating this space. I don't have the exact numbers, but you can go to [weworkremotely](https://weworkremotely.com/remote-jobs/search?utf8=%E2%9C%93&amp;term=frontend) and compare search results for different frameworks.\n\n## Sticking out\n\nAfter accomplishing nothing for several months I decided to take a look at my resume from outsiders perspective. It wasn't that impressive after all. I had one large challenging project available online, but that's it. Others were mostly intranet apps and I didn't mention them in my resume, which in hindsight was wrong.\n\nI also didn't have any significant online presence and notable side-projects. All in all I didn't really stand out from the crowd.\n\nAfter reading [this great blogpost](https://www.swyx.io/writing/learn-in-public/) I decided to adopt a different mindset and created a very unoriginal plan.\n\n* Learn\n* Revamp my resume\n* Fill my github profile with some notable projects\n* Create personal website with a blog\n* Prepare and record a meetup talk and publish it on youtube\n* Send a conference talk proposal\n* Network\n\n## Resume\n\nI basically removed all the unnecessary junk and tried to squeeze out the most value out of the projects I participated in.\n\n* Recorded screencasts of projects that weren't freely accessible\n* Described in more details what I accomplished and which technologies I used in these projects\n* Removed any mentions of my nonexistent CS degree\n* Completely removed the \"skills\" section\n* Removed any mentions of bullshit jobs I did at the start of my programming career\n\nIn the end I reduced my resume to a single page.\n\n## Networking\n\nWe as programmers often neglect the power of networking. What the hell is networking anyway?\n\n&gt;the action or process of interacting with others to exchange information and develop professional or social contacts\n\nThe first thing I did was I found this incredible [Reactiflux](https://www.reactiflux.com/) Discord community. There I sought advice about my resume and career in general. I also asked questions about functional programming, React internals, Redux, TypeScript and a bunch of other things. From time to time I also managed to be helpful to others.\n\nSomeone suggested me to create a Twitter account, which I though was stupid at first, but in the end turned out to be a great advice. I started using it as a technical notebook where I express my thoughts about things I learn and build.\n\n## Hooks\n\nAround this time React Hooks were announced and I became completely fascinated by them. I began experimenting. It will probably sound funny, but for me the announcement of Hooks was the catalyst for becoming a better developer. I acquired tremendous amount of knowledge in the process of learning how they work and how they can be used and also experimented with a bunch of different technologies.\n\n## Going an extra mile\n\nWhen I noticed that Company X was looking for a remote React developer, I became kinda sad. I've been a regular user of this app for several years because of my cycling addiction and always admired how it was built. Working at such a company would be a dream coming true, but I just wasn't sure I was good enough.\n\nSo to test myself I decided to build a small app where I'd replicate some of Company X functionality. Companies love it when you create projects specifically tailored to getting their attention. You also have more chances if you have someone \"on the inside\".\n\nI sent a link to their senior javascript developer on Twitter and was immediately invited to apply to this position. My previous \"interview training\" helped me greatly to complete a \\~4 hour take-home and do two zoom interviews with cofounders.\n\nI am starting in May.\n\n## Random thoughts\n\nBeing good at tech is not enough for remote work, you also have to be a good communicator. You'll need to show your potential employer that you are responsible and have great self-discipline. Your employer is essentially *trusting*  you to do a good job.\n\nI preferred fully-remote companies when applying, because they are usually better at this whole asynchronous communication thing. Being one of the few remote developers at a company without remote culture can be challenging.\n\n## Random links\n\n* [Remoteur](http://remoteur.com)\n* [weworkremotely](https://weworkremotely.com)\n* [Reactiflux](https://www.reactiflux.com/)\n* [What the heck is the event loop anyway?](https://www.youtube.com/watch?v=8aGhZQkoFbQ)\n* [Questions for your interviewer](https://gist.github.com/vcarl/14275c72baf976ff1665392e14225dcc)",
      "subreddit": "cscareerquestions",
      "score": 107,
      "url": "https://reddit.com/r/cscareerquestions/comments/bdsv1g/getting_hired_as_a_remote_frontend_developer/",
      "comments": [
        {
          "body": "Some info on the rates would be nice too.",
          "score": 13
        },
        {
          "body": "You built a custom part of their system and still had to take a 4 hour take home?",
          "score": 7
        },
        {
          "body": "Really good article. I would also appreciate if you describe about salary.",
          "score": 10
        },
        {
          "body": "This is really helpful and really well written!  Thanks a ton!\n\nI'm assuming you're Latvian based on your name?",
          "score": 5
        },
        {
          "body": "Thanks for the post, I'm looking into working remotely and this helps a ton, especially the links",
          "score": 2
        }
      ]
    },
    {
      "title": "I finally did it guys...8 months later",
      "body": "First things first, im on mobile, sorry for formatting. \n\n\nI was never a coder in highschool, most we did was VB and HTML (yaya not a programming language). \n\n\nI chose Computer Science at a relatively new tech based University not knowing what I was getting in to. \n\n\nI chased my degree while juggling 2 blue-collar jobs. \nI failed. After 2nd year they kicked me out after probation.\n\n\nI chose a college to go to instead. I stuck with software dev because I wanted to get better. I wanted to understand it. Chose a degree program and began my journey. Became a proper student.\n\n\nI was one of the best in my classes, but I get some serious anxiety writing tests and exams. My GPA was .3 below the required GPA for Co-Op. Even though I had all my credits, I couldnt take co op and because of being .3 below I wasnt able to graduate in my Bachelors of Science (Honours) program without staying in school for another year and getting nothing shy of a B.  The only way I could do that was if i took longer than a year and took a lighter course load. I was tired at this point. Tired of working labour jobs, tired of school. \n\n\nI switched to a diploma, got the 3 credits I needed and finished by January 2019 and have been applying non stop since.\n\n\nPrior to that I had 2 interviews, which didnt go well.\nI mustve sent out at LEAST 300 applications. Many of them to the same companies I tried already for the same posting. \n\n\n\nMy first actual interview out of school was a great experience. It gave me a real understanding of the technical aspect. Its all about how you approach the solution, but I could tell I wasnt experienced enough for them\n\n\n\nI bombed a few technical phone interviews. Fucking basic SQL queries, that was embarrassing, but its just something about those that make uou forget everything youve done the past 5 years.\n\n\n\nThere was a teaching position I was ecstatic for. I made it to the final interview, which was supposed to be a meeting with the director because youre pretty much in at that point.. My interview was scheduled for 2, I get an email at 12:30 saying theyre cancelling my interview because they had found their candidate.\n\n\n\nI even applied for one of those \"training+deployment\" companies. But apparently the position I applied for didnt follow their normal style. I was brought in for a specific client and I wasnt part of the deployment team until I got the job at that client. I felt really good coming out of thag interview except for the end when I fucked up the easiest question (\"how do you call a function in JavaScript\"). I left the interview amd askes the accounts manager whether or not Im still part of their team if I dont get the job with their client and was told yes... Until 3 weeks later when i rejected some opportunities I find out the client didnt choose me AND Im not part of their team.\n\n\n\nThings were getting rough. Financially, emotionally, physically. It was fucked. I was depressed and ready to shoot myself. So many negative thoughts.\n\n\n\nFinally one day I said fuck it and started applying again. Still seeinf big companies hiring for the same position they were 4 months ago. \n\n\n\nAnd 2 weeks ago I get a call from one of the applications I dont even remember sending. Ive neber even heard of the company. The 2 phone calls went well and they invite me on site.\n\n\n\n The ONE thing I did different for this interview is....I didnt study. I didnt review  .net terms, I didnt practice my sql/linq. What I DID do is that I noticed 2 things in listed on their requirements (ArcGIS and Dojo) are things only certain ppl would have experience with. So instead of me going in the interview and saying \"nope never worked with it\" I spent my 2 days before the interview playing around and understanding those 2 things. I made a shitty half-working as intended application using those tools and made some jokes with the Sr. Dev about how \"fun\" debugging this stuff is. I felt good in the interview but on my walk out the HR ppl scared me.\n\n\n\n\nToday its official, I start next week.\nWords cant express the relief in me. \n\n\n\nIf I can do it, so can you. I have like 30 different versions of my resumes until I finally made the one that got me results. I failed multiple times. Just dont lose hope, if you feel somethings not working adjust yourself. Youre a developer sure, but you gotta develop yourself first.\n\n\n\n\nThat being said:   can someone give me an idea what to expect on my first day/week? This is my first time in a developer position in a professional environment",
      "subreddit": "cscareerquestions",
      "score": 43,
      "url": "https://reddit.com/r/cscareerquestions/comments/ddahsw/i_finally_did_it_guys8_months_later/",
      "comments": [
        {
          "body": "Only 8 months? Man, some people have all the luck.",
          "score": 20
        },
        {
          "body": "Great, now the real challenges begin.\n\n1. You get paid to do your employer's work, not to fulfill your dreams. Do what is given to you. Particularly deal very carefully with your supervisors and superiors. leadership and management is mostly full of insecure people.\n2. Ask. get clarifications. do not assume anything. programming isn't just about DS and Algos and Big O. Programming is about understanding the business, the industry, enterprise scale operations.\n3. Information Technology is a vast industry, and a bit of every other industry. as the saying goes, there are two kinds of people - masters and slaves. programmers are slaves. managers and leaders are the real masters. they promise on deliverables, they demand, you supply, they earn the credit for fulfilling their promises. learn to switch away from programming and into leadership and management within the next 10 years, and try not to be an insecure person when you grow up your career ladder into management.\n4. make friends, build a network. most importantly live a life. you are probably allowed up to 2 years in the upcoming 10 years to spend your personal time into your work that pays, and another 2 years into learning future programming trends and stuff, just to stay employable. otherwise, start an interesting hobby, find a significant other, get married, build a family.\n5. earn, save, invest, wisely. do not take bad mentorship - if only i had not listened to some idiot a decade ago, \"technology is a challenge, conquer it\". unnecessary suggestions waste your time.\n\nGood Luck. Live long and Prosper, young padawaan!!!",
          "score": 21
        },
        {
          "body": "#SUCCESS!\n\nRule #1:  Do NOT hang around in the kitchen too much during your first month. \n\nRule #2:  Don’t be the first person to leave work during your first month.\n\nRule #3:  Know the art of “Kissing Ass”\n\nlol",
          "score": 8
        },
        {
          "body": "This was a really inspiring read. I'm a senior in college, and I'm constantly worried about the job search. It's tough, but it's a numbers game. \n\nCongratulations by the way! With that kind of dedication, you'd be a great person to work with.",
          "score": 3
        },
        {
          "body": "Hey that's great to hear. Congrats! Keep it up and Work hard! good luck.",
          "score": 2
        },
        {
          "body": "Dang 8 months!? Nice. I’ve been applying since January this year. Got rejected quite a few times but at least I know my shortcomings and weak points. Also tweaked my resume last night and created a new, more responsive and agile portfolio. Taking a course on handling data structures and algorithms and coding problems from scratch without looking up solutions. Man. I’m doing what I can but it’s discouraging some times. \nWhat sites do you apply on btw?!",
          "score": 1
        }
      ]
    },
    {
      "title": "How to get that first big job (hopefully in fintech?)",
      "body": " \n\n9 months into my first job and I feel like I'm in a rut. Here's a little background experience.\n\nGraduated from undergraduate with a 3.97/4.00 GPA in Computer Engineer and minor in Mathematics and computer science. Had both hardware and software engineering internships, done freelance software work for 3 different startups, had club leadership experience, plus on my own time, I have been developing a personal automated stock trading program. I feel like I have done everything I was told to do by recruiters, but regardless, I was overlooked by every company I wanted to go to. I applied for probably 25 comp. eng. positions at Intel, NVDA, AMD etc and didn't get a single interview despite being in probably the top 5 or 10 in my class. But not being specifically compute science, it was difficult getting a SWE job because degree was only semi-applicable.\n\nI ended up getting a job as a developer at a Electronic Health Record company. Its a decent salary, but I don't like the location, or work culture, or codebase. But more than not being satisfied with the job itself, I feel like to get a FAANG job, you almost have to have a FAANG job. If you don't have another impressive job on your resume, you won't even be considered for the next impressive job. My failure to get a job at an elite company out of graduation really hindered my ability to set myself apart.\n\nIdeally I would love to pivot into a fin-tech position, (dev or quantitative developer at Citadel is my dream position right now). Does anyone know how I can get there?\n\nSpecifically if anyone works at Citadel that would be willing to talk, I would LOVE to connect. I've reached out to about 30 people at Citadel on LinkedIn and no one has answered.",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/nvvbm2/how_to_get_that_first_big_job_hopefully_in_fintech/",
      "comments": [
        {
          "body": "Besides referrals, the most clear-cut way to get to highly selective companies is to work at more and more recognizable/reputable companies (whether internship/fulltime). Finance places in particular I think are hard to crack if you don't have faang on your resume since they're smaller and just don't have the bandwidth to interview more people.\n\nIf I were in your position and dead set on eventually joining Citadel or similar, I'd probably consider seeing if I could land an interview/job at G/F. In my/friends' experience, having that on your resume/linkedin profile is enough to get unsolicited recruiter messages from finance recruiters. IMO faang is also just a pretty good job to have as a software engineer.\n\nYou could try to apply directly to the finance places in the meantime, but I wouldn't get my hopes up.\n\nRegardless, you should of course at some point become very good at leetcode if you aren't already to be able to pass the interview.\n\nI don't work at Citadel but am somewhat familiar with them and the industry in general; I could do my best to answer questions if you have any; maybe in a pm.",
          "score": 8
        },
        {
          "body": "I graduated as a computer engineer too and recently got a $260k per year job straight out of college. I made videos about prep for this: the most recent one at [https://www.youtube.com/watch?v=H5fWYayNHVU&amp;t=27s](https://www.youtube.com/watch?v=H5fWYayNHVU&amp;t=27s)  \n\n\nBasically the gist of the last video is that the most important things to focus on are your project portfolio, prepping for algorithmic coding interviews and bar-raiser / exec interviews, and optimising CV for both computers and humans. Some great resources for the coding interview are LeetCode and AlgoExpert but I go in to more depth in the vid. Good luck in your search :)",
          "score": 7
        },
        {
          "body": "I got multiple final rounds and offers from the top quant funds, not citadel (not sure why you got your heart set on them, there’s a lot of others paying the same or more, with better wlb) but I think my experience still applies. I didn’t have referrals, I applied on their own websites. I won’t name the companies I got final rounds and offers from, but all the companies I applied to were: jump trading, Hudson River trading, D.E. Shaw, two sigma, Jane Street, five rings, citadel, DRW\n\nFirst, make sure you’re actually prepared for the interviews. These funds have the toughest interviews out there, even tougher than FAANG. The problems are not leetcode and you have to be a genuinely solid programmer and a great problem solver to make it through. You’ll have to design stuff you’ve never designed before like a basic game AI. Once you apply, you won’t have time to prepare, the process moves fast. I actually interviewed and got offers from FAANG before interviewing at the quant shops as a warm up/backup, and to gain confidence.\n\nSecond, you don’t need FAANG on your resume to interview there(maybe citadel, but the others, not so much). I went to an average, top 50 school and got a non CS degree, and a no name startup job out of school(after learning programming), and I got interviews(I had a wide range of skills than average that spanned platform, devops, and backend, which I think helped a lot). I do believe your experience of 9 months is a bit short, you need probably around 1-1.5 years minimum if not more, I had 2.5 when I started applying back then. Not going to elite companies out of school doesn’t matter at all so don’t beat yourself over it. Building skills after school and growing matters. Also, you should be located in the city to increase your chances. They’re not gonna fly out people here who are average in resume. \n\nDon’t bother reaching out to people at those firms on LinkedIn, our LinkedIn inboxes are absolutely flooded with people like you. Most people active on LinkedIn don’t even put that they work at these quant shops(unless they’re looking for a new job) just to ease the recruiter/referral seeker spam. \n\nAgain, I can’t emphasize enough how difficult the interviews are. If you don’t think you’re ready, then don’t apply yet. If you fuck em up really bad, you’ll get perma blacklisted. Try getting some offers from the easier FAANGs like Amazon and if you pull it off go from there. If you can’t get interviews at FAANG, reach out to recruiters on LinkedIn or by email. After around 1-1.5 years, big companies will interview anyone, so long that your application lands on a recruiters desk. if you don’t get interviews and also don’t get explicitly rejected, it most likely means your resume is buried too deep under the resume pile and no one saw it. \n\nGood luck, but don’t beat yourself up if you don’t get in. It’s very tough to do so. To this day I still have a hard time believing I did it. Lots of people get rejected and very very few make it. FAANG is a much more realistic goal to shoot for",
          "score": 3
        },
        {
          "body": "Others have said it, but I will parrot as well. Quant firms are extremely small compared to tech companies so getting into the pipeline is very difficult. A company like Bloomberg will allow you to get your foot into the door a lot easier with quant firms, but I imagine places like Google and Facebook will be good for that too.\n\nI recently had an interview with Citadel and the team lead very casually told me that all the team members work 50-60 hour weeks, and that was for a development position, just be aware.",
          "score": 4
        }
      ]
    },
    {
      "title": "How do i tell my boss I'm leaving the job after one month of work? Am i and a$s++ole for that?",
      "body": "Hello, im sorry it'll be long, you can skip to the questions at the end if you get tired.\n i am a fresh graduate with master's engineering degrees in France. I've been looking for a job for 4 months after my graduation and i finally could get one by the end of December. And now i want to leave.\nAfter i started the job i realized that it's not the right career move for me on the lobg term.\nI'll explain, the job is in verification and validation, which I didn't know what exactly they do until I started working. I didn't have any idea what it is but since it was in a sector and in a field that interests me i just accepted since the biggest problem for me was the lack of experience. They actually said that it will be in V&amp;V and asked if I'm really okay with it, but since i was desperate and didn't know what it is exactly i just said yes.\nHowever right after starting the job when i was learning from the girl and guy I'll be replacing i found out that this kind of job is a stable one however, it doesn't give you the needed skills and experience you'll need to switch to developper job or something outside the bubble of V&amp;V, also the project is messed up and it's not well organized and the team just keeps putting patches on the problems instead of solving them. The team members seem nice but the upper ranks don't really give a sh+t about what you want to work on. A lot of these problesm and others made a lot leave the team and company as a whole. Most people started like less than a year ago because they keep changing the employees since they don't give them any importance. ALSO, the salary doesn't change much no matter how experienced you are, and not much room to evolve.\nHe i started to think that even if i stay to get experience it'll be hard for me to even find another job in development since i am already not that good but almost enough for a fresh graduate, amd if i get two years of experience in v&amp;v which doesn't help at development it'll just make it harder to switch and I'll find myself in a trap. (Which is exactly what the two that left explained to mw, that all the offers they get are in v&amp;v)\nAlso, it feels like they accepted me just because they had a vacancy and no one accepted the offer and they only had 2 weeks to find a replacement so they just got me. And when i expressed a bit of my disappointment i felt like they were bitter (which is normal) and am afraid they'll look for someone to replace me, and they're letting me be now just because they can't find anyone that'll accept their salary and shi+ty job.\nFinally, i actually got accepted in the same company for developer job with another team in a different city but this manager pulled strings to get me and fill the urgent vacancy which made me disappointed tbh.\nThe positive things: they actually accepted me even without experience. The employees are nice tbh except some of them. I am learning (but mothing that will be useful outside this company since everything is things only them are using. ). They actually DID NOT lie about the nature of the job or what am gonna do. So it's on me that i did choose something without much thinking.\n\nNow i might get a job in another company (I'll have my last interview tomorrow), in the same field but different job, it's in development and it's a company where the evolution of career is possible unlike my current one.\nThe salary is kind of the same. But it's not very important for me at this stage. It's more about learning things I'll be actually using if i leave the company later and will get me to evolve.\n\n++++++++++++++++++++++++++++\nThe questions:\nHow do i bring it to my manager and the director that I'll be leaving one month after starting? Especially i already spent a mobth learning the job environment and stuff and i just started being productive with the team?\n\nAlso, they have engagement with other companies and if i leave they'll have it very hard to find replacement that'll have to take time to learn the job again and deliver. \nThey're already salty that the two before me are leaving before finding the second one that will work with me. And when i spoke with them earlier about not liking the job, i told them that I'm actually not leaving the company and that I'm just expressing my desire to get better opportunities in the future with the company and they said :ok we'll count on you.\n\nThe questions again:\nWill it be too much for me to leave now? How do i do it in the best way possible? Should i leave or stay? Should i prioritize my future? Or is staying better for the future and am not seeing it? I'm usually a very loyal guy and don't like these things, i actually turned down a lot of offers that came after joining the company but now I'm thinking seriously that I'll have to leave.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/saro5r/how_do_i_tell_my_boss_im_leaving_the_job_after/",
      "comments": [
        {
          "body": "jobs arent slavery, you wanna leave for a reason. Making that decision doesnt make you an asshole. Your employer failed to make you wanna stay. Its a two way street.",
          "score": 13
        },
        {
          "body": "Alright, you had me lost fairly quickly with that wall of text, so I skipped.\n\n&gt; How do i bring it to my manager and the director that I'll be leaving one month after starting? Especially i already spent a mobth learning the job environment and stuff and i just started being productive with the team?\n\nYou just do. It is a professional relationship in which both parties can end. If you don't want to work there then you have no obligation to work there. Sure, it might suck that you're leaving once you're getting productive, but that's how it goes from time to time.\n\n&gt; Also, they have engagement with other companies and if i leave they'll have it very hard to find replacement that'll have to take time to learn the job again and deliver.\n\nThat sounds like a whole bunch of \"not your problem\". They have clearly lost several people and rather than improve in a way that makes people want to work at this place they clearly just want to operate as normal.\n\n&gt; And when i spoke with them earlier about not liking the job, i told them that I'm actually not leaving the company and that I'm just expressing my desire to get better opportunities in the future with the company and they said :ok we'll count on you.\n\nWell, not a great look for you. Is it asshole'ish to say you're not going to leave and then leave? A little maybe. Then again, this is a professional relationship and everything that is not in writing can change on a whim. How many companies out there has said \"Oh no, we're totally not going to fire you guys\" and then the next week terminate half of their workforce.\n\n&gt; Will it be too much for me to leave now? \n\nNot sure what you're asking here.\n\n&gt; How do i do it in the best way possible? \n\nBy being direct and honest.\n\n&gt; Should i leave or stay? \n\nIf you're not happy where you're working and your finances can handle you leaving, then you should leave.\n\n&gt; Should i prioritize my future? \n\nAways, unless it makes the present suck. Live now, plan for the future.",
          "score": 6
        },
        {
          "body": "1) If you don't like the job and don't see prospects of things changing - leave. You'll make no one good by staying at the job you don't want to do. Your employer will either find someone in the end who will fit the position or they'll realise that they need to change something about it. Also I'm assuming you're on some kind of trial at the moment, so it should be even less of an issue.\n\n2) You should just say straight forward to your manager that you plan to leave. Yes, you've made a mistake of accepting without thinking, you can apologize for that to be polite, but the less beating around the bush you do, the more time you will save for everyone. It will be hard, I can tell this being \"loyal to the company\" guy before myself. But in the end it'll be mainly you to live with the decisions you make, and in this case all you can do to minimise the harm is to not waste more time.\n\nI probably make it sound like you shouldn't care about the damage you cause to others. But that's not the case it's just that leaving ASAP in this case will ensure minimum damage to everyone.",
          "score": 1
        },
        {
          "body": "I mean I would just be honest and tell him that it's only been a month and you can already tell it's not going to be a great fit, and in the interests of not wasting any more time than you already have you are going to leave. \n\nThat being said, it sounds like this is your first job out of academia, perhaps you are misunderstanding something or have the wrong impression about the job? It might be worth to raise your concerns with your boss instead first, to see if he/she can clarify anything for you.",
          "score": 1
        },
        {
          "body": "If they felt they made a mistake in hiring you and decided you weren’t a good fit, they wouldn’t hesitate to fire you, so why should you feel guilty about leaving?",
          "score": 1
        }
      ]
    },
    {
      "title": "Am i doing it all wrong?",
      "body": "I take a lot of debugging support to implement features or implement something algorithmically but while in every interviews i faced the interviewer won't let me even use the Ide.They would ask me to write complete logic on notepad.Now sometimes i do mistakes cause in my mind to certain levels i can go inside that loop and verify there on spot on interview that why this would work and why this wouldn't.But the interviewers expect perfect answers from me.This overall puts my morale down ,since i go into deep thinking mode amd if i am not able to get that thing om spot and then i struggle to answer even basic questions which i would punch myself of not answering it I know i can do that code in Ide but i have kind of sort of subconsciously trained my mind to not able to code without an ide.Pseudo code is a different thing but it doesn't ensures whether something will truly work for higher order problems.But how can I acheive perfect answers algorithmically in my mind if problems are not simple and trial and error is involved.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/pqhj3m/am_i_doing_it_all_wrong/",
      "comments": [
        {
          "body": "Practice.\n\nFor algorithm type questions, instead of running the code, step through it yourself.\n\nGrab a pen and paper and write down the value of your variables for each iteration, once you are pretty confident THEN run the code.",
          "score": 6
        },
        {
          "body": "Before remote interviews were the norm, and LeetCode started dominating, solving DS&amp;A was called “whiteboarding” because the solution was generally written directly onto a whiteboard. \n\nThey specifically do this because they don’t want you to use the IDE and a million console logs as a crutch. It’s a red flag if a candidate is way too reliant on that.",
          "score": 5
        },
        {
          "body": "Do you have a rubber duck?",
          "score": 1
        }
      ]
    },
    {
      "title": "Accept the offer or continue looking?",
      "body": "So I am facing a difficult dilemma. About a month ago I started applying for a new grad position for Summer 2019, I wasn't sure where I wanted to be yet at that moment so I basically shortlisted three major cities and started from there. I have about 4-5 different interviews lined up and have received my first offer two weeks ago. The salary is right and the job is interesting enough, however, It would require me to move across the country. While the job offer is good, it is not perfect, as I prefer to stay in my current city. \n\nI was hoping to wait for other offers before deciding, as so, I asked for an extension of the deadline, but the extension was refused and I only have ... 48 hours now to accept or decline the offer. \n\nShould I continue searching and hope for a better offer? Or should I just accept the offer? On one hand, I really dislike interviewing and would rather get this over with, I am also afraid that I might not be able to pass any other interview, a lot of friends and relatives were unemployed/underemployed after college and I felt that I am very lucky to receive an offer. On the other, I will be interviewing with my dream company on Wednesday and I might regret it if I just accept a good enough offer.\n\nUPDATE: Thank you so much for the input everyone. I've read every single one of them  and it seems like most people suggested that I accept the offer and renege when something better come along. It also seems like this is a rather divisive opinion in this subreddit. I decided to reject the offer, since I still have about 5 months before graduating I figure it's worth the risk to reject the offer and hope that something better comes along. I have also realized that I really want to stay in the city, at least until my partner is done schooling in about 2 years, as so, I cancelled all of my interview that's not in the city and decide to focus on the 2 interviews I have that's in the city, hoping that I get at least one of it! ",
      "subreddit": "cscareerquestions",
      "score": 17,
      "url": "https://reddit.com/r/cscareerquestions/comments/9wi6e7/accept_the_offer_or_continue_looking/",
      "comments": [
        {
          "body": "Take the offer and renege if something better comes along. You have to worry about yourself in this world so do whatever is best for you!",
          "score": 18
        },
        {
          "body": "[deleted]",
          "score": 7
        },
        {
          "body": "&gt;as I prefer to stay in my current city.\n\nKinda feel like you answered your own question. None of us can tell you what to do here as we don't know you or your situation. With that said, if you got 1 offer so soon, you can probably get another. Summer 2019 is a far enough deadline that you have the luxury of being patient.",
          "score": 10
        },
        {
          "body": "how long did it take u to get this offer? and 2019 is a ways away, so u can probably find another one. but then again maybe not. ive yet to get one after 5 months of applying",
          "score": 3
        },
        {
          "body": "Well. Here's something to consider.\n\nWhen would you have to move? Summer 2019 is 5 - 6 months away. So I'm assuming that you have a few months before you'd have to move.\n\nWhat would be the penalty for accepting the offer and then turning it down later? Is there any immediate bonus you would receive for accepting the offer?\n\nWould accepting the offer somehow prevent you from going on these other interviews?\n\nBecause what you could do, depending on your own moral compass, is to accept the offer, then go on those other interviews anyway. If you get an offer from something better, you could accept that, tell the other company you can no longer accept the position, etc. If you don't get a better offer elsewhere, you still accepted the offer, so you still have it in your pocket.\n\n",
          "score": 1
        },
        {
          "body": "I'm in virtually the same situation.... it sucks.\n\nHopefully you've done some research and spoke with people about their experiences, as well as broader research about who goes where after working at these places in these very positions.\n\nSay a prayer, think it over, then make your decision, and don't look back!",
          "score": 1
        },
        {
          "body": "Having worked in the engineering field for 12+ years and specifically in **hiring**, I would recommend that you move on and continue interviewing. If it doesn't feel right and you're not super excited about moving across the country, then you won't be truly happy and you would do both the company and yourself a disservice by just accepting it because it's the only one you have *right now.* If you do what some others are suggesting, in accepting the offer and then pulling out if and when you get a better offer in your preferred location, then you run the risk of burning that bridge. The recruiting community tends to be tight, and though these situations do happen, they are quite rare and that recruiter may be at a different company (perhaps one that you want to work at someday) and I can guarantee they will remember your name. That reputation will be one that could haunt you down the road and have unforeseen consequences. So do the right thing, tell them your situation and be honest with them that you like and appreciate the offer, but you would prefer to stay in your current location. They might have a satellite office or could allow you to work remotely, and if they are a great recruiter, they will connect you with the right people in your desired location. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Holy shit. Someone just posted this entry level junior developer job. Im baffled amd scared.",
      "body": "&gt; You will work in a disruptive state of the art R&amp;D techology project.\n\n- Required Skills And Experience\n\n* Bachelor's degree in Software Engineering, Computer Science or a related field;\n* 2+ years of experience in software development;\n* Experience with and comprehensive understanding of Object Oriented programming languages (C#);\n* Experience with and comprehensive understanding of Angular (7+) framework.\n* Experience with web development (ASP.NET Core, HTML/CSS, JavaScript, Restful API);\n* Experience with Microsoft Azure Cloud Services;\n* Experience with SQL Server and NoSQL data banks;\n* Experience with microservices and DDD architecture;\n* Understanding of wireframing and UI mockup tools;\n* Understanding of security practices when developing both front-end and back-end applications;\n* MCP Microsoft Certification;\n* Agile/Scrum certification;\n* Fluency in Portuguese;\n* Fluency in English;\n* License to work and living in Brazil;\n* Effective communication and relationship skills;\n* Strong organizational and leadership skills;\n* Deep analytical skills;\n* Conditions and interest to work home office, with telepresence and fixed working time;\n\nDesirable Skills And Experience\n\n* Experience with Vue.js and Three.js.\n* Experience with CosmosDB.\n* Experience with DevOps, CI and CD;\n* MCP Microsoft Azure Certification;\n* Good experience with unit tests;\n* Project management experience;\n \n\nWith no salary mentioned.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/iq34px/holy_shit_someone_just_posted_this_entry_level/",
      "comments": [
        {
          "body": "One time I applied for a sql dba job and at the interview it was nothing about sql \n\nApply\n\nChances are they are just looking for a legal CYA",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "They just copy and paste stuff. Just apply for it if you are entry level. This is usually done by recruiters. It never hurts to apply",
          "score": 2
        },
        {
          "body": "Damn, Brazilian juniors have it rough",
          "score": 2
        },
        {
          "body": "2+ years is not entry, don't know what you are being hysterical about.",
          "score": 1
        },
        {
          "body": "So they want someone who can do their Front end, back end, DB, dev ops, and project management? Sounds like they have either a Crud app that can be handled by one person, or they need 10+ people and only have the budget for one. Bad deal either way.",
          "score": 1
        },
        {
          "body": "Doesn't seem that bad, I got roughly two years' experience and I can cross off everything that is required except for Angular 7+ - I do have experience in React, Angular.js, and Vue.js though - and the cert (I also don't speak Portuguese and have no interest in working in Brazil). Add to that experience with DevOps, CI/CD, and unit tests.",
          "score": 1
        },
        {
          "body": "I don't think I've met 100% of the requirements of any job I've ever applied to.  Few people who applied to postings I was interviewing them for met 100% of the requirements either.  If you meet more than half or so, apply anyway and don't worry about it.  Worst that can really happen is they ignore you.",
          "score": 1
        },
        {
          "body": "Job descriptions are a wish list, not a requirements list.",
          "score": 1
        }
      ]
    },
    {
      "title": "How to go from chop-shop developer to a good developer at a large engineering firm?",
      "body": "I'm looking to breathe new life into a career and since you guys are among the smartest and most driven developers (given the high emphasis of big Silicon Valley companies on this sub) I know you'll be able to solve the difficult career problems.\n\n12 years ago I was a senior in college and and graduated around the lowest part of the great recession. Despite the recession, I was able to find a web development job in a relatively short time of three months.\n\n**My experience**\n\nThe problem is, I got myself pigeonholed. I was working for a small web agency, then a mom &amp; pop business, then a startup, then another small web agency. Unbeknownst to me, they were slowly poisoning my experience with poor practices or ignorance of new skills that would otherwise make me marketable. \n\nIn 2015 I knew only how to program in the LAMP stack, without frameworks, only hand-coded JavaScript/PHP or on a CMS like WordPress, Joomla or Magento. But front-end frameworks? Code reviews? Unit testing? Nah, forget about it. BTW I didn't *know* about these things back when I was working at these places. I was still very ignorant back then.\n\n**My goal**\n\nI am looking to join a large firm in a engineering industry, related to electronic tech. Someplace like AMD, GE, or Intel. I'm more interested in working with physical side of technology than must making web apps all day long. Agency work is rife, but most of them teach poor habits. My applications get mostly ignored at the big companies like GE or Intel, and I have no industry buddies to help me out.\n\n**Why I didn't choose CS**\n\nAnother complication, I did not graduate with a STEM degree, i got a BA in web design and programming. It's at a regular state college. I wanted to transfer to Computer Science but I had been in college for 5 years at that point. I had gotten senioritis, not liking the idea to stay in school for yet another 3 years just to fulfill the CS major. \n\nPlus, I was paying most of college with grants, and are good only for your first 150 credit hours, which I was getting pretty close to. So I decided to just get the BA web dev degree to cut my money losses short. I ended up only taking three CS classes before graduating.\n\n**Finally...**\n\nGive it to me straight, I have a ton to catch up with, right? I don't work right now so in theory I have a lot of time to learn more things, but in reality I *don't* have a lot of time because I will eventually run out of money.\n\nAnyone have an idea of what I should do first to head towards my goal of doing more than chop shop work? And a high-level plan from start to finish? Any suggestions? Should I even consider returning to school to complete my CS? Because I'm thinking it's not just impostor syndrome- the lack of credentials feels real.",
      "subreddit": "cscareerquestions",
      "score": 27,
      "url": "https://reddit.com/r/cscareerquestions/comments/8m627m/how_to_go_from_chopshop_developer_to_a_good/",
      "comments": [
        {
          "body": "Careful what you ask for. I worked at GE and a couple other large organizations and found that many of them spend most of their time doing paperwork and going to meetings. Some of those places worship their process to the point that  writing code is just a small detail. ",
          "score": 27
        },
        {
          "body": "&gt; smartest and most driven developers\n\nEhh, most people here are still in school",
          "score": 11
        },
        {
          "body": "You probably need to spend a couple months practicing interview questions.  Unfortunately, interview practice will get you further than actually learning how to write software.",
          "score": 10
        }
      ]
    },
    {
      "title": "Should I accept a lower paying job for the \"experience\"?",
      "body": "While this seems like a common question, my scenario is a bit different from the others I've seen.\n\nI'm fresh out of college with an undergraduate degree and I have a job offer from Microsoft, as a generic software developer.\n\nI'm interested in computer architecture and want to do a postgrad after 1 - 2 years, so I figured I'd try interviewing with AMD for a role as design engineer with half the pay as the Microsoft job.\n\nAm I making a mistake? Is it worth the pay cut, and would it help me get into a good grad school for Computer Architecture?\n\nFinancially I'm pretty stable, and wouldn't have to worry about cash too much regardless of which job I took. ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/b2354e/should_i_accept_a_lower_paying_job_for_the/",
      "comments": [
        {
          "body": "Step back, you have an offer from Microsoft and nothing from AMD. If you can't get an answer from AMD before the MS offer lapses I would absolutely go with MS.\n\nWhich company did you like more? Which do you think you'd be happier at? Would you rather live in either worksite?\n\nFor what it's worth I'd probably take the higher comp, both of these companies are great and will open doors \n\nEdit: I reread your post, the AMD offer is half?! Absoluetly go with MS. Your first few years out of school are about learning professional development, you don't need to specialize. Make that bank dude, 2x the salary will make a huge difference in your financial situation, especially I'd you invest it properly ",
          "score": 8
        },
        {
          "body": "You're thinking about this too early. Wait until you actually get an offer from AMD.",
          "score": 3
        },
        {
          "body": "I think it depends. Is AMD underpaying the market rate or Microsoft is paying above market rate?   \n\n\nAnd I don't think working for either AMD or Microsoft will significantly affect your chance of getting into graduate school. If it does, then everybody else who doesn't work for AMD is pretty fucked. Your GRE scores is probably weight more to your application.   \n\n\nI personally would go work as a generic developer at MS. The skill set is transferable anyways. ",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "I feel like I should add more info and context, looking at the arguments in the comments.\nPay rates wont be exact for confidentiality reasons, but I'll try to keep them accurate. \n\nThe AMD role is an entry level role, which involves working with simulators. The pay is around 80 - 85k.\n\nMicrosoft is offering around 110k + 30k stocks. I made the mistake of adding a 20k joining bonus to the pay, which is where I got the \"pays 50% less part\". Both are in the same location, and from what I've heard, both are a comfortable living wage, especially for a single fresh undergrad.\n\nWhile it's true I dont have the AMD offer yet, if I end up getting it I'll have roughly a week to make a choice on the Microsoft offer, which is why I'm seeking out advice now. \n\nMy intent for future is to do postgrad in computer architecture, then work in a research lab in AMD/Intel/Nvidia etc. My professor says working in AMD would be amazing work experience which would help after I get a postgrad degree. On the other hand, my family and friends say I'd be stupid to reject a Microsoft offer. I dont really know many professionals in the CS field, and I have little clue how the job market is, so wanted some advice. ",
          "score": 1
        }
      ]
    },
    {
      "title": "C++ engineer or ML or Developer career paths?",
      "body": "Let me explain the broad title of this post.  \n\n\nAfter completing my masters degree in Electrical Engineering, I have been working at a very small startup for the last 3 years. I have been the only person here with technical know-how, so I did things my way, even when I didn't have complete knowledge of things. I have been coding in C++, with hobby coding in Python. Now I am realizing how detrimental it has been to not have a mentor and no direction. I am trying to get into a company where there is growth potential but I am struggling selling myself, because my work involved wearing many hats instead of honing my skills in one area. The only thing I have going for me right now is \"I have coded in C++ and developed a huge codebase from the scratch\". I have dabbled in some embedded C programming, and some databases but only enough to do the task at hand. I dread technical interviews because I only have superficial knowledge of things I have done.   \n\n\nMajority of job postings I see fall into one of these categories:\n\n(1)  Web development (Java, SQL, backend, front-end) - I'm not very keen on this path, but there are plenty of jobs for this. So finding a job would be easy here. Plus, possibility of being DevOps guy in the future, which is neat.\n\n(2) ML Engineer: Would love to do this as I have always had an interest in ML, and always been doing minor side projects on my own. I have, however, no industry experience with this, so not much to show for in my resume.  \n\n\n(3) C++ Engineer/Compiler Engineer/Linux/Embedded: While I dread embedded, I do have a lot of C++ experience. I have no experience with fundamental concurrency, efficient coding but I have accomplished the tasks at hand so far with C++.   \n\n\nNow (2) is my interest going forward and (3) is my experience, how do I improve myself? How do I sell myself, and also make myself worth selling?   \n\n\nQUESTION 1: In order to improve my basic C++ fundamentals for those tricky technical interview questions, what book or video series do you recommend? I feel like I need to learn C++ from the ground up to make my understanding thorough.  \n\n\n QUESTION 2: Any tips for interviews in the meantime? I have started doing Hackerrank challenges with Python currently, and I struggle a bit, but sometimes I surprise myself. Is there a way to improve competitive coding in a structural manner or should I just keep doing random Hackerrank challenges?  \n\n\nThank you for reading a long post!",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/nmycvo/c_engineer_or_ml_or_developer_career_paths/",
      "comments": [
        {
          "body": "There can be a mixture of 2 and 3. There is quite a bit of focus on acceleration of ML ideas and papers on GPUs. Qualcomm, AMD and Nvidia are heavily invested in this. They specifically look for people with ML and C++ backgrounds. Maybe you can look at these?",
          "score": 8
        },
        {
          "body": "Answering question 2. I find hackerrank more of a place for learning fundemantals. For interview prep you should look at leetcode. Kinda lame advice but did you look at Cracking the Coding Interview? Or you should follow some data structures / algorithm course.\n\nBtw, I am a MLE and I started my job thanks to my graduation project and I had no ML (internship etc.) experience.",
          "score": 4
        },
        {
          "body": "Commenting to keep track as I also have similar questions",
          "score": 1
        }
      ]
    },
    {
      "title": "Side Projects to make up for my GPA",
      "body": "Hey, I'm a second year comp eng student and next year, as a part of our program, all students need to get hired for a year longish internship. Big companies usually hire students from our university (Google, Intel, AMD, Huawei, IBM, etc). I used to have a decent gpa but I bombed it this past year due to some personal reasons. I'll probably still be able to get an internship at a small company doing menial tasks but I know I'm able to do more and I'm fairly confident if I can get an interview that I can prove myself. However, employers look at our resumes &amp; transcript, and I want to make up for an abhorrent GPA (2.5ish). Over the summer I'm planning on working on side projects that can hopefully at least make employers interested enough to give me an interview.  I have some experience making games, have delved a bit into data structures and algorithms (have implemented programs using A\\* and Dijkstra), and won a few hackathons.\n\nI'm planning on doing lots of leetcode/hackerrank, reading *grokking the coding interview* and improving my resume over the summer but those are kind of useless if I can't even get an interview. Any advice on side projects I can do over the next 4 months to stand out and make up for my GPA would be appreciated.\n\nSome things I'm already thinking about:\n\n* A 3d renderer using Vulkan or OpenGL\n* Soft body simulations\n* A primitive game engine\n* A website with a \"devlog\" section to showcase what I've done using HTML, CSS, Javascript, PHP\n\nEdit: I really enjoy programming in C++",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/mxwcar/side_projects_to_make_up_for_my_gpa/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 6
        },
        {
          "body": "It seems like you're focused on gamedev/computer graphics from your project choices. Like the other poster said, if these are the positions you'll be applying for, then that's fine. But if you want more breadth, do things you're passionate about but more general with respect to CS.",
          "score": 2
        },
        {
          "body": "You say you won a few hackatons? How many people participated and what are those projects?\n\nAnd are you already applying for the next year internships - for 21-22 school year?\n\nOr is the 1 year internship before senior year so you'd apply next year? \n\nAlso make sure you spend some time working on your resume, having it reviewed etc cuz being able to communicate about what you did and how it's relevant could be the difference between companies just dodging you cuz of gpa.",
          "score": 1
        }
      ]
    },
    {
      "title": "Revature or keep waiting",
      "body": "I have read all the reviews  about Revature and don't want to start another conversation  about it. I am a Computer Engineering  student graduating this May. I have given some good interviews  where my hackerank coding interviews went well too but within a week or two I got replies that they've moved on or stopped hiring. Is it feasible to go to Revature and srsrt my training for two months amd start working at a lower pay or wait out for the pandemic  situation to get better?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/geu6tc/revature_or_keep_waiting/",
      "comments": [
        {
          "body": "Before anything, there are a lot of companies like Revature but with a much better deal. I mean paid training, then placement with contract. I interviewed with one where year 1 was 65k and year 2k was 80k. I thought it was a good deal.\n\nHowever i interviewed at a legit company and got hired. Took two months.\n\nMy advice is too try your hardest to interview and apply to lots of places. Revature will always be there and again there are companies like Revature that are 10 times better.",
          "score": 5
        },
        {
          "body": "Hell fucking no. I’ll give you my story. A company similar to Revature told me I was being placed as a data engineer, so I went through the data engineering training but a week before my start date I was switched to a manual tester. Fast forward two years, I’m currently the only tester on my team, have been extremely overloaded because everyone else has left, and my performance has plummeted due to the stress. I’ve been working nights and weekends. **If I get fired due to performance reasons, I owe my company 30 000 dollars.**",
          "score": 3
        }
      ]
    },
    {
      "title": "Anyone knows roadmap for becoming cybersecurity engineer?",
      "body": "I am into software development now, don't know why but thinking cybersecurity is the thing for me, really tired of the way interviews happen in a software developer role.\n\n\nIf anyone here knows how to get into cybersecurity role from ground up, like what subjects to study, good resources to follow, good youtube or sites.\n\nAny platform where i can apply things as i learn, good companies, FUTURE OF cybersecurity engineer?\nWorth it to switch from software to cybersecurity? As i am thinking to continue with my software deb job and keep learning amd freelancing with cybersecurity skills that i gain. \n\nI know i am asking to much but, i remember i started like this for software development.\n\nHelp in this will be much appreciated\n- a dude from india",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/nu64zo/anyone_knows_roadmap_for_becoming_cybersecurity/",
      "comments": [
        {
          "body": "get the CompTIA A+, Net+, Sec+ certifications\n\nalso you’ll probably get more responses to this question on r/ITCareerQuestions or r/AskNetsec",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 0
        }
      ]
    },
    {
      "title": "Im a software engineer that doesn't do software engineering. If I were to start looking for a new job, what should I be applying for?",
      "body": "Throw away because my manager is on reddit, and my co workers are as well.\n\nSo, i was hired some 5 years ago as a \"Junior QA Analyst.\" After various promotions, my title became \"Software Engineer II\", except i barely do any coding. I  was also self taught, so i dont have a strong programming background to begin with. For example, i didnt even know what a recursion was when i had an in person interview. And even though they knew i was self taught, they expected me to know various algorithms in the interview, which frankly, i didnt and wasnt expecting, although i probably should have.\n\nInstead, i feel more like tech support sometimes. Aside from doing bug fixes and such, i mainly manage our AWS environment and do deployments with automation/config management tools like Salt amd puppet, but i have to refer to the docs very often when writing stuff because i just cant seem to remember the syntax. With that in mind, im not very confident in my automation writing abilities. \n\nSo, i should probably consider myself lucky for even having a well paying job, but i often find myself stressing because A. I feel like im not pulling my weight, B. I feel like tech support sometimes, and C. I dont feel like im developing myself to be a better engineer. It also doesnt help that theres so many things in our backlog that i often work til 8 or 9pm before i just die from exhaustion.\n\nI really want to get a different job, but im not sure what i should be applying for. I thought about applying to DevOps positions, but theres a bunch of tools i dont use in all of the job descriptions. Same for system administration, and automation engineer jobs. \n\nWould it be weird for a mid level software engineer to apply to jr. Level positions? Should i go back to school online to try to get a foundation in CS and programming? I was also considering doing one of the nano degrees by udacity or something. Or should i just stick to my current job and hope things get better? \n\nI did bring this up to my manager before, a few times actually, and he says im doing fine. He says he will tey to get me training or recommended i take advantage of the company's tuition assistance, but working so much, in addition to being the only income source with a child to take care of makes it hard to go back to school.\n\nAny advice would be much appreciated.\n\nThanks\n\nTL;DR: i dont know what im doing or where I'm heading.  Advice to be a better engineer?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/8oxa5p/im_a_software_engineer_that_doesnt_do_software/",
      "comments": [
        {
          "body": "You don't explain why you feel like tech support, managing an AWS/making deployments are important and wanted skills in the industry. Also don't frett about using docs when doing work, even seasoned pros need docs, you can't remember everything haha.\n\nAs far as pulling your weight, finding time to spend working on improving some internal code or at least reading it in order understand it until you can contribute could be an opportunity to take a step to being more involved with your team.\n\nIf long hours are really taking a toll, and you feel this job isn't cutting it, then it's simple. Apply to as many jobs as possible, and quit in place a few weeks later (leave at 5, do the minimum to get by, etc). Even if jobs have requirements that you don't have under your belt, as long as it's not a senior position then it's assumed you are going to need to become familiar with the position (depends on job/business niche tho)",
          "score": 2
        },
        {
          "body": "Hey you sound like a smart person. It’s weird how the industry is with the algorithm problem interviews that don’t really match up with what the work is like. I just want to say, all those algorithms aren’t as hard or esoteric as they’re made out to be. Often it’s actually pretty obvious stuff if you just take a step back, go at your own pace and not other peoples, and break it all down into small little chunks. I bet if you could find a way to work normal 40 hr work weeks and do a little bit of study on the side you will have no problem ",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "It sounds like you are a build / release engineer! You are definitely being spread thin and I’m sorry to say, this role doesn’t have a lot to learn unless you are actively building a custom deployment/build pipeline. Why can’t you just do projects on the side? For example, find something cool and then make it happen. You can and will learn a lot. Finally it’s not weird to look for junior positions of it isn’t a build/release engineer position. ",
          "score": 1
        },
        {
          "body": "Do you enjoy aws management and automation? Devops is hot right now and your skills line up with needs in the industry today if you want to continue doing that. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Fall 2021 Co-op with AMD or potential Spring 2022 Co-op with a better company?",
      "body": "I only have time for 1 off-season internship and must choose. While I have AMD for fall 2021, I have been getting calls and interviews with better companies for Spring 2022. Should I stay safe and take the fall opportunity or go big for the spring?\n\nSome assumptions:\n\n\\- The better companies for the spring would be like Appian and Rivian.\n\n\\- All roles are for SWE Intern\n\n\\- Assume the off-season internship (spring/fall) will not be on the resume for summer 2022.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/p55www/fall_2021_coop_with_amd_or_potential_spring_2022/",
      "comments": [
        {
          "body": "You already seem pretty interested for the spring co-op, I'd say go for that BUT do keep in mind, a bird in the hand is better than a bird in the bush. You don't have absolute confirmation of that \"better\" co-op, you might not get any. Weigh the pros and cons, make a list, and see if someone saying \"Oh definitely go for X\" makes you a little happy/upset, because you might already have your own bias one way.",
          "score": 8
        },
        {
          "body": "just accept amd and if u get spring one then reject amd",
          "score": 3
        }
      ]
    },
    {
      "title": "Job lasted 3 weeks",
      "body": "To cut my story short. I had a guy email me that he needed someone for the lab. Knowing im qualified and applied for the job, I went to an interview at the date and time we agreed on. Showed up to the interview the man at the door had no clue about me and called the guy who was supposed to interview me. He then told me he had an emergency and he couldn't make it and he will email me. One week passed and another. I emailed him to see when the interview is now rescheduled to tell me to totally ignore me. Another 2 weeks passed and emailed me to go for an interview since his preferred candidate bailed on him last min. The interview went very good and never got a call back. Fast forward 1 month he offered me the job and we agreed on an hourly price which will be at 150 bucks per batch of samples released. The system they had in place turned to take at least 4 hours per batch not 2 and felt like i was ripped off. My trainer laughed so hard saying Noone can complete this work in 2 hours. I felt my trainer was intimidated by me and had so many subjective comments on my work that personally dont agreed on and would generate false results but for some reason she was insisting I do it the way she wants. She kept sending me the comments for 4 training batches over 1.5 week. All of a sudden my training stopped and when I asked why, she said im very slow amd make a lot of mistakes (which are not mistakes since I have more experience than her, shes the one doing it wrong but was respectful with her). 2 weeks went by with radio silence and today I get an email from my original interviewer that they no longer need my services and to return their laptop\n\nWhat the heck is wrong with people nowadays.  Im failing to understand how they think. They have zero respect for people's time. I shouldn't have accepted this job especially when the interviewer was disrespectful from the beginning and when he changed the terms of the pay.\n\nI feel disappointed.  ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1qd9mta/job_lasted_3_weeks/",
      "comments": []
    },
    {
      "title": "Getting reprimanded by my boss every week",
      "body": "Hey guys,\nI am a fresher. I originally applied for Product/UX Design roles but got the role of PM+PD at a start up that pays me 65k annually(NY).\n\nI constantly feel like I am walking on eggshells. I must reiterate that I have never worked in corporate before so being critized all the time really makes it tough for me. So there is issue on my end too.\n\nI work nearly 10 hours daily and also on weekends at times. By boss mails me on weekend and expects a revert.\n\nThis week, she wasn't satisfied with a wireframe I created (tbf this was the second time she was unidentified w the wireframe) so she mailed me this Sunday morning and asked me to have it ready before Monday meeting that she keeps at 8:30. Is it normal to expect that?\n\nI have casually brought up that I work close to 11 hours daily but she acts as if that is normal.\n\nI have heard product people are very dedicated to their product and I am having such a hard time adjusting. I constantly feel depressed, not good enough, I wake up everyday with the fear that I will be yelled at for something.\n\nShe constantly keeps asking for updates and info about what I have done and what not. She wants me to send her an end of week email, mid week meeting, design meets and message daily about what I have achieved. I feel like I work so hard but either I am unable to communicate it or the workplace is toxic.\n\nI constantly get \"feedback\". Corrected about, what industry standard is and how I should work.\nEven if I have had a packed week and the boss knows, she expects me to do user interviews. When I saw I did mot get the time, she says \" you need to plan better and make time for it\"\n\nI am at a loss of words usually, I feel so done and feel like a failure that I am so bad at the first job.\n\nI can do so well but eventually there will be something that my boss finds I can do better amd berates me over that.\n\nI am on F1 and I constantly fear being fired. I do not even get time to prepare for other jobs. I get up work, get done and then sleep. \n\nI feel stuck, I feel like there is no getting out. I have a full fledged breakdown almost daily where I cry untill my eyes can't open anymore due to the swelling.\n\nMy boyfriend who has some experience(about 4-5 years) is so kind and helps me understand tells me how I to deal with it.\n\nBut I wanted to understand from people here how can I be better or is there being any better at all that would make my employer happy.\n\nHappy to give more context if needed.\nThank you all.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1nbe5ij/getting_reprimanded_by_my_boss_every_week/",
      "comments": []
    },
    {
      "title": "Could someone give me advice please in my current company position",
      "body": "So i've been with the company i'm currently at for 9 years now. Started as just a customer support and have work my way up and am now Assistant Manager, and have been for almost 4 years now. What started out as just a prt time job has turned into a career. However recently i seem to have hit a hump, i'm not sure whether its with the company itself or the people making decisions around my future but some advice would be great.\n\n  \nSo a year ago i got my end of year review (our company performs these every 6 months \\[mid point review and end of year review) and was regarded very highly (in the store and area i work at) as one of the best performing Assistant managers in the region. In fact i got the best possible grade i could have gotten, got chosen to do a project for the company because i was high calibre, was part of many successful store inventories, store audits, hit all of my personal development plan targets and was even sent to multiple stores to train other Assistant managers to show them how i work. However, the grade i got meant that i should have been given a nomination for promotion, something my Line manager consistently pushed for yet my Area manager never tried to get me my own store in the entire year, and i had to go off my own back to apply for stores to try to get interviews (to where i started to think maybe he is the reason i'm in this rut right now). and thats kind of how the year went up until February this year, i kept performing the way that i was, never changed a thing about my style but nothing came of it. I then got moved to another store in October 2024 and i didn't want to go however my Area manager said 'what would i think of someone who wants to be Store manager and doesn't want to change stores?' kind of blackmailing me into going a little?\n\n  \nCome up to the end of February this year and the yearly performance review came around again, however this time i received a worse review, yet nothing about my style changed (and as i mentioned all the achievements in the last paragraph) yet i got a review that said i am not nominated for promotion, i should be where i am now (this was not based on my Line managers review of me \\[because i moved stores\\] this was my Area manager reviewing me). I was dumfounded, i let my feelings known to my Line manager and said it was completely unfair given how much i did, how much i achieved and this was the way that my Area manager saw me was completely false. Unfortunately aswell there is no way to even ask for a second opinion, apparently it is final (i even looked into the procedure and on the document it says the grade is final and cannot be changed).\n\nSince that review i didn't see any point of continuing putting in the same effort and commitment, so i didn't. Since February i have reduced my efforts, work load, and even the time i put into things and just do whats expected of me and nothing more, why should i continue putting in more than 100% effort if my efforts are not noticed. Like what is even worse is my Line manager put me in a shitty situation 2 months ago, put himself and 3 other managers on holiday during a week of a board member visit,  i worked 60-70 hours both weeks prepping for it, got a really good visit (best in the area) and not a single thank you or well done from neither my Line manager or Area manager. Which after typing this back makes me seem how well they regard me.\n\nFast forward to present day now, i have tried my best to move away from this area, trying to get a transfer to a store that is closer to me so that travelling is easier amd so i don't have to be with the Area manager i currently have now, however i am being decline a transfer, which i don't understand. When i used to work at the store i was at prior to October 2024, we had 3 people transfer from different store to our store and didn't have to apply for a position at all, they just came over and that was that (even someone who was an Asisstant manager) and yet when i told them i wanted to transfer to a different store closer to  me i got told i had to apply for the store when a position became available and yet when i did  it got declined.\n\nI just don't know what to do, i think i should apply for a different job, i don't even think the company i am with is even bad, like the pay is great, the benefits are great, my team are great and i actually like my job. I just feel like certain people in this company, who are unfortunately on my area, refuse develop me, give me the recognition i deserve and try to make me feel shit.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ladxoz/could_someone_give_me_advice_please_in_my_current/",
      "comments": [
        {
          "body": "Apply to external jobs...",
          "score": 1
        }
      ]
    },
    {
      "title": "Lots of recruiters /w contract positions, but difficulty finding full time positions at desirable companies?",
      "body": "Hey all,\n\nI'm looking for advice on transitioning my career. I have a little over five years of professional experience. Two and a half years at a consulting company doing full stack development for energy clients. I then moved over to work for another two and a half years at one of those energy clients as a senior full stack developer.\n\nI fell into these jobs as they were the best opportunities I had coming out of college, but now I am getting close to 30 and wondering what I want my career to be about. I really want to move to a technology company. Any of the big ones would probably be a good home: Microsoft, Nvidia, AMD, Apple, Google, Amazon, Facebook or even some of the smaller companies would probably be great homes too. I just want to be a full time employee at a technology company and get out of the energy industry.I love tech and follow all the latest advancements. I see people all around the world creating awesome things and just wish to be a part of it and be surrounded by people with similar passions. \n\nMy job is important for my company, and I am paid very well, work life hours are reasonable, but I feel like my life energy is being wasted on things that I personally don't find interesting or care about.\n\nAnyway, so I started looking and applying. I can get tons of recruiters contacting me about staffing me at other contract positions, but I keep getting rejected pre-interview at technology companies for full time positions. \n\nI've thought about going back to school to get a specialization in something like AI, or perhaps an MBA. Something that I could use to act as a catalyst to get me into a company where I'd be part of the process of building some really cool things. I don't really care about the functional role (developer, manager, product owner, etc.) I just want to be part of something inspiring.\n\nAdditionally, my resume might be terrible. I've only updated it once or twice since I complete college, so that might be holding me back.\n\nHere is an anonymous version of my resume for feedback if you'd like to help me out: https://imgur.com/a/F2zxxwj\n\nWhat would you recommend?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/iiazye/lots_of_recruiters_w_contract_positions_but/",
      "comments": [
        {
          "body": "You have 7 years of work experience and a 5 page resume.\n\nDon't do that. No one is gonna read that. Keep it to one page. Once you hit 10 years or so, you can consider going 2 pages.\n\nYou keep listing what the product or the project does. You do very little to show what *your* impact was. \"successfully released product on schedule\". Okay? Why would I care? What did YOU do to ensure that was the case?\n\nAs for big sexy tech companies: For every sexy product and position you see from the outside, there are 10 internal teams working on tooling and infrastructure which are probably boring and not as great. Not that it should be an issue, because they'll still pay well and you'll be part of a good company, still, but know that you won't always be working on the shiny products.\n\nYes, recruiters typically reach out with contracting roles. Hell, I work at a big tech company and I get external recruiters contacting me to contract me out to....the company I work at......\n\nYour best bet is to get a referral at a big tech company if that's your goal. Polish up your resume (a lot), and then grind leetcode.\n\nI hope that helps. Best of luck.",
          "score": 5
        },
        {
          "body": "Definently don’t waste time with recruiters. Remake your resume and brush up on interviewing techniques. All those great soft skill things, they come easy when you’re applying to a company you care about.",
          "score": 5
        },
        {
          "body": "You should target something like 5 applications per day minimum and expect it to take a long time because of COVID, and I'd accept a contract job in the meantime to pay the bills.\n\nWhat did you expect here?\n\nAnd wtf is going on with that resume?  How can you be that clueless?  You should look at a bunch of other resumes from people in the US and see how they differ from yours.",
          "score": 1
        }
      ]
    },
    {
      "title": "Help with my compensation",
      "body": "Hey guys im a bba fresher (21) and was applying around casually giving out interviews but now ive gotten serious and recently got offered a 3.5lpa job offer in a company here in Bengaluru but I dont know whether to accept or not bc I feel its very low but ppl have been telling its pretty good for a fresher so idk whether to accept it or not amd realised it would be better if I get some anonymous answers based on which I would take a decision \n\nSo help pls \nThanks in advance to whoever has taken the time to read it :)",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1q0ajoc/help_with_my_compensation/",
      "comments": [
        {
          "body": "can judge if you're underpaid or fairly paid only after we know what role it is!",
          "score": 1
        }
      ]
    },
    {
      "title": "Got rejected - looking for some advice",
      "body": "So I recently interviewed for a role I reslly wanted amd after like 4 days I got the classic “we’ve moved on with other candidates” automatic email, honestly that sucks and it makes me feel like im not good enough.\n\n\nWhat do you people do after it happens and how u cope with it?\n\n",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1noe1ga/got_rejected_looking_for_some_advice/",
      "comments": [
        {
          "body": "From personal experience, this is a lot more common than you think it is so don’t let it get to you. Just remember that there are others fighting for that same position you applied for. If you want some advice, try to expand on your CV/resume, cover letters also help out as well. As for the interview itself, employers are often more willing to hire either the more experienced or the guys that display willingness to learn. \n\nLast but not least, try not to let the nerves get the better of you. Nailed an interview not too long ago because I was not nervous despite me needing that job.",
          "score": 3
        },
        {
          "body": "might be hard for some people, but I’ve carried on with the thought that maybe that particular role is really not for me and the idea I have that it’s a really good role could just be that, an idea. Don’t lose hope, there will be something out there for you",
          "score": 1
        }
      ]
    },
    {
      "title": "Company posted ghost job",
      "body": "I’m a bank manager that has recently lost two employees. We posted a position, and I hired two people, but one backed out last minute, so we reposted the requisition. I found out yesterday that they are discussing not actually filling the position but still want me to interview people. I’m REALLY uncomfortable with that after experiencing the stress amd depression my husband went through being out of work for a year. I don’t want to play with peoples minds like that. My supervisor said it’s fine since it’s an entry level job, but damn, entry level people need to eat too. I’ve stated my thoughts and now don’t know what to do. I’m afraid if I keep pushing, it will affect my job. ",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1m7exeu/company_posted_ghost_job/",
      "comments": [
        {
          "body": "Oh dear... Seems to be an ongoing trend with upper management. Hire 1 when you need 2 but have a handful of screened employees at the ready when people drop like flies from the stress.",
          "score": 1
        },
        {
          "body": "Ugh. Ghost jobs are the worst. Totally immoral. You did the right thing to speak up, but yeah, if you keep pushing you might be endangering your employment.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is this a scam? Gracemaxwest Construction Canada",
      "body": "&gt;**Dear Applicant,**       \n\n&gt;**We are glad to inform you that your resume was found interesting and suitable to be one of our staff here in Gracemaxwest Construction Canada. The organization has taken necessary action in forwarding the CV/resume to our administrative management department (AMD) for further processing. Kindly fill up the interview and the job application form and scan it back along with the scan copies of your international passport, college/school certificates and passport size photograph today for more details about you and your family's and procedure on how to join us here in Gracemaxwest Construction without any delay. you can send your filled form via this email and the Company will get back to you with confirmation mail. Thanks, and regards, H.R Consultant. Tel: +1(437-266-0896 Email:** [**info@gracemaxwestconstruction.com**](mailto:info@gracemaxwestconstruction.com)**Gracemaxwest Construction Canada.**\n\nIs this legit? They've attached a job application form in conjunction with the email, and this is for a job I applied through a legit job portal, shine.com. \n\nAlthough I've heard of scams targeting people in third world countries (I live in India) like this. Red flag is that the email is not from Gracemaxwest Construction, but rather, it is from an email that goes 'Vacancy overseas' or something to that effect.\n\nShould I send them my personal details. I said I had some doubts as I'm very suspicious and wary, what are your two takes on this?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1ieik5f/is_this_a_scam_gracemaxwest_construction_canada/",
      "comments": [
        {
          "body": "&gt;**scan copies of your international passport, college/school certificates and passport size photograph today**\n\nSeriously? When's the last time you heard of a construction company that needs these kinds of documents before even having the first interview?\n\nThis is a very obvious scam, and they're clearly trying to steal your identity documents. The broken English and the use of the word \"kindly\" are dead giveaways, not to mention asking for scans of all these incredibly sensitive documents.",
          "score": 2
        }
      ]
    },
    {
      "title": "Provide non competing clause",
      "body": "Went in an interview amd the HR asked for the non competing clause docs. I am not sure how to deal with that.\n\nShould I give him the original doc? Or can I snapshot the part of the clause? And I also have the waiver in written, among other info in my final letter HR gave me\n\nOr should I wait till the last round of the interview if I ever make it there?\n\nThank you.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/mpn13w/provide_non_competing_clause/",
      "comments": [
        {
          "body": "Give them the full doc as they will likely share it with legal. I've seen non-competes cause major issues later on in the offer process, so best to air it out early to make sure there are no show stoppers.",
          "score": 1
        }
      ]
    },
    {
      "title": "Got the job offer",
      "body": "\n\nPart 1\n\n😭 I am just speechless, kinda nervous, kind of so much happy inside which is not coming out yet. Im expressionless tbh after receiving the job offer today morning after receiving rejections for almost 10 months.\nTo give a little context✍🏻, I graduated last year from one of public colleges in Canada, earned two PostGrad certificates in the field that I wanted to secure a job into.( Im happy to provide more details if you need to ask) And I started applying to jobs rigorously, for first three months I did not receive any email(whether rejection or interview ) that made me think I'm doing something wrong. Then started a range of posts about people getting laid off(as we all know) and companies firing employees that made more nervous and calculate my future steps. 2023 was eventually \"that year of scaring everybody\". \n\nAnyhooo, I changed my strategies, joined a couple of groups on Reddit, linkedin, facebook, and eventually in depth research started about resume and jobs. This was around August(I had a couple of other things going , IELTS exam and stuff)\n\nAgain spent September , Oct, Nov , Dec in deep agony of not receiving any emails back from the companies I applied to. At this point, I had revised my resume over 10 times, I had no references till now, didnt know how to reach out to people because of my certain belief or awkwardness in not asking for help from people. I turned rhat around as well coming year. \n\n2024 - January turned out to be a monumental month. I received an out of the blue call from one of my professors from the college I graduated from. He heard about my situation, was taken aback and decided to help me out in resume review and stuff. A great deal of help that opened my eyes and I gained a fresh perspective. Revised my resume again, gained multiple feedbacks, started digging in more for \"resumes that got people hired\". One such resume reached Ontario's MoH in a position that I applied in early March(without any referral). \n\nFebruary and March - I started reaching out to people, around 10 people from different companies agreed to refer me and submitted my application for senior Software engg roles, or integrated mixed roles but my eyes were onto something related to Proj Mgmnt roles.\n\nA month later, I get a call about a possible opening for Project Coordinator, got interviewed, got the reference check and today morning, Im handed over the offer letter. \n\nI want to thank everyone here 🌟who has contributed in any way, you guys have no idea how much this means to people like us and for current job seekers, dont lose hope, time is a resource, spend it wisely and strategically. Patience amd persistence pays off eventually. \nP.S. Will post Part 2 after I get some feedback, that ll be more into the observations I made last year till now. \n",
      "subreddit": "jobs",
      "score": 61,
      "url": "https://reddit.com/r/jobs/comments/1c6hrn6/got_the_job_offer/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "Congratulations!!",
          "score": 4
        },
        {
          "body": "Let’s go!!!!",
          "score": 2
        },
        {
          "body": "That's awesome, congratulations on your success!!\n\nPlease come back and share all your insights, especially on resumes that helped you the most. Thanks for sharing your story, we need the encouragement!",
          "score": 2
        },
        {
          "body": "Great work! 👏 would love to know what you did with your resume",
          "score": 2
        },
        {
          "body": "Congratulations OP. I just attended an interview today, and will know within two weeks, will post back the update here.",
          "score": 2
        }
      ]
    },
    {
      "title": "What to say if asked why I left my last job?",
      "body": "Hi all, \n\nI work in tech and had a pretty good job in FAANG. I got fired last month due to poor perfromance. It wasnt a good fit for either side. I was there for 3 years and mistakes were amde on my end and even the end on my performance. \n\nTo give some reasons of how it was for my last company. I felt like the company was very 24/7, senior and prinicipal engineers works 60+ hours, taking their laptops everywhere, taking calls on vacation, etc. Even as a Jr Engineer I was working 50-60 hours a week and would've worked more but I wanted to respect my WLB. It had the vibe of do everythign for the company. One of my coworkers left last year and he said the project we were in was the worst organization he ever saw and senior engineers were barely willin gto help junior engineers. The job was remote and they promoted WLB so for the first year I kept it to a 9-5 schedule (sometimes went 9+ hours if needed) but when it came across to em that I was underperforming after a year and a half there, I upped my time and was working 10+ hours almost everyday for a year. Unfortunately I had already dug myself in a bad hole and got a few bad reviews and then got the boot last month. I acknowledge maybe I could've done differently but I will use this experience to be better at my next job. \n\nI have an interview with a hiring manager tomorrow. According to the recruiter, it's just going to be question based to see if I seem like someone who they may like. It's my first interview in 4 years so im a bit nervous. The recruiter said there will be like 5 stages after my meeting tomorrow. If they like me, I will take a technical interview, than a recruiter interview, then an interview with 4 teams, then a team match then a C-suite interview. Online it says that if asked why I left I should keep it short, but im unsure as to what to say exactly.\n\nWhat would you recommend I say if asked why I left? Should I mention I got fired due to poor performance?\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1inaqic/what_to_say_if_asked_why_i_left_my_last_job/",
      "comments": [
        {
          "body": "Never mention you got fired at least if you have to make something up hell you could even say the company went bankrupt",
          "score": 1
        }
      ]
    },
    {
      "title": "Did I get the job",
      "body": "Interviewed on Wednesday and they said they had another interview Thursday and Friday and would make a decision by end of day Friday. Day coming to an end I haven't heard anything either way. Do u think that likely means I did not get the job? Or does sometimes it take longer and I might hear Monday? I just hate going into the weekend without knowing. I really want this job!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1flkh1k/did_i_get_the_job/",
      "comments": [
        {
          "body": "I worked for a company for 30 years. Had qualifications amd fid not even get an interview.",
          "score": 1
        },
        {
          "body": "Send a follow up email!",
          "score": 1
        },
        {
          "body": "I'm in the same boat. Last Friday was supposed to be when I heard a decision by, I emailed Friday after not hearing anything and got a response from one of the hiring managers saying they were still finishing interviews and hoped to have a decision by mid to end of this week. Here we are on Friday and still nothing. I am assuming I didn't get it and they are waiting for those who they made offers to to sign them and send them back before notifying the rest of us we didn't get it",
          "score": 1
        }
      ]
    },
    {
      "title": "Can a employer look up your name on workers compensation website during interview process before making an offer?",
      "body": "I worked as a recruiter for a property management company and the director of human resources and several other internal human resources staff always instructed me to make sure that after I speak amd pre screen and interview someone to look their name up on the workers compensation webpage and see of their name comes up on the webpage.\n\nIs this legal or is it discrimination? \n\nI was fired for questioning it and saying it's affecting time my work productivity due to the time it takes to look up their names and waiting for other people in the human resources department to follow up on their names as they would do a further investigation looking at their work history and comparing it to the information that the workers compensation webpage posted for that individual.\n\nI made a comment about it and I was terminated 2 weeks later. I have emails with proof and text messages of the director of human resources telling me to make sure I look up their name with last 4 digits of social security number during the interview process of certain individuals and if their clear we can send them forward for further consideration.  It takes time to do this and also the follows up for approval would delay my work progress and the denial of workers also slowed down my productivity cause alot of people have common names and if you had a case in the past the company would deny moving forward in the hiring process before an offer was made. \n\nCan someone please give me advise on this topic? ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1eqi6w9/can_a_employer_look_up_your_name_on_workers/",
      "comments": [
        {
          "body": "If you think it was illegal to do, you should contact the local office of the Department of Labor and/or an employment lawyer who would know the regulations of your local area.\n\nYes, these things take time to do, but you should have at least verified the legality in your mind before you resisted...",
          "score": 3
        }
      ]
    },
    {
      "title": "Is it okay to ask what a company's turnover rate is in an interview?",
      "body": "With how the job market is, job security is easily my #1 most important concern along with pay and benefits. I'm curious about turnover with this company for a remote W2 sales position. Is it appropriate to ask about turnover rates amd how? Job security is equally important for me as pay, especially in sales.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1benp1j/is_it_okay_to_ask_what_a_companys_turnover_rate/",
      "comments": [
        {
          "body": "You can ask, but you have to consider the value of the answer you receive.  If they tell you the turnover rate is low, you are still left wondering if they were being honest or just trying to sell you on the job.  And, in the rare circumstance where they tell you that turnover is high, no one is going to say \"this is a churn and burn job where the pay sucks, the expectations are high, and layoffs come often and randomly.\"  Like, for field technicians, I'll straight tell them that historically only about half of our technicians stay onboard through the first 90 days to be upfront that the travel/outdoor work lifestyle isn't for everyone - I've never met the person who hears that and doesn't still end up taking the offer...only to end up as that as person who realizes the travel isn't for them after all.",
          "score": 2
        },
        {
          "body": "Yeah I ask that all the time, but they'll lie. \n\nOne interview I asked the manager and he was honest and said 50%, then the final interview I asked another manager and he said 80 to 90% lol",
          "score": 4
        },
        {
          "body": "I ask it all the time. It gives them an opportunity to explain how/if they promote from within and it makes you appear interested long-term.",
          "score": 1
        },
        {
          "body": "I always ask. But if I get the job, I see if what they said was true too.",
          "score": 1
        }
      ]
    },
    {
      "title": "Scam Job Offers and Ghost Hiring",
      "body": "I don't really use reddit, but I am running out of options.\n\nI am 20(F) and I have been out of work for 5 months, almost 6. I got laid off from my previous job after I broke my ankle and my doctor's office failed to release their end of the paperwork for ny leave of absense before the deadline.\n\n I have been applying to jobs since september of 2023. I have gotten 2 interviews and besides that no call backs at all. I have stated on all my job applications that I am willing to work part-time, full-time, or seasonal positions (anything to get me back on my feet, i have under 10 dollars in my bank account as we speak and thus had to turn off my car inaurance and cancel my tag on my car). I have applied via Indeed, Linkdin, Facebook, Google Jobs, Monster, Seasoned, and a million other job sites that may or may not be scams, I willing to take the risks (I'm desperate). \n\nAnd this is where \"ghost hiring\" comes in. Ghost hiring is when a buisness puts out offers of a job amd collect as many applications as possible and never fill the position so they can put them all in an algorithm and basically exploit the information. I feel like i have been a constant victim of ghost hiring. I apply to a million jobs and none of the jobs ever find a person to fill the position, or I call the job and they straight up tell me they were never hiring in the first place. I get most applications off of the original sites for these companies too. Why am I being used as an algorithm? Why are so many companies doing this right now?\n\nI am unsure how my life will play out at this point. Im terrified. I cant even find a job at 20, what is it going to be like when im 30? 40? Will I ever retire?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/199z35b/scam_job_offers_and_ghost_hiring/",
      "comments": []
    },
    {
      "title": "jobs hiring immediately medical drive area , san antonio !! 78229 zip",
      "body": "hi ! my boyfriend has been struggling to get a job , seems like he gets so many interviews goes , gets told they'll reach out and NEVER DO !!!!! and it's not a reason as to why he's not hired so i don't get why it's so hard, he also puts in lots of applications but nothing.. (yes we've went over his resume we did everything , he calls ppls for them to say wait for GM or hiring manager who never seems to be around) is anyone else struggling to get a simple job ? \n\ni hope i'm not alone i just hate how hard it is , it was never that hard for me to get a job now they want extra go through amd they don't even do their part \n\nanyways; if anyone in the 78229 area can help get my bf a job please please let me know id greatfully appreciate it , doesn't matter if it's fast food, gas station, just something he's guaranteed to get into thanks if anyone can help us out :) ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1hrfb9e/jobs_hiring_immediately_medical_drive_area_san/",
      "comments": []
    },
    {
      "title": "Better to take a low offer and leave if another job is offered or try to negotiate the lowing paying job up so that you can complete the contract (even if a higher offer comes along)?",
      "body": "Hi,\n\nI know it depends on specifics, but I am grateful for any useful input please.\n\nAn internal recruiter contacted me saying I would be great for a PM role. I was flattered, but agreed to be considered, despite a low range. It was similar work to my previous roles, but I have had small consulting contracts the past 8 months and this could give me some security and stability.\n\nSo, I agreed the lower base of x as the HR recruiter said that is the top of the range for the PM role.\n\nThe next day, the recruiter told me that the hiring manager wasn't interested in me for that PM role - but was for another PM role on a six month contract. I explained my day rate was higher than my employee rate to allow for differences such as sick and annual leave et cetera. I was told it would be up to the hiring manager.\n\nTwo interviews later, the hiring manager verbally offered me the six month contract but said X was what the job paid.\n\nNow X is say 30% below market for that work but it is a verbal offer to start in one week.\n\nI have been upfront with all and have these other options\n\n\n\n1. A 9 month contract job doing reference checks. X plus 30% but a much longer and tougher commute and less interesting work. - low interest from me\n\n2. A staff job interview monday paying x plus 50% and great company. High interest from me\n\n3. Application elsewhere for 2x and 9 month contract. Highest interest. It's close with option 2 which is better as a permanent role, but this actual role would be better suited to my previous experience amd ambition.\n\n4. Other jobs. E.g. A headhunter called me today about another job. It is also paying around x, but the name of the company on your CV plus the experience would be invaluable!\n\n\n\n\n\nSo, what would you suggest? I could always take the six month contract and leave if I get a better offer but have always honoured my contracts. So I would prefer to either negotiate them up and stay the whole period. How best to politely negotiate with the six month contract at X or is 'that's what we pay' the take it or leave it point? It might lower my potential offer if they want to make me permanent later.\n\nOr is leaving a contract (with the appropriate notice per the contract) acceptable? I do not want to burn bridges, especially when an employer has chosen me to do their work.\n\n\n\nIdeas and a respectful approach forward are welcome.\n\nThank you",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1etlnc9/better_to_take_a_low_offer_and_leave_if_another/",
      "comments": [
        {
          "body": "From what you're saying, your best alternative to a negotiated agreement with these guys is... A job that pays 30 percent more...\nAnd you may be able to negotiate with them (your BATNA) even further to sweeten that deal- maybe some work from home days to save on the commute or an option to get into a different, more interesting, department a few months in pending good work.\n\nI would say that it's definitely fair to ask your first offer for more money. \"I'd really prefer to work for you, but I've been offered a position with someone else in X range and am hoping to get close to that.\"\nYou can also ask for things like extra days off, cell phone reimbursement, and other intangibles that come to mind and could sweeten this deal for you.\n\nAlso, by asking both your first choice and your BATNA for more, you'll probably drag them past Monday and have a chance to see if any of the fantasy options might be real.\n\nSo, short answer, it's definitely acceptable to continue negotiating. There's always SOMETHING that can be done.",
          "score": 2
        }
      ]
    },
    {
      "title": "Old story but good, sporting goods store edition ",
      "body": "So this is back in 2018 hope this isn't too long ago but the story has some interesting takeaways.  Tl:Dr is if they want you gone they Will make sure it happens.\n\nAlso am I the bad guy or was I railroaded months in advance?\n\n I was going to trade schoo after an attempt to do real college, learned I like work more than school and hate the idea of a teaching degree. So I was trying to do a cnc machining degree. i needed extra cash and Applied for a job at a huge sporting goods store in the  midwest.  When I applied for the job It was specificly for firearms sales (don't care about your politics its mostly shotguns amd rilfes for hunting anyways),  got the job and first week of training  was for firearms then they also trained me in every department for sales. Every sporting goods department Except athletics goods that is, And my god it was too much. I told them this job was only listed for one area of sales, they told me \"fine we won't have you do archery sales\". There are 7 other areas of sales. Freaking 7  distinct areas. No way anyone can be an expert in all and Taking one area away isn't enough. I know nothing in abiut 5 out of 7. The two I do know some in are firearms and fishing kinda.   Their training was horrible and they assumed it was good enough. From Day 1 I basically did what I was supposed to do followed the script \"up-sale that credit card, sugest paired items\" yeah no thanks it is predatory and slimy. So I became an odd salesman, being extremely personable and genuine able to make many sales with some repeat customers. We the salesmen would get a small percentage of sales made but only if we followed the script and \"actually sold the customer on items we suggested\" then you could write it down. This part I followed to a T finding if i judt have a conversation with someone interest then i cna ask \"whacha here for\" then ask if they have heard of X product. Which technically follows the rules. Rapidly I became a top 10 salesman. Making #1 several times. All while having intense class schedule. 7am-4pm then an hour drive to work.\n\n\nOne day I met a customer and he worked in the industry I was going to school for. He was Really impressed and asked for my name and number. Didn't think about it as 2 months pass. On my way to work one day i get a call from a random number, thinking it was a work person I answered. The Random guys boss offering me an interview for a paid internship at a huge injection molding plant/cnc shop. Heck yeah i jeed this for school and desperately need to learn hands on. So I go to the interview and while waiting an old man talks to me. He is a Very cool old man, Friendly and impressed. This guy could be a janitor or salesman. The interviewer walks up and looks terrified. Takes me away and goes \"you know who that was right?\" It turns out it was the owner of the company and he wanted me to get hired. I get the internship for a nice pay bump but keep the sporting good store job so I can get extra beer money. There I work 1 day a week and Saturday and Sunday at the sporting goods store. The rest of the days are at internship. The store freaking hated this assuming once I was done with school I would become a lifer making $10.25/hr no benefits for life and be cool with it. Yeah no. \n\nSo 1 year into this balance things were good except school was more intense. Now I was still making top sales, and I really enjoyed the discounts and extra cash from making big sales. Buuuuut there was an issue. Like I said earlier I was hired for firearms then they put me in almost every position. Because I had to work a certain amount of hours weekends were a must. I'm a young guy what happens when I need a weekend off?  Well i have to ask for it off 2 months in advance and they give it off normally.  If not I can ask 1 of 30 dudes to cover my shift. Simple. Works often enough it's okay, but slowly some guys don't even reply to me because in sales it's cutthroat and coworkers become enemies. \n\nThen the fateful day came for a random check into a sale, random checks are common and I passed them every time. This one time I made a mistake and said yes that product would work for hunting. Noooope turns out it was not legal to used in that in this hunting application. Truly I didn't know and should of asked. So i said yes that would work. Then the listening floor manager who hated me for while now popped out of no where and told me \"you don't know anything about spirting goods do you? you make top salesman because you are friendly and bullshiter. We don't do that here. You are not gonna get away with it anymore.\" Get written up and now many of my interactions are watched/listened to. No plan to train me. No way to improve. No reduction of my abilities.\n\nFast foward a month and Need a Saturday off for a date. No one answers, expect 1 old dude who was still friendly to me. Takes my shift. Sunday comes and the same manager takes me to a conference room and explains that because I was hired for firearms sales if I am scheduled to work and need it covered someone for firearms has to cover my shift. That's a problem. Most of the guys who work in that department are fulltime and do not work weekends. There was only 1 other guy annd he worked the same schedule I was on. So I explained this to the manager. He Said \"you need to follow the rules and figure it out.\"  Nice he hated me. \n\nFast forward a few weeks and My family was planning a big trip out if state, and I put the time off 3 months in advance. Minimum is 2 months in advance. When the that week came and The 2 week schedule was published;  I was on it for Saturday and Sunday. On the days I needed off. I talked to a different manager he said that if I put time off I should get it off. So He looked and couldn't find my paper that I submitted. Odd becauseit is filed away for this exsct thing. He talked to the manager that hated me who did the scheduling, bad combo btw, and then they came back to me saying \"well you clearly didn't ask for it off in time and are lying. If you need it off get someone to cover. Oh and make sure it is a firearms guy.\" I was pissed. You cannot imagine. I texted everyone, bribed with beer, offer to cover shift during the week, not a single person replied to my texts. My guess is the manager told everyine to not respond. There were nice people who always replied with a nice no, but this time nothing back at all. \n\nSo I talked with my boss at my internship. A great man who was my mentor after this talk, and really who i want to model my work life off of and He gave the option to intern Monday-friday, a pay increase to make up for my income drop, the option to work a machine on the weekends only if I wanted, expanded my duties too.  This sealed the deal. I truly want to thank him and hope he is doing good.  Back to the crappy sporting good store with the weekend when I was out of state came.  I got a call being asked \"hey you are supposed to be here where are you? And when can you get here?\" I told them that would be hard I'm out of state with no way to get there. He was like \"this is a no call no show...\" told him no I let you no 3 months ago you knew and you ignored me, you and I even talked about it and other managers knew I was planning on being gone. He soooo wanted to fire me right there but couldn't because technically they got notice of absence. \n\nGet back go in on Thursday with all the cards in hand. Literally no cares for the place. Didn't even wear work shirt. Didn't shave, didn't wear my name tag. Cleaned out my locker before clocking in. The moment I clocked in the crappy manager calls me into a meeting with \"the big guy\" the store manager. He was a good  guy honestly. \"I have been informed of the situation and we would like to rethink your position at the store. We are considering moving you cashier but you will be put on a growth plan. Also you will get a paycut moving downstairs.\" Straight up told him \"yeah no that sounds like crap, however let me tell you the bull that happens when you are gone.\" Explained the crap I was put through. Shook his hand and said \"I have other work lined up thank you for the opportunity.\" Drove away listening to the song from breakfast club turned all the way up flipping the store off. \n\nEpilog: 3 years later at my new career and actually saw the old nice guy coworker touring my place of work with one of the dudes who kinda mean. Honestly I am glad I didn't stay there. It was a place to die career wise. The nice guy waved. Which was well nice",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1fguhf0/old_story_but_good_sporting_goods_store_edition/",
      "comments": []
    },
    {
      "title": "Should I take job offer in private sector over my current job?",
      "body": "I currently work for a university making 55k. The role has good benefits, pension, and free schooling after 6 months, but they have a 6 month probation period where they can let me go for any reason. The way it was described though is that universities, rarely let people go, but I have had nothing to do at this job and they haven't really trained me on much which worries me. The office environment also seems cliquish and some teams are in silos that have hardly said anything to me since I've been there.\n\nI had an offer from an oil company for an in person IT role that pays 90k. But, the oil industry worries me about layoffs in the private sector. My dad told me to focus more on government jobs amd that i should stay un my current role because they are less likely to lay people off, idk if this is true though especially with the 6 month probation period in my current role. \n\nI would also have to move, cancel my apartment lease, and get used to a whole new area and coworkers which may be good or bad. Since it's for an oil company there would be a lot of travelling if storms came to facilities or business meetings etc. The interviewer said since it's a terminal oil storage company they don't have any layoffs compared to big oil companies that take losses directly based on oil price. He also said 30 people interviewed for the role and they haven't hired anyone since the last person left a year ago, does that really sound believable though?\n\nSo, is it worth leaving my current role at the uni for 54k for the oil company for 90, but I will have to travel, the job will have more duties, smaller team, and some on call work/travelling? And the fact that I will have to change my lease due to only being in my current job 3 months, or should I stay more at my current role?\n\nI'm also worried I won't have another opportunity like this. But, at the same time I don't want to take that other role, and get fired for a random reason.\n\nSo, is it worth leaving my current role at the uni for 54k for the oil company for 90, but I will have to travel, the job will have more duties, smaller team, and some on call work/travelling? And the fact that I will have to change my lease due to only being in my current job 3 months, or should I stay more at my current role?\n\nI'm also worried I won't have another opportunity like this. But, at the same time I don't want to take that other role, and get fired for a random reason. I also could keep applying for other jobs as a third option. I also had a university that wants to interview me in San Francisco for 90 to 115k, but idk if that's even livable there? So should I take the oil company role, stay in my current job, or keep looking?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/z27427/should_i_take_job_offer_in_private_sector_over_my/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "The university pays you a 54k salary, but in reality their compensation is much higher because of their cushy benefits. I can’t believe they still have a pension. What are the benefits at the oil company? Are they comparable? Is there any reason why you couldn’t negotiate with your current position for a higher salary? So many questions.",
          "score": 1
        },
        {
          "body": "My gov job has a six month probation too. It's nothing to worry about since realistically they could fire you anytime after the probation period unless you're a member of a union. The probation period itself only exists because there is/are unions within the organization and its predominantly for new employees who will be part of a union, but they just extend the probation to everyone to make matters simple. If you have nothing to do then seek out work to do- ask or create your own projects that you know will benefit you. If you need training then ask them to.   \n\n\nId' say at the very least stay until you could find another government job you like more. Those pensions are valuable, especially if you pair them with an IRA and 457b. You'll be set for retirement.",
          "score": 1
        }
      ]
    },
    {
      "title": "Haven't had a full time job since July 2022, struggling to find a job in tech to cover my bills. What should I do?",
      "body": "[27M] I've been working various jobs in the IT space since I went to college in 2013 so I have a huge amount of experience, not all of which is reflected in my resume since some of it isn't directly in tech or its jobs types that I'm not looking for anymore such as sale/retail sales or home automation/integration. My last job was a short contract with AMD as a Power Management Engineer but I haven't been able to find another comparable contract since then. In the time between then and now, I've started my own computer repair business in a official capacity under an LLC but its not growing as fast as I'd like it to. I've also picked up a part time job to get something steady and to soak up time but I haven't been able to find anything at all. In the last eight months, I've gotten three interviews, one of which was the part time I'm holding, out of over 400 applications.\n\nI've thought about taking a pay cut and jumping into culinary but that hasn't worked out in my favor either. I have training as a chef and I've kept my skills very sharp with home cooking since culinary school tends to drill certain habits and skills into you to the point that its the only way you do things. I got an interview offer there but never gotten a call back for a practical examination of my skills.\n\nI could take a pay cut in IT as well but the pay cut is much steeper and most places never reach out, or when they do its to decline my application because I'm overqualified. I don't know what else to do. I can't live off of $15/hr on a 20 hour work week for much longer. At least its more than what unemployment benefits was giving me. I thought about going back to school to finish my culinary degree but the TSTC branch that's near me in Austin only has classes that run from 9am to 2pm , which interferes with my part time. It also wouldn't start until the fall because they don't offer a summer semester there.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/126c4fz/havent_had_a_full_time_job_since_july_2022/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Why not get another part time job? $15/hr with 20 hours a week might be unsustainable, but maybe with 40 hours a week it’d be better. Also people who work $15/hr usually work more than 40 hours a week in order to get overtime.",
          "score": 1
        }
      ]
    },
    {
      "title": "New job wants me to start right away, what to tell current job?",
      "body": "Currently I am working as a sub school bus driver making 17 and some change an hour, no benefits or anything. I have no guaranteed hours as I'm not hired in \"fully\", just a sub. I fill in here and there or do trips on the weekend. There are 2ish weeks left in the school year. They want me to fill in a route for the remaining time, so work both morning amd afternoon shifts, I agreed to that last Monday. This would have worked fine because I have a driving job with usps lined up for 24.35 an hour, full career, but would not start til after school ended.\n\nOn Thursday I received a job offer from a position I applied to a couple months ago, it was a very long interview process and always took forever to hear back. Did not expect to get it, because I have no work experience in that position and only an Associate degree in the related field. They offered me 18 an hour, I refused because of the usps job paying so much more, and thought that was the end of it. The recruiter did some work and they counter offered yesterday on Friday with 23 an hour and a dollar raise after 6 months. She said they really liked me and want me working there so I accepted. \n\nThe company seems awesome with really good benefits and I liked the people there. They will also pay for me to finish my bachelor degree and get my masters. However, they want me to start Monday and I told my current place I'd cover that route for the next couple weeks. I feel really bad but I don't want to delay this new job. What is the best way to go about resigning with so little notice?\n\nSorry for all the info, but I felt like it needed explaining why I want to start the new job right away and how much of a step up it would be.",
      "subreddit": "jobs",
      "score": 8,
      "url": "https://reddit.com/r/jobs/comments/uplss3/new_job_wants_me_to_start_right_away_what_to_tell/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I'd ask the old job if they have anyone they could use for the last 2 weeks. You have something and would like to end without a 2 week notice but you're respectful enough to not screw them over.\n\nOtherwise? Tell the current job \"I'm putting in my 2 weeks\". Tell the new job \"Out of respect for my current job, I'm putting in my 2 weeks and I can start on May 30th. I'm excited beyond belief to start and will try to start sooner if possible but I'm showing my current job the same respect I'm sure you'd expect I'll show you.\"\n\nPersonally? I would feel bad to quit a job without the two weeks without good reason. They aren't giving you hours but they also haven't abused you (from the sounds of it). I've quit jobs without notice for various reasons - scheduling me days I requested off, not giving promised raises, etc.\n\nI always thought it was bad to screw over a company as the first act for a new company. It's like cheating on someone to start a new relationship... You're giving hints as to how you're going to operate in the future given opportunities.",
          "score": 4
        },
        {
          "body": "I would just tell your current job that you unexpectedly got a new role that needs you to start on X date, and you won't be able to take over the route as planned. If you are still willing and able to work weekends, you could offer that as your availability. If this was a full time role, I would be more on the side of giving 2 weeks, but for no guaranteed hours temp work, they get what they pay for. \n\nObviously you wish things were different, but they aren't, and you need to do what is best for you.  Also, consider if you stayed for your 2 weeks, you would be giving up an extra $6/hr that you could be making at your new job, that is an extra $240 a week assuming a 40 hour week.",
          "score": 2
        },
        {
          "body": "The only place I've ever worked that wouldn't respect the normal of giving a previous employer a 2 week notice ended up being a terrible place to work. I would advise you to push back and serve out the 2 weeks, if the recind the offer then you still have the UPS job on the table and probably dodged a bullet.",
          "score": 2
        }
      ]
    },
    {
      "title": "System admin paying 45k with overtop expectations",
      "body": "I had an interview a little while back decided to share here.\n\nI'll cut straight to the story. \n\nThe position was for a system admin, but they were looking for....\n-How to set up entire office network with servers\n-Understanding vlans and subnetting\n-Setup group policy. Based on client needs\n-setup firewall and other security systems\n-Work on muiltple sites and projects\n-possible weekend work\n-5+ years experience in networking and system admin.\n\nThis was just the beginning the list went on and on. \n\nAfter we talked they liked me and seemed like a decent fit and asked for my pay expectations. I previously got paid 58k and new job was 70k for my sys admin role. \nSo naturally i said 70k or more depending on benefits..\n\nThey said no way they would at best offer me 50k amd there was no wiggle room.\n\nI told them right after i would pull my interest which i found funny for them to be shocked. I said it was really shocking that they're looking for a network, system admin all rolled into one with that pay and all. That either they would be to reconsider the roll or increase the pay. \n\nWe went back and forth just a little longer but at the end I told them I apperciated the time and consideration but the role was not for me. \n\n\nI have no idea who in their right mind told them this salary and job went together but good luck to them and the sap that took the job. \n\nUnfortunately i don't recall the company. I just know it was a third party it support company. \n\nTldr: expectations were wayyy to high and pay was way low. Told them no and they were shocked and walked away.",
      "subreddit": "jobs",
      "score": 8,
      "url": "https://reddit.com/r/jobs/comments/rscnyz/system_admin_paying_45k_with_overtop_expectations/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Unfortunately, this seems to be fairly common. A lot of places will try to squeeze as much work out of you for as little pay as possible. They're just hoping someone desperate will come along and accept the job. Good for you for being firm with them and knowing your worth.",
          "score": 6
        },
        {
          "body": "This is what happens when IT doesn't listen to HR about market value of talent.",
          "score": 6
        },
        {
          "body": "Where are you located? I work in South Florida and I got an entry level junior network position starting at 55k, that was in 2018 and wages have risen considerably since then. \n\nSome companies try to get by on the cheap and honestly there's nothing wrong with that. It may not be the target role for you, but it serves a purpose within the community at the expense of the companies interest. One of three things is going to happen.  \n1) The position will go unfulfilled indefinitely.  \n2) They will eventually increase their offered salary over time to fill a position.  \n3) They will eventually settle for someone with less experience to fill a position.  \n\n\nMost of the time, companies that try to get by on the cheap settle for less experienced prospects. These companies are training grounds. Usually insane workloads that give applicants accelerated experience and after a year or two of putting in their time they're able to use that time as a launchpad for something much higher. The company ends up back to square one and usually suffers in return, but they are great places for newer talent that may not otherwise be able to get their foot in the door.",
          "score": 3
        },
        {
          "body": "This seems normal now.",
          "score": 3
        },
        {
          "body": "55k. What a fucking joke. It grinds my gears how many companies want technology but they just don’t want to pay for it. This is why I am upping my skills to do software in a software tech company. This is where the money is.",
          "score": 3
        },
        {
          "body": "It's unfortunate but the tech market is oversaturated because the entry barrier is low and the pay potential is high. These companies are trying to get more for less and there's always somebody willing to work for less",
          "score": 1
        },
        {
          "body": "Should have laughed at them and walked out the moment they said 50k.",
          "score": 1
        }
      ]
    },
    {
      "title": "I have anxiety about background check and want to talk about it",
      "body": "So I recently met a group of guys at a bar I was training at. I just moved back to this area after two years of bartending elsewhere. They immediately liked me, and told me to apply to their company bc they needed someone like me personality wise and energy wise. \n\nSo I applied and interviewed and it sounded great. \n\nI didn’t hear back for two weeks and then he called me, told me he had done a number of interviews, but it came down to me or one other individual. \n\nSo I went in for a second interview and after about an hour of talking he told me, it was going to be me. Took me out for lunch amd drinks with one of his sales guys. \n\nI didn’t hear back for a day, but then he called and officially offered me the job. He sounded so excited and so am I because it’s a great paying job, with benefits and could really change things for me. \n\nWhat I didn’t know was I would be doing a background check, and I have on misdemeanor on there. It’s driving related and my job doesn’t have anything to do with driving. It’s transport of open containers, which in the state I was in, it’s a misdemeanor. I didn’t realize this. \n\nNow since doing the background check it’s been a day and I’m having terrible anxiety about that disqualifying me from the job. I’ve never had to do a background check like this for any job since I’ve been working in bars. The charge is from 2020. I wasn’t driving but it was my car.  Bad luck. Nobody was drinking and driving.\n\nSo now I’m freaking out. Trying to remain positive but we will see. Fingers crossed.\n\nIt’s an equipment rental specialist at a construction rental business.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/r0tfti/i_have_anxiety_about_background_check_and_want_to/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "They probably will not care. No need to worry about something that you don’t know will even happen!",
          "score": 2
        },
        {
          "body": "We do multiple background checks at our company since our sales reps work all 50 states and require licensing. When we onboard new reps, I always tell them to make sure to disclose anything they might think might come up. \n\nWe really don’t care about misdemeanors, but some counties don’t report completely and it can cause small things look much worse then they are. So if we know ahead of time, we can work on it and avoid delays. Otherwise, sometimes we have to ask the new hire to go to the court and ask for records to complete the missing information, which causes delays.",
          "score": 1
        }
      ]
    },
    {
      "title": "AMD interview",
      "body": "So I have this AMD interview for Device characterization and Yield analysis for Next Gen APU intern (ik the title is scary). What questions can I expect..\nThe job description only mentioned basic electronics knowledge , basic programming knowledge and Microsoft tools.. confused lol\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ipy352/amd_interview/",
      "comments": [
        {
          "body": "You can expect questions that test your understanding of basic electronics concepts, semiconductor physics, and data analysis. They might ask about transistor operation, CMOS technology, or basic circuit analysis. You'll likely face questions about your programming skills, particularly in languages used for data analysis like Python or MATLAB. They may also probe your familiarity with Microsoft Excel for data manipulation and visualization.\n\nGiven the specific focus on yield analysis, be prepared for questions about statistical methods, process control, and how to interpret large datasets. They might present you with a hypothetical scenario involving chip yield issues and ask how you'd approach troubleshooting. Don't stress if you don't have in-depth knowledge of APUs (Accelerated Processing Units) - they're looking for your potential to learn and contribute, not expertise right off the bat. If you're feeling unsure about any areas, consider using a tool like this [AI for interviews](http://interviews.chat) to practice answering tricky technical questions. I'm on the team that developed it, and it's designed to help with exactly these kinds of specialized interviews.",
          "score": 1
        }
      ]
    },
    {
      "title": "interview with amd for principal machine learning software engineer",
      "body": "Just curious what I should be expecting with interviewing with them. Its a pretty senior role and I tried to tell the recruiter I don't think I am qualified, but they insisted the hiring manager was very interested in me. Any help would be great in preparing for the interview!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1fmh79w/interview_with_amd_for_principal_machine_learning/",
      "comments": [
        {
          "body": "Yea you’re not getting the role. Who would tell the recruiter they aren’t qualified for a $200,000+ job position. Or this is fake af. Either way you’re not getting the job",
          "score": 1
        },
        {
          "body": "First off, kudos to you for catching the attention of AMD's hiring manager! It's common to feel underqualified for senior roles, but clearly, they see potential in you. The interview will likely focus on your deep understanding of machine learning algorithms, software engineering best practices, and your ability to lead complex projects. Expect technical questions about ML frameworks, optimization techniques, and system design, as well as behavioral questions about your leadership experience and problem-solving approach.\n\nDon't let imposter syndrome hold you back. Prepare by reviewing your past projects and how they've impacted your previous companies. Be ready to discuss your vision for machine learning in the semiconductor industry and how you'd contribute to AMD's goals. To ease the stress and help you navigate tricky questions, you might want to check out [interviews.chat](http://interviews.chat) It's a tool I helped create that provides real-time suggestions and answers during online job interviews. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "I got the job!",
      "body": "So damn excited. I am lucky and it was timing thing. The people are nice. They were the only ones that felt human during the interview process.I was laid off from a big four in June my severance runs out on October 1st and I start the 6th. Just cleared the back ground d and received the offer\nI am in  IT amd have never seen it this rough 1000 applied for.jobs 10 1st round 5 3rd round 2 ghosts.on position closed and one gig.\n\nI am wishing us all good.luck as we need it.",
      "subreddit": "interviews",
      "score": 360,
      "url": "https://reddit.com/r/interviews/comments/1npj58y/i_got_the_job/",
      "comments": [
        {
          "body": "Thank you all you may not know, but the support in these forums has been integral to my mental health",
          "score": 41
        },
        {
          "body": "Just wanted to say thanks for posting this and giving us some hope.  I was laid off in May from a big corp and my severance just expired at the beginning of the month as well.  Luckily my company still gave me the bonus I was entitled to that came in this month.  I've got some prospects and have made it to the finals a couple of times, but nothing yet.  Stories like yours keep me going.  Congratulations!",
          "score": 17
        },
        {
          "body": "Congratulations. That's awesome 🎊......Lord I see what you doing for others, I know you will do it for me too😆🙌👏🙏",
          "score": 10
        },
        {
          "body": "Congrats! Perfect timing too ha!",
          "score": 8
        },
        {
          "body": "Excellent work. So proud of you!",
          "score": 4
        },
        {
          "body": "Horray!",
          "score": 3
        },
        {
          "body": "Congratulations!! 🎉",
          "score": 3
        },
        {
          "body": "Thank you!",
          "score": 3
        },
        {
          "body": "Hearty congratulations! Can’t wait to share mine as well. Cheers",
          "score": 3
        },
        {
          "body": "Congratulations!! Hope I'll be sharing good news soon",
          "score": 3
        }
      ]
    },
    {
      "title": "Need Advice for AMD SDE Co-op Interview Preparation!",
      "body": "Hi everyone,\n\nI have an upcoming interview for a Software Development Engineering (SDE) Co-op position at AMD and I could use some advice on how to prepare. AMD is looking for Co-op students to contribute to next-generation technology innovations in areas like AI, data centers, and gaming. The work culture emphasizes innovation, collaboration, and striving for execution excellence.\n\nHere's a  overview of the role:\n\nRole: SDE Co-op\n\nResponsibilities: \n\nDesign, develop, implement, test, and deploy engineering platforms and Python-based libraries\n\nDebug software by running experiments to help root cause issues \n\nAssist in maintenance of Linux systems within infrastructure\n\n \n\nThank you in advance for your help!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1cu46rt/need_advice_for_amd_sde_coop_interview_preparation/",
      "comments": [
        {
          "body": "How did your interview go?",
          "score": 1
        }
      ]
    },
    {
      "title": "Only getting interviews from large companies?",
      "body": "Been applying to internships for summer 2026 as a cs grad student and with under 100 applications I have interviews for 6 roles, all at big names or highly competitive roles (not FAANG but the likes of national labs/AMD), but am either rejected or have yet to hear back from any smaller companies I applied to. Is this a trend other people are seeing?",
      "subreddit": "interviews",
      "score": 15,
      "url": "https://reddit.com/r/interviews/comments/1orepnh/only_getting_interviews_from_large_companies/",
      "comments": [
        {
          "body": "In my experience, bigger companies hire interns earlier as they’re all competing for the best. The smaller companies tend to wait, either because they’re just not organized enough to start early or because they’re waiting for the next round of candidates so they’re not competing with the big names.",
          "score": 6
        },
        {
          "body": "Small companies are never organized enough to think about interns until right before summer/winter breaks. And some won't even hire, even if they claim to, due to budget constraints or they found someone in this market with experience willing to take a pay cut. \n\nPlus having worked at both, I would highly recommend you aim for one of the bigger companies for experience. It won't be as technical and crazy, but it looks better than a random startup that may not even exist or anybody cares about in a few years.",
          "score": 3
        },
        {
          "body": "Why would this be a bad thing?",
          "score": 2
        },
        {
          "body": "Bigger companies have more positions and will likely interview more candidates",
          "score": 1
        },
        {
          "body": "Yep, big companies have recruiters and pipelines, so you hear back faster. Smaller ones are slower or inconsistent. Follow up and try networking there referrals beat cold apps every time.",
          "score": 1
        },
        {
          "body": "That's great, those big companies look better on a resume and an internship is a great way to get hired.  \n\nSmaller companies don't have as many internships and more often hire family and friends (or friends kids).",
          "score": 1
        },
        {
          "body": "One thing that I don't think many people note is that the small companies might see that you are too qualified and they do not want you to reject them, they protect the company.",
          "score": 1
        },
        {
          "body": "Big companies have more manpower to give you a chance to interview, they also have more positions open. That being said there is a huge talented pool of candidates so don’t get your hopes up",
          "score": 1
        }
      ]
    },
    {
      "title": "GOLDMAN SACHS NOT RESPONDING AFTER REACHING OUT REGARDING SELECTION FOR SOFTWARE ENGINEER L2 POSITION",
      "body": "So Basically what happened was I got a message in linkedin after regarding my job application to Goldman Sachs in Bangalore. Here is the brief message I got from their recruiter. \n\n\"Hi ,  \n  \nI hope you're doing well! I came across your background as an \\*\\*\\* \\*\\*\\* \\*\\*\\*, and it sounds like you have a solid foundation in Artificial Intelligence and Data Science.   \n  \nI’m reaching out because I have an exciting opportunity at Goldman Sachs for an Associate Software Engineering role in Bengaluru. This position might align with your interests in problem-solving and new technologies. Your skills in AI and data analytics could be a great fit for the team.  \n  \nIf you’re open to opportunities, I’d love to discuss this role in more detail. Please let me know if you’d like to chat or if you have any questions!  \n  \nBest regards,  \nxoxo\"\n\n  \nI replied within 30 minutes of this message  saying that \n\n\"Hi XOXO, thank you for reaching out. I would like to learn more about this opportunity.\"\n\n  \nAfter that no reply, not even seen double tick mark in the chat.\n\nIt was like the recruiter completely ghosted me for (God knows what reason), it's been more than a week now and still it's the same. How am I supposed to take them seriously after this lack of communication. It was like giving false hope. ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1p5kx05/goldman_sachs_not_responding_after_reaching_out/",
      "comments": [
        {
          "body": "Recruiters are busy and you're not the only candidate they are interested in. They have to work with internal amd hiring teams as well and their needs are always changing. This isn't even a phone screen or the interview stage. You could just reach out again, but if they don't reply, just move on. Focus on what you can control.",
          "score": 1
        }
      ]
    },
    {
      "title": "Sucking at interviews.",
      "body": "How do I stop using filler words in interviews? Whenever I talk, I sometimes struggle with finding words to speak amd connect my points together, while other people seem to be able to do it naturally with ease. I end up using \"uh\", \"like\" all the time. It's not just during interviews that this happens in. I feel like this is the one thing I can't change about myself, and it really feels that I'm at a disadvantage here. My resume is fine, but when it comes to interviews, I screw up. ",
      "subreddit": "interviews",
      "score": 30,
      "url": "https://reddit.com/r/interviews/comments/1ffbuqx/sucking_at_interviews/",
      "comments": [
        {
          "body": "Take your time when speaking. Speak slowly. Write out answers to common interview questions. Practice saying them out loud till you speak fluidly. You don’t have to memorize the answers but practicing saying out certain words, phrases, etc can help. That way you’re less likely to ‘ramble’ or lose your train of thought/flow. You can also practice interviewing with a friend.",
          "score": 15
        },
        {
          "body": "Good advice here so far. Honestly, you have to actively train yourself to stop doing something that is a default behavior. One technique is to practice with a friend, where they ask you interview questions and you try to answer on the fly. If you say 'like' or 'um' stop and completely start over. Your goal is to get through a practice round without having to stop during any of your answers.",
          "score": 5
        },
        {
          "body": "Interviewing is an art. \nThe more interviews you attend, the better prepared you will be for the next \nInterview. Never turn down an interview.",
          "score": 4
        },
        {
          "body": "Try these ideas and tips:\n\n[https://www.youtube.com/watch?v=zdVDo2XaJ2w](https://www.youtube.com/watch?v=zdVDo2XaJ2w)\n\n[https://www.youtube.com/watch?v=EN0mUrbiJP4](https://www.youtube.com/watch?v=EN0mUrbiJP4)",
          "score": 3
        },
        {
          "body": "Replace those filler words with others! For “like” I use “in regards to” often &amp; also “and things of that nature” also “etcetera” for run off sentences. Anywho, it’s honestly so natural and for the most part, you’re not “graded” on that",
          "score": 3
        },
        {
          "body": "Eliminating filler words takes practice and conscious effort. Start by recording yourself speaking or doing mock interviews, then listen back and note every time you use a filler word. This awareness is the first step to improvement. When you catch yourself about to say \"uh\" or \"like,\" try pausing instead. It's okay to take a moment to gather your thoughts - interviewers often appreciate thoughtful responses over rapid-fire ones filled with fluff.\n\nTo connect your points more smoothly, focus on structuring your answers beforehand. Have a mental outline of key points you want to make, and practice transitioning between them naturally. If you're struggling mid-interview, take a deep breath and reset. I've been there too, and it's frustrating, but it's a skill that can be improved with time and effort. As someone on the team that made [interviews.chat](http://interviews.chat), I can say it's a tool designed to help with exactly these kinds of tricky interview situations, offering real-time suggestions to keep your responses on track and filler-free.",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "Do Toastmasters",
          "score": 3
        },
        {
          "body": "Take a deep breath before starting your sentence. Pause instead of using fillers—it's okay, everybody does it. Practicing common questions out loud can help too, even if it feels silly. It takes time, but keep at it! Interviews can be tough, but you'll get there.",
          "score": 2
        }
      ]
    },
    {
      "title": "Graphics &amp; AI Processor Design Engineer at AMD",
      "body": "Hi everyone, \n\nI have an interview scheduled with a recruiter for \"Graphics &amp; AI Processor Design Engineer\" with AMD. I am very excited about this opportunity but I am quite nervous too. \n\nI would appreicate any inputs you may have about any specific topics that I need to focus to excel the interview. I would request you all to please respond, as this is opportunity is very important to my career. \n\n  \nThank you all for you time. ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1mbyvxg/graphics_ai_processor_design_engineer_at_amd/",
      "comments": [
        {
          "body": "amd’s gonna want you tight on both fundamentals *and* cutting-edge AI/graphics stuff  \nbrush up on hardware design basics (timing, pipeline, microarchitecture) and AI accelerator concepts (tensor cores, memory bandwidth, parallelism)  \nexpect technical deep dives and problem-solving on real-world scenarios\n\nalso prep some clear stories on your past projects—how you tackled tough design challenges, trade-offs you made, and how you optimized performance or power\n\ndon’t just show knowledge—show you think like an engineer who owns the product end-to-end\n\nThe [NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has sharp takes on interview prep and nailing tech roles worth a peek!",
          "score": 1
        },
        {
          "body": "You need to be rock solid on digital design principles, computer architecture, and GPU/AI accelerator architectures. They'll want to see you understand parallel processing concepts, memory hierarchies, power optimization techniques, and how graphics pipelines work from vertex processing through rasterization. Expect deep dives into your past projects where you'll need to explain design trade-offs, debugging approaches, and how you've optimized for performance, power, or area constraints.\n\nThe behavioral side is equally crucial because AMD values engineers who can collaborate across teams and communicate complex technical concepts clearly. They'll probe how you've handled tight deadlines, worked through design conflicts with colleagues, and adapted when requirements changed mid-project. Be ready to discuss specific examples where you've taken ownership of problems and driven solutions forward, because they want people who can thrive in their fast-paced, innovation-driven environment. I'm on the team that built [AI interview tools](http://interviews.chat), which can help you practice articulating these technical concepts and navigate those challenging behavioral questions that often trip up even experienced engineers.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewer no showed",
      "body": "A recruiter reached out to me after I submitted a job application to get back into the field I was in before I moved to Texas and set up a date and time for the interview. I showed up a bit early but let the interviewer know I arrived as the front door was locked and no one inside. Tried to call the number they gave me and it wasn't to them but to a health care enrollment line. Confused I called the number they've been texting me by and it rang for a bit but sent to voicemail. Waited about 30 minutes, called and sent a text confirming we were still good for the interview. No answer. I did this about 3-4 times with 30-40 minutes in between each retry. There's no one around and I really wanted thos position since ive got experience in it already amd the required licenses for it (RR). It's now been 1 1/2 hours and no one has showed up and I have not gotten a response back in regards to the interview. I feel gutted but still determined to conduct the interview. Any tips for how to move forward? I dont want to leave without an interview but I also dont want to wait around if no one shows up but I also can't send an email as everything was pretty much done by text minus the application portion\n\nEdit for update: called one last time and it the phone range once before I was sent to voicemail",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1l78lwm/interviewer_no_showed/",
      "comments": [
        {
          "body": "Oh wow that is horrible I’m so sorry. It sounds like you’ve tried everything you can. Maybe just leave a voicemail and pack it in.",
          "score": 3
        },
        {
          "body": "They might have already moved forward with another candidate and forgot about your interview if it was scheduled a while back. I’m sorry, it looks like you might need to look elsewhere if you can’t get ahold of an actual person.",
          "score": 2
        },
        {
          "body": "That's just horrible- sorry that happened to you. Please write a Glassdoor review of your experience.",
          "score": 1
        }
      ]
    },
    {
      "title": "Did screw my chances getting hired?",
      "body": "I was told to give them a week at my first initial interview. And it seemed to go vary well considering they gave me a cut off date. We'll i waited a week and called on the seventh day. They said that the people I needed to talk to were busy and took my name and phone number. Later I checked indeed.  i check indeed everyday amd noticed during the week that the job listing got taken down. We'll when I called. it got put back up and it's got my anxiety way up. \n\nAnd to add to the storie. I did a second follow up call on Thursday. And the lady said that they had two interview lined up for Monday and Tuesday and to check back wedsday.\n\nInitial timeliness is the Monday of Thanksgiving week I had the interview l. I waited till the next Monday for my first follow up. Then my second follow up was on Thursday.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1hbx7mk/did_screw_my_chances_getting_hired/",
      "comments": [
        {
          "body": "Don’t put all your eggs in one basket, move on and keep applying for new jobs. If they call you back, great, accept! And if not, you’ll have other things on the go.\n\nAlways have a Plan B!",
          "score": 5
        }
      ]
    },
    {
      "title": "Fighting just for an interview ",
      "body": "So I got off the phone with a dental clinic she was  asking about my job history and its not bad but not great Either she seems to Focus on the bad like my hearing loss (born with it)  amd fact that I quite my job due to stress for my wedding that was (i was a year ago) i still got the interview but i feel like had to pull her teeth now for it. I told her im not who i was a year ago im Determined and egeger tto learn so i do get her to not focus on the bad i drive the conversation to the good in the physical interview next week she seems very Hesitation on the phone",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ecvlrm/fighting_just_for_an_interview/",
      "comments": [
        {
          "body": "Be confident and proactive in showcasing your strengths during the interview. Emphasize your determination, willingness to learn, and how you've grown over the past year. Keep the conversation focused on your positive attributes.",
          "score": 2
        }
      ]
    },
    {
      "title": "Question regarding recruiters amd their responses",
      "body": "My husband interviewed fir a job last week that he really wants. He sent a follow thank you email to the two people who interviewed him the next day. As expected, he didn't hear anything back. 7 days after the interview, he emailed the recruiter who coordinated the interview- he thanked him and told him to let him know if there was anything else needed. The response from the recruiter was this: \"we are meeting Mo day to discuss. Please give us a little more time.\"\n\nIs it common for recruiters to share the timeline of decision making or does it vary by company? ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1pl6qn0/question_regarding_recruiters_amd_their_responses/",
      "comments": [
        {
          "body": "That's actually a pretty good sign tbh - most recruiters will just ghost you or send some generic \"we'll be in touch\" response. The fact that they gave you a specific timeline (even if it's just \"Monday meeting\") shows they're at least thinking about your husband as a real candidate\n\n  \nTotally varies by company though. Some places are super transparent about their process, others treat it like state secrets",
          "score": 1
        }
      ]
    },
    {
      "title": "After 6 interviews and case project got rejected upon follow up",
      "body": "So there is a mid size IT company in uae reached out via linkedin and after 1st interview they paused it saying they'd need someone local in bangalore, not my area backed out.\n\nAfter 2 weeks they reached out for international opportunity in uae which I jumped as dream location and the job amd industry I like \n\nSecond interview 1 weeks later and 2 weeks later another interview and and then 2 weeks later another interview all ad hoc, and 2 weeks later another interview have a project. Reason we want to be sure because we failed at marketing thrice so dont want to \n\nMinimal brief and said we'll judge on how you make plans and articulate stuff, despite showing it all on zoom interview sharing my screen and showing all that I do, did the task researched for 2 weeks, used ai wherever possible even made reels on canva, not my area of expertise, made nurturing sequence,  whitepapers, linkedin ad and even landing page content, after 3 weeks of follow up got to know, they're not moving forward with my candidature.\n\nReason : the assignment analysis didn't make the cut.\n\nIt'd have been widely respected if that should be have already come from their end that they re not moving ahead with me not like me following up twice and getting to know my rejection that too on WhatsApp.\n\nAsked 2 days later, when the recruiter got to know thia update, what more did they expected asked to just improve myself, and asked for compensation as they mentioned they'd give for the time spent on project.\n\n2 days not reply yet. \n\nRecruiters and companies make a joke of their own processes \n\nGlad that didn't join them for such slow processes and unprofessional behaviour otherwise now I understand my career would be ruined. With suxh unorthodox set up",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1og8pv0/after_6_interviews_and_case_project_got_rejected/",
      "comments": [
        {
          "body": "anything above 3 interviews and im out.\n\nthey are not interested in hiring at that point.",
          "score": 1
        },
        {
          "body": "Damn, 6 interviews plus a project and they ghost you on WhatsApp? That's straight up disrespectful. Companies that can't even give proper feedback after making you work for free are showing their true colors.\n\nFor future case studies, I'd suggest prepping with mock interviews since these marketing roles love their presentations. I tried Final Round AI's mock interview feature and it really helped me articulate my thought process better under pressure.\n\nYou dodged a bullet honestly, any company with that messy of a process would be hell to work for.",
          "score": 1
        },
        {
          "body": "How does mock interview ai works ?",
          "score": 1
        }
      ]
    },
    {
      "title": "Bad interview today (faang) not sure if I can do it anymore",
      "body": "Finished 4 rounds before and had 2 rounds (loop 1) back to back today for a data scientist role at a FAANG company. 5th round went great, 6th went bad I feel. The interviewer didn't show warmth during intro and got deep into what they do in the team and how we might work together. I didn't even get a chance to talk a little at the start to ask how their day was going. As we were done with their intro, we got into my intro and she had questions from the start. \nAll the interviewers I had for all companies received the same intro of mine. This interviewer was the only one who asked me to repeat stuff since they didn't understand what I spoke about. I found that surprising since I used the same talk everytime. \n\nNext I told them how my past experiences perfectly align with what they just described. They got curious and asked me what I did before, I explained everything in depth but they still had questions on what I did. I always explained my qork and thoughts clearly so I was surprised again when I had to repeat stuff. \n\nThen we got into a specific topic and they asked me to explain, which I perfectly did even though I haven't worked on it before. I prepared so much for these interviews and its truly heartbreaking when all I get are rejections for reasons out of my control. I've been rejected from 10 interviews in the last few months mostly due to external factors. As an International student its put a lot of bad thoughts on my head right now. \n\nThe interviewer finally asked me a basic question about measuring X. And I feel I messed up here amd gave a very generic answer and they might have wanted a more structured answer. I've done 5 interviews very well and this one seems to be the most important one since they work with the HM directly a lot. My result from this would move me ahead to another 4 rounds. (Yes they have 10 rounds of interviews for a entry Data Scientist role). They stopped questioning 25 min into the interview and the round was for 45 min. I asked some questions and we ended it.\n\nI'm not sure what do I do anymore. I moved to a new place, broke, bleeding dry with no money in hand and have to get it from my home country. Its been 2.5 months since graduation. \n\nDo i stop focusing on Data scientist roles and apply more to analyst positions? But the volume of applications here are much higher and chances to even get to the 1st interview is almost very hard. I've had really bad thoughts today and im not sure if i can do it anymore. Need help please",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1n72uha/bad_interview_today_faang_not_sure_if_i_can_do_it/",
      "comments": [
        {
          "body": "Hey, I would keep interviewing and don’t lay all your eggs in one basket. This has happened to me with top companies and what help was controlling the narrative on my end. It’s ok to ask chatgbt too but you’ll just keep overthinking it.\n\nPut it to rest. if you can land an interview that far at a faang, you’ll go far with persistence. Keep applying you got this",
          "score": 7
        },
        {
          "body": "&gt; how my past experiences perfectly align\n\n&gt; which I perfectly did\n\nIn my book, that's 2 \"perfectly\" too many already. \n\nUnless you can read the interviewer's mind, there's no such thing as a perfect answer.  \n\nAlso, you should absolutely expect questions and never assume that somehow your answer was good enough it doesn't warrant further probing.",
          "score": 2
        },
        {
          "body": "I'm sorry that happened to you, I don't know what to suggest really, just keep preparing for interviews, don't give up (because if you do, that won't solve your situation). Ask your parents for a final amount and literally interview anywhere. For data science you may find this useful: [https://github.com/TidorP/MLJobSearch2025](https://github.com/TidorP/MLJobSearch2025)",
          "score": 1
        }
      ]
    },
    {
      "title": "What are my chances ?",
      "body": "Did my loop with AMD a few days ago and did ok in 3 rounds and the 4th was Code review and hardware round - i didn't have any hardware experience and did ok in code review  - yet to hear back .. what are my chances #AMD #Interview ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1m2nfe1/what_are_my_chances/",
      "comments": []
    },
    {
      "title": "What are my chances?",
      "body": "\n\nDid my loop with AMD a few days ago and did ok in 3 rounds and the 4th was Code review and hardware round - i didn't have any hardware experience and did ok in code review  - yet to hear back .. what are my chances #AMD #Interview ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1m8j5y7/what_are_my_chances/",
      "comments": []
    },
    {
      "title": "About have carmax (sales) interview. Any advice?",
      "body": "In a few ho8rs I'm about to have a sales interview for carmax.   Any advice or questions I can ask to stand out?  \n\nI'm planning on wearing slacks amd a nice button up.   Or should I wear a jacket?\n\nI'm nervous and probably fretting.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1gwmouq/about_have_carmax_sales_interview_any_advice/",
      "comments": []
    },
    {
      "title": "Interview Advice",
      "body": "I’ve an interview on Monday 3PM IST for AMD. Interviewer is director of software engineering for multimedia domain. This is the very first round. I’ve worked on multimedia domain(&lt;1 year) and Linux user space, middleware and driver level(about 3 years)\n\nWhat questions can I expect in the very first round? Please suggest.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/119zwpt/interview_advice/",
      "comments": [
        {
          "body": "Maybe post in the software engineering reddit? I think this is general interview and although I'm a software engineer I dont work with driver software. If its first round it will most likely be a general round where they want to learn if you are easy to talk to and can work with others. Usually they test your culture fit first and then assess your technical skills. At the end of the day when hiring the former is more important than the later because universities will continue pushing out more qualified people so that resource is not in short supply, what's harder to find is one of these qualified university educated people that is also humble and can work well with others. This is especially true as people grow more self centered in our modern culture.",
          "score": 2
        }
      ]
    }
  ]
}