{
  "company": "atlassian",
  "post_count": 29,
  "exported_at": "2026-01-18T17:44:53.259Z",
  "posts": [
    {
      "title": "Struggling, laid off game dev here. Trying to break out of my industry with no luck for the last year, Any help?",
      "body": "Got laid off a little over a year ago from a 6 figure SWE job in the game dev industry. Took a few months off for myself because a family member died around the same time, then got back on the grind. I've been actively searching/applying for the last year with exactly one interview to show for it, who ended up planning a second interview and then ghosting me. I am tired and frustrated, and frankly, becoming hopeless and depressed. I've basically given up on the idea that any game studio is going to hire me, and I'm searching for literally any developer position at this point, and willing to cut my expected salary to about $70k. If I don't find anything by the end of March, I'll have no choice to go flip some burgers or like a call center. Anything.\n\nI'm pretty satisfied with my resume, representing a mid-level SWE, which I think is a fair depiction of my skills. Despite how I feel though, it's clearly not good enough for anyone to even want to talk to me. I personally believe the biggest flaw is the lack of a web development experience, but I think I'd still be more than qualified for that type of position. FWIW I also have like 5 years of fiverr/vWorker/Freelancer.com experience not depicted on here, but that work was a side hustle, and the quality volatile at best, so I have a hard time justifying its value.\n\nSo I'd like to ask you folks, what edits would you make or suggest to get more traction? TIA\n\nhttps://preview.redd.it/finbhnlb44le1.png?width=718&amp;format=png&amp;auto=webp&amp;s=0d98c9bf9b33e517437b68ef476af613d86ca8dc\n\n",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1ix6f5f/struggling_laid_off_game_dev_here_trying_to_break/",
      "comments": [
        {
          "body": "You had your good time. Any SWE job shouldn’t be 6 figures. Just tell me why do you think you worth more than an accountant or constructor? ",
          "score": 2
        },
        {
          "body": "Try r/resumes.",
          "score": 1
        },
        {
          "body": "Heyy I am a student and I got a project regarding animation and making an app so please can you guide me it will be a great help sir 🙏🏻",
          "score": 1
        }
      ]
    },
    {
      "title": "Tech industry not hiring either?",
      "body": "Hi,\n\nI work in IT with Atlassian tools, and AFAIK almost all Atlassian partner companies wanted to hire Atlassian admins or consultants to strengthen their team. They all had job postings on their webs that they are hiring (some still are!).\n\nLast month, I sent my CV to about 30 companies that actually were looking for Atlassian admins/consultants and not one offered me any kind of project. Mind you, I have been in the field from 2015, so with optimism I would consider myself average-to-senior, so it wasn't because of my skillset.\n\nI event went through an interview and the company then told me they welcome me to the team and that they will send me a contract in a week, just to tell me they're not looking for anyone at the moment a few days after. And two companies told me they will have projects in fall at best.\n\nI just don't get it. Is the IT industry so badly impacted by Covid, too, or am I doing something wrong?",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/hscpqh/tech_industry_not_hiring_either/",
      "comments": [
        {
          "body": "When you say IT, do you mean you restart computers and plug in monitors or are you a CCNP-qualified network engineer or are you a OSCP-qualifier sec eng on the security side of IT?",
          "score": 3
        },
        {
          "body": "Not as directly as other industries, but you have to think about the business model of places you are applying to.  A company specializing in software for service, travel, commercial real estate, etc is going to be in a bad way now. Those are the most drastic examples, but even stuff like healthcare, anything that was tied to elective procedures or non-essential healthcare took a massive hit too.\n\nAny company that may feel impact from Covid is 100% tightening its belt for Q4 because all of the experts think we're about to get really hit in the US",
          "score": 2
        }
      ]
    },
    {
      "title": "Help with deciding between two job offers - both are Software SaaS based in Toronto",
      "body": "Hi everyone,\n\nI've received two offers as a SDR for two SaaS companies in Toronto. I would say both of them are very high on my list, and I have trouble between the two, at this point it's more of a compensation question but I am also considering company culture as well.\n\nOffer # 1 - Research &amp; IP Software SaaS\n\n* Very niche product - product is for Research and Development to help them gather information such as market trends, competitive markets, for their patents and projects during the innovation phase, they call it \"connected innovation\" platform\n* A mix of outbound and inbound outreach - I'd be working with an Account Executive who would mentor me and I would work with them to do outreach for their terrority\n* Compensation: 50K Base with 80K OTE\n* The manager seems chill, I interviewed with them last year - the company is still young in Toronto, based out of a WeWork but it is in a growth stage. One of the AE managers in the interview seemed quite serious though, but I don't think I'd report under him\n* Reviews are quite mixed, some say that it is growing and good people, others say there is a senior management turnover because they want to grow so quickly so things end up changing a lot\n\nOffer # 2 - Atlassian Consulting SaaS\n\n* This company provides Atlassian product consulting and Atlassian product add-ons, so not quite a unknown in the market\n* In this role specifically, I would be also working on to keep up with product renewals and find opportunities for expansion, where then the AE or Account Manager would come in and help to close. I would also be responsible with working with leads from marketing campaigns, from the website, etc, I would be working with primarily inbound leads in this role, not outbound\n* Company has great culture, about 4.9 out of 5 stars on Glassdoor, out of 39 reviews and I connected well with the Inside Sales Manager, and Dir of Client Services. My manager plays Battlefield which I do as well and the Dir of Client Services has been with the company for 6 years. Company also bought everyone Disney Plus during the pandemic to help them go through.\n* Compensation: 45K Base with 65K OTE\n* SDR team is new, I would be one of the first two hires - my manager said he is quite open to receiving feedback as he builds the team and there is an opportunity to make an impact as one of the first hires\n\nAt the moment, I am leaning towards Offer # 2, mainly due to the fact I feel working with product renewals can help me with learning how to transition into an Account Executive better, and it is something new I haven't worked with before. As well, being part of the new SDR team is exciting and something I'd like to try, and working with inbound leads would help me I feel with hitting quota more easily.\n\nOf course, there is also the compensation factor, and with Offer #1 offering a lot more, I feel very inclined to take that over offer # 2. One of my friends did say it wouldn't make sense to take Offer # 2 because it is more work for less money (due to the product renewals), but again I am considering other factors than just compensation.\n\nFrom what I have said, what seems like the best offer and the one I should take?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/ja5hg6/help_with_deciding_between_two_job_offers_both/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Unprofessional coding interview - Atlassian",
      "body": "I went through Atlassian’s coding design interview recently, and the experience was surprisingly poor for a company of this scale. The exercise itself was simple: implement a small rating system where each agent receives 1-5 ratings, maintain a running average, and return agents sorted by their average rating and number of ratings.\n\nI completed the implementation correctly, including the standard running-average calculation:\n\nnewAverage = (existingAverage \\* existingCount + newRating) / (existingCount + 1)\n\nHowever, the interviewer seemed genuinely confused by this formula, a basic math concept and repeatedly questioned it, even after I walked through examples step by step. It was concerning that the interviewer assessing this problem didn’t understand the fundamental logic behind the exercise they were responsible for evaluating.\n\nA follow-up “scale-up” question asked me to extend the system to support monthly averages, grouping ratings by month and returning the monthly score. I solved that as well without difficulty, and the interviewer acknowledged I handled the extension correctly.\n\nAs a matter of fact, the interviewer gave me positive feedback on the spot, saying the solution looked good and that I solved everything they asked including the scale-up question. But the final result from Atlassian was the opposite: a rejection with no explanation or feedback. When I specifically requested feedback, especially since what I was told live contradicted the official outcome, I received no feedback and was told they are not allowed to share this.\n\nRecruiter communication throughout the process was equally disappointing, often taking 2-3 business days to reply to straightforward questions, which added to the overall sense of disorganisation.\n\nOverall, The coding interview demonstrated poor preparation, inconsistent assessment, and a lack of transparency, especially when the interviewer verbally said the solution was good but the official result contradicted that with no explanation. On top of that, Atlassian only uses one interviewer each round, which increases the risk of bias or misunderstandings impacting the decision. Most companies use two interviewers to ensure fairness and reduce the chance of a single person’s confusion affecting the outcome. Combined with slow recruiter communication, the process felt unprofessional and below the standard expected of a company of this size.",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1p2ludq/unprofessional_coding_interview_atlassian/",
      "comments": []
    },
    {
      "title": "Atlassian intern interview process",
      "body": "I was wondering if anyone has any insight into their process. There's only 1 review on Glassdoor. They emailed me a hackerrank test (90 minutes, 6 questions). Does anyone know what these tests are like? I've never used hackerrank before. Thanks! ",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/5vm6sg/atlassian_intern_interview_process/",
      "comments": [
        {
          "body": "Not sure if you're in the States or AU, but the AU process is as follows:\n\n1. Hackerrank test, like you described. 6 questions in 90 minutes, each worth an increasing amount of points. You can attempt them in any order and I think it states you only need to answer two. You'll get points based on how many test cases your code passes, and if you get enough points, you'll move onto the next round.\n\n2. Recruiter phone screen. This is more behavioural / culture fit, at least in my experience.\n\n3. Final round, broken up into 3 parts. Coding (implementing an interface), design (talking about a project you've worked on), and general technical knowledge (a whole bunch of questions about various comp sci topics).\n\nEdit: Formatting.",
          "score": 2
        }
      ]
    },
    {
      "title": "Algo+DS still relevant for non-FANG?",
      "body": "In your experience, is LeetCode-style interview prep still relevant for Senior SWE roles in non-FANG companies? Do companies focus on Algo + Data Structures or do they care more about your experience?\n\nEdit: I don’t mean FANG companies specifically, I’m talking about “FANG-like” Big Tech companies in general - Microsoft, Atlassian, etc",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1854fvy/algods_still_relevant_for_nonfang/",
      "comments": [
        {
          "body": "Yes.\n\nYour experience gets you the interview and drawing upon it allows you to give good answers to some of the questions. But at some point a long the way you're almost guaranteed to get a leetcode style interview. If you don't do well on the leetcode part of the interview, you won't get the job even if everything else went well.",
          "score": 12
        },
        {
          "body": "I've been able to get many jobs without it but it does come up here and there (outside of FAANGs). It's best to at least get confortable with the easy ones to save yourself some humiliation. \n\nThe bar is pretty low because most people don't practice LeetCode at all so you are one step ahead if you do.",
          "score": 6
        },
        {
          "body": "Leetcode is just too easy of a mechanism to weed out false positive candidates.",
          "score": 8
        },
        {
          "body": "With a few weeks of practice easies will become second nature. Your actual production code will get better too btw.\n\nEven FAANG asks mostly easies and mediums. People blow them way out of proportion",
          "score": 5
        },
        {
          "body": "It's important to realize that DSA isn't just because \"here's some shit you'll never ever ever use\" -- data structures and algorithms, the ability to understand them, use them effectively, opens up whole worlds of opportunities and raises the ceiling for your career.\n\nMicrosoft isn't included in FAANG -- I was on the Visual Studio team -- don't you imagine that data structures/algorithms comes up there?   Nvidia -- also not on FAANG -- don't you think a company like that is using data structures or algorithms in their self-driving groups?\n\nThink of any company that actually builds a database -- Oracle for instance -- not FAANG, uses algorithms.\n\nA career where you never ever touch DSA again is entirely possible.  But if you want to do actual really interesting work, then they will come up.  Even if those companies never leetcode you, the knowledge you bring to the table will dictate the kind of problems you get put on.  Personally, I want to work on the interesting stuff.",
          "score": 4
        },
        {
          "body": "I’ll never forget the company I interviewed with that had less than 50 employees. They were a non-tech company. The interview was an LC medium plus LC hard with a follow up system design all in 90 minutes. This was live and for a junior position.",
          "score": 2
        },
        {
          "body": "Yes, while not some you explicitly use, you inherently use it any time you are building anything that has to scale.\n\nNot understanding the basics leads to sub-optimal code.\n\nNow, I will give you the benefit of the doubt and maybe you are special and can intuit all the optimizations that come from knowing this stuff, but most people cannot.",
          "score": 2
        },
        {
          "body": "I’ve never not had to Leetcode at some point in every interview cycle I’ve been a part of except one, back in 2021, which was for the tech department in a clothing company so not very high end tech.",
          "score": 2
        }
      ]
    },
    {
      "title": "Looking for recent interview experience",
      "body": "i have a loop interview at atlassian for senior software engineer. if anyone has appeared for the same (fullstack software engineer) could you please shed some light on what to expect in full stack cart round? need details ASAP",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p2wjra/looking_for_recent_interview_experience/",
      "comments": []
    },
    {
      "title": "Atlassian managerial round",
      "body": "Today i got an email that i have passed the technical round for MLE p40 at atlassian ( 2 ML system design and 2 coding rounds one of them being an ML coding) and they would like to setup 2 behavioral rounds as the final stage of the interviews. I was wondering what type of questions they would ask and can i celebrate early knowing if i don't come off as an asshole the offer is highly likely??\n\nI have 5 years of experience and work at Amazon as an  L5 MLE TC 260 but will take a massive hit in 2026 due to running out of stocks",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/1pq7mp1/atlassian_managerial_round/",
      "comments": [
        {
          "body": "Hi, I advise you read up on Atlassian’s values, and practice the STAR approach, you can find more info on the official page, there is a brochure as well",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Thought companies give refreshers so ur tc doesn’t fall off",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "dont celebrate yet, ive seen people make it to final loop at big name places and still get no offer behavioral can kill you if youre not aligned with their values anyway yeah even with amazon the hiring market right now is just horrible",
          "score": 0
        }
      ]
    },
    {
      "title": "UT Austin MSCSO vs Georgia Tech OMSCS; Backend-focused, admitted for Spring 2026, need to decide by Aug 21",
      "body": "Hi everyone,\n\nI’ve been admitted to UT Austin’s MSCSO and Georgia Tech’s OMSCS for Spring 2026. I need to make a final decision by August 21st, and I’d really appreciate insight from those familiar with either program.\n\nI’m primarily aiming to make up for a weaker undergrad (T250-level school) that negatively affected internship search and improve my chances at stronger internships and full-time SWE roles, especially in backend development.\n\n\nKey Decision Points\n\n Graduation Timeline:\n\nUT Austin MSCSO allows full-time enrollment → can finish by May or Dec 2027, giving 1–2 chances for summer internships.\n\nOMSCS is capped at 2 classes per semester → May 2028 at the earliest, even with maximum credits per semester.\n\n Course Fit:\n\nOMSCS has a much broader, deeper catalog in systems, distributed computing, databases, software engineering, etc. which aligns more with my backend interests.\n\nUT Austin MSCSO is theory-heavy and AI/ML-focused, with fewer backend-focused options.\n\n\n Resume Signal &amp; Perception (matter significantly for me as my purpose is making up weak undergrad and signal matter singificantly for getting interviews or resume being actually looked):\n\nOMSCS has a huge cohort, and I’ve seen some concerns that it’s losing value due to oversaturation and ease of admission.\n\nUT MSCSO is more selective and may carry better resume signal (e.g. ATS filtering, employer perception). Not sure how much the difference is in practice, though.\n\n\n Internship Eligibility:\n\nI finish my undergrad in Dec 2025, and will be applying for Summer 2026 internships starting Aug 2025.\n\nI’ll qualify as a grad student, but some companies (Meta, Adobe, Atlassian, Capital One, etc.) require full-time enrollment, which OMSCS doesn’t allow.\n\nFor Google, I asked a recruiter, part-time is sufficient.\n\n\n Projects &amp; Portfolio:\n\nI likely won’t have bandwidth for side projects during MS.\n\nI’ll be relying on course projects + past internship work/projects.\n\nGiven I already have multiple full-stack/backend projects and internships, I’m not sure if more personal projects would provide much marginal gain anyway.\n\n\n SWE Internship Experience (anonymized)\n\nInternship 1 (F500, AWS-heavy backend):\n\nAWS Lambda, SQS, CDK, DynamoDB (Python)\n\nImproved test coverage (Java, Python), CI/CD\n\nBuilt a financial planner app (React + AWS)\n\n\nInternship 2 (small startup):\n\nFull-stack app with SvelteKit, PostgreSQL, REST APIs, Tailwind CSS\n\n The Dilemma\n\nIf UT Austin had even ~70% of the course variety that OMSCS offers in systems/backend/SWE, I’d pick it with no hesitation.\n\nBut I’m currently split between:\n\nOMSCS: much better alignment with backend focus, but longer timeline and possibly weaker resume signal.\n\nUT MSCSO: stronger branding/selectivity and internship eligibility (big deal for 2026 cycle), but narrow, theory-leaning curriculum that may not offer much practical backend value.\n\n\nMain goal: Make up for undergrad brand + land stronger backend internships/full-time roles.\n\nWould really appreciate any advice especially if you’ve done or considered either program. Thanks a lot!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1mf7o4z/ut_austin_mscso_vs_georgia_tech_omscs/",
      "comments": [
        {
          "body": "MSGPT",
          "score": 10
        },
        {
          "body": "OMSCS won't lose value to oversaturation. Yes, it's easy to get in, but it's hard to get out of. It's a serious accomplishment and people in industry know how much work it takes.\n\nI did OMSCS. It's nice to have like 50 courses to pick from.\n\nThere's a little bit of value from the signal on your resume, but the real value is the 2000 hours I spent on projects. Huge help in going from junior to senior engineer.",
          "score": 13
        },
        {
          "body": "This makes me pretty sad to read as someone who went to a dogshit school and had zero problems finding a job for the last 11 years up until a year ago. Even now, I'm getting interviews using the trusted method of applying early to new postings.\n\n  \nI'm glad I'm not graduating into this mess or trying to get my foot in the door.",
          "score": 5
        },
        {
          "body": "Curious, why is “O” at the opposite ends of the acronym in both cases? One is an Online Masters of Computer Science, and another is a Masters of Computer Science Online?",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "UT. You're basically betting big on internships and full-time enrollment is going to maximise your chances there, even if it's one fewer summer (both from the perspective of maximising the number of companies you can apply to and for avoiding bias against part-time students).\n\n\nIs this a good bet to be making vs an in-person program? That I don't know.",
          "score": 1
        },
        {
          "body": "OP, did you end up picking a school? I am pretty much in the same situation for spring 2026 as you",
          "score": 1
        }
      ]
    },
    {
      "title": "Thoughts about Atlassian India",
      "body": "I am a frontend developer with approx 5 YOE. I am considering switching to Atlassian for the frontend dev role. The main reason is that I desperately need to work remote due to some personal reasons. I am preparing for the interview and the interview process also seems very exciting to me. However today I logged into blind to see people commenting the worst things about Atlassian. Now I am not sure what to do. \n\nIf anyone here has worked in Atlassian India please share your experience.\n\nAnd if indeed Atlassian is bad suggest me some more companies in India which can offer remote work and a good work life balance ",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1k9d6fa/thoughts_about_atlassian_india/",
      "comments": []
    },
    {
      "title": "How long after the final round should I expect to hear back?",
      "body": "I had a final round interview for the software engineering internship position @ Atlassian on Tuesday (9/26/23). It’s now been 48 hours and I’ve not heard anything, wondering how long I should wait before hearing back/sending a follow up email",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/16uj57s/how_long_after_the_final_round_should_i_expect_to/",
      "comments": [
        {
          "body": "If you haven't heard back in a week, reach out to your recruiter. They should be able to let you know an expected timeline for hearing back.",
          "score": 4
        },
        {
          "body": "5 business days",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Did you send a thank you?",
          "score": 0
        },
        {
          "body": "A few days to a week max. You can send a nice email after that to show interest. You might get some feedback then.",
          "score": 1
        }
      ]
    },
    {
      "title": "2023 1nterview Questions - Front End",
      "body": "These are a complication of interview questions for SENIOR FRONT END DEVELOPER that I've had in 2023 and late 2022. The salary range for these positions are 140K - 260K TC HCOL.\n\nUse these as a reference of the level of FE skills you need for this salary range.\n\n**Tiktok:**\n\n\\-Say you're on a stream like twitch. Briefly describe how you would implement the chat feature.\n\n\\-Now, say 100000 users all submit a chat at the exact same time. How do you handle this? describe both the message data handling and the UI chat window results handling.\n\n**Rocket Mortgage:**\n\n\\-Describe distributed systems and microservice architecture and have you worked with them?\n\n\\-Explain how to persist data in a react app, both within the same session, and persisting thru sessions.\n\n\\-JSON data of movie titles and posters, code up a ui of a library/collection of these movies with poster + title underneath, in a grid format.\n\n**ServiceNow:**\n\nAll of these are hackerrank, must be full code that RUNS and outputs the correct answer.\n\n\\-Write a function that formats an number with the following criteria:\n\n\\--commas after each thousand place, 2 decimal places, rounded properly\n\n\\--for example 12345 -&gt; 12,345, 12345.6 -&gt; 12,345.67, 12345.678 -&gt; 12,345.68\n\n\\-Write a function that returns the square root of a number. Cannot use 'sqrt' / helper methods. Round to to the nearest integer.\n\n\\-Given a json array of objects of names and ages such as \\[{ name: 'g', age:420}, { name: 'ga', age:69}, { name: 'ag', age:2}, { name: 'eg', age:33} \\],\n\nwrite a function that takes an age number and outputs name of the person who has that age. if the age is not in the list, output the name of the person that's closest to the age.\n\n\\-Given a json array of objects\n\n{  firstname: 'Jack', lastname: 'Adams', age: 25, gender: 'm', veteran: true },\n\n{  firstname: 'Cynthia', lastname: 'nishimori', age: 23, gender: 'f', veteran: false},\n\n{  firstname: 'John', lastname: 'Jackson', age: 28, gender: 'm', veteran: true},\n\n{  firstname: 'Robert', lastname: 'Wilson', age: 29, gender: 'm', veteran: false },\n\n{  firstname: 'Jack', lastname: 'Evans', age: 21, gender: 'm', veteran: true },\n\n{  firstname: 'Meera', lastname: 'Raj', age: 25, gender: 'f', veteran: true},\n\n\\--Write a function that returns an array of objects sorted by alphabetical order, last name then first name.\n\n\\--Write a function that returns an array of objects sorted by veteran status, then gender (males first), and still alphabetical last name.\n\nOrdered example excluding names: \\[ {veteran: true, gender:'m'}, {{veteran: true, gender:'f'}, {veteran: false, gender:'m'}, {veteran: false, gender:'f'}\n\n*Question for yall: do these questions above count as DSA/leetcode type questions?*\n\n**Abbot:**\n\n\\-Write a function that calculates the number of primes equal or less than N. Real code, must run with correct answer.\n\n\\-System design: given a medical device attached to a human that records data, describe how you would design a system that takes this data and outputs it to a UI dashboard.\n\n\\--Describe the instances of if the medical device is offline (no internet) what happens to the data and how would it get processed when it comes back online.\n\n**Atlassian:**\n\nSystem design: describe how you would develop a \"mini jira\", tasks with ID number, progress state (todo/inprogress/done), assigned user. Open ended so go as far as you can.\n\n**Eikon Therapeutics:**\n\nGiven a list of numbers, code a histogram chart that buckets these numbers and has bar heights equal to the amount of numbers in that bucket.\n\n**Amazon:**\n\n[https://www.reddit.com/r/learnprogramming/comments/ycr64a/amazon\\_interview\\_experience\\_frontend\\_l4\\_10\\_yoe/](https://www.reddit.com/r/learnprogramming/comments/ycr64a/amazon_interview_experience_frontend_l4_10_yoe/)\n\n**Bonus:**\n\nNetflix from 2018:\n\n\\-Write a function that takes the position of a box on a line, and animates it from left to right (left/starting point is 0, right is increasing numbers).\n\n\\-Now write a function that reverses the trajectory the box just took.\n\n\\-Polyfill the \"bind\" function\n\nStartup like 'taskrabbit' app 2017:\n\n\\-Write a function that takes another function that shuffles a deck of poker cards, and returns true if that function is truly random, false if not.\n\nMost popular trivia questions:\n\n\\-What's an event loop?\n\n\\-What's closure?\n\n\\-When you type a url in the address bar and press enter, what exactly happens?\n\nLet me know your thoughts and hope this is useful!",
      "subreddit": "cscareerquestions",
      "score": 39,
      "url": "https://reddit.com/r/cscareerquestions/comments/16zgww4/2023_1nterview_questions_front_end/",
      "comments": [
        {
          "body": "&gt;\\-Write a function that takes another function that shuffles a deck of poker cards, and returns true if that function is truly random, false if not.\n\nWhat's the solution to this one? Seems like a trick question.",
          "score": 4
        },
        {
          "body": "Thanks for posting! I'll add what I can.\n\n&amp;#x200B;\n\n&gt;Question for yall: do these questions above count as DSA/leetcode type questions?\n\nThe square root and rounding numbers function could maybe be inline with Leetcode (LC) easy questions. The others are more frontend specific. Iterating over objects or using one object as the filter criteria for another are very common frontend questions, but IMO a little different than what LC offers.\n\nI've gotten questions before where to solve it, you need to iterate through multiple objects repeatedly, which can be O(N \\* M \\* O), where each letter represents one of the objects. Finding tricks like using Set() or Map() or combining the objects together or sorting can be useful, so have those options on your mental checklist. This can help you get to an O(N) optimal solution.\n\nI've read that it's good to be prepared to write functions like: reduce(), throttle(), debounce(). For senior roles, know how to implement a crude version of promises. Know how to traverse up and down the DOM tree to find specific nodes. Know how testing framework code might work under the hood - be ready to write framework code to allow expressions like: expect(4).not.toBe(5).\n\nIn terms of system design, I've seen \"design pinterest\" with follow ups about how the frontend controller might fetch and display the tiles. There are a handful of youtubers making 45 minute videos on all the big apps that are common to see for frontend system design.\n\n[BFE.dev](https://BFE.dev) is a good website to practice for frontend interviews.",
          "score": 2
        },
        {
          "body": "This is pretty biased. Don't think it should be allowed as a post.\n\nWhat's even the question?",
          "score": -22
        },
        {
          "body": "Are you currently working?",
          "score": 1
        }
      ]
    },
    {
      "title": "Atlassian vs Palantir",
      "body": "I got an offer for backend engineer intern at Atlassian and also for forward-deployed software engineer intern at Palantir (both roles in Sydney),\n\nwhich offer should I accept?\n\nEDIT: Going with Atlassian",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/ux9u76/atlassian_vs_palantir/",
      "comments": [
        {
          "body": "100% go for Atlassian.\n\n* FDSE is more like a consultant position where you're working at clients most of the time to maintain a Palantir product deployment. If you search on this sub, you'll see that noone wants to do FDSE and they have a hard time filling these roles.\n* Atlassian's brand and reputation in Sydney's tech space is significantly better (comparable to Canva, Google, AWS). I saw that your intern offer is slightly lower but that doesn't matter. Taking Atlassian backend will pay off in the long run for sure,",
          "score": 17
        },
        {
          "body": "As an internship, both look good on your resume. Given you are in Australia I feel like there's some advantage in being close to the HQ at Atlassian.",
          "score": 7
        },
        {
          "body": "Do you want to build tools to help developers, or do you want to build tools to help a literal supervillain spy on immigrants?",
          "score": 30
        },
        {
          "body": "Do not work for Palantir. Their business outlook is poor and they have shady business connections. Their stock has gone down dramatically since they went public and the association with the far-right views of the founders isn’t likely to win you any points. \n\nPeter Thiel ( Palantir co-founder) is an all-around mega villain funding and working at Palantir stains your resume. Palantir to me reads “far right surveillance”.  If you are NOT a far-right person, avoid it.",
          "score": 7
        }
      ]
    },
    {
      "title": "My internship search so far: 250 applications, 56 rejections, and 3 interviews",
      "body": "Hi all, I just wanted to write about my experience so far, in searching for a tech internship for summer 2024. My aim is to simply add another data point for anyone who reads this and to hopefully foster some discussion about internships in general! ITT I'll highlight my internship search stats, some strategies I've employed, and what tools I'm using to make it easier for me when applying.\n\n## My internship search stats\n\nAs of September 14\n\n* I've applied to exactly 266 different internships\n* been rejected from 56 of them\n* am currently interviewing with 3 different companies\n* with the rest still pending/waiting to be ghosted.\n* I've tested out 3 different resume formats, and found one that has worked better than the first 2.\n* I've done probably 10-15 hackerrank/codesignal tests and have failed almost all of them lol\n\nI'm targeting a data engineering role, but have applied to mostly software engineering roles, as these roles open applications significantly earlier than data analytics. I started applying in mid July of this year (while I was in my previous internship lol). To hopefully give this post any credibility at all, I'm currently interviewing with Microsoft, Atlassian, and Infoverity, set to have my final round interviews next week. I can make another post talking about my interview experiences with these companies if anyone is interested. I currently have a pending offer with the company I interned with last summer, which I feel has really helped push the ball along with Atlassian and Microsoft.\n\n## What tactics have helped me so far\n\nI'm of the opinion that getting a job is mostly a numbers game, combined with the intuition to adjust as you go along and find what things aren't working. For resumes, there is no one answer of what the best format or bullet point is. By applying to a massive amount of jobs, you start to have a big enough sample size to start making accurate changes. When I was first making my resume, I compiled like 10-20 different resumes of people that got into FAANG, and copied the general format of theirs. I didn't submit a single cover letter to any jobs, or change my resume for any one specific posting.\n\nI also personally don't look for referrals at all. I've tried for a couple companies that I'm specifically interested in (if anyone working at riot games sees this, hook me up 👀) but it just feels like I'm using this person only for my personal gain. I also don't know very many people that got a job by a referral and would prefer to put my time toward something I know will work.\n\nI don't formally know DS&amp;A, but have been self-taught for around 4 years now so I know enough to tackle easy/(some) medium leetcode problems. If I did know my way around a hackerrank assessment better, I may have even more interview but I have a personal vendetta against the whole premise of OAs so I willingly abstain lol.\n\nRecently the rate at which I have been applying has slowed down, but on average I was submitting 20-40 applications a week. If you haven't started applying already, start now. I wouldn't be surprised if 20% of the posting I've applied to are closed already. Recruiters get thousands of applicants so they have to close the posting early and deal with who they have already.\n\n## What tools/resources I'm using?\n\nI'm using a tool called [huntr.co](https://huntr.co) to track my applications. This is not sponsored, I just find their tool the easiest to use when tracking applications. You can track up to 40 apps for free, after which you have to pay $10/month to add any more. For me, this is worth it simply because of the volume of applications I put out.\n\nThe other tool that I highly recommend is called [Simplify.jobs](https://Simplify.jobs), which autofills applications with just a few mouse clicks (not sponsored either!). Sites like greenhouse and lever are filled out instantly, and sites like workday or icims (that I used to actively avoid applying to anything on) are easier than ever. Every job seeker should be using this tool!\n\nLastly, where am I finding the jobs that I applied to? 99% of all the jobs that I've applied to have come from [this github repo](https://github.com/SimplifyJobs/Summer2024-Internships), filled with over 300+ open (some are now closed!) internships for summer 2024. They also have a sister repo for new grad roles, in case anyone is/has graduated. There are only a handful of apps that I've submitted not sources from this repo, that have been on linkedin or indeed\n\n&amp;#x200B;\n\nI hope this post was helpful if you read all the way up until this point! Job searching is never easy, especially internships, so I wish you the best of luck if you're currently searching!",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/16izyiq/my_internship_search_so_far_250_applications_56/",
      "comments": []
    },
    {
      "title": "I am a self-taught SWE who just accepted a FTE offer as first programming job. I would like to share a few personal experiences about my journey",
      "body": "DISCLAIMER: Obvious survivorship bias &amp; if you take any of this as advice your results may vary.\n\n\n**TL;DR statistics:**\n\n* Actual job search took 3 months\n* Portfolio was over 1 year's work (I did it mostly during school before I dropped out)\n* I interviewed at 7 companies. 3 of these were Fortune 500\n* 3 companies made offers\n* 2/4 companies that did not make offers sent rejections with feedback\n* Hours spent on leetcode (et. al.): 0\n* Hours spend in mock interviews: 0\n* Main side project stats: 15k+ SLOC, 500+ commits, 20+ github stars (I went the OSS route), 8 months of development (don't worry - I actually enjoyed most of it)\n\n\n**Interviewing**\n\n* **Finding interviews**: I sent my resume out to maybe 10 companies. 2-3 of them contacted me, and I interviewed at only one of them.  Instead, I relied on a few good recruiters who knew what I wanted and could get me interviews. My online presence was very important also because it is a first impression (often) for interviewers, I highly recommend making this a priority since it's something under your control and you can use it to your advantage.\n* **Finding *quality* openings**: My LinkedIn, Twitter, GitHub, and Medium accounts all played a big part in this. I made sure that all of them broadcast what kind of development I like to do and I almost **never** received unrelated messages about I.T. jobs, etc. In my case, I like Android Development, java (like Spring Boot, etc.), and modern web development like Angular &amp; React.\n* **Interview practice**: This probably could have saved me some pain, but I didn't spend any time doing mock interviews. Instead, I simply took notes on where I struggled in each interview, where I could have leveraged my experience/knowledge to make a better discussion, etc. In my first interview I blanked out when asked to find the largest range between 2 values in a list of numbers (even as he walked me through possibly finding a max/min). In my last job interview, one of my interviewers actually complimented me on how I walked through solving a problem. A large part of my improvement was simply due to increased confidence.\n* **Recruiting firms**: Major recruiting agencies don't just handle sub-contractor jobs. They often have an account manager who handles FTE opportunities. Make sure you ask the recruiter about this. Also, get to know a few less-slimy recruiters personally. In my experience the effort is worth it (higher quality opportunities, more of their time that they'll invest in getting you ready, etc.)\n\n**Some points which helped me**\n\n* Research the tech stack that each company uses before-hand and know how to tie personal experience with other tech to the job description. This makes for a good, balanced discussion with your interviewer(s) and often gets them invested in you by asking non-generic personal questions.\n* Know how to compliment a company or your interviewer\n* Warning - unconventional advice ahead: Know how to **effectively** talk about your weaknesses and past failures. This should not be a memorized answer to the cliche \"What's your biggest weakness?\" interview question. Self awareness is a very desireable trait and I highly recommend trying to talk about your weaknesses as personal concerns about the company and how you see yourself performing there. This puts your interviewer(s) on the defensive, and they will almost always start to sell you the company as a place which will help you succeed.\n* In our industry specifically it is much more common to have people personally invested in a particular technology. Make sure to tread lightly. You can also leverage this by bringing it up during the interview (i.e. comparing some side project to traits of an interviewer's favorite language/framework). I received positive feedback from both interviews when I did this.\n* **Edit**: If you have no \"professional\" experience, **don't act like it**! If you have any code on GitHub, any websites up online, or any apps available for download you do have professional experience. You should both write your code with this in mind, and also talk about your projects like professional experience. Self-deprecation does not look good on you, I promise!\n* **Edit 2**: If you are self taught, expect them to be concerned about how you can collaborate and also how you can write code that others can maintain. I made a few major pull requests in popular projects and talked about these whenever the topic was addressed. It might even be in your best interests to bring it up yourself, in my last few interviews I did this and liked it. \n\n\n**Side projects**\n\nI attribute my success so far primarily to my investment in side projects &amp; OSS. Here are some facts about the importance of side projects in my job search:\n\n* 2 awesome opportunities came from my specialized projects/experience: 1 freelance opportunity from a Twitter follower who I worked with on a few PR's, and 1 company whos employee found me on accident on some Android OSS library (made it through 2/3 interviews before turning down the 3rd one)\n* 4/7 companies left an internet traffic trail from their Atlassian/JIRA/etc. domain. I'm guessing that they linked me on a ticket about candidates.\n* 1 of them asked me to show them around my major project\n* 6/7 told me that they looked at it. No negative feedback, really\n* 1 company focused so much on it that it made me depressed when I realized that they were poking holes in my design. Then I just applied their advice once I realized that I just got free \"architectural\" review. I also shared this experience in a later interview and they really liked it (interviewer brought it up in a later interview)\n* *However: in every single interview, my side projects contributed to a large portion of the discussion.*\n\n**Current job**\n\nI live in a low COL area (Midwest) and got a very reasonable offer: 56k base, 5k annual, and around 10k worth of other bonuses. 2 weeks PTO. Best of all: I am 1/2 juniors joining the company. Everyone else has over 2 years of experience with the company: tons of mentorship, etc. Will be working with the latest and greatest in Web Dev (React, etc.) with a lot of opportunities for lateral transition down the road. Not a single red flag with this company.\n\n**Conclusion**\n\nIf you would like to know anything else, feel free to ask away below. I am willing to share some things I learned about how to effectively use side projects along the way if y'all are interested. It would be in a separate post, but some of the things I'd talk about are:\n\n* \"Dos and Don'ts\" of side projects\n* How to make a side project which stands out as unique\n* How to prepare a pitch on your project. This is very important!\n* Depression/Anxiety/Stress/Burnout throughout this overall process\n",
      "subreddit": "cscareerquestions",
      "score": 42,
      "url": "https://reddit.com/r/cscareerquestions/comments/86ni2e/i_am_a_selftaught_swe_who_just_accepted_a_fte/",
      "comments": [
        {
          "body": "Good Job! I'm also someone who's self taught that got in the field as well! Took me about 4 months, and 200+ applications tho. ",
          "score": 8
        },
        {
          "body": "Not to bring down OP, but this is more for those that read this and wonder \"Why can't this happen to me?\".  Take these \"I made it and this is how I did it!\" threads with a grain a salt.  OP could be genuine and everything he says is the truth, but every person's situation is different.  Some people with OP's qualifications have to apply hundreds of times before getting an interview while others don't.  Unfortunately, a lot of it is luck but you can do things that increase your chances.\n\nKeep in mind also that although it might not be the case for this thread, many people on this sub lie about their journey.  These type of threads are the equivalent of seeing the smiling faces of your friends on Facebook who seem to always be on vacation, enjoying life, but we don't see the bad moments in their lives.\n\nIf you're not \"making it\" and it seems like other people around you are, just remember that everyone's journey is different.  If these types of threads make you depressed, please, ffs, leave this sub and focus on the things that will make you successful. ",
          "score": 5
        },
        {
          "body": "Anonymous resume?",
          "score": 3
        },
        {
          "body": "Did these places have requirements on the job posting for bachelors degree?  That's all I have been seeing lately, did you just apply anyways?",
          "score": 2
        },
        {
          "body": "Good job; also self-taught here, decided to move to a new country where my chosen industry was more developed about 5 years ago. Took a couple of months to find a job after the move as well. I also attribute this to side projects (as well as actively maintaining a dev log), and to not aiming too high/taking something that would allow me to grow and develop. ",
          "score": 2
        },
        {
          "body": "Congrats! What month did you start the job hunt? What are your recommendations on finding good recruiters?",
          "score": 2
        }
      ]
    },
    {
      "title": "Job Search Advice",
      "body": "Hey guys, i was hired back in June 2021 by one of the big IT companies via a hire to train program, but i didn’t actually get onto a project until Jan 2022, and it ended back in October, leaving me on the bench since then. On the job, i worked with Java/Spring Boot, microservices, rest api, sql, git, docker, kubernetes, jenkins, and the atlassian tools. Prior to this job, i graduated from a 12 week accelerated boot camp, so i feel like i never properly learned system design, algorithms/advanced data structures, and I feel like an imposter. My resume says i have more experience than i do, and that my title is “full-stack engineer”, so i feel even more like an imposter. Now i have a week left to find a project or my employment ends with my company. So I’m applying for jobs, and i have some project experience, but i have no experience with coding interviews. Do you guys have any advice besides “grinding leetcode”? Also, do i go for the entry level positions or mid-level if i have a year of experience? Thanks",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/103jl8z/job_search_advice/",
      "comments": [
        {
          "body": "If you have 0 to minimal DS &amp; A knowledge then I would say focus on that first. It's important for SWE interviews \n\nSome resources you can use are freeCodeCamps DS &amp; A course, YouTube or a Course Era course \n\nI've also used Structy &amp; AlgoExpert. Both are paid, I liked Structy better \n\nWhen it's time to LC, checkout neetcode.io, that website has a solid set of curated questions",
          "score": 1
        }
      ]
    },
    {
      "title": "Atlassian New Grad Associate Machine Learning Intrview",
      "body": "Has anyone done an interview with Atlassian for their new grad Associate Machine Learning role? If so, what was it like?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/yejh6j/atlassian_new_grad_associate_machine_learning/",
      "comments": []
    },
    {
      "title": "SWE Internship Decision Help (Atlassian vs Square/Block)",
      "body": "Hi! Just finished my recruitment for this cycle and having a tough time deciding between 2 main companies: Atlassian and Square (Block now) (both will be remote but can go to the SF offices for both). Definitely am happy with both of these options since both aren't too big, have good work/engineering culture overall, and seem to have pretty cool products to work on (think the project management and fintech space are both interesting). Wish I knew more about team/project but unfortunately none of them will be able to give any info until project matching starts. Think my main priority (since both seem like cool places to intern at) is which will help me out more in the future on internship searching (likely planning to recruit for internships one more cycle next year).\n\nMain pros for each:\n\nAtlassian:\n\n\\- decently higher pay (not that big of a factor for me tbh)\n\n\\- JIRA/Confluence products are pretty widely known so would be cool to work on\n\n\\- have friends who can vouch for the internship exp\n\n&amp;#x200B;\n\nSquare/Block:\n\n\\- seems to be pivoted for growth (esp with the new change to Block and fintech on the rise, but not fluent in that space at all so not sure)\n\n\\- slightly larger brand name?\n\n\\- said that interns that go to other internships in the following year can still come back to Square full-time much more easily\n\n&amp;#x200B;\n\nI feel like both options are great, but right now I'm leaning just slightly more towards Square since I think it could be a cool place to potentially return full-time and may help slightly more with landing internships next year (potentially with other fintech companies)? But also haven't had many talks with past employees/interns and don't know details like what fulltime TC in SF Bay Area would be. Any info appreciated!",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/rivs1u/swe_internship_decision_help_atlassian_vs/",
      "comments": [
        {
          "body": "Can't go wrong with either but I'd go square",
          "score": 5
        },
        {
          "body": "I would go with Atlassian, they're a big name and most likely have good enterprise level processes, onboarding, and such you can learn off of. \n\nSquare is in a growth period so it will be hectic and Square notoriously underpays people. So, even if you do get a job post internship it will be lower than pretty much most other tech companies. And Atlassian typically pays well with good refreshers.",
          "score": 2
        },
        {
          "body": "I would go with Atlassian. In my experience having a large structured company as an internship is super helpful when applying for jobs since companies know you can work well in that kind of setting. \n\nI’d also say that return offers are pretty common generally so even if Atlassian doesn’t explicitly say that I would be really surprised if the goal wasn’t to give as many full time return offers as possible.",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "How bad is reneging?",
      "body": "So I recently accepted an offer from Atlassian for their software developer internship program during summer (based in Sydney).\nI was largely able to land an interview there through my connections with the recruiters, who I was introduced to by my manager at a previous internship. I also have connections to many people who are either currently interning at Atlassian or are current full-time software engineers there.\nNote: I've completed all the necessary background checks and signed the contract already.\nThe internship goes from November to February.\n\nAfter accepting the offer, I decided to continue interviewing at various tech companies to gain more technical interview experience and connect with more recruiters. Now that I'm at the final stage for one particular **F**AANG for their summer internship in London, I'm starting to feel a bit conflicted.\nThe internship goes from January to March.\n\nHere are my pros and cons for each:\n\n**Atlassian**:\n\nPros:\n\n* Fairly well known name in tech\n* Located in my city\n* Potential for full-time conversion/internship extension\n\nCons:\n\n* Not as big a name as FAANG\n* Feels like I'm giving up a huge opportunity :(\n\n**FAANG**:\n\nPros:\n\n* Very well known big tech company\n* Located in London (opportunity to travel)\n* Potential for full-time conversion\n\nCons:\n\n* Will potentially burn bridges due to needing to renege (I'm the most worried about this, since I feel very fortunate and lucky to be able to have made these connections)\n* Overlaps slightly with my uni term\n\nIf I were to receive an offer from the FAANG, should I renege the Atlassian offer and risk potentially burning bridges with valuable connections in the future to intern at the FAANG? Or should I decline the FAANG offer and maybe apply again next year (will be for grad)?\n\nAny advice/thoughts appreciated.",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/fwbtk4/how_bad_is_reneging/",
      "comments": [
        {
          "body": "Which one aligns with what you want?",
          "score": 5
        },
        {
          "body": "Look at all of the people who got their offers rescinded on the sub. A company has no loyalty to you and you should have no loyalty to them",
          "score": 5
        },
        {
          "body": "Atlassian is a good name. I'd say take it and reapply next year.",
          "score": 9
        },
        {
          "body": "In my experience, it's not as bad as what everyone else says.\n\nI reneged two internship offers for Summer 2018, and now 18 months later both companies have reached out to me individually asking if I'm considering full-time opportunities at $COMPANY again. YMMV.",
          "score": 3
        },
        {
          "body": "My 2 cents: take Atlassian.  You can always apply next year or, hell, every year for the ready of your career.",
          "score": 2
        }
      ]
    },
    {
      "title": "Feeling hopeless for the upcoming summer, any tips for a Junior that didn’t get an internship?",
      "body": "So like the title says, I failed at acquiring an internship this summer. I received coding challenges from Twilio, Google, Amazon, Twitter, Western Digital, and Atlassian. Failed all (didn’t bother with Twitters because I hear everyone gets it) except Western Digital where I went on site but didn’t get the offer. \n\nObviously this means I lack the technical ability for an internship so I’ve been grinding LeetCode and HackerRank in preparation for next summer but I don’t want to just sit around on my ass all summer. I already have 2 pretty substantial projects on my resume (both are relatively intricate and consist of solid front-end and back-end design) so I’m not sure if a third project would really do my time well. \n\nI’d say despite not having any internship experience, my resume is pretty solid because I did hear back from 6 big companies, just didn’t have the data structures and algorithms skills to proceed. \n\nMy uncle and I are thinking about starting a summer camp for kids where we’ll teach them the basics of coding and making a business out of it so that’s going to be pretty cool, but I definitely feel like I want to do something MORE. My friend gave me a referral to another company and they said if their current round of interviews don’t make it they’ll give me a call but I don’t wanna get my hopes up on a “maybe.” \n\nI was wondering what are things I could do this summer (besides the obvious LeetCode grinding) to make myself more hirable for summer 2020? I honestly just really want an internship and regret messing up all those coding challenges because with the level I’m at now, I could have definitely passed Google’s and Amazon’s (in retrospect, they really weren’t that bad, I was just a lazy idiot who did no LC prior to AFTER failing the challenges). \n\nDo you think companies would let me potentially shadow Software Engineers? I’d even do it for no pay at this point. I just want something to put my foot in the door of the industry. Any tips are appreciated and if you guys know of any companies who are still looking for interns (Bay Area/SoCal preferred) I’d greatly appreciate letting me know. Of course I’m still applying to the few that are left but many are for Fall or for MS/PhD students :/",
      "subreddit": "cscareerquestions",
      "score": 35,
      "url": "https://reddit.com/r/cscareerquestions/comments/bb32d4/feeling_hopeless_for_the_upcoming_summer_any_tips/",
      "comments": [
        {
          "body": "I was almost in your exact position right after spring quarter. I had some Big N interviews lined up for fall, which was my last chance at landing an internship before I became a senior. Note that I had zero experience going into these.\n\nI bombed my first phone interview and failed the coding challenge for another company \n\nThis really sucked, but I learned that if my resume was decent enough to get a coding challenge from a Big N, then it was likely good enough for next year\n\nI switched gears to looking for full time jobs when school started again. I took my first software engineering course in fall since I didn’t have any “real” experience outside of a web dev class. This was a great decision imo because of how much I was able to learn in 10 weeks. I slapped that project on my resume along with a few other projects, grinded the fuck out of LC and shot my shot in January.\n\nThings worked out for me despite not having an internship, and they will for you if you continue the grind",
          "score": 28
        },
        {
          "body": "I'd say try applying to YC's work at a startup internship. From what I can tell, the companies aren't testing for advanced algo or data structure knowledge. They just want to know if you can build something using their tech stack.",
          "score": 16
        },
        {
          "body": "I’m not sure exactly what area you’re applying from, but is there a reason you’re only aiming for the biggest companies? There are plenty of smaller companies that are probably looking for interns. While the prestige of big N companies can be tempting, I feel there is no reason to not consider smaller companies, especially when plenty of them can give you great learning opportunities. \n\nMy advice would be if you’re struggling to get responses from the big fish, reach out and apply for the smaller ones. They’ll not only provide with some experience vs none, but in your free time you could also focus on preparing for possible full time job interviews with your dream companies.",
          "score": 11
        },
        {
          "body": "GSOC applications END TOMORROW (April 9). Go apply for that.",
          "score": 8
        },
        {
          "body": "here's the biggest piece of advice every single student needs to hear.   \n\n\n* **Stop trying to go for the big companies that everyone already knows about.** Holy fuck, every single one of you kids seems to think that only big companies do tech. Just take a look at the Fortune 500 companies and there are SO many out there doing really cool tech stuff that you don't even know about because its not FAANG. \n* **Use your school resources I almost guarantee you have them.** My school isn't any special top-anything school, I don't live in a big massive tech hub, and I'm not a top-anything for my skills. But guess what, I used my school resources, had 4 interviews at 2 companies, got an offer, one of them is fortune 500 and the work I do here is phenomenal. I've learned way more than I probably would at most of these big name places. \n* **Network on linkedIn -** message recruiters, reach out to alumni, post a random message saying you're looking for an internship. There are so many ways to land an internship, its not even funny.",
          "score": 5
        },
        {
          "body": "I'm literally in the exact same position as you, from getting the big N's to not grinding enough LeetCode and failing coding challenges. I'm a junior w no internship experience and have a pretty solid resume as well from my part time job at school and hackathons. This is pretty far fetch but I recently just found out about Google Summer of Code so I'm applying to that right now- I doubt I'm going to get it but it's worth a shot trying. Applications are due tomorrow at noon, so maybe try looking at smaller organizations in need, there's a stipend as well provided by Google.\n\n&amp;#x200B;\n\nEdit: If I don't get in to GSoC, I'm just gonna focus on applying to scholarships, fellowship programs, etc. and taking summer classes. Also like what someone else commented try applying to local startups.  There's still time since most internships start in June.",
          "score": 5
        }
      ]
    },
    {
      "title": "Which major companies are the LEAST team-dependent when it comes to quality of work-life?",
      "body": "I know all big companies are team-dependent to some degree, but can some companies be measured as being more homogenous than others in their tech departments? And if so, where would those be? If the variation of \"good tech sectors\" and \"bad tech sectors\" are lower in some companies and you get more or less a similar WLB experience no matter where you work within the company.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/vk79in/which_major_companies_are_the_least_teamdependent/",
      "comments": [
        {
          "body": "Airbnb full remote 100% location agnostic extremely high pay and barely do anything. \n\nIf you’re in Bay Area workday is chill af but they’re on a hybrid work schedule although depending on manager you just come in whenever you feel like it.\n\nJust 2 random ones off the top of my head",
          "score": 5
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "It really is going to be culture + manager. Vibe the manager.",
          "score": 2
        },
        {
          "body": "The team makes the quality of work-life every time--no company is 100% great.  A good manager and a good team can make the shittiest corporate environment bearable, and a bad manager and/or uncooperative team always means that the job sucks.\n\nNo company is immune to bad managers.",
          "score": 2
        },
        {
          "body": "None of them. \n\n\"Major companies\" will have all sorts of little cultural microcosms by virtue of the sheer number of people they employ. If you want consistent culture across teams and functional groups, which may be consistently shitty or consistently great, look for smaller companies.",
          "score": 0
        }
      ]
    },
    {
      "title": "26yo wanting to become a software engineer. What is my most realistic path? Any advice welcome.",
      "body": "Hey all,\n\nThanks for reading. I already posted this is in r/cscareerquestionsOCE (I live in Australia), but I am hoping to also get some feedback from this forum as well.\n\nMy question is, how feasible is it to get a well-remunerated position at a place like Atlassian/Google without having a CS degree? I have a Bachelor of Commerce majoring in economics and finance from Melbourne University, and would like to avoid returning to university if possible. I live in Melbourne but am happy to move anywhere in Australia for the right job.\n\nI am 26yo, and through the course of COVID-19 I have discovered and pursued a new passion for software engineering. I have completed CS50 and found it really enjoyable, especially the algorithm and data structures stuff, and I am currently working my way through The Odin Project. I have built an AI-driven Tic-Tac-Toe game using the minimax algorithm, which can be played here: [https://atlas-1510.github.io/Tic-Tac-Toe/](https://atlas-1510.github.io/Tic-Tac-Toe/)\n\nI am currently working in an economic consultant position, but it is not what I want to do long-term. The thing that appeals to me about software engineering is the ability to build actual tangible things that actually solve real-world problems. Kind of like a carpenter building a house, or an artist painting a portrait. In contrast, my current role is all about research/advice/forecasting, with little direct impact on the world. Basically, my job is to write reports, sound confident, and convince clients to trust what I say... even if I don't believe it myself.\n\nI am in a bit of a weird position, as I currently earn $75k per year for basically one day of \"real work\" per week, despite it being a full time role. It really is incredible. I have found myself in a role that requires little effort, but upper management in my company are not aware of this (or maybe they are, but they just don't care?). I have been with this company since 2017, when I graduated.\n\nIn any case, I have plenty of time to devote to self-training towards the goal of becoming a professional software engineer, and a strong family network to support me even if I somehow lost my current job.\n\nAny advice at all is appreciated, particularly around whether it is unrealistic to think I can get a job at an A-tier company like Google/Amazon without a CS degree. Also, if it is feasible, how should I be allocating my time to achieve this goal? My current plan looks like this:\n\n**Complete the Odin Project**\n\nIn progress, doing the full-stack javascript path.\n\n**Develop side projects**\n\n1. Smart mirror app with facial recognition, interface with calendar/music/stocks/weather etc.\n2. Web project that scrapes SEEK and other job sites, and analyses data to show trends in salaries and demand for different coding languages/stacks/competnecies over time\n3. My own version of Apple's Siri (this is very ambitious and maybe beyond my ability, not sure)\n\n**Grind Leetcode**\n\nSeems to be a requirement for any interview, but I have plenty of time so not too big a deal.\n\n**Interview**\n\n... **Profit?**\n\nThanks everyone!",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/kdh2lu/26yo_wanting_to_become_a_software_engineer_what/",
      "comments": [
        {
          "body": "&gt; through the course of COVID-19 I have discovered and pursued a new passion for software engineering. \n\nA tale as old as february.\n\n&gt; I am in a bit of a weird position, as I currently earn $75k per year for basically one day of \"real work\" per week, despite it being a full time role. It really is incredible. \n\nWith all due respect man, I want to slap all the 30-something (or in this case, 20-something) people with laidback, established careers who come on this sub and say they want to jump into the shark tank that is hunting for entry level software work from their cushy, middle class accounting/engineering/marketing jobs. I'd even call it dumb. Not you, but the idea. You need to stop reading hyped up salary estimates and start looking at actual job listings in your area. For every high-paying job, there are three low-paying jobs in programming sweatshops.\n\n&gt; Smart mirror app with facial recognition, interface with calendar/music/stocks/weather etc.\n\nSmart mirrors are fun! A lightweight version of magic mirror that could run on a pi zero would be great.",
          "score": 19
        },
        {
          "body": "&gt; The thing that appeals to me about software engineering is the ability to build actual tangible things that actually solve real-world problems. Kind of like a carpenter building a house, or an artist painting a portrait. In contrast, my current role is all about research/advice/forecasting, with little direct impact on the world.\n\nWhat makes you think software engineering is any different? Let me tell you, 90% of the industry is focused on writing CRUD apps. Just because you're in CS doesn't mean you're going to be the next coming of Tech Jesus. You'll very likely end up writing a CRUD app.\n\nYou're not going to be like a carpenter building a house. You're going to be the lumberjack who cuts trees down all day every day day in day out. Then your coworker's going to be the branch trimmer. Then your next coworker is going to slice trees into planks. Then your next coworker is going to package the planks into standardized shipping containers. etc. etc.\n\nEven at, actually, **especially** at places like Google/Amazon. You're being paid top dollar not to sit around and think of ways to \"improve the world.\" No, they're paying you to **make money**. Like every other business. Businesses pay software engineers to make them money. You'll be part of a team that does one tiny little thing in a giant CRUD app.",
          "score": 8
        },
        {
          "body": "&gt;an A-tier company like Google/Amazon without a CS degree.\n\nIt's not exactly unrealistic (there are exceptional cases) but recognize that not everyone can work for FAANG. There are more companies than just the main 5 and some people sacrifice way too much of their mental health in thinking they're a failure if they are not at a top company. Not saying you shouldn't give that up goal but look at \"normal\" job descriptions and think how you can reach those first rather than hyping yourself up for working at Google when you have only completed some basic courses.",
          "score": 4
        },
        {
          "body": "If your dayjob is that cushy, why not just keep CS as a hobby? You could do all your projects and get all the knowledge and expertise you need, then when the dayjob goes south, THEN look at getting a CS job.\n\nA lot of CS jobs pay about what you make now and they require way more hours. And you likely won't be doing anything interesting.\n\nThe higher CS salaries often come with a higher cost of living and way more work hours. I don't think you'd be coming out ahead if you switched. Plus, while it's possible to get into faang without a degree, you would have to be truly exceptional at not only CS, but probably networking as well. Your hurdle would be getting past the recruiters and resume screen, assuming that you have the necessary skills.",
          "score": 2
        },
        {
          "body": "&gt; The thing that appeals to me about software engineering is the ability to build actual tangible things that actually solve real-world problems.\n\nThis is a great reason to switch; it shows intrinsic motivation rather than purely chasing status or $$$. I see that type of motivation often in people who've been highly successful in the industry.\n\nYour plan sounds solid. I would recommend learning more than just JS; and getting good at learning new things fast in general. Side projects are the best way to show that your self learning was effective, good plan there. Focus on building stuff you actually care about so you're motivated. Maybe even release them and get real users. And yes, unfortunately the leetcode grind is a part of the current interview process. I've been involved in several efforts to reinvent interviews at one of the big tech cos, but sadly it hasn't caught on outside of my old team :(\n\nOne other path to consider is product management. It pays about the same as engineering at FAANG and we often look for people with a mix of technical and business experience, which you'd be a fit for if your self learning goes well. It's also very focused on solving real user problems which you mentioned as motivation. It's essentially coming up with what to build next, and then working closely with engineering, design, and every other part of the company to turn it into reality.\n\nLet me know if any questions!",
          "score": 3
        }
      ]
    },
    {
      "title": "Atlassian Recruitment Update?",
      "body": "Does Atlassian's campus recruiting team typically notify applicants of the status of active recruiting regardless of whether or not they intend to move forward with interviewing the applicant?",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/xmcsnt/atlassian_recruitment_update/",
      "comments": [
        {
          "body": "no.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is it worth the stress?",
      "body": "I ask myself this question every single time I think about changing jobs.\n\nI’m 24, turning 25 this year and my current TC is about 155k per year as an engineer. I’m fortunate to be pushing Senior this year with support from my manager which should bring my base salary from 111k to about 130-140k, not including cash bonus and RSUs. \n\nLong story short, colleagues are leaving to join companies like Twitter, Atlassian, Microsoft and Expedia for TC average of base, 140k, cash 20-30k and 100-150k stock vests 1/4 per year. \n\nMy internal dilemma is this, I bought myself a house in Sunny San Diego, love where I live since I grew up, but definitely house poor with the help of GF whose a IT Pm in the same company, she rakes in 120k TC. I enjoy my current work, tech stack is C# but I work with cool tech (Cameras and SoCs). I enjoy playing video games and grinding out Valorant to try to be immortal and that’s my hobby rn aside from working out and stuff. But my dilemma is the issue in which if it’s all worth the stress to look for a higher base comp of 20-30k as well as the worry if the team I’ll join is something I’d like. \n\nI’ve been on the same team going on the 3rd year now, and enjoy the flexibility and regard that my team and colleagues provide me. Basically I can keep working and grinding in this position and I’ll be promoted in due time.\n\nIt’s the conflict of stress, doing what I want to do rn and not sitting down to study interview questions as well as leetcode is the biggest issue that I have. My reasoning is the fact that these are all the time takers in doing what I really love doing. I’m trying to change this mindset and I’ve come to terms of either:\n- being happy with what I have or\n- accepting that grinding is normal and just a part of this professional growth.\n\nNeed some advice from people who have came across the same dilemma and what choice they made, insights would be awesome!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/tj2d59/is_it_worth_the_stress/",
      "comments": [
        {
          "body": "I wish you luck in your immortal grind\n\n-a lowly silver val player",
          "score": 6
        },
        {
          "body": "It's really only something you can figure for your self. Whether the increase in TC is worth the potential stress and change in working conditions and conversely way of life.\nPersonally, as long as it will support my life style and financial goals, I choose happiness and complacency.",
          "score": 2
        },
        {
          "body": "Grass is not always greener. Having a low stress job and team that values your work is something that should be considered. Given the renal market, you could always rent out your house if you're after a change. Poway is a great place to live, but most of the benefits come when you're raising a family. It can be a boring place to live in your 20s.",
          "score": 1
        }
      ]
    },
    {
      "title": "Need a reality check, am I underperforming, or does this job just suck?",
      "body": "Hey all, started a new job two weeks ago (great timing), and I need some clarity. Apologies cause this will be really long.\n\n \nI have about four years of industry experience, two as an engineer. My track record is a bit different as I was doing protein engineering, then data science, then finally data engineering all in biotech. I was at a startup before this that I was looking to leave as my salary was pretty much capped and I was aggressively recruited by as a contractor for one of the biggest biotechs in the Bay. Originally, I was to meet the whole team, but after the first interview they sent me an offer, and it was 50k more than I was making so I took it right away.\n\n\nAt my previous role I was very much a generalist as it was me and only my boss as the sole engineers, so I was doing full stack apps, devops, data engineering, and data science. I’m still definitely not an expert in any of these and our stacks were much more primitive. Current team is using an extremely complicated stack: AWS, Azure, GCP, pretty much every SQL and NOSQL DB our there, Airflow, many custom apps, Atlassian, Jenkins etc. On my resume, I explicitly stated what I had experience with and from this stack it was only AWS and a few SQL DBs. I definitely feel overwhelmed here.\n\n\nBecause of COVID I’ve worked completely remote and I’ve never met anyone on the team outside of my manager. My entire team of 30 some people is also all Indian. I have nothing against Indians, but I definitely have felt a strange exclusion, and I’m not sure how much that has to do with being the only non-Indian. Beyond that, there have been times where I can not understand what anyone is saying in the meeting. Once my manager asked me to do something and I had to ask for clarification three times. On the third, I still didn’t understand, and just let it go out of fear of upsetting him.\n\n\nI didn’t receive my laptop until Wednesday of last week and wasn’t fully authenticated with Unix ID until Thursday morning. It has been an absolute nightmare getting access to what I need.\n\n&gt;Is there a key manager, yes AWS Secret Key. Ok great makes sense, check there, but the keys are not there. Oh you are on the wrong AWS role, you need to use this custom app we built to request access to the right role. Check on new role not there... Oh that EC2 server actually has a password I keep in some plaintext document let me send it to you on Gchat...  \n&gt;  \n&gt;I sent out the documentation for the project to everyone... oh you need to authenticate to this specific system to get access. Oh to authenticate to this system you need permissions from this other system first.\n\n\nMultiple times there have been requests  for me to do something, only to find out that the task was done months or years ago by another team member. I like to take the initiative and jump on projects, but because I have no real idea what exists yet, I’ve been hoping for others to pretty much tell me what they need help on.  I’ve stated “I’m more than happy to work on whatever is needed, or leftover”. Most meetings end with indecision. I’m not really sure how else to approach this and would love feedback on how to better get involved with the team.\n\n\nI’ve also never worked on a large team of engineers, so I'm sure I could improve here. I know the ins and outs of Jira, but my previous company was so small you could just talk to people, which was great. Here it seems very Jira heavy, and anytime I ask questions like\n\n&gt;If I were to create an API/CLI for dynamic S3 bucket generation, how would you get access keys and secret keys? Would it be preferred to assume roles?”\n\nas a separate manager had asked me to do this yesterday (which was great, as it was the first time I’ve spoken with someone who gave me an explicit task to do). I was ignored, and then in a separate meeting found out an entire system already exists for this more or less.\n\n\nThere are also relatively complicated chains to do anything, as you have specific people managing each set of systems.  Everything is extremely documentation heavy, and the chain of command for approval is still beyond me. Unfortunately, I’m still unaware who many of those people are, and for those I’ve met, they all seem reluctant to include me in anything they are working on.\n\n\nWe also have daily checkin meetings where it’s literally “Hi so and so what are you working on today?” Is this normal? Like how much can anyone reasonably do in a day where it requires a check in? In general, I sense disappointment from everyone, but I feel like I’ve technically only been working 6 days (since I’ve had a laptop to access the systems)!\n\n\nI should mention that I found out that there is no overtime, and if you do work overtime you can “take time off (unpaid) to reflect the hours you worked”, which honestly took the incentive away from me to work more than 40 hours. (as a previous FTE I would work 70+ hours on occasion).\n\n\nFinally, a lot of the systems have a funny code smell. Most of the people on my team are at least in their late 30s so maybe it's my junior ignorance... but some systems and implementations just don't make sense or seem poorly planned.\n\nAll in all I am pretty unhappy with this role, but I’d like a reality check to know how much of my experience are things I could improve. Or does this job just suck?",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/fuhcgl/need_a_reality_check_am_i_underperforming_or_does/",
      "comments": [
        {
          "body": "&gt; We also have daily checkin meetings where it’s literally “Hi so and so what are you working on today?” Is this normal? Like how much can anyone reasonably do in a day where it requires a check in? \n\nThis kinda sounds like standup to me. Very standard agile practice in software dev, but it's more of a meeting where each member of the team can discuss what they're working on and any blockers they have.",
          "score": 12
        },
        {
          "body": "&gt;Beyond that, there have been times where I can not understand what anyone is saying in the meeting. Once my manager asked me to do something and I had to ask for clarification three times. On the third, I still didn’t understand, and just let it go out of fear of upsetting him.\n\nlol that's funny",
          "score": 8
        },
        {
          "body": "I think you just replied to a similar rant I made lol\n\nLet's be shitty job buddies",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "It sounds like you're questioning whether this was the right move. I obviously don't know anything about you or your situation, but going off of what you said here, I would encourage you to stick it out. Keep in mind that it's always awkward and difficult starting a new job. Cultural differences, procedural differences, technical differences... there's a lot going on and a lot to pick up. Layer on top of that the truly exceptional circumstances that have hit, and you're in an awkward and uncomfortable spot.\n\nSo try to keep that all in mind, but still devote yourself to your job and learning and figuring things out. As a suggestion, when you're in a meeting and talking through things that will be done, make a point to take a couple minutes at the end to summarize your next steps (as well as anyone else's where dependencies lie). That will help ensure you're getting the right message, but is also a signal to the team that you're taking things seriously and paying attention. Also, try to make inroads with someone on the team on a more personal level. Maybe reach out to each person individually to set up a 30-minute Zoom/Teams/whatever meeting just to meet them and get to know them a little bit. Don't worry about trying to prop up your experience or credentials; make it more about getting to know them, their experience and expertise. The more you can connect personally and in a low-stakes way like that, you create a foundation of trust to be able to reach out with questions when you have them.",
          "score": 1
        },
        {
          "body": "Using all of aws, gcp, azure instead of sticking to one ecosystem is already a red flag to me. Either your team’s scope and business goals are way too large and needs to be divided up better, or your teams’s systems are incredibly over complicated.",
          "score": 1
        }
      ]
    },
    {
      "title": "Newly Certified CAPM",
      "body": "Recently acquired my CAPM (certified associate project manager) certification from PMI. \n\nWhat entry level roles or additional certification should I look for to get into I.T?\n\nHave 4 years in operations and project management in the construction industry but looking to break into tech. \n\nGoal is to acquire PMP and CSM in the future but looking for an position compatible with CAPM at the moment.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/188prps/newly_certified_capm/",
      "comments": [
        {
          "body": "You may want to look at a “tool specific” training or certification thing like Atlassian JIRA (it is fairly ubiquitous at tech companies) and maybe something like certified agile scrum master (if you like working with developers) or product owner (if you prefer the business and design side). \n\nTaking your construction pm experience and putting process and tooling for IT and software dev behind could be compelling for a smaller tech start up or a larger company with growing dev needs. \n\nAt a minimum, you can start a JIRA account on their free plan and play around with the tool to see how you can apply your PMI skills to that tool. Going on YouTube or linked in learning or other learning sites can also show you some of the tools and processes as well. \n\nYou’ll be more successful in interviews if you understand the lingo and process (not necessarily how to code) of creating, testing, and releasing software.",
          "score": 1
        }
      ]
    },
    {
      "title": "Atlassian interview experience",
      "body": "\nI had a bizzare experience during my onsite interview at Atlassian where the interviewer himself didn’t seem to understand the solution and I felt was unfamiliar with the question itself. He gave me a ds question similar to LCA in leetcode where the tree could be m-ary tree. I solved it using recursion and even finished writing proper unit test cases for it. The interviewer first of all couldn’t even understand my solution even after talking through it out loud with him. I explained it to him multiple times but he seemed not to get it. He asked me to print the outputs instead of showing the running/passing test cases.\n\nHe wasted so much of my time:\n\n1.\t⁠By rambling about his experience back to his grad school and the multiple teams he worked within atlassian describing each one of them.\n2.\t⁠By not understanding the solution and test cases and by asking me to print intermediate results for various test cases (seemed like he was trying to understand the solution and question for the first time)\n\nI was so annoyed at him and in the end he rushed me by saying “you’re running out of time”. And never even mentioned about the scale up question.\n\nI had got a higher p50 for craft and system design interview in onsite. The recruiter said that the feedback is positive after the coding rounds.\n\nBut when I went in for management interview the manager mentioned the recruiter put a note to interview for p40. I mentioned to him that I was told it was for p50 to which he said he’ll get back to the recruiter and conducted the interview. Both my behavioral interviews went well. But I think they’ll low ball me and offer p40 if at all they come back with an offer. I don’t know how they decide on the level overall.\n\nDoes anyone have experience with their hiring process and guide me if and what are the next steps? Is there a scope of negotiation on level if at all they get back with an offer?",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1p48i1x/atlassian_interview_experience/",
      "comments": [
        {
          "body": "If they lowball you to P40, then at least one of your interview rounds must have been evaluated at that level. You can ask them to redo it especially if it was the coding round you mentioned here",
          "score": 2
        },
        {
          "body": "I won't be surprised if the recruiter stated this is for P50 level position even though he left out the position was a P40. They probably gave you some BS wording and tricked you that its a P50. I had a couple of candidates I hired that told me the recruiters at Atlassian gave them incorrect levels and low balled them at the offer stage. This is from my experience from candidates. If management says P40 you are getting P40. I suggest you negoitate to P50 level or match it if you are desperately looking for a job.",
          "score": 2
        },
        {
          "body": "Hey OP!\n\nHope you get the desired offer.\n\nI have a recruiter call tomorrow, can you share what to expect ? And how i can prepare",
          "score": 1
        },
        {
          "body": "Yes that sounds frustrating tbh, especially when the interviewer doesn’t seem aligned with their own question. Sadly that happens more than people admit.\n\nFrom what I’ve seen, leveling at Atlassian is pretty committee-driven, not just one round. So even if one interviewer was messy, the craft + system design feedback usually carries decent weight. Recruiter notes aren’t final until all feedback is reviewed together.\n\nIf you do get an offer at p40, there is usually room to discuss level, but it’s easier if you anchor on scope/impact rather than “I was told p50”. Asking the recruiter how they mapped feedback to level is totally fair.\n\nAt this point it’s mostly a wait game. I’d just stay calm, follow up politely, and be ready to negotiate if something comes through. And yeah, your experience isn’t unique - Atlassian interviews can be very hit or miss depending on interviewer.\n\n[https://www.patreon.com/posts/boost-your-score-145435346](https://www.patreon.com/posts/boost-your-score-145435346)",
          "score": 1
        },
        {
          "body": "I’d create a Jira asking them.",
          "score": 0
        }
      ]
    },
    {
      "title": "Seeking help for Atlassian Senior Software Backend Engineer Interview",
      "body": "Hi Guys,\n\nI have cleared the karat (pre screening) round and have an interview for Senior Software Backend Engineer (P50). I have two rounds coming up on the same day focusing on:\n\n1. **Code Design**\n2. **Data Structures**\n\nHas anyone done these rounds before and know what to expect for each? What is the difficulty level of these interviews? What sort of questions did you get asked and how many? Also, do you have any recommended sources for preparation?\n\nAny help would be greatly appreciated. Thanks in advance!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1e0m097/seeking_help_for_atlassian_senior_software/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Can you share your pre-screen (karat) interview experience? Questions for both system design and coding part would be invaluable. Thanks!",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview Experience and mistakes made by me",
      "body": "Hey @everyone hope u r doing good. If anyone is about to give his/her interview at Google/Microsoft/atlassian or some where else you all can go through my post and learn from my mistakes in the above mentioned interviews. \n\nRight now I have only shared about my Google internship interview experience. In a  few days I'll share the rest as well. \nThan you !!\n\nMy Google application engineering internship interview experience - https://www.linkedin.com/posts/activity-7200743950813442048-05MC?utm_source=share&amp;utm_medium=member_android\n\nAir-30 (My biweekly leetcode contest rank) - https://www.linkedin.com/posts/activity-7200754956113502208--wFy?utm_source=share&amp;utm_medium=member_android",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1d1x8q1/interview_experience_and_mistakes_made_by_me/",
      "comments": []
    }
  ]
}