{
  "company": "bain",
  "post_count": 8,
  "exported_at": "2026-01-18T17:44:53.259Z",
  "posts": [
    {
      "title": "I am working in one of the biggest tech companies since 2 years. I am doing nothing in the last 6 months. Is this normal? (X-Post /r/cscareerquestions)",
      "body": "Here is the summary of my situation:\n\n* I started working in the company in the beginning of 2014.\n* I got a MSc. degree in CS, I had one year of experience and also several internships (one in another big company)\n* They interviewed us harshly, so yeah the interview was tough.\n* In the first 6 months we did some prototypes and stuff it was fun and I was enthusiastic.\n* The project I am involved got worse month by month. The project does not target a well defined group, the management is bad and the architecture etc is not well defined. \n\nNow, in this last 6 months my daily routine is:\n\n1. Go to the workplace.\n1. Check reddit and stuff.\n1. Attend non-sensial meetings (if there is any), pretend you are listening.\n1. Code(maybe 2 hours in a week heh)\n1. Go back home.\n\nI don't feel like I am working in one of the biggest tech companies but rather a family business. I asked my manager to change my project but no luck..\n\nSo my question is, does anybody else experienced this?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/3ii066/i_am_working_in_one_of_the_biggest_tech_companies/",
      "comments": [
        {
          "body": "I just left my first job out of college, a corporate retailer, after about a year and 10 months because I felt so stagnant. I just was getting no where with the job and it was eating me away knowing this.\n\nI took a jump and did freelance for a bit, but then something great happened. I applied for a position with a 30 person SaaS tech company and got hired to do their creative marketing. I start in two weeks and I couldn't be more thrilled. It's a company currently at circa $4 mil in revenue and projected to go up to $30 in five years.\n\nAnyway, my point in telling you this is that in a large corporate beast it's so hard to feel like you  make tangible gains sometimes. You are a tiny clog in a huge machine. Your contribution can seem trivial and pointless. Working for a smaller company has it's own set of issues (can be like working in a family-owned business, everyone knows everything about each other, lower pay and less of a net to catch you if you fall) but the benefits I think career-wise can be really powerful and eventually lead you to something badass in the future. \n\nHope that helps.",
          "score": 2
        },
        {
          "body": "Me.\n\nSource: currently in a meeting. Have coded less than 1 hour this week. Aced Bain's recruiting exam ans did really well at ATK's first round interviews thanks to all the time i have.",
          "score": 2
        }
      ]
    },
    {
      "title": "I posted a thread earlier where I asked about job opportunities, and all of you said that my salary expectations were too high with my liberal arts degree. Well suck it, I got a 70k starting salary job!",
      "body": "I deleted a post I made here earlier in which I inquired about business related jobs. I have degrees in Political Science and English from UC Berkeley, a 3.84 GPA (with honors), leadership experience, and political experience. I was aiming for a job in consulting, sales, and/or marketing that pays at least 50k. You all claimed that even with a degree from a prestigious school, because I lacked technical skills, a 50k salary would be very unlikely. Moreover, many of you claimed that my political experience wouldn't be relevant to business positions (and that I would alienate potential employers) \n\nHowever, you all were wrong. I got accepted into a consulting gig for Bain and Company. While at first they were curious as to why someone with a political background would want to do business, I articulated why I felt my experience and skills would make me an asset for the firm. I also prepared a ton for the case interview and did well there. In addition, I did tons of networking through my friends who majored in business and through UC Berkeley's alumni association (many are successful in the business world). My recruiters were impressed with my grades + UC Berkeley degree (despite it not being in business or engineering). And I finally got the position!\n\nSo here's my advice: if you think you don't have a marketable degree, don't fret! All that matters is how you present yourself and if you can convince your recruiters/interviewers/HR that despite being a nontraditional applicant, you have the requisite skills for the position and can bring something new to the table. While my position at Bain will have me doing traditional management consulting work, because I have a political background, I will also assist small and large companies navigate their relations with the government.\n\nMy main point: there's nothing as being too ambitious. Don't let other people deter you from pursuing your goals, because if you try hard enough, you can achieve them.\n\n**Edit: Let me clarify: my \"suck it\" was aimed toward the people who said I was delusional about aiming for a 50k starting salary, and that my liberal arts degrees were \"crappy\" and weren't useful for business positions. And they kept on boasting about their STEM degrees**\n",
      "subreddit": "jobs",
      "score": 8,
      "url": "https://reddit.com/r/jobs/comments/299qit/i_posted_a_thread_earlier_where_i_asked_about_job/",
      "comments": [
        {
          "body": "Consulting is an area where overall excellence can often trump demonstrated skills. Good for you, as long as you can stomach the hours you're in a great position. Either way, that job sets you up very well for future work.\n\nCongrats!",
          "score": 7
        },
        {
          "body": "I don't mean to shit on you - congrats on the job - but just know that the $70,000 you will be earning as an entry level consultant at a major firm will come at the cost of any semblance of a work-life balance, and a lot of what you will be doing will be incredibly miserable. \n\nI have *a lot* of friends who worked as consultants at the big firms like Bain and McKinsey after graduating from college, and once their yearlong contracts were up, almost all of them left. Even though they were all smart people, it was frustrating for them to have to consult with clients who were twice or three times their age, who didn't respect them because of that fact. They traveled all over the country but most of what they saw were hotel rooms and conference rooms. They made a buttload of money but they had no time to spend it. You will have to be able to function at 100 percent for 60-80 hour weeks. Everyone you interact with will be overly competitive Ivy League grads, one-percenters, what have you. The big consulting firms are essentially corporate frats - they lure you in with their prestige, they lavish you with dinners and drinks during the recruitment process, and then once you're on board they haze the fuck out of you. \n\nI'm sure you're well aware of what you're getting into, and probably none of what I've said is news to you. The entry level consulting gigs are terrific springboards, no doubt. Just don't tell people to suck it when you don't even know what the job is really like at this point. Who cares if you're making $70k/year if your job makes you miserable?  ",
          "score": 6
        },
        {
          "body": "sensational, and clearly, you deserve what you earned\n\ntop grades, meticulous preparation, intelligent networking, strong presentation...Reddit doesn't figure on excellence like that",
          "score": 2
        },
        {
          "body": "Go Bears!\n\nWe are Sons of California\n\nA loyal company;\n\nAll shout for California\n\nWhile we strive for victory.\n\nAll sing the joyful chorus,\n\nAs her colors we unfold;\n\nThen hurrah for California,\n\nAnd for the Blue and Gold.\n\n\n----------------\n\nBut in all honesty, the people who usually come here to ask about job help are not Berkeley honors graduates with leadership and political experience with a great network. So, I can see everyone was down on you.",
          "score": 2
        },
        {
          "body": "When my daughter was still an undergraduate, she said \"Argh I don't know why I went for an art degree, what was I thinking!?\"   \n\nBut at the start of the previous summer, she'd been offered a job \"for a few weeks\" at a local office.  The few weeks stretched to the whole summer.  Then they asked if she could come back the next summer.  At the end of that, her senior year, they asked if could she join them full-time when she graduated.\n\nI told her \"Given your experience with that company, I don't think you'll have any problems getting a good job, no matter what degree you have.\"",
          "score": 1
        },
        {
          "body": "congratulations, education and previous experience can only do so much for you but at the end it all comes down to how you present yourself \nIn a world that's getting increasingly more difficult to find work (yet alone something you love) I can say congrats!",
          "score": 1
        },
        {
          "body": "Congrats on the gig, and thanks for posting this - I'm an English major and an MLIS who frequently regrets going to school for these. This gives some hope! :)",
          "score": 1
        }
      ]
    },
    {
      "title": "Should I tell the hiring manager I already signed another offer?",
      "body": "I signed an offer letter with a consulting firm about 15 days ago and my start date is set for November 20.\n\nI haven’t fully joined or started any activities yet. I have an interview with Bain &amp; Company tomorrow, I already told HR about this situation but should I also mention it to the hiring manager or better not bring it up?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1otzoro/should_i_tell_the_hiring_manager_i_already_signed/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "I would still do the interview. If you're asking, it's probably because that job might interest you. Even if  you signed somewhere else, nothing stops you from cancelling a day prior saying you found a better fit. What are they going to do? Fire you? You haven't even started.",
          "score": 1
        }
      ]
    },
    {
      "title": "How to Break into Top Private Equity &amp; Consulting Firms (McKinsey, Bain, BCG) | Career Deep Dive",
      "body": "Hi! Early on in my career, I wish I knew what Private Equity and Consulting was. I created a video where I interviewed two professionals with deep experience as a financial analyst in Private Equity and consultant at Bain/Deloitte to give you more insight as to what the jobs are actually like. \n\nHere's the link to the video: [https://youtu.be/GhT2CcYqDTk](https://youtu.be/GhT2CcYqDTk)\n\nI hope you find this helpful!",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/15d1nv4/how_to_break_into_top_private_equity_consulting/",
      "comments": []
    },
    {
      "title": "Got rejected on Monday… but the recruiter reached out again today. Is this a good sign?",
      "body": "So earlier this week (Monday), I got rejected from a role at Bain &amp; Company. I was bummed but tried to accept it and move on.\n\nThen today (Thursday), the recruiter actually called me. She told me the hiring manager was *extremely* demanding and honestly “a bit weird,” but that both HR and the peer who interviewed me gave me super strong feedback. She also shared a *lot* of very, very, very positive comments about my interviews — way more than I expected after a rejection.\n\nBecause of that, they want to consider me for another position.\n\nHas this happened to anyone else? Does this usually mean something good? I’m trying not to get my hopes up, but it felt like a pretty unusual (and encouraging?) turn of events.",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/1p8kee3/got_rejected_on_monday_but_the_recruiter_reached/",
      "comments": [
        {
          "body": "Dude. Are you serious? You're overthinking. Take it at face value that it's a good thing. Just don't read into it as a guarantee of a job, as nothing is a guarantee.",
          "score": 15
        },
        {
          "body": "not uncommon and usually a good sign.  Just be realistic and stay level headed",
          "score": 19
        },
        {
          "body": "&gt; but that both HR and the peer who interviewed me gave me super strong feedback. She also shared a lot of very, very, very positive comments about my interviews. ….. they want to consider me for another position.\n\n&gt; Does this usually mean something good?\n\nAre you answering your own question or?",
          "score": 5
        },
        {
          "body": "Yes.  I've had this happen before.  Turns out they wanted to hire me and another guy but there was only one position, so they found another job to have me apply for to get me in the company.",
          "score": 4
        },
        {
          "body": "Probably gave an offer to someone else and they rejected, and you were a close second so they are reaching back out. \n\nOdd on the weird and demanding hiring manager though, it seems like a bit of warning from the recruiter.",
          "score": 3
        },
        {
          "body": "This happened to me. I didn’t get the first role I interviewed for, but ended up on another team. One I wasn’t considering and I’m SO happy with the way it turned out.",
          "score": 1
        },
        {
          "body": "I agree it’s a good thing and hope for the best for you, but I’ve had this happen twice in the last 6 months and neither came to fruition. One said they would get back to me when they had more info on the position and ghosted and the other actually had me interview with a C level who was also impressed and kept saying how they wanted to hire me but they needed to find the right role for me and then ghosted me.",
          "score": 1
        },
        {
          "body": "The hiring manager already had someone else in mind or didn’t like you, or like they said, wants someone with very specific criteria which you did not match. \n\nHR/recruiter consider you a strong candidate so they’re gonna put you up for another role with a different manager. That different manager could also have their own reasons for saying thanks but no thanks when the recruiter sends them your profile.\n\nSo it’s good you get another chance and have admin staff thinking you’d be a good fit but it always comes down to the person actually hiring for the spot.",
          "score": 1
        },
        {
          "body": "You clearly impressed HR. It's not unusual that reached back out if they have another time that you might be a fit, it does seem unusual they shitbagged the original hiring manager, calling him \"weird\"",
          "score": 1
        }
      ]
    },
    {
      "title": "What should i do to improve my CV in the 3 months before I re-apply to strategy Consultancy firms in London",
      "body": "I am applying to strategy consultancy firms in the upcoming recruitment season in September.  I applied last year to the major firms (bain, booze, boston etc) and out of 7 applications (far too few in retrospect) I only got 1 interview.  \n\nFor the next 3 months i want to do as many things as possible to improve my CV but i am unsure what to do.  I recently graduated from Oxford with a 2:1 (in a science they like)  but my cv lacks a lot of extra curriculars (its mainly sports).   I don't know how to get any good commercial experience as placements are impossible to get at this time. I'm not sure what i can do that shows leadership skills or commercial interprise (short of starting a company) as well as what to do to add to and improve my CV in general. Any advice would be greatly appreciated.\n\nTLDR:  I have 3 months to improve my CV for strategy consultancy before applications open and am prepared to work very hard and do anything to improve it and ensure i get the interviews, but I'm not sure what I can do to improve it and am looking for suggestions.\n  ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/huqg2/what_should_i_do_to_improve_my_cv_in_the_3_months/",
      "comments": [
        {
          "body": "This is a really niche field with few openings and masses of applicants at the best of times; and right now is a bad time for strategy consulting. So unlikely you will impress them with just one summer of activity.\n\nWhat is really crazy is the number of people who seem so desperate to get into this field. It really is not an attractive career choice - you will have to work all hours; lots of travel (and the glamour wears off quickly); have no life outside work; and in most cases get \"counselled out\" within a few years. Less than 1% stay in for the long term.\n\nIf I were you I would get a job in commerce/industry, do a top MBA in 3 years, and then apply to Strategy consultancies for the post-MBA intake if you still want to work there - and there is a good chance that you won't!\n\n",
          "score": 1
        },
        {
          "body": "Start a business, work for a non profit, find an industry internship, or find some kind of volunteer leadership position. You don't want to be a graduate with a big gap on their resume.\n\nHonestly, your best bet at this point is to network your ass off. There are a lot of Oxford grads in strat consulting, get in touch with them and make them like you.  You have going to have a harder time getting interviews after graduation than you did before unless you have good contacts.",
          "score": 1
        }
      ]
    },
    {
      "title": "Telegram Job Interview",
      "body": "I'm looking for a second job, an online job I can do from home and I got an interview with a company called \"Bain &amp; Company.\" The interviewee's title is \"Senior Global Recruiter\" she has me interviewing online through Telegram app on my phone. Does anybody have any experience doing on online interview like this? or any experience working with this company? They are offering $15 an hour during training and $25 after training. The job is Customer Service/ Data Entry. I don't know it its legit or not. It seems legit, (i.e. they're asking legit questions you'd hear at any basic job interview) but it still feels a bit too good to be true. Then again I always feel that way about everything and I always view everything with skepticism. It's better to be safe than sorry.\n\nUPDATE:\n\nokay the company is legit. The lady did give me her first and last name. it feels legit but I'm still cautious. They said I will be using\n\nBS1 Accounting Software\nBYOB business essentials software program\nPeach Tree Premium Accounting Software.\nAll legit software's, most I can get from CNET. Here's what she says tho......\n\n\"You will receive your employment Offer Letter and HR document which will be coming along with your working materials during your orientation and traning. You are required to fill, sign, and send back to us a copy of the employment Offer Letter with your Drivers License or any valid I.D. as soon as you have receive them.\"\n\n\"All is to be purchased from a tested and trusted local vender that serves our employees working online from home, and you will be referred to the vender to make purchases at the right time.\"\n\n\"you will be required to purchase all the items mentioned above to enable you get started with work, this will be regarded as the first task given you, by the online HR and company's accounting department, the funds will be provided to you by the company.\"\n\n​\n\nI don't know guys",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/kalwoe/telegram_job_interview/",
      "comments": [
        {
          "body": "It's probably legit, but you're going to want to keep your answers short and concise to cut down on costs.",
          "score": 2
        },
        {
          "body": "UPDATE:\n\nokay the company is legit. The lady did give me her first and last name. it feels legit but I'm still cautious. They said I will be using\n\nBS1 Accounting Software\nBYOB business essentials software program\nPeach Tree Premium Accounting Software.\nAll legit software's, most I can get from CNET. Here's what she says tho......\n\n\"You will receive your employment Offer Letter and HR document which will be coming along with your working materials during your orientation and traning. You are required to fill, sign, and send back to us a copy of the employment Offer Letter with your Drivers License or any valid I.D. as soon as you have receive them.\"\n\n\"All is to be purchased from a tested and trusted local vender that serves our employees working online from home, and you will be referred to the vender to make purchases at the right time.\"\n\n\"you will be required to purchase all the items mentioned above to enable you get started with work, this will be regarded as the first task given you, by the online HR and company's accounting department, the funds will be provided to you by the company.\"\n\n​\n\nI don't know guys",
          "score": 1
        },
        {
          "body": "Id do due diligence and look up the recruiter online as well as everything else.  Bain &amp; Co is a consulting firm from google but do your part and look up all the details. This might just be a contract based job which is fine ($25/hr ends up being around $17/hr if you take taxes out as a 1099 contractor)",
          "score": 1
        },
        {
          "body": "Do your research on the company and the person, but probably a scam.",
          "score": 1
        },
        {
          "body": "First of all, they have major typos in that so I already hear alarm bells! Second, was this an unsolicited interview? If it is, it’s definitely a scam. I know it’s hard but I would pass on this. You could fall into identity fraud.\n\nAlso Bain and Company wouldn’t do interviews like this (via app) nor would they do unsolicited interviews. Take my word for it. This scam is just using the company name.",
          "score": 1
        },
        {
          "body": "Bain is literally a Big 4 consulting firm lol but this does not sound like their recruitment process just from what I know of their grueling new grad process...are they using the red logo and everything?",
          "score": 1
        }
      ]
    },
    {
      "title": "Are these good arguments for a higher salary during an interview?",
      "body": "I have a job interview for a procurement position.  I have some arguments I've been itching to try out but I'm worried they're a bit smug.\n\nThere's no salary range on the position and the last person I talked to claims they make a point of not having ranges.  Glass door has four data points claiming 100k to 120k.  My thought process is that this is limited data and likely out of date. I'm due for promotion that is roughly in the 120k range.  \n\nSo my plan is to put my salary expectations up first and then think out loud my reason for coming to that conclusion.  They are\n\n1.  Reference their glass door salaries and the salaries other jobs have offered .e.  There were a couple upper 120k jobs I turned down out of loyalty.  A 145k job at Baine and at 170k job with BP, but frankly fuck those companies.\n2.  Reference that these figures are when I had less experience.  Plus the market is likely going to increase on the figures once it starts growing again and refilling the positions it's laid off.\n3.  Reference that my record of savings at my current company is 13% on every dollar.  I'm going to ask them what their volume per agent is.  It's a bit of a trick question because if this company is worth anything, 13% is going to make an additional 10k negligible.\n4.  This job is for negotiation and procurement.  I want to argue that an applicant is never going to perform harder on a project than they are for advocating for themselves when it comes to salary benefits. I want to argue that anyone that doesn't ask for more during the interview process is going to cost the company more down the line in overall performance and should be disqualified.  (This one definitely is more of the hail Mary but I think theres I'm genuine argument to be made here)\n\nWhat are your thoughts?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1e69c79/are_these_good_arguments_for_a_higher_salary/",
      "comments": [
        {
          "body": "I’d keep it simple and focus on your proven results and market standards. Mention that your current and potential savings demonstrate your value, and market data supports your expected salary range. Show that you’ve turned down other offers due to your commitment and fit. Emphasize that negotiating for yourself mirrors how you’ll negotiate for the company. Good luck!",
          "score": 6
        },
        {
          "body": "It might be different in your industry but I wouldn't be the first person to bring up salary in an interview.  Crush the interview first, make them really want you &amp; see you really want the role, then when/if they talk about salary, then you can negotiate.",
          "score": 2
        }
      ]
    }
  ]
}