{
  "company": "bank-of-america",
  "post_count": 61,
  "exported_at": "2026-01-18T17:44:53.259Z",
  "posts": [
    {
      "title": "Would it be worth it to apply for the same position again as before in which I got 3 interviews and was one of the final candidates for the position?",
      "body": "Earlier this year I had applied to be a relationship banker at Bank of America, I didn't hear anything following the video questions and such until a month and a half later after I had applied in regards to potentially getting a final interview. 2 weeks later after that I had been confirmed for a 3rd round interview via phone which I went through with but unfortunately was told the next day that I wasn't selected. This was in early/mid july and I'm currently a property manager for a family business but am trying to get my sleep schedule better and my mental health better so that I don't have problems at work and can achieve career goals. I have a bachelor's of business administration in management from August 2020 but have had mixed experiences in jobs since graduating due to insecurities and unhappiness, anger, etc.. I'll be 31 next month and use to work in retail for 2 years as sales associate while in junior college (got my associates) and worked for UPS as a package handler (was trying to be an MMA fighter which wasn't going to go anywhere) for 1.5 years before leaving to focus on getting my gpa up for school and such. I have had some success in sales and cash handling having worked at GNC for 4 months but left due to being very miserable not making money and feeling like a complete bum (would sometimes cry when at home alone; not looking for pity from anyone). \n\nI'm currently getting into volunteer work that deals with call center stuff at my food bank as that will add to my experience for the jobs I've tried to apply to. I'm working on my real estate license atm and I know from having applied to banks before that I should expect to wait about a month or so before knowing of an interview. Is there anything I can do for now that could potentially help me stand out a little more as the best candidate should it be a good idea for me to apply again?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/wvgxyd/would_it_be_worth_it_to_apply_for_the_same/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Definitely worth it if you made it to the 3rd round.",
          "score": 3
        }
      ]
    },
    {
      "title": "BofA fraud client services",
      "body": "I applied for a position in fraud client services at Bank of America. My first interview was over the phone, only about 15 minutes and went very well. I have a second interview scheduled for next week where I’ll be interviewed in person by 2 people at the bank. I have no experience in banking (was not required for the role) but plenty in management and customer service roles. \nI was told to be prepared for a role playing scenario and have questions for the interviewers at the end. \nDoes anyone have experience interviewing for this position? What questions were asked? What questions did you ask your interviewers? Any tips or suggestions are greatly appreciated TIA\n\n",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1lx7gf0/bofa_fraud_client_services/",
      "comments": [
        {
          "body": "Think of the role , read the job description, imagine what scenarios you’d be encountering.",
          "score": 3
        },
        {
          "body": "The role-playing scenario will likely involve handling a frustrated customer who's discovered fraudulent charges on their account, so expect to demonstrate empathy, active listening, and problem-solving skills. They'll want to see how you balance being supportive with following bank protocols - think about how you'd calm someone down, gather necessary information, and explain next steps clearly. Your management and customer service background is actually perfect here because fraud cases require the same de-escalation techniques you've probably used before, just with higher stakes since people's money is involved.\n\nFor questions to ask them, focus on understanding the team dynamics and growth opportunities - ask about what makes someone successful in this role, or what the biggest challenges are in fraud prevention right now. The interviewers will likely ask behavioral questions about handling difficult customers, working under pressure, and maintaining confidentiality. Since you're coming from outside banking, they might test your judgment with ethical scenarios or ask how you'd handle situations where you can't give customers the answer they want to hear. I'm on the team that made [mock interview AI](http://interviews.chat), and it's designed exactly for situations like this where you need to practice tricky role-playing scenarios and nail those behavioral questions that can make or break a banking interview.",
          "score": 3
        },
        {
          "body": "Any updates on how your interview went? And how long did it take to hear from them after your first interview? I just scheduled my phone call interview for tomorrow.",
          "score": 2
        },
        {
          "body": "I have a phone interview tomorrow for the same department. Wish me luck !",
          "score": 2
        },
        {
          "body": "Well, as a customer, I can say that this is one of the best teams at BoA. Everyone I've worked with has been great - extremely helpful. I can't say anything with certainty, but people call into that team for a couple of reasons - one is if they do feel there's been fraud, but more often, when BoA's extremely aggressive algorithm tags something perfectly normal as a potential issue. When that happens, I know I'm frustrated - and I'm sure that's common - so the role playing could well be calming down a frustrated customer and getting things resolved quickly. \n\nFor questions? You might ask about the sorts of calls you'll be handling, what sorts of problems the customers will have, and the best way to get things done in a way that's positive. \n\nAgain, this comes from a customer's standpoint - but I hope it's helpful to some degree.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Am I being ghosted? ",
      "body": "So i applied to bank of america APAC, and i was offered for an interview on Tuesday and got rescheduled to the next Tuesday. then i got rescheduled again but this time they just said like “we’ll come back to you again once the date is confirmed”. and haven’t heard back yet since the last email. \n\nnow what worries me is that, my friend who got the same offer and was supposed to have the interview with me on the “next Tuesday” ,did his interview on the day and he finished his second interview a week after. \n\nIs this normal? or am i just being ghosted by the HR?  \n\nThanks in advance! ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1h0z85a/am_i_being_ghosted/",
      "comments": [
        {
          "body": "Former HR executive.  Could mean a ton of things.\nThis is a tricky time of year. Schedules change. Budgets are being scrutinized. Or the department just doesn't have their shit together. \nEnjoy the holiday and follow up on Tuesday. \nGood luck!",
          "score": 3
        },
        {
          "body": "You know they received it. You received the confirmation.  Id follow up on Monday. If you don't hear back message me, and I'll help you with what to say.",
          "score": 1
        },
        {
          "body": "It sounds like internal stuff is going on. Like they’re reviewing their workforce alignment and budgets.",
          "score": 1
        },
        {
          "body": "HR is likely working with the hiring manager to ensure schedules line up.  Agree that it could be holiday related.  Friend could have different hiring manager who may have better availability.  I promise you they haven’t forgotten about you.",
          "score": 1
        }
      ]
    },
    {
      "title": "Nestlé Development/ Super Day - Finance Associate Question",
      "body": "Hello All,\n\nI have an upcoming interview with Nestle for a Finance Associate position. Their [super day](https://www.wallstreetoasis.com/tag/superday) consists of first a timed individual exercise called \"Dream Career\" (presumably a presentation you put together for the interviewers) and then a group activity called \"This is Better Than That.\"\n\nHas anyone done any of those activities and what do they involve/ Any advice?\n\nThanks\n\n\\-[ML](https://www.wallstreetoasis.com/company/bank-of-america-merrill-lynch)",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/qjv8s6/nestlé_development_super_day_finance_associate/",
      "comments": [
        {
          "body": "Hi there, would you be able to share your experience? I have a super day coming up.",
          "score": 1
        },
        {
          "body": "same question here\\^!!!!",
          "score": 1
        }
      ]
    },
    {
      "title": "It honestly is about who you know more than your skillset.",
      "body": "Bit of a back story, I've always wanted to work for Chase. (Biggest bank in America for you non us citizens) and would actively apply to any dev position they had no matter the state. Every single time it was rejected, or ghosted. I applied maybe 50-60 times to different positions within chase and nobody wanted to even give me a phone interview. I decided fuck it, and went to those training programs that place you. Oddly enough one of the positions was they place you within big banks, and I ended up getting my first interview with chase despite being rejected non-stop, and despite the fact NOTHING CHANGED ABOUT ME, but this job placement program gave you leverage to place you in front of them. So I did, and killed the interview. They were so impressed that I got hired a week later, and start in two weeks. If you get rejected, don't be discouraged it's often not your skillset but the fact hiring managers operate like imbeciles, valuing relationships over merit.",
      "subreddit": "cscareerquestions",
      "score": 102,
      "url": "https://reddit.com/r/cscareerquestions/comments/bklnlm/it_honestly_is_about_who_you_know_more_than_your/",
      "comments": [
        {
          "body": "I have the opposite problem, I'm getting interviews with big name companies but I'm mentally disabled so I can't pass any of the interviews.",
          "score": 141
        },
        {
          "body": "[deleted]",
          "score": 37
        },
        {
          "body": "&gt;It honestly is about who you know more than your skillset.\n\nThe reason why a vast majority of this sub refuses to take this seriously is that too many STEM people, especially on reddit, have been brought up on the idea that soft skills are useless and hard, technical skills are superior (i.e. \"stem master race\" meme). It's just not true. They are both equally important.",
          "score": 61
        },
        {
          "body": "Sometimes I swear CS students don't understand how social interactions work lol. Of course it's more about getting someone to like you. Always will be until we're replaced by robots.",
          "score": 38
        },
        {
          "body": "What do you mean by \"training programs that place you?\"",
          "score": 8
        },
        {
          "body": "Suppose you get two resumes.  One candidate you've worked with and get along, the other is totally unknown.  Suppose both do ok in the in-person interview.  Does it make sense to chance it and go with the unknown quantity?",
          "score": 8
        }
      ]
    },
    {
      "title": "Name and Shame: Bank of America",
      "body": "I interviewed with Bank of America last year for a Software Development internship.\n\n&amp;#x200B;\n\nFirst round interview was on campus. This interview went fine and was with two mid-senior level engineers. They asked language trivia and behavioral questions.\n\n&amp;#x200B;\n\nNext round interview was a \"superday\" in NYC.\n\n&amp;#x200B;\n\nGot there and met one of my interviewers from on-campus at a snack/drinks reception. He was drunk talking to 7+ candidates about how he was only in it for the money.  Everyone was clearly uncomfortable.\n\n&amp;#x200B;\n\nNext day I have my 2 interviews. I get into the interview and the first thing the interviewer said to me was \"I'm really not sure why I'm interviewing you. It definitely should be someone on the development side. This is an interview for a Risk Management Analyst.\"\n\n&amp;#x200B;\n\nFrom that point I answered 3 of his behavioral questions and he froze up as he had no more questions. This was literally 5 mins into a 30 minute interview. I then had to essentially conduct the interview myself asking him about what he did (business analyst) and talking about my side projects for the remaining 25 mins. The fact that he wasn't technical at all didn't help.\n\n&amp;#x200B;\n\nThe next interview went similarly. This time the interviewer was more social and kept questions coming, despite being completely non technical. I spent most of the time answering her questions about \"How can a machine really learn?\". She was also a business analyst.\n\n&amp;#x200B;\n\nWith both interviewers, I stressed that I was interested in a developer position and they assured me that they would talk to the right people.\n\n&amp;#x200B;\n\n7 days later I get an update that I was waitlisted (not rejected) for a business analyst role. Sent multiple emails to BOA asking if I was being considered for a development position. Recruiter wouldn't give me an answer and dodged the question multiple times. Update 2.5 months later with rejection for business analyst role.\n\n&amp;#x200B;\n\nEDIT: More information to address some comments I've seen\n\n\\- The title of the job was Technology Analyst. I was then switched (I assume unintentionally) to Business Analyst by the time of my final round.\n\n\\- During first round on-campus, we discussed language trivia, version control, personal projects, languages used, etc. It was clearly a development interview. They explicitly said they were interviewing me for a development position.\n\n\\- During final round, both interviewers told me something had clearly gone wrong.",
      "subreddit": "cscareerquestions",
      "score": 844,
      "url": "https://reddit.com/r/cscareerquestions/comments/9dl5vl/name_and_shame_bank_of_america/",
      "comments": [
        {
          "body": "&gt;Got there and met one of my interviewers from on-campus at a snack/drinks reception. He was drunk talking to 7+ candidates about how he was only in it for the money. Everyone was clearly uncomfortable.\n\nyeahhhhh commercial banking probably isnt for you. Neither is investment banking, I suppose. \n\nBut yeah, that sounds like shit. So, about what you'd expect from Wells/BoA",
          "score": 360
        },
        {
          "body": "&gt; He was drunk talking to 7+ candidates about how he was only in it for the money.\n\nThis is the guy you want to work for. He'll teach you real shit.",
          "score": 647
        },
        {
          "body": "&gt;\"How can a machine really learn?\"\n\nI know this is a serious rant, but this question came up in one of my AI course last year and it was funny but the Prof. met it with a serious answer.",
          "score": 130
        },
        {
          "body": "Wow, that sounds like a frustrating experience. Applying to jobs can be really annoying. ",
          "score": 56
        },
        {
          "body": "Not from the developer side, but BoA doesn't value IT at all. My wife started as a retail teller and now works in their private banking arm where all the clients are millionaires and above. If something as minor as a printer breaks, she'll wait a month for the single sub-contracted IT guy to come fix it because this poor dude has to cover 3 states of offices. If she has a computer problem, she usually just calls me for help before resorting to a ticket. You would think that you would not want the people serving your richest clients to be sitting on their hands waiting ages for IT support, right?",
          "score": 48
        }
      ]
    },
    {
      "title": "Name and Shame: FDM Group (a consulting company)",
      "body": "I've seen the recent *Name and Shame* trend going on here, and figured I would get in on the action. One of the recent shames was about a consulting company *Revature* (which I was also unfortunate enough to be involved with); and it reminded me of my experience with a similarly shady consulting company known as FDM Group. FDM is very similar to *Revature*, but they offer consulting services for a variety of technology related services, not just Software Development. As they put it *\"FDM Group is a global professional services provider with a focus on IT, FDM brings people and technology together.\"* One of the most interesting parts about the position was the client list. FDM has dozens of fortune 500 clients, I believe Bank of America was even one of their clients. I thought any experience with a company of that size would look amazing on a resume for a future job. For a little background on me, as an Undergrad I was a dual major in Computer Science and Cybersecurity. This particular consulting position I applied for at FDM was a cybersecurity position; although I had a few Computer Science friends go through extremely similar experiences to the one I am about to describe.\n\nI applied to the position after being contacted by a recruiter on LinkedIn, we talked briefly about my background on the phone; after I threw around a few Cybersecurity buzzwords the recruiter seemed extremely eager to get me onto the next step. The position initially sounded like a very exciting opportunity. It promised 8 weeks of salary-grade paid training in NYC, paid housing throughout the training period, paid travel expenses, up to a $1500 relocation package once you were placed with a company, and a variety of other small benefits like this that I cannot exactly recall. The catch was, you had to work as an FDM consultant for two years; if you left before the 2 years were up, you would be billed for all of the expenses FDM incurred on your behalf during your time there. The recruiter said this was usually around $30,000. I had this conversation with the recruiter sometime in early February.\n\nI now realize in retrospect how many red flags were there, but I was somewhat desperate for a job and decided to carry on with the interview process. FDM claimed that 80+% of their consultants went on to work for the company they were placed to after their two years at FDM was up; which seemed like an easy way into a mid-level position at a fortune 100 company only two years into my career.\n\nThe first round interview was a one-way video response screening, or as /u/berk_thrwaway so elegantly put it, “[the] lamest method of interviewing that I have ever come across.” For those that don’t know, you are prompted with a question on screen, and then given 1-2 minutes to record a video response to that question. Absolutely none of these questions were technical, and many of them seemed like questions aimed at managing subordinates (even though this was a starting consulting position).\n\nThe next round of the interview process was two separate Skype interviews with two different employees. These employees were somehow even less personable than one-way video interview, and they asked the exact same questions. My second interviewer called me 45 minutes later than expected, did not email me telling me he was running late, and did not address that he was 45 minutes late when he finally did call. \n\nA few days after this conversation I was notified by my recruiter that FDM would be extending me an offer, and that I was “their top candidate” for the position. Since I was their “top candidate” I would be guaranteed housing during my training in NYC (something that I was previously told was guaranteed). I was also told that the start date was June 25th. The recruiter I had was a pretty cool guy, and even encouraged me to keep looking for other positions during this time, which thankfully I did. While I was happy to have received an offer, everything started to go downhill shortly after that.\n\nAbout a week later, I received the formal offer letter; **$45,000 for the first year, $51,000 for the second year**, and NYC **minimum wage** during the 8 week training period. The salary being relatively low became quite a concern to me, as you have no idea what company you are going to be placed with after you complete your training. $45k a year in Kansas is much different than $45k a year in NYC. FDM had also gone back on the original job listing (which I had luckily downloaded), promising salary-grade pay during training. I brought up this discrepancy between the offer letter and the job listing to my recruiter, who said that the job listing must have been a mistake as all of their employees receive minimum wage during training. Another weird thing about FDM was they wanted letters of recommendation from all of its new employees, after they had already made the decision to hire them. We were told to bring two letters of recommendation with us on the first day of training, as well as a myriad of other paperwork and disclosures, that I luckily never filled out. In early April the 15-20 consultants that were getting hired with me were all invited to a WEBX on how to fill out a specific health-related benefit package, as well as getting the chance to ask general questions about the company. Half of the Webx participants could not figure out how to connect their audio to call, and a number of them called in from landlines and had no way of seeing the PowerPoint presentation. I might be a little harsh here, but I have no idea how these people were expected to somehow become CyberSecurity/Software engineer consultants in 8 weeks, when they lacked some of the most basic computer knowledge. Everyone that did manage to get their audio connected was extremely personable and well spoken, which I assume is how they breezed through the 100% non-technical interview process.\n\nAt some point in late April, I received notice that FDM had reached its budget to house new employees during training, and would not be funding my housing during training in NYC. At this point I had already received an offer for much more money from the company I currently work for, and decided to try and leverage this offer with my FDM recruiter. The recruiter told me that the minimum wage pay during training and $45k-$51k salary was entirely nonnegotiable.  I ended up accepting my current company’s offer, and emailed my FDM recruiter in early May to let him know I was accepting a different offer and never received a response. On June 22nd I was emailed by another FDM employee about what to expect about starting work on Monday morning. I quickly emailed him back to let him know that I had already told my recruiter I had accepted another offer. He responded very personably, wishing me the best of luck, and let me know that my recruiter had left FDM close to two months ago.\n\nA Computer Science friend of mine actually went through most of the same process I went through and experienced many of the same things; including the broken housing/pay promises. He attended a week and a half of the FDM training before receiving an offer from another company in NYC, and said that the training was “a disorganized mess.” Half of his fellow trainees left within the same time he did, none of them had their housing/local transportation costs covered by FDM, all of them were told they initially would be during the interview. He actually talked with a couple of people working there that had recently completed training, but had not been placed into a company yet; by their own accounts they did almost nothing all day except wait to hear back from companies about placement. One person he met at the NYC had actually been placed at a company in South Carolina, received the $1500 from FDM to relocate, relocated and lived/worked there for 6 months before the company terminated all of its external contractors. He was told to move back to NYC and work from the NYC office until he could be placed again.\n\nOverall, FDM group struck me as extremely cheap and shady. They seem to pray on the naivetés of recent college graduates, and abuse them for two years before turning them over to another company. My advice if you are going through the FDM interview process is to receive an offer from them, and use the more “glamorous” parts of that offer as leverage for any other offers you might get; I would not recommend getting involved with the company.\n",
      "subreddit": "cscareerquestions",
      "score": 243,
      "url": "https://reddit.com/r/cscareerquestions/comments/985lxd/name_and_shame_fdm_group_a_consulting_company/",
      "comments": [
        {
          "body": "Thank you for this, I had considered FDM a month ago and was set on following through with the process. I decided that it wasn't worth the headache and just kept searching. Still unemployed, but I feel like it was the smarter choice than having to be stuck in a 2 year contract with less than average pay(especially in NYC). ",
          "score": 75
        },
        {
          "body": "FDM is pretty much a human cattle market. \n\nBy the way, they offer 18k GBP per year in Central London. ",
          "score": 60
        },
        {
          "body": "&gt; if you left before the 2 years were up, you would be billed for all of the expenses FDM incurred on your behalf during your time there. \n\nWe should crowd fund an attorney to review these contracts to see of they're enforceable and then use these companies for free trips to NYC. If enough of us did it we could chill for a week in their corporate housing, spend our first minimum wage paycheck on booze,  and then quit en-masse. ",
          "score": 44
        },
        {
          "body": "&gt; global professional services provider with a focus on IT\n\nRUN AWAY, SAVE YOURSELVES, RUN, RUN, RUN.",
          "score": 20
        },
        {
          "body": "The contract thing changed my mind and most importantly the pay you are getting for those two years and how you will be living on minimum wage for 16 weeks. Living in expensive cities like NY/Toronto and being paid that much for an engineering position I reckon doesn't do justice.",
          "score": 13
        },
        {
          "body": "Now this is a name and shame that I can get behind. God damn this is scary and makes me feel awfully for the people working there. ",
          "score": 12
        }
      ]
    },
    {
      "title": "Has anyone had any experience with mthree?",
      "body": "I’m currently halfway through the interview process for this company and been reading up on reviews online. There seem to be some people that say it’s great and others that say it’s awful. Does anyone have any personal experience or know someone that has? I’d like to get to know some more before I jump in including if the training portion has a decent salary for London.\n\nEdit: Just finished the second week of training and have just received a job offer through them for Bank of America in their London Foreign Exchange office. Would definitely recommend this company if anyone is interested and the staff are very friendly.\n\nEdit 2: After 5 months at the bank I quit and now work in a much smaller tech firm. Feel free to DM if you have any questions about mthree :)",
      "subreddit": "cscareerquestions",
      "score": 25,
      "url": "https://reddit.com/r/cscareerquestions/comments/n62qno/has_anyone_had_any_experience_with_mthree/",
      "comments": [
        {
          "body": "What kind of work did you end up doing on your placement and why did you leave after 5 months?\n\nI'm considering an offer from mthree and worried about ending up doing basic IT work on my placement rather than actual software engineering. I don't really care about getting a foot in the door at a bank, I'm just looking to gain experience as a developer.",
          "score": 6
        },
        {
          "body": "I'm curious of them.. what's the interview process?",
          "score": 3
        },
        {
          "body": "How long after starting the training did you have interviews? I have just received an offer from them today and I’m curious",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "Hi, was the training done online for those weeks or in person? I applied and was sent a questionnaire to fill out with my information and a section that asked about what locations I’d relocate to.",
          "score": 2
        },
        {
          "body": "Hi how long did the background checks take to complete for M3?",
          "score": 2
        }
      ]
    },
    {
      "title": "Negotiating salary - quick guide on how to get more money",
      "body": "I see lots of people asking about rates/salaries, question of what to ask for comes up every so often, so I figured I'd write up a guide of how I negotiate my salaries/rates.\n\nWho am I and why should you care - Senior QA Manager with 20+ years in software industry. Maybe you shouldn't care, but you're already here, so why not read it?\n\nSo, what to answer when the dreaded question of \"what's your expected compensation\" comes up?\n\n\n**First negotiation round**.\n\nThat's right, there are at least TWO rounds of salary negotiations. During the initial interview process and when the offer is made. Take advantage of both. They both have different goals. The first one, during the initial interview stage is for you to make sure that you make the cutoff based on salary range while asking for as much as possible. Second one is there for you to ask for even more now that they got to know you and like you enough to make an offer. First round is usually done by recruiters and they don't give a shit about your salary. All they are doing is making sure you tick checkboxes you have to tick. One of them is being within a range. You job is to find that range and ask for the top end of it.\n\n1. First and foremost you should know that nobody will turn your down because you asked for more money than they are ready to pay. They will say \"Actually our current rate is X, would you be willing to work with that?\". If you say yes they'll forget what you asked for 10 seconds after that.\n2. Know that \"What are your salary expectations\" is a fishing question that gives you advantage. Your only job here is to give them the number that's higher than they expect to pay, but not outrageously high so that they laugh at you. The question is designed for timid people who think it's a privilege to work, who can be taken advantage of when they ask for less. If you're one of these people, I hope this can help you come out of your negotiations shell.\n3. Your mindset should be - if they don't say \"uh our rate is actually less\" then you didn't ask for enough. Giving them the higher number than they are ready to pay forces them to tell you what's the maximum they are going to pay. Always ask for more.\n4. Position your salary demands as \"I'm currently getting &lt;what you're asking for&gt; and I'd like to stay in that area\".\n5. Make sure they know you are open to negotiations.\n\n\nHere's how a sample negotiation usually go. I know the going rate in my area is 130-140K for my type of role:\n\n- What's your expected compensation?\n- Well, currently I'm getting 170K where I work and I'd like to stay in that area. That said, to me an interesting job takes precedence over few thousand here and there, so I definitely don't want the number to stay in a way of us talking. Plus, some of the benefits could be as good as cash in hand.\n- Right, so the maximum we're ready to pay for this role is 145K, would that work for you? For benefits we offer 4 weeks of vacation, 5% RRSP match, etc.\n- Sure, that sounds great!\n\nI use their question to get the information I need - what are they ready to pay and what are the benefits like. I've interviewed upwards of 50 times over the last ~18 months. Not a single time the interviewer would call it a day based in the number I give them.\n\n\n\n**Second negotiation round**\n\nHow to increase the number you give them afterwards. All went well and you got a job offer. Congrats! Now let's increase that number. *Always* ask for a day or two to think about it. Never agree on the spot, they never expect you to. Here is something to keep in mind - they've just went through exhausting process of interviewing several candidates. They chose you. They want you. They aren't going to shut you out immediately if you approach it respectfully and politely - they definitely don't want to interview people again. Worst they say is \"that's the max we can afford\". How I approach it:\n\n\"I've received a job offer from another company for &lt;what your offer says +10% or +10K, whichever is higher&gt;. Thing is, I would really prefer to work for you - the job sounds a lot more interesting, and I think we're a better fit. Do you think there's some wiggle room for the compensation?\". Be prepared to answer the question of \"what company is that\" (just name a company that exists but doesn't sound exciting. Like AT&amp;T or Bank of America or whatever. Bonus points is if you name their competitors. I've helped couple of my friends and myself get a higher offer this way after the initial offer was already made.\n\nA great addition from/u/Lazy_ML in the comments about this, in case they ask you to show offer letter from said other company:\n\n&gt;Many FAANG type companies say their offer letter is confidential and ask you not to share it. You can always use this to deflect the question. It may not get them to match but it won’t make you look like you were bluffing. Many companies also won’t give you the letter until you verbally accept because they don’t want you to shop it around so not having a letter isn’t an indicator of not being truthful (side note: I suggest trying to get the company to confirm the numbers via email, though some mf’s will call you back to confirm). I’ve never provided an offer letter and it has never been an issue (for FAANG as well).\n\n\n\n**Bonus round 1**\n\nDON'T TAKE LESS MONEY THAN THE MARKET AVERAGE. Let's say the average rate for your role is 100K and you're being offered 70K (looking at you, gaming industry. Fuck gaming industry and their labour exploitation). Fuck them. Turn them down. Make sure they understand that the reason you turn them down is their salary is designed to fish at the bottom of the barrel and that's not where you swim.\n\n- Oh you pay less because it's gaming so you're basically getting paid for playing games? Fuck you.\n- Oh you pay less because there's a ping pong table? You mean I have to come to the office *and* get paid less? Fuck you. \n- Oh it's oil and gas industry and they want to pay less because it's tough times and oil is cheap? FUCK YOU TWICE. I'm not beneath working for oil and gas but my rate will be at least 30% more than the market average, not less.\n\nThese are all real examples from my experience.\n\nBut bikes_and_music, it sounds good and all but I need money to pay rent and to eat. I can't just refuse a job offer because they aren't giving a fair wage, I haven't had a job in 6 months, it's a rough market out there!\n\nI hear you. Totally valid. Take the job. Get paid. Feed your family. Keep looking for a job as if you don't have one. Get a better offer and go get paid more. When you leave 2 months down the line make sure they know that you leave because the pay is shit. They will try and guilt you. Oh, you knew what the salary is, why did you accept if you were going to leave! Give them the absolute honest answer - I needed money. I took the job. You knew I wanted more. You know you pay significantly less than the average. If you want talent to stick around pay more money. If you do leave after short period of time don't put them on your resume. This way not only you get better conditions for yourself, you teach them a lesson about being cheapscates.\n\nTrue story - in March I was offered a 110K job. I wanted 140K. I turned them down. In July I started a job for 150K. By end of Jan I will have made the same amount of money as if I started in March, but I also got 3 extra months off.\n\n\n**Bonus round 2**\n\nThey offer you less money than the average but dangle \"excellent career opportunity\" in front of you. As a general rule you should know that this means that whatever promotion you're looking at you'll still be getting less money than the average for that role. Nobody but you can determine whether the opportunity is worth the paycut, but don't go into it thinking with promotion will come the $$$. It won't most likely they'll throw you a title, 5x more job and like 5K extra per year. It's great to have that promotion on your resume but do the math. You're going to stick around at least a year, preferably two after promotion before getting another job at that level. Plus a year to get there. If you're getting 20-30K below average annually that adds up to 60-90K in three years. Is it worth it? Only you can decide, but you need to understand that these are real money **you're paying** to get that promotion (if they give it to you).\n\n\n**Bonus round 3**\n\nSometimes it's ok to get paid less. One major example is time off. At my previous company when I got a job offer from another place I went to my boss and said \"I'm being offered 25% more than you're paying me. I'd like to stay here, and I know you can't increase my salary as much as this, but I was wondering if we could arrange an unlimited vacation situation for me. Doesn't mean I'll go away for 6 months or whatever, but I don't want to clock in and out. I want to have the freedom to work from where I want, when I want, as long as my projects don't complain about me. If they do - feel free to nip this in the bud.\" I got my unlimited vacation and you can be damn sure I used it to my advantage. Your time is your most valuable commodity. Don't sell it for cheap. I don't even consider this example as \"getting paid less\", I got paid more as far as I'm concerned because I took like 6-8 months of time off in the next 3 years. \n\nAnother example could be an industry that you're passionate about and is not famous for having lots of money. Maybe it's a company that works on some green initiatives. Maybe it's a non-profit that helps feed people in Africa. If you want the job and can afford the paycut - take it. There's nothing like knowing you're helping people.\n\n**Bonus round for hiring managers**\n\nNormalize telling people when they ask for less than you're prepared to pay. These aren't your money. Your VP/CEO is not going to suck you off just because you save him 5-20K a year. You team is ultimately your boss. If they lose trust in you that's game over. Easiest way to get them on your side is to be upfront - Joe, you asked for 80K but the average wage for this role is 100k so we'd like to offer you 100K.\n\nFor you it's just a number. For them it might the difference between being able to put their parents in a nice hospice or needing their spouse to quit work to clean up after them. In other words, 20K/year for a company is a spare change. For a person it can change their life. Don't be a dick. Be a person who changes people's lives for the better.\n\n\n\nIt took me some time to get to these, I hope they can help some of you to make more money. I've helped multiple acquaintances as well as myself to negotiate their salaries using this. Go get paid. Fight the status quo.",
      "subreddit": "cscareerquestions",
      "score": 794,
      "url": "https://reddit.com/r/cscareerquestions/comments/10aglj4/negotiating_salary_quick_guide_on_how_to_get_more/",
      "comments": [
        {
          "body": "Great advice, agree with almost all of it. \n\n Note though:\nSome FAANG companies will ask to see documents of competing offers, even saying “we will absolutely beat the comp by XYZ, but you will need to show proof”. \n\nSo, I wouldn’t lie if its a big company.  You could get them to drop the offer.  Much easier to leverage ongoing talks and say “i will sign ASAP instead of continuing the process with (amazon etc)”.",
          "score": 183
        },
        {
          "body": "Great advice. One thing I’d add is at every round of negotiation, make sure to make it clear that you are interested in the company and are not just trying to negotiate for the sake of negotiation. Be genuine and humane.",
          "score": 52
        },
        {
          "body": "\"First and foremost you should know that nobody will turn your down because you asked for more money than they are ready to pay\"\n\nThis is objectively false. I've had it happen to me as a candidate, and I know of many cases where this has happened being on the employer side as well.",
          "score": 87
        },
        {
          "body": "&gt; First and foremost you should know that nobody will turn your down because you asked for more money than they are ready to pay.\n\nThis has actually happened to me fairly frequently (usually something along the lines of \"oh, we can't pay anything like that, so it probably doesn't make sense to move forward\"), but it's fine, I just see it as the lowest paying companies filtering themselves out of the process early.",
          "score": 37
        }
      ]
    },
    {
      "title": "Working in a foreign country and come back to North America after 2 years",
      "body": "I am a Canadian and I graduated with a CS degree in Canada last summer with roughly 3 years of internship experience. Like many others, I've been job searching for months and struggling to land an entry-level role. \n\nI'm currently interviewing for a software engineering new graduate program at a consultancy in Hong Kong and I'm pretty confident that I will get accepted into the program. It is a program where you will commit 2 years and get paid training and upskill yourself before they find you clients (mostly companies like banks or other financial institutions) to work for, and you'll have the option to work full-time for those clients after 2 years as a dev. I've looked into it and talked to some people in the program and it seems to be the case that most candidates in the program will highly likely end up working for a bank in Hong Kong with higher salaries. The pay during the first 2 years, however, is low (compared to the salaries in North America especially) but enough for a living in my case. I understand that programs like this are full of red-flags as you have to commit 2 years into it, but I have to admit that I am becoming desperate in this market, and I am willing to take any opportunities right now for the experience with the hope that I will be qualified for more roles in North America in the future. If I were to take this offer, my plan is to further upskill myself and gain 2 more years of experience and then come back to Canada to settle and expand my career. But it is a big risk for me because I am afraid that I'll be stuck in Hong Kong as the network I'll get will only apply there locally.   \n  \nI have both Canadian and Hong Kong citizenship so I don't have to worry about work visa or anything. I have families living in both Canada and Hong Kong so relocation wouldn't be an issue for me either. I know also a few friends in Hong Kong, even though most of the people I know are here in Canada. \n\nIs it a good idea to take this offer and work in Hong Kong for 2 years before coming back to Canada, or should I continue the job search and try to aim for a better role in Canada? Any advice is appreciated. \n\n",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ijbfw3/working_in_a_foreign_country_and_come_back_to/",
      "comments": [
        {
          "body": "It might just be cool to work in Hong Kong for the life experience. Who knows, you might like it there, and I feel like it could also open up possibilities in China or the rest of East Asia if you network with the right people!",
          "score": 5
        },
        {
          "body": "I did something similar, took a role in sweden to get my foot in the door and now i've been here almost 10 years.  I had the same thoughts as you, i'll just move back after 2 years once I have some experience.  It's not easy getting interviews back in the US when I don't live there unfortunately.  However I haven't really committed myself to looking, just passively applied to a handful of companies.  I'll probably commit myself to trying to move back this year though and it helps that all the companies I worked at are huge household names even in the US.  \nIf the company you're looking at is a big name or you plan to move back in two years regardless of if you have a job lined up or not I'd say it's a nice idea.  Also moving abroad for work is not something alot of ppl get to experience and I'd always recommend it",
          "score": 2
        },
        {
          "body": "Hong Kong is China now, don't get yourself drafted into the military or recruited as a spy for the PRC, lol.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is this a scam?",
      "body": "Email Subject: Hi John Doe, Are you still actively looking for a Java Developer\n\nBody:\n\nHello John Doe,My name is -name-, and I am a Recruiter at SnapX, a Staffing Partner of Snaprecruit.\n\nI have some W2 ONLY requirements that match your profile from my client. No CTC at this time.\n\nSnapX is a staffing partner for Snaprecruit.com and working with DIRECT CLIENTS like Tyson Foods, Bank Of America, DTCC, UPS and plenty more... We submit quality talent to the hiring managers of these companies via their Vendor Management Systems (VMS). There is 80-90% more chances of you getting pipelined for an INTERVIEW in 7-10 days when submitted through their VMS.\n\nPlease reply back to me with an UPDATED RESUME, if you'd like to work with me one-on-one and get submitted for any open job positions that match your profile.\n\nFeel free to gimme a call or add me on Linkedin.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/17zcnw3/is_this_a_scam/",
      "comments": [
        {
          "body": "Funny enough i got a similar text from a job i applied to, the company being named TechX",
          "score": 7
        },
        {
          "body": "It’s just a staffing company. Plenty of them out there. That being said I wouldn’t want to go through one, but it’s no scam",
          "score": 3
        },
        {
          "body": "Not necessarily a scam, but a very low quality high volume operation. They have thousands of employees in a low-COL country sending out form letters like this, trying to get resumes that they can forward to whatever random company they think may pay a headhunting fee for a batch of resumes.\n\nIf you are in a competitive job market, you probably want to not talk to these people. They are going to be suggesting your resume to managers and HR at the same companies that you can find by searching online.",
          "score": 3
        },
        {
          "body": "Always reverse search the mailing address for a contact like this. In this case, the \"office\" is a residential property. This is a freelance recruiter, not a company.",
          "score": 5
        },
        {
          "body": "If youre getting weird vibes it might be.",
          "score": 2
        },
        {
          "body": "If you have the ask, the answer's probably yes.",
          "score": 1
        },
        {
          "body": "It at least looks like a real company from googling. What's the domain name for his email? It can be faked but a lot of scammers don't bother to. \n\n&amp;#x200B;\n\nHonestly, there's no harm in submitting a resume. Just have your guard up if you get placed way too easily. The red flag that shows up again and again on this sub is an \"interview\" where they send you a pdf you're supposed to fill out which leads directly to a fake offer.",
          "score": 1
        },
        {
          "body": "200% scam",
          "score": 1
        }
      ]
    },
    {
      "title": "how much java do i need to know to apply to enterprise jobs like Boeing, Lockheed, Raytheon, Bank of America, Capital bank, etc?",
      "body": "Im more of a python and JS (Node, express, react) developer. Learning C# and .NET in a class (not too in depth). \n\n1) I know basics of Java enough (up to OOP) or do i need to know the frameworks like Spring boot also? \n\n2) For these companies, can i do interview questions in python or js?",
      "subreddit": "cscareerquestions",
      "score": 32,
      "url": "https://reddit.com/r/cscareerquestions/comments/j55f06/how_much_java_do_i_need_to_know_to_apply_to/",
      "comments": [
        {
          "body": "1) Spring was never tested in [my interview](https://gist.github.com/yithar7153/7d00135aa86359cd85273d10bcf205a6). Spring was covered in onboarding.  \n\n2) My interview questions consisted both of Java and Javascript. Companies may differ on their requirements but if it's a general DS/Algo problem the language generally doesn't matter that much.",
          "score": 27
        },
        {
          "body": "seems like someone's tired of leetcode rat race",
          "score": 16
        },
        {
          "body": "I interviewed at Raytheon a few years ago and they asked some very basic Java &amp; OOP questions.",
          "score": 8
        },
        {
          "body": "I got an offer from one of those recently. The only technical questions were about basic oop concepts. Most of the interview was going over my resume and seeing if I can hold a conversation.",
          "score": 8
        },
        {
          "body": "Is this a grad role? If yes, then I'd say you don't need to know any Java at all. If not, then I'd say you should probably know enough to build a web server in Spring/SpringBoot.",
          "score": 5
        }
      ]
    },
    {
      "title": "Bank of America Summer Tech Analyst",
      "body": "Hey guys!\n\nI made it to the final stage phone interviews for BoA this summer and was wondering what kind of questions they gave? What kind of technical stuff do they ask over phone?\n\nThanks",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/r2xm21/bank_of_america_summer_tech_analyst/",
      "comments": [
        {
          "body": "My final round interview is in a few hours. Have you taken yours yet, and if so, was it all behavioral or both behavioral and technical?",
          "score": 1
        },
        {
          "body": "Also applied and had a final interview yesterday.",
          "score": 1
        },
        {
          "body": "Anyone get any word back yet?",
          "score": 1
        }
      ]
    },
    {
      "title": "Lying about GPA for Bank of America?",
      "body": "Recently got offered for Bank of America, Developer Role.  Min GPA requirement is a 3.2 and I lied and put I had a 3.2 when realistically I have like a 2.9. And I went through the super day interview very well. I got an offer today and they mentioned educational background check. What does this entail?\n\n&amp;#x200B;\n\nThank you",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/dx1zn0/lying_about_gpa_for_bank_of_america/",
      "comments": [
        {
          "body": "Oof, the moment you hand those transcripts over, you lost the job and burned those bridges.",
          "score": 9
        },
        {
          "body": "[deleted]",
          "score": 16
        },
        {
          "body": "I guess you'll find out!\n\nLots of people lie about having degrees, so I bet theres a reasonable chance they verify you went there and graduated but not what your grades were.",
          "score": 10
        },
        {
          "body": "As long as they don't ask for transcripts, your fine.",
          "score": 10
        },
        {
          "body": "How good are your Photoshop skills? If you lived to them already and want to take it a step further, you can doctor the transcripts. Of course, I am not encouraging any illicit activity, just telling you your options",
          "score": 3
        },
        {
          "body": "Background checks usually entail contacting the institution directly and asking for years in attendance and GPA (I’ve had 3 so far and all of them have included GPA). Good luck!",
          "score": 3
        },
        {
          "body": "How did this turn out?",
          "score": 2
        }
      ]
    },
    {
      "title": "Bank of America vs Lowe’s",
      "body": "So I currently have offers from BofA and Lowe’s for SWE internship summer 2021. I am waiting to hear back from Citibank and Truist. Lastly, I have an interview with SAS soon. BofA is paying much more than Lowe’s. My question is, should I take the bofa offer or wait to see how the others pan out? I hear mixed reviews about working at bofa and that working in the finance industry for x as a swe is hard to break out of. Any advice?",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/jy25hd/bank_of_america_vs_lowes/",
      "comments": [
        {
          "body": "Worked at Bofa, and i went from making 100,000 to 150,000 afterward as a Senior SDE. It will suck as an internship, but having a finitech company on your resume of that size will open doors to other companies. That and they pay pretty well, and you can work there post internship. That and they have a lot, i mean a lot of departments to rotate around, especially with Erica, the AI assistant",
          "score": 1
        },
        {
          "body": "are al internships work from home ?                             \nor do you have to move somewhere ?                 \nif you have to move what's the covid situation like in that area ?              \nwhat is the cost of living like in that area ?",
          "score": 1
        }
      ]
    },
    {
      "title": "Bank of America superday?",
      "body": "I was invited to a Bank of America superday for their global technology summer analyst program. What questions, technical and non technical, can I expect during the interview? \n\nThanks for the advice",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/y5groy/bank_of_america_superday/",
      "comments": []
    },
    {
      "title": "Take homes could always be worst",
      "body": "Location: Panama City, Panama (Latin America)\n\nSo I've been actively looking for a Dev job since March 2020 and it's been pretty rough in my corner of the world.\n\nToday I got contacted by a pretty big local bank (about 1k employees) about a programming analyst position.\n\nI have pretty much no info on the position, pay or responsibilities but the HR lady sent me a take home test as a technical test after a 2 minute phone call.\n\nThe test is the following:\n\n* Create an application that must be containerized using Docker.\n* Create the backend using NodeJS\n* Create the front end using AngularJS\n* Accessing the system should be done by using username and password (do they want a complete login system?)\n* Must contain a SQL(postgres) or NoSQL(mongoDB) database\n* Must contain a data model\n* Communications between the back end and the front end must be done through a RESTful api\n* It must contain at least one advanced python microservice in which statistical data is calculated and tabular and graphical data is generated\n* the front end must be responsive and in angular 6+ (why say use AngularJS when you actually want Angular 2+???)\n\nThe only thing they provided me aside from the instructions is a CSV file with about 10k records and 23 columns to use as the tabular data they want to see and send and work with in the python microservice.\n\nTL;DR they want a front end with authentication, a tabular data visualizer, a search bar by client number, a button that then returns that clients data from the \"advanced analytics server\" in Python, all wrapped inside Docker containers... in 10 days.\n\nThey even gave me hard limit of 10 days (up to a specific time no less).\n\nFor Christs sake I have no idea what they even want in the python section. What does K-means, clusters, gRPC, rabbitMQ, activeMQ or ZeroMQ communication even mean?!\n\nI have some friends there and I'm pretty sure they don't even get paid more than 2k a month working there.\n\nShould I even try and do this thing in 10 days of unpaid work for a \"chance\" at getting hired?!\n\nI wish I was getting getting roasted at leetcode interviews instead of this...\n\nSo, always remember, it could be worse.",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/lskdcs/take_homes_could_always_be_worst/",
      "comments": [
        {
          "body": "Send them an angular app that just alerts “go fuck yourself” when they open it.",
          "score": 31
        },
        {
          "body": "hahaha jesus christ. don't do this bullshit. just don't. just ghost them.",
          "score": 13
        },
        {
          "body": "&gt; Location: Panama City, Panama (Latin America)\n  \nif you said any major metro region in the US I would have said fuck no, tell them to get lost\n  \nI admit I don't know about Panama City, how desperate are you?",
          "score": 9
        },
        {
          "body": "\\&gt;Angular-JS\n\nInto the trash it goes",
          "score": 8
        },
        {
          "body": "LOL I am sorry OP but I came back just to re-read this. I am 90% sure some HR head or HR corporate dumbos just hobbled together every popular technology in current year into a single page.\n\nYour post really gave me a good laugh.",
          "score": 6
        },
        {
          "body": "If I had to guess, I think they're using you for free labor and will ghost you once you make the application that they need.",
          "score": 31
        },
        {
          "body": "Two fucking weeks of work is not an interview. It's an unpaid internship. I wouldn't ghost them, I would tell them you refuse to work for them for free and that you're telling your friends about their unethical behavior.",
          "score": 7
        },
        {
          "body": "&gt; I have some friends there and I'm pretty sure they don't even get paid more than 2k a month working there.\n\nCan you get the answers from them?",
          "score": 5
        }
      ]
    },
    {
      "title": "Should I leave a job I really like for a chance at career advancement?",
      "body": "The situation;\nI'm working at the moment with 1.5 YOE at a very big bank. A recruiter earlier reached out to me for an interview, and I have made it to the final round of interviews at a large American investment firm. \n\nI'm trying to decide, if I do manage to receive the offer, if this current job climate is right for taking this sort of role. This takes place in Canada where the market seems to be faring worse than that in America. \n\nFor context;\n\nTC:\nMy current TC ~90K but my manager has said he will be recommending me for promotion. This is 85k base 5k bonus. \n\nThe TC at the fund will be significantly higher at 125k; 110k base with a potential 15k bonus depending on the funds performance and mine. And the pay bump from Junior to a higher level is more significant than at the bank.\n\nHowever, my main concern aside from the factors listed below is the prospect of being let go prior to obtaining 3 yoe. I am somewhat unfamiliar with SWE roles at hedge funds but I imagine they are volatile based on the firms performance. Big banks historically have very stable positions and my position at the moment seems very secure. \n\nThe 3 YOE will make it possible for me to be comfortably in the intermediate developer range and is also necessary for me to work in America in the future. Both will significantly improve my hireability. \n\n\n**more info**\nThe work;\n\nWhat I love about my current job is the autonomy and breadth. We create internal tools used by developers and I've gotten the chance to work with a lot of tech and build a lot of cool things. Aside from my awesome coworkers this is the favorite aspect of my job. \n\nAt the fund, I'm going to be working on a variety of trading systems in a much more focused back end role. They seem to have a more rigorous engineering team and the work seems challenging and interesting. Building trading systems that deal with immense throughput and concurrency challenges seems like it would stretch my skills as an engineer even more than my current job.\n\nWork life balance;\nMy current job wlb is basically perfect. Aside from when there is the occasional delivery sprint or production issue, overtime work is completely up to me. They are also really liberal with time off and understanding of life situations. \n\nAt the fund, based on my research online, a common criticism is that you are expected to work a lot more. Many engineers have commented about having to work weekends consistently and an overall aggressive work culture. Also based on online reviews it seems many people have commented about a toxic work culture in teams, and political challenges working with traders as SWE. \n\nI already have a personality that is oriented towards working hard (evenings, weekends), and the bank gives me the flexibility to do that without the pressure of expecting it.",
      "subreddit": "cscareerquestions",
      "score": 13,
      "url": "https://reddit.com/r/cscareerquestions/comments/160b3m2/should_i_leave_a_job_i_really_like_for_a_chance/",
      "comments": [
        {
          "body": "High risk, high reward.",
          "score": 3
        },
        {
          "body": "You'll never grow without taking risk. You're getting paid much more at the new place where you'll feel the difference. \n\nI'd say go for it.",
          "score": 7
        },
        {
          "body": "I fully support you taking this new role and recommending me for your current position.",
          "score": 2
        },
        {
          "body": "Super clear to me \n\nStay \n\nI was never concerned about stability and chased a bunch of stuff and it was great for me\n\nBut you're concerned about stability so you stay \n\nDone\n\n3 years seems unimportant to me \n\nIt's just not relevant imo \n\nIf that company is still around in another 18 months and you're still interested, you can go over then\n\nUntil then, do good work, save and invest, have an wmergency fund, live fully and happy and have a life outside of work anything that really interests you including art and music and creative and entrepreneur and family and f****** and whatever else \n\nAnd build great relationships at work with your managers and coworkers and be known for being nice and reliable and doing good work and if you decide to leave in 18 months you can go from 105k to 165k and have more seniority bc being a grunt will all of a sudden lose its charm and you will want to be in a lead or mgr position \n\nLearn all you can about the business of banking that is become an SME \n\nSee if you can get a 4-day\n\nThe collapse of society is looking more likely and the bank might shitcan you too but we are going into true nightmare dystopia scenario and anyone who tells you not to worry is straight up full of shit or in denial \n\nGet your certs too",
          "score": 2
        },
        {
          "body": "You need to get out of your comfort zone to grow/evolve.\n\nI wish someone would have given me this advice before I wasted 10y staying with the same company (while being underpaid). The WLB and everything else was great!",
          "score": 0
        },
        {
          "body": "I would take the new role. You’re young, you can afford to take risks",
          "score": 1
        }
      ]
    },
    {
      "title": "Getting Fired From My First Job Has Forced Me to Rethink My Career Aspirations",
      "body": "WARNING: This will be long.  There will be a tl;dr version at the end for the lazy ones.\n\nThat being said, let's get on with it.\n\nI'm 24 years old.  I live in Tampa, FL with my girlfriend.  We moved down here from Towson, MD in 2013.  I had graduated in January, 2013 with a B.S. in Business Administration and got a job as a Teller for Bank of America in February.  It wasn't great (read: I hated it), but it was a way to earn money before we moved (I knew when I got the job we'd be moving *somewhere*, I just didn't know where).\n\nNow let me back up a bit to when I was actually in college.  Going into school, I had no idea what I wanted to do.  Originally, I wanted to do psychology because I took an AP Psych course in High School and really enjoyed it and did well.  I was a troubled kid and enjoyed learning about Psychology because I felt it helped me learn more about myself and those around me.  So, I graduated and went to tell my parents I wanted to do Psychology.  After some arguing and disagreeing, it basically boiled down to, \"we won't pay for college if you choose to do psychology.\"  I was a spoiled only child, so I changed my mind and went with Business because why the fuck not.\n\nGoing through college was...difficult.  I was a C student at best.  I failed several classes (Accounting 201 and 202 twice each, Calculus and maybe one more), thus having to retake them in order for them to count and I honestly think it boils down to the fact that I just didn't care; it wasn't what I actually wanted to do.  I would barely study and then whine when I didn't get a better grade (stupid, right?).  I'd sit on the computer playing League of Legends or playing Xbox and not study.  Shit, I'd even skip classes just because I didn't feel like going that day.  We were given a max number of \"sick\" days in some classes and I abused the shit out of that system.  But I digress.  My point is, thinking back on it, I really think I just did not care about my classes or what I was doing because I didn't know what I wanted to do after I got that stupid piece of paper and walked across that stage.\n\nNow fast forward to August, 2013.  My girlfriend and I moved down to Florida so she can pursue her Masters degree at University of South Florida.  I spend the next 2 months applying to jobs in the Business and Finance field because...well, that's what my degree is in.  I land a job at a Fortune 500 manufacturing company in St. Petersburg as an internal auditor (lucky).  I interviewed well, they knew I didn't have any prior experience in Accounting or auditing (I even failed the Accounting quiz I was given), but hired me anyway (mistake #1).  So I started and pretty much had to teach myself everything about the job because the department offered no real training (but I guess, how could they?).  Auditing is something that you have to really either know, or learn on the job.  I did the latter.  I would use online Accounting websites to teach myself Accounting, ask questions whenever I had them regardless of how annoying I was being.  That's how I was going to learn and succeed, so I did it.  I won't bore you with all the details but the months went by, I performed a few audits, traveled to different sites, worked with my team and I think vastly improved my auditing work.  I would even meet with my senior after performing the work to ask how I did.  Feedback was only given in the form of \"coaching notes\" on your workpapers within our auditing software.  They could be considered a form of feedback I suppose but after a few rough audits, I started to improve and receive fewer and fewer *repeat* (these were the bad ones) coaching notes.  I come to find a few months into my job though that my work is not up to par and I get written up for it.  It's all official, goes in my HR file, etc. etc.  The problem with this was, I had **NO** idea that I was performing badly until I was having these meetings with my manager (mistake #2).  Ultimately, I feel it was this lack of feedback from the seniors and management that I was to be fired March, 2015.  I'm still currently employed though.  They decided they would allow me to work until July 3 in order to find a job because they know right now, I'm the only one with an income and being unemployed for too long could cause my girlfriend and I to be homeless (or at least have to move back with our parents).  But my last day being July 3, she finishes school in August and therefore, we won't have to have little income for too long.\n\nAll that being said, I mostly disliked my job the entire time I worked here.  It wasn't interesting to me, I failed to see how what we were doing made any impact at all and I wasn't recognized for any of the actual good work that I did.  And trust me, I know I did good work.\n\nNow, let's move to the last few months.  A friend and I had the weirdest idea to start creating a website from scratch.  We were both a part of the same gaming community and we had grown tired of its bureaucratic ways and lost touch with the community and people in it.  That, and we were just busy as fuck.  So we came up with this idea to create our own.  I had been learning Python the last few months before the inception of the idea and he explained that it would be a good way to learn more languages and practice our design skills and just to have fun.  So I got started with learning HTML and CSS and Javascript.  I completed a few courses on Code Academy, Code School and Team Treehouse and found that I thoroughly enjoyed design work and learning these three languages.  I'm not that great at it yet, but I definitely know the basics and with some help from Google, I can do a lot of things.  It interests me and I enjoy it.  This is something that I had never really felt before when doing something I considered \"work\".  I quickly latched onto the idea that this is what I wanted to do, but I'm not sure how to go about doing it.  I'm also not opposed to learning back-end work like Angular or PHP or SQL or any of the other back-end languages.  My problem is, I don't know what's in demand, I don't know how to go about learning all of these things.  If I wanted to go back to school (which I'm not even sure I should or need to), I wouldn't know what degree to pursue.  I have yet to find a \"web development\" major at any Florida university.  I'm not a great artist so I can't create things in Photoshop and whatnot, but I can learn the code and foundations of solid website design.  That doesn't require me to *make* anything.\n\nSo, /r/cscareerquestions, help me.  If I choose either front-end or back-end, \n*  what would I be expected to know? \n*  would I be working for a company, or would I be freelancing most of the time?  \n*  what would my days look like?  \n*  what are the salary expectations for an entry level position (if that's even a thing in this field)?  \n*  would I need to go back to school\n*  would it be wise to look for a paid internship while my girlfriend was the bread winner and brought home most of the income?\n*  any other tips you can give me that will help guide me along the way?\n\nIf you've made it this far, I want to thank you for taking the time to read my story and learn more about me.  I hope that knowing all of this, you can know my feelings and determination to do something I actually enjoy doing.  This is what I want and for once I finally feel it's what I *should* be doing in this world.\n\ntl;dr - I fucked up in college, got fired from my first job and need help figuring out what I should do in terms of my career.  What can I do to get the job that I want in the web development field.\n\n**EDIT: I have inadvertently come off a certain way through my comments and that was never my intention. I genuinely wanted to learn as much as I could. However this quickly went sideways. I will not be responding to this anymore so that nobody can misconstrue my responses as something that they are not. Thanks to anyone that helped me out.**",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/39wnf9/getting_fired_from_my_first_job_has_forced_me_to/",
      "comments": [
        {
          "body": "If you don't have a general interest in computer science and only want to learn web development then go to a bootcamp, otherwise go to back to college. \n\nHonestly, I'm not sure if college would be the right option for you though if you failed things like calc before. You would probably get credit for those classes you already took, but what if you don't, are forced to take it yet again, and end up failing? It would just be a waste of time. You also won't specifically be learning web development. You'd learn things like data structures and algorithms, networking concepts, operating systems, computer architecture. If none of those sound interesting, go to a bootcamp.\n\nAfter you go to a bootcamp you should be able to at least get an internship if not an entry level position somewhere.",
          "score": 9
        },
        {
          "body": "Build websites. That's the only thing you can do to hone the skills you're learning. Do you have your own website? If not, build one.\n\n&gt; what would my days look like?\n\nYou arrive in the morning to your boss standing in your cube saying the website is down, when in reality one page is inaccessible because someone messed with file permissions in the HTML directory last night. No time to fix now, gotta go to morning stand-up.\n\nAt morning stand up you mention something keeps changing permissions in the web root, but nobody really cares. You look at your boss and he's fiddling with his cell phone.\n\nYou have a 2 hour meeting where 8 people who've never written HTML decide what the new website should look like, and write up some spec document that is simultaneously over-detailed yet doesn't describe enough to build it. And before the spec doc is even out of the printer you're asked a timeline for completing the project. You think maybe 2 weeks, but quote 3 just to be safe.\n\nWebsite is down again. Again it's a problem outside your control, DNS outage, though you're the first person they go and complain to. You spend the rest of your morning on hold with the ISP because the sysadmins are too busy (or so they say).\n\nYou eat lunch at your desk because you have to fix the permission issues.\n\nIn the middle of lunch, 2 of the people from the morning have new ideas for additions and enhancements and are wondering how much time those new ideas would add to the project You say its difficult to know without analyzing them and you'll get back to them.\n\nYou get in 30 minutes of actual coding before a revised spec document is emailed out to the entire team. All of those new ideas are now in the spec document and the timeline is the same.\n\nYou get another 30 minutes of coding in before the boss comes over and informs you the new website project takes priority over all other work and please inform him if anything pops up that prevents you from working on it.\n\nAnother hour of coding before the website is down again. You phone your boss to tell him that dealing with outages is preventing you from working on the new website project. He asks to please handle the outage this time and he'll work on getting you out of the loop for outages.\n\nJust as you fix the website, again, your boss's boss comes over and asks how the new website project is going. In the 2 hours you've actually spent coding you have a a few prototype pages. He makes some off hand comment about thinking you'd be further along by now.\n\nOn your way home you get a text. Website is down again.",
          "score": 4
        },
        {
          "body": "OP, a few things.\n\nYou come off really defensive. Almost every response you've had here has been a deflection or excuse rather than focusing on the advice. Take more time to read over what has been said and internalize it. **No developer likes dealing with defensive people.** We want to get our job done, and sometimes building up other people with criticism is necessary.\n\nSoftware engineering is what you make of it. It is up to you to acquire the skills and leverage them to achieve your goals. There is no bullshit do the job until you figure it out. \n\nIf you truly are ready for a job, you will know it. If you want to go into Web Development you need to practice through projects, not just one website, but multiple. You shouldn't even be thinking about front-end vs back-end until you have produced end-to-end projects. You don't necessarily need a CS degree, but it always helps. ",
          "score": 5
        },
        {
          "body": "This career path is definitely not an immediate solution. You're going to need some formal education and professional experience before you will be competitive. ",
          "score": 2
        },
        {
          "body": "OP: reading your edit, you seriously need to work on your communication skills if you're intending to work in a professional environment like software engineering.",
          "score": 2
        },
        {
          "body": "As far as knowledge goes you can check the curriculum of a university. See if you can teach it yourself and when you enjoy it, go for it. There is no blueprint for a cs career and it will be most likely opinion based. But if there is one then it is the general concept of data and algorithm.  \nGood luck!",
          "score": 1
        },
        {
          "body": "I'm surprised no one has mentioned it yet, but if your main interest is web development, [The Odin Project](http://www.theodinproject.com) is a great resource.",
          "score": 1
        },
        {
          "body": "Based off the comments here, I don't think you were fired from your previous job from being a bad worker. I think you have some personality issues. And as an FYI working with others is important in the CS field as well",
          "score": 1
        }
      ]
    },
    {
      "title": "Does anyone have any experience working for Bank of America?",
      "body": "I got a summer internship offer from BoA for their \"Summer Analyst\" position. The financial aspects of the offer are fantastic. However, I also did a little googling and searching on Reddit and it looks like people haven't had a great experience interning at BoA. If you've interned or worked with BoA before, I'd love to hear about your experience and any advice you might have!",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/9muw63/does_anyone_have_any_experience_working_for_bank/",
      "comments": [
        {
          "body": "I worked there last summer, and I'll give it to you straight.\n\nYou're gonna be working with pretty much entirely Indian people (I.E. literally from the country of India) over the age of 30. None of your coworkers are going to be any \"fun,\" and nobody's gonna be interested in getting to know you (unless you meet other interns). It'll be the least fun you ever have as a software engineer.\n\nIf you get lucky, you'll get to do cool work. I got to build a dashboard with a lot of relevant tech, like React, Node, and Webpack. However, you can easily get unlucky. The other intern on my team basically didn't do anything all summer. \n\nThe pay aspect is absolutely fantastic. Right now, as a senior, I'm living like a king while most of my friends are dead broke. It's pretty awesome, not gonna lie.\n\nI'd recommend using a BofA internship as a stepping stone to a software company. That's exactly what I did, and now I'm getting callbacks from many elite companies.",
          "score": 18
        },
        {
          "body": "It totally depends on your team. I was at Bank of America on the forex team this summer, and I had a really good experience. I worked mainly with Python and am internal framework they use called Quartz, which although frustrating, has a lot of interesting stuff built in. My project was pushed to production and the week before I ended, my team actually started using the tool I built and integrating it into their normal work flow. It's also not a bad name to have on your resume - I got full time interviews with 2 big Ns after this summer and a few unicorns as well. \n\nIn terms of cons, I would say that I know some interns though who felt like they had no work to do and spent a lot of time just browsing the internet because their manager didn't know what to do with interns. Also there aren't really too many intern events if you're looking for that sort of thing. ",
          "score": 10
        },
        {
          "body": "[deleted]",
          "score": 5
        },
        {
          "body": "Don't expect anything but inconsistencies and non-accountability from leadership. They change their mind like a 2 year old in a candy store.   They say one thing one day then change their mind everyday.  Communication to employees is practically non-existent. Customers mad at their process and they expect you to get perfect surveys and if you don't they blame it all on you.",
          "score": 2
        },
        {
          "body": "How was the interviewing process",
          "score": 1
        },
        {
          "body": "Which office are you going to be working in?",
          "score": 1
        },
        {
          "body": "how was the interview process for bank of america? what kinds of technical questions fid they ask?",
          "score": 1
        }
      ]
    },
    {
      "title": "Feeling like giving up after Revature",
      "body": "I joined in 2021 and found the people in my class were similar to me. Recent undergrads struggling to find a coding job. Revature takes advantage of your situation and convinces you that you’ll be hired by american workers and american companies. \n\nAs a man with Indian parents, I was annoyed to experience that all the interviews I was set up for were being conducted by ONLY Indian men. The companies they were setting us up to interview were for Indian consulting firms hosted in America. So Revature is a software engineering firm sending you to other indian software engineering firms (cognizant, infosys). Every single coding interview I did at revature was with a man with an indian accent. The only time I was not interviewed by Indians was when I told the hiring managers I give up on coding. \n\nThey offered me an interview at an american bank with no coding involved, all excel and email work. I worked there for a few months only to realize it’s another disorganized understaffed bank that would take anyone out of college who wanted the job. It feels like you’re being scammed everyday you work for this company. The reviews on glassdoor are extremely censored and controlled.\n\nI feel like an idiot for signing with them at all. Any advice for a recent undergrad? Should I not trust any of these bootcamps if I already have a degree?",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/x7kgyv/feeling_like_giving_up_after_revature/",
      "comments": [
        {
          "body": "Unfortunately that's just one of the many outcomes when you get baited by body farms. No job will actively look for you, you have to go find them. \n\nYou shouldn't give up. Plus Revature isn't a bootcamp, is it? They just train you. You can do an actual legit bootcamp to bring your back up to speed.",
          "score": 10
        },
        {
          "body": "Hope you Don’t mind me asking but what is the issue with Indian men? I work at a fairly large company and with lots of Indian (and other south Asians). Never had any issues",
          "score": 4
        }
      ]
    },
    {
      "title": "J.P. Morgan vs Bank of America software engineering/technology internships programs?",
      "body": "Can anyone give me advice on which one is a better internship experience for software engineering ? Like how was your experience because I have offers from both for the summer",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/j25hw6/jp_morgan_vs_bank_of_america_software/",
      "comments": [
        {
          "body": "Can’t speak from a SE perspective but JPM &amp; Chase is a bigger bank and is more prestigious.",
          "score": 12
        },
        {
          "body": "BoA is surprisingly... foreign. Lower quality teams there IMO.",
          "score": 11
        },
        {
          "body": "JPM ranks next to MS and GS.",
          "score": 7
        },
        {
          "body": "I would go with JP Morgan.  BoA in DFW has a pretty bad reputations among the software devs people is chew you up spit you out so avoid BoA. It is pretty bad. I worked with some former people of Chase and BoA.  Chase was ok.  BoA they all hated it.\n\nChase in DFW got busted for racism.  After Chase got busted they went out of their way to improve thing.  BoA is risking getting busted but were not doing anything.  and from what I was hearing is BoA was  starting to be investigated..  \n\nAKA if you are not Indian decent things will not go well for you.",
          "score": 7
        },
        {
          "body": "I’ve interned at JP and I can only say good things about my experience. Feel like I learned a lot and the campus I was at was great",
          "score": 4
        },
        {
          "body": "JPMC hands down",
          "score": 3
        },
        {
          "body": "I interned at bofa in california, it was okay experience but I'd probably take jpmc over it. dm me if u wanna know more",
          "score": 3
        }
      ]
    },
    {
      "title": "Bank of America Final Round - Virtual",
      "body": "Hi,\n\nI have a Bank of America final round interview in a few days. They said it was virtual but I'd need a computer and phone, and it'd be 2 40 minute interviews, I'm assuming one behavioral and one technical. This is for a software developer intern position. I'm a freshman and I've never done a \"virtual\" interview like this before(not counting hackerranks) Does anyone know what I can expect?\n\nThanks!",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/5cl13n/bank_of_america_final_round_virtual/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "I had this last Tuesday. It was just two back to back phone interviews. Both were behavioral cause neither interviewer was a dev, but they asked about specific technologies on my resume and what I've done with them. ",
          "score": 3
        },
        {
          "body": "Just wondering, did anyone else get deferred? They basically told me they can't make a final decision right now, but they'll get back in touch in 3 weeks :(.  Is this pretty much a rejection?",
          "score": 2
        },
        {
          "body": "I had virtual interviews with a different company for a software engineer internship, so let me share with you my experience.\n\nThey asked me 3 technical questions:\n1. Eight balls weighing problem (this question came up twice)\n2. Algorithm/data structure problem\n3. Object design of cards and shuffling\n\nWhat was really helpful was that I had a writing pad that is connected to my laptop. So i can share my screen and show the interviewer what I'm thinking.\n\nGood luck!",
          "score": 1
        },
        {
          "body": "Good luck to you guys! Also have the interview this week.   What have you heard about working at BoA?  I haven't heard great things for tech, anyone heard anything different?  Tough to get a feel for it since we won't be going onsite.",
          "score": 1
        },
        {
          "body": "For me the two interviews were with different teams and it seemed like up to the interviewer whether it was more technical or behavioral. I'm not 100% but I want to say that you basically get the offer if one of the two interviewers wants you on their team so you could do badly in one and good on the other and get an offer.",
          "score": 1
        },
        {
          "body": "Hi guys, had my virtual interview yesterday. First interview was kind of rude and very technical, threading, hashing etc. Really mad at myself since that was the HFT group and I'd have loved to work with them. Second interview was more behavioral, describe your project mostly.",
          "score": 1
        }
      ]
    },
    {
      "title": "Awful experience with Bank of America recruiter as a potential intern",
      "body": "The recruiter I had throughout my interview process for an internship was unprofessional and downright disrespectful. \n\nI completed a video interview, and got the email from her inviting me for a phone interview for the following day in a one hour time slot. Pretty standard stuff. I told her I was available for the time and date on Tuesday. I never heard back so I sent a follow up email Tuesday morning, to which she apologized and said the person I would be meeting with ('the global head of the branch\") couldn't make it. No problem, I understand schedules can be tricky. She says that she'll email me in a few hours with a new potential date and time. \n\nWednesday rolls around and she asks if I'm available on Friday from 1-2 PM. I have a current internship, so I told her I was unfortunately not available and sent her my availability for this week and next week.\n\nShe then proceeds to call me and says \"You know, you need a job. And we have a job. So you need to take the time on Friday\". I told her that I respect that the head of the branch has a busy schedule and as do I--which is why I sent my availability to work something out. I then told her that I was no longer interested and hung up.\n\nI'm in awe of how much she disrespected my time.",
      "subreddit": "cscareerquestions",
      "score": 89,
      "url": "https://reddit.com/r/cscareerquestions/comments/bgyc26/awful_experience_with_bank_of_america_recruiter/",
      "comments": [
        {
          "body": "So unprofessional on her part. She won't be a recruiter long operating like that. I had an IBM assistant HR person I was dealing with once about 2 years ago that wanted to setup a time to talk about an opportunity on the Watson Team. I was mildly interested and told him what times worked for me and he told me I needed to make time for IBM if I was interested in the job. I passed right then and there. I had a job already and I had things to do....I told him I didn't think IBM would want me interviewing for another company on their time and they should try and respect my work schedule, as that takes priority. Crazy.",
          "score": 48
        },
        {
          "body": "Thanks for posting and naming",
          "score": 22
        },
        {
          "body": "&gt;She then proceeds to call me and says \"You know, you need a job.\n  \nlmao no... I'm very eager and happy and excited and **want** a job, I don't **need** a job",
          "score": 17
        },
        {
          "body": "Yeah BOA is not the greatest of place. Here in DFW BOA has a reputation of taking a developer chewing them them up and spitting them out.  \n\nHonestly if the recruiter is that rude to you then you do not want to work there.\n\nI had an interview there 2 years ago and I felt like it was insulting how they treated me.",
          "score": 33
        },
        {
          "body": "I dont understand how they can do something like that and feel nothing. I mean it is difficult for some people to take time off of work or set a time, we must respect each other's time",
          "score": 7
        },
        {
          "body": "I look at this post and think damn, You really handled pure disrespect the right way, I wish I was capable of that. I honestly would have laughed in the phone at the pure disregard for my time and hung up. Good job for handling it the right way",
          "score": 5
        },
        {
          "body": "This was the company's internal HR person (that's what it sounds like from your description), and not an agency representing you to the company? If the former, yeah, not cool. If the latter, I wouldn't be surprised.",
          "score": 2
        }
      ]
    },
    {
      "title": "Experienced Dev - Advice on job hunting",
      "body": "I've been working in the software development field for 30 years. Most of my career I worked in Microsoft Visual FoxPro. I've worked for small companies, corporations (Bank of America for example). This software platform used to be hot and heavily used. Companies still use it in their legacy software. However, jobs have become scarce in it and I also have lost interest in it. My last job I did SQL dev work for about 4 years and then went deaf on the job. Eventually I couldn't keep up with the fast pace and the remote communications and quit. Then covid came.. I've since gotten two cochlear implant surgeries done. The last about 10 months ago. I'm now 60 and still in good shape and study all of the time to learn new skill sets. These skill sets are not NEW actually, but they are relevant to today's developer market. For example, I've learned Python, Django, Linux, a slew of packages that can be used to develop Front End and Back End. I'm currently taking a course in AWS Lambda functions. I'm all over the place haha. I'm also unemployed and surviving on disability.\n\nA lot of the three year delay that has to do with how long it took to get surgery, but it's also how badly I was treated on my last job because I was making mistakes and having such a hard time communicating with most of my remote team. It's like I have PTSD from that. It made me feel incredibly bad about myself.\n\nSo my question is how should I be marketing myself? I'm usually on a Developer III level (though I've worked jobs where I do everything), would like to get to a Senior Dev position. Since I don't have work experience in these new platforms, should I try to go for a Developer II position? Stick to the III? Many of those jobs ask for 3-5 years plus in skills. I could lie in my interviews but feel uncomfortable about that approach. I want to be honest.\n\nEdit: What is the best strategy for me to follow to get back to work?\n\nEdit2: I don't have strong front end skills, barely touching HTML, CSS, JavaScript. I have written API's in the past, though not recently. I know relational databases. Even my backend skills, the more I see job descriptions, I realize there is just a huge background learning curve in a number of packages I could use. I could spend forever learning them, only to get a job that requires a few.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/xg3xxt/experienced_dev_advice_on_job_hunting/",
      "comments": [
        {
          "body": "I'm basically the opposite of you in my career. I think what's important when you have a lot of experience is putting relevant info on your resume (and keeping your resume to one page, or one double-sided maximum). What's also important is being up-to-date on current technology. There are tech professionals who work the same job for 5-10 years and don't know any modern frameworks or new paradigms like containerization. I would say, either put the most modern tech you know on your resume, or skills you have the most experience with. Whichever way you go will determine what kind of jobs you should apply for.",
          "score": 2
        }
      ]
    },
    {
      "title": "Deutsche bank vs Bank of America",
      "body": "Hey everyone, \nI got an internship at DB as an Analyst Intern in the summer program in the Technology, Data and Innovation Division in Cary (North Carolina) with hourly pay of 33$ /hours without relocating allocation. During the interview, I talk with 3 peoples both are in a technical position. On the other hand , I had an internship with Bank of America for the Global Risk Summer Analyst Program in charlotte. Hourly pay 26$ with 2000 relocation. \nI don’t know which one I will choose. I plan to get in a grad school for economics or statistics or applied mathematics after graduation. I am currently majoring in Math with a minor in CS. \nDoes anyone already intern at Bank of America?",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/ribjg3/deutsche_bank_vs_bank_of_america/",
      "comments": [
        {
          "body": "DeutscheBank has a great wlb and a good vacation package even for juniors. The work is slow paced and easygoing. Did learn a good bit though.",
          "score": 11
        },
        {
          "body": "Similar situation, curious to hear the responses.",
          "score": 4
        },
        {
          "body": "You could turn this into a poll btw. DB seems like a great company in Europe from what I've heard. No idea that they even hired in the US.",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Experienced professional - background check/application",
      "body": "Hi everyone.\n\nWanted to get some opinions on this.\n\nI'm mid career and have had 4 jobs. One for 2 years, one for 6 months, one for 4 years, and my current one for \\~1.5 years.\n\nI've received an offer to join a big bank (think Goldman Sachs, Bank of America) on the software side of things. The job that I had for 6 months was completely irrelevant to this new opportunity - no transferrable skillset, just something I wanted to try after college when I was still \"exploring\" myself, and I had no room on my resume (1 pager) if I included this.\n\nI excluded this short 6 mo stint from my resume, and didn't talk about it during any of the interviews.\n\nI will be starting the background check soon and understand that it's probably best to put this job on the background check app, but I didn't put it on the job application on the bank's website.\n\nMy question - should I go ahead and list it on the background check? My knowledge is that this is done by a third party (first advantage I believe). Do note that the other jobs have 100% the right start/end dates, I just basically left a gap on the company website job application because I had no space on my resume to talk about it plus my other jobs.\n\nThoughts?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/s6n3lp/experienced_professional_background/",
      "comments": [
        {
          "body": "If it wasn't on your resume or the application, you don't have to include it.",
          "score": 2
        },
        {
          "body": "Background checks do not include candidate history of jobs. They are for looking up your credit, and criminal history. If the job has no relevance to the position you are applying for, leave it off.",
          "score": 2
        }
      ]
    },
    {
      "title": "Interviewing with Bank of America… Pre-hire Authorization Form. Am I getting the offer?",
      "body": "I got to the final round of interviews at BoA and a few hours later, was just sent a pre-hire authorization form. If you were hired by BoA or somewhere that did something similar, did you receive the offer quickly after? Or do they send the pre-hire authorization form to multiple people and then decide?\n\nUPDATE: I DID get the offer close to 3 weeks later and now start in a week! ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1l7izt8/interviewing_with_bank_of_america_prehire/",
      "comments": [
        {
          "body": "What is the pre hire paperwork exactly? Like background check paperwork?",
          "score": 1
        },
        {
          "body": "Usually they do a pre-hire auth form before the final interview",
          "score": 1
        }
      ]
    },
    {
      "title": "The Entitled Generation?",
      "body": "I just came across the Time Magazine cover for the first time that refers to the \"Me Generation\", and decided I had to let out a rant. \n\nI've heard of today's 20 somethings referred to time and time again as the \"Entitled Generation\" and other similar demeaning labels. I think when I was on my way to university this label maybe fit. I was brought up thinking that the process was to get a degree, get an entry level job, and work your way up from there. \n\nHowever, in my second year, 2008, I realized that the job market was going to be a little bit harder to get into than that, so I started to work harder. I began getting near-straight A's, I became vice president of my university newspaper, I got a high profile internship in the federal government. \n\nAt the tail end of this internship in 2011 I began applying for jobs but received nothing, not even an offer for an interview for basic administration jobs, so I figured I'll have to work harder. I sank tens of thousands into earning an advanced MSc from a top European school, thinking that might give me the edge to get me a job where my basic duty would be answering phones and typing reports. However, at the conclusion of this degree, I still did not receive a single offer for a job interview.\n\nI ended up going to work in China, where there were jobs and where I could add experience that might just give me that edge. After one year here, with the bank all over me and my $700 a month salary barely covering my minimum payments, I've been back applying to jobs in North America again, still nothing.\n\nI'm ranting about my frustrations because I know I'm not the only one in this situation. Those that graduated with me last year all appear to be in similar positions, stringing together internships in the hopes that they might just catch on with someone eventually. \n\nI don't expect anything to be handed to me, but I certainly don't feel that I deserve the title of lazy or entitled when I've spent the last 6 years of my life working my butt off for an entry-level position and neither do the hundreds of thousands of other people in my exact same position.",
      "subreddit": "jobs",
      "score": 202,
      "url": "https://reddit.com/r/jobs/comments/1eaijq/the_entitled_generation/",
      "comments": [
        {
          "body": "OK, so first, don't internalize anything written on any well-produced popular media website.  The media is experiencing serious upheaval right now, and most media outlets are acting irresponsibly with their outsized influence.  Media generates revenue by publishing things that spark discussions, because it makes us visit those pages and view ads adjacent to the vitriol.  Smart, accurate, well balanced journalism exists, but it doesn't go viral and doesn't sell as many ads.  Short-sighted B.S. goes viral.  Why?  That question delves so deep into mankind's nature and political and media studies, that one could devote an entire subreddit to it (and I'm sure numerous ones exist).\n\nSecond, you're right.  It will take a while for the data to catch up, but our generation is working hard in ways that are difficult to quantify.  It's obviously not enough to say that we're facing difficult times.  Previous generations of young Americans faced difficult times that were more dire.  What matters to you is just that people aren't kicking us when we're down.  We aren't perfect, but we aren't entitled as a generation.  Of course, every generation runs the gamut.  But we're not disproportionately entitled.  That's correct, and most well balanced people agree with that in my experience.  I don't have poll data, but the Time article's author doesn't either.\n\nThird, there's an instinct for us to spit back the same kind of vitriol.  \"We're the most X since the Greatest Generation.\"  Resist the urge.  It's dumb.  It feeds into shallow, data-resistant, over-simplified, inter-generational blather that can only hurt us all as a collective.  Seriously.  We should not swing \"back\" at the entire generation this journalist portends to represent.  He doesn't represent anyone but the money-hungry mouth breathers at Time Magazine, who are patting themselves on the back for a troll-job-well-done.  Baby boomers bare no collective ill will toward us, especially not as they collectively approach retirement age and they get tired and have to pass the torch to SOMEONE.  \n\nFourth, just keep doing you and trust your hustle and keep finding a way to be fucking proud that you're alive in a really tough economic time and, through hard work and whatever economic and emotional support network you've managed to keep around you, you're still pushing hard against that wall.  Maybe steer clear of shit like this that touches such a (justifiably) sensitive place in your mind at the moment.  It's hard to find seriously uplifting media when you're intellectually curious and don't have a ton of time.  I'd recommend openculture.com.  I'd recommend listening to the podcast On Being with Krista Tippet.  I'd recommend numerous subreddits like DepthHub and FoodforThought.  I definitely would not recommend Time Magazine.  From my extensive experience reading news media outlets big and small over a considerable period, Time Magazine hasn't been reputable as a credentialed news source for at least the greater part of the last decade.  \n\nBig ups to the entry-levelers.\n\nI'm out.  ",
          "score": 264
        },
        {
          "body": "I will soon enter my 5th decade of working world experience and I can tell you that those in their 20's and 30's are some of the hardest working people I know. Reliable, educated, focused and competent these kids are anything but the \"Entitled Generation\". I like them, admire their personal creativity and I appreciate the way they prefer to think rather than react with emotion.\n\nBut, and there is always a but regrettably, there is a serious problem with this generation that may hold them back for the rest of their lives. Taught to be compliant from an early age they failed to learn defiance. They were programmed to behave and follow a plan and modify every instinct and impulse in favor of the overarching goal of securing a \"good\" job. This generation was taught to follow orders and that if they followed the \"plan\" everything would work out.\n\nHow is everything working out for you?\n\nBy learning to behave, to never get angry or display strong emotion, to always get your assignments in on time and do exactly what you are told you have become useful bio-machines that allow businesses, and anyone else that can exploit you, to do so. You have been made afraid of \"failure\" to the point that you will do anything to avoid the scarlet \"F\". Work 80 hours a week? Ok, boss. Be available, anytime time anywhere? Ok, boss. Educate yourself at great expense and don't cause trouble? Here is a low wage job and you'd better like it! Ok, boss. Try to point out the waste and stupidity of your organization's approach? You're not a team player and you'd better be careful because we can replace you in an hour or less. Ok, boss.\n\nFear of loss of \"your stuff\" and the stigma of \"losing a good job\" has made you compliant and pliable. The boomers know that all they have to do is threaten your job and you will roll over like a dead fish. The psychopaths that have run this country into the ground are encouraged to savage you because they smell blood in the water every time you fold in the face of their mistreatment.\n\nSeriously, could the country be in this sad shape if millions of young workers were not compliant and complicit in the actions and strategies that degrade worker rights, enable global warfare, countenance slave labor and a host of other realities made possible by hard working, reliable, focused and educated kids showing up and quietly doing their jobs?\n\nThis generation is not a generation of paradigm disruptors. They are not going to innovate. They are not going to radically alter the technological landscape. They will of course refine and repackage and reduce today's technology but they will not innovate on a particularly large or even very useful scale.\n\nBy making yourselves into good workers, and I say again that you are some of the best and brightest workers I have ever seen, you have lost your souls. By pursuing with single minded determination the goal of \"getting a good job\" you learned how to color in the lines, sit in the right seat, make the right noises when directed and be acceptable, presentable and a team player but you didn't learn to dream of wider worlds and infinite possibilities.\n\nThere is no \"Here be dragons\" on your map, no ultima Thule, no final frontier because you have made yourselves experts are defining yourselves through what others want you to be. Your world is completely known and all you want is to perform your function. Sadly, the masters you chose to serve were often monsters. Your skills and dedication now keep them steady in their course and it does not occur to you that the world must be creatively broken and remade with vision and care if any hopeful future is to be created. \n\nChained to your masters with silicon and fear your children watch you with apprehension. Needing your attention your children find you attending to another. Needing your direction your children find cold and unhealthy silicon gods. Needing your love your children find you exhausted, angry and afraid. I have great hope for your children. I think some of them are going to grow up to be amazing. As for you, unless you throw off fear of loss, fear of judgement and fear of need, you will continue in the current course and become what you loath and despise. \n\nImprisoned by fear and habit, desperate to cling to the visible markers and badges of your toil, without vision or innovation, you will chart the course the boomers have taught you to chart. It is already happening and you will just be a distilled version of those twisted fuckers unless you change course now.\n\nYou are the best educated, most focused, competent and reliable workers this country has ever known. Gods of silicon, responsibility and payments. Professional, social and useful. Without question.\n\nWhy so serious?\n\n\n",
          "score": 20
        },
        {
          "body": "Those types of articles are garbage. Every single generation likes to think the next generation has it \"better\" because of improved technology or change in youth culture or whatever, but they fail to realize that they also looked like gits when they were younger. They also fail to realize that they are the generation that raised these \"entitled\" adults in their 20s in the first place. Not to mention the fact that it's more difficult to get a job and people are overall more qualified now than a few decades ago. We have it better in some ways, and we have it worse in others.\n\nAs often stated, Socrates (attributed by Plato) called the younger generation lazy and misbehaved, and that was over a thousand years ago.",
          "score": 30
        },
        {
          "body": "They are idiots, it probably was written by a baby boomer. Generation Y, our generation, has been the generation that has received NOTHING and no help from the Government. We are the Generation that has had to deal with high tuition costs, to a crappy job market... due to the baby boomers.\n\nThe baby boomer generation is the generation that has received everything and has changed laws to benefit themselves.  They were able to come out of high school and get a manufacturing job that can pay for a house, new car and support a family. If you wanted college, go ahead, it is was also very cheap. They are the generation reaping the last benefits of social security.\n\nBaby boomers have had everything silver spoon fed to them, and they in return have fucked over the generations after them.",
          "score": 132
        },
        {
          "body": "From my many years working in business, the current crop of 40-70 year olds are some of the most entitled, egotistical and self-righteous people I have ever met.",
          "score": 62
        },
        {
          "body": "[deleted]",
          "score": 24
        }
      ]
    },
    {
      "title": "Will your career grow by ditching corporate America for a start up?",
      "body": "I’m a system programmer at a large corporate America fintech firm and recently got transferred to be an angular/web developer. I’m supposed to start my new role in a couple months but I also receive an offer from a start up of 50 people to build high performance deep learning applications for embedded devices. \n\nThe bank job was my first job out of college. The pay is pretty decent ($55k) but there’s not much mentoring and their process is not good. After being here for 3 years, I don’t expect to grow much further. I’ve been doing a lot of stuff outside and that’s how I landed an offer from the startup through my GitHub contributions. \n\nSo I’m hoping to learn a lot at a startup and contributing to something more meaningful which I hope can later boost my career. Would this be a move? \n\nMy justification is that the startup follow a proper SWE process and work on a very cutting edge projects.\n\nThe team and the mentors are people who are active in the open standard committee. I got along with them very well during the interview.\n\nMy system programming experience will carry on and will be valuable to the new job. \n\nDownside is that the pay is horrible ($35k) But I’m not exactly making banks here anyways. ",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/9y7xc9/will_your_career_grow_by_ditching_corporate/",
      "comments": [
        {
          "body": "Where in America can you get away with paying actual devs 35k?",
          "score": 13
        },
        {
          "body": "Dont work for that absurd salary.\n\nA low salary like that reflects poorly on the company, and you may be in for a bad experience working for them.",
          "score": 6
        },
        {
          "body": "What kind of \"startup\" is this?  Do they have investors?\n\nIf it's some guy maxing his credit cards to try to make salary, you are taking a huge risk.  With pay that low, you are also \"investing\" 50K/year or more into the company from the low salary.\n\nWhere do you live?  In any major metro, that's ridiculously low.",
          "score": 3
        },
        {
          "body": "did you not negotiate or that just there starting offer?",
          "score": 3
        }
      ]
    },
    {
      "title": "Relationship Banker Interview with Bank of America tomorrow, Any Advice?",
      "body": "I am a recent college graduate with my BA in Economics from a State University and I got an interview with Bank of America for their Relationship Banking role tomorrow. I have worked at my local community Bank before as a customer service representative making around $16/hr and it supported me throughout college. I struggled in getting any final offers or internships during my 4 years in college. I just want to know what I can do to get the job at Bank of America as a Relationship Banker and also are their career paths for Relationship Bankers at Bank of America, anyone who worked at Bank of America, please chime in. Also, is there good money at Bank of America on the retail side?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/zl4u9c/relationship_banker_interview_with_bank_of/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Bank of America offered me second interview but no date as of yet?",
      "body": "Hi everyone! I applied to a Bank of America Relationship Manager position in my area, I got an e-mail from the recruiter on Monday, had a phone interview that went really well on Tuesday and she offered me a second interview with the Marketing Manager. We had inititally set it for some time on Thursday, but she wasn't sure of a time because the Marketing Manager works in multiple locations and she wanted to check with her to see when she'd be free. I heard nothing from her by Thursday afternoon so I called the recruiter back to follow up about the in-person interview. She told me that the Marketing Manager had been in a car accident the previous day , wasn't physically hurt but wasn't quite mobile at the time, and the recruiter wasn't sure when she'd be available to meet with me but would get back to me with a date and time. She asked me when I'd be available and I gave her my availability. I haven't heard anything back yet. I've never had this happen when being offered a second interview and it seems a tad unprofessional, but I don't want to assume the worst. Should I follow up with her one more time or just leave the ball in their court? ",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/6kpi09/bank_of_america_offered_me_second_interview_but/",
      "comments": [
        {
          "body": "I would think that under the circumstances it would be acceptable to keep in touch with them.  They did tell you there was an accident, so that would seem to imply that things might be a bit chaotic.  This is not a fly-by-night company.",
          "score": 3
        },
        {
          "body": "It's a holiday week.  \n\nYou've made your intentions clear. Allow the system time to work. Give it until the end of next week before following up again ",
          "score": 2
        },
        {
          "body": "One interpretation of 'not quite mobile' would be that the marketing manager's car is in the shop after the accident (and she needs it to get to the location you'd be interviewing at). So she can't set up a time until she gets the car back from the shop (cause that's not always a reliable date and time sort of process).\n\nI'd probably wait for a bit, though maybe if yo haven't heard back by like end of day next Wednesday (the 5th), give a call back.",
          "score": 2
        },
        {
          "body": "Take a step back - things happen. When was it that she grabbed your availability? If it hasn't been a week, leave it in their court. If it has been a week or more, just send an email saying \"Hi Recruiter, Thanks so much for arranging the interview with Hiring-Manager-Name. I'm very excited to discuss more about the role with him/her.\nI know we chatted about my availability and I wanted to check in to see when I could expect to receive further details. Thanks again!\"",
          "score": 2
        }
      ]
    },
    {
      "title": "Bank of America Phone Interview???",
      "body": "Hey guys, i just got a call today from an HR recruiter of Bank of America and he wanted to schedule a phone interview between me and one of the other recruiters. I am scheduled for 3:30PM today... should i be nervous?\n\nWhat are some tips to make a phone interview go smoothly? Are they easy? And what is the purpose of a phone interview??? Is it prior to the actual in-person interview?\n\nI plan on having my cover letter and resume open on my laptop during a good. Sound like a smart idea?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/2fhlbr/bank_of_america_phone_interview/",
      "comments": [
        {
          "body": "I'd prepare for it as you would for a normal interview, with the plus being that you can have bulletpoints of your answers to interview questions in front of you! \n\n\nThey are prior to an in-person interview, in my experience used when the recruiter is dealing with a high volume of applicants or it is a job in a different geographic location.\n\n\nBreath. It could be a good idea to have your cover letter/ resume open but I think it's better to have bullet points up as well as things that were edited out of the cover letter for purposes of making it more succinct. Don't read verbatim off your screen. Pay full attention. If you need a minute to gather your thoughts, do so. Best of luck.",
          "score": 1
        }
      ]
    },
    {
      "title": "Problems at work and now I’m getting fired",
      "body": "\nI'm the receptionist at a company I've been with for about six months. My main job is managing the mail, and let me tell you, it's a mess. There's no proper system in place, and most of the mail isn't addressed to a specific person. I'm just supposed to sort through it and figure out where it goes.\nFor example, I'll get a stack of mail from a specific company (let's say ABC Co.). I was told anything from them goes to our HR person. I'll hand her the stack, and she'll immediately hand half of it back, saying it's not for her. How am I supposed to know that? This happens with several different departments, and it's a never-ending cycle of mail getting returned to my desk.\n\nThis is made even worse by the fact that my boss and HR are rarely in the office. They're either out or in back-to-back meetings. They also get annoyed if I just put mail on their desks when they're not there. So, when mail kept getting returned to me, I created a stack of \"unknown\" mail, waiting for an opportunity to ask for help.\nHere's where I messed up: I put that stack of mail in my desk drawer and, due to a heavy workload, completely forgot about it. It was a fairly small stack, but some of it had been there for over a month. I was out sick for a day, and the person covering for me found the stack.\n\nWhen I got to work the next day, my boss was furious. He confronted me about a Bank of America card on his desk and a stack of mail, asking why I wasn't on top of it. He was also upset about the stack in my drawer, which included an IRS letter (nothing bad happened, thankfully). I tried to explain the situation, but he kept saying, \"Come on, you didn't just forget about it,\" implying I intentionally hid the mail.\nAfter I left his office, I realized something: The BofA card and the mail on his desk were 100% new. They must have arrived the day I was out sick. So, he was mixing up a legitimate, recent piece of mail with the long-forgotten stack in my drawer. I wish I had thought of that in the moment, but I was caught off guard.\n\nTo make matters worse, I have access to a shared calendar. I checked it later that day and saw that they're interviewing candidates for my role. They must have forgotten I have access to the calendar.\nI've been at this job for six months, and this is my first real mistake—one that I fully owned up to. I also didn't get any proper training when I started. The admin team has never really liked me, and now I feel like they've been waiting for me to mess up so they could get rid of me.\n\nIs it fair for me to be fired over this? How should I handle the situation now? I feel like I'm being punished for a system that's completely broken. It also doesn’t help that I have adhd/autism so when there is too much confusion I just shut down and I have this issue where if I do not see it i literally forget it exists which is why the mail thing happened and I should of known better. \n\n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1n8nrqh/problems_at_work_and_now_im_getting_fired/",
      "comments": [
        {
          "body": "Unfortunately, \"fair\" doesn't really factor into these matters.  It sounds like your expectations for this role were in conflict with their expectations of you in this role.  Where you expected to  do rote mail delivery using their pre-established, functioning system, I'm guessing they expected you to deal with the daily conflict of dealing with returned mail over and over until you either developed a system of your own or figured out why this issue kept happening.  I imagine the answer lies somewhere in the middle of your expectations, where it was reasonable that you would have gotten more support but also reasonable that it makes them real nervous that a stack of mail can be forgotten in a drawer.\n\nThe only thing to do at this point is go back to your boss to learn what their real expectations are, share what your expectations have been, and work out how (if at all) you both can meet in the middle on it.",
          "score": 1
        },
        {
          "body": "Is there a way you establish a sorting method of your own? You make the plan and you follow it to have peaceful transition. Sort the mail before you distribute",
          "score": 1
        }
      ]
    },
    {
      "title": "Got a likely 3rd round interview with Bank of America coming up but the Talent Consultant never gave me a time for when the interview was supposed to take place. Should I try to contact them and ask?",
      "body": "As stated in the title I am supposed to have an interview soon with Bank of America to be relationship Banker. Unfortunately we scheduled a date but not a time which I know was a mistake and it is partly my fault for it happening as I didn't contact them immediately after the phone interview to confirm the time but I am tempted to see if it's worth asking them about it. I applied for the position back in May and didn't hear anything until recently. If I blew it by not asking for the specific time then so be it as I have other work obligations as well to focus on. If anyone can confirm whether it would be worthwhile for me to contact the consultant I would greatly appreciate it.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/vz584i/got_a_likely_3rd_round_interview_with_bank_of/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "You are way overthinking this, just call them",
          "score": 1
        }
      ]
    },
    {
      "title": "When did places start getting so picky about commutes?",
      "body": "Out of work for the first time ever. I’ll spare the details of some things. But I vary between manufacturing and office work, been to college and done my associates, crawling through my bachelors due to working full time. Market just sucks right now. \n\nIt’s always been somewhat hard/taken more time to get an office job because they are easy and pay well, I just like to mix it up while I finish up my bachelors degree. \n\n\nAnyways, the market is obviously EXTRA BAD currently. So I have been throwing some resumes at other towns within a half hour, maybe 45 minute commute if there is traffic. And they are denying me when they find out where I live and they say that is why, they tell me I am a solid candidate and they want to consider me but the commute is out of the question. And I am just bewildered like. Isn’t America founded on the suburbs. Living in between your small family town and the big city having a small commute to the city for cheaper housing but getting city pay. I mean, that’s a classic American thing, or am I just crazy. \n\nHell when I was a kid my mom and dad worked jobs with commutes right around a hour one way. One to be fair had the job and then moved far away. But the other got theirs with the employer knowing how far they were. And both my parents said that has been common to live in a different town than you work for decades. \n\n\nIs the job market just that over saturated that its just guaranteed someone just as qualified as you will apply but closer or is it some new standards I am not aware of. Idk this is just all new to me in a way, I typically find work in less than a week of trying. And of course the one time I get laid off and am forced to be out of work is when I am sitting here at week two hearing minimal back. I have an interview at a bank as a teller but it’s with A.I. LOL!",
      "subreddit": "jobs",
      "score": 25,
      "url": "https://reddit.com/r/jobs/comments/1omam18/when_did_places_start_getting_so_picky_about/",
      "comments": [
        {
          "body": "They don’t want to invest time in a candidate only to have them reject the job due to the commute, or take the job and leave as soon as they can find one closer to home",
          "score": 50
        },
        {
          "body": "I've had commutes of anywhere from 20 minutes to over an hour. Though usually around 40 minutes. I would accept a job with a long commute, telling myself that I needed the job and could deal with it. But it grinds you down until you reach the point where you just don't want to lose that much time out of your life every day.\n\nIt was the reason I gave when I resigned from two jobs, because it was the truth. But I imagine some use it as a polite way to move on, much better than \"this place sucks.\" \n\nEither way, they'll be hesitant to hire.",
          "score": 10
        },
        {
          "body": "Commutes and the internal politics around return-to-office initiatives are a hot mess. Easier said than done, you'll be gleaning a scorched field for a palmful of seeds, but remote is the way to go.\n\nArthur C. Clark predicted the Internet and the remote work it enables back in the 1960s. We're like 20–30 years out of sync between the two thanks to Boomer capital getting sand up their collective vagina about offices. But there's no halting progress now.",
          "score": 19
        },
        {
          "body": "The farther away you live the more likely you are to be hampered by weather, traffic, etc",
          "score": 5
        },
        {
          "body": "I was given a huge opportunity but the downside was a 30 min drive in the summer (little traffic) but shot up to an hour during the school year (a lot of traffic).\n\nI was willing to make the commute because it helped me pivot my career and paid a lot more. About 3 months into the job, a recruiter reached out to me from somewhere much closer for the exact position and slightly higher pay. I immediately jumped  because of the commute.\n\nI felt bad for the person that gave me the initial opportunity but I had to do it for myself. An hour driving each way is a brutal commute.\n\nSo yeah it makes sense that employers are concerned when you live far away.\n\nEdit: typos",
          "score": 2
        },
        {
          "body": "I hate to say this, but as someone who works closely with my boss, I understand why it happens. It’s definitely not fair, but hiring someone who lives far away is a big risk since we’ve had people quit when the commute became too much. What starts as “only 45 minutes - 1 hour” often turns into burnout. Unfortunately, in this market, employers can afford to be selective. It’s not just about them choosing us, they’re also looking for what works best for them.",
          "score": 2
        }
      ]
    },
    {
      "title": "Move Advice",
      "body": "I am 24 F working in elevator sales for 2 years post grad. I live very far from my family and I’m hitting a wall where the whole family is ready to live near each other. My dad recently quit his job and they sold their house and has been applying to crazy locations. He called me a few weeks ago and asked if he interviewed for a Job in Japan would I be willing to quit my job and come with them, because he didn’t want to entertain it if I’m that far. I said absolutely yes because we have all lived overseas together before and it was awesome. This got my my curiousity flowing and I’ve been also considering doing the same. I currently am burnt out in my job and just over the big city. Randomly while praying about it I started thinking on my own, “my lease ends in January, what if I transferred to NC because that’s where my family has talked about wanting to settle down so we can all slowly meet there”. I decided to call my parents about this thought and turns out they actually got a great job offer in NC but didn’t want to mention it yet bc they didn’t want to sway my life decision. So we both are on the same page of going to Nc and been praying about it, wild. Here’s where I’m at:\n\nMy lease ends in January, currently no positions open at my company in Charlotte or for other elevator companies. Here’s my options, what’s everyone opinion:\n\n1. Keep my jobs here and save/do well until something opens up then go straight to Nc (or if they allow a short travel period probably not then travel for a few weeks in between). If nothing is available in time I can sign my lease for 3 months (extra money). I also have some contacts in NC I can reach out to to make it known my interest but that may make my boss aggrivated since I don’t always hit my sales goal he may feel betrayed.\n2. In January- quit my job respectfully. Move my stuff into my parents new NC house. Take a seasonal ski job in Japan and then possibly a seasonal for scuba diving (not sure exact time frame). In this time I will continue to watch the job market and apply (can even switch industries like Bank of America and nasa headquarters in Charlotte). I also have been working on getting my real estate license in Texas and studying so I can switch to getting that in NC and work on this course work while working and traveling for a few months over seas so when I return I can have that as a back up/side gig. My concern with this is how it will look returning. I can frame it as my dad had a health scare which made me come home faster (not false) and then after it I just decided to use my time wisely and travel so that I could be refreshed when I returned to work because I am looking to buy a house soon and stay in the area long term. \n3. I can just find a job to go straight to in January. \n\nLet me know if you have any other ideas or if these would work.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1nii138/move_advice/",
      "comments": []
    },
    {
      "title": "Overwhelmed by opportunities....",
      "body": "Hey everyone, I'm having one of those \"good problems to have\" moments but it's still keeping me up at night. Would love some perspective from people who've navigated early career decisions.\n\n**Some Info about me:** I'm 24, just graduated in May with dual degrees in Finance and Financial Technology. I'm genuinely fascinated by how markets work - like, I'll spend hours reading about theory or watching the market for fun. I would like to try in the future something like equity research and valuation roles, but overall, I'm open to exploring, just looking to be in a place where I can maximize both compensation and career trajectory.\n\nI've been working at Bank of America as a Relationship Banker for the past 3 years while finishing school (yeah, it was exhausting). But honestly, I loved the analytical parts - reviewing complex documentation, solving problems, handling difficult situations, and figuring out the right account structures for complicated situations. What I didn't love was being stuck in basic banking operations when I knew I could do more.\n\nI'm also bilingual (Spanish/English) which has been valuable in my banking role and opens doors in finance.\n\n**The opportunities and Internal chaos:** at the beginning I wasn't receiving many replies and I thought there was something wrong about me and that I was behind everyone else looking for a job as I didn't have the opportunity to do an Internship (Working full time to sustain myself and school full time didn't allow me), So I expanded my application areas and now I have multiple offers.\n\n**ABC Specialties Distributions: Credit Analyst (\\~70k )**\n\n* Status: They've asked for references (basically have it)\n* What it is: Credit analysis for a chemical distribution company - reviewing financials, managing collections, setting credit limits\n* Why I'm tempted: It's SAFE. Good benefits, hybrid work, I could use the stability to study for my CFA. Credit analysis teaches you to read financial statements like a detective.\n* Why I'm hesitant: Collections isn't my passion. I want to build portfolios, not chase down late payments.\n\n**Credit Union - Financial Analyst ($56-84k)**\n\n* Status: interview with CFO directly this Thursday afternoon and I'm legitimately scared (I didn't do a pre-screen or anything, the CFO emailed me directly)\n* What it is: Asset/Liability Management, interest rate risk modeling, financial planning &amp; analysis, working directly with the CFO\n* Why this could change everything: This is EXACTLY what I want to be doing. IRR modeling, building financial forecasts, understanding how interest rates impact portfolios - it's like my Monte Carlo simulation project but for real. Plus direct mentorship from a CFO? That's career gold.\n* Why I'm terrified: What if I choke in the interview? What if I'm not ready for this level of responsibility? The CFO has 20+ years of experience and I'm worried I'll sound like an amateur. I don't have direct working experience after all\n\n**Big Bank - Risk Analyst ($80-100k)**\n\n* Status: Pre-screen Thursday morning\n* What it is: Risk &amp; Control Self-Assessment, operational risk monitoring, regulatory compliance\n* Why it's appealing: Highest salary, my compliance background fits perfectly, they mentioned rotational exposure to different departments\n* Why I'm torn: It's more about preventing bad things from happening than making good investments happen. Important work, but not what gets me excited.\n\n**Financial Markets Institution - Operations Analyst ($75-85k)**\n\n* Status: Waiting to hear back\n* What it is: Institutional markets operations - working with asset managers, banks, processing transactions that impact their books\n* Why it interests me: Learning about securities settlement, interest calculations, working with the types of companies I want to work FOR someday\n* The concern: Still operations-focused, might take longer to transition to the analytical side\n\n**XYZ Investment Company - Client Account Manager ($60-75k)**\n\n* Status: Had pre-screen today, went okay\n* What it is: Client liaison for investment consulting firm - $700B+ in alternative investments\n* Why it's intriguing: Direct exposure to hedge funds, private equity, real estate investments. Learning about asset allocation for institutional clients.\n* The downside: More relationship management than analysis, lower pay\n\n**Z Investments - Client Services Analyst**\n\n* Status: Had pre-screen today, pretty sure I bombed it\n* What it is: Preparing RFPs, updating marketing materials, some client analysis\n* Honestly: This one feels the most removed from what I actually want to do\n\n**What's really eating me**\n\nI keep oscillating between \"take the safe option and build slowly\" vs \"swing for the fences while you're young.\"\n\nThe ABC role feels responsible - steady income while I get my CFA, learn credit analysis fundamentals, then transition to investment roles in a few years. But I'm worried I'll get comfortable and lose momentum.\n\nThe Credit Union role feels like it could fast-track everything I want. I'd be doing real financial modeling, learning ALM (which is huge in investment management), working with a CFO who could mentor me and open doors. But what if I'm not ready? What if I disappoint them?\n\nI also can't shake the feeling that at 24, this is my shot to set up a high-earning, fast-growth trajectory. I want to be making serious money and building premium skills as quickly as possible.\n\n**The Question**\n\nHow do you balance maximizing early career growth with managing risk? I want to be aggressive about building wealth and advancing quickly, but I also don't want to make a move that sets me back.\n\nI've seen people who took safe early career paths and are still grinding for modest increases years later. But I've also seen people who swung for big opportunities early and either hit it big or had to rebuild.\n\nHas anyone been in a similar spot? How did you decide? Looking back, do you wish you'd been more conservative or more aggressive in your early career choices?\n\nI know I'm incredibly fortunate to have options, but right now it feels more overwhelming than exciting. Any advice from people who've navigated these kinds of decisions?\n\n**Also... Any advice for my interviews?**",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/1lv6nn2/overwhelmed_by_opportunities/",
      "comments": [
        {
          "body": "Let’s dial this back a wee bit. \n\nFrom what I read: these all sound great in various ways, but none have offered anything. \n\nIn other words, you don’t have options yet. \n\nFurther to that, if you do get an offer and it’s not your favorite of the bunch. I say you should still take AND still pursue anything still active. If you get a better one, take it, if not you’re safe with a job.",
          "score": 4
        },
        {
          "body": "This was a very confusing read.  I understand your excitement, but I read there's multiple offers and like kinganti said, you haven't reached that stage with any of them yet?  \n\nNot to be a downer, yet in this job market people usually go through lots of interviews before landing anything.  Keep prepping for the ones on your plate, and see if they'll be that golden ticket.  Good luck OP.",
          "score": 1
        },
        {
          "body": "First step:  Get an offer.\n\nYou aren't there yet.   When you do get there, consider this:\n\n\n\n1. Take a piece of paper\n2. Write a section called **PRO**s, and a section called **CON**s\n3. Under **PRO**s, write down everything you consider a positive — for either job — in one list\n4. Do exactly the same for **CON**s, regardless of which job the **CON** is associated with\n5. Now, rank the **PRO**s from 1 to X, where X is the total number of **PRO**s, and each item has a unique number, from 1 (meh) to X (best option possible)\n6. Now, rank the **CON**s in exactly the same way, where 1 = meh and X = worst element possible.\n7. Now, take another paper and put each company down with *their* list of **PRO**s and **CON**s, along with the number you previously assigned to those individual **PRO**/**CON** elements (on the other paper).\n8. The role with the better ratio of **PRO**s to **CON**s is the role you should probably take.\n9. If you somehow don’t like the outcome, it means that you have other reasoning that you did not capture, and need to capture, or you are lying to yourself about what is important or trivial or annoying or inconvenient about a job.\n\nAll the best in your assessment and evaluation.",
          "score": 1
        }
      ]
    },
    {
      "title": "I may have ruined my career. Need some advice.",
      "body": "Ok, first job I had for six years. Worked my ass off and was eventually fired because someone lied about me sexually harassing them. It never happened and I can't sue for wrongful termination because &lt;state name here&gt; is a right to work state and the EEOC did not find any evidence of discrimination. I think the people that said they were going to give me good references are actually doing so, but one of them is my old department supervisor and I can't tell what his opinion about the whole situation is.\n\nAfter I left the above job, I got a contract position at a pretty cool tech company. I ended up getting fired from there because someone again blamed a network outage on me and lied about his absolute lack of common sense when working with heavy equipment. He literally tried to kick, karate style, the servers from their racks. I had to run to Home Depot to get the tools to do the job. In their defense, I did break a piece of equipment that cost about $2000 to fix, but I was up front about it and was even told not to worry about it because it was a free piece of evaluation hardware. I was also made aware of their drug use on and off the clock and reported it to the NOC supervisor. In hindsight this probably wasn't the best person to report this to and will not hesitate to go to HR in the future. I received a lot of experience in this department but I can't get a good reference from them because they think I'm a snitch who fumbles hardware and takes down DHCP servers without telling anyone.\n\nMy third position, a large banking firm. Found a large cache of viruses that belonged to the malware administrator (there was no good reason to store these things, especially when they're inside the private banking network of one of the largest financial institutions in America.) I told my manager about their presence and he fired me because I over reacted and those files had nothing to do with my job.\n\nMy last position, small data analysis firm. A co-worker of equal title constantly harassed me and belittled our entire team. I brought my complaint up to my manager, again not HR directly, and he fired me. He told me that it was the end of my probationary period and I wasn't communicating well enough with him via e-mail about my daily activities. There was no management there, no order, no direction. They wanted me to reinvent the wheel when there were already people on staff who could run circles around me. I tolerated the verbal and physical intimidation for 3 months and was eventually fired.\n\nSo here's my situation. I've been fired from the last four jobs I've had and none of them will give me a good reference. It's been over a year since I've had a stable 9 to 5 and I don't know what to do. Every staffing firm calls me up and says \"We've got this great position we'd like to talk to you about, come in and talk to us.\" So I go in, do the interview, think everything goes well and I never hear from them. I don't even get a rejection letter, it's just *poof*.\n\nI'm at my witts end and fear I may be blackballed. I'm contemplating on taking a janitorial position somewhere just to pay my rent. Does anyone have any advice?\n\ntl;dr I've been fired from my last 4 jobs and think I might be blackballed. I need advice on how to regain my credibility as an IT professional.\n\nedit:conjugation, words, and privacy",
      "subreddit": "jobs",
      "score": 78,
      "url": "https://reddit.com/r/jobs/comments/1qpj0w/i_may_have_ruined_my_career_need_some_advice/",
      "comments": [
        {
          "body": "I'm impressed you managed to get jobs #3 &amp; 4, considering that you were fired twice previous to that. \n\nMy only advice would be to start as a consultant. Set up your own business. \n\nGiven what you've said here, I can't help but wonder what else may have been going on in your jobs that would cause people dislike you, because it's obvious that at each one of those jobs you rubbed folks the wrong way for one reason or another, or this wouldn't have happened 4 times. You know what they say, \"fire me once, shame on you; fire me twice, maybe there's something that's making people want to fire me or do stupid things to get me fired.\"",
          "score": 136
        },
        {
          "body": "My father in law is a 75 year old man (Apache and Navaho) and he has a saying:  \n  \nIf one guy tells you to take a bath you can tell him to fuck off.  \n  \nIf a second guy tells you to take a bath you should think about it.  \n  \nIf a third guy tells you to take a bath get your ass in the tub.  \n  \nYou have been fired from 4 jobs in a row.  And in every job you're blaming other people.  \n  \nI don't think that's where the problem lay.  \n  \nso, for the nuts and bolts  \n  \nYou don't give names as your references for anyone you've worked for.  You just give your work history.  If you give a reference you know for a fact what they're going to say.  If you are not positive, don't use them.  If anyone in your past jobs you know for a fact (and ask them, be up front about it) will give you a reference then use them as one.  \n  \nnext, think about how you interacted with everyone there.  Step behind yourself and don't blame other people... I've read your other comments, but I think you should be more honest.  4 times in a row tells me something and, to be honest, if I was hiring and I talked to you and I heard you say what you did I would never hire you.  \n  \nEvery failure should be learning experience.  And not the \"I should have kept my mouth shut\" type of learning experience.  The ability to self evaluate and improve based on experience is very important for long term success in any profession.  \n  \nJust my 2 cents worth, take or leave it.",
          "score": 89
        },
        {
          "body": "Time for a tough talk.\n\nFirst, most companies are only going to confirm employment dates and job title when it comes to employment verification, so I don't think that is the issue.  If you want you can have a pal (pretending to be an employer) call your references and see what the company is saying. \n\nSecond, Everyone has a bad break or a bad streak, but being fired from 4 consecutive jobs is more than bad luck.  The common denominator is you.\n\nWhen staffing firms ask you to come in and talk to us, they want to make sure you aren't a freak show.\n\nI would suggest if you are at your wit's end to get a seasonal temp retail job, that can be the first step in rebuilding your career.",
          "score": 39
        },
        {
          "body": "Here is my advice to you. Take it for what it is worth but know that I am a fairly confident person when it comes to my social skills and haven't ever left a job on bad terms in almost 20 years in advertising (which is saying something)...\n\nIgnore every instinct you have about how to navigate the workplace. Think you should go to your boss about a problem? DON'T DO THAT.\n\nEtc etc etc\n\nI hate to tell you this, and I mean this gently, but it sounds like you might be the problem here. And the good news is that you can control this. I would wager you would eventually be blackballed in the janitorial community in your city given enough time. \n\nGut check time on your part. Admit you're the problem and work on it - that is the first problem. Be honest with yourself. ",
          "score": 20
        },
        {
          "body": "I've got to ask, do you think there's a particular reason that people don't like you? Because it's pretty clear that your bosses and coworkers really don't like you. \n\nYou've got to have some idea why, right?\n",
          "score": 48
        },
        {
          "body": "JoblessStruggle, a lot of people are trying to be real nice but \"firm\" with you here, and from your comments back, you simply aren't getting it.\n\nIn an attempt to cut through the noise, let me make it perfectly clear.\n\n**I am sure deep down you are a good guy, but you come across as a blamer, self-important and arrogant, without the amazing skills (social or technical) to make people willing to put up with it**\n\nSo, you got two options, get significantly (orders of magnitude) better at your craft, so good that when you do something out of the norm people just say \"Yeah, he has rough edges, but he gets 3x more done than anyone else\"\n\n*or* \n\nLearn to be pleasant!  To quote from a wonderful 1950's movie called Harvey... \"'In this world, Elwood, you must be oh so smart or oh so pleasant.' Well, for years I was smart. I recommend pleasant. You may quote me.\"\n\nYou will be absolutely amazed at what just being pleasant can do for you, not a pushover, not a yes man, but pleasant.",
          "score": 14
        },
        {
          "body": "When you get your next job, while in the office environment don't tell them about your previous experiences. \n\nTry to imagine yourself as a politician that must protect his image by keeping past transgressions on the down-low. If you are awkward and shy in person, then research own your own how to be more personable. Stop going to managers with complaints, as that seems to do you in. In the end, your complaints got you nowhere. I'm not saying that you should never complain. Be a cool cat.",
          "score": 10
        }
      ]
    },
    {
      "title": "Feeling Lost After Graduating with a Computer Science Degree",
      "body": "I graduated with a Bachelor's in Computer Science &amp; Information Systems in June 2024. I live in Chicago with my parents and have been unable to land any internships or entry-level jobs. I haven't even gotten any interviews. It's 2 am, and I just broke down, feeling a sharp pain in my chest thinking about my parents as they are getting older. I have no income and am a permanent resident of the US.\n\nI joined a bootcamp for minorities as data analytics and got an internship offer from Bank of America as a margin analyst. However, before I could start, they froze the hiring of new interns due to headcount issues. Now, they're not hiring new people.\n\nI don't know what to do with my life. My Uber account got closed and I'm doing Amazon Flex on the side, but I barely make $1,000 a month.\n\nHas anyone else been in a similar situation? How did you manage to get through it? Any advice or words of encouragement would be greatly appreciated.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1du7tho/feeling_lost_after_graduating_with_a_computer/",
      "comments": [
        {
          "body": "If you’re struggling to land interviews then you should consider posting your resume with personal info redacted to /r/resumes. You can get really great advice for free. Sometimes people have great experience but less than great resumes that get tossed before their content is taken in due to certain things.   Highly recommend checking out the subreddit.",
          "score": 3
        },
        {
          "body": "June 2024? So not that long ago? (Sorry to hear about the lost internship, btw.)\n\n\nThe market is...not that great right now if you're looking for a software engineering position. It's not a horrible crash, just...not very good. I don't know about data science or IT but I imagine things are a little rough there, too. All these fields are particularly saturated at entry-level, we're still dealing with the last of the aftermath from multiple big tech layoffs, and there are still big-wigs hoping they can reduce engineer headcount through the power of AI or forcing their current employees to work unpaid overtime. Due to the glut of people with degrees or experience on the market, people trying to get in with bootcamp certs are kind of at the bottom of the pile, btw.\n\n\nThere are people with experience who have been looking for *months*. My suggestion to you is to have your resume reviewed, send out lots of apps, grind Leetcode, and do whatever you can on the side to contribute to the household.\n\n\nThings are very slowly picking up, but it's going to be awhile yet before we reach a better level of recovery in the market. I wish I had something more optimistic to say to you other than good luck. It's hard out there right now. You may be forced to pick up shitty contracts to get experience. It gets a *little* easier once you have some experience.",
          "score": 2
        },
        {
          "body": "Try joining amazing it department in the warehouse",
          "score": 1
        },
        {
          "body": "Ah yes that’s a tough situation to be in. But, it’s also common for fresh grads to struggle to secure a position out of school. Since you did manage to get an internship, I presume you have a pretty solid resume. In the meantime, keep applying for more opportunities and to sustain yourself, you can always work a part time job. Things are bleak now but there’s light at the end of the tunnel. If you want to see what other people are going through post graduation, you may find the GradSimple newsletter helpful. Since each week, there’s a segment that shares an interview with a graduate like yourself. They talk about the degree they did, their job search experience, what they’re doing now, and whether they’re happy. Many people talk about their job search struggles and what they did in the meantime. Some people worked retail jobs, some freelanced. It might be comforting to know that you’re not alone.",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone have experience working for a self-funded startup?",
      "body": "Laid off in December. Job hunt has been brutal, so many positive green flags and then rejections. \n\nI've always worked in Corporate America or spin offs of big law/big banks (so still Corp America style cultures and personalities).\n\nI'm in the later round interview stage at a tech startup. It's launching in 2nd half 2025 (as of now). Completely self funded by a billionaire. I've asked about culture, work/life balance. The hiring manager was adament that while it is chaotic - he is very protective of his team's life outside work. Panel interview seemed to pile on similiar sentiments: saying that since the hiring manager joined, all impromptu calls and weekend emails have decreased significantly. They did warn the founder is passionate and has a tendency to \"pivot\" and \"change direction\" so there can be a feeling of wasted work. Crunchbase has a growth or heat score of 85 and growth score of 95.\n\nIf there are other metrics or resources I should look at to help predict the potential success of the company, that'd be helpful. Otherwise, i'd love to hear experiences at self funded startups. And if theres any questions i should be asking in my next interview. Also, anything i should consider if i get to offer / comp stage.\n\nThank you!\n\n\n\n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1lxlgqs/anyone_have_experience_working_for_a_selffunded/",
      "comments": []
    },
    {
      "title": "Am i being ghosted? ",
      "body": "hey guys, just asking for opinions and advices. \n\n\nSo i applied to bank of america APAC, and i was offered for an interview on Tuesday and got rescheduled to the next Tuesday. then i got rescheduled again but this time they just said like “we’ll come back to you again once the date is confirmed”. and haven’t heard back yet since the last email. \n\nnow what worries me is that, my friend who got the same offer and was supposed to have the interview with me on the “next Tuesday” ,did his interview on the day and he finished his second interview a week after. \n\nIs this normal? or am i just being ghosted by the HR?  \n\nThanks in advance! \n\nP.S I’ve made this post on another community, just need more opinions ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1h106nw/am_i_being_ghosted/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Openings vs. Hires Says It All",
      "body": "To those struggling to land interviews/offers after hundreds of applications for months on end I feel your pain. Recently finished a BS in finance to pursue career change and have been amazed at how job hunting has become a full-time job since I last looked for a job almost 10 years ago. Since can't put my degree to use for an employer just yet figured could use what I learned to explain to myself what the fuck is going on with this insanely tight labor market.\n\nIt was surprisingly simple to crack the code lol. Just look at this chart of openings vs hires. For those unfamiliar, \"hires\" is showing a 12-month (annual) total. In terms of \"openings\" the official definition is \"a measure of all jobs that are not filled on the last business day of the month. A job is considered open if a specific position exists and there is work available for it, the job can be started within 30 days, and there is active recruiting for the position.\" The spread between these lines has never been wider since the beginning of the data series. What does this mean? Companies are posturing like jobs are available but in terms of putting their money where their mouth is the story is dramatically different.\n\nhttps://preview.redd.it/dt0a4pqh6rbd1.png?width=1318&amp;format=png&amp;auto=webp&amp;s=a2a4bcdf4806474359af02f85ba78762c821dc1f\n\nIn March of 2022, the total openings were \\~12.2 million. How did hiring fare over the next 12 months? Annual total hires by March of 2023 fell just shy of 6 million. Just to make sure you are understanding...**IN 2022 LITERALLY HALF OF THE JOB OPENINGS WERE NOT FILLED!!** Insanity. Unprecedented in the 21st century (potentially in all of American history but there isn't easily available data spanning prior centuries). While some of this gap is a genuine lack of supply to fill certain types of roles (likely minimum wage jobs) or excessive optimism in corporate America at a time of great economic uncertainty, a substantial portion of this phenomenon is attributable to the growing trend of ghost jobs.\n\nWhy? One easily understandable reason could be that job switching, quits, and employee turnover, at least in the early part of the pandemic, were all broadly accelerating. Companies likely wanted to engage in the practice of banking future candidates that they assumed would eventually be needed as turnover necessitated. Another reason is likely firms trying to convince public and private investors alike that the economic shock of the pandemic didn't harm said company. Listing many job openings projects growth to investors who place some level of importance on these leading indicators. For these nefarious cases, I feel it's far from dramatic to call this fraud. If those jobs are not listed with true intent to hire, firms are plainly defrauding investors by painting a false image of growth and operational need. I am 99.9% sure it will never happen but the SEC really should be pursuing charges against companies engaging in this practice.\n\nTo conclude, I sadly have no optimistic hopeful news about hiring trends/practices but this at least provides visually evident clarity. Would love to hear from any people with experience in hiring mention some other unlisted reasons for the trend in ghost jobs. Wishing you all the best of luck in your job search!!!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1e0704n/openings_vs_hires_says_it_all/",
      "comments": [
        {
          "body": "Hey, I understand the confusion and frustration the modern job market can cause. This is where utilizing machine learning technology can optimize the job-search. Current data suggests that AI is shifting the paradigm of job hunting - custom-matching applicants to suitable openings and eliminating the exhaustive application sending process by introducing refined search scopes based on abilities and experience. This strategy architects better job fit and results in higher job satisfaction. How efficient do you believe this approach would be in circumventing misleading vacant posts and optimizing real placement potential?",
          "score": 1
        },
        {
          "body": "That means exactly what you must be reading in the news: there's a labour shortage, record low unemployment, and employers can't find anyone to fill positions.",
          "score": 0
        }
      ]
    },
    {
      "title": "General Applications?",
      "body": "TLDR:  I want to change careers and am looking for HR departments that actually look at resumes instead of just feeding everything into AI readers.  \n\n\n\nSo I am trying to make a second career change right now and I am struggling to do so because modern job applications require very specific things and I generally don't have those specifics.  I am highly qualified with a top tier undergraduate degree, an MBA (from a less respected school, but still accredited), I had a bunch of financial licenses once upon a time and have worked in education for nearly a decade.  I need to earn more than I currently do in education, so I am looking to go back to corporate America.  Thing is, I want a general corporate gig where I am able to earn well and possibly work remotely.  I send out hundreds of resumes and only get interviews for other gigs in education or from recruiting agencies, never the companies themselves.  \n\n  \nAnyone know of large corporations that just take resumes and consider the people for roles based on that?  Or at the very least, a Wonderlic type assessment (I worked for one bank that used this as a way to determine suitability) where I could show my aptitude and they could place me accordingly.  ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1cb8ec5/general_applications/",
      "comments": [
        {
          "body": "You want HR to carefully look over every applicant’s materials without any computerized tools, yet you yourself aren’t even willing to narrow your search down beyond “general corporate gig,” and “work from home?” Do you understand how those are conflicting desires? How can HR do without software assistance if their job postings are bombarded by applications from everyone who wants just any old office job?",
          "score": 2
        }
      ]
    },
    {
      "title": "Bank of America - When to Apply",
      "body": "Hi! Does anyone know if Bank of America has the 6-month policy with interviewing/recruiting?\n\nDo I need to wait for 6 (or any number) months after interviewing with them before I can apply for new roles? Thank you!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1d8teln/bank_of_america_when_to_apply/",
      "comments": []
    },
    {
      "title": "Planning on leaving my cushy desk job and have some questions about vacation...?",
      "body": "Employer: Bank of America/Merrill Lynch\n\nFirst off, I was put on an involuntary leave of absence about a month ago because I failed a licensing exam. I was given 30 days to find a new position at the company while still keeping all my benefits. The 30 days went by and a recruiter called me on day 33 and told me one of the positions I interviewed for wants to hire me and I can take it and transfer internally as an exception, or refuse it and remain terminated. I opted to agree and take the new position; thus saving my vacation and benefits I had been accumulating (although this gun to the head tactic is downright evil). This company has stabbed me in the back on several occasions and I'm honestly over working here. \n\nThe situation is: I have agreed to work this new position starting 07/25/2022, but shortly after I got an offer at another job that I couldn't refuse starting 09/01/2022. I have purchased time off and vacation time accrued at my old company and have a vacation planned 08/20-8/28. I was planning on staying at my old company until my new position starts, but I'm not sure if I can use my vacation freely and then turn around and leave.... after being in my new position only a few weeks. I have 40 hours of purchased time off that are deducted from each pay check. As well as 160 hours that accrue over the course of the year. Having technically never left the company, I should have accrued at least 80 vacation hours so far and paid off at least 20 hours of the PTO. So, if I take my vacation, will I owe that money back to the company for turning around and leaving? \n\nAlso a friend suggested that if I were to up and leave without a 2 week notice, it could go on my background check and make getting future jobs harder. I was aware that it may make me non-re-hirable within this company, but I didn't think this could go on a background check. I thought that was for criminal history. If anyone has any information that could help, I'd greatly appreciate it.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/w4rvju/planning_on_leaving_my_cushy_desk_job_and_have/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "A 2-week notice is a courtesy, it is not a requirement and it absolutely does NOT go on your background check. Your friend is grossly misinformed. \n\nDoes your employer cash out unused PTO, or is it a use it or lose it policy? If you are paying for PTO that you don't take, that should be refunded to you when you leave. \n\nWas your vacation already approved? Personally, if they cash out your PTO when you leave (not all companies do, but most do), I would probably give my 2 weeks notice and call it good.",
          "score": 1
        },
        {
          "body": "It doesn't go on a  bg check. At most, if doing employment verification a company might ask if eligible for rehire and if no, they may ask why and it would be job abandonment but it's not a big deal. Most, not all, companies usually just want job title and dates employed.\n\nHonesty since you have another job I would just leave this one off the resume.  Irs a small enough gao that you say you took a summer off. \n\nBg check companies only check what you document for employment verification.\n\nCheck company policy on vacation payout but if this is bought PTO its money you've put in and I don't see why you would have to pay it back but I could be wrong.\n\nBut I wouldnt worry too much about that.",
          "score": 1
        }
      ]
    },
    {
      "title": "I haven't been paid in 2 years, I have almost no official job history, I have no references, and my resume is barebones. I am unable to get to the interview process and I am afraid of exhausting local job opportunities.",
      "body": "Hello! I'm in an extremely difficult situation and I am in desperate need of help but I need leads on where to go and what to do.\n\nLocation: USA, Western Washington State, East of Everett\n\nBackground (I apologize for the length):\n\nMy dad passed his business over to me in 2019-2020 as well as putting a few other titles in my name. He convinced me to do it because he wanted help and I agreed because he's my dad. It was only afterwards that he told me he did it so he wouldn't lose his business or property. \n\nSince then he has used me as a figurehead and has made sure that I have no say so in the decision making process. Meanwhile he has run the company into the ground. We are late on Sales taxes and the DOR is gong to put out a tax warrant for me. He also pulled an SBA loan out and he lied to me about the loan details so that I would sign for it. We have not been able to keep up with payments.\n\nHe also acquired inheritance meant for me from my grandfather, on his side, which he got from selling my grandfather's house. I didn't know I was getting anything, but he had promised my grandpa he would give me something for being his primary caregiver. When the time came though, he gave my younger sister, who hated my grandpa, and himself large portions of the money acquired and then bought me a trailer near a marina where he wanted to keep his boat. He claimed that he bought 2/3 of it with his inheritance and the last 1/3 with all of mine. The house and property are in my name, but he told everybody that I was remodeling what would become his retirement home, which I found out later. I didn't actually want to remodel but he started ripping off the skirting and ripping out the insulation right before the first winter that my wife and I moved in. Now the HOA is asking me to demolish it because the neighbor next door wrote up a complaint. I had been trying to save up money to work on my house and property but when he found out I had a decent chunk of change saved he stopped paying me and I had to spend it on survival. Then he forged my signature in order to start the process of buying the commercial property my wife and I are currently living at. I participated in finishing the paperwork so now we are both on the title. He set it up so that a down payment would be made and then the rest would be paid off monthly until it is completely paid off. The monthly payment is higher than what rent would've been. So now the three of us share an office building and we're back under a roof he considers his.\n\nI feel that the above is relevant because the isolation and forced focus on a living situation has destroyed my social network and ability to manage my time. The commitment to the effort has also left me with no references and a poor work history. \n\nI had a work history before doing all this but it is so old that it has become difficult to add anything to my resume. \n\nHe controlled most aspects of my life for most of my life so I had bad reputations at these jobs simply by being unable to keep up with them.\n\nhere is a list of jobs I've had:\n\nvolunteered at a food bank (very old)\n\nvolunteered at an animal shelter (old and not a good reference)\n\nworked under the table at a tree farm that no longer exists\n\nworked at a restaurant (old and bad reputation there as I was trying to get away from being under my dad's roof and that made it difficult to be on time or focus on work)\n\nworked as a caregiver ( this was after I had found my way out but I was burnt out and did a terrible job, so I don't want to count it or use it as a reference)\n\nThen I got looped into this Gas piping business, so I'm a plumber now\n\nI started a gourmet/medicinal mushroom farm because it's all my dad would \"let\" me do besides pipe fitting\n\nI'm very good at it, but he's trying to take complete control of that as well.\n\nMy dad also has a habit of sabotaging me. So it's difficult to use my current job as a work history or point of reference. \n\nI have a high school diploma from a college program and I was 15-25 credits away from my first AAS transfer degree. This only happened because I was away from him, but then I ended up living with him again and overtime he convinced me I needed to leave and go two states away to take care of my grandpa who was going into hospice for parkinsonism and multi-system failure, which then got me looped into taking care of my other grandparents, by my mom. My grandma was dying of brain tumors and cysts, and my grandpa was experiencing dementia. \n\n&amp;#x200B;\n\nI have many skills and abilities but I do not have evidence to back this up:\n\n&amp;#x200B;\n\nI'm coachable\n\nI know my way around a computer\n\nI have a basic understanding of programming and can learn more if I have to\n\nI have a decent mechanical skillset\n\nI learn quickly\n\nI can write\n\nI am learning other languages, starting with Spanish\n\nI am well-spoken and articulate\n\nI am, what others consider to be, incredibly strong\n\nI have exhibited artistic ability in many mediums\n\nI can voice act and perform voice overs\n\nI have a decent understanding of the culinary arts\n\nI have experienced operating heavy machinery\n\nI can operate CNC machinery\n\nI exhibit a decent understanding of natural science, which I've used to develop most of the above skills\n\nand much more, but I'm still learning\n\n&amp;#x200B;\n\nIn the past 2 weeks I've contacted Washington State Work Source who redirected me to The Volunteers of America.\n\nThe Volunteers of America have still not picked up the phone or returned my messages.\n\nI'm searching intensely for a job but I do not want to exhaust the opportunities near me by submitting a skeletal resume. \n\nI am going to try entry level jobs in the fast-food industry or in retail but I've been rejected from those in the past and I wanted to find resources and cover my bases before I start applying.\n\nMy wife is about to give birth to our daughter.\n\nWe're living on wic, ebt, and gas assistance.\n\nThe gas piping company I \"own\" covers my car insurance and cell phone which my dad claims is my pay. But those payments add up to only a fraction of what my wages should be. He's also planning on hiring immigrant workers in the future which he will exploit and that will come back to me if it is a problem. \n\n&amp;#x200B;\n\nI'm 31 and my life is a disaster, but my wife and I are holding our ground.\n\n&amp;#x200B;\n\nAnd now I'm reaching out to you for leads and help.\n\n&amp;#x200B;\n\nThank you, in advance, to any and all who decide to provide me with resources and assistance.\n\n&amp;#x200B;\n\nTL;DR\n\nMy dad screwed me. I've got almost nothing. My wife and I are living on assistance. We're having a daughter. I'm having a bad time getting interviews. I don't want to exhaust job opportunities. I am in need of resources. I'm reaching out for help and ideas.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/198fnjh/i_havent_been_paid_in_2_years_i_have_almost_no/",
      "comments": [
        {
          "body": "Honestly this isn't a question for reddit. You need to talk to an attorney about everything going on with your dad. This is pretty serious stuff that could end up putting a black mark on your credit and finances.\n\nI know it sounds unhelpful but seriously, get off reddit and contact an attorney ASAP.",
          "score": 4
        },
        {
          "body": "Are any of the properties that are in your name worth selling?  If the legal paperwork says you own it, you can sell it.  Tell your dad that he can either buy it from you or you're going to sell.  \n\nAt this point, it looks like the biggest thing you need is to get out from under your dad's thumb.  \n\nWith plumbing experience, you should be able to find decent work.   \n\nDo use the legal resources others have suggested.  They may bring you better results than selling things that should never have been in your name (but are).\n\nGet away from your dad.  At least limit the influence he has on your life.  It won't be easy, bit you need to build your life away from him,",
          "score": 2
        }
      ]
    },
    {
      "title": "RVO HEALTH SCAM",
      "body": "I was contacted yesterday by phone regarding my resume on indeed I was texted by the number 1(808)206-9498 wich I noticed was green that means it isn’t from an iPhone by someone stating to be a “Jennifer brewer” from RVO Health. I also ended up downloading Microsoft teams for what I thought would be a phone interview or video interview but was sent a series of very rudimentary and basic questions. I was told the position would be $30 an hour. I was told once I was hired I would be send a check to purchase in Home office equipment buy a specific vendor after I receive the money from a check. \n\nThis is the message I received and those following from the text thread: \n\nHello, I am Jennifer Brewer. We received your Resume at (@RVO Health). From Indeed we are impressed by your background and would like to invite you for the job briefing and interview. You made it to the Next step for the position of Remote Data Entry with a pay of $30 per hour, Are you interested in proceeding? You are required to download and set up Microsoft Teams on your app store. Kindly connect with the Operations Director on Microsoft Teams app to begin your interview by clicking on the details below. \n\nName: Collins Wheeler\nInterview code:INV-23\nTeams invite link:\nhttps://teams.live.com/l/invite/FEAXBq4I6LfWDxHsgQ\n\nBest of luck!\n\nI then asked if there was a time frame and the reply was \n\nYou are required to send a message to the HR manager now for the job interview. Okay, be on a steady chat with him and wish you best of luck! \n\nRight away I thought the dialog was a bit strange. \n\nI will now copy and paste every message in wich “COLLINS WHEELER” “mrcollinswheeler@gmail.com “ \nsent me on the Microsoft teams app sent by him leaving out what I sent \n\nPlease follow along so you can be aware of this script \n\nWelcome to RVO Health\n\nMy name is Collins Wheeler, the Interview Manager of RVO Health. I’ll be conducting the Interview and will also provide you with more details on the company and the open position. How are you doing today and what is your interview code? Great!\n\nInterview Code verified.\n\nThe job briefing and interview process will be done via Microsoft Teams instant messaging. \n\nNote: During this process, your timely response is highly appreciated OK? Alright. Kindly Introduce yourself\n\nWhat is your Name, Current location(State) and Phone number? It’s a pleasure to meet you!\n\nThese are the requirements for the Job:\n\n• Are you a U.S. Citizen, Canadian Citizen or a Green-Card Holder\n• Must be fluent in communication and English\n• Must have a clean criminal record\n• Must be at-least 35 wpm average\n• Proficient with Microsoft Office\n• Strong organizational skills\n• Must be above 18years of age.\n\nDo you meet these requirements? OVERVIEW:\n\nAt RVO Health, our mission is to give people a better way to health &amp; wellbeing. We own and operate the largest health &amp; wellbeing platform in the US, helping nearly 100 million people a month seek information, find a doctor, save money, and take action around their health &amp; wellbeing. Our portfolio of industry-leading websites, products and services touches every part of the health and wellness journey.\n\nOur portfolio includes information on demand, education and advice, condition-based communities, access to healthcare, an ecommerce store of health products and services, prescription discounts, prescriptions delivered to your doorstep, and more. We are making health easier to navigate, more accessible, and more affordable for everyone. Furthermore, all of our content, products and services are medically-backed, so people can trust that they are getting accurate, legitimate support for their health. \n\nRVO Health promotes a flexible environment for its staffs and has hired for full-time positions with optional remote availability in the past. Flexible employment opportunities with RVO Health have included entry-level roles for professionals who have a bachelor’s degree and experience in career areas like marketing, Data Entry, internet &amp; ecommerce, and writing. \n\nTo join its team, RVO Health looks for people who are dedicated, creative problem-solvers, and are collaborative team players. With RVO Health qualified candidates receive a comprehensive benefits package, including unlimited time off, a 401(k) plan, dental and vision coverage, health insurance, company equity, and more.\n\nTo research more about RVO Health. You can visit the company at https://rvohealth.com/ for more information. You may review the website while we proceed. \n\nUnderstood? Alright. The Position available within the company is for a Remote Data Entry Analyst position and below are your job responsibilities.\n\nRESPONSIBILITIES/DUTIES ARE:\n\n* Updating information in computer system.\n* Running and processing multiple documents online.\n* Utilizing and effectively using the Microsoft Word, Excel, and Access.\n* Inputting information from a variety of sources into a computer database and few administrative tasks.\n* Taking records of company status and entering them into a pre-established tracking system.\n* Assignments will be sent to you via e-mail and you will report directly to your immediate supervisor.\n\nCan you handle these? ABOUT THE JOB:\n\nThis is a Remote Position where you'll be working for RVO Health from home. If you wish to work from an office, you will be required to relocate to our branch in  Charlotte, North Carolina but the position is fully remote, so there's no need for relocation.\n\nRVO Health will take full responsibilities for your Office equipment. You will also undergo two weeks of training online from your home via video conference with your training supervisor and you will be paid $25.00 per hour during training and later goes up to $30.00 per hour when you start working after 2weeks of training.\n\nYou will be required to set up your own time schedule working for RVO Health either as a Full time employee working 35hours weekly or Part time employee working 20hours weekly. (You have an option of additional 5hours for overtime weekly for both full time and part time).\n\nYour working and training hours are flexible and can be scheduled for anytime and any day as long as the total required working hours are completed weekly. Does that work for you? Great!. The next step now would be for you to answer the qualifying questions which are the interview questions. \n\nThe procedure is very simple, I will send you the questions in three sets, you have 10 minutes to answer each set of questions and at the end of each set.\n\nYou're required to put (DONE) to indicate that you have completely answered the questions in each set. Are you ready? First Set\n\n1. Briefly describe your work experience, especially the aspects of Data entry? If none, Skip.\n\n2. What are your greatest professional strengths and what do you consider your weaknesses?\n\n3. Are you a better planner or implementer?\n\n4. (a) Do you work better under pressure or do you need enough time to think and work at your best? \n(b) What is your Clerical Speed or WPM?\n\n5. Three words to describe yourself would be? Second Set:\n\n6. What are you most proud of?\n\n7. Do you have a HP laser jet printer, copier and scanner?\n\n8. What phone carrier are you with and how long?\n(b) Postpaid or prepaid plan?\n\n9. Tell us why you feel you are the right person for this Job and Tell us about a challenge or conflict you've faced at work, and how you dealt with it.\n\n10. What work have you done that involved working with sensitive or confidential information? Last Set\n\n11. Do you have a job presently? If yes, what position do you occupy with the company?\n\n12. What do you understand by privacy and code of conduct?\n\n13. (a) Would you prefer to be paid weekly or Bi weekly?\n(b) What financial institution do you bank with? To see if it tallies with the company’s salary account.\n\n14. What motivates you and What is your greatest professional achievement?\n\n15. Where do you expect to be in 5 years time and what will you do if you are not successful in getting this position?\n\n16. How much training do you think you'll require to become a productive employee? Great. You have done impressively well answering all the questions. If you are considered to work for the Company, you will receive a payment. \n\nYou will use this payment to set up your mini office at home by purchasing your office equipment plus the shipping logistics, which are what you need to start work with. Can the Company ensure your full trust, commitment and diligence? Alright. I need to forward our conversation to the Company head department to enable them see if you are qualified for the job. \n\nThis will be all for now, Our next appointment will be scheduled for tomorrow morning at 8:00AM. You are expected to send a message to me on here for your job update and consideration.\n\nNote: Punctuality displays a person's respect for people and Enjoy the rest of your day and Stay Safe!\n\nThe next morning (today) 8am \n\nGood morning, I trust you are doing great and ready for the job update? CONSIDERATION STAND :\n\nQuestions Answered: (84%) Above Average\nKnowledge, Skills and Experience: (Considered a Valuable Asset)\nConsideration Certification: (Confirmed Qualified)\n\nRVO Health. is pleased to offer you the position. We trust that your knowledge, skills and experience will be among our most valuable assets.\n\nAfter the job briefing and interview, the company has decided to hire you as one of our new working staff. I hope you will be a great asset to our company and create a good career for yourself. We're delighted to have you I hope you draw tremendous satisfaction from working with us.\n\nI’m looking forward to seeing you grow and develop into an outstanding employee that exhibits a high level of care, concern, and compassion for others. Once again, Congratulations. You are welcome. I’ll be explaining what the company and position entails. You’ll have to pay attention and there’ll be room to take your questions. Ok? Alright!\n\nBenefits: Health, Dental, Life and AD&amp;D Insurance, Employee Wellness and 401k plans. Paid Time Off and Holidays with Generous Company Discounts. And yes you can have your family on it. Lastly, Company handles gas mileage used for company errands and Internet bills.\n\nBonuses: You will be enrolled for this benefits after a period of 1-2 months of working with us. We are going to be communicating through this messenger till after 7 days of working with us, after then once we are done updating our website a user and pass to our website will be given to you including a link to our server. Also after then list of contact phone numbers to various departments will be sent to you. \n\nIn the second phase, RVO Health will cover the full cost required to enable trainees get acquainted with their office equipment (software &amp; hardware). Also, trainees will be given assignments to work on during the training period. Is this understood? Great. I will be sending you the offer letter on here as an attachment shortly, you will be required to have it filled out and submitted here either as an attachment or a picture. OK? Alright. You will have to set up your own time schedule while working for the Company. \n\nIn the meantime, I need you to provide me with the following information for proper registration on the Administrative Desk: \n\nClick on the link below to have the information filled out for the job next step. \n\nAlso let me know once done.\n\nhttps://form.jotform.com/232395632488062 Got it. I believe you recall from yesterday, I mentioned that a payment will be made available to you, which will cover the cost of your office equipment. Correct? Great. You'll receive a check for your office equipment. However, due to the delays associated with our personal courier services, the Company has decided to send you a check for your office equipment, via your email address. You'll are required to deposit the check electronically using your mobile banking app. Funds will be made available instantly or the next day as soon as the deposit is received by your bank\n\nwhen the funds are available for you to make the purchase of the working materials, you will be required to make the payment from the private vendor which is approved and recommended by our company. I will be here to instruct you on how to make the payment from the vendor when the fund is available. We have our reasons for this because the software and office equipment are specified by the company. The vendor will install the software programs into the MacBook before shipping them out to you. This will aid you to begin your trainings and the job as soon as possible. Do you understand? Alright. After receiving your office equipment and setting up your home office, a representative(your Supervisor) from the company will either be meeting with you in person, or the meeting will be done via Zoom/ Skype Videos. \nYou’ll have the opportunity to ask more questions, learn more about the company and get more details about the job position.\n\nAfter all the details and instructions given to you by the company, let us know if you are ready to move forward and be a part of the team. List of the equipment that will be sent to your home address by the vendor includes:\n\nApple Laptop ( MacBook Pro 15-inch with OS X Mojave)\nLaser Printer (Hp LaserJet Pro M1536dnf) - (Includes; Fax machine, Scanner, Copier), \nFellowes Micro-shred Confetti-cut paper shredder (Fellowes Power-shred MS-450Cs)\nJabra GN9120 (Flex Boom Headset)\n\nThe company will shoulder the bills regarding your full office set up that you will need to become a productive employee.\n\nAny question before we move to the next step? Above is your official offer letter. Kindly print out, fill out and sign where required. Got it?\n\nEMPLOYEMENT OFFER LETTER\nFollowing your interview, we are delighted to offer you the position of a data entry clerk with RVO Health, you’re now part of a dedicated team that works together to provide the highest possible level of service and satisfaction.\nAs a member of RVO Health, we ask for your commitment to deliver outstanding quality and results that meets and hopefully exceed expectations. In addition, we expect your personal accountability in all actions and results that you provide as a representative of RVO Health and in return, we are committed to provide you with every opportunity to learn, grow and improve to the highest level of your ability and potential. We are confident that you will find this new opportunity both challenging and rewarding. The following points outline the terms and conditions we are proposing.\n \nJob Title: DATA ENTRY ANALYST\n \nBenefits &amp; Bonuses: Medical Insurance, Retirement Plans and 401k Plans, Disability Insurance, Flexible working hours, Paid Time-off and Comprehensive training programs for skill development. Benefits for health which covers your Physical, Mental and Financial wellness and Benefits such as commissions and bonuses. You will be enrolled for these benefits after a month with RVO Health.\n \n \nPreferred Hours Weekly: 35 Hours (Full Time)​, 20 Hours (Part Time)\n \nHourly Pay: $30.00\n \nWeekly Pay: $1050.00 (Full Time), $600.00 (Part Time)\n \n \nRVO Health covers the full cost of your office equipment &amp; supplies, Software, gas used for your office supply errands and Internet bills. Working hours are flexible, you get to work when it’s best for you, as long as you cover the total time required as a Full Time or Part Time employee. An additional 5hour is available and flexible to take it up to 40hours or 25hours a week if you choose to work overtime.\n \n \nNOTE: A progression and performance review will be conducted on a quarterly basis to assess performance to-date, and to clarify or modify this arrangement, as the need may arise. This arrangement may be terminated by either party upon notice in writing to either party with notice that complies with Employment Standards (or Labor Standards). EMPLOYMENT AGREEMENT\n \nThis Agreement made on this day, between RVO Health [Employer], a company incorporated under the laws of the United States of America, and you [Employee], hereby put both parties in mutual relationship, where the employer desires to obtain the benefit of services from the Employee, and the Employee desires to render services on the terms and conditions set forth. Therefore, in Consideration, the parties agree as follows:\n \n Employment\nThe Employee agrees that he/she will always be faithful, industrious, and with the best of his/her skill, ability, experience, and talents, perform all the duties required of his position. In carrying out these duties and responsibilities, the Employee shall comply with all Employer policies, procedures, rules, and regulations, both written and oral, as are announced by the Employer from time to time. It is also understood and agreed to by the Employee that assignments, duties, responsibilities, and reporting arrangements may be changed by the Employer in its sole discretion without causing termination to this agreement.\n \n Position Title\nAs a Data Entry Clerk, the Employee is required to perform the following duties and undertake the following responsibilities in a professional manner.\nPrimary Responsibilities are:\n Keeping Records of Materials, filed or removed, using logbooks or computers.\n Add new material to file records and create new records as necessary.\n General office duties such as typing, operating office machines and sorting mails.\n Maintaining Proper information flow and having general business awareness and necessary information.\n \n Vacation\nThe Employee shall be entitled to a maximum of 10days PTO per year. (General Public Holidays are not Included).\n \n Performance Reviews\nThe Employee will be open to job appraisals and will be provided with a written performance appraisal at least once per year and the said appraisal will be reviewed which in turn gives room for growth within the Company.\n\n Termination\nThe Employer or Employee may at any time terminate this agreement, but for a sufficient reason and by giving two weeks of written notice to the other party.\n \n Entire Agreement\nThis agreement contains the entire agreement between the parties, superseding in all respects all prior oral or written agreements or understandings pertaining to the employment of the Employee by the Employer and shall be amended or modified only by written instrument signed by both parties and we look forward to the opportunity to work with you in an atmosphere that is successful and mutually rewarding.\n \n \n \n \n \nJeff Hallock\nChief Executive Officer\nRVO Health.\n   \n \n \nWith the signature below, I​accept this offer of employment on this\nday............................... of…​,2023 and an estimated start date on the\n………………… of​,2023.\n \n \n \n...........................................................................................\nSIGNATURE\n \n \n \n \nThis message and any associated attachments may contain confidential information and must NOT be copied, disclosed, or used by anyone other than the intended recipient. If you are not the intended recipient, please immediately delete this attachment and any copies of it. Thank you for your assistance.\nUse of https://rvohealth.com/ standard terms and conditions which are published on our website.\n \n \n       Copyright © 2023 RVO Health. All rights reserved.\n\nAlright. The company accounting department is currently preparing your check for the office equipment and I need you to answer these questions:\n\n*Do you have access to a Printer?\n\n*Do you have your bank's mobile app?\n\n*What is your mobile deposit limit?\n\n*What is your preferred email to receive the check?\n(At this point I was really suspicious and it only got worse as they got pushier and pushier and highly unprofessional) \n\nYou are required to deposit the check with your bank mobile app not with PayPal account. Understood? \nYou have an account with Wells Fargo   bank, right? \nDo you deposit the check with your Wells Fargo account? \nYou can as well deposit the check with Wells Fargo mobile app app\n\nAre we still connected?\n\nWhat bank do you have close by?\n\nIn this case if you are capable of paying for your office equipment while you get reimbursed alongside with your first pay which will be later setup as direct deposit to your PayPal through Wells Fargo\n\nDo you have PNC, Truist, Huntington or M&amp;T bank close you?\n\nOh okay, what bank are you heading to?\n\n??\n\nAlright, you can however look for another bank nearby\n\n??\n\nWhat bank do you have setup?\n\nI’m busy at this time I’m unable to call\n(At this point I knew it was a scam and just tried calling them and of course the didn’t answer) \n\nThis scam wants you to receive the check and buy from their “vendor” and then their check will most likely bounce back, and you will be responsible for paying the bank back that amount of money as for the products that you purchased will probably never be shipped. \f\n Termination\nThe Employer or Employee may at any time terminate this agreement, but for a sufficient reason and by giving two weeks of written notice to the other party.\n \n Entire Agreement\nThis agreement contains the entire agreement between the parties, superseding in all respects all prior oral or written agreements or understandings pertaining to the employment of the Employee by the Employer and shall be amended or modified only by written instrument signed by both parties and we look forward to the opportunity to work with you in an atmosphere that is successful and mutually rewarding.\n \n \n \n \n \nJeff Hallock\nChief Executive Officer\nRVO Health.\n   \n \n \nWith the signature below, I​accept this offer of employment on this\nday............................... of…​,2023 and an estimated start date on the\n………………… of​,2023.\n \n \n \n...........................................................................................\nSIGNATURE\n \n \n \n \nThis message and any associated attachments may contain confidential information and must NOT be copied, disclosed, or used by anyone other than the intended recipient. If you are not the intended recipient, please immediately delete this attachment and any copies of it. Thank you for your assistance.\nUse of https://rvohealth.com/ standard terms and conditions which are published on our website.\n \n \n       Copyright © 2023 RVO Health. All rights reserved.\n\nAlright. The company accounting department is currently preparing your check for the office equipment and I need you to answer these questions:\n\n*Do you have access to a Printer?\n\n*Do you have your bank's mobile app?\n\n*What is your mobile deposit limit?\n\n*What is your preferred email to receive the check?\n(At this point I was really suspicious and it only got worse as they got pushier and pushier and highly unprofessional) \n\nYou are required to deposit the check with your bank mobile app not with PayPal account. Understood? \nYou have an account with Wells Fargo   bank, right? \nDo you deposit the check with your Wells Fargo account? \nYou can as well deposit the check with Wells Fargo mobile app app\n\nAre we still connected?\n\nWhat bank do you have close by?\n\nIn this case if you are capable of paying for your office equipment while you get reimbursed alongside with your first pay which will be later setup as direct deposit to your PayPal through Wells Fargo\n\nDo you have PNC, Truist, Huntington or M&amp;T bank close you?\n\nOh okay, what bank are you heading to?\n\n??\n\nAlright, you can however look for another bank nearby\n\n??\n\nWhat bank do you have setup?\n\nI’m busy at this time I’m unable to call\n(At this point I knew it was a scam and just tried calling them) \f\n \nEMPLOYMENT AGREEMENT\n \nThis Agreement made on this day, between RVO Health [Employer], a company incorporated under the laws of the United States of America, and you [Employee], hereby put both parties in mutual relationship, where the employer desires to obtain the benefit of services from the Employee, and the Employee desires to render services on the terms and conditions set forth. Therefore, in Consideration, the parties agree as follows:\n \n Employment\nThe Employee agrees that he/she will always be faithful, industrious, and with the best of his/her skill, ability, experience, and talents, perform all the duties required of his position. In carrying out these duties and responsibilities, the Employee shall comply with all Employer policies, procedures, rules, and regulations, both written and oral, as are announced by the Employer from time to time. It is also understood and agreed to by the Employee that assignments, duties, responsibilities, and reporting arrangements may be changed by the Employer in its sole discretion without causing termination to this agreement.\n \n Position Title\nAs a Data Entry Clerk, the Employee is required to perform the following duties and undertake the following responsibilities in a professional manner.\nPrimary Responsibilities are:\n Keeping Records of Materials, filed or removed, using logbooks or computers.\n Add new material to file records and create new records as necessary.\n General office duties such as typing, operating office machines and sorting mails.\n Maintaining Proper information flow and having general business awareness and necessary information.\n \n Vacation\nThe Employee shall be entitled to a maximum of 10days PTO per year. (General Public Holidays are not Included).\n \n Performance Reviews\nThe Employee will be open to job appraisals and will be provided with a written performance appraisal at least once per year and the said appraisal will be reviewed which in turn gives room for growth within the Company.\n\f\n Termination\nThe Employer or Employee may at any time terminate this agreement, but for a sufficient reason and by giving two weeks of written notice to the other party.\n \n Entire Agreement\nThis agreement contains the entire agreement between the parties, superseding in all respects all prior oral or written agreements or understandings pertaining to the employment of the Employee by the Employer and shall be amended or modified only by written instrument signed by both parties and we look forward to the opportunity to work with you in an atmosphere that is successful and mutually rewarding.\n \n \n \n \n \nJeff Hallock\nChief Executive Officer\nRVO Health.\n   \n \n \nWith the signature below, I​accept this offer of employment on this\nday............................... of…​,2023 and an estimated start date on the\n………………… of​,2023.\n \n \n \n...........................................................................................\nSIGNATURE\n \n \n \n \nThis message and any associated attachments may contain confidential information and must NOT be copied, disclosed, or used by anyone other than the intended recipient. If you are not the intended recipient, please immediately delete this attachment and any copies of it. Thank you for your assistance.\nUse of https://rvohealth.com/ standard terms and conditions which are published on our website.\n \n \n       Copyright © 2023 RVO Health. All rights reserved.\n\nAlright. The company accounting department is currently preparing your check for the office equipment and I need you to answer these questions:\n\n*Do you have access to a Printer?\n\n*Do you have your bank's mobile app?\n\n*What is your mobile deposit limit?\n\n*What is your preferred email to receive the check?\n(At this point I was really suspicious and it only got worse as they got pushier and pushier and highly unprofessional) \n\nYou are required to deposit the check with your bank mobile app not with PayPal account. Understood? \nYou have an account with Wells Fargo   bank, right? \nDo you deposit the check with your Wells Fargo account? \nYou can as well deposit the check with Wells Fargo mobile app app\n\nAre we still connected?\n\nWhat bank do you have close by?\n\nIn this case if you are capable of paying for your office equipment while you get reimbursed alongside with your first pay which will be later setup as direct deposit to your PayPal through Wells Fargo\n\nDo you have PNC, Truist, Huntington or M&amp;T bank close you?\n\nOh okay, what bank are you heading to?\n\n??\n\nAlright, you can however look for another bank nearby\n\n??\n\nWhat bank do you have setup?\n\nI’m busy at this time I’m unable to call\n(At this point I knew it was a scam and just tried calling them)",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/16unrp7/rvo_health_scam/",
      "comments": [
        {
          "body": "Daaaaaang I’m so glad I saw this because I got a text this morning about a job there. The amount of times they used the word kindly had me at scam lol",
          "score": 2
        },
        {
          "body": "I just had an interview with Kathleen Catherine, I thought it was odd. The interview was done  on an app ( Signal ). it was done through text.",
          "score": 2
        },
        {
          "body": "Literally just got that text too",
          "score": 2
        },
        {
          "body": "I got one from Robin Tabor. Plus they made the mistake of using the CEO of Cigna as the hiring manager, which made it clear that it's a scam.",
          "score": 2
        },
        {
          "body": "Oh my goodness thank you all so much for this heads up, I had suspected that RVO was a scam with how often they post jobs, but this is definitely a helpful confirmation.",
          "score": 1
        },
        {
          "body": "I got an email from \"Cathy Morgan\" whose email address is: mrcollinswheeler@gmail.com. That lead me to this thread! \nHere's what it said: \n\n\nDear Applicant\n\nWe are delighted to invite you to an interview for the Work From Home Customer Service/Data Entry Position. As we move forward with the next steps, we require you to download and set up a Microsoft Teams account.\n\nTo facilitate our conversation, please add Collins Wheeler the Hiring Manager, to your Microsoft Teams contacts using the following link: *link*\n\nWe appreciate your prompt attention to this, and we look forward to speaking with you soon. (JOB ID:TAL-09)\n\nThank you for your interest in the position.\n\nBest regards,(RegCell Inc.)",
          "score": 1
        },
        {
          "body": "You should post that number on r/scamnumbers and r/scambaiting. Scammers who to steal money from jobseekers are the absolute worst!",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Keep getting rejection after interviews ",
      "body": "I've applied 800 applications for a software engineering internship, and I am a junior CS major student as ESL.\n\nI've got multiple HireVue one-way interviews and live interviews, but for live interviews, my interviews often last shorter than scheduled and only got ghosted and rejected. \n\nI have no prior internship, and while my gpa is near 4.0 but no name is school.\n\nI had live interviews for PayPal, HPE, Daktronics, Viavi Solutions, CSC, and Paycom.\n\nFor HPE, it went short, and I got a coding assessment (non-live) invitation 10 days after the interview but was able to get perfect scores. (So I am not sure whether I passed the interview but just failed in coding assessment, or I failed both.)\n\nPhone screening: CSC (Passed), Spotlight, Fidelity Investments, United Wholesale Mortgage. For Fidelity Investments and CSC, the recruiter said he will pass my resume to the hiring manager, and the hiring manager will review that then passed for CSC but rejected for Fidelity. \n\nFor one-way interviews (I suspect some companies send nearly everyone or with light resume screening, only passed for recruiterbut not yet hiring manager ): PSCU, Cardinal Health, CNA Financial, Lumen (they send before resume screening), Bank of America (most people didn't get). Humana(pre-screening), SiriusXM, Citizens.\n\nAll of my first round interviews were behavioral. (For CSC, the flow for the technical part was good, but the flow went not good during behavioral. )\n\n\nI feel the lack of prior internships make my interview result negatively as there are many other candidates who have had strong internships. (Like my resume is good enough to get an interview but not enough to compete with other candidates who got interviews.)\n",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1b5b06p/keep_getting_rejection_after_interviews/",
      "comments": [
        {
          "body": "&gt; I am a junior \n\nThere's your problem. Often schools will request companies give interviews even if not currently hiring. The point of the interviews is so you continue to pay for schooling, err I mean, to gain experience at interviewing. Just flat out ask the interviewer what criteria it looks for, what they look for, etc.",
          "score": 2
        },
        {
          "body": "Keep trying ! Don’t give up! Don’t be discouraged! You will soon be shedding tears of joy because your dream job will locate you soon.",
          "score": 1
        }
      ]
    },
    {
      "title": "some questions: searching and interviewing after a long period unemployed, salary/compensation, looking for the first real job (details in post)",
      "body": "Hello everyone:\n\nI have done some searching here and there particularly on Reddit, so I wanted to get some peace of mind for myself. Thanks in advance for reading and answering.\n\nMy background and first question: I earned a degree in history from a small Catholic liberal arts college. By senior year, and I don't **regret** this at all, I decided to enter a program of priestly formation. Obviously, I left (since I'm posting here!) and earned a master's degree in French, knowing that I was interested in teaching or some sort of corporate job that required French — and that's my ultimate dream position. My French is excellent, at C1 level as certified by the French Ministry of National Education.\n\nThen I worked in France for two years (see below, number 2) and am trying to get on my feet. I'm in my latter 20s.\n\nWith a history degree, I don't know what I could do, mostly what I probably can't do (plus, I'm fairly shy and don't like traveling constantly): so marketing and sales are not good fits for me, but working with people internally, that's fine. I don't mind customer-facing jobs that are temporary (I have strongly considered hospitality, but front desk, auditor, or GM positions wouldn't be something that I could handle semi-permanently). And I work **hard**: I've only gotten excellent reviews, and while I realize that I'm not special, I don't have a long résumé and work history…\n\nbut I almost don't care what I do: logistics, hospitality, finance, even tech… how do I look for jobs if I'm open to different jobs in different fields? I know **where** to look, but not really **how,** a result of having spent senior year not focused on that like my peers were; I also know that I'm not going to be super-hot interviewing (I'm too forward).\n\n2) I have not worked for approaching two years. After coming home from a temporary post (to be more specific — I did TAPIF, the Teaching Assistant Program in France) the what should have been, and likely still will be, that is often good way to get a foot in the door, particularly for jobs that require using French regularly (ish, it's harder to find these positions in North America) and with the possibility of gong back to France or even Belgium, Luxembourg…\n\nI got discouraged searching for something temporary, and some other things happened in my personal life along with some relatively minor health issues that together really knocked me out. I kept busy as much as I could, and I did learn some new skills, such that I can honestly say \"I'm detail-oriented, motivated to finding the right solutions to produce high-quality work\".\n\nI'm not 100% back, but back enough; is saying that \"I had some health issues that required my attention, but nothing will impede me from working\" an appropriate answer? I don't want to be needlessly open or coy. Or should I say something \"it's just taken a while to find appropriate positions and to move along with interviews\"?\n\n3) I already had one application for a major-ish national bank in the US where the salary band expectation was requested (and it was an obligatory answer). Glassdoor gave an estimate. I went one band above, because, well, I don't want to be low-balled with a minimum of $4000 debt plus interest (if not $10000 more if the administration doesn't forgive any in the end). Is it really just a roll of the dice with this? (The estimated band was 57k to 74k; I'd rather be at the upper end of that, of course.)\n\nAs an optional follow-up, the application asked about total compensation. I'm clueless. I live in a state with no income tax, so if I was hired (the position is remote, although there are two other jobs in states with income tax, one of which I'd take if offered although I don't really want to move, and I'd consider the other) so I personally am happy maxing salary; I do need to get a move-on with something that can go towards retirement and other investments, even small (there are some mutual funds that need to be transferred to me and perhaps other assets). Any advice here is welcome.\n\n&amp;#x200B;\n\nThanks again for reading and for your counsel.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/12yrywk/some_questions_searching_and_interviewing_after_a/",
      "comments": []
    },
    {
      "title": "Senior Manager (IT) Interview tips?",
      "body": "I'm currently a manager in a large IT firm and have been stagnant for the past 8 years. Would like to jump ship to a senior IT Manager (Full Stack hands on experience  including Cloud with long experience in managing 1-2 teams). \n\nBut I'm clueless as to how to start prepping. Googling helped a bit but nothing specific. Looking to target larger financial firms with broad IT diviisions like Citi/Bank of America etc.\n\nAny suggestions on where do I begin and what can i do to prepare?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/sotoyp/senior_manager_it_interview_tips/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Today I have an internship interview with Bank of America, do you have any advice?",
      "body": "Like I said in the title i have an interview today and I really don't know what to expect because this is my first time doing something like this. I think it is with a campus recruiter and supposedly I'll be participating in two 30 minutes interviews. Also I am quite nervous because English is not my primary language. Any advice?\n\nThanks in advance.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/y2x67h/today_i_have_an_internship_interview_with_bank_of/",
      "comments": [
        {
          "body": "I know it’s late but did you manage to get an offer?",
          "score": 1
        },
        {
          "body": "I have Fall Superday on Thursday with BoA\nI’m so nervous and I really need this.\nAny advice and tips for me?",
          "score": 1
        },
        {
          "body": "Be calm and clear. Good luck",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview for Bank of America UK apprenticeship",
      "body": "I have a Technical and Competency based Interview for the Bank of America coming up, any tips or advice would be greatly appreciated.  It’s for an apprenticeship in Investment Operations.\nCheers",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1l6gmrb/interview_for_bank_of_america_uk_apprenticeship/",
      "comments": [
        {
          "body": "For the technical side, they'll likely ask about financial markets basics, investment operations processes, and potentially some regulatory knowledge depending on the role's specifics. The competency portion will focus on behavioral questions using the STAR method - they want to hear specific examples of when you've demonstrated teamwork, problem-solving, attention to detail, and handling pressure. Since it's an apprenticeship, they're not expecting you to know everything, but they do want to see genuine interest in finance and evidence that you can learn quickly.\n\nThe key is being authentic about your experience level but showing enthusiasm for the industry and the learning opportunity. Research Bank of America's recent news, their investment operations division, and be ready to explain why you chose this apprenticeship over university or other career paths. They'll probably ask about times you've dealt with complex information, worked in teams, or handled mistakes - have concrete examples ready even if they're from school projects, part-time jobs, or volunteer work. I'm on the team that made [AI interview helper](http://interviews.chat), and it's particularly helpful for practicing those tricky competency questions that banks love to ask, so you can work through your STAR responses beforehand.",
          "score": 1
        }
      ]
    },
    {
      "title": "BoA Global Risk Development Summer Analyst Program: SuperDay Interview + Other Questions",
      "body": "Hi all-- as you can tell from the title of this post, I have an upcoming interview with Bank of America within the Global Risk Development Internship Program. I wanted to ask, if anyone had past experience, what questions should I expect in the interview? I did research, and a lot of the questions seem to be behavioral based with some technical questions here and there. If anyone could comment on advice or tips ahead of this interview I would greatly appreciate it! Also, with the way the program is structured, how do they determine which of the 7 teams across the types of risks you will be assigned to? For some context, I am majoring in Risk Management/Insurance so I am not familiar or well versed on the financial side of the industry, but more on policy / compliance. From my previous internships I want to say I have somewhat rather extensive experience in government affairs and legal/regulatory environments on the insurance side. \n\nFor those who’ve interned here, how are locations assigned? I know it’s mostly based on current openings and business needs, but I’m worried about finding housing if I’m placed somewhere other than the site where I already have secured housing. If you’ve been through this, did your existing housing/preference get considered, when did you find out your placement, and was any housing assistance offered if you were assigned elsewhere?\n\n Please let me know, and again, any information will be helpful!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1ouusn0/boa_global_risk_development_summer_analyst/",
      "comments": [
        {
          "body": "For your interview, focus on the STAR method for behavioral questions, and be ready to discuss policies and compliance from a risk management lens. For team assignments, they typically align talent with business needs, so highlighting relevant skills during the interview might influence your placement. Regarding location, while there's a degree of openness, preferences are sometimes considered if shared early; however, flexibility is expected. Often, housing assistance is limited, so plan accordingly.",
          "score": 1
        },
        {
          "body": "On the SuperDay, expect mostly behavioral plus light technicals around risk concepts and why BoA; mine at a BB had probes on model risk vs operational risk, a time you challenged a control, and how you’d assess a new regulation’s impact. What helped me was building 68 STAR stories tied to risk themes and doing timed 90s answers with Beyz interview assistant. I also skimmed BoA’s 10-K risk factors and could speak to CCAR culture and risk appetite in plain English. For placement, we ranked preferences and got matched to teams by manager fit and headcount; I heard 23 weeks post-offer. Locations were similar: preferences noted but business need first, and relocation support depended on distance and org budget. Be ready to explain your insurance/regulatory angle as a strength for policy/compliance heavy teams.",
          "score": 1
        },
        {
          "body": "Hello, I recently had my superday last week. Did you hear anything yet?",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Bank of America Strategy and Management Analyst Summer 2025 Internship ",
      "body": "Hello, I currently have an interview coming up with bank of america for the strategy and management analyst summer program and would greatly appreciate any insights on the interview process. There is a case portion of the interview and would love some advice on how to prepare for this and some examples of questions they might ask. Thank you!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1gm0z52/bank_of_america_strategy_and_management_analyst/",
      "comments": [
        {
          "body": "Have the same interview and was wondering the same? Did you have any updates or tips",
          "score": 1
        },
        {
          "body": "any updates on this? I cant find anything about the interview",
          "score": 1
        },
        {
          "body": "any updates on this? I cant find anything about the interview",
          "score": 1
        }
      ]
    },
    {
      "title": "BofA strategy &amp; management analyst interview",
      "body": "Hey! I had my super day for the Bank of America strategy and management analyst last week 11/13. Anyone hear back or know when they usually release offers? Thanks",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1gug920/bofa_strategy_management_analyst_interview/",
      "comments": [
        {
          "body": "Is this for the full-time program or summer analyst?",
          "score": 1
        },
        {
          "body": "I just got an offer for the analyst position a couple hours ago",
          "score": 1
        },
        {
          "body": "Hi, I hope your interview process went well! I'm having my super day later this week for strat &amp; mgmt as well; I was wondering if you had any tips for the case portion? I'm wondering if I should be prepping with several practice cases everyday or if that's not necessary",
          "score": 1
        }
      ]
    },
    {
      "title": "I’m anxious and extremely nervous about these two jobs",
      "body": "After multiple months of trying to land a job out of University, i’ve been pretty unsuccessful. I was working at a large tech company on contract until Dec 2023, and then began working part time at a bank in order to make ends meet. \n\nAfter multiple applications, I managed to get 4-5 interviews that led nowhere. However, I have recently been interviewing for marketing roles at Company A &amp; Company B. Company A is a large public service firm, whereas Company B is a small property management company that’s locally based, but works across North America.\n\nI finished my last round of interviews with Company A on Tuesday of this week, and am now waiting for a response next week if I got the job. During my last round with Company A, I was told that another senior manager would be joining the interview, as I was being considered for not only the role that I initially applied for, but another role. After completing my initial interview with the director and senior manager for the initial role I was applying for, the other senior manager joined the call for approx 5-10 mins at the end of my interview, where she asked me 3 questions and then parted ways. I was told that the other senior manager may want to have an additional interview or I would be provided a final decision. \n\nAs for Company B, I completed my second last round on Wednesday of this week, and have my final interview with the CEO and COO (alongside the CTO, who i’ve been interviewing with this far). During my interview on Wednesday, the CTO assured me that i’m his top choice and would love to see me work for him and that this final round is more of a formality. \n\nMy dilemma is that i’m anxious that Company A doesn’t want me or that i’m not their top pick. I sent the recruiter at Company A an email after my interview to get a prospective timeline and was told the following. \n\nThe Email I sent: \n“I hope you're doing well!\nI wanted to extend my heartfelt thanks to you and (other recruiter’s name) for all your help in setting up my interviews for the Marketing Specialist position. I really appreciate the support.\n\nI was wondering if you could share the timeline for when a decision might be made about the role, as I'm also exploring a few other opportunities right now. Additionally, I'd love to send a personal thank you to (Director + Senior Managers) for their time and insights during the interviews. Could you please pass along my gratitude to them or share their email addresses if that's possible?\n\nThanks again for everything!” \n\nThe Response: \n“Hope you are doing well too.\n\nThe Marketing team has other interviews this week, so we expect a decision by next week. Please keep us updated on the progress of the other recruitment processes you are participating in. \n\nFeel free to send us the note, and we will make sure they receive it. 🙂”\n\nSo to ease my anxiety, I was going to let them know that Company B offered me a position and was going to provide them a deadline of when I needed to let them know, to help speed up the process of whether they want me or not. I asked some folks, and they said no and to wait it out. But honestly I can’t sit through this anxiety all weekend long. \n\nCompany A is my first choice and is my dream company. So I really want the job. I wouldn’t mind Company B, but don’t really want it as much as Company A.\n\nWhat should I do? Should I email the recruiter to let them know about the “fake offer” or wait it out?\n\nAlso, was it a good sign that they are considering me for two roles without my knowledge, or is this a bad sign? \n\nAny help would be appreciated and thank you for reading this far if you did! \n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1enpxdn/im_anxious_and_extremely_nervous_about_these_two/",
      "comments": []
    },
    {
      "title": "Commercial Credit Analyst I interview",
      "body": "Hi,\n\nI have an interview with Bank of America for a Commercial Credit Analyst I position. Can anyone tell me what questions will be asked? I get super nervous anytime I'm interviewing so I would appreciate if anyone knows what questions will be asked so I can prepare myself. Thank you.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1b9tdzi/commercial_credit_analyst_i_interview/",
      "comments": [
        {
          "body": "Better luck if you look on Glassdoor",
          "score": 1
        },
        {
          "body": "Hi, I’m interviewing for this same position soon at BofA. Can you tell me what questions you were asked?",
          "score": 1
        },
        {
          "body": "Has anyone heard back yet",
          "score": 1
        }
      ]
    },
    {
      "title": "BofA Strategy &amp; Mgmt Interview",
      "body": "Does Bank Of America do case interviews for their strategy and management internship role? How does the interview process go for that role? I have a final round coming up and I’m not sure what to expect.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1anjq4q/bofa_strategy_mgmt_interview/",
      "comments": [
        {
          "body": "Hi, I have a case interview for this position coming up, do you have any tips!",
          "score": 1
        },
        {
          "body": "Hi! What was the process like for you?",
          "score": 1
        },
        {
          "body": "Hey- would you mind sharing specific about the case?? In all honesty I’m pretty lost on how to prep for these and narrowing my scope would help a lot. Best of luck to you and us all!!..",
          "score": 1
        },
        {
          "body": "If anybody has any information about the case study interview and how I should prepare for it I would greatly appreciate it. I have an interview in less than a week and would like to narrow my scope of focus when preparing for the case interview.",
          "score": 1
        }
      ]
    },
    {
      "title": "Vindication!",
      "body": "So, I was invited to interview! I googled the street address and did the street view of it. It had the name of the bank I was separated from. At the interview,  I asked how long they have occupied the building. It was formerly a branch of  my former bank. Even if I don't get the role, I can say with certainty that I was let ho due to RIF/redundancy. So, it grew its accounts through acquisitions, and  then divested itself of its buildings/leases. The branch across from my subdivision is now a Community America CU.  ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1e0ohae/vindication/",
      "comments": [
        {
          "body": "Uh, what?",
          "score": 3
        }
      ]
    },
    {
      "title": "Bank of America Internal Auditor Case study",
      "body": "Hey I have a phone call interview with bofa which includes a case study. Has anyone had this before are there any tips or details you can give me ? ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/179c2fb/bank_of_america_internal_auditor_case_study/",
      "comments": []
    }
  ]
}