{
  "company": "blackrock",
  "post_count": 24,
  "exported_at": "2026-01-18T17:44:53.262Z",
  "posts": [
    {
      "title": "Can I still get an intern offer even though I didn't finish every coding question?",
      "body": "Exactly what the title says.  \n  \nI had my Superday for Blackrock Financial Engineering a few days ago and I think I did good for the most part. But for the coding round specifically, I had to solve two questions in 35 minutes. After talking to the interviewer for 10 minutes, I actually started. I was able to solve the first question in around 15 minutes, but then I got to the second question with not that much time. Additionally, I had to a specific python library and due to the amount of time, I started to panic (internally) and forgot some of the syntax. I explained to the interviewer what I wanted to do (I was right logically), but I took a decent amount of time remembering the exact syntax even with some hints. I was able to finish the first part but was unable to get to the second part and bonus. How cooked am I considering I did well on the probability/stats and behavioral rounds?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nmhvp3/can_i_still_get_an_intern_offer_even_though_i/",
      "comments": [
        {
          "body": "Nobody has the answer. Every company has different criteria.",
          "score": 3
        },
        {
          "body": "I don’t want to dishearten you, but as someone currently hiring developers, testing plays a big role in our hiring process. Many people can talk the talk, but can’t deliver in practice. At the end of the day, only the hiring manger can tell you for sure, but if it were me, it would rank you below anyone able to complete the task within the allocated time period who also checked multiple boxes.",
          "score": 3
        },
        {
          "body": "Probably screwed, gonna agree with the other person. They'll go with the people that answered everything right. Especially at a big and well known company like blackrock",
          "score": 1
        },
        {
          "body": "Check DM!",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview with BlackRock for an analyst position, any suggestions, tips, advice from past experiences? ",
      "body": "I am a little rusty on my finance, any suggestions of books/articles to look over to prep? It's been 5 months btw and I am seeing much better luck this month, so for my fellow unemployed finance majors keep the faith! Any help is much appreciated.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/178ddl/interview_with_blackrock_for_an_analyst_position/",
      "comments": [
        {
          "body": "Quit while you still have a soul. Finance degrees are worse than ambulance chasers. All you do is perpetuate debt-slavery, produce no work or service, and receive nearly half of all corporate US profits.\n\nBloodsuckers, all of you.",
          "score": 1
        }
      ]
    },
    {
      "title": "Re: java software developer for blackrock",
      "body": "Hey everyone, I need to prepare for a Blackrock Java development interview on Monday. Besides LeetCode, what other resources should I be looking at? Thanks.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1e1fxlo/re_java_software_developer_for_blackrock/",
      "comments": []
    },
    {
      "title": "BlackRock Operations Analytics/Data Science Internship Interview Advice?",
      "body": "Does anyone have advice for this role? I did not apply for this position but got invited to a superday for it because my skills were \"well-aligned\" with the position. I know next to nothing about ML/NLP (two of their \"required\" skills), so I'm kind of afraid I'm going to fail the interview.\n\nThere seemed to be nothing on glassdoor about this position or interview information.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/5rrx4o/blackrock_operations_analyticsdata_science/",
      "comments": [
        {
          "body": "Sometimes the skills listed on job postings are a wish list of things. You don't have to be an expert on everything they list, unless they're specifically asking for applicants with X years of experience with Y.  Best of luck! ",
          "score": 1
        },
        {
          "body": "The software engineering full-time role consisted of four interview. Two tech VPs (basically senior role) with one  going down a list of Java and spring questions that were straight out of a textbook and the other doing a whiteboard coding question. Then there were two management vp asking behavioral questions.\n\n\nI assume for a data science role you can replace the Java/spring/whiteboard portion with statistics and probability questions.",
          "score": 1
        }
      ]
    },
    {
      "title": "I still have no interviews. Graduated two months back. All of my friends have offers :(",
      "body": "Few weeks back , I posted a thread here on how I wasn't getting any interviews. People here asked me make a few amends to my cover letter and resume. \nI had applied to 150 different companies back then and had one onsite from Google and one phone interview from dataminr. \n\nI made some changes and applied to some 50 more companies after that. Each with a personalized cover letter. Cold emailed around 15 recruiters . \n\nOut of 50 I have had one phone interview at blackrock. \n\nI got one response from a cold email I sent to Philips recruiter who wanted to discuss about positions she had available but that was last Friday and I haven't had a response from then. \n\nI do need visa sponsorship but that will be after 18 months of OPT but that is not a big deal because most of my friends have been getting interviews and most of the applications don't even ask if I will need visa sponsorship . \n\nI have a decent internship on my resume that paid over $3x/hr . \n\nMy resume : http://m.imgur.com/NwEy2wt\n\n",
      "subreddit": "cscareerquestions",
      "score": 38,
      "url": "https://reddit.com/r/cscareerquestions/comments/3byp6a/i_still_have_no_interviews_graduated_two_months/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 31
        },
        {
          "body": "Yes, the visa sponsorship is the reason. ",
          "score": 12
        },
        {
          "body": "Did you mention in your cover letter that you do not need H1b sponsorship for another 2 years ? It is almost unheard of that Indians (with decent cv) not getting jobs after MS , due to this reason. \nAll companies are aware that if you have an MS, it should not be a major issue.\nTry creating a github with your projects , and get in touch with recruiters on linkedin\nI have found that 1 referral matters far more than your resume on a company's website . you do have a strong linkedin profile right? ",
          "score": 3
        },
        {
          "body": "Wait did you take 3 years to complete your master program ? That seems like a lot considering you didn't have any internship exept a summer one. Your CV contains an unexplained gap which might scare recruiters.\n\nMoreover, you list so many technologies, it simply is not realistic for someone with nearly no work experience to be confident in so many different languages and ecosystems. You should delete the stuff you don't really know and highlight where your expertise is. I have seen many people only listing C++ and Python in their resume get jobs at major tech companies: they were really good with it.",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 8
        }
      ]
    },
    {
      "title": "Software engineer interview with BlackRock",
      "body": "Hi Guys.\n\nI solved some problems on HackerRank and am now invited for a hiring event at BlackRock. Anyone have experience with their hiring events or interviews and wants to share? Thanks.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/5splge/software_engineer_interview_with_blackrock/",
      "comments": [
        {
          "body": "Literally had my super day earlier today. Pm me if you have questions ",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Had my onsite in October for full-time SE. 4 rounds of interview, 2 of which were technical. They seem to focus a lot on Java. Gave the interview on Friday, got the offer on Monday.",
          "score": 1
        }
      ]
    },
    {
      "title": "BlackRock Tech Internships",
      "body": "Hey everyone. In April I applied for the Tech Operations internship at BlackRock at the Atlanta office. Today, they offered me an interview for the Princeton office.\n\nThere is not much info online about this role, so I wanted to see if anyone had any insight. Is BlackRock a good place to work? Will they let me negotiate location at all? Not really sure I want to be located in suburban NJ. What is the compensation like?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ec4h8e/blackrock_tech_internships/",
      "comments": [
        {
          "body": "if you want to sell your soul yeah it's a good place",
          "score": -1
        }
      ]
    },
    {
      "title": "Thoughts on CGI",
      "body": "Been grinding leetcode and have interviews lined up with Goldman Sachs, Expedia, McKinsey, and Blackrock. Have an offer with CGI for 105k. It seems a little low as I have over 6 yrs of experience. Any thoughts on how good would CGI be on my resume? Appreciate any help. Thanks in advance.",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/w43zj8/thoughts_on_cgi/",
      "comments": [
        {
          "body": "What’s CGI?\n\n\n&gt;\t Have an offer with CGI for 105k.\n\nYou need to add in location.\n\nHowever, for 6 YoE in the US, it is low in almost all locations.",
          "score": 5
        },
        {
          "body": "I worked at CGI in the US for a bit over a year as a new dev, I can answer some questions but no idea if it'll correlate to the Canadian branch. \n\n\nAlso they underpay pretty much everyone since they're not very competitive (again, in the US). I was able to negotiate 86k + 2k signing (no relocation etc) as a new grad in their Arlington VA office which is near DC and has a high CoL.",
          "score": 6
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "I have a non-cs job offer, what should I do?",
      "body": "As an international CS graduate student in the US with a BTech in IT, I am facing a difficult situation and seeking advice. My interests lie in data science and computer vision, but my math skills are not as strong as I would like them to be. Recognizing that building a solid foundation will take time, I have been seeking job opportunities in software development, leveraging my existing programming skills and one year of experience. Additionally, I am working on a master's thesis related to deep learning and computer vision, with plans to graduate in May 2024.\n\nCurrently, I am looking for a summer internship in software or machine learning. Fortunately, I have been offered an internship position at Blackrock Inc as a Summer Analyst, which is a nine-week program with decent pay. While I do not have any experience or knowledge in finance, aside from general knowledge, I was able to secure the position due to my strong python and SQL skills. However, given my lack of interest in finance and my shortcomings in this area, I am uncertain about how to move forward with my career goals.\n\nHere are some questions that have arisen for me:\n\n1. I've applied to 150+ software-related jobs but haven't had any luck getting interviews. If I do manage to score some interviews, should I go for subpar compensation or advancement opportunities, or take a non-CS job offer instead?\n2. When I start applying for full-time jobs in the next recruitment cycle, what will recruiters think when they see my work experience as a summer analyst?\n3. How can I increase my chances of getting software-related interviews and securing a job with better compensation and advancement opportunities?\n4. Am I spending my time and efforts in the right way, considering my interests and career goals?\n\nCould you do me a favor and answer one or more of the questions? Your input would be super helpful and I'd appreciate it!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/11qsuxs/i_have_a_noncs_job_offer_what_should_i_do/",
      "comments": [
        {
          "body": "I wouldn't quick to dismiss an offer from a large financial company, especially if they would provide a visa pathway if you get a return offer. Especially since you are interested in data stuff, isn't that what this is?",
          "score": 9
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Blackrock HackerRank Coding Assessment",
      "body": "Hey! I was recently approached by a recruiter for a possible Java position at BlackRock. He immediately sent me a Hackerrank link for a 90 minute coding assessment challenge. He hasn't responded to any questions about what kind of a test (MCQs or a single programming question with subparts or multiple programs) it is or its difficulty level; neither has he shared any useful resources.\n\nHas anybody taken the coding assessment recently? If yes, what can I expect int he actual assessment? also what would you say is its difficulty level on 0-10 , 10 being Amazon/Google ?\n\nThanks a ton!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/d5lyo8/blackrock_hackerrank_coding_assessment/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "If you click on the hackerrank link it’ll tell you the number of questions. It doesn’t automatically start the challenge if you just click on the link, so check it out.",
          "score": 2
        },
        {
          "body": "Let me know how it goes, I was approached for Quantitative Software Developer position.",
          "score": 1
        }
      ]
    },
    {
      "title": "BlackRock vs. C1 Software Engineering Internship?",
      "body": "Hey everyone, if I have an offer for Capital One as a software engineering intern (TDP), is it worth it to go through the interview process with BlackRock? As in, is BlackRock considered more prestigious, or are they both looked at the same?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/9vep9g/blackrock_vs_c1_software_engineering_internship/",
      "comments": [
        {
          "body": "“Hey guys, I have an opportunity, but I have chance to get 2 opportunities. Would having two options be better than one?”\n\nThere is literally zero downside to having multiple offers. I am not sure why you wouldn’t want that. \n\nThe name of the company you intern with rarely matters. Exceptions are the big tech giants.",
          "score": 9
        },
        {
          "body": "BlackRock is a prestigious company. C1 is a pretty average tech opportunity.\n\nC1 is often considered silly because it's a bank that thinks it's a tech company. Its swes do very meaningless work and the company hires many many people with lower standards than many other tech companies. The illusion that it does well in the tech space is propagated by how much it overpays employees and the hip new buildings it creates for its swes.\n\nC1 can be looked at as a gateway into more prestigious opportunities. But it's really not that competitive of an option.",
          "score": 6
        },
        {
          "body": "BlackRock &gt;&gt;&gt;&gt;&gt;&gt; C1",
          "score": 3
        },
        {
          "body": "I interned at BlackRock this past summer. I thought it was pretty cool.",
          "score": 1
        }
      ]
    },
    {
      "title": "Thinking of a second masters... Wanted to know if it's a good idea.",
      "body": "I am a MS CS student here at Rutgers, and my GPA is very bad. It's not because, I am bad at programming but it's because most of the CS classes that I am interested in taking are very mathematical/theoretical. I feel like I need to take a few maths/statistics classes to be able to better understand these classes.\n\nThis summer I will be interning at a bank and people who interned there last year told me that they mostly will give FT jobs to everyone who interns there. Some 6 or 7 people interned there last year and everyone got a FT offer. \n\nNow I am happy with the bank, it's a good company, people are friendly, I get to work on Scala, there are some teams that are doing cutting edge work and I might get to work with them too, but it's not a technology oriented firm and I feel to be truly be good at it, I need to know a little bit about finance/economics/commerce or something. I feel it will limit my options in the future.\n\nThis year, when I was applying for internships,  apart from this lousy internship I did in India I had 0 work experience and also had a bad GPA, so I got very few interview calls. But now I have this internship and I will also be TA'ing an intro level course which can give me some leverage I believe. Besides, now I know which companies will definitely call people from my college for an interview so I will make sure to apply to them(I missed a lot of companies cause I didn't even knew they existed, like Blackrock, Cray. I was also too late in applying to Amazon, so I can try my luck again this year).\n\nSo to further my job prospects, I am thinking of staying back another semester in college and doing a masters in stats. My reasons are as follows.\n(1) My college's stats department is similarly ranked as CS, but it is relatively easy to get good GPA in stats, so atleast one of my two degrees will have a good gpa(Could some one tell me if this would give me any advantage?) Also two of stats courses count towards CS so I will have a chance to improve my CS gpa too..\n(2) I am extremely interested in machine learning, but I am terribly sucking at it cause I don't have a firm foundation in maths, I am hoping that a stats degree could serve as a bridge course to make me proficient in maths and help me get better at ML.\n(3) With a stats degree, I can target way more jobs then I am currently able to(Can someone confirm this?).\n(4) With two internships(including next year's internship, if I get one) I will be in a better position when I start applying for full time jobs.\n\nWhat do you guys think? Also wanted to ask any recruiter out there. If you see someone with a shitty CS gpa but a goodish Stats gpa, would you call him for an interview?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/4lrsq6/thinking_of_a_second_masters_wanted_to_know_if/",
      "comments": [
        {
          "body": "&gt; It's not because I suck at programming but I suck horribly at any theoretical/mathematical stuff.\n\n&gt; With a stats degree, I can target a wider job market than I am currently able to\n\nYou'd need not to suck \n\n",
          "score": 2
        },
        {
          "body": "I think stats is an amazing thing to pair with CS, is super useful and I think a strong tie in with certain kinds of ML. If you think it's just a matter of getting course work and not fundamentally challenging for you to learn math/stats I say it sounds like a good move. If you do a research based MS in stats you could make it ML focused.",
          "score": 1
        }
      ]
    },
    {
      "title": "Blackrock post superday interview",
      "body": "Just wondering if anyone here applied to BlackRock roles in the Middle East (Riyadh, Abu Dhabi, Dubai, etc.) and has already had their Superday.\n\nHave people started receiving offers or updates yet? And for those who did hear back in past cycles, how long did it usually take after the Superday for Middle East locations?\n\nI couldn’t find much online that’s specific to ME offices, so any data points would be appreciated.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1q8hi6g/blackrock_post_superday_interview/",
      "comments": []
    },
    {
      "title": "failed 4 on-sites, looking for some insights",
      "body": "I currently have a Dev job. I graduated with an undergrad in Comp Science in 2015. After 2 years working in my current company, I'm looking around now. And from Dec, 2016 to now, I had 4 on-sites. The reason that it's spread apart is because... the phone interviews+ online coding challenges take time. So to get to on-site, it usually take 1 month. And also I'm not actively applying is another reason.\n\nAfter my most recent failed on-site (which happened 2 days ago), I think my issue is.... the company see me as an experienced hire (which they are correct that I'm not a fresh grad). But my past 2 years at my current company, people see me as junior dev. Give me a lot of fragmented tasks. And a lot of front end task. And my current team operates in the way where the DBA does DB. The middle tier guy does middle tier. The tester tests. so even when I ask 1 teammate, the teammate will reply \"I don't know how that parts works. because ABC works on it.\"\n\nWhen I go onsite, I think I do well in the coding/data structure questions in the morning session, but when the afternoon comes, and they start asking me System Design/ Architecture/ Testing questions, I begin to show weakness. \n\nAny advice to fix this problem where companies see me as an experienced hire, but I'm not exposed to those system design processes at work?  Or maybe my assumption is totally off?   \n\n(The reason that I think my coding skills is relatively okay is because I do rounds of phone interview where the person can see what I'm writing, and I pass those rounds.  Including Google Phone interviews.)  Looking for advise because I think the longer I stay at my current firm, the more experience other firms expect. But my current team doesn't really help me to understand the bigger picture. \n\nFor people curious of which 4 on-sites that I failed: google, blackrock, 2 sigma, goldman. \n\n(edit: I tried to have phone conversations with start ups, they normally end with \"we are looking for someone who can do C# or a particular language. And I don't think I'm arrogant because apparently failing at all these on-sites doesn't boost self confidence. And makes me question whether I should consider a career change.)\n\n(edit 2: Many people mentioned that these 4 places are very hard. And for google, 2 sigma and goldman, I think they are right. Blackrock was different. They were asking a lot of definition/ regular expression questions. Google was all algorithm type of questions. didn't ask any system design/ OOP after 5 rounds. Purely from personal experience, which might not be true for everyone.  The level of difficulty/ comprehensive assessment:  2 sigma &gt; Goldman &gt; Google &gt; Blackrock )",
      "subreddit": "cscareerquestions",
      "score": 53,
      "url": "https://reddit.com/r/cscareerquestions/comments/7gxorj/failed_4_onsites_looking_for_some_insights/",
      "comments": [
        {
          "body": "When it comes to general somewhat high level system design concepts I’ve found reading blogs to really help. A lot of companies and senior devs go in depth about how changing x y and z in such and such part of their code, improved this and that feature by n%.\n\nWhen you read a bunch of these you start getting a sense of how people smarter and more experienced than you formulate how to make their system better.",
          "score": 25
        },
        {
          "body": "i think 1-3.5 years of experience is one of the hardest time to switch between jobs. You're not a new grad/jr engineer anymore, so you can't apply to those jobs and you aren't a senior engineer. i'd suggest studying up on system design/scalability type of questions. i think the system design primer on github is sufficient enough for most interviews. most companies will also want to hear about leadership type of experience (leading teams, mentoring, distributing tasks, etc), so work on those as well. ",
          "score": 25
        },
        {
          "body": "You're interviewing at four of the most difficult interviewing companies. A fail rate of 100% at all of them is nothing to be ashamed of. You probably just need to aim at mid-high tier companies, instead of the tippy top of the \"desirable companies\" mountain. ",
          "score": 23
        },
        {
          "body": "Why not prep system design questions? There are videos out there on it, tutorials, blogs. It's something you can prep for. ",
          "score": 6
        },
        {
          "body": "I've been through similar. I was \"senior\" at my last role with 4.5 years experience, but \"senior\" varies **so widely** from company to company. And on top of that, each company and role has widely-varying tech-stacks and needs.\n\nFor me, I'm great at product/software-engineering-process/testing/OOP/communication etc. I can lead an entire full-stack project from end-to-end and get it designed and shipped quickly and effectively. This leads to me be great at mid-sized B2B companies with business problems to solve using software.\n\nUnfortunately I am very-much-not-senior when it comes to algorithms, intense-scaling, devops, complex distributed systems, etc. We pretty much didn't need to use any of those things at my last two jobs and I didn't study CS. So I'm pretty solidly mid-level/unqualified at a lot of these larger or more tech-focused companies. They bring me in for senior-level interviews and it doesn't work out.\n\nFind the role that fits you. All the places you applied for are pretty high-prestige intense tech firms. If you are set on a big-name company, look for some specifically mid-level or your-skillset-specific postings (or a company with a generous and generic talent/onboarding pipeline) and scour glassdoor to find which of these companies has an interview process that you would thrive in.",
          "score": 6
        },
        {
          "body": "you can definitely prep for system design interviews. EPI has a decently sized system design section and there are resources like Grokking the System Design interview. These kinds of things give you the info in a nice digestible format, but if you look around there are tons of places you can learn from. by the way, what were the afternoon rounds at two sigma like?",
          "score": 2
        }
      ]
    },
    {
      "title": "Drug testing at BlackRock San Francisco (SF)?",
      "body": "Hi friends,\n\nBlackRock offered me a summer analyst position at their San Francisco, CA office in the software engineering department. I've seen a few posts (like 1 or 2) on Wall St Oasis about BlackRock testing hair, urine, and nails. Can anyone corroborate or discredit this claim?\n\n\nMy situation:\n\nI have until Friday, 2/24 to verbally accept the offer. I am interviewing for Qualtrics, Symantec, Twitter, and a company local to my school the same week. If I were to get an offer from Twitter, I would minimize the risk of ruining my Summer by choosing Twitter &gt; BlackRock, but my the Twitter interview is on Friday as well.\n\n\nMy drug usage:\n\nI've taken ecstacy 4 times over 2016, with my most recent dosing at 12/31: New Year's Eve. Between NYE and June is 6 months, and I know that urine and hair tests only test up to 3 months, but I'm worried about the nail test which can test up to 8 months' history. I'm not planning on taking any more drugs (that show up on normal tests - 2cb) for the rest of the academic year.\n\nI greatly appreciate any advice or input you all might have. Thanks for the help in advance! (Sorry about the throwaway, I'm probably being more paranoid than I really need to).\n\nAlso, are employers legally obligated to mention drug testing in the offer letter? Or can they just surprise employees on their first day of work with a drug test? I guess I'll find out if they mention it in the letter in a few days.",
      "subreddit": "cscareerquestions",
      "score": 18,
      "url": "https://reddit.com/r/cscareerquestions/comments/5urjbh/drug_testing_at_blackrock_san_francisco_sf/",
      "comments": [
        {
          "body": "Nearly all companies that drug test use the piss test. I've never even heard of anyone being nail tested. ",
          "score": 24
        },
        {
          "body": "&gt; Also, are employers legally obligated to mention drug testing in the offer letter?\n\nI'm not sure about this, but something you could do is ask a broader question along the lines of \"Are there any stipulations that might cause my offer to be revoked like failing a credit check (which is not unheard of for financial institutions), background check, etc.?\" They might explicitly state whether or not they do drug tests in an attempt to address common scenarios.",
          "score": 17
        },
        {
          "body": "Pull out your fingernails, problem solved",
          "score": 22
        },
        {
          "body": "I have only ever been drug tested for lowly retail positions.  In all of the software companies I've ever worked.... NONE have drug tested.  In fact... I recall in some management openly admitting to smoking g weed on occasion.  I'd personally find a drug test kind of demeaning at this stage of my career.\n\nThat said... I have heard of drug testing occuring on employees after they are hired if they've shown up to work acting erratically and tweaked out of their mind.  \n\nMoral of the story... Don't go to work high or drunk.  Most places don't test professional positions.",
          "score": 7
        },
        {
          "body": "Twitter interview first round or final round?",
          "score": 4
        },
        {
          "body": "Well there's not really much you can do if they decide to do a hair or nail test. I've never heard of a place that does because it's expensive and time-consuming. Mostly just urine test. \n\nAlso before you drop 2cb from you drug dealer get a test kit, and test it. I was very heavily involved in that lifestyle, last thing you want to do is take something and it's cut with methamphetamine and it show up on a drug test.  My best advice is not to do any of it. ",
          "score": 2
        },
        {
          "body": "give somebody else's fingernails. Nobody cares. Do some good work over there and they won't mind overlooking.",
          "score": 1
        },
        {
          "body": "I don't know what tests they use, but I have a friend working at a BR subsidiary and they do in fact drug test.",
          "score": 1
        },
        {
          "body": "Give them the nail of somebody else",
          "score": 1
        }
      ]
    },
    {
      "title": "Internship Search",
      "body": "Have applied to ~200 companies for internship and received reject from nearly 70 so far. I don't think I have a problem with my resume because I have got interview calls from Google, Mathworks and BlackRock. Google rejected me saying they had no projects to give me, Mathworks interview was bad. BlackRock went excellent but they rejected me. Don't know what to do. I don't know what I am doing wrong.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/f4ip4f/internship_search/",
      "comments": [
        {
          "body": "just curious, are you applying to anything other than Big N? Big N is saturated af, from what I have heard on this sub.",
          "score": 6
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "&gt; Mathworks interview was bad.\n\nIt would be helpful if you detailed what you thought was bad beyond just saying \"it was bad\".\n\n&gt; BlackRock went excellent but they rejected me. \n\nAgain, you really have to be more detailed than that. Otherwise we can't help you. Just because you thought an interview went well doesn't guarantee that you'll get the offer. Even if you did well on the technical portion, there are other factors, such as the behavioral portion, what their impression of you as a person is, and how many positions are still available, that all factor in to the final decision.",
          "score": 1
        }
      ]
    },
    {
      "title": "Thoughts on Implementation Consulting for a large asset management firm?",
      "body": "Hey everyone,\n\nI am currently in the interview process for an Implementation Consultant (IC) role with a large asset management role (think Blackrock, Vanguard, Fidelity). I was wondering if anyone has any experience and or opinion with this type of role within this industry sector?\n\nI have previously worked for a SaaS company doing very similar work (same title) so I understand what the functions of this role may entail. However, I just wanted to get some thoughts on IC type work within the financial area. Role seems like there will be work with various departments such as sales and product development, so possible lateral moves in the future? I currently have a technical background, but not coding heavy.\n\nAll answers will be appreciated!\n\nThanks!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/f2fgq4/thoughts_on_implementation_consulting_for_a_large/",
      "comments": []
    },
    {
      "title": "Made it to the Final Round Superday Interview for Blackrock -- Help :(",
      "body": "Hello!! I have final rounds with Blackrock this coming Thursday and want to prepare for it as best as I can. This position is for their accelerator program on Aladdin Wealth Tech -- Product Group.\n\nFor final round interviews, I’d assume that I should expect some technical questions in regard to their technology and some general coding questions, but my problem is I’m not a CS major and I barely know how to code right now so I’m not able to answer those questions fluently.\n\nIf you have interviewed with Blackrock for final rounds how did it go? What should I expect and how should I prepare? I know there will be 4 30 minute back-to-back interviews, but that's about it.\n\nPlease help and thank you!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/151sde5/made_it_to_the_final_round_superday_interview_for/",
      "comments": []
    },
    {
      "title": "Is it bad practice to continue interviewing and applying after one has accepted an offer?",
      "body": "I have an internship offer with Capital One deadlining soon. I was really impressed by Capital One when I went onsite, but personally I feel I can do better, especially when I have been busting my chops really hard to get the best offer I can. \n\nA lot of my friends have told me to just accept the offer and continue interviewing until I find a company I really like and then renege on the Capital One offer. \"They'd do it to you, you're hurting yourself if you're unwilling to do it to them\" they say. My parents are very straight-edge and disagree. \n\nThere has been many posts about this already, but I just wanted some insight into my own personal situation. I'm currently interviewing at Squarespace, Qualtrics, AppNexus and Blackrock and I'd take any of those over Capital One. The one advantage that Capital One has (except over Blackrock) is the exposure to finance since I want to be in fin-tech eventually.\n\nWhat are everyone's thoughts? Thank you very much.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/3tgit8/is_it_bad_practice_to_continue_interviewing_and/",
      "comments": [
        {
          "body": "It is just fine. Offers can also get rescinded with little or no notice. Employment generally is At Will - and it means exactly that. Also, competing offers allow you to bring more leverage to the table that you may not have in the first round of negotiations. \n",
          "score": -2
        }
      ]
    },
    {
      "title": "These job application questions are getting out of control. WTF is this???",
      "body": "",
      "subreddit": "jobs",
      "score": 984,
      "url": "https://reddit.com/r/jobs/comments/1dz2wqc/these_job_application_questions_are_getting_out/",
      "comments": [
        {
          "body": "BlackRock wants to make sure you will bury the body, no questions asked.",
          "score": 166
        },
        {
          "body": "[deleted]",
          "score": 1268
        },
        {
          "body": "even if you shot someone, you have one gun and there are 99 of them left, they could charge at you and take the risk some may get shot, but the rest could get away...if you wait till someone tries to escape you may have them going several ways so again if you shoot one, chances are the others can get off. I'd prob use the one bullet on myself so I don't have to deal with it",
          "score": 399
        },
        {
          "body": "\"Follow the written SOP for this dangerous role that I was trained on\"\n\nOutmaneuver the corporate fucks",
          "score": 197
        }
      ]
    },
    {
      "title": "BlackRock Superday Interview (Oct, 2025).",
      "body": "Hey guys! I just had an interview with (GPS) Global Product Solutions, New York, at BlackRock for an analyst position.   \n  \nI felt like I had some pretty strong interviews and met with some fantastic people. I conducted extensive research on the space. I read pretty much everything that was posted by the team (reports, podcasts/interviews from notable members, etc.) and was able to ask questions specifically regarding one of my interviewers, whose work I had read. I even had one of my interviewers respond to my thank-you notes. \n\nIt's been a few days, and after the interview, I've become even more excited for the potential opportunity, but I am definitely extremely anxious waiting for the results. The signs seem good, but the more time that passes, the more I overthink it...",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1ol4tpe/blackrock_superday_interview_oct_2025/",
      "comments": [
        {
          "body": "\n\nAnche io nella stessa situazione, ho fatto il superday a fine ottobre, una settimana dopo ho ricevuto una mail dicendo che dovevo attendere ma ad oggi ancora niente. So che qualcuno ha già ricevuto offerta per lo stesso ufficio e altri sono stati già rigettati quindi non so cosa aspettarmi.",
          "score": 1
        }
      ]
    },
    {
      "title": "Waitlisted after 2 interview rounds at BlackRock – what are my chances?",
      "body": "Recently went through BlackRock’s campus recruitment process. I cleared both rounds of interviews, they went really well — but I’ve been put on the waitlist.\n\nHas anyone here been waitlisted by BlackRock before and eventually converted?  \nWould love to know if they actually pick people from the waitlist and how long it usually takes to hear back.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nq7zbi/waitlisted_after_2_interview_rounds_at_blackrock/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Final Interview -- BlackRock Legal and Compliance Internship",
      "body": "I have a final interview for the BlackRock Legal and Compliance Internship Program. In the prep call for candidates who had final interviews in every division, they said the final interview would be more specific to the role. I was wondering if anyone had any insight into questions I might be asked regarding Legal and Compliance at BlackRock and/or behavioral questions I should prep pertaining to this role. Thanks.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/xm8os7/final_interview_blackrock_legal_and_compliance/",
      "comments": [
        {
          "body": "Hi!! I know this thread is from over three years ago, but I'm wondering if you wouldn't mind sharing your experience with the interview and questions you had to answer? Also I hope you ended up getting the internship!!!",
          "score": 1
        }
      ]
    },
    {
      "title": "How Much Should I get for Product Manager Role in BlackRock?",
      "body": "I’m currently in the final round of interviews for a tech role at BlackRock (India), and I’m trying to get a realistic sense of what to expect or negotiate for in terms of **CTC**.\n\nA bit of context:\n\n* Location: India\n* Experience: 4 YOE\n* Role: Associate - Product Manager\n\nI’d really appreciate it if anyone could share:\n\n* Typical CTC range for tech roles at BlackRock (especially in India)\n* Base vs bonus vs stock (if any)\n* Room for negotiation – are they usually flexible?\n* Anything else I should watch out for during final discussions?",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1nqfqdr/how_much_should_i_get_for_product_manager_role_in/",
      "comments": [
        {
          "body": "You should expect something in the ballpark of **₹25-30 lakhs CTC** (across base + bonus + equity) for a 4-year Associate PM role at BlackRock India.",
          "score": 1
        }
      ]
    }
  ]
}