{
  "company": "cisco",
  "post_count": 52,
  "exported_at": "2026-01-18T17:44:53.266Z",
  "posts": [
    {
      "title": "I'm a 'productive' SWE who's basically letting AI do all my coding. What am I doing to my career?",
      "body": "I'm in a bit of a weird situation and could use some perspective. During my undergrad, I got multiple job offers from Fortune 500 companies (Cisco, Oracle, IBM, HPE, HP, Juniper, Deloitte). But here's the thing - I turned them all down. I mainly took these interviews to test myself since I was planning to pursue my Masters anyway. And no, I wasn't an academic genius - my university was just really well-reputed, to the point where even people with basic programming knowledge got offers (though Cisco, Oracle, and Juniper were exceptions).\n\nOne of the main reasons I passed on these big companies was that I knew I wouldn't get much hands-on experience there. This has been confirmed by my friends who work at these places now - some of them haven't written a single line of code in a year despite having \"Software Engineer\" titles!\n\nFast forward to now, I've been working at a very good startup for two months, and I'm honestly confused about my situation. I used to be pretty good at programming and had some solid projects that caught companies' attention. But everything changed with the rise of LLMs in late 2022. These days, I find myself using natural language through Cursor/Copilot for even the smallest code changes. I haven't actually debugged anything in two years - I just let LLMs handle all the errors and bugs.\n\nSure, I'm getting what I wanted from working at a startup, but I feel disconnected from my code. The senior engineers are really happy with my performance - I push lots of PRs and maintain good code quality (I've gotten pretty good at prompting LLMs to get exactly what I want). But if someone asks me to explain my changes in detail, I often draw a blank. What's even more daunting is watching my senior engineers in action - these folks are on a completely different level. They can pinpoint what causes millisecond-level performance drops and even understand the internals of the libraries we use. I find myself wishing I had that depth of knowledge instead of just being good at AI prompting.\n\nIt doesn't make business sense to stop using these AI tools since they dramatically boost my productivity. But I'm worried about my long-term growth as a developer.\n\nLooking for advice on how to approach this situation early in my career. I know being completely dependent on AI isn't sustainable and might catch up with me eventually, but ditching these tools would tank my productivity.\n\n**tl;dr:** Used to be a decent programmer, now I'm just really good at using Cursor/LLMs. Getting praised for productivity but can't explain my code, while senior devs understand deep technical concepts. Afraid my AI dependency will hurt my career growth but can't afford productivity drop by not using it.",
      "subreddit": "cscareerquestions",
      "score": 333,
      "url": "https://reddit.com/r/cscareerquestions/comments/1h8icwz/im_a_productive_swe_whos_basically_letting_ai_do/",
      "comments": [
        {
          "body": "&gt;I haven't actually debugged anything in two years\n\nUnless all your bugs are simple null pointer exceptions and the fixes are all null checks I do not see how this is possible. I use and love copilot but it cannot solve bugs with any complexity.",
          "score": 296
        },
        {
          "body": "As a senior engineer who doesn't mind LLMs sometimes in my work I must warn you against this. The junior work is small tasks for you to learn. I use LLMs to do simple things so I can focus on more complex problems which LLMs are not good at solving at all. However, I recently had a junior who seemed to do well. So we tried get him to do more challenging tasks and were shocked when he failed to make any progression on them. He then admitted to using LLMs. Multiple studies have shown that retention is terrible when using an LLM. I literally use LLMs when I know exactly what I want to do but I can't be bothered to type it out.",
          "score": 646
        },
        {
          "body": "[removed]",
          "score": 75
        },
        {
          "body": "This post reads like a college junior's writing exercise about what they think their career will look like.",
          "score": 52
        },
        {
          "body": "I would definitely be concerned about my job security if it could be done almost entirely by AI. I use AI from time to time, but if I can’t write the code myself, how can I verify that the AI has done it correctly (cause it very often doesn’t). AI helps me speed up the boilerplate stuff I don’t want to write myself. But it doesnt even know where to begin if I wanted to code large systems or complex algorithms. \n\nThe way to get good at that is to practice and think through the problems, and absorb knowledge , there’s no way around it.",
          "score": 69
        }
      ]
    },
    {
      "title": "One hundred years of leetcode. Novel story.",
      "body": "I read this sub and it fascinates and astonishes me how a few corporations had shaped the modern perception of the hiring process for the entry level positions over the past decade. I have my own opinion, and please take it with some grain of salt. Also if you think that I'm shitting on leetcode and related platforms, and despise the brilliant people who can really do cool things about the programming - I apologize, it is not my intent ( and English is my fourth language, so I'm still learning it it my late 30-ies).\n\nI use leetcode and hackerrank and codeforces myself. I used projecteuler and some TopCoder stuff way before those fancy coding dojos were born. **For fun** - because I like puzzles. Many people don't. And I don't use leetcode etc for interviews, ever - for the reason that will be clear below.\n\nI work as a software engineer for almost 2 decades. I've been in the positions of junior dev, senior, principal, director of engineering, CTO. I hired and fired a couple of hundred people, and interviewed over a thousand engineers for various positions during my career. So I know something ( or at least I think so ).\n\nWhat I learned so far - it is extremely unlikely that the leetcode knowledge of some fancy DP-related problems or optimizations would drive the hiring decision. Seriously. I would literally kick ass of anyone who will assign an entry-level developer a task that requires serious algorithmic skills. **This is not how it works**.\n\nAs a junior dev you're supposed to **not damage the system beyond some control boundaries where the damage could be mitigated**. This is what it is. I've seen it way too many times when a smart guy thought that he's the smartest frog in a pond and tried to introduce some optimizations that would crash the integration testing environment ( of course if you have any ). Or tried to replace some \"old and obsolete\" code with a new fancy library that had some unforeseen side effects.\n\nYou won't be doing the actual feature/performance related coding from the beginning. Not for a couple of months, for sure. \n\nYour task would be to **fit the process**. If you can commit some refactoring of some test in a week - that's great. If you can build the project locally with no help, just using (incomplete) README.md and googling the build errors, then **fix** the build and **update that README.md** - I'll buy you a drink.\n\nAnd this should give some hints on what people like myself would really look for ( may be there are not many ones, but many of my colleagues and random people on various internet forums tend to agree ).\n\n* Git/(Subversion, maybe - but unlikely) - please don't force me to explain how that works. I would love to give you access to the repo and expect that you can setup SSH keys and checkout the sources without me or someone else handholding you around.\n* Build - please be familiar with some build tools that are appropriate to your language / platform of choice, like Maven, or SBT, or Gradle, or NMake\n* DRY - please, don't copy-paste. Or GTFO. I'm so sick of those rejected pull requests when people don't even bother checking what the static code analysis tells them about the code duplication. And I don't buy the argument that the function call would slow down things - we're seldom competing for nanoseconds, and it's not your call anyway.\n* KISS - forget about those fancy code golfing practices you used to impress your classmates. I will accept 10 lines of readable code rather than a line of ASCII art of macros. Also use the most readable implementation of the algorithm, even if it is twice as verbose or uses 10 bytes more memory.\n* SOLID - get some basics. Use interfaces and contracts. Define scopes. I'm not talking the design patterns here, yet - but some common sense! Strip off everything that is superfluous and you will end up with the neat set of the interfaces that will promote you to a mid-level dev way faster than any puzzles you solve.\n\nSo when I look at a resume for an entry-level or mid-level position, I'm looking for the signs that you know things from the list above. I will look at your github repo. I will browse the code and see whether you have tests. If you have TravisCI badge that actually shows that all the builds have passed - you already in shortlist for an phone interview. If you have clean interfaces that you use instead of implementations ( and you can explain why ) - you're 80% way down to getting the offer. I will ask you for, well, how to find the maximum in a sorted array to understand whether you really attended your classes. May be how to calculate N-th element of Fibonacci sequence. Or reverse that damned array. That's it.\n\nAnything else is pointless. It's unlikely ( but still possible ) that you will be developing a new high-efficient routing table for Cisco or may be throttling for Nginx. Most likely you will be building the systems that should be easy to maintain, easy to fix and easy to understand. And there's no leetcode involved.\n\nHope that helps someone to review their goals. FAANG is not for everyone, there are plenty of jobs available. And if you hate lettcode and kill yourself trying to solve 1000 easy, 150 hard and 1 super-hard one hoping that it will get you a dream job - chances are you'll just get frustrated and drop off.",
      "subreddit": "cscareerquestions",
      "score": 842,
      "url": "https://reddit.com/r/cscareerquestions/comments/arb7a0/one_hundred_years_of_leetcode_novel_story/",
      "comments": [
        {
          "body": "I think this is a healthy perspective, and it's great that you hire like this.  I agree that algorithm questions are flawed and don't test your real-work skills.\n\nYou may be making a straw man argument though.  The focus of algorithm questions (when they're asked and done right) is not whether or not the applicant will be able to apply serious algorithmic skills (given that the large majority of engineers at the big tech companies aren't applying fancy DP-related problems or optimizations), but more the balance between problem solving, communication, and general algorithmic thinking.  That being said, they're often not done right (see HackerRank challenges where you only pass when tests pass, for example).\n\n&gt; I will look at your github repo.   I will browse the code and see whether you have tests.\n\nAt what stage of the process are you looking through their code, and what size companies have you hired at?  The most common reason I've read for not doing that is that it just takes so much time and doesn't scale well.\n\nAlso, how do you view developers that don't have side projects?  ",
          "score": 198
        },
        {
          "body": "The maximum of a sorted array. Boy, this one’s tricky.",
          "score": 48
        },
        {
          "body": "[deleted]",
          "score": 134
        },
        {
          "body": "Why do I care if a new hire knows Git, or build steps, or DRY (something not much taught in a university)?  I can teach them all these things, if they can think, and if they can learn.\n\nSo I want to run an interview loop designed to try and get signal on whether a candidate can think and learn.  I don't really care at all what they already know.  It was all learned at one point, and there's a lot more they need to learn to work on our product.  Except for a few people we're hiring as domain experts, I want to know whether a junior dev can learn.\n\nI don't look at resumes at all -- they contain almost no useful information.  They're about the past; they don't tell me much about the actual projects: did they do it on their own, with a team, did they do the work or did someone else, was it done with quality or not, etc.  There's just not much useful info in a resume.  And I don't want to be in the business of hiring people who are good at writing resumes; I want to hire people who can think and solve problems.\n\nSo we're back to how do I interview for people who can think and solve problems.  I test this by giving them a system or class or data structure they've hopefully never seen, and then work with them through writing some code and working with this code.  Did they pick it up quickly? Did they get stuck on basic undergrad concepts?  Did they eventually understand what they did or was it still just throwing something against the wall until it stuck?\n\nI can teach good system design, because I have 15+ years experience with it, and an undergrad has none.  I don't expect a fresh college grad to know good system design, because it takes experience of making mistakes and learning from other's mistakes to learn that.",
          "score": 61
        },
        {
          "body": "That's you standard and it's cool. I'm sure most people here would agree that's it makes a lot more sense than leetcode puzzles.\n\nHowever, people who grinds on leetcode are not looking to be hired by YOU.  They are looking to be hired by Google, Facebook, Apple etc. and excel in leetcode puzzles is what it takes to get into these places.\n\nI am a senior engineer myself, and I'm pretty confident that I know my shit.  But I had to practice puzzles for ~2 weeks to get hired by Snapchat.  Of course I know this is completely useless in real work, but if it can get my pay doubled then it's totally worth the 2 weeks of my time.",
          "score": 15
        },
        {
          "body": "Big N does it so that's become the new meta, regardless of whether or not it works",
          "score": 18
        }
      ]
    },
    {
      "title": "I was laid off and I'm struggling to find a new job",
      "body": "I landed my first job at Cisco in June as a new grad and was hit by layoffs in early December. I've since been applying daily to as many companies as I can find &amp; haven't gotten so much as an interview.  \n\n\nAs part of the layoffs, we were also given access to a company that helps people find new work &amp; they rewrote my resume:\n\n [Google Drive link](https://drive.google.com/file/d/1e4Inprd4y0QEoY3K_CGw5KJuP-NawQ1k/view?usp=sharing)  \n\n\nI've redacted personal info, but this was based off of my old resume but it's not written by someone in the tech industry which means I definitely have room for growth here.  \n\n\nI'd appreciate any help or advice, thanks.",
      "subreddit": "cscareerquestions",
      "score": 262,
      "url": "https://reddit.com/r/cscareerquestions/comments/10706hp/i_was_laid_off_and_im_struggling_to_find_a_new_job/",
      "comments": [
        {
          "body": "In addition to what others have said, Cisco is not Present anymore right? I would add an end date unless you’re trying to fake still working there and hoping they dont care/they don’t do background checks",
          "score": 144
        },
        {
          "body": "This looks like the every resume I used to get from our offshore contracting vendor that gives us applicants we’ve caught lip syncing in interviews. Throw that resume in the trash.",
          "score": 173
        },
        {
          "body": "Holy shit this resume is terrible lol.  Dude, do not put “software development” as a core competency.  No shit. Don’t put “automation and testing”. No shit. \n\n\nGet rid of everything but languages and frameworks/dbs.  Don’t care about using an IDE. \n\nYour intro is too fluffy with redundant information.  Just have one sentence saying you’re an “ambitious engineer seeking entry level positions with interests in (a list of things)”.\n\nDo not brag about table stakes things like “ability to collaborate” or that you can “learn new skills quickly”.  \n\n\nGL!  Winter is the hardest time to find jobs.  I think in a month or two things will pick up. The last six weeks are basically the dead zone of hiring.",
          "score": 240
        }
      ]
    },
    {
      "title": "CISCO Systems Network engineer interview and Presentation",
      "body": "Hey guys, I have a network engineer interview with CISCO Systems, and I was wondering if anyone had that interview. I am a CS major and I don't really have any experience in networking but I am really interested in working in networking area. I have to give a 15min presentation on the topic they provided and I searched online and couldn't find any good information on how i should i prepare my presentation. Anyone idea on what i should include on my presentation? and also any tips on the interview would be really appreciated.  ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/3rafl1/cisco_systems_network_engineer_interview_and/",
      "comments": [
        {
          "body": "Is your presentation a problem or informative one ie are they saying 'give me a presentation on QoS' or 'what's the most efficient way to do XYZ'",
          "score": 1
        }
      ]
    },
    {
      "title": "Cisco interview process?",
      "body": "I have a software engineer interview tomorrow with Cisco. This is the second phone interview with the hiring manager this time. Anyone familiar with the interview process and have advice and tips? How technical is it? Any insight would be helpful. Thanks.  \n  \nEdit: I did search first before posting, but only found a post regarding the interview process for interns. https://www.reddit.com/r/cscareerquestions/comments/1tkkb4/whats_the_interview_process_at_cisco_like/",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/3rj5wy/cisco_interview_process/",
      "comments": [
        {
          "body": "I was here as an intern and saw the process other interns took and what full-times did, so I have a decent understanding of what it's like.\n\n&amp;nbsp;\n\n\nEvery team and department there has a different interview process. Cisco has so many different departments, products, and acquired startups, and each interviews you in whatever way they feel fit. Basically, the recruiters send your resumes to departments they feel you would be a good fit for, and then those people decide to interview you or not. Whichever team decides you will be valid will put you through their process. Me and 3 others were hired at the same time - I was put on a data platform, friend on a switch, and another on a server. All three of us had completely different interviews.\n\n&amp;nbsp;\n\nI had only one long interview (aside from screening) where we talked  about my background in databases and security for a bit, and then in depth about security protocols and their implementations for most of the time. I passed because of my knowledge on this subject. The friend working on switches was asked about specifics of C semantics, and some other stuff about sockets and networking. I'm not sure if he had to code or not, but from the sound of it, it wasn't too much. Last friend had a more traditional data/algos interview with it being almost all coding. For the full-time people it was relatively the same, just more in depth. Everyone had a different story.\n\n&amp;nbsp;\n\nSorry for the vague answer, but that's how I saw it. If you know what your team or department does, you can tailor it to that. I'm assuming since this is a second interview, you might have an understanding, but since you said it was with a hiring manager I'm not too sure. I wouldn't assume a hiring manager is not that technical though. I wasn't told what team I was interviewing for until the interview itself, but I also didn't ask. If you're doing low level stuff, security, networking, testing, hardware, expect relevant stuff. They're actually pretty good at pairing you on a relevant team, so just study what your last interview was about, and definitely about what your resume says about you, and you should be okay. Good luck!",
          "score": 5
        }
      ]
    },
    {
      "title": "Been looking for almost a year",
      "body": "The flair says New Grad, but I graduated in May of laat year. I graduated with two bachelor’s degrees, one in CS and the other in Japanese.\n\nI have no experience. No internships. I don’t have much of a portfolio. I have been applying to jobs for almost a year now. I’ve reduced my expected salary by $40,000, I’m applying in areas where I would never consider living, I’ve changed my resume numerous times and even have a separate one meant to be more easily readable to an algorithm.\n\nI just purchased a course for an A+ certification and will pursue a Cisco certification thereafter. I apply on LinkedIn, Glassdoor, and Indeed every day. \n\nThe only jobs I hear back on are HTD scams and $20/hr “software associate” jobs. I thought that finishing college with two degrees in only 5 years and having studied abroad would really help my chances of getting hired, or at least getting interviews, but the only interviews I get are from predatory companies offering very low rates. I know I’m worth more than that, but I’m coming to a point where I might have to settle for something.\n\nAre cover letters really that important? I had been doing them, but having to grovel and find reasons why I’d want to work at some random company has really eroded my own mental state. Why was I told I would have no problem finding a job with a starting rate of $80k a year all throughout high school and college, only to struggle to find a job that pays more than Target?\n\nWhat am I doing wrong? Any and all suggestions and tips are welcome. This is a cry for help. I just want to start my life.\n\nEDIT: \nThanks everyone for the advice. I thought I’d clear some things up. I live in the US, in Tennessee. My time in college was especially rough, due to a global pandemic starting during my sophomore year and knocking out two years of time I could have gotten internships. I felt that it was more important to me and my life to studying abroad for a year in Japan. I studied at Saitama University for a year, completing my Japanese major, and then came back to the states to finish out my CS major. The staff by then had undergone some serious changes, as my university had experienced what we had called “the great resignation.” I had experienced the fallout from this twofold, as the entire study abroad office, with whom I had been coordinating my return to the States, had all resigned or changed position, and many of the professors in the CS department that taught the upperlevel classes had retired or resigned. The new professors they had brought in were severely under-experienced and one had made it through by lying about his work experience altogether. It was utterly catastrophic and I still curse my university for underfunding the CS program and for allowing a man to teach two of the most important classes for upperclassmen, against the constant pleas and complaints of the students.\n\nI hope that clears some things up. Sorry that it’s a bit of a wall of text.",
      "subreddit": "cscareerquestions",
      "score": 86,
      "url": "https://reddit.com/r/cscareerquestions/comments/1aqi5i8/been_looking_for_almost_a_year/",
      "comments": [
        {
          "body": "Get a job in Japan, think April is their hiring season",
          "score": 61
        },
        {
          "body": "Take one of those 20/hr Software associate jobs and leave after 6 months to a year. Treat it as an internship.",
          "score": 61
        },
        {
          "body": "You said it yourself - no experience, no internship, no portfolio. So what is HR going to look at on your resume and say, 'That's our guy.'? No matter how many times you rearrange it, those are the things they look for on a resume that will boost your chances",
          "score": 49
        },
        {
          "body": "send those 20/hr software associate jobs my way, brother",
          "score": 52
        },
        {
          "body": "One option (of many) is to pursue a master's in CS and go hard on getting that internship while you're a student again.",
          "score": 52
        },
        {
          "body": "When I was 6 months without any luck in finding a job, I bit the bullet and went for a company like Infosys. The pay is reasonable starting out and they'll take anyone. They mass hire people, send them to a 2 month boot camp somewhere in the US (fully paid for, they even give compensation for food, whatever you don't use, you can pocket it.)\n\nAfter your first 2 months, you'll be transferred to the closest Headquarters (or fully remote, this was before covid,) put you on their bench, and will try their best to find jobs for you.\nWhen you're on their bench, they have TONS of resources to educate different tech stacks, and will reimburse you for ANY certifications. If they're unable to find a contract for you, you'll have about 30-60 days until they fire you. \n\nUse and abuse their resources, and if you're competent, you may get on a project for 6 months to a year. I worked their for 2 years, dreaded it, but it got my foot in the door. That job paid me 57K, left making 63K, and got me to my current job that paid 75K, to 83K now + commissions. In April, I'm lined up for a better job I'll be moving to and will be making my first 6 figures job. All of it, fully remote. It may not sound like much, but in the Midwest, that's dynamite for my LCOL area.\n\nI know they are hated in this sub, but without them, I wouldn't be here today in my predicament.\n\nEdit: making a bare bones basic website that has a very basic portfolio feel would be beneficial too. I paid $40 for a domain name throughAWS, pay 50 cents for my web site. It hosts my experience, downloadable resume, as well as all of my links to my socials such as github and linked in. Most recruiters aren't tech suave, and will think you're the bees knees. I got so many call backs, due to them loving my website. \n\nI used this as a template, and built off of it with my own personal flairs. https://html5up.net/\n\nEdit 2: Also, if you haven't already, reach out to reputable tech recruiters. They get paid to refer you to companies, unlike headhunters. When I was in your position, they recommended exactly what I did above, and had me come back once I got experience, which landed my my 75K job. The one I'm about to start, is a transition role due to my contract ending, and they wanted to hire me to keep me on their team.",
          "score": 11
        },
        {
          "body": "Maybe doing some coding volunteer work, hackathons, or open source projects can add some relevant experience to your resume. On top of working on a portfolio or properly worked on GitHub profile/projects.",
          "score": 8
        },
        {
          "body": "[deleted]",
          "score": 57
        }
      ]
    },
    {
      "title": "Rejected due to being overqualified?",
      "body": "Is this a thing? I recently applied to some “dinosaur” tech companies like IBM, SAP, Cisco, etc for junior dev roles just because I want some interview practice, but was immediately rejected by all of them. \n\nI have a couple years of experience at a FAANG-like company and went to a “prestigious” university, along with having a couple other competition accolades in math/cs and some unique personal projects. I think my bullet points are also pretty good, covering some large NLP-based projects I recently completed that I even presented at a symposium for my company. \n\nIs my resume actually just bad or something? These rejections have kind of surprised me. At the same time, I’m getting reached out by recruiters from top quant firms and unicorns, so it’s confusing af",
      "subreddit": "cscareerquestions",
      "score": 31,
      "url": "https://reddit.com/r/cscareerquestions/comments/16x0xfo/rejected_due_to_being_overqualified/",
      "comments": [
        {
          "body": "Yes you can be overqualified. You’re too overqualified for junior dev, why would they even bother to interview you when they can’t hire you for the role",
          "score": 302
        },
        {
          "body": "You’re mad they didn’t let you waste their time bruh…",
          "score": 65
        },
        {
          "body": "Why the hell are you applying to junior positions?",
          "score": 81
        },
        {
          "body": "Such a cringe humble brag lmao\n\nOP why the validation seeking?",
          "score": 152
        },
        {
          "body": "&gt;Is this a thing?\n\nYes, but probably not nearly as much as people like to believe.\n\n&gt;Is my resume actually just bad or something?\n\nDon't know, haven't seen it.",
          "score": 45
        },
        {
          "body": "I think it's funny people call these dinosaur tech. These are the technologies running the world. Meta is running a social network and VR",
          "score": 98
        },
        {
          "body": "They think you’re just using them for interviews (which you are) and reject you. Why waste a couple engineer’s hour on someone who won’t take the job.",
          "score": 9
        }
      ]
    },
    {
      "title": "Should I Switch to Software Development or Stay in IT Systems?",
      "body": "Hey everyone,\n\nI’m at a major crossroads in my career and could really use some advice. I’ve been working as an IT Systems Technician for the past 4 years, handling networking, system administration, security, backups, and troubleshooting. The job has given me solid experience, but career growth has been uncertain.\n\nRecently, I had an opportunity for my salary to increase to $550 per month at my current job, but at the last minute, the company announced that they are not doing well financially and have stopped all promotions. Right now, I’m still earning $243 per month with no clear path for a raise.\n\nAt the same time, I had an interview for a software development role in an NID (National Identity) system project under NSIA (National Statistics and Information Authority). The job involves Spring Boot (Java) and Angular to build a national identity system. If I get selected, I’ll have one month before the job starts, and my salary would jump to $350 per month—a significant improvement.\n\nI’ve also applied to other jobs, but with Afghanistan’s job market being so tough right now, I haven’t heard much back. So I need to make a decision soon.\n\nMy Experience &amp; Skillset:\n\nIT Systems &amp; Network Management (Cisco, Mikrotik, Ubiquiti)\n\nServer Administration (Windows Server, Linux, VMware)\n\nCybersecurity &amp; Authentication (Firewalls, RADIUS, LDAP, JWT, WSUS)\n\nDatabase Management (PostgreSQL, MySQL, Backup &amp; Replication)\n\nScripting &amp; Automation (Python, Bash, PowerShell)\n\nBasic Java &amp; Object-Oriented Programming\n\n\nI don’t have experience in Spring Boot or Angular, but I’m willing to focus on one and learn as much as possible within one month before starting the job.\n\nHere’s Where I’m Stuck:\n\n1. If I move into software development, will my 4 years of IT systems experience go to waste?\n\n\n2. Can I realistically learn Spring Boot or Angular in one month while working?\n\n\n3. Should I focus on backend (Spring Boot) or frontend (Angular) to increase my chances of success?\n\n\n4. Would staying in IT systems and transitioning into DevOps be a better long-term move?\n\n\n5. Since this is a government job, it offers stability and security—should I take it just for that?\n",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1iq1j9b/should_i_switch_to_software_development_or_stay/",
      "comments": [
        {
          "body": "Having worked in both development and IT, here are my observations:\n\nDevelopment...\n\n* Pays better.\n* Has a more relaxed schedule as you tend to not have to be available to help \"customers\".\n* When part of a profit center, has a better \"reputation\" within the company (treated better)\n* Has a harder interview process.\n* Involves an incredible amount of learning and ambiguity. This leads to more stress about your career, productivity, and   performance.",
          "score": 2
        },
        {
          "body": "I see you're cross-posting this, I responded over at https://www.reddit.com/r/ITCareerQuestions/comments/1iq1jsp/should_i_switch_to_software_development_or_stay/",
          "score": 1
        }
      ]
    },
    {
      "title": "Have a technical with Cisco tomorrow and feel like I’m about to pass out.",
      "body": "CS student about to graduate next month and somehow stumbled my way into the 2nd round of a entry level position with Cisco. The interviewer say she liked my resume and scheduled me for a technical tomorrow. To be quite honest, I’m nervous as hell and feel like I’ve brain dumped everything I’ve learned so far. Any tips or tricks so I don’t make a fool of myself? Thanks.\n\n##Update: So, I completely bombed it haha. Had basic questions about MySQL, JavaScript, and web application development. I managed to answer some questions right, but a majority I had no clue how to approach. Was told I’ll hear from them by Friday, but if I didn’t make it to the next round, I’m fine with it. I did my best and now I have experience for the next interview. Thanks for the advice everyone!",
      "subreddit": "cscareerquestions",
      "score": 124,
      "url": "https://reddit.com/r/cscareerquestions/comments/y04px1/have_a_technical_with_cisco_tomorrow_and_feel/",
      "comments": [
        {
          "body": "You got this!\n\nNobody wants you to be miserable, not even the interviewers. Just talk through your problem, be yourself and you’ll crush it.\n\nWhat’s the worst that can happen? Maybe it doesn’t go as well as they wanted and they pass. So what? You got valuable interview experience for the next round.",
          "score": 67
        },
        {
          "body": "Smile, even as you code, show interest, and keep talking. You got this!!!",
          "score": 111
        },
        {
          "body": "interviewers are looking for reasons to hire you, not to not hire you.\n\nthey would love to finish their search.",
          "score": 81
        },
        {
          "body": "Make sure U go to sleep and don’t sabatoge urself. If ur low on sleep, food, water higher chances that brainndump happens. Put some other tips here https://www.reddit.com/r/ADHD_Programmers/comments/x8m2s9/did_not_bomb_technical_screen_used_new_technique/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
          "score": 12
        },
        {
          "body": "[removed]",
          "score": 8
        },
        {
          "body": "I’ve heard that studies show that taking a breath in for four seconds, holding it for four seconds, exhaling for four seconds, and holding the exhale for four seconds helps lower heart rate and anxiety. This should make your voice steady.\n\nAlso, when doing things, don’t be afraid to take a second to think, and as you think, try thinking out loud. Ask as many questions as possible. If you realize a line of thinking won’t work (as you’re thinking out loud) explain why it won’t work and why you’ll try something else. This is what they want to see.",
          "score": 4
        }
      ]
    },
    {
      "title": "Why am I getting this degree again?",
      "body": "Background: Got a Bachelor's in General Studies, Got a Cisco cert, worked as IT Support for three years, hated it, learned to code for the last 2 years both on my own and through a self-pace program called Launch School.\n\nI'm terrible at just making up projects on my own. I get totally overwhelmed. I need structure or else I just won't do anything at all. However I believe making projects or just repetitive practice is the best way to learn.\n\nI applied to over 200 jobs and only got two interviews. So I figured some companies would be dumb enough to at least interview me if I had a Bachelor's in CS. I'm going through Southern New Hampshire University.\n\nThe classes are taken 2 at a time, 2 months long, accelerated pace. This intro to Python class I took was so easy. It talked about lots of important fundamental concepts but it only gave a week to practice each one. That's not enough time to master the language. What is even the point of taking the class if I can't competently code Python in an interview after taking it? It's the last week and I have an A, it was a cake walk because Launch School did a good job teaching me fundamentals.\n\nBut is this what a CS program is going to be? A bunch of superficial knowledge shoved down our throats for a piece of paper that people are going to make all kinds of their own assumptions about? Like they're going to decide what they think I know based on the degree. Based on my experience in interviews, they don't actually ask me about anything I've done other than work experience. They'll see the CS degree, minimal volunteer coding experience, and that's it.\n\nSummary: College coding class is good but seriously easy... am I supposed to actually try to learn the stuff long-term? Because I learned a lot at Launch School but just saying that I know things doesn't hold any weight on a resume. And I'm totally overwhelmed at the thought of just coming up with my own amazing incredible project meant to impress... wait who is even going to read my resume? Is it an engineer or some HR person?\n\nActual TL;DR Am I stupid for choosing a CS degree?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/p8sr4s/why_am_i_getting_this_degree_again/",
      "comments": [
        {
          "body": "CS degrees always start relatively easy because they should be doable for people who did not spend 2 years learning programming. What's the curriculum? I'm pretty sure it will start to become a lot more challenging than just an intro to Python.\n\nEdit: I'm a bit confused. Is it [this one](https://www.snhu.edu/admission/academic-catalogs/coce-catalog#/programs/V1S14E8tg)? Because it doesn't even list a 'beginner' Python course.\n\nI started a CS degree in '98. I did really well in Java programming for example due to already having programmed since I was 11 or so. Discrete Math and Statistics on the other hand totally kicked my ass.",
          "score": 17
        },
        {
          "body": "You shouldn't be expecting to be a master of anything from a degree, that's not what it's designed to do.  Degrees give you a wide, but shallow, understanding of the basic concepts of computer science.  By obtaining a BS you're not showing that you're an expert in anything at all, but showing that you understand the fundamentals and have a solid foundation in which to build out tech specific knowledge.",
          "score": 8
        },
        {
          "body": "no you’re not stupid for choosing this degree. \n\nYou might be misunderstanding what a cs degree is for though.\n\nAn intro into python class does not represent anything. \n\nHave you taken data structure and algorithms? Have you taken software engineer course? Have you learned how to do group projects with other students through github? \n\nMany things in a cs degree might seem useless but to base a whole degree on an intro class is laughable.",
          "score": 9
        },
        {
          "body": "Your average salary will be higher with a CS degree than without one. But the main appeal to getting a CS degree is the intership that comes with it (which is by far the most important thing), and the ability to have people tell you what to learn so you don't have to learn it all yourself.",
          "score": 6
        },
        {
          "body": "Computer Science isn't coding. Coding is just a component of solving problems computationally and logically, which ultimately is the core of CS. In CS, you are learning at a fundamental level how to solve problems using different programming paradigms as \"tools.\"\n\n The other side of the coin is theoretical CS and other abstract topics, such as operating systems, compilers, and computational architecture, all areas that mostly benefit CS students who will work closely with engineers of various types solving high level problems. ***Please note, having some basic knowledge of the above mentioned theoretical topics helps system/software architects choose the correct tool (language) for a chosen project. \n\nBy focusing on this fundamental skill, a \"developer\" should be able to grasp the syntax of most programming languages in about two weeks just by reading the documentation. This is probably the reason the most successful CS students coded little bit before attending school. I have witnessed several senior devs give juniors and interns a Java or C# book and told them have a nice weekend. \n\nThe concept of a function, an array, algorithms, and loops is generalized across the board but executed slightly differently depending on the tool used. \n\nJust like most bachelor degrees, there is a lot of breadth, not a lot of depth. BS degrees a designed to expose the student to different areas within their chosen field of study and later on you will decide on a specialization.  In your case, web development/software development.",
          "score": 2
        },
        {
          "body": "I just checked the CS map on SNHU. The degree looks somewhat standard but it’s pretty fluffy compared to a traditional CS degree. I see Calc 1 and Calc 2, I see linear algebra. I do not see discrete structures 1 and 2. I don’t see a numerical analysis course. I don’t see diff eq. I don’t see discrete probability or statistics \n\nI do see computer architecture. I do see DSA but it’s combined into a single class. I do see prog Lang. I don’t see compilers. I don’t really see the systems programming classes that teaches C -&gt; assembly. I don’t understand how you can take a computer architecture class without systems programming 1 and 2 as pre requisites. \n\nI would give the degree a 4/10. A lot of fluff in the academic map for sure, but it does hit some of the basics at least.  A computer science degree isn’t intended to teach you python. It’s intended to teach you the fundamentals of computing. A CS degree should make it easier to pass a whiteboard interview.",
          "score": 3
        },
        {
          "body": "&gt;Like they're going to decide what they think I know based on the degree. Based on my experience in interviews, they don't actually ask me about anything I've done other than work experience. They'll see the CS degree, minimal volunteer coding experience, and that's it.\n\nIf you read this sub, you will find many people with a CS degree that can't land a job.\n\nA degree is not enough, but it helps a lot",
          "score": 1
        }
      ]
    },
    {
      "title": "Cisco Work-life balance?",
      "body": "Im going through the interview process as a Sr software engineer.\n\nI was wondering what the Work-life balance is for cisco?\n\nAs a bit of a background I worked for a FAANG company the last few years before I was laid off. When I first got there I was excited because it was FAANG and the way they had promoted the WLB I didnt think it would take too much time out of my life. I had come from a more chill company before I went to FAANG where you could have a task for a month and nobody would be on your ass. I knew FAANG would be more on your ass about things but not to the degree it was. It didnt feel like 9-5, it felt like 24/7. My manager was going to his kids event and responding to emails. Seniors and above were working on vacation, taking calls and repsonding to emails late at night and on the weekens and vacation. They gave us one mayor task and before you were done theyd put 2-3 more mayor tasks on your plate. Everyone was overworked and seemed the culture was to do more for the company. Even engineers that I felt exceled at the job were leaving and telling me a big reason was due to feeling overworked. The job was in cloud which after I got to the company I was told it was the exception to good WLB in that company. Even managers would promote WLB but give a \"wink-wink\" work extra.\n\nI want to avoid that experience as I've realized I am more of a 9-5 person. I dont mind giving in 50 hours in a week but I also dont want that to be a consistent thing like it was in my last company (I think I would approach 60 hours).\n\nI know this is team-based but just wanted to get a consensus.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1iu8k8a/cisco_worklife_balance/",
      "comments": [
        {
          "body": "Was the FAANG the rainforest company?",
          "score": 1
        }
      ]
    },
    {
      "title": "Was CS a career mistake?",
      "body": "So about me, I've basically got the short end of the stick of everything throughout my life. Biased teachers in high school cost me my chance to get into any of the colleges I wanted to go to and I ended up going to a decently ranked local college that has no standards in accepting locals. Despite all the effort I put in, I failed to get a single internship despite living in the heart of silicon valley.\n\nThe only reason I even got in my first job, Cisco, was because the WITCH needed warm bodies. New Year of 2020 came around and my then manager announced that my contract was about to end and even though I got to interview within Cisco for new contracts, I failed to get anything. Few months later into covid, I lost both the contract and the consulting job due to the lack of contracts that fit my skillset that don't require relocation as I was only making half of what everyone else was making.\n\nFor the entire 15 month duration with over 30000 applications shotgunned during every chance I get and dozens of phone screens, I managed to get a grand total of only one single onsite from Amazon for a job I didn't even apply for only to fail it and get barred from making any applications in the system for a year. I've done everything and resorted to everything; cold contacting recruiters and even opted to apply to outright scams. Even with resume reviews, rewrites, and a class on writing resumes ended up fruitless. \n\nI honestly can't tell if this is normal or the world is working against me at this point. I've lost all the people I've ever cared about as they've all moved on pretending I don't exist and the few connections I managed to get referrals from only accelerated the wait for a rejection from weeks to as little as 8 hours via manual review. Even one of the screenings straight up said they're dismissing my freelance work as not \"real\" experience. At this point, even my own family is saying that I should just give up the job hunt and go back to school but are trying to force me back into the college I graduated from to keep me under a tight leash. Despite the requirement for multiple rec letters, which I have no one who will offer to write when asked.\n\nI have no option but to keep applying but these nonstop failures, losses, ghosting, and constantly being put down is taking its toll. I've lost all passion for the engineering field after monotonously applying for jobs day in and day out for over a year but I don't have anything else that I'm skilled at. Can I really get anything with just a little over a year of professional experience? Did I make a mistake in choosing my career path?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/m9q7xm/was_cs_a_career_mistake/",
      "comments": [
        {
          "body": "&gt; For the entire 15 month duration with over 30000 applications \n\n2000 per month? That seems unbelievable.",
          "score": 17
        },
        {
          "body": "You lost me when you start out blaming your 'biased teachers' in high school. Don't play the victim, just realize you are responsible for your own trajectory.",
          "score": 28
        },
        {
          "body": "Stop blaming the world for your problems. You're multiple years out of college and still talking about high school teachers? Nothing was stopping you from getting a 4.0 in college, doing multiple personal projects and attending hackathons. Until you can take responsibility nothing is going to change.",
          "score": 6
        },
        {
          "body": "Sorry for being a little harsh, but the only relevant parts of your little rant are that you\n\na) start blaming other poeple from the very start and\n\nb) you - not even once - give the tiniest bit of information about what you actually can do.\n\nCurrently, all over the world, the market is really competetive, yes, but there is a huge amount of open positions (otherwise you couldn't have applied at such an amount of places).\n\n&amp;#x200B;\n\nYour career is an act of selling yourself as a product to employers. Nobody can answer a question about your career without knowing anything about the product (you and your skillset).\n\nMaybe adjust your perspective on your career as a whole first",
          "score": 8
        },
        {
          "body": "&gt; For the entire 15 month duration with over **30000** applications shotgunned during every chance I get and dozens of phone screens\n\nOh come, that's just a transparent lie.",
          "score": 3
        },
        {
          "body": "Of everything I have read, you've said nothing positive. And whatever you got, you attribute it to luck and not skill.  It can't be that nothing positive has ever happened in your life and that might be an issue. Like, I don't want to be so..... blunt, and I would love to show compassion but... come on fam.   \nYou'd make a mistake choosing any career path if that's your view on it. Not all of us are blessed. Come on fam. Keep fighting, and if it isn't for you and you need a different path, nothing at all is wrong with that. Just stop thinking your whole life is negative. That's the difference between success and failure. You are creating this for yourself.",
          "score": 3
        },
        {
          "body": "Blaming teachers? I grew up in a roach infested crack house in one of the poorest school districts in rural oklahoma. Nothing is easy. Get over your hangups and realize that it's up to you now.",
          "score": 4
        }
      ]
    },
    {
      "title": "Quick tips when applying so you don't get Cold Rejected",
      "body": "If you want a high chance of securing an interview, make sure you apply through a *dedicated* stream. The interview game isn't as transparent as some might think.\n\nGeneral tips:\n\n* Never apply for a job that's been posted for months old.\n* Scout the company's code and networking events.\n* When applying online, make sure it's specific and *referred*.\n* Manage your applications in some excel sheet or txt file.\n* Use well-known 3rd party sites (Linkedin, Piazza).\n\nExamples:\n\n* Google: Codejam, G-Games, I/O\n* FB: When your position reads \"SWE_ NG_{your_uni_name_here} ({semester_here} {year_here})\"\n* Chase: Code for Good\n\nWhen you network with these companies, let's say a career fair, most recruiters will hand you a custom application link, referral code, name, and/or email. These have a very good chance at responding, especially if you get a referral email or link.\n\nUse third party sites to passively farm connections. \n\nExamples: \n\n* Linkedin: Might fetch a good opportunity depending on your profile. \n* Piazza: Careers has a calendar with some good companies holding networking events. And an inbox.\n* GitHub: Pimp up your profile with open source contributions and notable projects.\n* Kaggle: If you're a data scientist, this is highly recommended.\n* StackOverflow: Probably overkill. Few companies ask for this, most don't. If they do, you've got this. Same with Quora.\n\nAnd for the banks: something something technology analyst something something program 2017. Common abbreviations are TAP, TDP, TLP, etc. \n\nSome companies offer a \"tour\" when really it's a ~~free job hookup~~ networking event. ~~Also when applying for an internship make sure you never say you are advanced in seniority, i.e., don't say you are a junior when you are on your second year, even if you have the credits. Or when you don't have enough credits to advance. Further away from being a senior the better for interns.~~\n\nIf you're a woman, attend those women-targeted events.\n\nAttend hackathons w/ sponsors, some fortune 250s may show up.\n\nThen those random events that show up once on a full moon. Get notified by the university's connections somehow (by email or, the worst, poster boards). \n\nThat's all I can think of for now. Going to sleep. gl\n\n**EDIT:**\n\nWoke up. For internships, junior status is definitely good, but it is also generally good to start looking before then. Make sure you're in a targeted audience when applying for internship/full-time, it is denoted by \"graduating in or after 201x\".\n\nQuotas. Most companies hire on a rolling basis, and this typically starts when they post or update their app page. Sooner the better - you don't want to get suddenly cut short.\n\nSome companies may ask for certifications, professional licenses, and/or boot camps. Not really a necessity but a bonus and fills up the empty spots in Linkedin if they bother you so.\n\nExamples:\n\n* Udacity\n* Coursera\n* IEEE, Cisco: This one's really good to have if you're into computer networking.\n\nCoding competitions. These are different from hackathons. Good to get your name out there. You might get called out if you do well enough or compete often enough. Also helps your DS&amp;A/problem solving abilities.\n\nExamples:\n\n* ACM-ICPC\n* Google stuff\n* Hackerrank, Leetcode, Topcoder\n\nProfessors/Industrial professors have some leeway into companies, especially the ones they currently or used to work for. Do well and get to know them, they may provide a recommendation.",
      "subreddit": "cscareerquestions",
      "score": 142,
      "url": "https://reddit.com/r/cscareerquestions/comments/603dnt/quick_tips_when_applying_so_you_dont_get_cold/",
      "comments": [
        {
          "body": "How is it better to day sophomore than junior",
          "score": 20
        },
        {
          "body": "What if that company doesn't go to your schools career fairs? Also if you give your resume to someone at a career fair, how does it differ from applying online assuming the resume is the same? ",
          "score": 9
        },
        {
          "body": "&gt; Never apply for a job that's been posted for months old.\n\nYeh took me a while to figure this one out. I would even go as far as saying postings that are within 2 weeks are more likely to reply. \n\nAlso, obviously this doesn't apply to big companies that are perpetually hiring. ",
          "score": 18
        },
        {
          "body": "\"They are meant to fill up their woman quota\" \n\nJesus wtf. ",
          "score": 36
        }
      ]
    },
    {
      "title": "Daily Chat Thread - May 03, 2019",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/bk5jon/daily_chat_thread_may_03_2019/",
      "comments": [
        {
          "body": "So what actually ended up happening with Google Fall internship? I'm trying to reinterview, I got to the HC stage last time (fall 2018) before rejection. Got another Big N on my resume this time but I still have no interview. Whats going on? Its been a long time since the 15th April deadline",
          "score": 2
        },
        {
          "body": "Hey, I'm trying to find fields/classes in CS I should look into.\n\nI'm in the last class for C/C++ at my school, then I'll start my bachelors after finishing up math classes. I'm liking the languages more than Java. I find all the pointer stuff to be pretty cool.\n\nWith that said, my favorite moments in programming are when I must do a lot of logical thinking and where I solve challenging problems. I find the topic of CS and knowing about how the computer is working behind the scenes to be very interesting.\n\nThe whole \"get out of school and become a SWE\" doesnt sound all too appealing, maybe I'm just thinking I'll be writing nothing but simple code, am I wrong? I'd appreciate some insight.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": -2
        },
        {
          "body": "FB recruiter said she /should/ get back to me by today (Friday) after Monday onsite, but no email.  It's now past EOD, so I guess I get to stress about this all weekend lol\n\nDon't think I got it, but I'm treating it like Shcrodinger's feedback so don't want to poke :D\n\n(I was really pushy on my Stripe onsite feedback but that ended up negative so don't want to jinx it again by pestering recruiter lol)",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 3
        }
      ]
    },
    {
      "title": "Great experience for new grad but no luck",
      "body": "I could really use some help here. I'm a new grad that was planning on taking some time off and going to grad school, but the situation changed and now am in need of a job and have been applying like crazy. I transferred from a school well known for CS to a smaller one that is less well known, and had Machine Learning related research positions and \\~3.5 GPA at both. My junior year summer research was published in an academic journal and I had internships freshman and sophomore year at telecoms in Software related positions. I have been using Linux for about 8 years now and am a contributor and maintainer of a couple of fairly large open source projects (&gt;10k stars). All of this is on my CV.\n\nDespite all that, I can't seem to find a decent paying SWE role for my life. I've sent out probably 50 applications the last few weeks and the only one I got a response from was a local company that wants to do a phone interview for a \"Software Test Engineer\" position that will likely pay &lt;80k. The only \"coding\" assessment I got was an automated email from Cisco, that I completed half an hour early. Despite passing all the test cases and finishing early though (didn't change tabs or click off the screen either) , I just got denied from the position without any explanation or interview today.\n\nThe referrals I have gotten to larger tech companies haven't even gotten me a phone call, yet my resume has been looked over by a ton of people and it is pretty good. I'm really lost and I don't know what to do. I meet the requirements for many level II positions on paper but getting a decent entry level position is absolutely impossible. I'm afraid that if I wait until the next hiring season for new grads I'll be overlooked but that if I take a position that doesn't actually exercise my skills in the meantime they will dull and I won't be able to move to something better.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/vm4kiu/great_experience_for_new_grad_but_no_luck/",
      "comments": [
        {
          "body": "50 job applications isn't that many.  I'm a staff-level engineer with almost 15 years of experience, including React experience since 2013, and I was only getting callbacks on ~5-10% of my applications.  It just gets worse the less experience you have: since the switch to full-time remote, every job has something like four hundred million applicants.  Even if you look perfect on paper, so too do a hundred million other applicants, and you just have to keep throwing shit at the wall until something sticks.  \n\nI'm usually on the other side of the hiring table, and for a junior/entry/mid level position, you'll get somewhere between tens and hundreds of applicants _a day_ for a role.  Between bots, recruiters, Indeed-like websites that are effectively bots, etc. every job listing is inundated with applicants.  Even once the very-much-not-engineering HR department filters the obvious losers out of the pile, you're still left with dozens of applicants for each single position.  At that point, it's simply not possible to hire the best of the bunch, so you set a minimum bar, and you interview 6 or 8 people and then hire the best one that clears the bar, or repeat until someone does.  In all likelihood, _several hundred_ people applied, some HR software narrowed that down to fifty or sixty resumes that match the job description, an engineering manager narrowed that down to ten or twenty based on what arbitrary decisions they make (some people prioritize diversity, others the opposite; ditto for age discrimination, people looking at self-taught engineers, everything), and then interviews happened.  If you weren't lucky enough to pass through HR's software and you weren't lucky enough to be at the top of the stack the manager was looking at before his build finished, you didn't do anything wrong, it's just piss poor luck.  \n\nMy mentor, an SVP now, walked me through his recent job transition as I was preparing for mine.  At the Director/SVP level, he was sending out at least five resumes a day, and even at that level he was only getting callbacks at a ~10% clip.\n\nThe best advice at this stage of your career is call yourself something that sounds white, male, and European.  I knew a woman who couldn't get a call back to save her life until she went with a male form of her name; I knew a black man who went by a very common single-syllable name because his full name was quite African and he had learned that lesson earlier in his career; I've known a TON (south florida) of Hispanic people who go by Anglicized variants of their name (Guillermo -&gt; Bill, Pedro -&gt; Pete, Juan -&gt; John, etc.).",
          "score": 6
        },
        {
          "body": "You’ve only been looking for a month, that is a bit too early to be stressing about it. I’ve heard it takes on average about 6 months to land a first job: some get one sooner, some take longer.\n\nOne month is too early to say.\n\nHowever, if you want your application to stand out, I would suggest thinking about what kind of company and role would be the best match for you, focus on being the best candidate for them rather than trying to impress everyone. What one company sees as a bonus another can be put off by.",
          "score": 4
        },
        {
          "body": "You seem to have pretty impressive experience for a new grad, have you had your resume reviewed by anyone? Another thing to consider is that you started applying fairly late for new grad stuff; many positions opened from last fall onwards and are probably filled by now.",
          "score": 2
        }
      ]
    },
    {
      "title": "How prestigious (if at all) is Cisco SWE?",
      "body": "How does it compare to Cisco Meraki, FAANG, Capital One, Bofa, etc.?\n\nIf anyone worked at Cisco as an SWE and could compare their experiences to other places, insight would be much appreciated!",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/pqszps/how_prestigious_if_at_all_is_cisco_swe/",
      "comments": [
        {
          "body": "There’s pretty much a direct correlation between compensation and “prestige”.",
          "score": 27
        },
        {
          "body": "the highest TC is the most prestige",
          "score": 25
        },
        {
          "body": "Last time I checked, I couldn’t pay bills with “prestige”. Why do you care?",
          "score": 19
        },
        {
          "body": "The only case where prestige might matter is on a resume. So ask yourself, will \"Cisco SWE\" on your resume catch anyone's attention, moreso than the average software position? Probably not, so it doesn't matter in this case.",
          "score": 6
        },
        {
          "body": "It’s not tier 1 or 2 but if that’s the only offer you have then it doesn’t matter.",
          "score": 5
        },
        {
          "body": "What is with all this \"prestige\" bullshit on this sub? Are you fresh out of college? Yes? Shut the fuck up about prestige, and get some experience. No one wants to work with cocky college kids who know nothing about the industry.",
          "score": 14
        },
        {
          "body": "I think its pretty prestigious to be employed as a SWE and not starve. But that’s just me…",
          "score": 3
        }
      ]
    },
    {
      "title": "I am really angry at my 21-year-old self.",
      "body": "This is more of a rant post.\n\nI grew up in India. I went to a crappy tier 3 college. Back then my dream was to get a job in a product company like Microsoft, Apple, Google, Cisco. I basically wanted to make a lot of money. I had no clue what people in these big-name companies do. I just wanted to make a lot of money.\n\nFor a long time, I thought of writing GATE(an exam for getting a seat in the master's program in the IITs). My whole reason for wanting to do that was because I wanted to work for a big brand name company and none of those companies were willing to interview me at that time. Eventually, I realized that there is no chance in hell that I can get into an IIT.\n\nThen somebody told me that if I get a master's from the US, I can make 100,000$ a year! At that point, the best offer I had in my hand was from TCS for 5,000$/yr. So I was immediately sold on the idea of getting an MS in CS from the US. I wrote GRE and I got a 322 in it. I had an 8.04/10 GPA. I wrote some bullshit in my SOP and I applied to 7 colleges in the US. I got into two of them. One of them was a top 30 college at that time. I highly doubt the people in that college read my bullshit SOP or my LORs. I am pretty sure, admissions into the master's programs in the US are done solely on the basis of GRE &amp; GPA for Indian students. \n\nNow, I had no clue what grad school was when I was 21 years old. My goal was to make 100,000$/year. Even when I came to America, I did not give a shit about my academics. I was leet coding all the time. My GPA took a hit. In almost all of the courses I took, I got a B grade. I was like who cares. By the third semester of the program, I got a 104,000$/year job and a 140,000$/year job. I pat myself on my back and I said to myself \"mission accomplished\". I had a 3.22 GPA by that point. I did not even think about doing a thesis as it would take away time from applying to jobs. By the time I graduated, I had a 3.33/4 GPA. I stopped interviewing and started focusing on my grades a little bit.\n\nNow I am 30 years old. I see about 10% of my batchmates settling into an Applied scientist/research scientist position in Amazon, Bloomberg, Etsy, etc. These people had 4/4 GPAs. They took their thesis seriously and published papers. They started off in crappy positions making 80,000$ a year in some no-name startups. Back then I was feeling so superior to these people because I was making more than them.\n\nNow I am a senior software engineer. My total comp is close to 250,000$ a year. None of my teammates nor myself read research papers as a part of our jobs. We don't attend conferences nor do we publish papers. Those people who are working as Applied scientists are making 300,000$ a year today. They post photos of themselves working with robots in Amazon 126 lab or whatever. They are constantly publishing papers and shit. They are legitimately contributing to the pool of human knowledge. Maybe none of them will win a Turing award or a noble prize in this lifetime, but they are helping humanity progress further. Compared to them, I am not doing anything meaningful in my life. Every day I add a stupid field to a flat buffer schema and fight with my teammates about what it should be called :| And my teammates who are just as jobless as me, fight with me for hours on end, to decide what I should call the stupid field in the stupid flat buffer schema. Some of them are doing this stupid shitty job for 25 years now.  They are super contended with their lives. We all have one life and they are throwing it away building crappy dashboards and UIs and services for some stupid customers to use. Nothing they are doing hasn't been done in the industry before. Looking at them makes me sick.\n\nNot a single day goes by when I don't think about suicide. I feel so incredibly stupid. Nobody told me what they fuck a master's degree is. Nobody told me what the hell grad school was. The greedy ass college that I went to, took 40,000$ from me, a gullible 21-year-old from India, and gave me a stupid diploma.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/stmk3b/i_am_really_angry_at_my_21yearold_self/",
      "comments": [
        {
          "body": "If you find yourself in a difficult place in your life, we urge you to reach out to friends, family, and mental health professionals. Please check out the resources over at /r/depression, /r/anxiety, and /r/suicidewatch. Feel free to [contact the /r/CSCareerQuestions mods](https://www.reddit.com/message/compose?to=%2Fr%2Fcscareerquestions&amp;subject=&amp;message=) for more information or help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Comparison is the thief of joy. You seem to be doing really well for yourself, have come a long way, and achieved what you set out to achieve. Think of that instead of what your peers are doing as you will never really know what's going on in their lives.",
          "score": 42
        },
        {
          "body": "Do you think you legitimately aren’t as smart and hardworking as your friends working at the places you wish you worked? I’m genuinely curious because someone born in India who makes it to the US and is making 250k is fairly impressive.",
          "score": 31
        },
        {
          "body": "Publishing papers is bullshit too. Trust me, I’ve done it. Almost no one is really “contributing something valuable to humanity”. Seriously. Find a job that you don’t hate that pays a lot. If you can do that you’re doing better than practically everyone on the planet.",
          "score": 22
        },
        {
          "body": "Bro u make 250k I’ll suck ur balls",
          "score": 18
        },
        {
          "body": "I think you need to go see a therapist.  Your disdain for your coworkers and unhealthy obsession with comparing yourself to your \"friends\" is not good for you.  \nThere is also nothing stopping you from switching careers.  But honestly, you kind of sound like one of those people who won't be happy regardless - because someone somewhere has it better.",
          "score": 34
        },
        {
          "body": "That's a lot of complaining and a shitty attitude toward your peers for making 250k a year! You sound like a horrible person to be on a team with. Once I'm done with school I'd be so grateful to even make 50-70k a year!",
          "score": 34
        },
        {
          "body": "Life will always be unfulfilling if your only goal is $ lol. Even richest people in the world go unfulfilled. You sacrificed enjoying life, for fleeting money that won't follow you into death. This is why I have no respect for TC chasers.",
          "score": 6
        }
      ]
    },
    {
      "title": "San Jose Cisco summer internship likely hood?",
      "body": "I recently changed my major to computer science in my sophomore year of college. I carry a C average gpa.I know gpa is what makes you attractive as a student to internships . But this coming fall/spring semester I want to do well academically, and get involved in some projects on campus. Also to mention I have an uncle who works for Cisco as a rep. If I got a recommendation from a Cisco employee, and got my gpa up fall/spring semester could I land a 2023 summer internship?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/uqgs5r/san_jose_cisco_summer_internship_likely_hood/",
      "comments": [
        {
          "body": "&gt; If I got a recommendation from a Cisco employee, and got my gpa up fall/spring semester could I land a 2023 summer internship?\n\nThose are a lot of if statements.\n\nNo one can say for certain... even with family working there.",
          "score": 12
        },
        {
          "body": "You can't just get a referral from someone and have it automatically turn into an internship offer lol. Most likely it'll get you past the resume filter and then you'll still need to do a coding interview or something. \n\nI wouldn't say GPA is a deal-breaker but you should definitely try to study harder and improve your grades.",
          "score": 4
        },
        {
          "body": "Doubtful. See if you can get your GPA up.",
          "score": 3
        }
      ]
    },
    {
      "title": "Interview Discussion - June 19, 2023",
      "body": "Please use this thread to have discussions about interviews, interviewing, and interview prep. Posts focusing solely on interviews created outside of this thread will probably be removed.\n        \nAbide by the rules, don't be a jerk.\n        \nThis thread is posted each **Monday and Thursday at midnight PST**. Previous Interview Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Interview+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/14d74y9/interview_discussion_june_19_2023/",
      "comments": [
        {
          "body": "I have a Cisco Meraki final interview for their fall Product Software Internship. The topics given are graphs and DFS (in my choice of C or C++). Anyone have any advice or been through the same process?",
          "score": 1
        }
      ]
    },
    {
      "title": "Applied to 200+ jobs, 0 interviews — what’s wrong with my resume?",
      "body": "Hi everyone,\n\nI’ve been applying for multiple jobs that LinkedIn suggests based on my profile, in several countries (Europe and the Gulf). But every single time, I just receive the same rejection email — no interview, no consideration.\n\nAt this point, I’ve applied to more than 200 positions, and not even one company has given me a chance. The only exception was someone in the Netherlands who said they could move forward if I spoke Dutch… which I don’t.\n\nI’m really confused because:\n\t•\tI studied at top universities.\n\t•\tRight after graduation, I joined a multinational company.\n\t•\tI’m currently a Procurement Manager at just 28 years old.\n\nOn paper, everyone tells me it should be easy for me to land a job. But the reality is I can’t even get a single interview.\n\nI’ve attached my CV here. Could you please take a look and tell me what’s wrong or what I could improve?\n\nThanks a lot in advance 🙏\n",
      "subreddit": "jobs",
      "score": 38,
      "url": "https://reddit.com/r/jobs/comments/1ne7ylz/applied_to_200_jobs_0_interviews_whats_wrong_with/",
      "comments": [
        {
          "body": "INFO: where are you currently living? where is the job with Huawei?\n\nThe two things that stands out to me is that you don't really have any ties to the EU and half your resume is internships that were all in September of 2024, it's ... weird.",
          "score": 48
        },
        {
          "body": "It should be one page, I would get rid of the summary as well.\n\nExperience that you would like to highlight should be allocated under additional experience\n\nLanguage, trainings, certificates, volunteering under smth like language skills and extra - curricular activities",
          "score": 55
        },
        {
          "body": "The bold in the summary is very AI ish. If you need things to stand out in the summary, make it shorter.",
          "score": 13
        },
        {
          "body": "Your resume should be one page long. If you do have a lot of applicable experience it may be two. However, in your case, just make one page. Shorten your job description, list most relevant skills, delete summary and create a cover letter instead. Additional training and internships could be added in the application page of the job you are applying for. \n\nLastly, your experience needs to more reader friendly for recruiters. For instance under project management you mention delivery of sites next to with what i assume to be project names. You should reword that an add something along the lines of working with cross-functional teams to align with business requirements etc. Also, mention if you created business requirement documents or did any kind of UAT or QA\n\nI hope this helps a little and best of luck in your job search!",
          "score": 9
        },
        {
          "body": "Have you considered non EU countries like middle easy or SEA?\n\nUnless you’re a genius at a niche, Arabic with Chinese academic experience is definitely something employers pass out on",
          "score": 7
        },
        {
          "body": "The resume is difficult to read. It took me a full minute to realize you have 4 years of experience, but with the amount of items on the resume, I would expect 20 years.\n\nThe internships section doesn't make sense to me. They are all listed as Sep. 2024, and all are in different countries. I would remove them entirely, leaving only the internships related to your current company (Huawei), and move the Huawei internship to the \"Experiences\" section.\n\nThe summary is not needed, as it repeats information from the rest of your resume. You can consider keeping the summary if you adjust the summary for \"personal flair\" and if it speaks about something not present in the rest of your resume.\n\n  \nI'm not qualified to comment on **content** of your experience or skills for couple of reasons:\n\n1. I don't work in this domain\n2. I'm not sure what kind of jobs you are applying for\n\nAgree with other comments about keeping resume to 1 page if possible. Good luck!",
          "score": 8
        },
        {
          "body": "You spelt 'software' wrong in your skills section. I know hiring managers who would toss this CV on the basis of that alone.",
          "score": 6
        },
        {
          "body": "A resume is supposed to be 1 page unless you have a ton of experience.",
          "score": 11
        }
      ]
    },
    {
      "title": "Interview help: What would you expect an entry-level (0-6 months) to know? This would be a network support job working with Cisco's telepresence. ",
      "body": "I have about 6 months of experience through the military as a reservist - I have A+, Net+, Sec+ and CCENT certs. \n\nI'm interviewing for an entry level contractor position where I would be supporting Cisco's telepresence. What should I know?",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/elctm/interview_help_what_would_you_expect_an/",
      "comments": [
        {
          "body": "This is going to sound ridiculous, but know MS Office- well. I did IT consulting for years and now work in software design where our contractors outnumber employees 6:1. I don't care how well contractors can code, fix a network, or design a solution; if they can't set up a meeting in Outlook, put together a detailed time estimate in Excel, write a professional-looking technical specification in Word, diagram the system in Visio, and present to my team in a clean-looking PowerPoint, then I'm not likely to take that contractor too seriously and will opt to work with someone else who has the technical skills I need AND the functional skills to use basic office software.\r\n\r\nGood luck on your interview!",
          "score": 2
        }
      ]
    },
    {
      "title": "System Admin debating transitioning to C# development: Should I apply to Tech Support, System Admin, or Junior Developer roles?",
      "body": "I've been working help desk and system admin roles the past 3 years. I also have CCNA, Azure, Comptia, and Linux certs, but I still get messages from recruiters mainly for tech support 6 month contract to hire roles. My current role as a sysadmin feels more like software dev because the other people on my time work so much with python, linux, ansible, and docker.\n\nI've also had some friends advise me to learn c# and apply for a junior dev role. He also mentioned that dev roles usually are remote more often, and less on call work too. I know the basic sytax off of w3schools and sites like that. But, I'm unsure if it will take a lot longer and if it will require a lot more to get a junior dev job and if my friend is being unrealistic?\n\nBut, I have had other friends say that it would be dumb to switch to development because everything I've done so far is irrelevant, and I would not be able to get an interview even. And even if I did that I would get destroyed by leetcode and complex math algotrithm and logarithmic regression type questions. Are these things true or is this view being too negative of development?\n\nBecause even with system admin even though they don't do leetcode; I've had interviews where they focus on everything from VMware, Cisco, Cameras, SonicWall, SolarWinds, to roles that are almost programming where they want someone that knows Java, Python, and API containerization. Whereas, I feel like at least development you know what languages to learn to use for your particular role.\n\nSo, should I apply for tech support, system admin, or development roles. Considering my current certs and qualifications. And would it really take 4 to 5 years to get a coding job like the negative friend was saying?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/112jurg/system_admin_debating_transitioning_to_c/",
      "comments": [
        {
          "body": "Every place is going to differ in this based on what is being developed, but I can at least share some thoughts from my experience, as it has some similarities.  If you want to get into software development, go for a Junior Developer role at a place that will invest in your growth - paired with a senior developer, training programs &amp; variety of applications being built/enhanced.  Also start a GitHub profile and go though tutorials in C#, React, Angular, etc. to show some initiative outside the system admin world.  During interviews, focus on your help desk experience as a way to relate with customers/understand requirements and use your system admin experience as ability to solve complex problems &amp; architect solutions.  Also, be honest about your shortcomings - it's much easier to dismiss those who oversell, vs someone with high aptitude and potential that just needs to be taught and exposed to something new.  At the right company/environment, you'd be a mid-level developer in 2-4 years.\n\nSystem admin positions can get you more experience on a variety of platforms, but you'll at most be scripting instead of developing.  Tech support roles really don't sound like the direction you want to head next.",
          "score": 1
        },
        {
          "body": "Pension is a great thing that not many have anymore, but probably hasn't vested yet if you've only been there 3 years, so probably want to verify what makes you eligible for that so you know your long-term timeline, which would also help determine if you want to spend the time getting a degree for free, while building up your coding skills.\n\nAre there any developer positions at this uni, or just sys admins?",
          "score": 1
        }
      ]
    },
    {
      "title": "tips for coding assessment",
      "body": "i have an entry level interview coming up in a week and i want to know what sort of problems should i practice? should i just tackle every leetcode medium i can? the company is cisco if that matters.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/116monj/tips_for_coding_assessment/",
      "comments": [
        {
          "body": "last 6 months lc shows (sorted by frequency):\n\n1. Validate IP Address\n2. Maximum Difference Between Increasing Elements\n3. Word Search II\n4. Burst Balloons\n5. Rotate Image\n6. Longest Palindromic Substring\n7. House Robber\n8. Word Search\n9. Decode Ways\n10. Maximum Subarray\n11. Spiral Matrix\n12. Merge Intervals\n13. Fizz Buzz\n14. Add Two Numbers\n15. Best Time to Buy and Sell Stock\n16. Linked List Cycle\n17. Two Sum",
          "score": 14
        },
        {
          "body": "Strings, maps/sets, then trees, then everything else in that order of priority.",
          "score": 7
        },
        {
          "body": "look on glassdoor and see if the interview is described. sometimes people will post the specific questions you’ll be asked",
          "score": 2
        },
        {
          "body": "Buy Leetcode premium. Go to the questions by Cisco. Then sort questions by frequency and apply the \"last 6 months\" filter. You'll see the most frequently asked questions by Cisco in the past six months. I'd work through those in order of frequency.",
          "score": 4
        }
      ]
    },
    {
      "title": "Applied to 200+ jobs, 0 interviews",
      "body": "Hi everyone,\n\nI’ve been applying for multiple jobs that LinkedIn suggests based on my profile, in several countries (Europe and the Gulf). But every single time, I just receive the same rejection email — no interview, no consideration.\n\nAt this point, I’ve applied to more than 200 positions, and not even one company has given me a chance. The only exception was someone in the Netherlands who said they could move forward if I spoke Dutch… which I don’t.\n\nI’m really confused because:\n\t•\tI studied at top universities.\n\t•\tRight after graduation, I joined a multinational company.\n\t•\tI’m currently a Procurement Manager at just 28 years old.\n\nOn paper, everyone tells me it should be easy for me to land a job. But the reality is I can’t even get a single interview.\n\nI’ve attached my CV here. Could you please take a look and tell me what’s wrong or what I could improve?\n\nThanks a lot in advance 🙏\n",
      "subreddit": "jobs",
      "score": 709,
      "url": "https://reddit.com/r/jobs/comments/1nfz3mx/applied_to_200_jobs_0_interviews/",
      "comments": [
        {
          "body": "Being outside the country would be an automatic rejection for us ",
          "score": 542
        },
        {
          "body": "If you only hold Algerian citizenship then you're looking at a much harder uphill battle than Europeans seeking work in Europe, since they'd need to sponsor you for work. They'd prefer, and would normally be legally required, to consider people who don't need sponsorship first.",
          "score": 231
        },
        {
          "body": "- Outside of the place you're applying for\n- Concerning Chinese-focused work history is a disqualifier for some employers\n- Resume not written in a \"SBI\" format / STAR format / PAR format",
          "score": 125
        },
        {
          "body": "I work in HR admin and the only “knock out” question we have on applying is “do you currently have the right to work in the UK?” If you say “no” you are not even being considered. Most companies do not sponsor workers. It is expensive and bureaucratic and they can just find a person who already has the right to work in the country and have to pay zero to sponsor or go through paperwork. Your CV looks good but I don’t see anything that would mean your skills are so ultra specialised that someone would be rushing to sponsor you. It is just the hard truth I am afraid.",
          "score": 34
        },
        {
          "body": "I don't think any Western tech company would want to work with a person who work with Huawei and the Chinese government. Keep on applying to companies or government positions in countries that are down with the Silk Road initiative.",
          "score": 133
        },
        {
          "body": "Most places are extremely disinterested in visa sponsorship. If you’re applying for jobs outside of the country you currently live in there’s probably less than 1% chance you’ll hear back.",
          "score": 26
        },
        {
          "body": "Chinese employer and need visa sponsor, nope.",
          "score": 53
        }
      ]
    },
    {
      "title": "Cisco Assistant Sales Representative video interview soon!",
      "body": "As per the title, I have to on monday submit to Cisco a 2 minute interview video answering the question \n\nWhy a career in sales?\n\nI have general views etc on what to say but I would appreciate help on making a really good answer that will help me shine a little brighter than the rest. I really need this opportunity for reasons I shant go into beyond just wanting the Job quite badly.\n\nThanks reddit",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/185cg2/cisco_assistant_sales_representative_video/",
      "comments": [
        {
          "body": "Is this the associate sales rep job?",
          "score": 1
        }
      ]
    },
    {
      "title": "Looking for Resume Feedback + Cybersecurity Job Advice (SOC / Pentesting)",
      "body": "I’m preparing for an entry-level cybersecurity role (SOC Analyst or Junior Pentester) and would appreciate feedback on how to strengthen my resume and improve my chances of getting interviews.\n\nMy background:\n• Completed CompTIA A+, Network+, Security+, and the IBM Cybersecurity Analyst Certificate.\n• Hands-on practice with Wireshark, Nmap, QRadar (guided labs), and Python scripting for small security utilities.\n• Previously worked as an apprentice at Cisco—was supposed to convert to full-time, but it was dropped due to budget cuts.\n• Currently building practical skills through Python security projects, TryHackMe (Pentest+ pathway), networking labs, and learning AWS security tools right now.\n• Improving my coding skills too (around 5/10 currently and working on it consistently).\n\nLooking for feedback on:\n• Whether my skills and projects fit entry-level SOC/pentesting expectations\n• What I should adjust or highlight to make my resume more effective\n• Advice on increasing interview calls and visibility, especially as I plan to job hunt in Bangalore starting January\n\nIf anyone wants to help with referrals, feedback, or has hiring insights, feel free to comment or DM.\nThanks for taking the time to help.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1pba10l/looking_for_resume_feedback_cybersecurity_job/",
      "comments": []
    },
    {
      "title": "Should I take a lateral job offer with high scope creep, stay where I'm at, or keep searching for better opportunities?",
      "body": "I’m weighing a lateral move from my $100K cloud admin role to a newly acquired private equity–backed company offering the same pay. While they claim financial stability, they asked questions from broad technical range they expect—from VMware and Hyper-V to Cisco ASA, FortiGate, Sonicwall, and Linux—suggests a potentially overloaded “jack of all trades” role. I asked the interviewer and he made it out like I wouldn't be pidgeon holed and would learn new things. Since it's a company owned by PE I'm worried about having to stretch myself thin and being let go.\n\nMy current position is a cloud migrations role which demads extra goals including certification completion, 80 hours of linkedinlearning training, 6-15 process improvements, provisioning ticket calls, 2 presentations, all while managing meetings for 2 to 8 cloud migrations projects simultaneously. The goals can be done yearly but it still feels like a lot The main draw was the possibility of better coworkers and a reduced workload, but neither can be guaranteed.\n\nI feel like they're almost rushing me to take to the job too. Because I told the recruiter it was hard to tell if I'm a system admin, network admin, or devops guy because it sounded like the role wanted a little bit of everything. I've worked in understaffed roles where I had to do the job of multiple people before with scope creep. He said that taking tickets is just the responsibility of the job, I'd be learning more by not being pinned to one role, and that I'd never be bored and there's 4 other people on the team. So, idk what to make of that lol.\n\nMy current job also has a lot of goals so that's what has me considering leaving. Interviews have been hard to come by the last 2 years as well, and idk how I'd get the time to interview going forward with how much meetings I have to do at work. At the same time, idk if it's worth leaving for this job?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1moff6u/should_i_take_a_lateral_job_offer_with_high_scope/",
      "comments": []
    },
    {
      "title": "Private Equity Company Job Offer: safe bet or avoid?",
      "body": "I got another offer at the same pay from a company recently bought by a private equity firm. They assured me there’s no layoff risk because they made $100M last year, but I’m skeptical. In the interview, they asked about a huge range of tech from VMware and Hyper-V to Cisco ASA, FortiGate, Linux, and more—it felt like they wanted a network, system, cloud, and DevOps admin rolled into one. One question they asked—whether I prefer deep technical focus or learning a wide variety—seemed like a hint that the role might be overloaded. Now I’m unsure whether to stick with my current situation, or gamble on a role that could have the same overwork issues but even more unstability due to the PE acquistion?   \n\n\nI’m currently in a cloud admin role making about $100K, but my manager just set a laundry list of intense yearly goals: earn a new certification, complete 80 hours of LinkedIn Learning (40 PowerShell + 40 soft skills), make 6–15 process improvements, close 10–25 client-facing support tickets, deliver 2 presentations, and still juggle 6–8 concurrent migration projects. It feels like a lot, even compared to my already heavy workload. It's not a given that the workload will be better in the other role either. Given all the tech stacks they asked about I really doubt it. \n\nI was considering moving for the chance of having better coworkers. It's not guaranteed that they will be any better either. Both roles are remote, so I doubt there will be much where we can get to know each other or have better camaraderie in either role. ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1mnwmnw/private_equity_company_job_offer_safe_bet_or_avoid/",
      "comments": [
        {
          "body": "NEVER work for a company that’s been acquired by a private equity firm. They are vultures picking clean the carcass of a long dead company. They are there to extract value from a cash poor but asset rich company that was drowning in debt. They will layoff long time senior employees to get rid of accumulated PTO/vacation time obligations. They will ask managers to do more with less likely in terms of headcount and the kicker is that they will assure everyone that no one is getting let go. Right up until the mass firings begin. When they have squeezed as much value as they can after selling off parts of the business as well as cutting labor costs and doubled or tripled their investment, they will shutter the company",
          "score": 2
        }
      ]
    },
    {
      "title": "Should I Switch to Software Development or Stay in IT Systems?",
      "body": "Hey everyone,\n\nI’m at a major crossroads in my career and could really use some advice. I’ve been working as an IT Systems Technician for the past 4 years, handling networking, system administration, security, backups, and troubleshooting. The job has given me solid experience, but career growth has been uncertain.\n\nRecently, I had an opportunity for my salary to increase to $550 per month at my current job, but at the last minute, the company announced that they are not doing well financially and have stopped all promotions. Right now, I’m still earning $243 per month with no clear path for a raise.\n\nAt the same time, I had an interview for a software development role in an NID (National Identity) system project under NSIA (National Statistics and Information Authority). The job involves Spring Boot (Java) and Angular to build a national identity system. If I get selected, I’ll have one month before the job starts, and my salary would jump to $350 per month—a significant improvement.\n\nI’ve also applied to other jobs, but with Afghanistan’s job market being so tough right now, I haven’t heard much back. So I need to make a decision soon.\n\nMy Experience &amp; Skillset:\n\nIT Systems &amp; Network Management (Cisco, Mikrotik, Ubiquiti)\n\nServer Administration (Windows Server, Linux, VMware)\n\nCybersecurity &amp; Authentication (Firewalls, RADIUS, LDAP, JWT, WSUS)\n\nDatabase Management (PostgreSQL, MySQL, Backup &amp; Replication)\n\nScripting &amp; Automation (Python, Bash, PowerShell)\n\nBasic Java &amp; Object-Oriented Programming\n\n\nI don’t have experience in Spring Boot or Angular, but I’m willing to focus on one and learn as much as possible within one month before starting the job.\n\nHere’s Where I’m Stuck:\n\n1. If I move into software development, will my 4 years of IT systems experience go to waste?\n\n\n2. Can I realistically learn Spring Boot or Angular in one month while working?\n\n\n3. Should I focus on backend (Spring Boot) or frontend (Angular) to increase my chances of success?\n\n\n4. Would staying in IT systems and transitioning into DevOps be a better long-term move?\n\n\n5. Since this is a government job, it offers stability and security—should I take it just for that?\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1iq1ob0/should_i_switch_to_software_development_or_stay/",
      "comments": [
        {
          "body": "What are these dollar amounts?\nAre you typing correctly?",
          "score": 1
        },
        {
          "body": "Not sure I would take any of those job for that pay🤣",
          "score": 1
        }
      ]
    },
    {
      "title": "What are some great interview questions to ask the interviewer?",
      "body": "What are some great questions to ask at the end of an interview? I'm in IT and some of my basic go to questions are, \"How many computers do you have on site?\" \"What brands do you use like Apple and or Dell or Cisco?\" \"How many clients do you have and what brands do they use?\". \n\nIf there are any other questions you can think of post them below as I'm sure it would be helpful for me and other people. Even if its basic questions it probably goes a long way in the process.",
      "subreddit": "jobs",
      "score": 39,
      "url": "https://reddit.com/r/jobs/comments/crt9mq/what_are_some_great_interview_questions_to_ask/",
      "comments": [
        {
          "body": "[removed]",
          "score": 21
        },
        {
          "body": "Would you describe your ideal candidate for this role? \n\nWhat are your goals for this person within the first 6 months?\n\nHow does a normal work week look like in this department?",
          "score": 7
        },
        {
          "body": "At the end of the interview ask \"Do you have any concerns about me as a candidate?\" \n\nGives you a chance to address those concerns directly. Like if they say they are worried about your lack of experience with xyz, you can back with the fact you've dealt with abc which is very similar to xyz and that xyz was covered in a college class you took so you do have some basic familiarity already.",
          "score": 15
        },
        {
          "body": "Why did the previous person leave this position? What you hope they will say is that they were promoted internally.",
          "score": 5
        },
        {
          "body": "Is this a new position or a filler? How many people are you looking to hire? How is performance measured? Who will I be reporting to? (Assuming you're not meeting with the hiring manager). What are opportunities for advancement? What have others in this position moved on to do?",
          "score": 3
        },
        {
          "body": "\"What keeps you here?\" This can be very revealing, watch them carefully. \n\n\"What was the last accomplishment your team celebrated?\" Tells you if they appreciate their people or if they just strip-mine them.\n\n\"What are the companies core values(if they weren't not he website?) Is the company living up to its core values?\" Can tell you what they are really looking for in a person.",
          "score": 3
        }
      ]
    },
    {
      "title": "What am I doing wrong? Why won't I still be hired for entry-level IT jobs I'm qualified to do? I've tried for years, I've done everything people told me to do, and I have nothing at all to show for it",
      "body": "I'm angry. I'm tired. I'm getting extremely frustrated. I've finished my daily limbo of applying for IT jobs that is as mundane and soul-crushing as it has been for the whole of 2022 and the start of 2023 as I write this as an angry cry for help:\n\n**What have I been doing wrong all these years?**\n\n[Here is my resume:](https://drive.google.com/file/d/1eUIt0yIvUfG5tIi2v8syp5IBOq19D4te/view?usp=sharing)\n\nI have plenty of basic IT knowledge and have the following skills:\n\n&amp;#x200B;\n\n* Windows Active Directory\n* Group Policy and Management\n* WSUS\n* Performance Monitoring\n* Computer Networking\n* Computer Imaging/Reimaging/Clean Operating Systems Installations\n* Help Desk Documentation\n* IT Ticketing Systems (ServiceNow)\n* Programming\n* CMD and PowerShell\n* Virtualization\n* Hardware/Software Troubleshooting\n* Web Development\n* Database Programming\n* PC Assembly/Disassembly/ Interior Maintenance/Parts Replacement/Diagnosis/Troubleshooting\n* Hardware/Software Maintenance\n* Communication\n* Leadership\n* Project Management\n* Teamwork\n* Customer Service\n* Microsoft Office Suite (All programs with 10+ years experience\n* Analysis Skills\n* Problem Solving\n\nAnd I have the following experience in these Operating Systems/programming language (my programming language knowledge however is basic)\n\n&amp;#x200B;\n\n* Windows XP/7/8/10\n* Windows Server 2016\n* MacOS\n* iOS/Android\n* Red Hat Linux\n* Kali Linux\n* SQL\n* Java\n* Python\n* JavaScript\n* Apple Swift\n* HMTL5/CSS\n\n&amp;#x200B;\n\nI also have tons of references from managers, colleagues, professors, co-workers who all speak highly of me and are on my resume. I have an Associate's Degree in IT. I have applied for so many jobs over the last year that I have lost count, along with hundreds of IT jobs in the last 4 years. I'll be 30 in 2 days.\n\nI wasn't getting interviews, but now I'm getting interviews, but ALWAYS being PASSED OVER for someone else. It's infuriating. The last job my recruiter tried getting me, NOBODY got hired out of 10 candidates. I also am fairly certain I am doing well in my interviews. I am confident, I give good posture, I wear nice clothes, style my hair properly to loom professional, have good hygiene, trim my facial hair to be neat and presentable, answer their technical questions and personal questions with not talking too much but giving a good amount of detail to the question and always try to demonstrate my intelligence and education.\n\nI don't have any real work experience though that these stupid American companies find desirable. The only thing I have is the stuff I did for my 2 year Associate's Degree in community college, the 4 years of volunteer IT work at my Australian community college, 1 year at Teletech as help desk support, and 3+ years of working as an IT person for a mom-and-pop mechanic shop where I set up their computer/network and do their IT maintenance for them while they pay me in cash for the hours I work (it's basically under the table contract work, but the manager vouches my work as a great reference).\n\nI also don't have a Bachelor's Degree (yet) as I have applied for University and am hopefully getting a Bachelor's in Information Systems (I don't like Computer Science) with a second major in Japanese studies/the language during the next 3-4 years.\n\nThe other thing that pains me and infuriates me when people bring it up is I have permanent facial palsy, so I do have a speech impediment, however my speech is understandable and I have had years of speech therapy as a child. Technically yes I am disabled, and have been living off SSI for the last 4 years which was a terrible mistake, and I am trying to get off of it with a proper IT job. I've also been discriminated not only for my disability, but my race as well (I'm Southeast Asian/Thai) although I've never been able to sue for it due to lack of incriminating evidence that would be acceptable in court.\n\n&amp;#x200B;\n\nThis is the experience I have:\n\nComputer Technician (3+ years) for mechanic shop:\n\n\\-Built and installed main office computer along with hardware/software maintenance and troubleshooting.- Installed modem, routers, set up 2.4Ghz/5Ghz Wi-Fi and Ethernet network while configuring and diagnosing network issues.- Set up system administration. Installed, maintains, configures, and troubleshoots printers, mobile phones, tablets, and customer entertainment system.- Handles all technology errands, requests, and gives advice/solutions when asked for technological improvements and upgrades.\n\nTeletech (1 Year)\n\n\\- Learnt how to install Windows 10 Enterprise onto a secure encrypted USB Flash Drive. Learnt how to login into a secure Workbooth as well as login into various secure Windows 10 and Windows 7 Virtual Machines and balancing all of them to perform work related tasks. Also learnt how to use Windows VDI (Virtual Desktop Infrastructure)- Learnt how to operate Cisco IP Telephones, as well as how to call customers and co-workers through the phone. Also learnt how to put customers on hold, how to transfer to another call, how to create a conference on the phone, and how to transfer from group to secondary calls.- Learnt about HIPAA, customer security, how to handle important documents, private and secure informnation, confidential classified info, etc.- Learnt how to look up information online regarding to assisting customers on the phone- Learnt how to look for customer's member ID through the system, how to locate important data such as policy numbers, payment due, overdue payments, SSNs, confirmation numbers, etc.- Learnt how to change customer PCP (primary care physician), how to make a payment online as well as read statements in verbatum, how to make split payments, how to pay in installments, how to change addresses as well as passwords, how to verify information, basic customer service mannerisms and operations, learnt all about healthcare basics, healthcare policies and updates, healthcare security and privacy, how to verify customer ID cards and mailing ID cards as well as PCP information, and how to update policy handbooks as well as mailing them to customer.\n\nCanberra Institute of Technology (Voluntary IT Staff 3 years voluntary experience)\n\n\\- Help-desk support- Technical support specialist- Customer service- IT training\n\n\\- System Administration (Windows Active Directory)- PC Assembly/Disassembly/Maintenance- PC Parts Replacement- PC Diagnosis/Troubleshooting- Observed training new staff- Documentation- Software Maintenance- Hardware/Software Troubleshooting- Virtualization- Operating System Installations- Virtual Machine Installations- Microsoft Office- Hardware Assembly/Disassembly- Cleaning/Maintenance\n\nWith my LinkedIn, I took my parents who are a Business Analyst and an accountant with a MBA, studied their profiles and copied their formatting to make my own LinkedIn as professional as possible. Most of the stuff you see on here are taken from my resume and LinkedIn. It also gets noticed daily by people and I get messages from recruiters offering me job applications in IT.\n\nAlong with all of this, I constantly self-study, am always learning and updating my knowledge on technology and what's new/evolving, constantly trying to improve my knowledge and experience with learning new skills, and am studying to get my COMPTIA A+ certification.\n\nAnd despite all of this... **I still have not gotten a goddamn IT job. I've wasted so much of my life trying to get my foot into this god-forsaken field but nobody will hire me for an entry-level position when I feel I am CLEARLY qualified to perform the tasks and learn to improve my IT knowledge and experience. It's a catch-22 with this field. I need the experience to get the job, but I need the JOB to GET the experience (especially since no internship has taken me). I've never gotten a single internship or job offer as I was always passed over FOR SOMEONE ELSE.**\n\nI've built computers from scratch at home and at college, I've fixed broken computers and laptops, I've replaced parts, installed operating systems, changed operating systems, programmed basic software applications, designed websites, done ticketing systems, monitored performance on computers/networks, written into knowledge bases online and have documentation experience, led a real life IT project in college for a museum, trained myself to use Windows servers at home by virtualizing 3-4 servers and desktops with VMWare so I could learn Windows Server 2016 and Active Directory, I've taken proficiency and assessments tests on recruitment websites and took them until I got a high score to impress interviewers, I've set up my own networks and other people's networks, routers, printers, etc.\n\nI've used so many job search websites: Indeed, LinkedIn, Monster, DICE, SimplyHired, ZipRecruiter, as well as applying to HUNDREDS of company websites and recruitment agencies. NOTHING but interviews and that's it, or not even hearing from them, or the most insulting: A damn automated message saying \"They're going with other people\".\n\nI get good feedback from people and constructive criticism on how to improve my interview skills from recruiters and have had years of interview experience. YEARS.\n\nWhat the hell am I doing wrong? I've followed everyone's advice and have gotten **NOWHERE.** What am I supposed to do to get into this field?! My career has been meaningless because it has never taken off. At this point, I have a better chance of getting better at digital art and somehow making money off that than getting an IT job and starting my IT career...\n\nTell me what I'm supposed to do to get an IT job and start my IT career when **The United States of America does not want to hire me for a single IT job let alone an entry-level one**",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/110z5tj/what_am_i_doing_wrong_why_wont_i_still_be_hired/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "This is just an opinion, and perhaps i am wrong, but i think the main problem is that your resume is way too broad, you cover stuff that goes from sys support to building computers, try to focus your resume information to stuff that its related to the company you are applying to, also try to keep a humble attitude that you want to learn the ropes, try to use a custom made template to your CV and talk in it about specifics example: ~~Kali Linux~~ instead try to say something like \"performed vulnerability scan in a network using Kali Linux\" that opens the interviewer to questions like \"what tools did you used?\" \"How you learned that?\".  \n\n\nand most importantly, don't get frustrated, sometimes it takes time to land in the right place, life is not a race. \n\n&amp;#x200B;\n\nHope any of my advice helps you, stay strong.",
          "score": 9
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "Interviewing is tough and it's one of those things where you can check all the boxes and still get passed over like the one you mentioned where they basically went back to the drawing board. The thing that worked well for me is I finally realized to stop getting \"into the weeds\" when I would talk about processes and such in my previous jobs. You have to be detailed enough to prove that you know your stuff, but also succinct enough that you're not going to bore people who don't even want to be part of these interviews.\n\nAre a lot of the roles you've applied to direct hire, where you work for the manager/company doing the hire, or are they contract work where you get hired by another firm to work with said manager/company? If you're having difficulty with one route, try the other. Especially if you're looking at work in the private sector where budgets seem to keep getting crunched.\n\nAs far as your resume goes, you need to integrate your skills more into your job descriptions and give us a better idea of what you did in these roles. Like the system administration one for example. How many devices were you supporting (ballpark) in this role? Quantifying your resume bullet points will go a long way in the work you're looking at.\n\nI'd probably also remove the line in the header with volunteer/onsite experience. It doesn't really add value here and I'd probably also trim your resume down to one page.\n\nThis is another one that's field dependent and I don't really have a good answer, so I'm going to defer to other redditors that might have better knowledge. In IT, is there a standard format for quantifying volunteer projects and tasks that are relevant on a resume, or is it something you usually just leave on LinkedIn? I ask this because of the four things listed in the activities area, only the IT project for the historical association is really relevant. \n\nYou also have a gap on the resume and while it shouldn't matter, it's one of those things that could be the difference maker between getting interviews or not. Were you doing anything relevant to IT in this three-year span?\n\nFinally, you mentioned that you want to complete a bachelor's degree in the next three to four years. Is there a way for you to accelerate that timeline and finish it in two (or at the most three)? I ask this because if you wanted to go the full-steam ahead route you could solely focus on academics during the semester and work to find the best internships that you can during the summers. What I don't want happening is you taking even longer to finish your school if you're not having gainful employment in the meantime. But if you land an IT gig that pays really well, of course I'd say focus on that full-time and do the school part-time. \n\nWhat's the workforce like in your area? Are you going up against people that primarily have the same associate's degree / experience credentials as you or do they all have bachelor's degrees and even more experience? Companies might substitute education for experience, but it's still tough in 2023 to sub experience for education if said employers have bachelor's degrees as a minimum in their job postings.",
          "score": 2
        },
        {
          "body": "I fixed my resume according to the comments.\n\n[Here is how it looks now](https://drive.google.com/file/d/1eUIt0yIvUfG5tIi2v8syp5IBOq19D4te/view?usp=sharing)",
          "score": 1
        },
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Is it an insult for your manager to offer you a lowball pathetic raise?",
      "body": "I started a job about a year ago as a support engineer and was super excited. I majored in IT in college and graduated in 2020 and was real interested in networking which prompted me to join this company in the first place. I thought I would be shadowing a network engineer and doing lots of networking but almost a year in, I realized that the growth here is definitely not as I expected. \n\nWhen I joined, we were down a voice engineer on my team and that put a lot of stress and pressure on me to learn voice. My manager mentioned to me that I would be promoted to a Tier 1 engineer in July because of all the hard work I've done so far. She said if I passed the CCNP CLCOR (Cisco Collaboration cert), she'd give me a 5k pay raise. Right after that, I felt pretty insulted because anyone that has a CCNP certification should not be getting a 5k raise. I'm getting paid 40k + a 5k bonus which is usually less because the bonus depends on a bunch of different factors. Hell, I didn't even get an inflation raise and inflation is at a good 8% this year. I didn't study 4 years of college to get a job that earns the same amount as someone who didn't even go to college. Mcdonalds probably makes more than me. I realized how notorious this company is for underpaying workers after I joined. I lost all motivation in this company after talking to my manager about my yearly raise and immediately sought out to find another job. Keep in mind I have to actually pass this hard test in like 4 months to get this raise, with barely any training. I tried to learn on my own but watching videos is different from knowing how to do it. \n\nI really think I'm pretty stupid to accept such a low ball offer, but I guess I didn't even mind because I thought I would be growing quickly. I took a 5k pay cut from my previous job to join this one. If you have read up to here, you must really be enjoying my story. Anyways, I've been interviewing with a different company and I'm very close to being accepted in.  The salary is basically doubled, but part of me feels a bit guilty and fake for kind of doing everything in secret. Regardless, this is business and I gotta do whats best for me, so I don't really care. Anyone got a similar story that they just want to rant out and thoughts on companies underpaying you? Reddit, give me your stories on these companies tryna underpay you.\n\nTLDR: How do you feel about companies underpaying you?",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/u1bd3i/is_it_an_insult_for_your_manager_to_offer_you_a/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "This sounds like something which probably has to do with your company's leadership and not your manager.\n\nTypically, managers have limited control over the raise and bonus amounts. Sometimes they're given a maximum amount (e.g., the most you can give a top performer this year is 3 percent, even though inflation is 8 percent)  and/or a fixed pool to give raises to their team from. \n\nSome companies have steps and fixed raises (like lockstep raises based on tenure).\n\nSome also have bands for a job where if you’re essentially maxed out unless you change jobs. \n\nSometimes they have pretty much no say, like when leadership decides there's going to be  a pay freeze, or if you have a control freak leader like the CEO of my former company who had sole control over all salaries and raises and bonuses even though the company was quite large.\n\nI mean, I'm not saying you should stay (I think you should interview for other jobs) but I'm saying that your manager has less control over this than you think.",
          "score": 4
        },
        {
          "body": "Like 0%?",
          "score": 2
        },
        {
          "body": "Like others have said here, it’s not up to your manager so don’t hold it against them.\n\nI was in your exact position from a salary perspective, but in data analysis. Started connecting with recruiters a month ago and just accepted an offer for over double my current salary with a larger company. Sometimes the answer is to test the market, and if you *really* like your job barring its pay, you can leverage an offer against them for higher salary. I was in that scenario — just randomly applying to see what was out there, until I got an offer at a rate I knew my company couldn’t even sniff.\n\nAt the end of the day don’t wait around for your employer to take care of you. That’s your responsibility.",
          "score": 2
        },
        {
          "body": "Raise should keep up with inflation. Anything less and you’re making less than you did last year. So whatever your salary is I would expect 5% minimum in these times. Anything over 7% would be a great raise. Anything below 4% Is shit. Don’t feel guilty about seeking other opportunities, the “family” work environment companies push today is bullshit, it’s a job, you’re there to make money.",
          "score": 1
        },
        {
          "body": "you basically need to do what you are in the process of doing\n\nan average COLA increase is between 2-3%.  A solid merit raise is maybe 5-7.  It's really rare to keep pace with someone who jumped a lot externally.",
          "score": 1
        }
      ]
    },
    {
      "title": "Rejected Three Hours after Applying",
      "body": "I applied for a job at Cisco and based on a questionnaire I completed months ago, I’ve been rejected (twice) three hours after applying. I have never been so peeved. It’s a project manager job, I have transferable skills, plus proper certifications (CSM and CAPM)and I’m being rejected. I’m truly frustrated. Even more frustrated with my current job because they don’t appreciate their workers.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/vi1hh4/rejected_three_hours_after_applying/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Sometimes these jobs don’t really exist. At big companies like Cisco they sometimes have to post jobs even when they already have an internal candidate slotted into the role. It’s a compliance thing. Sometimes this is the case even when you get an interview. You might even nail the interview and give them something to think about but they already know who is going to get the job before they even interview. How do I know this? I’ve been made to do this exact same thing by my HR. \n\nThe conversation goes like this ….\n\nMe: Hi HR Person, As you know I have an opening on my team and I’d really like to promote Brian into the role.\n\nHR: OK, but you will need to post the job publicly for 1 week and interview at least one external candidate before we can give Brian the job.\n\nMe: OK, how soon can we start this process of wasting everybody’s time?",
          "score": 3
        },
        {
          "body": "The Cisco where I live is super competitive. It sounds like you’re missing some requirement from the questionnaire. Or there might be stronger candidates with direct experience.",
          "score": 0
        },
        {
          "body": "I'm not assuming every job I didn't get is fake. You specifically responded to a comment that specifically states they were instructed to set up a fake interview in order to hire internally. That is a fake job posting.",
          "score": -1
        }
      ]
    },
    {
      "title": "Should I start applying for jobs, or stay in my role so that the longer experience looks better on my resume?",
      "body": "Now I'm working as an data entry type analyst montonous job, that pays around 40k. I've been here almost 10 months, getting really tired of it though, and feel like I'm not learning anything and it's only a 2 year contract role. It also sucks we don't get paid for taking time off. So, I'm debating if I should apply for other jobs or not? It is good that I get to work from home though.\n\nThe only thing is additional rules and job duties have been added every few weeks since I've been here. It started off just doing tickets. In the interview he said we wouldn't do or take calls. Then we got these sepearte tickets that qued for us where we have to call stores to fix devices, and it's annoying because they tell us to call back, or it takes 40 minutes to fix the issue when they actually do answer. Also, around Christmas time we had to take help desk calls which we were told we would not be doing since we were hired for an analyst role. We also have these long 1 hour to 1 hour and a half long meetings almost everyday because he'll take his time to explain things. Sometimes the manager will even bring us into 1 on 1 meetings at random times of the day, which gets really annoying at times.\n\nI've gotten Comptia A+, Net+, Sec+, Microsoft Admin, Azure, Cisco CCNA, and Linux LPIC certs. So, I feel I could be doing a job that pays more. I have had recruiters message me for roles that pay 55, 60, and 1 that even offered 70k. But, the 70k one was for a startup that had really bad reviews online: high turnover, 10 hour days, and micromanagement. The others were 6 month contract to hire help desk roles, which I denied because I didn't want to do work where I have to take calls, and the contract deal  didn't seem very trustworthy long term.\n\nShould I stay at my current role until the 2 year contract is up, so that the longer experience looks better on my resume? Should I start applying for roles? Or should I take these bs contract or startup roles that these recruiters keep messaging me for lol? Another reason I'm scared to apply for other jobs is the whole imposter syndrome of starting a new job, because I feel comfortable in my current role. But, I know I can't do this long term because 1 the salary is too low, and 2 it's only a contract role, so it feels like there's no real point to anything and it won't help me out career wise. Because everything I'm doing is so specific to this company, I'm learning more through studying on my own. But, studying Azure/networking etc on your own is a lot different than when your in a job doing those tasks. So, I'm wondering if I will get in over my head if I take an admin role.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/uldoko/should_i_start_applying_for_jobs_or_stay_in_my/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Looking costs you nothing but a little time until you need to accept. \n\nGeneral experience says you’ll find more and better opportunities the longer you’re there but no harm in looking. Just don’t take a dumb job with a 5% raise when you maybe could wait for the right job with a much larger one",
          "score": 2
        },
        {
          "body": "So  the real question is, do you want to work in IT?.  \n\nDisclosure: I've worked in IT for 25 years.\n\nIf that's what you want to do, go for it!  I've done it all, several contract for hire jobs (a few worked out well, one didn't).  IT has moved more remote, especially since the pandemic.  So there are jobs out there that are fully remote (and some are hybrid).  Find one that interests you and go for it.  If it doesn't work out, find another one (you're already discovering there is a lot out there).\n\nAnd yes, recruiters almost universally suck.  But you have to weed through the muck to find good jobs. As you gain experience and contacts in the industry, you'll be able to find higher quality recruiters.  If you're not on LinkedIn, get on there.  I find the recruiters there to be higher quality than job boards (but don't exclude job boards).\n\nConcentrate on a job you are interested in, not the recruiter.  The most important thing in your first few IT jobs is to build experience, things you can add to your resume.  You'll find salary jumps in IT after 5 and 10 years of experience (though you'll likely have to job hop to get the pay boost).\n\nIt's not uncommon for someone under 10 years experience to switch jobs every few years.",
          "score": 1
        },
        {
          "body": "Get some feelers out there. The great thing about being in your situation, is that as an employed person you can thoroughly vet new positions and companies. Always remember interviewing works 2 ways. Be picky, turn down less than perfect offers, but definitely apply and/or chat with recruiters. \n\nWorking from home (and other benefits) - just decide what you value more. It’s totally subjective. I loved working from home. My last job I was working from home 2-3 days a week. Perfect. But it was a terribly toxic environment with no training or opportunities to advance. Now, I can only work from home 1 day a week but the environment is leaps and bounds better.",
          "score": 1
        },
        {
          "body": "Yeah, I would not move for a contract job.  Although 70k in Alabama probably goes pretty far.  If you're renting now and lease is up soon and don't have a family moving could be a good move.\n\nBut in general I'd look for something local (or a remote job), even if it's less than that 70k (but it should be more than you make now, and take into account a contract job isn't likely to have benefits).",
          "score": 1
        }
      ]
    },
    {
      "title": "Tech worker debating if I should change careers to marketing or data analytics?",
      "body": "I'm a cloud admin thinking of switching careers to data analytics or marketing. The interviews in tech seems really intense even after working in tech for a few years as a system or cloud admin. The interviews feel like tests where they want you to memorize multiple applications, processes, and steps. The hiring for the last year has been ruthless too, and I've had less responses from jobs even though I have more experience. \n\nI thought of data analytics first because it relies less on programming like powershell, javascript, or cisco commands. It also is more interesting analyzing charts. I'm interested in investing so observing patterns and seeing how changes can improve company earnings interests me because you actually see a result from your work. I feel the charts are less abstract than random powershell scripts that you would use as a cloud admin. \n\nIdk if it'd be possible for me to switch to data analytics? I don't have a tech degree. I do have 4 cloud certs and CompTIA. I've been in a few tech jobs over the last 4 years. Would I need an MBA or to go back for another bachelors?\n\nMy last option is marketing. Because I like the analytical nature similar to data analytics. The different advertising creative ideas interest me as well. I also like that it's not as technical. However, I'm an introvert, so idk if it would require a lot of direct facing customer work. I've heard some say the pay isn't great and it's like a sales job, is this true? I've also thought even a pay cut may be worth it for less stressful work, because in tech there's a lot of knowledge hoarders that can be hard to work with. Does marketing have that issue?\n\nFrom my experience, interests, and qualifications. Should I stay in tech as a cloud or system admin or switch to marketing or data/business analytics?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1guen6l/tech_worker_debating_if_i_should_change_careers/",
      "comments": [
        {
          "body": "If you think data analytics is observing charts, you need to do some serious homework. Based on what you've written here, you have a serious lack of understanding of what a day on the life of a data analyst entails, or what skills are required. Also, if you think that an interview for a data analyst position is going to be any less intense than an interview for a cloud admin, you are seriously mistaken.\n\n\nMarketing is heavily saturated right now and not a good industry to go into.",
          "score": 1
        }
      ]
    },
    {
      "title": "Did I make a good choice changing careers from firefighting to IT?",
      "body": "Previously I worked as a firefighter at a salary of 33k a year, but they had a mandatory overtime policy where at times we would have to do 2 24 hour shifts in a row and 1 day off then our regular 24 hour shift. (sometimes without sleep if we had calls that night). \n\nI've been studying Linux and Cisco, but I'm debating at this point if it's worth it to continue down this path. I currently make around 42k, for about half the hours and less stress on my body than firefighting. Which is why my dad says I should just continue with the path and I don't really need to go to college at this point. \n\nHowever, my girlfriend who is a nurse said I should go back into firefighting because she was saying I wasn't happy. But, I told her almost any job can make you unhappy a lot of it depends on who you work with as well. Also, a lot of jobs that are people's passion like psychology, art, or health don't pay that much to live off of.\n\nShe also stated that the fire department is more stable because it's a government job and there not as likely to hire temp/contract workers and that sort of thing. But, at 13 an hour is that even livable? Plus I was working on average 70 hours a week counting all the overtime and layovers which became really exhausting. Would the fire department really be more stable than IT work?\n\nThe biggest thing I fear with IT though is the constant temp jobs. Also, many of these companies don't care about there employees. For instance, my second IT job was a sysadmin paying 50k for a startup. But, the company was ran by management that had no structure so I would be doing different random tasks each day. People would show up before or after work to pick up laptops. And the whole environment seemed unprofessional as a whole because they would have these drinking parties from time to time. I got let go after 2 months for no reason other than not being a \"culture fit.\" Was this just a fluke or is this how most companies are in the industry lol?\n\nThe qualifications these companies require is ridiculous as well. A lot of them want 3 - 5 years experience with 3 to 5 different things. Then when you get to the interview, you'll have to go through 4 stages of sometimes group interviews. Where every interview feels like a test you have to study for. Whereas, with the fire department all I had was 1 group interview and the rest was testing.\n\nSo, with the long interviews, difficult requirements, and the fact that employers are so quick to lay people off or only hire temp workers. Those are the 3 biggest things that have me questioning if I made the right choice.",
      "subreddit": "jobs",
      "score": 15,
      "url": "https://reddit.com/r/jobs/comments/preze5/did_i_make_a_good_choice_changing_careers_from/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "As someone who chose IT for their career, I can tell you that it’s a great field to be in. Lots of room for advancing. Keep building up your resume with jobs and certs/qualifications. You’ll gain experience and your pay will always be really decent with a 8-5 M-F, lots of room for you to live your life.\n\nEdit: not all IT is temp jobs. My very first IT position lasted me 3.5 years.",
          "score": 10
        },
        {
          "body": "Re read what you wrote and you have your answer.\nIf all the índustry is switching to temp work why not join them then you only have to be professional and you don't have to bother with culture. Temps generally don't have as many benefits but they do have higher pay. Between jobs you can easily increase your income by demanding 2 to 5 more bucks per hour aftér each contract. You can also take remote contracts and travel. Your partner could do the same as nursing is also headed to temp-with-travel (traveling nurses make more money too).",
          "score": 2
        },
        {
          "body": "Do whatever you enjoy man.\n\nWe don't need to tell you that being a firefighter is a dangerous job in exchange for great benefits. \n\nIT job opportunity does vary from location to location but information technology is what you make of it. The obvious down side is an oversaturated market, high chance to be laid off, the continuous growth requirement through extra studying and the infamous bcert mill.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "I came from the corporate world into EMS.  Nobody could pay me enough to go back.\n\nMy advice is to maintain your certs, maybe do some service once a month at a volunteer station, and keep it open as a backup if you decide IT won't work out.",
          "score": 1
        }
      ]
    },
    {
      "title": "MBA vs Masters in Business and Technology",
      "body": " I'm currently working as a system admin for a university where I can use tuition assistance. I have Azure, Comptia, Cisco CCNA, Microsoft system admin expert, and Linux LPIC certs. I've worked in 2 help desk roles, and 2 system admin roles. I've been in IT field 3 years, so some say I don't need a degree, but others say I'll have a cap on my earnings if I don't get a degree.\n\nThe reason I'm considering a degree is because my previous degree was in kinesiology. Sometimes in interviews I keep getting asked why I switched from kinesiology to IT and it gets annoying. That and I'm also debating how to move into systems engineer, architect, cloud admin, or devops type role long term.\n\nI feel like the MBT the equivalent of a masters in IT will help me in getting more IT type jobs. But, since that program is online I'm worried I won't get much networking effect as the in person MBA. The classes include 2 programming classes, a database management class, user experience, project management, and object oriented systems analysis. This program is also all online, so idk if that would be bad for networking for finding jobs/meeting people.\n\nThe MBA has more accounting, finance, marketing, operations, management, leadership, strategy, and analytics courses. However, the MBA seems more theoretical and has only 1 or 2 tech classes. But, I also think the MBA will open me up to more roles and some said that the MBA doesn't outdate itself as much as an MS does and that it's more broad. At the same time, I've never really seen an MBA listed on IT job postings.\n\nThe MBA could also be useful for a a backup plan to work as a regional gas station manager, retail store manager, or walmart manager. If I were to forget things in tech or got tired of it. I've also heard the saying that you shouldn't have a plan B and you should just focus on 1 goal if you want to be less scatter brained too.\n\nWIth that said, in my current situation would you recommend the MBT(equivalent of MS IT) or the MBA?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/11sh4zf/mba_vs_masters_in_business_and_technology/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Pick a long term career goal at least direction, then the grad degree to enable that. The two are pretty contrasting in the business channels that they led to in 15 years.",
          "score": 2
        },
        {
          "body": "**The MBA could also be useful for a a backup plan to work as a regional gas station manager, retail store manager, or walmart manager.** \n\nNo, the fuck it is not. What you are describing is a waste of time and money. That's like saying a juris doctor (law degree) would be useful for a backup plan to work as a regional gas station manager, retail store manager, or Walmart manager. \n\nIf you can't see further than jobs requiring high school equivalency exams as the qualifying level of education, then you are not ready for an MBA.",
          "score": 1
        },
        {
          "body": "Think of an advances degree is a way to advance your current career. How will this degree do this for you?",
          "score": 1
        }
      ]
    },
    {
      "title": "How I went from minimum wage to six figures in four years without a college degree - AMA",
      "body": "I see a lot of people on here struggling with lower end positions and how to handle specific situations and wanted to post my story and offer an opportunity to give back to the community however I can.  \n\n\nI always excelled academically but I came from a dysfunctional home life. My parents fought a lot and money was always a problem, eventually I kind of talked myself into never being able to afford college and seeing school as a waste of time. I went from a math team star in middle school with numerous competition trophies to graduating high school with a 2.03 GPA. I skipped graduation and showed up after to collect my diploma without knowing if I even made the 2.0 cut. Lucky me! When I was 14 my dad came home one day and told me I couldn't stay there anymore unless I got a job, so I eventually got a part time bagger position at a local grocery store. I had a lot of social anxiety, didn't have any friends to speak of, and no future to turn to after I graduated. I thought about ending things for a long time. I got fired from Publix when I was 18 because my hair had grown out longer then their standards allowed and I opted not to cut it for a job that was paying $5.15 an hour at the time. \n\nMy mom worked in catering at a local banquet hall and she got me a job with her shortly thereafter. The money wasn't horrible, sometimes I would take home 1k+ a week and it was enough to discourage any further ambition. The hours were long though, sometimes 6am to 2am back to back for days on end. I used some of that money to put myself through community college but I didn't have any clear vision on why I was there and I kept dropping out. I eventually got a two year associates in arts(useless) after about 6 years. \n\nIn 2008 the economy went to shit. I was able to buy a townhouse super cheap because of all the sub-prime mortgage defaults. I paid $60k for a 2/2, but it was all I could afford and after the economic trouble started affecting the amount of parties we got booked in the banquets scene I couldn't pay my bills. At my lowest, I was selling my plasma to make the next mortgage payment and keep my head above water. I realized that serving/bartending wasn't going to be enough anymore and I took a dead end low paying job(I think I started at $9 an hour) at an outsourced call center doing tech support for Verizon Fios while continuing to work weekends tending bar or serving to piece together a living wage. This job was customer facing and almost technical, mostly I just got yelled at a lot for things outside of my control and I drank a lot during shift to get by. \n\nA few years later my daughter was born and I decided it was time to start improving my future. I studied for the cisco CCENT which was a super basic entry level certification that I spent a few months on in my spare time before eventually passing. It didn't mean anything, but I requested to be transferred to a slightly more technical account within the call center and they obliged. I worked my way up to engineering in that department, but it wasn't real experience. At the end of the day it was still a call center and I was just following a slightly higher level flowchart. Each promotion coincided with an annual .50 cent raise so there wasn't any increase in salary really. At the end I was making maybe 14 an hour. Noone in our company was making a living wage and I called a meeting with our entire department and senior management to ask for an increase, and they shot it down immediately telling us to leave if we wanted more money.\n\nI completed the rest of my CCNA certification and hoped to use that to pad my existing experience on my resume and started applying to other jobs. I remember my first interview for an engineering position at WheelhouseIT paying 35k a year (I was making about 28k a year at the call center). It wasn't a huge increase and certainly not a fair compensation, but I just wanted out. I prepped so hard for that interview, I had researched the entire company and every single person I would be interviewing with to the point I could address them by their first and last name before they introduced themselves. Apparently my technical knowledge wasn't up to par, and their \"we'll let you know\" turned into no further contact.\n\nI kept applying though, and a recruiter found me for a junior engineering position at a local datacenter/service provider. A small mom and pop shop that had been bought out by a bigger company but still had that family feel. I accepted the position at 55k which was more then I ever dreamed. I was fortunate enough to work under the mentorship of an extremely experienced and well connected senior director who took me under his wing and taught me  more then I could have ever dreamed. I was on call around the clock, and I got buried under the workload for as long as I could remember. Late night maintenances, weekend emergencies, 30 hour shifts straight, but we were all in the same boat putting out fires as best we could. Within a year I was promoted to the provisioning team which came with a raise up to 65k. \n\nThe stress was always there, there were always emergencies. Sometimes I would be on the way out the door with my daughter to take her to whatever quality time I promised her and I would get a call only to have to come back and spend the next 8 hours dealing with fallout. Eventually, we went through a series of mergers and acquisitions and became a completely different company with our initial team broken up and infused with toxic culture from other companies. \n\nI left to take a position at another company in a non-tech sector because my non-compete wouldn't permit me to work in tech directly. I started at 80k a year. It ended up being a call center with vague expectations and horrible benefits, but I stuck it out for the past 6 months. There were some unique experiences I was able to add to my resume, but for the most part it was menial and uninspired work. \n\nToday I accepted a position as a senior network engineer at a local MSP for a customer facing position starting at 105k, largely based on my previous experience at the datacenter. My hiring manager made it a point to tell me that certifications aren't nearly as important as experience. Honestly, it wasn't a super technical interview to begin with. I attribute this opportunity more to the questions I asked then anything I awnsered.\n\nAnyways, sorry for the long winded post. Feel free to ask anything, and I will offer advice as best I can.",
      "subreddit": "jobs",
      "score": 24,
      "url": "https://reddit.com/r/jobs/comments/rqyx9d/how_i_went_from_minimum_wage_to_six_figures_in/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "This is incredible! You’re clearly such a hard worker! Truly inspirational. I have a question, I want to start looking for a new job because i am not learning anything st my current one and i am pretty miserable at it, however ive only been there for about 9 months (it will be a year in march) a lot of jobs i see require more years of experience so im debating holding out to see if the job gets better or just looking for a new job, every job i want to apply to requires like 2-3 years of experience 😞",
          "score": 2
        },
        {
          "body": "What kind of questions were you asking to impress the the hiring manager for your current position? I plan on working in the same line of work, but I always feel like there’s hardly anything I want to ask when the interviewer prompts me if I have any questions, so I usually end up hardly asking anything of substance. Also congrats on the position! Read the whole thing, and I’ll never forget your story.",
          "score": 1
        },
        {
          "body": "Success like this is 50% luck, good job though!",
          "score": 1
        },
        {
          "body": "Congratulations on the new job. Sounds like you really grinded hard for a while and are now being rewarded for your hard work and experience. So you definitely earned it. Question - you say it took 4 years but sounds like the last time you worked for min wage was around 2008 and this whole journey seems to cover 15+ years. What am I missing?",
          "score": 1
        }
      ]
    },
    {
      "title": "What is wrong with me?????????",
      "body": "Hi All,\n\nThis is me complaining for 2 minutes straight. Just thought of giving heads up.\n\nA brief introduction of me, I am a seasoned professional with 3 years of experience in Machine Learning and Data Science. I have completed my BS in CS . Recently I graduated with Master degree from UT Austin. I am an international student in USA. So, I have 60 days remaining to get a job and to not get kicked out of USA. I have been applying for a full time job since last 7 months. I have applied to almost 1000 jobs now. Some of them were cold applications. Many of them were with referrals.  I am playing both quantity and quality game. Reached out to around 200 directors/VPs/Managers/Recruiters to see if they have any openings within their team. Most of them ghosted me. Sent regular follow up emails/messages. I have got my resume reviewed by professionals. And my resume/cover letter are good enough to get any well paying ML Engineer/ Data Scientist position. Now, despite these efforts , I have been having hard time getting an interview. I have started applying to entry level roles as well. Got rejected from them too. I don't know what is going wrong. Looking at job descriptions, they seem perfect fit for me. I am overqualified for most of them. Like sometimes I feel these companies would be lucky to have me at that position. I am really frustrated now. And it is affecting my mental health now. I think of giving up everyday. Just a year ago, I was interviewing for google, had offers from Amazon and Cisco. And now with a Master degree I am going through this phase. It just feels unrealistic and unfair. I feel recruiter and hiring managers are the most powerful people in any organizations. Every time a get a reject, I feel like screaming \" WHO? WHO??? WHICH TOM, DICK AND HARRY IS GONNA BE A BETTER FIT BRO? WHYYYY???\". They are paying $60k annually and getting a professional with 3 years of experience with strong academic, research, and professional profile. And they still won't give you an interview??? This is just being exploitation of talent. People get referred and get a job. I am not against networking and referrals. But sometimes it just feels unfair. Like..Are the people  applying through your career pages dumbheads? They won't hire a candidate who is the best fit for the position. Isn't it nepotism. I don't have any question. I just wanted to rant about this. Somebody had to say this. Thanks for listening.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/13y7b8g/what_is_wrong_with_me/",
      "comments": [
        {
          "body": "Okay so I hesitate to say this, because I probably will sound like a dick. But, given that your experience, your references, your education, resume, etc are all thoroughly vetted and in good order, have you considered that maybe the problem is your attitude, your 'personality' (I mean we all know the personality that comes through on a phone interview or recruiter call isn't necessarily the \"real you\" but it is unfortunately the you you get judged on for securing an interview)\n\nNext time you get a first interview with no follow-up, ask for feedback. Sure, this is a little awkward and they may just ignore your question, but if they do reply you could receive very valuable insight as to how you come off in an interview setting that is putting people off of asking you back. It's very important to be conversational and friendly and straightforward with recruiters, rather than letting on that you are attempting to partake in some sort of game. They don't like it when you're on to them lol. \n\nBut honestly, I have had the most success in job applications/interviews when I really thought the position long shot, or that I was massively *under*qualified, and therefore just let myself approach that belief/fact honestly yet optimistically. Nobody likes being talked down to, so maybe the problem when you apply to jobs you are overqualified for is a matter of tone. Overqualified for does not necessarily mean superior to, you know?\n\nHowever it's also entirely possible you're doing absolutely nothing wrong yet have simply been the unlucky second choice dozens of times over... In which case you need to just keep on being  persistent, and applying to jobs in a variety of sectors at a variety of levels at a variety of company types and I promise sooner or later you'll be offered something 🤞",
          "score": 3
        }
      ]
    },
    {
      "title": "IT Interviews: Have you ever been asked to recite command line commands on a phone interview?",
      "body": "So I'm on my 4th phone interview for a position and the question I fear the most comes up: \"..and what are the commands for that?\"\n\nReally?  Whether the topic is related to a Linux, Cisco, Windows, or other command line there is no way I can remember the exact commands to solve a (poorly detailed) hypothetical problem while conducting a phone interview.  This question has come up a couple times in the many interviews while on my job hunt this year.  I have had to politely explain to the interviewers that there is no way I can remember the exact commands to do something and say them over the phone, especially if I haven't used them in a while.  One interviewer didn't understand what I was trying to say and immediately cut off the interview.  Luckily, the interviewer today understood and we went on to have a very good 30 minute conversation on my 15 years of experience in IT that turn out to translate very, very well into the type of environment they are running.\n\nIt's been hard to explain to these interviewers, but basically if you set me down in front of a random command line, it takes me a bit to get the juices flowing again.  I have to look up a few commands, try some things out, and then bam I start to get into a rhythm and everything starts coming back to me and things start flowing again.\n\nHas anyone else had this question asked to them?  Anyone else feel the same about not being able to recite commands off the top of your head, but if you actually get on the command line it starts to come back to you?\n\n",
      "subreddit": "jobs",
      "score": 31,
      "url": "https://reddit.com/r/jobs/comments/ys7ne/it_interviews_have_you_ever_been_asked_to_recite/",
      "comments": [
        {
          "body": "Yes but just a few of the basics like ipconfig /all, what it would show me and why it's useful and any other relevant commands, eg ipconfig /flushdns, ping, tracert, stuff like that.\n\nIt's probably just a check to see how serious you are, if you're comfortable with the command line, that sort of thing.",
          "score": 4
        },
        {
          "body": "Back in the day, I was \"courtesy\" interviewing for a very senior position.  I say \"courtesy\" because I had already had high-level interviews with management and offered the job on the spot.  However, corporate procedure required that I go through a series of interviews to form a paper trail in the event the hire was audited.\n\nFirst two interviews were great, professional, and prompted an interesting discussion.\n\nThe third was some guy on the phone who apparently googled \"interview questions\" and \"unix\" and decided to try and stump me with command line switches.  It was clear to me half way through these questions that he didn't understand the questions, so I had a little fun with him.  \n\nOne of the questions was something like \"How do you list the installed software on a server?\"\n\nMy reply: \"What platform?\"\n\nHim: \"uhhh.  A Unix platform.\"\n\nMy reply: \"Right, but are we talking Solaris? AIX? HP-UX? Linux - which distro?\"\n\nHim: \"Nevermind, let's move on.\"\n\nAs we are talking, I google \"unix interview questions\" and find the exact list he's using.  I then proceed to read him VERBATIM the answer as printed.  \n\nHE DOESENT CATCH ON.\n\nAbout three weeks into my tenure, I had a conversation with that person's manager - and that person no longer does interviews.\n\n",
          "score": 5
        },
        {
          "body": "Yes, I have. It was the most bizarre and pointless thing to broach in an interview. Kind of like asking a mechanic what size and configuration a particular screw is holding a piece of one type of car part together. In any job if you haven't done it in a few weeks you're going to have a hell of a time instantly recalling things like that. If you use them every day right up to that point, yes, you'll be able to answer instantly. It smacks of some kind of obtuse showmanship and pissing contest that I've seen in a lot of shops.\n\nI realize that they're trying to sort out the technically able from the non-able, but ask me what I've done and how I did it to get a good picture of my skill set. Questions about specific commands are just a question about recall under pressure and nothing else.\n\nEnd of my rant, I guess. ",
          "score": 13
        },
        {
          "body": "I'm a hiring manager for network engineering roles, which are also customer facing.  I frequently ask questions like this, which may require you to demonstrate a knowledge of  the specific commands.  If you nail it, I'll ask a harder questions until you can't.  It's not just about what you know.  This is to gauge how you will behave under pressure.  The right answer is \"I don't know, but this is how I would approach it.\" This may be news to some of you, but IT professionals have a tendency to be overconfident and don't play well with others, and you would be amazed at the insight you get from pushing them out of their comfort zone.  ",
          "score": 7
        },
        {
          "body": "Yep and failed miserably.  Totally choked.  It was on SQL and I just finished a book on it and started to use it so it wasn't ingrained in my head yet.\n\nEDIT: forgot a contraction",
          "score": 3
        },
        {
          "body": "I feel like I'm the only one who considers this stuff important. I've run into a lot of situations where for whatever reason, reference wasn't readily available, especially with networking gear. Yeah, I might miss a flag or two, but I'm able to get across what function I'm trying to execute without any trouble. \n\nI feel like it's most analogous to music - you can get by without knowing your scales, but you're not going to be able to improvise without that skill. \n\nEdit: for reference, demonstrating that skill got me my first IT job as the Linux sysadmin for about a dozen clients and has since helped me earn about a 60% pay increase over the 3 years I've been in the industry. ",
          "score": 3
        },
        {
          "body": "It really depends on the command they were asking for. If the answer was ipconfig, and you had a networking job, then you should know that one. If it's one of those long netsh commands, then it may be reasonable to not know that. ",
          "score": 3
        },
        {
          "body": "I usually ask stuff like, \"how would you check memory usage in Linux.\" and just leave it at that. If you would give a reasonable answer, all good.",
          "score": 2
        }
      ]
    },
    {
      "title": "Advise for identifying my critical flaw(s), 46yo WM SF Bay",
      "body": "I'd like to ask the group's advice for figuring out why I can't land a new job.  I'm assuming there's something wrong with me, after several good interviews - but I don't know what it is.  I'll relate my experience and things I've tried.\n\nI'm a 46 year old white male with director level experience in the SF Bay Area (more SF than SJ/Peninsula).\n\nI spent 12 years running customer service as Director of Customer Service for a small SaaS software company that went out of business.  Prior to that I worked my way up through a series of positions in project management, IT and Operations at a succession of companies.\n\nI'm not a friend collector.  I have about 250 contacts on Linkedin, of that 100 or so I know well enough to call out of the blue.  I cycle through them all every month looking for people I haven't talked to or opportunities I'd work for at companies.  \n\nI've had three good interviews.  2 for CS leadership positions in my industry,  1 for CS leadership outside, and a couple other interviews where I wasn't a perfect match, but I didn't feel like I did badly.\n\nThe results of my interviews have been poor.\n\nA form \"we're moving on to other candidates\" email, after I was told I nailed everything and was the only candidate.  This was for a gig that was literately tailor-written for my experience and background.\n\nA nice phone call from the recruiter, after being told they were sending over an offer, telling me a candidate who was a better \"culture fit\" came into the process late.\n\nAnd the rest, I've just been ghosted - no reply at all, after spending 4-5 hours on site and at least 3 hours in phone calls leading up.  Most of these were the \"not a perfect match\", but one was literally in my industry and a subset of the job I used to do.  I would have excelled at it, and even wrote a plan for overhauling their process which the hiring manager loved.\n\nI'm told \"that's the normal process\", but after 18 months - I'm weary of the \"normal process\".\n\nOne hiring manager I met at an event told me I was too old be getting a job in the valley.  Another told me I couldn't possibly have a job in tech because \"nobody over the age of 35 knows anything about the internet\".  I now how to run ad campaigns on FB.  I use Snapchat.  I can configure a Cisco router.  I understand Bitcoin.  I don't think knowing the internet is really a problem for me.\n\nI even applied for a part time gig at a local tap room/brewery and they said I didn't fit their demographic (knows a lot about beer and has an open schedule?).\n\nSo... there's something wrong with me, clearly, but I don't know what.  Last year, thinking maybe it was a lack of current skills, I took a class to earn a new tech certification.  It was a real \"go to school 2 nights a week\" thing - not just a MooC or YouTube Video.  I got exposed to a rash of new tools that many startups are using - but none of it was rocket surgery.  I've since taken demos, trials and watched training videos on a bunch of other things to stay current.\n\nI hired a resume writer who wrote me a great new resume, and helped me better frame my career - at least to myself, but that doesn't do squat for \"culture fit\" or age issues.\n\nI started attending meet-ups, but the only people who seem attracted to me are other older people (mostly male) who are looking for work.  I can count about 10 on one hand I run into at every event.  I quit going.\n\nI volunteered with a couple groups as a counselor hoping to expand my network, but that hasn't helped much either.\n\nWhat else would you suggest I try to discern what my problem is?  The only thought I've had is maybe I'm not conveying effectively my depth of experience or willingness to work hard in my interviews.  Getting feedback though, is next to impossible.\n\nOr at 46 am I just too old and have no hope of landing a new gig?\n\nI appreciate your thoughts.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/8bvtdg/advise_for_identifying_my_critical_flaws_46yo_wm/",
      "comments": [
        {
          "body": "It could be your age. Age discrimination is real, and I’ve heard that it’s especially true in SV.",
          "score": 8
        },
        {
          "body": "You probably better suited to contract work in SF.  \n\nOr try transitioning into consulting. You may even want to try and get into ERP consulting.   \n\nDirector positions are very competitive. And San Francisco is VERY competitive. Its more a combo of location and experience than age. Other areas of the US you would have less trouble. But where 300 might apply for a position in Kansas City, 3,000 apply to the same positions in SF. ",
          "score": 2
        },
        {
          "body": "It's about age.  In my 20's and 30's i had no issues getting IT work.  Now i'm 47 and it's over, not even bothering to try anymore.  I just hustle for freelance and any random gigs i can get.  It's not easy.  I am dependent on my spouse now.  If i were single i'd probably become homeless.",
          "score": 2
        },
        {
          "body": "Have you tried a temp agency?",
          "score": 1
        },
        {
          "body": "Age discrimination is a real thing. My father worked for the same company for over 30 years doing corporate software instruction. Had nothing but \"glowing personnel reviews\" from every manager he's ever had... until his last one. Right off the bat he said she didn't like him and did everything in her power to make my dad's life miserable in order to get him to \"quit\" on his own. Because my dad was literally just around the corner to retire he stuck it out. This 40 something year old bitch decided she didn't want him to be able to retire, so she started making shit up in order to write my father up enough times to get him fired. Long story short, she gave my dad an ulcer and ultimately got him fired a few months before his 67th birthday. My dad still goes out to lunch with some people he worked with a few times a month and they were only too happy to tell him they'd overhead that bitch bragging about how she'd gotten rid of the \"overpaid grandpa\" in her department. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Just been offered an \"Exploding\" job offer this morning....unsure if I've already screwed myself over",
      "body": "So I was getting ready for work this morning, when the manager I'd interviewed with not even 24 hours ago called to let me know I've got the job. Yay I thought, until I realised she was going to put me on the spot and ask if I accepted, she asked if now was a bad time to discuss and I was honest saying I really needed to get going for my shift so if we could discuss at another time.\n\nKeep in mind I have interviewed with this manager a few years ago for a lower assistant position which I was offered in the same team for less pay and she did the exact same thing pressuring me to accept within less than 24 hours. She asked me to let her know by the end of the same day she called so back then I declined because I felt like it was a really bad time to start a new job anyway.\n\nShe seems to have this idea that she needs to let other reserve candidates know, but I can't help but think..aren't they a reserve candidate for a reason?\n\nShe's now expecting to call me again this morning and will likely pressure me to accept or decline the job offer not even a full 24 hours after being told I've got the job.\n\nWhilst at work I managed to shoot off an email to HR asking if this is how my job offer is supposed to be given to me, given HR haven't contacted me at all. I haven't even had a chance to look at a contract, see what salary I'm being offered in the range that was advertised or the amount of annual leave days I would get etc. (I would appreciate reccomendations to other info I should check over by the way)\n\nI suppose I shouldn't even have to ask this, but this is a giant red flag right? \n\nAs I mentioned this manager has done the same thing before, has had people I know and I'm friends with speak badly of her from their own experience of being managed by her. \n\nDuring the interview when I asked for a run through of a typical day she gave a complete run on answer that didn't really go anywhere towards answering my actual question. \n\nWhen I asked about training and potential for certifications/progression I was essentially told the most I can look forward to is a potential training in ITIL cerficication (Absolutely no CISCO and I suspect no COMPTIA either) and POSSIBLY (not promised) perhaps being able to work one occasional day sometimes with the 2nd line/tier 2 team to get some experience.\n\nI've just finished an MSc in Computing &amp; Information Systems. I'm waiting to hear back for my project results and degree classification and I'm starting to wonder if I'm underselling myself?\n\nThe role itself is an IT 1st line/tier 1 job within a UK university that's paying up to £31.5k/$43k if including \"London weighting\".\n\nWhilst studying I've already worked in various other IT teams at this university such as the library and the computing labs IT teams and also worked in the accommodation team but never the main \"Service Desk\" where most calls/support requests go to.\n\nI thought the pay wasn't half bad and could really use the money, especially before Christmas but I really can't help but feel this would be a bad decision that is only going to lead to a dead end and bad management from the start?\n\nWould appreciate some advice?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/q8a2ra/just_been_offered_an_exploding_job_offer_this/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Trust your gut. The biggest reason companies give exploding offers is because they know that the offer sucks. The only way to get candidates to accept them is to pressure them; given a normal time frame, most will realize that the offer isn't worth accepting.\n\nEverything about this situation seems like a big red flag. I'd run and never look back.",
          "score": 2
        }
      ]
    },
    {
      "title": "Stuck between a rock and a hard place...",
      "body": "So I used to work at Cisco in my country, and everything was great. I had a superb boss, great onboarding training, a sense of purpose in what I did, along with clear and concise instructions on how to achieve those things. The company culture was great, and people really supported one another. Due to employment regulations in my country, after 3 years of contract work, I could not legally work there again, and I've been jumping around different jobs looking for the next great company where I could truly settle down.\n\n&amp;#x200B;\n\nLast month, after 9 grueling interviews, I passed the final stage and got accepted at one of the top companies in another industry, and I read glowing reviews for all the branches globally. The local branch also had glowing reviews, however after having worked for a month, I've realized this company has some MAJOR flaws;\n\n1. There is NO onboard training, whatsoever. My manager (also the region's director), says that because my role is not a  junior/beginner role, there is no training, and that I should do two things: Ask my colleagues when I have a question, and read through all the different product / technical documents. Now.... our product catalogue is absolutely humongous, to say the least. Some of the products are brand spanking new, and none of the colleagues know anything about it. Due to the sheer size of products and services, I don't even know where to start.\n2. My manager has excruciatingly bad communication styles. Even asking me to setup a meeting, she will write out two paragraphs (literally). She constantly takes out important words that describe the aforementioned meeting. For example, we hold about 5\\~6 different weekly meetings. Instead of asking me to create a specific one (e.g. Internal sales meeting for Customer X), she will say something like where is the internal meeting invite? That's  just one example... another one is once she starts talking, she will talk straight for 40 minutes and expect me to remember every single little detail. I try to take notes, but she speaks like a rapper, using a lot of unnecessary words, and at a very fast pace. A really good example of this would be in a session where she was explaining something for a very long time, and someone who was in the organization for 15 years (he's a highly respected engineer) could not understand her. I WAS able to understand her, but I had my brain working in overload at 200%....\n\nNow, I've tried to explain to her 2 very simple ideas. First, I told her that in ANY organization with a product/service portfolio of this magnitude, a dedicated training regiment is required. I do NOT know what products are used by customer X, and I do not know how each of the products and services work with each other. I've also told her that because I do not have experience in this current field, I might need some time before I can follow a 100% of every single thing she says when she's rapping away for 20-40 mins straight... \n\nI've just joined the organization, so me \"escalating\" this issue is out of the picture, and moreover they'll likely think that I'm the one at fault here since my manager is pretty high up on the chain (she reports directly to the VP of the company) I also want to show them that I can handle the workload etc... and perform just as well as I did (if not better) at Cisco.\n\nSorry for the long blocks of text, but there's a lot of context here, and it's not as easy as \"just talk to her about it\" or something along those lines.\n\nAny words of advice or even an opinion would be greatly, greatly appreciated.\n\nThank you.",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/ovnxyc/stuck_between_a_rock_and_a_hard_place/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Cisco interview first round",
      "body": "Hi! Does anyone have any advice on a first round, non-technical (business) internship at Cisco? I would appreciate any and all insights! Thank you!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/u01nsb/cisco_interview_first_round/",
      "comments": []
    },
    {
      "title": "Job Descriptions",
      "body": "So, every week I get a call all day from recruiters for jobs and they are looking for specific work type like telephony engineer or software engineer. I read through the description of the job it is all over the map of old technology and misspellings. I get background from the recruiter and go with that but end up in an interview asking me questions that are as off the map as the job description.\n\nI will give an example. System engineer for Cisco but also want's SME for NICE contact call center solution, SQL DBA, Tableau developer, OpenAI or Google Developer, expert in old on-premises SBCs that are no longer supported, DBA in SQL or Oracle. The list goes on and on and on. The rate of pay is low. Some have asked that you have other skills but never go into this as well and want someone to build you a new system and want to pay low, so they don't have to pay the vendor. I have never seen anything like this until this year. \n\nThere are no questions about personality or how you would work with a team. To them you are a vendor that you can exploit for the least resources. Cold as ice. I almost am ready to leave my industry.  ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/18tthoj/job_descriptions/",
      "comments": []
    },
    {
      "title": "Soft Skills are pretty important",
      "body": "I have worked in the IT industry for over 20 years. In that time, I have went from a helpdesk guy all the way up to a Director of IT. I teach at a local university and am asked regularly how I advanced through my career. I have worked with thousands of people, and I can say without a doubt that soft skill development is overlooked. I would even say that soft skills are even more important than the hard skills you have acquired through your career. They are the difference between you getting a job, a promotion, and even a raise.\n\nWhat are some of the soft skills that I am talking about?\n\n*Strong work ethic\n\n*Positive attitude\n\n*Good communication skills\n\n*Time management abilities\n\n*Problem-solving skills\n\n*Acting as a team player\n\n*Self-confidence\n\n*Ability to accept and learn from criticism\n\n*Flexibility/adaptability\n\n*Working well under pressure\n\n*Public speaking\n\nSo why are soft skills that important? They are at the center of how you get along with people. There are not very many jobs where you are going to be working by yourself. Working within groups and teams on projects is very important. No one wants to work with someone who is negative or cannot get along with others.\n\nI will tell you the story of a friend of mine who consults in Dallas, TX. Mark is a talented Cisco engineer. He has 10 years of experience, certifications like his CCNP, and has a college degree. The problem is that Mark has found his career stalled. He has issues with his communication skills, he has a more negative outlook on life, and he has an issue with working with other people. He should be making well over 100k a year in his career but he is stuck making 80k.\n\nYou see, the people who get promoted or get the job may not be the top qualified candidate, but the candidate that has the most developed and well rounded soft skill expertise. Ever wonder why someone you work with who isn't as good as you are gets the promotion or raise? Ever wonder why someone you know who doesn't have the experience you have gets the job? Hard skills will get you the interview, but the soft skills will get you the job or the promotion. Hard skills will get you a cost of living increase, but the soft skills will get you a raise.\n\nHow do you develop your soft skills? The first thing to acknowledge is that everyone has room to improve in their soft skill development. Some have more areas to improve than others. I started working with Mark a few years ago on how he can change his attitude around the workplace and help him with his communication skills. Its a work in progress, and he has a goal to be an independent consultant one day. You see, soft skill development is a lot like hard skill development. It takes time and effort to change, just as it takes time and effort to learn something new.\n\nTake the time to start working on your soft skills now. Doesn't matter if you are 15 or 50. Some people say that life is short. It isn't. Life is long, especially if you aren't focusing on developing yourself. Develop yourself today for success!\n",
      "subreddit": "jobs",
      "score": 49,
      "url": "https://reddit.com/r/jobs/comments/4up2bc/soft_skills_are_pretty_important/",
      "comments": [
        {
          "body": "I couldn't agree more with this. I'm a typically reserved guy, but I am actively trying to improve soft skills. They will help with just about anything.  ",
          "score": 8
        },
        {
          "body": "For me this is common sense, and it baffles me when people like those in your example (negative, doesn't communicate well etc.), despite being very experienced are shocked when they get overlooked for promotions or jobs in favour of less experienced candidates.\n\nI finished my degree with the top classification, but I was certainly (individual grades-wise) in the bottom half or even third of my class (admittedly it was a Masters class so the standard was pretty high even at the bottom). However, I have always talked a good game and various work experiences prior to university have enabled me to develop those soft skills to a level which I believe put me ahead of pretty much everyone in my class.\n\nFast forward three years and I'm working for a top company in the industry in a different country, earning almost double the market rate for my job at home, and the \"cream of the crop\" are working for small \"mom &amp; pop\" firms back at home and have been since graduating.\n\nWe actually have a fairly similar person to your Mark in our office, though quite a bit older I expect. \n\nNo one likes him, he is an absolute goon who, if it was up to me, would be fired tomorrow. He's extremely negative, believes he is right about everything, terrible to work with and downright refuses to adapt to new innovations being brought in by the company - he routinely calls other team members names behind their backs when he doesn't agree with something they've done too. Honestly it's astounding to me he hasn't been fired already as he's not even staff, but a freelancer.\n\nNow, you couldn't hope to find someone with more experience - this guy has done so much in his career and he's doing alright for himself now, but I would never in a million years employ this guy. \n\nI'd have the less experienced, confident, enthusiastic team-player every single day of the week.",
          "score": 7
        },
        {
          "body": "I'd encourage anyone in STEM to take a professional communication course. I went to school with a lot of intelligent engineered and IT people. At least half would prefer to have a conversation with the ground rather than with the person in front of them. Being able to hold eye contact is extremely important. Being able to speak clearly and concisely is also key. ",
          "score": 4
        },
        {
          "body": "I'm just a student so I don't know a thing about the job world, are you saying that only likeable people get the raises and promotions? ",
          "score": 3
        },
        {
          "body": "Totally agree.  I know individuals who have excelled quantitatively in their career, but fail to interact well with individuals on a \"qualitative\" level.  I think many individuals who lack soft skills are able to find a career option that doesn't require much use of their skills, and they appear to do well.  But it doesn't fix the fact that they can't interact well with others; it's masked.\n\nExample: I'm working for a university educator who started and ran an organization that fixes homes in a \"ecologically sustainable\" way.  He was praised for the work he did (fixing homes, providing shelter, \"green\" thinking, etc.), but doesn't get along with colleagues, can't work well with students, and recently was booted out of his own non-profit for being a \"complete jerk\" to all involved.  \n\nI've observed: a negative attitude, too much confidence, inability to take criticism (great at giving it..), poor team player, inability to delegate responsibility, to name a few.",
          "score": 2
        },
        {
          "body": "Having been working in IT for almost 20 years with majority in startups: couldn't agree more. \n\nProblem is, the current crop of young engineers have none of that and are not willing to develop those skills. I feel more of arrogance mindset of \"I built this cool the stack. You need me more than I do. Respect me!\"  \n\nI remember when I was young, my company will have leadership training, public speaking classes, team development events, etc. besides the regular tech classes. ",
          "score": 2
        },
        {
          "body": "\"Soft skills\" is also a colloquial term that managers like to use for describing competencies that are difficult to observe by sight. This is sort of misleading, since technically, Competencies comprise of knowledge, skills, *attributes and other characteristics*. If it's crucial to on-the-job performance, then they should all be regarded equally without reclassification.\n\nOP is right in inferring that people aren't born with it. At the same time, one doesn't just develop these attributes in a vacuum. Characteristics like Communication or Team Cohesiveness are managed through leadership. Presentation skills comprise of many conscientiousness and verbal traits. Having a good attitude at work means the workplace culture is welcoming and empathetic. In other words, managers also have a responsibility in developing their team members' \"soft skills\", providing a more significant impact than to let the employees figure it out themselves. \n\nThis is important because we're seeing employers who want to hire people with great business acumen right off the bat, under the assumption that these are innate traits and cannot be trained or developed on the job. When in reality, they can simply set up a Mentor/Protege program or simply encourage mentorship within the organization to meet that goal.",
          "score": 4
        }
      ]
    },
    {
      "title": "I didn't have any clue how hard is to land a job now!! Working in the oil field for almost 5 years as a tech with Cisco and network certs and still can't land a job.",
      "body": "",
      "subreddit": "jobs",
      "score": 26,
      "url": "https://reddit.com/r/jobs/comments/4ugr3f/i_didnt_have_any_clue_how_hard_is_to_land_a_job/",
      "comments": [
        {
          "body": "Bad time to be in the oil field business. Any part of the business.",
          "score": 7
        },
        {
          "body": "Look up CrossCom National and see about becoming a field service tech for them. I think they call the position a VFT or something like that. You get paid per service call. With the Cisco certs, I would think they could use you. I currently work for a small company that contracts with them and several similar companies for IT and telecom repairs. I enjoy it anyways. Good luck to you. ",
          "score": 5
        },
        {
          "body": "I work in a tech staffing company and our branch manager came from Dallas. I can talk to him tomorrow and see what he says for you?",
          "score": 2
        },
        {
          "body": "Is it hard to find a job, or had to fins one that pays your salary requirements? I haven't had much trouble in IT which I started last February(on my 3rd IT job now) and didn't even have my associates until 3 months ago. Maybe look into recruiters or revamp your resume.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Deciding whether to change career field?",
      "body": "I've been working in an entry level help desk job making 14 an hour for 6 months. I have CompTIA trio along with Microsoft Associate Admin and Expert Admin certs. Whenever I apply to jobs on indeed, they either reject my resume or just look at it and don't reply. I've filled out around 70 applications now. I got three calls from recruiters on unrelated jobs. One made it out like I need to respond quickly then he hasn't responded in 2 and a half weeks now. The other was for a job paying 40k and I did well with the recruiter and the 1st interviewer, but the second interviewer just asked questions about hobbies and interests. He said he would reply the next day, but it's been a week now, and I haven't heard anything. I don't know if it's just cause of Thanksgiving or what. The other's on indeed I'm not sure whether to call or follow up with them. I've applied to jobs in and out of state. \n\nPreviously I was a firefighter making 33k and 40k counting overtime but we did 70 to 80 hours a week and at times we had to do 2 48 hour shifts in a row with one day off then go in again for another 24 hour shift. I have a degree in kinesiology and could not find any jobs with it even when the economy was supposedly good back in 2017. I'm becoming really disillusioned with the IT field though, and I don't know whether to switch back to firefighting or something related to my degree. The pay was really low for physical therapy assistants and firefighters, and I got tired of the 12 to 24 hour schedules in health care. Also, if I wanted to become a pta I'd have to go back to school for 1 or so years to get the pta license but your salary is capped at 50k maybe even less than that. PT school would be 3 more years and 80k in debt so that isn't an option.\n\nIt seems like the healthcare careers have more clear job applications though. In IT I've seen them want everything from CompTIA, security cameras, Fire alarm system, SIEM, GIAC, 3 to 5 yrs exp, manufacturing system exp, Cisco etc all for an entry level job. And every indeed application will ask you if you have 3 years exp. in each and if you say no it auto rejects your application. \n\nI got into IT originally because I wanted something more stable with more time for family where I could get rewarded for learning new things. However, even if you do get all the certs in those job postings even then they don't respond to your resume, so getting the certs starts to feel like a waste of time and money. Is staying in the IT field and gaining certs worth it, or should I go back to being a firefighter, EMT, or PTA. I won't make above 15 an hour as EMT, pta probably 35 to 40k, and firefighter around 40k as well. It also is hard to get hired as a firefighter due to the long waiting process, it took me a year before. Don't know what to do, I thought their would be more opportunity in IT, but even with all the certs I have I never seem to get any responses on job applications?? Should I go back to school for IT or CS, change fields(Pta, firefighting, or any other field you have mind), or keep obtaining certs and stay in IT?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/k4onjd/deciding_whether_to_change_career_field/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Well your choice of degree is unfortunate. Sorry to say, you got yourself a worthless degree. It's common these days as associates and bachelor degrees are becoming more and more worthless in any field, especially  kinesiology. This is just my opinion, so take it with a grain of salt, but I would stick to IT. Then I would seek out employment resources. Hit up hiring agencies. A lot of companies don't do their own hiring anymore, and out source it to a hiring agency. Also, go have a consultation with an unemployment office or hiring agency, it could be as simple as your resume not looking good due to formatting. Your other option is to go back to school, expand your skill set in IT, or major in something different. IT and healthcare are both in high demand. However, I've heard healthcare will over work you and not pay much. I've also heard being a fire fighter is a great job, but can be exhausting at times.",
          "score": 1
        }
      ]
    },
    {
      "title": "Cisco Interview Experience",
      "body": "Hi, I have 4 rounds of interview for the position Sr Software Engineer with Cisco Security team (US) tomorrow. Anyone recently interviewed for similar role at Cisco? Wondering if you can share your experience. Also, I am looking to prepare networking concepts in depth for my interview. Please share the resources if you know. Thanks in advance.",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1kh2m5l/cisco_interview_experience/",
      "comments": [
        {
          "body": "You'll likely face coding challenges, system design discussions, and questions about your past projects and experiences. Be prepared to dive deep into networking concepts, especially security-related topics given the team you're interviewing for. Focus on protocols like TCP/IP, HTTP/HTTPS, and network security fundamentals. Brush up on your knowledge of firewalls, VPNs, and intrusion detection systems.\n\nFor networking resources, check out Cisco's own learning materials on their website - they're comprehensive and directly relevant. Also, consider reviewing popular networking books like \"Computer Networking: A Top-Down Approach\" by Kurose and Ross. As for the interview itself, stay calm, think out loud when solving problems, and don't hesitate to ask clarifying questions. I'm on the team that made a [copilot for interview](http://interviews.chat) tool designed to help with tricky interview questions like those you might encounter at Cisco. It might be worth checking out to boost your confidence before the big day.",
          "score": 1
        },
        {
          "body": "Hi There, \n\nI have interview for Engineer - Software team.  Could you please share your experience ?  \nWhat you got asked and How's yours interview went ? Also, which tool they used for interview, will helpful for me to practice.\n\nPlease respond.",
          "score": 1
        }
      ]
    },
    {
      "title": "Software Engineer – CX (Backend)",
      "body": "Has anyone recently interviewed for the Cisco **Software Engineer – CX (Backend), Mid–Senior level** position?  \nI’d really appreciate it if you could share what the interview process was like and what kind of questions or topics came up.\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p6dwnj/software_engineer_cx_backend/",
      "comments": [
        {
          "body": "Haven't interviewed for that specific role but Cisco's backend interviews usually focus heavy on system design and data structures. They love asking about scalability challenges and how you'd handle high-traffic scenarios\n\n  \nFrom what I've heard from friends who went through their process, expect at least 3-4 rounds including a coding challenge and behavioral stuff. Good luck!",
          "score": 1
        },
        {
          "body": "Yep, I interviewed for Cisco CX backend earlier this year. My loop was recruiter chat, a timed coding round (2 medium DSA on arrays/graphs), a tech screen on API design and concurrency, then a system design round for a high traffic service covering rate limiting, retries, idempotency, caching, pagination, plus behavioral around customer impact and on call. Expect SQL indexes and join strategies, some JVM memory if you’re in Java, and basics like TLS and load balancers. For prep, I ran 45 min timed mocks with Beyz coding assistant using prompts from the IQB interview question bank, and kept design answers to ~90 seconds per section with a quick assumptions list fwiw.",
          "score": 1
        }
      ]
    },
    {
      "title": "Again, not in the job title.",
      "body": "Hi All,\n\nI had an interview today that actually had me physically shacking for 45 minutes. The job was a business analyst for workforce management (scheduling call center agents), and I spent 8 hours preparing. I had all of my talking points ready. First no one is on camera and the company is JEA. Everyone gives a small introduction, and no one is from the woreforce management group. First questions were about Cisco engineering and the latest version of Cisco. Second, I find that the platform has not even been installed and they are hiring someone to implement the platform which typically takes an entire team. I am then asked about my software development experience with Jira and AI. I go over my extensive background of REST API and PCI background of tokenization. I talk about OATH 2.0 and SMLA. I talk about developing signal sign one in both Java Angular and .Net. No one knew what I was talking about but remember, I am interviewing for a business analyst for workforce management. It gets worse and then they ask about my implantation of AI and voice and chat bots. I engage and they can't understand webhooks and intents and we move on. I was told they want someone to implement their entire IVR system from scratch as a single person which typically is a team, FYI; that is a huge amount of money for the vendors to implement. At the end they tell me the job is really a working SME at a really low rate of pay. The job description was business analyst. This was for workforce management. \n\nI have never been shaken up by a job interview in my life but this one I did. I have never seen this before. I did get in a question at the end that told the story. JEA is horrible and if you take the job, good luck to you and I really mean this. My question tells me that if you take the job and implement their solution, they will then lay you off. They are cheap as hell.\n\nRegards,     ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/18sfihd/again_not_in_the_job_title/",
      "comments": [
        {
          "body": "I would have asked if I was in the correct interview. I've been in BA roles in my career and would have absolutely failed that one based off the questions asked.",
          "score": 1
        }
      ]
    },
    {
      "title": "cisco summer 23 intern oa",
      "body": "Question 1\n\ninput: int n \n\noutput: n x n (black and white square lined in position with a chess board)  \n\nW B W B W \n\nB W B W B \n\nW B W B W \n\nB W B W B \n\nW B W B W\n\nQuestion 2\n\njar of chocolate similar to leetcode 198: \n\nQuestion:  You are a professional robber planning to rob houses along a street. Each house has a certain amount of money stashed, the only constraint stopping you from robbing each of them is that adjacent houses have security systems connected and it will automatically contact the police if two adjacent houses were broken into on the same night.  Given an integer array nums representing the amount of money of each house, return the maximum amount of money you can rob tonight without alerting the police.  \n\nExample 1:  \n\nInput: nums = \\[1,2,3,1\\] \n\nOutput: 4 \n\nExplanation: Rob house 1 (money = 1) and then rob house 3 (money = 3). Total amount you can rob = 1 + 3 = 4.\n\n&amp;#x200B;\n\nmore interview questions:socaapp",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/125sla4/cisco_summer_23_intern_oa/",
      "comments": []
    }
  ]
}