{
  "company": "coinbase",
  "post_count": 31,
  "exported_at": "2026-01-18T17:44:53.267Z",
  "posts": [
    {
      "title": "Accepted dream job offer with Samsung! What I learned through the job hunt:",
      "body": "Hi everyone,\n\nJust wanted to post here because I’ve been seeing a lot of doom and gloom surrounding the current job market. I had been working temp/contract jobs for the past 3 years with mediocre pay and minimal job security and have probably applied to over 2000 jobs over the past couple years. I am by no means an expert and still feel alittle like an imposter after landing an internal investigator job with Samsung but if I can impart any knowledge from my job hunt from the past few years it would be to stay resilient. The contract jobs I accepted were by no means glamorous nor did they feel fair in terms on the compensation I felt I was worth, but I stuck with them and eventually was able to leverage one into a full time job offer from a large financial institution. There were many days where I wanted to quit but I decided to stick with them and trust the process and put forth my best effort even when I felt underpaid for my efforts. Eventually that allowed me to get my foot in the door and once I landed a full time position with a reputable bank it really felt like the flood gates of interested job opportunities opened up. I went from getting call backs from maybe 1 out of every 30 jobs for an interview and never making it past the first round to landing interviews with Coinbase (got to the final round), Bank of America, Wells Fargo (job offered but declined), and finally Samsung (job accepted) within 6 months of accepting a full time position. And the biggest difference was all these jobs reached out to me via internal recruiters rather than me submitting an application via a job board. The hit rate for interviews felt infinitely higher when recruiters were the ones reaching out to me. I think part of it was being able to get my foot in the door at a reputable financial institution but I also invested a lot of time tweaking my resume and having professionals look at it and provide edits to optimize them for ATS screening. I also made a concerted effort to go to as many interviews as possible, even if I wasn’t really interested in the job and treated them as invaluable experience so when the dream job did come around I would have the experience to feel confident and comfortable. The combination of these changes really turned the tide in my job search and had recruiters beating down my door as opposed to the other way around. Stay persistent and positive and treat every interview as a learning experience and I’m sure the right job with find you. Good luck everyone!",
      "subreddit": "jobs",
      "score": 17,
      "url": "https://reddit.com/r/jobs/comments/1nr3t06/accepted_dream_job_offer_with_samsung_what_i/",
      "comments": [
        {
          "body": "Congratulations man!",
          "score": 1
        },
        {
          "body": "congrats! ✨",
          "score": 0
        },
        {
          "body": "Maybe I missed it - what change had recruiters beating down your door?",
          "score": 0
        }
      ]
    },
    {
      "title": "Obvious job scam, but how?",
      "body": "I know about job scams where you need to pay for training, offers too good to be true, and the pyramid schemes etc...I can easily spot them and avoid them, but I have to admit I am having a hard time here.\nThe other day I received what was supposed to be a \"wrong number\" text, which ended up in a job offer, work from home, part time, do your own hours, $300 a week, no resume, no interview, nothing. They're not even trying to hide it's fake at this point. But I played along to see where it takes me and how they planed to scam me. And this is where I got lost... Please note that I never ever sent any private information, never gave my full name, email, address etc... They just got my phone number which they already had anyways. \nSo first the guy tells me I have to download and create a verified account with coinbase, in order to be \"paid\". He was very insistent on that part, but I got him to show me the details of the \"job\" first. He got me to register on a website called \"ebookersalways\". I registered with a random username, password that I have never used anywhere else and didn't even have to give my email address. Once I created my account, I can see the dashboard and \"missions\", but I need a vip1 account and have to unlock it with more funds. Ok, this is where they take my money I assumed. The guy tells me he will help me unlock it but first I have to do the coinbase account. I do believe coinbase is a real, secure app, and as long as I don't send money there or share private details to \"ebookers\", I'll be fine, but still, I didn't want to download the app and register so I sent him a Google image of a verified account confirmation. A few minutes later he got \"customer service\" to send $48 on my ebookers account and unlock the first task. Basically what I have to do is click start and submit on some random hotel names, and I get a small commission, in average 15 cents per click. I finished the task in 5 min, clicked 40 hotels, made $7. Now the next step is supposed to be withdrawal of the money to my coinbase account, and voila. For now I am not able to do anymore tasks but apparently I can do it up to 3 times in 24 hours and the more I do, the more I get and the higher the commission... \nI still don't believe it's legit and at some point they will find a way to scam me. I just don't see how. Obviously if I need to pay to unlock more tasks I won't do it, and I may never be able to withdraw my \"earnings\" so I will just be wasting my time. \nThe guy who referred me is making 20% commission on my earnings, so in that way I believe it's a big pyramid scheme, but again, I don't see where I myself am getting scammed. I cannot find any infos about it anywhere, I see ebookers is a legit booking website, I imagine my \"clicks\" are just giving fake ratings or improving search results for some hotels, and it's basically free advertisement for them.\nRegardless, I think this has been going on long enough, it was fun to play along and drive the guy a bit crazy, see how it works, etc... but I won't be wasting my time on there any longer. I am a bit frustrated I can't see clearly where the scam is, but maybe you guys have some input? Someone went further than 10 minutes and knows what is their endgame ?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/15bib0p/obvious_job_scam_but_how/",
      "comments": [
        {
          "body": "Avoid investing any more time or money into it. Trust your instincts and stay away from such suspicious opportunities.",
          "score": 3
        }
      ]
    },
    {
      "title": "Coinbase Analytics Engineer interview",
      "body": "Hello,  \nSo I recently completed the cognitive test for coinbase analytics engineer - US.   \nI was then prompted to schedule a recruiter call.  \nI just wanted to know the process of the entire recruiting. What are you going to be the next steps? What all I can questions I can expect from this call?\n\nIs there a code signal test for this role as well? What all will be asked in that?  \nHow should I prepare if I move forward after this recruiter call?  \nWhat are the topics I should be well versed with?  \nHow deeply should I be prepared for the technical skills for next rounds?\n\nAny help or Guidance will be really very helpful!  \nThank you in advance",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1maozyc/coinbase_analytics_engineer_interview/",
      "comments": [
        {
          "body": "How was your experience. Can you give more details about this process?",
          "score": 2
        },
        {
          "body": "recruiter call is mostly a vibe check and logistics run-through  \nthey’ll cover:  \n– what the role entails  \n– comp expectations  \n– timeline  \n– basic resume walk-through  \n– maybe ask “why coinbase?” and “why this role?”\n\nthey’re not there to grill you technically—just to make sure you’re real and ready\n\nif you move forward, you’ll likely face:\n\n1. **technical assessment** (often CodeSignal or similar) – SQL-heavy if it’s analytics-focused – maybe light Python (pandas, dataframes) – expect business logic questions too\n2. **technical interviews** – system design for data pipelines – SQL case studies – data modeling – interpreting metrics and building insights – bonus points if you understand crypto-specific data quirks\n3. **behavioral/culture interviews** – Coinbase loves async culture, remote fluency, and bias for action – read their mission, pillars, and blog posts\n\nprep:  \n– leetcode SQL (medium level)  \n– dbt basics, ETL knowledge  \n– product analytics case studies  \n– brush up on metrics (conversion, retention, etc.)  \n– practice whiteboarding how you’d track and analyze new features\n\nThe [NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some tactical takes on prepping for high-bar interviews with clarity and confidence—worth a peek",
          "score": 1
        },
        {
          "body": "The recruiter call is typically a screening conversation where they'll ask about your background, why you're interested in Coinbase specifically, your experience with data analytics, and basic behavioral questions about teamwork and problem-solving. They'll also walk you through the interview process, discuss compensation expectations, and answer your questions about the role. Yes, there's usually a technical assessment after this call, often involving SQL queries, data manipulation, and possibly some Python or R depending on the specific role requirements.\n\nFor preparation, you need to get solid on SQL fundamentals including joins, window functions, and complex queries since analytics engineers live and breathe data manipulation. Study up on data modeling concepts, ETL processes, and be ready to discuss specific projects where you've turned raw data into actionable insights. Coinbase will likely ask about cryptocurrency and blockchain basics, so understand the fundamentals even if you're not an expert. The technical rounds can get pretty deep, so practice explaining your thought process out loud when solving data problems and be prepared for case studies about measuring product metrics or investigating data anomalies. I'm on the team that built [interview AI](http://interviews.chat), which can help you answer these types of technical and behavioral questions in real-time during your actual interviews.",
          "score": 1
        },
        {
          "body": "Analytics roles still follow Coinbase’s core technical patterns (state updates, constraints, ledger-style logic). Got a summary if you want it.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is white boarding gone post COVID, can all coding be done on IDEs?",
      "body": "I am currently employed as a software engineer in Canada. I want to switch over to the US market since the pay is much higher and the US dollar is stronger. Since the interview process for US tech companies is relatively harder than Canadian tech companies, I am going with the general recommendation given on here to do CTCI to brush up my knowledge followed by Leetcode.\n\nCTCI talks a lot about white boarding in his book and about how one should write the code on paper before using an IDE. I am wondering if this is applicable anymore since all tech companies are doing remote interviews now and this trend is likely to continue in the future. Can I just use an IDE to code up my solutions or is paper coding and white boarding still an important part of interviews?\n\nFinally, according to some companies are transitioning to a less Leetcode heavy interview process. I wanted to know if my interview preparation process is still correct (CTCI + Leetcode). I am obviously open to FAANG but also looking at 'Tier 2' companies like Coinbase, Quora etc.",
      "subreddit": "cscareerquestions",
      "score": 45,
      "url": "https://reddit.com/r/cscareerquestions/comments/lr3hpr/is_white_boarding_gone_post_covid_can_all_coding/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 28
        },
        {
          "body": "I have worked at faangs for 15 years and conducted many many interviews. \n\nAt my company, we use internally developed coding platform. It's got colorizing of code, but has zero auto complete or error highlighting. We either use that or Google docs. \n\nIt will help you because you type but won't give you any other IDE benefits. I suspect this is common.\n\n\n\nThat said, I'm older (late 30s) and if I were being interviewed and had to choose between an IDE and Whiteboard, I'm choosing a whiteboard every single time. People are naturally more forgiving of errors on a whiteboard.  Coding errors are far more pronounced on an IDE.  Sharing non-code concepts is miles and miles easier when you can draw free hand on a whiteboard. Even debugging your code and keeping track of variables is substantially faster when writing freehand on a whiteboard. This is obviously my opinion.  But having interviewed many people, I'm confident in suggesting this is always true, but like all things, I'm sure there is bias.\n\n\nAlso, if I could recommend something to all you interviewees, please test your own code when you're done: at least with the example given. So many times people say, 'okay I'm done' and I have to tell them, 'can you run through your code with the example?' and they find out their code doesn't work. So do yourself a favor and always debug your own code before announcing that you're done. When you do, I note it as a positive signal.",
          "score": 28
        },
        {
          "body": "&gt;CTCI talks a lot about white boarding in his book\n\nHer book",
          "score": 108
        },
        {
          "body": "Can all coding exams be done on IDEs? Yes.\n\nBut will companies do this? No. \n\nThere are companies already trying to get back to whiteboard coding... Some companies have it so that they just give you a nice looking IDE but no features to it, so essentially a colorful notepad.",
          "score": 8
        },
        {
          "body": "From my understanding a lot of these remote interviews are still done in \"whiteboard\" format, i.e. you do the work in a provided scratchpad website or google docs and not in your personal IDE.",
          "score": 4
        },
        {
          "body": "There is a massive amount of middle ground between paper and an IDE. A simple text editor is far more logical as a next step after paper.",
          "score": 7
        }
      ]
    },
    {
      "title": "Choosing between 3 offers",
      "body": "I have pending offers from Amazon (AWS), Microsoft and Coinbase\n\nI don't know what to choose from, Amazon does sound more interesting in terms of the stuff I'll be working on but they require me to relocate which is a big inconvenience (I'll probably have to sell my house), and I heard bad things about the work environment.\n\nCoinbase sounds like the least interesting option, and I don't know how impressive it will look on the resume, compared to Microsoft or Amazon, but I got the highest offer from them (pretty significant difference)\n\nMicrosoft sounds like the perfect package, I don't have to relocate, the work sounds pretty interesting (a bit less than Amazon but still interesting), I heard good things about the company culture and overall got a better impression during the interview. The only downside is that their offer is the lowest and it looks like they won't budge from it.\n\nWhat do you think? I don't expect to get an exact answer, obviously, I'm not sharing all the details, but what other things should I take into account when making that decision?  \nIs there a good strategy for negotiating with Microsoft in this case?\n\nCan anyone who has worked in any of these three companies shed more light on the culture and work environment?\n\nThank you",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/p2kj2t/choosing_between_3_offers/",
      "comments": [
        {
          "body": "I think Coinbase would look as good or better than the other two on your resume (although the details of the position could influence that).\n\nRelocating for Amazon seems risky.\n\nI’d be inclined to try Coinbase for a year and see  how it goes. If it really is boring, then go back to AWS and MSFT and use your higher salary to negotiate a better offer.",
          "score": 15
        },
        {
          "body": "depends on what you want most of it?\nIf you want good wlb, then choose microsoft.\nIf you are young, you can choose Amazon, but keep in mind their PIP culture.\nIf you believe in crypto, choose Coinbase.\nSince you already got offers from those, you can pick any, and try FB/G in a year or so for senior level.",
          "score": 6
        },
        {
          "body": "Flip a coin between MSFT and Coinbase",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "Flip a three sided coin. Which ever side you want it to land on, go with that.",
          "score": 2
        },
        {
          "body": "Coinbase. Some of the highest comp in the industry right now. I believe it's going to be a member of the \"next\" FAANG.",
          "score": 2
        }
      ]
    },
    {
      "title": "Coinbase rejection question",
      "body": "Hey all, so I was recently interviewing for Coinbase, but ultimately today received my rejection email. My recruiter told me that the reason was because they couldn't find any teams which need someone with my experience, which sounds a little bs to me. The recruiter told me my interview feedback was \"positive\", but not being the right fit was ultimately the decision for the rejection. Does this seem to track with Coinbase or similar companies? I only ask because I want to figure out if it was my resume and a lack of experience or matching skillsets, or was it my interview performance. ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ki0ijr/coinbase_rejection_question/",
      "comments": [
        {
          "body": "They do that, they have a culture fit thing that is really geared to see if you are willing to give yourself fully to the company and that counts alot for their hiring from what I know.",
          "score": 5
        },
        {
          "body": "Positive likely means you passed the threshold which signals you are on the right track, but I would probably take the team matching reason as the truth. I think if you were a strong yes they probably would have placed you on a team even if your experience wasn't totally in line with what teams needed, but because you were just a yes they passed because maybe teams aren't that eager to fill a role and they are okay with continuing the search. Sometimes the game is just right person, wrong time which sucks but it is what it is. Doing well on Coinbase's interview is impressive though, so keep it up",
          "score": 3
        },
        {
          "body": "I have my interview coming up for frontend role. What should I expect in the Pair Programming.",
          "score": 1
        },
        {
          "body": "What stage did you get to?",
          "score": 1
        },
        {
          "body": "Did they give you a detailed feedback on this? That's really messed up. I know some companies can hold off a candidate for a while before finding a matching team, doesn't make sense to reject a candidate who passed the whole process already.",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Big N Discussion - January 14, 2024",
      "body": "Please use this thread to have discussions about the Big N and questions related to the Big N, such as which one offers the best doggy benefits, or how many companies are in the Big N *really*? Posts focusing solely on Big N created outside of this thread will probably be removed.\n\nThere is a top-level comment for each generally recognized Big N company; please post under the appropriate one. There's also an \"Other\" option for flexibility's sake, if you want to discuss a company here that you feel is sufficiently Big N-like (e.g. Uber, Airbnb, Dropbox, etc.).\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Sunday and Wednesday at midnight PST**. Previous Big N Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Big+N+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/196au7w/big_n_discussion_january_14_2024/",
      "comments": [
        {
          "body": "Software Internship: Coinbase Vs Amazon (AWS)\n\nHello! I'm lucky enough to receive offers from both companies for a 2024 Summer internship.  \nAWS  \n• Located in Seattle  \n• 9138/month + 7000 relocation  \n• Random team team placement  \nCoinbase  \n• Located in Mountain View  \n• 50/hr (about 8700/month) + 7000 relocation + 500 in monthly stipends + 400 one-time stipend  \n• Team-placement matching, back-end role\n\nIn the future I want to peruse a position in ML/AI.\n\nI figure what I care most about is opportunity to return full-time after I graduate and as well as working on something I'm passionate about. I'm inclined towards Coinbase but I still don't know much about Crypto and how well it's gonna be in the future, any thoughts?",
          "score": 2
        },
        {
          "body": "Company - **Other**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Company - **Netflix**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Company - **Facebook**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "As a New Grad, should I be worried?",
      "body": "There’s been much talk about the upcoming recession, layoffs, and resigning offers. On Friday, I got a recruiter called about a New Grad in Software Engineering at a well-known company. They said they’re sending me an offer letter next week (I interviewed a couple of months ago but got rejected due to space capacity). I got all the comp details and start date. I’ll be making more than my entire current salary in a year. I’m terrified of the company deciding not to extend it due to current economic conditions or getting the offer and rescinding it like Coinbase. Am I sweating for nothing? If not, should I stay at my current job, float out of the recession, and try job hunting? I’m a bit of a nervous mess, honestly.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/vapgmb/as_a_new_grad_should_i_be_worried/",
      "comments": [
        {
          "body": "Na you're good, remember fear sells stories. Congratulations on the job offer!",
          "score": 24
        },
        {
          "body": "Even if you should be worried (which I am not saying you should), why worry about it? People stress too much about things outside of their control.\n\nCongrats on the job, and just know it is very unlikely it gets taken away from you at this point, coinbase was an outlier and it will hurt their ability to hire good talent in the future.",
          "score": 16
        },
        {
          "body": "Recession isn’t here yet and the layoffs are super exaggerated. I would be nervous in a profitless startup or anything crypto but other than that you should be fine.",
          "score": 18
        },
        {
          "body": "Is your current job recession-proof, or something?  Who's to say it won't lay you off?  I'd go with the new offer.",
          "score": 4
        },
        {
          "body": "I feel like eventually 50% of the posts on this sub are going to be a variation of this question. Can we get a megathread?",
          "score": 4
        },
        {
          "body": "What Coinbase did is not typical (and pretty shocking, honestly).",
          "score": 4
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Beware of Coinbase",
      "body": "I just want to share my experience with Coinbase. I recently applied for a job there and here is how the recruitment process went:\n\n1. standard application + mandatory cover letter\n2. 90 minute hackerrank\n3. a 6 hour take home assignment\n\nI was going to quit when I was sent the take home assignment because I've never been asked to do such a long task, but they said they would compensate me. So I did it and submitted it. Keep in mind that at this point, I invested a total of almost 10 hours into this company. After a while, I get the generic rejection. However, it's been almost a month since I submitted the take home assignment and I still have not been paid, even after multiple emails.\n\nTLDR: beware of Coinbase because they are unable/unwilling to pay ",
      "subreddit": "cscareerquestions",
      "score": 1308,
      "url": "https://reddit.com/r/cscareerquestions/comments/7nszwq/beware_of_coinbase/",
      "comments": [
        {
          "body": "I just went through something similar with shape shift. They asked what $ I was looking for and then sent over a massive take-home. I worked nights after my son went to sleep for 4 straight nights, bought a minimum amount of bitcoin to test the project with, and turned in a pretty solid app I could take pride in.\n\nThe recruiter told me they never looked at it. They rejected me based on the compensation requirements. The fuck’s couldn't tell me that before asking me to write a fucking app?!\n\nLucky for me the bitcoin bubble started to expand before I managed to remove what was left of my coin. I ended up a few hundred ahead after that. \n\nFuck shape shift. ",
          "score": 226
        },
        {
          "body": "[deleted]",
          "score": 602
        },
        {
          "body": "[deleted]",
          "score": 346
        },
        {
          "body": "Thank you for naming a shaming. You’d think that with $$ from bitcoin they can at least pay for interview stipend. SAD!",
          "score": 523
        },
        {
          "body": "[deleted]",
          "score": 41
        }
      ]
    },
    {
      "title": "Don't do the long take home assignments like coinbase",
      "body": "I've noticed a rise in number of take home assignments. I'm all for take home assignments replacing the traditional whiteboard interviews, but thats not the case. Its phone screen AND take home assignments AND onsite, basically another round added to the already long process. \n\nCoinbase example: 60-minute technical screen, 4-6 hour take home assignment, then all-day onsite interview. \nThe recruiter tried to justify this by saying they are trying to move away from traditional interviews, but they still have exactly the same phone screen and onsite interview...\n\nNo matter what bs the recruiter trys to tell you, take home assignments are cheap ways to evaluate and screen out candidates. You spend X hours finishing the assignment, they spend 30 minutes or less judging it, pretty disrespectful if you ask me. \n\nEdit: In 2011 when i first graduated, the norm was 1 phone screen 1 onsite, now the norm became 2 phone screens 1 onsite. If enough people accept take home assignments, that will get added on to the norm too\n\nEdit2: Not saying don't do any take home assignments, just don't do the ones that are absurdly long. You are easily tossed out for your hard work, if you are so good that you make the cut, you are probably good enough to find a comparable place anyways. A lot of this is a numbers game",
      "subreddit": "cscareerquestions",
      "score": 361,
      "url": "https://reddit.com/r/cscareerquestions/comments/7rdogv/dont_do_the_long_take_home_assignments_like/",
      "comments": [
        {
          "body": "I find asking people to extremely long take homes (anything beyond ~1 hour). To be shitty. However i also struggle really hard with trying to determine how long in actuality a take home assignment will take people on average.\n\nFor example, a past position i screened applicants for a full stack dev position, they were given a premade express app (in nodejs), and a premade react client app. \n\nTheir task was:\n\n* Add a new endpoint with the following signature `GET /api/fizzbuzz`, that takes 2 query parameters bar and foo. If foo is passed and true call `fooFunction()` else if bar is true call `barFunction()` if both are passed call `fooBarFunction()` and return the output\n* Add 3 buttons one for foo, one for bar, and one for fooBar to the react client, that hit your endpoint with the correct parameters.\n\nTo me this seems painfully simple, you are given everything you need already to go. You just need to add a single express endpoint. Unfortunately i had people complaining that the test was too long, too difficult, unfair etc. Considering the position was asking for someone with both react and express experience i found this kind of mind boggling. \n\nI guess my question is what would people rather have? People complain about whiteboard interviews, people complain about other interview types. Honestly now i more or less have given up on both whiteboard interviews and just do a a 1 hour interview with people in person/skype. \n\nEven then i have had recruiters who have had their applicants complain that an hour is too long, so what exactly is it people want nowadays? \n\n*EDIT* For people curious more curious about the test this was for a mid-level position as an easy/early way of screening out people:\n\n1. I asked applicants to put their result under some form of source control management, on something like Github or bitbucket\n2. I explicitly stated you should not do anything beyond the scope of the assignment, i am not asking for tests because there is no test runner setup or configured.\n\nWhat i was actually looking for specifically was:\n\n1. Did you complete the assignment (duh)\n2. Did you actually take the time to look at the format and layout of the existing code base and try to ensure your changes match the existing style.\n3. Your commit history (Hint this should not be a single commit regardless of anything)\n4. All the other endpoints were documented using jsdoc, did you take the time to do that?\n\nNow some fun metrics as i grep through my inbox: \n\n* I received a 782 applications for the position\n* I sent out the test to a 109 of the applicants\n* Of those 109, only 63 actually replied to the assignment. \n* Only 47/63 applicants who responded actually finished the assignment\n* 36/47 used github\n* 5/47 attached their changes as a zip file\n* 4/47 used bitbucket\n* 2/47 said they completed the assignment, but didn't give me a link of where they put the code\n* 13/47 were invited for an onsite 1 hour interview\n* 2/13 did not reply\n* 1/11 did not show up to the interview\n\nIf i recall there were several applicants who did things wayyy beyond what i asked from the scope of the assignment. While it is awesome your keen, unfortunately this isn't what i asked for. ",
          "score": 80
        },
        {
          "body": "I'm with you, man. It's gotten ridiculous.\n\nI've interviewed at Big Tech and it's always been a time consuming nightmare...HR phone call, 1+ hr. online coding session full of esoteric BS, entire day spent onsite to ultimately get rejected for reasons unknown. This is with me having 8+ yrs experience. I never would've imagined getting recruiters from Google, Faceboook, MS, etc. reaching out and me being annoyed rather than excited, but fuck the CTCI, time-consuming interview gauntlet.\n\nI've resigned myself to working on shitty enterprise CRUD apps rather than somewhere interesting. Fuck it!!\n",
          "score": 53
        },
        {
          "body": "I'd do them, but within reason. They need to be toy problems that don't expect you to take more than 2 hours to do. Also, I would not do them if the challenges are given before the actual interview. \n\nYou're not presenting a good cost/benefit trade-off by giving a code assignment before an interview. People are more willing to commit to them when they are much further ahead in the running for the job.",
          "score": 103
        },
        {
          "body": "Holy shit, reading some of these responses I’d love to see what a programmer’s union would do for its people. \n\nDev: “My boss kicked me right in the asshole the other day”\n\nUnion rep: “YOU SHOULD BE GREATFUL IT’S SO EASY TO POOP NOW”",
          "score": 102
        },
        {
          "body": "I’ve found take home assignments to be a load of BS. You are wasting several hours on a random project without any guarantee of an interview. They end up weeding out a lot of strong developers who work full-time, and are too busy to spend time on a coding challenge. \n\n\nNevertheless, coding challenges are not the norm. There are tons of great no-name tech companies that still stick to only doing a phone screen and in-person interview.",
          "score": 10
        }
      ]
    },
    {
      "title": "Interview Discussion - May 13, 2024",
      "body": "Please use this thread to have discussions about interviews, interviewing, and interview prep. Posts focusing solely on interviews created outside of this thread will probably be removed.\n        \nAbide by the rules, don't be a jerk.\n        \nThis thread is posted each **Monday and Thursday at midnight PST**. Previous Interview Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Interview+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1cqt2jz/interview_discussion_may_13_2024/",
      "comments": [
        {
          "body": "Got interview for entry level frontend developer role at coinbase. Any tips for the interview ?",
          "score": 1
        },
        {
          "body": "Hey There!\n\nI've been doing a lot of hiring (I'm a Director of Customer Success at a SaaS Company) and I've had some very poor experiences on first round interviews. I've frequently felt the urge to stop the interview and provide some feedback on how the candidate could do better.\n\nObviously I couldn't do that **BUT** I could create a free resource that hopefully people could find useful if they are currently on that journey.\n\n**I'm by no means an expert** in interviewing but I've interviewed hundreds of people and have helped numerous friends of mine secure jobs or significantly improve the quality of interviews.\n\nSo, I Imagine I could do the same for others with a few unorthodox strategies.\n\nAn example would be the difference between a good and bad question at the end of an interview or how to research before an interview and furthermore use that information to your advantage.\n\nBefore I share this link, I just want to be clear on a few things...\n\n1. There is **no business** that exists arounds this (There is no website, I created an email address for this **recently** to separate things from my personal email as I've had over 250 people download this guide over the last month or so)\n2. Again, I'm not an expert.\n3. I'd really love to engage with people on this topic (Get feedback, share stories etc)\n4. I decided to use a google form for a few reasons: **1)** I wanna see the reach of this thing, **2)** I have way more tips to share, so if it's useful I'll create and follow up with a complimentary guide or maybe a second round guide or an Resume builder guide you tell me.\n5. **It's free, so please don't feel scared or hesitant.**\n6. It's not too content heavy either, so won't take you long to get through. (Short 4 page PDF)\n7. I also built this in Canva and I'm no designer, so no judgement please :)\n\nIf we don't get a chance to connect, good luck on your job search!\n\nHere's the [LINK](https://forms.gle/acvA4ECxrrTWCVqV8) to get the guide",
          "score": -1
        }
      ]
    },
    {
      "title": "Advice on transitioning from DevOps to Backend Development?",
      "body": "## Background\n\nI currenlty have about 2.5 YoE. I have a B.S. in Computer Science and I'm halfway through my M.S. in Computer Science as I'm doing it part time while working full time as a DevOps Engineer.\n\nMy company is solid, I have good senior engineers who provide mentorship when requested and my boss is great. I've learned a ton from this job and I think its been a great first job out of college.\n\n## Why do I want to transition\n\nI have always wanted to be a backend developer. Programming is a genuine passion for me and I really enjoy developing/consuming APIs, working with data by creating new database schemas to deliver new products/features or just basic CRUD operations, and in general building things and solving problems.\n\nI was apprehensive when I decided to take the job, it was the first company I interviewed for because I had a feeling I would rather be a Backend Developer. I was correct. I had some decent reasons to accept the job and I don't regret anything but I think its time to make the transition and focus on progressing my skills/career in the direction I have a passion for.\n\n## Development Experience\n\nIn my current role, I've been vocal about my prior development experience and have been given the most opportunities on my team to actually write code. I've developed a Database Reload service which syncs all dev/staging/production databases in our org (about 30) using the Boto3 API for RDS instances and MongoDB Atlas for those instances. Computed on Lambda, orchestrated on Step Functions, scheduled with Eventbridge. All infra deployed/managed with Terraform. I've created the TF to be \"self-service\" so its simple enough that Devs can configure a reload for any greenfield data tiers for their apps.\n\nI had an internship during undergrad and write Python code and deployed to Lambda. Did basic request processing from webhooks. Nothing special.\n\nI co-founded a startup during undergrad. I gained experience duscussing product innovations, identifting possible features for iteration, architecting technical solutions for respective features, providing estimates for the project, delivering solutions. I actually did some cool stuff. One project I cut our operating costs by 80% by designing a 3 tiered solution on AWS allowing us to migrate our search indexes from a ridicuously expensive SaaS to an in-house PostgreSQL index on RDS. Did a bunch of other serverside stuff to and database schema design.\n\nThis is really what I loved and why I want to transition to being a Backend Developer\n\n## What I'm planning on doing to execute the transition\n\nI haven't received any callbacks for Development jobs for obvious reasons (no recent SWE experience and current job market). I'm currenlty focussed on skilling up for interviews.\n\n- I am reading a few books: Cracking the Coding Interview, Pragmatic Programmer\n- I am also practicing LeetCode, trying to to 1-5 a day, solving each question with multiple approaches if applicable and understanding tradeoffs/runtime complexities, etc.\n- I am taking an Operating Systems course next in my MS. We will be developing some general OS type projects in C/C++ like client/server file transfer protocol with websockets, multi threaded version of first project, transfering files with gRPC.\n\nI would also like to work on a fun side project in Golang, but I simply don't have enough bandwidth for this since Work + School + Girlfriend take up a all my time.\n\n*Would a side project or two be better to focus on instead of LeetCode, and just take the L if I can't solve anything harder than an Easy LeetCode style question?* For example, I have a Bitcoin DCA service which places scheduled orders via CoinbaseAPI. Its written in Golang, deployed to Lambda, Scheduled with EventBridge. All infrastructure is managed/deployed via Terraform. I could add some more features to this project and/or do similar stuff. Obvioulsy not a ToDo app in React that I copy/pasted.\n\nI'm curious to hear any other advice from other people.\n\n## TLDR;\n\nI'm currently a DevOps engineer with about 2.5 YoE total and want to transition to a Backend SWE role. I have some development exierience, I have a B.S. in CS, currently pursing a M.S. in CS part time alongside my job. Any advice for my transition?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1cm3fog/advice_on_transitioning_from_devops_to_backend/",
      "comments": []
    },
    {
      "title": "Companies without a Bachelor's Degree requirement?",
      "body": "I have previously interned at 3 big tech companies (one  really high performing Unicorn/big tech company, fintech (similar to robinhood), and Facebook/Meta)\n\nWhat companies would hire someone for an entry-level role for SWE without a degree?Im primarily interested in Big Tech companies or Trading Firms.\n\n(I know Jane Street and Jump Trading have no degree requirement but its really hard to get noticed by them since I don't go to a top school and have not interned at a trading firm yet)\n\n&amp;#x200B;\n\nFor personal reasons, I would like to start working full-time somewhere without finishing my degree or going back to school and I have more than a year left of school left so I'm not really interested in being convinced to finish that.\n\nI will say I have been having success with getting interviews while indicating I wont be returning to school at some of the smaller Prop Shops / HFT's but not really with big tech which is why I'm making this post, trying to see if there's any other companies I missed.\n\nCoinbase and Meta does allow no degree hires but I did not like my experience at Coinbase and Meta recently added a degree requirement to all return offers so I can't really return there either if I wanted to go the no degree route.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/whv0sx/companies_without_a_bachelors_degree_requirement/",
      "comments": [
        {
          "body": "\\*Notices username\\*\n\nAlright dude... sounds like you got everything figured out and don't need our help.",
          "score": 10
        },
        {
          "body": "Even if it says it requires a degree doesn't mean that it does. Microsoft/Amazon both don't require degrees for SDE positions I can say for certain.",
          "score": 3
        },
        {
          "body": "&gt;What companies would hire someone for an entry-level role for SWE without a degree?\n\nA lot of companies would hire someone without a degree, but they're not household names or big companies with a widespread presence (or, at least, not a widespread dev team) so naming them is kinda pointless. The majority of jobs out there are at companies you've never heard of that do things you might not know needed doing.",
          "score": 2
        }
      ]
    },
    {
      "title": "Bad News: Any End in Sight?",
      "body": "There has been a lot of news about offers being rescinded, hiring freezes, positions no longer being available, etc. A lot of the heavy activity seemed to have occurred in late May. \n\nFor people that are hoping to land their new job, is there any light at the end of the tunnel despite this news? Has anyone noticed if these trends apply more to certain types of companies (VC funded perhaps)? Is the sad news over or is it likely it’ll continue?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/v7ocvs/bad_news_any_end_in_sight/",
      "comments": [
        {
          "body": "The light is already here. \n\nPre-IPO VC backed startups and crypto companies are hurting. A few big name companies like Meta have frozen hiring. But the industry as a whole is still hiring like mad. You've just been fooled by headlines to assume that the entire industry is tanking and has stopped hiring.",
          "score": 24
        },
        {
          "body": "I got my coinbase offer rescinded and already taken 4 OAs in less than a week and some HR screens scheduled. Granted recruiters have been reaching out to those affected so I'm getting a lot of help that I'd normally not have. \n\nHowever 2 of my OAs were from cold applying.\n\n\nThere's still jobs but a lot of the great ones won't open until Oct-Nov when 2023 hiring begins. My plan is to work anywhere I can then in a few months when 2023 is open I'll apply to dream companies. Ofcourse your dream companies might be hiring now. So keep looking.\n\nAmazon is definitely hiring though if you want a big company. I hope to land a job there but they have a tough interview process.",
          "score": 5
        },
        {
          "body": "It will likely get worse for a while. It will get better eventually. You can probably still get hired in the meantime, just not quite as easily as before.",
          "score": 3
        },
        {
          "body": "I can tell you this much: Amazon is hiring as I’m still getting approached by their recruiters and hiring managers (as recently as hours ago).\n\nI am not a current nor former Amazon employee.",
          "score": 3
        },
        {
          "body": "It's such a weird market. There's all this doom and gloom but I'm hiring and struggling to find good candidates where I would normally have plenty.",
          "score": 2
        }
      ]
    },
    {
      "title": "[Need Advice] Go back to school or keep working in a Non-tech Job?",
      "body": " Hello,\n\nI apologize for the long wall of text. To understand my situation, I will encourage your to read my background, because I think that might help to understand my situation.\n\nSo here is some background. I graduated in May 2022 with BSCS. During school, I didn't do any internships because I was working full-time and didn't want to lose a well-paying job that supports my family. Before graduation, I accepted a New Grad SWE Position at F500 in Feb 2022 and was really excited to start. However, things didn't go as I planned. A week before starting, HR contacted me and told me they can't offer me the job because of my immigration status. At this time, I had already said no to one other company and stopped looking for jobs, and in middle of the May, I had no Job. I have already given notice to my day job and started training my replacer. (you can read more about the immigration situation in the end)\n\nSinces May, I have been applying for all sorts of SWE jobs ( Junior, Entry, and even internships). Noticeable companies I applied to and reached the final round:\n\n* Xactware - Ghosted after final.\n* Fidelity - Bomb the final round because I can't understand the question and the financial lingo they used in the question.\n* Visa - Rejected after the final interview, even though 2 out of 3 interviewers told me they would love to have me on their team and told me they are going to give me a positive review.\n* Coinbase - Stop hiring, the next day of my final interview. I aced the last round and finish it before time.\n* Zillow - ghosted after phone screening, behavioral, and OA\n* ZipRecruiter - ghosted after behavioral and OA\n\nFinally, I interviewed for an SWE job at a Big Bank. After all rounds, HR called me and told me all the interviewers loved me but they don't have any SWE jobs available anymore; however, they like to make me an offer for a BA position. I accepted the offer a few days later because it's better than nothing. **Now I come to a conclusion that I have left with two options left:**\n\n1. **Keep applying for jobs while working as BA, keep doing LC, and hope for the best.**\n2. **Do the above \\^ and wait till the end of the year. If I didn't lend a job, I should quit my BA job and go to school for MS full time and do some internships.**\n\nThanks in advance for the advice.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThe immigration drama:\n\nFor the ppl interested in my immigration situation, here is what happened. I told HR the laws they are going by are old and told them to go check the new immigration laws. But HR didn't listen and kept reciting that I have my immigration status doesn't permit me to work in the US. I was upset and broken. I can't fathom that the HR of one of the F500 company which has 25000 employees have no knowledge regarding my immigration status. I decided to sue the company after talking to different HR friends of mine. They told me the company violated the law and they are just not aware of it. I sued them for immigration discrimination and currently settling the lawsuit. The F500 lawyers apologize on behalf of the company after realizing how they ruined the last 3-4 months of life.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/v9hjmk/need_advice_go_back_to_school_or_keep_working_in/",
      "comments": [
        {
          "body": "I think you need to be more aggressive in your job search because it sounds like you're giving up relatively early. I'm in the same boat as you. Graduated in May, no internships, but I've sent hundreds of applications and have a had roughly a dozen interviews.",
          "score": 3
        },
        {
          "body": "No idea how school is an option here",
          "score": 1
        }
      ]
    },
    {
      "title": "Coinbase frontend questions",
      "body": "I got an interview coming up with Coinbase for frontend engineering (React). What type of react based or Javascript questions should I focus on? In general what to become expert in frontend please help me with some resources. Ya boi needs serious help rn!!!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/snojl1/coinbase_frontend_questions/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "How’d it go? I have one soon and would love guidance!",
          "score": 1
        }
      ]
    },
    {
      "title": "My take on take home exercises",
      "body": "I think take home exercises are bullshit and would rather take whiteboards, here is why. \n\n* 1) Often the instructions of take home exercises are ambiguous because hiring managers are not trained to write instructions for take home tests.\n\nMy sister is a teacher and she tells me standardized tests go over multiple reviews of the wording and find every possibility that questions are ambiguous and needs rewriting. I bet SATs and ACTs are also designed to not ambiguous and leaves very little room for second guessing.\n\nI have see multiple times where hiring manager says instruction X, which he is really looking for Y, but candidate did Z. One could argue that Z is a subset of X and I even convinced the hiring manager that Z is a subset of X, but since Y != Z and the manager really needs to see Y, rejected. \n\nI have never never seen any company that takes take home hiring as serious as a standardized test as SATs/A-levels, which I argue you should because you are taking as much of a candidate's time as much a standardized test would involve, possibly even more as 6+ hour take home exercises (see the Coinbase one posted in this sub a while ago) become more and more common.\n\n* 2) Hiring managers give inane reasons to reject take home exercises. \n\na) \"His code is too messy\". Define \"messy\".\n\nb) \"I don't like this function taking 6 arguments\". And 5 arguments are OK? Besides, is it a PEP8/your languages coding standard violation? \n\nc) \"Candidate should have used XYZ library instead of writing their class that mimics XYZ library\". Then say it in the instructions! The only time I question not using a specialized library is cryptography because writing your own cypto library is seriously dangerous and is extremely likely to contain vulnerabilities. \n\nd) \"What sort of idiot does 'a = a + 1'\". Works fine or me, interpreter doesn't complain, and is only marginally longer than \"a+= 1\"\n\n* 3) Managers spend as little as 1 minute reading your code, like how they review your CV. I have worked for a fair amount of companies by now and I have never seen any company that requires you to at least spend X time looking at take home exercises (and CVs too). I have also seen enough times where the hiring manager goes \"Ehh I'm busy today\" - Looks at take home exercise for like 30 seconds - rejected. \n\nAt the end of the day I rather take whiteboards, both take home exercises and whiteboards both involve writing code that will hardly relevant to the actual job. But at least the hiring manager is down as much time as you do, no more \"Eh, I'm busy - rejected\". \n\n* 4) Managers have unrealistic exceptions on time frame. \n\n\"For our intern hire take home exercise, writing a connect 4 game in Python should take like 5 minute tops, probably 3 minutes.\" \n\ntl;dr - take home exercises are bullshit because hiring managers don't take it as rigorously as SAT/standardized tests. They are really just to save the hiring manager's time and it can be way more unfair than a whiteboard. ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/8pmvto/my_take_on_take_home_exercises/",
      "comments": [
        {
          "body": "That kind of screening process selects for desperate candidates. I definitely would never do a take home assessment now that I'm employed. A 1-2 hour coding challenge, sure, but not a potentially 4-8 hour project. ",
          "score": 5
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "I agree with you. The company I applied a month ago had a home exercise with a 2-week limit. They expect senior level devs to complete it in 3-4 days. I never had a developer job and I completed the project 4 days. I emailed a friend who works there to look over my code. He told me it looked great. I turned it in and I was ghosted. I even emailed HR and the developer manager about the status of my hiring and I have heard nothing back. \n\nMakes me mad I spend 4 days on a project and I don't even receive a rejection email. ",
          "score": 3
        },
        {
          "body": "Speaking as an older/busier developer, I actually quite like the sound of take-homes compared to whiteboards/on-sites. An interview is actually quite an artificial situation, whereas if you code at home you have all the tools you would normally have and access to the internet - the same as you would when actually working for real.  Also, it would be nice to do this part of the interview stage without having to take time off of work - something that can sometimes be awkward to arrange.",
          "score": 2
        },
        {
          "body": "All my take homes have involved code that is quite relevant to the job. Of course, my take homes have generally only been like one or two hours anyway.",
          "score": 1
        },
        {
          "body": "Do you think your manager's going to be any less arbitrary once you're hired?",
          "score": 1
        },
        {
          "body": "You have to realize that there's a huge amount of really unqualified entry level devs out there these days that have taken a class or two on Udemy or went through a non-rigorous bootcamp. As an employed dev, I don't think I would do any coding challenge that took longer than an hour or two unless I was really desperate for some reason.\n\nExperienced devs can get away with not doing take homes, but I think coding challenges to be a good way to weed out unqualified candidates for companies that are actually looking to hire for real entry level positions (i.e., positions that would take a fresh bootcamp grad or a comp sci student with no internships). If a fresh bootcamp grad isn't willing to take a coding challenge, why should a company take the risk on hiring an unproven talent?",
          "score": 1
        },
        {
          "body": "I always do better on take homes. But yeah I don’t want to spend a significant amount of time unless they pay me. Which they do occasionally. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Experience working at DRW?",
      "body": "I'm a former Google engineer who moved to Chicago for lower cost of living, working at a startup with moderate pay (username no longer relevant) but pretty good work/life balance.  However I'm noting certain structural changes at the startup that has me questioning my future there, and at the same time, DRW gave me a shout and I took a look.\n\nNote that I haven't clinched the job yet, but I've generally been pretty good at interviews and I found the phone screen trivial and the takehome felt pretty solid.\n\nBefore I take a day off to look at the company, I was hoping to get input from anyone who has ever worked there before, good or bad.  Glassdoor reviews are surprisingly solid, and the pay the recruiter has been talking about is very high.  I got some red flags in the interview about it being a feature grind.\n\nAnyone have actual work experience there, particularly at the senior level?",
      "subreddit": "cscareerquestions",
      "score": 14,
      "url": "https://reddit.com/r/cscareerquestions/comments/9q7f6b/experience_working_at_drw/",
      "comments": [
        {
          "body": "take a look at other trading firms too, like IMC, Jump, Optiver, Citadel.\n\nIf DRW reached out you probably have a good shot at getting positions at other firms too- and can gather more information and take your pick of the culture, and position that you really want. (comp should be similar)",
          "score": 16
        },
        {
          "body": "Every dev I have met that works there are very knowledgeable and skilled. Haven't heard bad things about it, so imo I view highly of them. ",
          "score": 5
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "What is expected of a freelancer dev who's been working on and off for about a decade? I'm targeting full-time jobs for more job stability.",
      "body": "I usually do freelance contract work. Not contracted out by a consultancy or agency, but completely on my own, the cold approach. Even in the few times I worked 9-5 and came into an office daily, on my taxes I'm a contractor. They didn't compensate me anything beyond than hourly pay, and they didn't have a promotion track. As such I wasn't expected to make any growth in contributions or roles.\n\nAs far as tech experience goes, I have Ruby on Rails, some Node.js and a lot of LAMP stack work. It was _not_ expected of me to write unit tests, build CI/CD pipelines or infrastructure at any of these jobs. It was hyper focused on writing front-end and back-end application code, little else. Unless you count web hosting tools with Apache and DNS config as infra knowledge, but I know that is ancient tech by now. \n\nIn job history I tend to have better luck with local small companies I found on Craigslist. But I keep my options open, mostly apply to companies on LinkedIn and Indeed. I apply and get interviews from companies of all sizes. I might get 1, 2, 3 rounds- it varies by company. I get some of the FAANG companies to interview me as well as some other major names, Zillow, Niantic, Coinbase to name a few.\n\n The bulk of my applications go to mid-level roles and roles with no specific level (they just name it \"software developer\" full stop). And I'm facing a lot of rejections and trying to zero in on what are the ideal jobs to apply to.\n\n Are junior jobs the way to go here? Not expecting to make it super easy, but at the least I want to know what I can filter out ASAP so I don't waste time applying to jobs I have no chance of getting.\n\nIn short, I want to know where expectations lie for a company that is considering a freelancer of 10 years or so  with the above experience, looking to break back into full-time employment. I don't want just a \"keep applying\" answer but a \"here's how you can pick your targets more effectively\" based on my experience. And for that I probably need to know how a company decides to hire a freelancer and keep them in the running with competition that is mostly full-time workers with a better growth path.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/z6hqjb/what_is_expected_of_a_freelancer_dev_whos_been/",
      "comments": [
        {
          "body": "I think you're making the right choice by sticking to mid level roles. Avoid sr+ roles. Maybe go for junior roles if they're for FAANG or the like companies, but it seems like you would be over leveled at junior for smaller or non tech companies, so stick with mid there.\n\nI have some (cold) freelancing exp as well. That experience for the most part seemed to have been disregarded by most companies I applied to only bc I think it was too old (like 6ish years, and in lamp stack w alot of WP and drupal. It's old bc I got side tracked by an educ career), so I had to essentially start over.\n\nAfter finally breaking in and have a few years exp under my belt now, for me there was def a lack of knowledge in working on teams, more modern dev practices, and not knowing industry standards bc I was on my own for many years. In retrospect, if I knew what my deficiency was then, I could have made up for it rather than starting over. You seem to have an idea of what you're lacking so might be worth brushing up on those things, esp if you're going for fullstack roles.\n\nThat said, if you have sights on FAANG, you'd want to focus on your leetcode and system design. I find smaller tech companies or startups tend to want specific exp on their given stack rather than overall exp. Bigger companies, the non tech types (insurance, banks) seem to be more open to general exp and tend to have longer onboarding exp and more leniency in terms of expected proficiency. For behavioral, look up Amazon's leadership principles and how they interview for that. I actually find that prepping as you would for their behavioral will cover for alot of other companies too.\n\nFor work where you were a contractor, label it as such and try to stay away from the freelance label. \"Contract\" seems to be taken more seriously. Focus on value you provided and with good examples of teamwork.",
          "score": 3
        }
      ]
    },
    {
      "title": "Landed my first internship, here are some tips for 1st, 2nd year students",
      "body": "I just want to say 3 main things: \n1) Believe in yourself. \n2) Stop comparing yourself to other people. Everyone has a different starting point. \n3) There are other great companies out there besides MANGA. \n\nI never had an internship before. Last year, when all my friends applied to Google STEPS, Microsoft Explorer, or FBU, I got rejected by them all, so I decided to thoroughly review my resume and found some problems.\n\n1) I did not have enough projects, or if I did, I did not quantify my results. Learn how to write “Do X to achieve Y and get results in Z”\n2) Interview: LeetCode (75 blind questions), learn how to write comfortably in one language (means if you don’t know some syntax, you can look it up and understand), prepare to talk about your projects (what/how/why did you do, use STAR method), also feel free to choose some mistakes that you did in your early years (explain if you could go back, how would you do it) \n3) Hackathon: take advantage of your local hackathons at school or online hackathons! \n4) Networking: ask your school for sponsorship to go to Richard Tapia/Grace Hopper/AfroTech Conference, etc\n5) Others: check out Google Summer of Code, MLH Fellowship, etc\n\n\nApplied: a lot\n\nInterview: LinkedIn, Facebook, Affirm, Coinbase, Snap, Oracle\n\nOffer: Snap, Oracle\n\nStats: 3.4 GPA, won 2 hackathon, no prev internship",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/r95hdh/landed_my_first_internship_here_are_some_tips_for/",
      "comments": [
        {
          "body": "I support all three points you made, especially number 3.  I've never been attracted to working for the tech giants.  I would add a two more.  Get internships early and often, you don't need to be a junior or senior.  Also, start building a portfolio of projects early in your academic career.",
          "score": 2
        }
      ]
    },
    {
      "title": "Internship Recommendations (Not exclusively SWE)",
      "body": "I was wondering if we could gather a list of good internships to apply to for undergrad CS kids.  I'm currently in my third year and in the midst of applying to a bunch of internships (no success so far) and wanted to crowdsource some recommendations for potential companies to apply to as I'm running out of ideas.\n\nI would love recommendations for a wide range of fields, not just the typical ones you see in this sub (i.e. SWE or Data Science at FAANG).  While those are certainly most welcome, I'd love to see recommendations for fields where CS is still in demand but is slightly less mainstream as well, for example Quant Trading or literally anything else which could be interesting.\n\nI'll start it off with some seemingly cool places which I've applied to, and hopefully you guys can help add to the list:\n\nJane Street (prop trading firm)\n\nSusquehanna International Group (prop trading)\n\nTwo Sigma\n\nCitadel\n\nGoogle\n\nFacebook\n\nCoinbase\n\nLet em rip!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/f304q3/internship_recommendations_not_exclusively_swe/",
      "comments": [
        {
          "body": "See /r/csmajors and the pinned thread.\n\nAlso the deadline to apply/be hired has passed for pretty much every company on your list (for Summer internships).",
          "score": 4
        },
        {
          "body": "Free food at SIG was a good thing.",
          "score": 1
        },
        {
          "body": "What’s coinbases interview process? I passed the triple byte but now I have to take a hacker rank. Seems excessive",
          "score": 1
        }
      ]
    },
    {
      "title": "Remote Administrative Assistant for Coinbase- Is this job legit?",
      "body": "\n\nHey guys!\n\nSo I wanted to ask around here if this job is legit.\n\nI would have liked a video interview (though I seem to botch those anyway…) and I did apply to this job (I’ve applied to hundreds of jobs in the last few months…) through LinkedIn and was happy to hear back from a recruiter in Linked In… \n\nI just… I’m going to be honest: I’ve been burned before and it seems the only ones that get back to me that AREN’T rejections are scams or MLMs I want no part of… \n\nWhat do you guys think? Is this legit? \n\n“Dear Applicant,\n\nThank you for your application, our hiring team at Coinbase has reviewed your resume thoroughly. I'm writing to inform you that the team has made a unanimous decision to extend the offer of Remote Administrative Assistant with Coinbase on the following terms and conditions:\n\nPosition: Remote Administrative Assistant\n\nJob description: A responsible Administrative Assistant to provide personalized secretarial and administrative support in a well-organized and timely manner. You will work on a one-to-one basis on a variety of tasks related to manager’s working life and communication.\n\nKey Responsibilities:\nAnswer and direct phone calls.\nOrganize and schedule appointments.\nWrite and distribute email, correspondence memos, letters, faxes and forms.\nAssist in the preparation of regularly scheduled reports.\nOrder office supplies and research new deals and suppliers.\nMaintain contact lists.\nBook travel arrangements\nStart date: June 16, 2025\n\nPosition hours: Monday to Friday (minimum of 20 hours required). You are free to set your own hours.\n\nSalary: $41.45/hour.\n\nBenefits: Flexible hours of work\n\nWe kindly ask you to review these conditions and reply to this email with your acceptance or declination.\n\nWe look forward to hearing from you and thank you again for your time and correspondence with Coinbase.”\n\n\nEDIT: Aaaaaaaaaand the recruiter is no longer on LinkedIn…. \n\nGreat. \n\nSo this was going to turn into a fake check scam, right? Or something else…?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1l1sj4l/remote_administrative_assistant_for_coinbase_is/",
      "comments": [
        {
          "body": "Come on man, this scam is as obvious as it gets. The giveaways are:\n\n* \"We **kindly** ask you...\" (classic Indian scammer speak)\n* Nobody lands an $80,000/year job with no interview.\n* NO INTERVIEW.\n* \"Dear Applicant\" - If they were truly offering you a real job, they would know your name lol.\n* \"You are free to set your own hours\" - No administrative assistant in the world is free to set their own hours.",
          "score": 2
        },
        {
          "body": "Oh damn I just got the same offer. I reported it to the coinbase cyber security email \n\nIt’s sad bc I really want a job too",
          "score": 1
        }
      ]
    },
    {
      "title": "3 month long Interview 😵 by citi",
      "body": "So I applied for a job at citi group for a weath advisor at the end of June. Week later 1st interview with recruiter went great. 8 daystar knocked out the 2nd interview and that went really well.. then they went and changed the name of the role 2 digital wealth coach (wth is that?) Then they ask me 2 send in a CRD which is fine.. then 2 weeks go by...I f/u with HR and they are lime we are still n the process.. now I'm in Aug. And followed up again..we are waiting on the approval..this is not a small company this is citi..then it's like oh we looked at ur broker check and it says u still work at Robinhood.. I'm like no it doesn't it shows they were last 2 carry my licenses and since Coinbase doesn't do that then that's why. They were like oh.. why did u leave CB? I was like yall made me feel out an application and CRD which states I was part of the 20% that got canned..gezz pay attention.. then they were like ok thanks another week goes by they are like fill out this covid form if u want an exception for not taking the vaccine... THESE FOOLS HAVENT EVEN MADE ME AN OFFER YET 🤣.  I got a great offer from the largest investment bank and i started the process later..so yeah I know u guys are like soo ur good.. Citi is like 10 mins from my house &amp; the other guys are like 45 mins.. both would require 3 days in office 2 at home. I know the other guys are better but feels like a dam waste not 2 get an offer this far in the process. WHAT YOU THINK?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/xm9cw0/3_month_long_interview_by_citi/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I dunno…FINRA has been weird lately….and why are you “interviewing”? Fog a mirror and bring 20M or so with you and anyone will hire you blind.",
          "score": 1
        },
        {
          "body": "They could be on a hiring freeze, things can take time",
          "score": 1
        },
        {
          "body": "Sounds like they are completely disinterested in you and can’t decide due to their corporate structure who is to call it off. Every week some Sandy has to exhale heavily at your emails and delegate that some Steve to handle. Typical mega corporation.",
          "score": 1
        },
        {
          "body": "Citi sucks.  I worked on the mortgage side in the St Louis MO area.  The company was constantly hiring then laying off.  I was hired in 2014, 9 months later the department was eliminated.  They did give us some temporary positions and a hiring code to apply for new positions as displaced employees.  I was jerked around 3 different times when I applied.  Once, I was due to start on a Tuesday following a holiday and they reached out the Friday before to let me know they decided not to fill that position after all, as they were over budget.",
          "score": 1
        }
      ]
    },
    {
      "title": "Did I ask for too much or too little in this contractor opportunity?",
      "body": "(I've never been a contractor before so I'd really appreciate info on the lay of the land.)\n\nA staffing agency recruiter called me for a remote contractor position with Coinbase. The title of the role is &lt;Name of my current company (which is in SaaS)&gt; Specialist. Main responsibilities would be maintaining, building, deploying, testing the survey and dashboards they need, using the platform of the current company I work at. I have one year of experience and I'm in my early to mid-20s.\n\n  \nThe recruiter on the phone asked me what my hourly W2 rate would be and I deflected so I could think a little. Later I emailed him back and said my rate would be $50/hour, and he sent my profile to Coinbase's hiring manager, who will interview me next week. He said it's just one interview. Their previous candidate fell through and it sounded a little like they need to find someone soon.\n\n  \nI asked on Fishbowl about if my rate of $50 was too high or too low. I asked in the Consulting bowl, and I clarified my YOE is 1 year, but everyone said I asked too low and I should ask for at least $100/hour. Someone even said I kind of shot myself in the foot because   \n\n\n1. by saying $50 an hour, I revealed I didn't initially know the difference between W2 and contracting in terms of pay structure\n2. once the recruiter submits my profile at a certain pay rate, it's difficult to backtrack\n\nRecruiter already showed me the LinkedIn profile of the Coinbase hiring manager and said I'll get an interview early next week. Should I ask for a higher rate? If so, should I email the recruiter or say that during the interview? And what should I ask for, and how should I go about it?\n\nThanks so much for any help!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/uaal4k/did_i_ask_for_too_much_or_too_little_in_this/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "My Labtuit experience.....",
      "body": " \n\n## [As a job seeker spend your money elsewhere](https://www.trustpilot.com/reviews/63d2dfc64b01fb3f548e143f)\n\nI want to state that this is my experience and take full responsibility for the mistakes I made in the transaction. \n\nI signed up with Labtuit when I first got laid off in the Summer of 2021. As a concept, It seemed like an awesome idea the execution however was very poor. When I signed my contract with them I shared my current journey with the AE including companies I was currently speaking with and already in the interview process. This is important to know because the way they make money is if they help you find a role then you pay 3% of your first-year salary (usually broken out in three months which is helpful). If you get hired by a company that you were already working with then it's just 1%. When the contract was sent over I signed it. In this part, I will admit I made a mistake. In the contract, it states I needed to submit documentation of interviews and conversations I have already had in the event I got hired by one of these companies. Although I glossed over it I would think that the AE that was working with me would have said something when my contract came back without that documentation. Well, I was barely a month into working with them when I got a contract role with Coinbase. A company that I was talking with before engaging with Labtuit. The only thing that they had helped me with was my resume which I had paid $200 for right after signing the contract. Considering how quick the process was with Coinbase after signing my contract with Labtuit it should have been obvious this was a role that I was in the process with before engaging with Labtuit. I did not use any of their resources to obtain it. I asked them about the payment and assumed it would be the 1%. Unfortunately, that was not the case. I wasn't thrilled about it and felt duped. Regardless, I started to make my payments. This brings me to my next pain point with Labtuit. With the amount of money they were collecting you would think they would have a more formal payment portal and consistent accounting practices. Instead, you can make your payments via debit/credit card (with an additional convenience fee), wire (again with an additional convenience fee), or Vemo. Life and work got really busy and I neglected to make my last payment. I honestly didn't remember until I got a nastygram from them in October of 2022 that they were going to take me to court for the remaining amount + $5000 if I didn't pay up. By this time I was laid off again and had no money to pay them. Also, it appears their emails were going to my spam folder which is why I didn't see earlier communications. I am not sure why they didn't call me as they had my number. Regardless, we worked something out and I started to make my final payments. This is where Venmo comes into play. I have been making my payments per our agreement each month. Beginning of this month I get an email from the AE I was working with telling me my payments haven't been made and in fact were quite late. I screenshotted my payments to them via Venmo and said I would make my final payment by the end of January.  \n\n\nTLDR; Great concept but poor execution, customer service, and accounting practices. I truly feel as a job seeker your money is better spent elsewhere.",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/10ts4f0/my_labtuit_experience/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Hopefully the loophole works. I am not paying a single penny for the service I didn’t receive.",
          "score": 2
        },
        {
          "body": "Did anyone successfully refuse payment bc labtuit didn’t help them find a role?\n\nHow much did they end up charging you?",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "They are very shady and aggressive. They also prefer Zelle and Venmo payments wth",
          "score": 1
        }
      ]
    },
    {
      "title": "Ask a Recruiter: Ruby Bhattacharya, Senior Technical Recruiter @ Coinbase",
      "body": "I had the opportunity to sit down and interview Ruby who recruits for engineers at Coinbase. If you guys have any more questions I'd be happy to ask them of her or potentially get her to do an AMA:\n\nhttps://www.youtube.com/watch?v=oy8DW_ICCIM\n\nI hope the advice she gives is helpful in your job search!",
      "subreddit": "jobs",
      "score": 10,
      "url": "https://reddit.com/r/jobs/comments/6jm5kq/ask_a_recruiter_ruby_bhattacharya_senior/",
      "comments": [
        {
          "body": "you guys hire any math majors?",
          "score": 2
        }
      ]
    },
    {
      "title": "Coinbase HR interview",
      "body": "What to expect in coinbase first interview with their HR person. What questions will be asked? ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1ljxxj3/coinbase_hr_interview/",
      "comments": [
        {
          "body": "They'll definitely probe into your motivation for joining a crypto company and your comfort level with the industry's volatility. Expect the usual \"tell me about yourself\" and \"why Coinbase\" questions, but they'll dig deeper into whether you can handle working in a fast-paced, regulatory-heavy environment where things change constantly. They'll ask about your experience with ambiguity, how you deal with stress, and probably throw in some behavioral questions about teamwork and problem-solving. The recruiter will also gauge your salary expectations and timeline, so come prepared with realistic numbers.\n\nThe tricky part is that Coinbase values both innovation and compliance, so you need to show you're adaptable but also detail-oriented when it comes to following processes. They might ask situational questions about handling conflicting priorities or working with cross-functional teams since that's huge there. The good news is HR screens are more about cultural fit than technical skills, so focus on demonstrating your enthusiasm for the mission and your ability to thrive in uncertainty. I'm on the team that built [interview prep AI](http://interviews.chat), and we've helped tons of people prepare for these kinds of screening questions where you need to balance showing your personality with hitting the right professional notes.",
          "score": 2
        },
        {
          "body": "You are interviewing for a role in HR. Surely you know what questions would be asked in a screener.",
          "score": 1
        },
        {
          "body": "I have HR interview at coinbase this Thursday for the data scientist role. How did your interview go? Can you please share what kind of question they asked you? I feel underprepared no matter how much time I spend. Any suggestions would help :)",
          "score": 1
        },
        {
          "body": "Coinbase HR → tech rounds follow a predictable structure now. I wrote up the common themes they screen for—can share if you want a quick edge.",
          "score": 1
        }
      ]
    },
    {
      "title": "Got a generic rejection email from Coinbase after interview loop with hiring manager and couple of other people– but candidate portal still shows “in progress”? Anyone else experienced this?",
      "body": "Hey everyone,  \nI’m reaching out to see if anyone has had a similar experience with Coinbase’s hiring process.\n\nI recently completed multiple rounds of interviews for a leadership role, including a final round with an executive leader. Everything seemed to be going well, and communication was consistent throughout the process. However, I just received a generic rejection email with no feedback at all, something that you get during resume screening process from No-reply.\n\nWhat’s confusing is that my candidate portal still shows the application as “in progress” — no status change or indication of a rejection. Has anyone else experienced this kind of mismatch between the email and the portal?\n\nI noticed that I may have submitted multiple applications for this role and was likely referred at some point as well. Could the generic rejection email be tied to one of the earlier applications I submitted myself? If so, isn’t it a bit late for that to be coming through now?\n\nWould appreciate any insights — is this normal for Coinbase? Could there still be internal discussions going on, or should I take the email as final and move on?\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1ky9xb4/got_a_generic_rejection_email_from_coinbase_after/",
      "comments": []
    },
    {
      "title": "Application getting rejected",
      "body": "I have been applying for jobs at Google and Amazon for last 4 months and I haven't secured on single interview so far. All my applications were rejected and without any feedback its really stressful and heartbreaking just to see a rejection mail.\n\nI have been unemployed for 4 months and in a really financially unstable position. All my dreams are getting shattered and I have no idea how to move forward.\n\nFaced rejections from companies like Uber and Meta. Also applied for Microsoft, Paypal, Paytm, Mastercard, Coinbase and many more and haven't heard back from them.\n\nAny tips guys???",
      "subreddit": "interviews",
      "score": 8,
      "url": "https://reddit.com/r/interviews/comments/1gr7la2/application_getting_rejected/",
      "comments": [
        {
          "body": "have you tried applying elsewhere? \n\nNot getting an interview at 2 of the more prestigious, most competitive employers in your field isnt that uncommon.",
          "score": 24
        },
        {
          "body": "I knew someone who later learned that she was being rejected as a result of her applying so frequently that her profile got flagged, despite being referred internally. Applying to a range of jobs at the same employer made her appear desperate and unfocused on any one role.",
          "score": 11
        },
        {
          "body": "There is competition for jobs in these big companies as there are hundreds of people with the same or higher qualifications as you. Don't limit yourself to the giants, get a job and keep applying to these companies if you are still interested.",
          "score": 3
        },
        {
          "body": "Sometimes they have policies: something specific like for example a number of months unemployed that disqualifies upfront. Who’s to know if it’s not again for example, a company you worked for they don’t hire from there. Could be something that you have no control over. You’d have to speak to their HR. But how likely is it you’d get access to them?",
          "score": 2
        },
        {
          "body": "Use LinkedIn to network and ask someone to refer you. I have personally used this approach in the past with a perfect stranger and it worked.",
          "score": 2
        },
        {
          "body": "Those companies are hard to get into. You probably want to start applying to smaller companies. Those are everyone’s dream companies.",
          "score": 2
        },
        {
          "body": "I really hope you didn't mean those were the only two companies you applied for.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "If you know anyone at any of these companies, even if they are just an acquaintance, ask if they will refer you. If you are referred internally, your application will automatically jump the line and hopefully get looked at by someone.",
          "score": 1
        }
      ]
    },
    {
      "title": "Coinbase Analytics Engineer Interview",
      "body": "Hello,\n\nI have an upcoming interview for an Analytics Engineer position at Coinbase. Can someone tell me the process and what kind of questions I can expect?\n\nI have an initial screen call with a recruiter. What kind of questions can I expect?\n\nAlso, if I get past the screen call, what is the interview process like?\n\nHas someone gone through the interview? \n\nNeed some help. TIA.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1ljrvwo/coinbase_analytics_engineer_interview/",
      "comments": [
        {
          "body": "The recruiter screen will focus on your background, motivation for joining the company, and basic technical competency. They'll ask about your experience with data analysis, SQL, and any exposure to blockchain or cryptocurrency concepts. Expect questions about why you want to work at Coinbase specifically, your salary expectations, and availability for the next rounds. The recruiter will also gauge your communication skills and cultural fit since Analytics Engineers need to work closely with both technical and business teams.\n\nIf you advance, you'll likely face 2-3 technical rounds including a SQL coding challenge, a case study involving data interpretation and business recommendations, and a systems design question focused on data pipelines or analytics infrastructure. The technical interviews will test your ability to write complex queries, understand data modeling concepts, and explain how you'd approach real analytics problems in the crypto space. It's good to practice common [Analytics Engineer interview questions](https://www.interviews.chat/questions/analytics-engineer) around data warehouse design, ETL processes, and how you'd measure key business metrics for a cryptocurrency exchange. The interviewers will want to see that you can think critically about data quality issues and communicate technical concepts to non-technical stakeholders.",
          "score": 1
        },
        {
          "body": "How’d it go? Would appreciate any advice you are able to share. Thanks!",
          "score": 1
        },
        {
          "body": "Can you add more details on the process? How did it go for you? Any tips?",
          "score": 1
        }
      ]
    },
    {
      "title": "COINBASE BACKEND INTERVIEW",
      "body": "Has anyone gone through coinbase final backend interview? Any insights would be appreciated.\n\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1hcxcwt/coinbase_backend_interview/",
      "comments": [
        {
          "body": "You'll likely face questions about handling high-volume transactions, ensuring data consistency, and implementing robust security measures. Be prepared to discuss your experience with cryptocurrencies and blockchain technology, as well as your understanding of financial systems and regulatory compliance.\n\nThe interviewers at Coinbase are known for diving deep into technical details, so make sure you're ready to explain your thought process and defend your design choices. They may also throw curveballs related to specific crypto-related problems or edge cases. If you're feeling unsure about any aspect of the interview, it's okay to ask for clarification or take a moment to gather your thoughts. Confidence and clear communication are key.\n\nBy the way, I'm part of the team that created [interview copilot](http://interviews.chat), a tool designed to help with tricky interview questions like those you might encounter at Coinbase. It could be useful for practicing your responses and getting real-time suggestions during online interviews.",
          "score": 1
        }
      ]
    }
  ]
}