{
  "company": "costco",
  "post_count": 42,
  "exported_at": "2026-01-18T17:44:53.268Z",
  "posts": [
    {
      "title": "Suprisingly amazing?",
      "body": "Hey, I had a steady 6 hour shift at my restaurant job today but I had a screening at my local indie bookstore. I showed enthusiasm and seriousness and I smiled a few times. I was nervous a couple of times but I think it went ok. They said they will interview up to Sunday. The screening didn’t ask any STAR quesitons? I asked them A STAR question. Fingers crossed? I also applied for Costco and cds (club demonstration services) this week alone too. I also went in person and had fun at an uno event there at the bookstore last week. I said “thanks for chatting with me today” with a smile. Was that unprofessional? The bookstore is SUPER chill. ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1m9d4bp/suprisingly_amazing/",
      "comments": [
        {
          "body": "No that’s fine for the environment. I wouldn’t say that for every interview. But good luck!",
          "score": 2
        },
        {
          "body": "honestly, you’re overthinking it  \nthe fact that you’re putting yourself out there *anywhere* is better than most—props for being proactive  \nsmiling? asking questions? that’s human stuff, not “unprofessional”  \nyou’re getting the hang of things, and that’s what matters—*don’t over-analyze* the little details  \nthe STAR method is a hack, but it’s not the only way to show you’re a fit for the job  \nyou showed up, you were genuine, and you had a good vibe—that’s all that counts  \nthe next step? keep moving, keep applying, and keep showing that enthusiasm even if you don’t land the first gig  \nthey can *feel* that hustle, even if they don’t say it outright\n\n[NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some killer career tips on nailing interviews and staying on top of the grind",
          "score": 1
        }
      ]
    },
    {
      "title": "Costco IT Winter Internship or Low ball SE offer",
      "body": "Hi all, I am expected to graduate next quarter but have a career dilemma on my hands. I am anxious to start work since I tacked on an extra year of school to gain a dual degree in civil and computer science (after realizing I wasn't interested in Civil Eng). My goals are to be within tech and I'm more interested in data analysis, backend work and enjoy interfacing with customers/clients.\n\nI have been a long term intern for an environmental company as a solutions engineer intern and they offered me 75k to start full time in April. I felt this was a lowball offer because I am in a HCOL area. The duties of this job would include requirement gathering, solution analysis, unit testing, troubleshooting in unix/linux servers, using oracle db's and XML for web service calls.\n\nI also have been offered a Software Engineering Internship with Costco for the Winter. Despite its title, the interviewers gave me a disclaimer at the start it would be low code or no code role. This would have about the same duties, requirement gathering, but using PowerApps, Automation Anywhere and Adobe Workfront for software solutions. Seems like an IT role.\n\nIf I take Costco I need to delay my graduation by a quarter to complete my capstone in the Spring and hope they end up offering me a job for the Summer. I also worry that the experience I gain at Costco will be hard to transfer to a different tech role since their IT is notoriously ancient.\n\nMy current company has bad benefits and if Costco offers me a role, I think they might have higher pay and certainly better benefits. If they don't offer me a role, I will be stuck job hunting in this bad (but recovering) market where I only have internship experience. I really cannot decide what to do here. \n\nAny input would be helpful and I would also love to hear your experience if you worked at Costco IT in the past. Thanks!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1h8fur8/costco_it_winter_internship_or_low_ball_se_offer/",
      "comments": [
        {
          "body": "I worked at Costco before starting my dev career, they have some teams that are a bit better, but in reality the tech is really ancient. The mantra act broke stay rich relates pretty strongly to Costco, if they wanted you it'd be low code or no code and you're not happy with that take a better offer. If you want the title software development intern and no other options are available, take Costco up. Delaying graduation sucks, but if this internship opens more doors, take it man.",
          "score": 1
        },
        {
          "body": "People are suckers for brands. Applies when job hunting too.  If you can spin your role with more code bs it would be great. Also market is shit and delayed graduation is not that bad of an idea.",
          "score": 1
        }
      ]
    },
    {
      "title": "[Vent/Whinge Warning] I'm completely tapped. I have no idea what I'm gonna do.",
      "body": "As with a lot of mental issues I didn't realize I had, I've managed to stay functional and keep this bottled up for a long time. It's totally okay to make fun of me for being so whiny.\n\n**TL;DR: I'm a loser. I graduated a year ago, my portfolio and resume are apparently shit, and I'm running out of time. What are my options?**\n\n*EDIT: As recommended, I have included an [anonymized resume](https://i.imgur.com/rz9NR3q.png). I had fun roasting myself with it, so if nothing else comes of this, at least I got that.*\n\nIt drives me up the wall to see so many stories about people getting a job two weeks before they graduate and casually asking if 80k is enough for a junior dev. Then I feel like an a-hole for being jealous. Am I the only ugly person at this prom or what?\n\nI'm a dude in his early 30s who grew up poor, and I've had consequently had modest expectations out of life. \n\nAfter military service, earning a liberal arts degree, and a series of dead-end gigs and failed ventures, I got a crummy office job that paid far less than a high school graduate makes as a Costco cashier. In my late 20s. And I was fine with that. Then a massive upheaval in my personal life found me going from living in a 3-bedroom house to sleeping on my best friend's couch. I decided I needed to make a big change and I enrolled in a post-bacc CS program.\n\nI'm no Turing, so I had to struggle to finish. It's a miracle I ended up with a 3.5 GPA. Internships seemed out of the question to me, and I couldn't settle on any sort of personal project to pad my GitHub. (Only at the very end did I realize I probably have moderate-to-severe inattentive ADHD when a friend lent me Adderall and I performed and felt like a completely different person. That supply is dwindling.)\n\nEven though I live in a tech area (Portland, Oregon), I'm getting absolutely no bites from big companies, medium ones, or start-ups. I've even responded to janky ads on CraigsList. I have not had so much as a phone call in reply. These are all jobs that I felt reasonably confident I was qualified for. I'm not even talking about the jobs that want you to be an entry-level dev with proficiency in every web app technology under the sun. My CS program barely touched web dev and didn't mention DevOps ever -- and that's where all the jobs are. I'm willing to learn *anything*, and I would bust my ass away from the office to make myself an asset if someone would give me the opportunity, but what incentive do they have to gamble on me when the market is saturated with people who already have exactly what they want?\n\nThe run-around I'm getting now looks so much like the one I was on when job hunting with my less practically valuable degree, I actually applied to be a dishwasher somewhere. And got the same result.\n\nI tried getting something going on a freelancer site. I wrote a webscraper from scratch, with command line options and rotating proxies -- for roughly sixty dollars USD. It felt like I was turning tricks under a bridge. I told myself it was to build a reputation as a reliable freelancer, but that was a waste of time. There were so few jobs I had the skills to complete on my own for the ridiculous budget the employers offer (e.g. \"make me a brand new cryptocurrency for $5000\", \"write my multi-threaded chat server for networking class. $30. i need this simple task done in 18 hours\"). There's no competing with the people from central Asia and eastern Europe working for five dollars an hour. I can't make beer money, much less a living, that way.\n\nI'm completely fucking tapped.\n\nToday, I realized I didn't have enough money in my savings to pay my credit card bill for the month. I had to borrow money from the friend who hasn't complained once about me eating her food and stinking up her living room all this time. I've been dreaming about making her student loans vanish as soon as I got started. I don't even care about myself that much, but it feels like I've let her down in a big way. \n\nI've finally crossed a line. I'm ashamed to say I've been seriously considering learning black hat shit or even doing felony-level stuff not even related to CS. The only thing stopping me is my quixotic and naive attachment to integrity and honor; once I go that route, there's no coming back. \n\nI don't want to work at Google. I don't require a dog-friendly workplace with wacky ball-chairs and video game consoles and an endless supply of vegan snacks. I have never fantasized about being a tech billionaire. \n\nI just wanted to get a job using my brain for the first time in my life. And after busting my ass to get the sheepskin, I've got nothing to show for it but a ton of debt and no way to make good on it.\n\nI would say I'm at the end of my rope, but there is no rope. I'm in freefall.\n\nWhat the hell do I do now?",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/bxs29r/ventwhinge_warning_im_completely_tapped_i_have_no/",
      "comments": [
        {
          "body": "The people who get jobs before they graduate have been looking actively for 8 months beforehand. You don't just drop into a job.",
          "score": 4
        },
        {
          "body": "You should probably post your redacted resume on here so people can give feedback on it.\n\n&gt; I'm willing to learn anything, and I would bust my ass away from the office to make myself an asset if someone would give me the opportunity\n\nYou need to demonstrate that with projects or related technical experience. If you are willing to learn anything, learn what the most in demand skills are in your area and with a good resume listing those skills, hopefully you can get more responses and opportunities for interviews.",
          "score": 1
        },
        {
          "body": "I feel that there's a few key stats we're missing here. How many applications have you sent out? Are you only applying to jobs in Portland? Have you spoken to recruiters? I see you've mentioned having friends in the industry, have you reached out to them?",
          "score": 1
        },
        {
          "body": "resume:\n\nI suggest way more effort since this is the first thing someone learns about you. My personal fav is [awesome CV](https://www.sharelatex.com/templates/cv-or-resume/awesome-cv). I also do not see a github or linkedin link. \n\nskills are ok you wrote a tutorial on ajax but don't list it? \n\nprojects: should be bullet points and be easier to find what tech you used.",
          "score": 1
        }
      ]
    },
    {
      "title": "Need advice from those who've left CS",
      "body": "I'm a 27yr old currently working as a firmware engineer on Long Island NY. I loved it in school and graduated with a near perfect GPA, but after hitting industry I learned to absolutely hate it. I'm about 4 years into it and I'm looking for a change. Unfortunately as someone who does firmware, my experience is in mostly C and I have little to no web-dev experience. Due in part to my total lack of interest in the field and the unwillingness of my company to let me expand beyond my role, I'm getting extremely rusty. I cannot continue down this path and I'm looking for options. After taking a sabbatical between jobs in 2017 (Australia and NZ for two months) I've been bitten by the travel bug so ideally I'd like to work in something remote or at least work towards that. As someone who craves innovation and new ideas, it's no wonder why I would rather slam my finger in a car door a million times than walk into the office  (accidentally did that last weekend lol... my finger is YUUUGEEE). Fintech has kind of become a low-key interest of mine as I dive deeper into the world of credit cards and award travel (/r/churning/) but I'm not a believer in crypto yet; blockchain, yes, but not crypto. As someone who used to take animation classes as a kid, UX/UI design also seems like a viable option. \n\nI currently almost debt free (never had a student loan and I have just one more car payment left) and I'm an aggressive saver... (about $40k in my portfolio and another $45k in savings). I was trying to save up for a downpayment, but at this point I think I need to re-tool and invest in myself.\n\nOne of my biggest issues at the moment is that I have zero energy when I get home to want to write more code and study for something that I've convinced myself that I hate to the point where I've turned down interview requests from Amazon, Google, and Tesla multiple times. Part of that is I just don't want to get sucked into working for a big company; I've been there, done that already (on job #4 already, including my internship at Texas Instruments, the \"big company\"). I've always had a bit of an entrepreneurial spirit to me; I'm always at Startup Weekend events; used to spend time at maker-spaces until my interest in embedded died completely; and you can almost always find me listening to a Tim Ferris, Mixergy, Lewis Howes, or Chris Guillebaau podcasts/audiobooks. I basically never pay attention to social media, TV/print media, or pop-culture... I couldn't even begin to tell you what Game of Thrones is even about if I'm being honest. I'm just so hyper-focused right now on getting out of this rut that I'm basically in fight-or-flight mode if I'm not on vacation (went to Austin this past weekend so I was able to be a little more \"in the moment.\").\n\nJust to clarify ahead of time, yes I do suffer from depression and have tried a number of different treatment options (talk-therapy, medication, and TMS therapy). The TMS was by-far the most successful, but didn't get me totally there. I started seeing a new social worker a little over a month ago, she's very unorthodox, but I'm making huge strides with her. I also also started using CBD oil which I'm mostly taking to supplement my epilepsy medication; not a druggie and never even smoked weed, but it's FDA cleared for epilepsy so worth a shot). My epilepsy is literally the only thing keeping me at my job at the moment. Without health insurance to cover the meds I'm basically down shit's creek at $2000+/month for the stuff after manufacturer's and GoodRx coupons. \n\nFor the time-being I'd like to stay in/around NY as my boyfriend lives in Brooklyn and is finishing up school.\n\nWith all that said, I'm thinking of a few options. I think at the end of the day I want to be an entrepreneur, but I need to expose my mind to new ideas and I can't do that by doing the same thing every day.\n\n* Try my hardest to learn something on my own time and peruse a career in that while I stay where I am. I don't think I'll be very successful at this because the last thing I want to do after spending all day coding is coding more, at least in this current frame of mind.  \n\n* Leave the job and learn on my own while working at Costco, Starbucks, Home Depot, or similar to maintain health insurance.\n\n* Work at Costco while attending a coding bootcamp to re-tool myself in webdev, UI/UX, data, etc.\n\n* Leave SWE all together and maybe go into IT. But I'm not sure what options exist that allow me to work remote and what other qualifications I'd need. If it's anything like what the IT department does at my current job, I can't imagine remote work ever happening; too much hardware to maintain. I imagine I'd also need to get more qualifications and go back to school for this, so I may still need that Costco job in the meantime. I tend to be very skilled at things like this, I've got basically zero fear of disassembling a laptop/phone and replacing parts, did it last night; finding my way around technology has always come natural to me even before school which is part of why I went into CE in the first place, so maybe IT is an option. \n\n* Go back to school and get my MBA (either at Costco or in my current role); since I ultimately want to be an entrepreneur, I figure this could be a way to go. I realize that a lot of MBA programs are total BS and mostly for networking purposes, but I don't see how an established company is going to let me into the business side of things without one. I feel super trapped in the CS/CE side of things. I'm so sick of people telling me that I can do anything with a STEM/Engineering degree; when I ask them \"oh yeah, like what?\" nothing comes to mind.\n\n* I got my real estate license before starting this current job. I was about to go full-throttle into it when I was nabbed by a recruiter for this current job. I figured I'd give embedded one last go so I did. I figured it'd take me at least 90-days for a house to close before making any money in RE. I was trying to at least do RE part-time but it never happened. So I could explore going back to it.\n\n* Try to find something where my current skills might be useful that doesn't require me to code. I recently got interviewed for a position as a \"Technical Account Manager\" which seemed interesting. Not what I'd want to do for the rest of my life, but definitely different and allows me to detox from SWE while opening my mind to new ideas. So I'm thinking about more positions like that. Business analyst or consultant also seem like possible options, but with everything seemingly geared towards web, ML and AI these days, I don't see very many opportunities in embedded for this.\n\nApologies for the rant, but I'm trying to get everything out there on paper/screen before I ask for alternative/additional options. Given everything I've mentioned above, does anybody else have any suggestions or advice for me? Thanks. Feel free to ask questions below and/or PM me.\n\n*Edited for typos",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/buh8h9/need_advice_from_those_whove_left_cs/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "I think we (and/or you) need to understand why you hate coding now when you loved it in school. Maybe it's not really coding and some other part of the job? Or maybe it's something specific to low level coding that is making it unenjoyable for you?",
          "score": 1
        },
        {
          "body": "Yes , I am here , I am here to help anyone looking forward to get in UI/ JS/ MEAN Stack. I will mentor only in morning and evening and in weekends , Due to doing full time job as a MEAN Stack Developer",
          "score": 0
        },
        {
          "body": "I think you should work on your gratitude and humility.",
          "score": 0
        }
      ]
    },
    {
      "title": "feel awful about quitting after just working there for 5 days. these are the reasons I left. am I just too weak willed for working?",
      "body": "",
      "subreddit": "jobs",
      "score": 1568,
      "url": "https://reddit.com/r/jobs/comments/1kvkq27/feel_awful_about_quitting_after_just_working/",
      "comments": [
        {
          "body": "Are you in prison? The military? \"permission to use bathroom\", \"force to do 10 pushups\"? I think hearing anyone says \"If you are on time you are late. Now give me 10 pushups\" is when anyone should walkout. That's so degrading.\n\nEdit: Missed in your comment that it is phone sales. No, just no. This place sucks big time and was treating you like you weren't even a person.",
          "score": 844
        },
        {
          "body": "OP, this job sounds horrible. One or two of these points would be a deal breaker for me, and you have 16 very valid reasons to quit. Do not lose a wink of sleep over this. You are not weak-willed, this is abuse.",
          "score": 1444
        },
        {
          "body": "You quit 5 days too late tbh. This job sounds like a hellhole",
          "score": 177
        },
        {
          "body": "This was definitely a job I would go on break and never return to. I would block everyone from the job that had my number and that goes for email as well. I would not look back",
          "score": 216
        },
        {
          "body": "wasn't able to add caption. I just feel really down about not being able to do this job. it's phone sales and I've been unemployed the past 9 months. I was so excited to finally have a job, but I just couldn't take it. \n \nedit: thank you guys for the support. I was feeling very down about it because on top of not having a job again, my pet is having health issues and I might need to have him put to sleep. I unfortunately did not get any of this stuff in writing, it was spoken to me. no I did not do any pushups, they had you do them during the morning meetings. I was on time for those, but thankfully I was able to slip into the group without being noticed. \n \nthis is an at&amp;t kiosk for Costco. outsourced from shart circle. the company I worked for specifically was Resilience enterprises in King of Prussia, PA.",
          "score": 219
        },
        {
          "body": "OK, I’ve read the whole list. I’m ready to quit for you.",
          "score": 59
        },
        {
          "body": "Push ups ? Wtf 💀",
          "score": 98
        }
      ]
    },
    {
      "title": "Is it worth it?",
      "body": "I had a third interview today with a consulting company in atlanta. I have fullstack developer skills. They told me training is supposed to be 14 weeks long for fullstack python development. But the wages they're paying during those weeks are not that great. I'd be making 600 dollars every two weeks according to my potential boss. Then once I pass training, the pay gets even lower. 200 dollars is what I was told I could expect every two weeks until I'm placed with a client as I wouldn't be clocking that many hours. But when I am finally placed and relocated, I was told I'm going to be making 50k. I just dont know how I'm going to make it through with so little money. Especially once I am done with the training. I would attempt to keep my day job but it would conflict with their demands of me being in office every Friday for training. Is this job worth taking? I currently have a job at Costco as a baker and I want to enter the tech field with my degree. ",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/1m0z08i/is_it_worth_it/",
      "comments": [
        {
          "body": "Likely a scam, I remember getting a call from a consulting company based in ATL as well a couple weeks back and sounds similar to your situation and it seemed fishy.",
          "score": 21
        },
        {
          "body": "I’d rather stick with Costco. They’d treat you much better.",
          "score": 18
        },
        {
          "body": "This is horrifically bad for a software engineer",
          "score": 32
        },
        {
          "body": "Sounds like a witch company. Wouldn't do it because placement isn't guaranteed.",
          "score": 18
        },
        {
          "body": "Revature?",
          "score": 4
        },
        {
          "body": "You get paid to do trainings and sit in bench?",
          "score": 2
        }
      ]
    },
    {
      "title": "What are the compensation packages of mid level software engineers in Hawaii?",
      "body": "Based on my Google searching, the answers seem very low for such a high COL state, which is why I am turning to you guys here!\n\n&amp;#x200B;\n\nRecently got a 100k offer from a company in Hawaii for a mid level software engineer, and would like to get a good foundation for my salary negotiation range. I am spending the weekend preparing my negotiation strategies, and having this range would be very helpful.\n\n&amp;#x200B;\n\nIf you guys could give me insight into your compensation packages (salaries, benefits, 401k matching, etc) that would be amazing! Thanks :)\n\n&amp;#x200B;\n\nAlso, thanks in advance for all your replies! I’m out getting drunk in green, so I’ll reply tomorrow :) ",
      "subreddit": "cscareerquestions",
      "score": 31,
      "url": "https://reddit.com/r/cscareerquestions/comments/b1t7a2/what_are_the_compensation_packages_of_mid_level/",
      "comments": [
        {
          "body": "You might just want to spend the research time looking at where you can get apartments, and weight cost and commute times so you can get a feel yourself.  Yes, COL seems mostly insane in Hawaii, so my first guess is 100k will get you by but make it tough to save and build wealth. \n\nI took a quick look at Honolulu for rent places on Zillow and found some nice looking 1bd/studios for ~$1600/mo, that's really not *that* bad on 100k.  I have a friend here in Indianapolis paying just over $1400 on just under 100k. Groceries and such will be more expensive as well, but it certainly sounds doable.  It will probably feel more like making 50-60k in the midwest, which is low for a mid-level engineer, though.  But... Hawaii! \n\nex.  https://www.zillow.com/homes/for_rent/_type/2086186979_zpid/25641-410256_price/100-1600_mp/21.402653,-157.764101,21.21602,-157.926493_rect/12_zm/\n\nHowever, don't forget relocation.  I imagine it will be cheaper to ship in or buy some Ikea-grade stuff than try to relocate you existing furnishings, and it may not be worth shipping your car.  It's a big commitment.  \n\nAnd don't forget traveling to see family.  Flying back for Christmas and Thanksgiving or whatever will be cost prohibitive.  Once a year is probably going to be all you'd muster at most. ",
          "score": 36
        },
        {
          "body": "The reason why a lot of tech talent hasn't relocated to Hi is because the comp can't match the COL. \n\nIt's basically only able to give Portland wages for SF COL.\n\nAnd if people love sunny days and surfing there is always South Bay + California coast",
          "score": 21
        },
        {
          "body": "Oooo a question I can answer! I lived in Kihei, Maui, HI for about 7 months I moved for a position out of the Nashville area.  My salary was 85k starting out and then moved to 93K after a promotion to lead. ( so kind of low ).  \n\n\nIt was a DoD contracting company the EoD process ( low level clearance ) took almost a year! So I would caution quitting your job early if it is for a government contracting position. Try to say I would love to accept pending my EoD or clearance completion. If I had not done that I would have been in a pretty bad way.  \n\n\nSo our secretary actually pretended to be my sister so that we could snag a decent deal on an apartment at least in that area a lot of people do not like renting to someone who is new to the island as a lot of people come and go. The big reason I left was due to a lack of competition in Maui. They moved to make Maui a metro area and there were some more shake ups in the defense industry there so I decided Nashville would be better. Ultimately I regretted leaving too soon and would have liked to live out there another year; but, the company did bring in a pretty terrible manager who was \"friends with the CEO's wife\" so eventually things went south in a hurry for the team I was on anyways.  \n\n\nSo here is my practical advice from experience:  \nIf moving your car call Matson get an estimate, you may have to drive to Long Beach, CA I drove across country in a Prius it rocked.\n\nHave money to buy a scooter while your car is being delivered or rent a car prepare for 3 weeks with no vehicle\n\nMail important things via flat rate USPS pack extremely well the boat ride is rough on packages a lot of ours were busted\n\nCheck for comparable businesses in case this position doesn't work and definitely have money to leave\n\nWhen trying to get an apartment you may just want to change your cell number to look local\n\nMoving expenses to Hawaii for me were around 8-10k but I tried to not bring a lot ( company paid )\n\nMoving expenses back to a house I owned were 5-6k ( company mostly paid )\n\nGive yourself loads of time like 24-48 hours buffer and do not underestimate the time for mailing things out AND DO NOT USE THE BOXES THAT LOOK LIKE FLAT RATE BUT ARE NOT! That crap cost me like $600 =|\n\nBe prepared to buy some random specific things like a thin blanket ( hot nights ) and a warm blanket ( cold nights ) also our apartment didn't have curtains at first which was weird but common in Maui\n\nDitch your sound system as most people have their windows open all the time and will get mad at you\n\nBringing animals into Hawaii is hard they have a whole quarantine process and it takes a really long time start immediately if you are bringing pets\n\n  \nSo here is my advice from a fun experience:  \nFind out where sea turtles like to hang out and snorkel there if safe\n\nCheck out SUP boarding and whale migratory stuff\n\nTry to ditch video games I played too much Destiny and regret it\n\n&amp;#x200B;\n\nWhat monthly budget looked like for me:  \nI spent less on food personally because I didn't eat out and started eating more rice but food in general especially dairy / cold stuff is more expensive\n\nRent was $1,400 for a 2 bedroom apartment in an ok area but was super competitive to get an opening\n\nElectricity is  higher but I went from a 4 bedroom house to a 2 bedroom so I spent like $150-$200 a month which was nice for me\n\nSpent way less on entertainment because we just did hikes or beaches \n\n&amp;#x200B;\n\nFeel free to message me as I have a ton of little things to that happened that I could maybe help out with I highly recommend doing it though.\n\n&amp;#x200B;\n\nFor fun common Hawaii ( Maui not sure if it translates )stuff:  \nKamaaina term for discount means \"of the land\"\n\nHow's it ( short how's it going )\n\nAloha mostly used in terms of spirit of aloha and only ever said if someone thought I was a tourist\n\nShaka sign is used like a wave if you fd up or gnarly if you did something cool like I was driving my scooter in tropical storm this dude loading a surfboard threw it out at me lol\n\nNo Billboards\n\nPeople take nature seriously\n\nTons of Micro Climates and nature reserves\n\nNo Squirrels but they had mongooses\n\n&amp;#x200B;\n\nTLDR:\n\nMoved to Kihei, Maui it was fun; but, I moved back because not enough company competition. Salary 85K rent was $1,400 but was hard to find a place. Worth it; but, ultimately I would have still moved back due to management change up after like 4 years. It was super fun would definitely do it again.  \n\n\nHere is me hanging out on the road between Kihei to Lahaina watching whales. I'll try get some more pictures word don't do Maui justice lol. Also feel free to AMA.  \n[https://imgur.com/AyYD2wx](https://imgur.com/AyYD2wx)\n\n&amp;#x200B;",
          "score": 15
        },
        {
          "body": "No idea, but jeez I would love to work in Hawaii!",
          "score": 30
        },
        {
          "body": "Gosh, I would work in Hawaii for a pat on the back.",
          "score": 13
        }
      ]
    },
    {
      "title": "Torn between Sandia National Lab and Costco internship. How's a DBA career like?",
      "body": "Throwaway because my main has my name on it\n\nLong story short, I received a Software Engineering R&amp;D accepted offer from Sandia National Laboratories back in January and I recently interviewed with Costco and received an offer for Database administration internship, even after the interview, I'm still not exactly sure what a DBA actually does, would I be doing any development as a DBA? I'm really torn between these two.\n\nBackground: I'm in my senior year graduating in about 1 quarter. I want to go into a Software Development path in the future.\n\n**Costco: DBA Intern**\n\nPros:\n\n\\-Good benefit\n\n\\-Located in Seattle (Where I live, and to stay in)\n\n\\-Fortune 500\n\n\\-Good work life balance\n\nCons:\n\n\\- Have to Renege Sandia NL if I want to take this offer\n\n\\-Heard Costco is not a great place for CS?\n\n\\-Not sure if database administrator is what I actually want, is DBA transferrable to SWE?\n\n**Sandia National Labs: Software Engineering R&amp;D Intern**\n\nPros:\n\n\\-Stuff they do seems really interesting\n\n\\-National Lab, possibly government job in the future?\n\n\\-I'll be working on database too, which is what I am interested in.\n\nCons:\n\n\\-Located in New Mexico, I might not actually want to move there for a full time job\n\n&amp;#x200B;\n\nThank you for your help!",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/ncojbl/torn_between_sandia_national_lab_and_costco/",
      "comments": [
        {
          "body": "Take Sandia, this is a no brainer\n\nYou do NOT want to take the DBA position if you want to be a software developer",
          "score": 44
        },
        {
          "body": "If you want to go into software development, pick the internship that makes you do software engineering.",
          "score": 18
        },
        {
          "body": "[deleted]",
          "score": 10
        },
        {
          "body": "I strongly recommend Sandia, even though it’s in NM (ugh), because if you do well there you’ll eventually be able to get some level of US security clearance. That’ll open up job opportunities that you otherwise wouldn’t be considered for later in your career. Plus, retail? BOOOORING! 😀",
          "score": 18
        },
        {
          "body": "+1 to Sandia.\n\nEven if you don't want to do defense related work it's a software engineering position, and definitely a better choice than the Costco one (unless you want to work at Costco, which is a pretty good gig).",
          "score": 7
        },
        {
          "body": "Sandia 1000%. DMs open.",
          "score": 6
        },
        {
          "body": "Sandia is awesome and so is New Mexico. Really interesting projects and there is lots of opportunity in other departments if you don’t like where you land initially. Also, New Mexico is very affordable and the outdoors are beautiful.",
          "score": 5
        },
        {
          "body": "DBA? Lol what is this 1999?",
          "score": 3
        }
      ]
    },
    {
      "title": "Short on cash, long unemployed, should I take a job at a company that has no funding?",
      "body": "So after struggling to get an entry level job for *years* since graduating college, this fullstack opportunity has fallen in my lap.  The catch is there's no salary for *at least* a month, only equity in a company that TBH I have little faith in atm, about to try to enter an industry that's dead from covid rn.  They offered me a job with no interview, after two phonecalls, which seemed like a red flag.\n\nI don't trust the CTO at all.  He talks a lot and doesn't inspire much faith in his ability.  I haven't even seen a working product of any kind.  They're trying to secure funding from local investors, and have nothing atm.  It seems like I would immediately be one of the senior devs in this company, which is a huge red flag to me...\n\nBut with all this said, finding any other kind of entry level job has been impossible for me.  I'm about to leave for an interview with Costco (for a cashier).  Should I take this shady startup job?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/k0dyml/short_on_cash_long_unemployed_should_i_take_a_job/",
      "comments": [
        {
          "body": "Honestly, everyone will tell you not to, but you should just go for it. Work this job AND take a night shift at a grocery store or something to pay the bills. Tell the start up you can only work X amount of hours per week, and get them to write up a contract where they agree to pay you backpay for the months without pay.\n\nAll you’re aiming for is experience on your resume. Take the job, take it seriously, continue job hunting as if you don’t have the job.",
          "score": 2
        },
        {
          "body": "No. While you’re working at this place, you may miss out on a legit opportunity.",
          "score": 1
        },
        {
          "body": "I think the bigger question is why it’s taken years to find entry level job?",
          "score": 1
        }
      ]
    },
    {
      "title": "Got rehired by Costco after quitting years ago due to health issues now they found out I’m on the “do not rehire” list. Can they do this?",
      "body": "Hey everyone,\nSo back in 2021, I had to quit my job at Costco because of some serious health issues. It wasn’t like I got fired or anything  I left on my own because I couldn’t keep up with the physical demands at the time.\n\nFast forward to 2025, my health has gotten a lot better, and I recently applied to Costco again. I actually got through the interview and orientation process, and everything seemed fine… until they realized I had worked there before.\n\nApparently, I’m on some kind of “do not rehire” list, and now they’re saying they can’t move forward with my employment.\n\nI’m kind of shocked because I left on good terms and explained it was due to medical reasons. I didn’t expect to be blacklisted over something I had no control over.\n\nCan they actually do this? Has anyone dealt with something similar at Costco or another company? I feel like this is unfair considering the reason I left.",
      "subreddit": "jobs",
      "score": 8518,
      "url": "https://reddit.com/r/jobs/comments/1onmli6/got_rehired_by_costco_after_quitting_years_ago/",
      "comments": [
        {
          "body": "You mean you were never asked if you had worked for the company before, on an application or anything?",
          "score": 1641
        },
        {
          "body": "Something similar happened to a friend of mine but it was for Walmart, he had gone through the whole process and in the offer stage is when they realized that he was on the do not rehire list so they let him know - at that point he explained why he had to leave the first time and they ended up looking into the matter for him and because it was a health issue they simply took him off of the list and ended up hiring him anyway.",
          "score": 477
        },
        {
          "body": "1: how did you get on the no hire list? Did you not put in a two week notice?\n\n2: You're in probation. They can fire you because they don't like the color of your shoelaces.",
          "score": 448
        }
      ]
    },
    {
      "title": "Interview at Costco tomorrow; any tips?",
      "body": "",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1nh8nes/interview_at_costco_tomorrow_any_tips/",
      "comments": []
    },
    {
      "title": "I have an interview at Costco tomorrow.",
      "body": "I have my first interview at Costco tomorrow, just wanting to know what to expect. I have 11 years customer service experience. TIA!",
      "subreddit": "jobs",
      "score": 32,
      "url": "https://reddit.com/r/jobs/comments/8qt1dz/i_have_an_interview_at_costco_tomorrow/",
      "comments": [
        {
          "body": "Costco is often criticized by analysts for treating its workers too well.\n\nMazel tov.",
          "score": 22
        },
        {
          "body": "Congrats. Dress for success! Questions can be anything so be prepared. Glassdoor might have some questions from past experiences. ",
          "score": 13
        },
        {
          "body": "Congrats for getting an interview!! It sounds like with your many years experience you’ll have lots to draw upon when answering questions so use that to your advantage and pick your best examples when answering questions. Look up Glassdoor ratings as they may have some interview questions that are commonly asked.\n\nIf you haven’t done so already, read up as much as you can about the company. How long have they been in business, what are they known for, do they have any current schemes that would draw in customers? Show you’ve done your homework and that you’re passionate about the role. \n\nBest of luck! ",
          "score": 6
        },
        {
          "body": "I was asked why I didn’t move up when I had been at a job for six years. It was because I was part time while I was going to school.",
          "score": 3
        },
        {
          "body": "Costco is one of the best companies to work at. They treat their employees very well. Even if you're a warehouse worker, they treat you well. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Any jobs that hire almost instantly and decent pay?",
      "body": "Hi, \n\nI've just lost my job, and I may need to find a new one quickly if I can't secure the job I want. \n\nAre there any jobs that offer almost instant hiring (or a few days to a few weeks) with decent pay, around $20/hour? Something that I can do, preferably around 30 hours a week, would be ideal while looking for a long-term job.  \nI have a master's degree; it may not be useful at all for this kind of job, but who knows.   \nI was thinking about Uber or Amazon; any insights on those would be appreciated, or any other options. Thanks!!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1qfxl3t/any_jobs_that_hire_almost_instantly_and_decent_pay/",
      "comments": [
        {
          "body": "Whatever you do, don’t respond to a text message offering a too good to be true hiring process and pay. You might be vulnerable at this point.",
          "score": 7
        },
        {
          "body": "Ups loading trucks? They used to hire just about anyone with a pulse they could pass a drug test. Overnight,  no phone,  and lots of cardboard",
          "score": 5
        },
        {
          "body": "Sawmills, OSB, Veneer, MDF….basically if you have any bigger lumber manufacturing they usually start out pretty good pay at entry level.  At least here in Canada.",
          "score": 2
        },
        {
          "body": "support staff (food runner/busser) in a restaurant. depends on the place but tips can be good. i’ve made 35-40/hr as a food runner with no restaurant experience in a hcol area.",
          "score": 2
        },
        {
          "body": "Contract roles at tech companies are way faster than uber/amazon and hit that $20+ range easily. Customer success, tech support, content moderation - they're always hiring and desperate for people with degrees.\n\nCheck Upwork for short-term stuff too, tons of companies need help with basic admin/research that pays decent. My husband's seen people get hired for contract recruiting coordinator roles within days, especially if you can start immediately.\n\ntbh the gig economy stuff like uber is such a grind for way less money than you'd think after gas/wear on your car. You're probably better off hitting up staffing agencies - they move fast when they have the right match.",
          "score": 2
        },
        {
          "body": "Check out some temp agencies. In my experience, they hire quickly and have a variety of types of jobs and most are temp to hire so you might find something permanent out of it.",
          "score": 2
        },
        {
          "body": "20 an hour isn’t decent pay. I heard Amazon pays 25 an hour but you’re going to work in the warehouse with ex cons",
          "score": 1
        }
      ]
    },
    {
      "title": "Is this MLM",
      "body": "I just had this interview for a sales rep position. You sell big name products/services at Costco. The pay system was kind of weird it sussed me out. There is a base guaranteed pay but If you’re commission exceeds the base pay you only get the commission pay.\n\nNow here is the weird part to me. You can get promoted and be a manager you hire people for you and you also get commission from them. Is this normal for a sales job ? Your goal is basically to get promoted and hire people under you and train them, you control how much commission they get and keep the rest. It’s my first sales job so I don’t know much thanks.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1q24uck/is_this_mlm/",
      "comments": [
        {
          "body": "This is 100% MLM. Avoid.",
          "score": 2
        },
        {
          "body": "1. That's an MLM\n\n2. Nobody likes the Solar/Cell Phone/etc salespeople who bother you when you're just trying to get your oversized groceries.",
          "score": 1
        }
      ]
    },
    {
      "title": "Applied to 72 jobs since 12/8/25",
      "body": "So as the title suggests, I’ve applied to 72 jobs since the 8th. I have roughly 6 years of customer service/retail experience and a good resume (a hiring manager at a library helped me write it up) \n\nI had to take some time away (a year) to take care of family after having a stroke, but then got my CNA license because I thought* I had a passion for caretaking. Working in a facility has taken all my passion away and after less than 3 months, I am burnt out beyond explanation. So much violence, drama, and injuries. Nothing like caretaking one on one, and now I don’t even want to do that. So, I want to go back to retail. \n\nI’ve applied to every grocery store near me (Wholefoods, Costco, Wegmans, Fresh Market, Acme, Giant, Food Lion, Trader Joe‘s, ShopRite, Aldi, etc..) multiple positions, multiple locations. I’ve also applied to random things like liquor stores, museums/gardens, fast casual food, big box stores, craft stores, warehouses, dispensaries, and call centers. Many more too.\n\nOut of all 72 applications, I have gotten 5 interviews. 3 were declined after final round interviews, 2 I’m waiting to hear back from. \n\nI am available 24/7, clean background &amp; drug screening, never been fired or put on PIP, have a neat &amp; clean appearance, decent interview skills, and loads of experience &amp; references. Not even looking for a TL role, just entry level. Preferably FT, but hell I’ll bend backwards for PT atp. Despite the awesome pay, I NEED to get out of healthcare. \n\nI am just so desperate and tired. I really wonder what I’m doing wrong or if it’s just the market? Maybe the time of year also but it has NEVER been this hard for me to get a job… wtf 😭",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1ps2uyz/applied_to_72_jobs_since_12825/",
      "comments": [
        {
          "body": "This job market is AWFUL. It’s definitely not just you.",
          "score": 3
        },
        {
          "body": "Try emailing some places. My target jobs were kitchen jobs tho (idk if it's the same..) and retail. I did 30 applications, got 4 interviews (2 gave me offers and other 2, I just ended up cancelling). The mall here has a list of places hiring and the emails to contact so.",
          "score": 1
        },
        {
          "body": "A lot of retail jobs accept applications all year long even if they’re not actively hiring.  Most of the time if you call, then they will look at your application.",
          "score": 1
        }
      ]
    },
    {
      "title": "HighRange Collective IS A SCAM!",
      "body": "I'm a recent college graduate, and I've been applying constantly to jobs on Handshake, LinkedIn, etc. However, I came across HighRange Collective as a marketing firm hiring for a marketing and sales associate. I applied on Friday and received a call back on Monday with the next steps for an in-person interview. I scheduled my interview for Tuesday morning, but beforehand, I researched the company and curated questions based on what I found. For some strange reason, there wasn't much on the company, but I just assumed that was because it was a new firm. When I got to the interview, it was in rented out executive suite space. Although I don't have the most job experience, this seemed to be a bit odd. When the interviewer finally came out, I realized I would be having my interview with another candidate as well. We were brought into a conference room were asked to introduce ourselves, and then the interviewer would give us an overview of the job. After we both finished with introductions, he told us that this would be a role in which we would be partnering with companies like Apple, At&amp;t and Costco. We would partner with their clients and help market their products. What he failed to mention was that this was an in-person sales position. We would be forced to harass Costco and Sam's Club customers to change service providers. While it was advertised as an office job. Long story short, I wasted 3 days preparing for this dumbass scam. DO NOT, AND I MEAN DO NOT, FALL FOR THIS! You barely get paid, while management takes a huge chunk of money. I genuinely don't understand how \"companies\" like this are legal. ",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1q6rz65/highrange_collective_is_a_scam/",
      "comments": []
    },
    {
      "title": "Costco Interview",
      "body": "Does anyone have advice for a interview at Costco? I have no idea what to expect and I am so nervous because it’s been so long since I’ve had an interview. What kind of questions should I expect? Thanks in advance 😁",
      "subreddit": "interviews",
      "score": 8,
      "url": "https://reddit.com/r/interviews/comments/z5tlez/costco_interview/",
      "comments": [
        {
          "body": "Introduce yourself?",
          "score": 3
        },
        {
          "body": "Find out who will be interviewing you in advance so you can introduce yourself properly. They should lead the conversation from there.\nIf for some reason there is an awkward silence, in a calm/happy/confident manner, simply ask how they'd like to proceed with the conversion. Boom!",
          "score": 1
        },
        {
          "body": "It depends on the type of environment that you will he working in. \nWhy don't you call them up, and be honest about asking them the same question? \nIt will only show you want to make a good impression and are willing to dye your hair to do so. Win-win.",
          "score": 1
        }
      ]
    },
    {
      "title": "I feel like i'll never work again",
      "body": "i lost my job 2 years ago... and I've been unemployed since. My latest rejections include Chick-fil-a and PetSmart.\n\nI have a bachelor's in business administration / project management from what seems like ages ago. I got it, lived overseas a bit, and came home right into covid. so basically I have a 4-5 year gap of work experience in the US. \n\nMy professional experience is actually in my hobby I've been doing for a long time, which is audio engineering related. I have a little over two years or so of that, but like 15+ of hobbyist experience. \n\n  \nI don't even know how many applications I've sent out over the past two years or so. Sometimes it would be 10\\~ a week, sometimes I wouldn't apply for months, sometimes I would apply to like 30 in two days. I've been rejected by places like best buy, costco, etc.\n\nI don't own a car, I'm semi-reliant on my meds for ADHD and my life with ASD. My previous job was amazing for me - WFH, my own time, but I worked hard on all the projects. I made decent money too at around $32/hr. The company went under and let go of many, and to date is hardly a company anymore unfortunately (I mean... media business and etc can be tricky like that). \n\nI just feel like I won't ever work again, I can't seem to get hired. I unironically can't even work at fast food because I can't seem to get an interview. I just don't get it \n\nEdit: I almost forgot I made this post. Thanks for the comments and some resources, I appreciate it :”) ",
      "subreddit": "jobs",
      "score": 171,
      "url": "https://reddit.com/r/jobs/comments/1kwew6s/i_feel_like_ill_never_work_again/",
      "comments": [
        {
          "body": "maybe consider a skills-based resume as opposed to a chronological?  you can then promote subsections such as customer service, administration, and it won't look out of place, and you won't have as much attention towards career gaps  \n  \nThere's instructions here,  but I'd also put qualifications at the end, and if you think it's a problem, remove the degree  [https://employmentguide.com.au/Resume/how-to-write-a-resume-functional-skills-resume.html](https://employmentguide.com.au/Resume/how-to-write-a-resume-functional-skills-resume.html)",
          "score": 76
        },
        {
          "body": "Have you considered starting your own audio engineering business? You possess a skill that is niche and not commonly held by the general public.",
          "score": 34
        },
        {
          "body": "Someone else mentioned removing your degree from your resume for entry level positions and I agree with that. The perception of being overqualified adds the perception that you will still be actively seeking better employment after getting hired (which you should be doing). Because virtually anybody can be trained to do the job, someone without a degree would be less risky + can probably be paid less. \n\nIt sucks but the business is going to look after the best interest of itself and nobody else.",
          "score": 11
        },
        {
          "body": "You have a degree, don’t be applying to fast food places. Are you tailoring your resume to each job and following up? Do you even know what kind of job you want or are you just throwing your resume around to random places?",
          "score": 8
        },
        {
          "body": "Hello, have you considered working for the county or city government? I'm not sure what your salary expectations are but that is surely a route to suggest? The degree you hold could put you In a better spot financially.",
          "score": 8
        }
      ]
    },
    {
      "title": "Jobs are bullshit",
      "body": "I’ve applied to Costco,aunhauser busch, reyes company , and other things . It turns out the beer company’s are all one entity. After the interview for beer merch retailer they haven’t contacted me at all , so I applied to Reyes warehouse job. I got the same phone number Job recruiter text. That kinda embarrassing, cuz now they’ll be like “ are you really interested in the retail position “. The ups application makes you jump through so many hoops for them not to contact me either after 2 weeks .my optimism is at its lowest . ",
      "subreddit": "jobs",
      "score": 92,
      "url": "https://reddit.com/r/jobs/comments/1nkomx4/jobs_are_bullshit/",
      "comments": [
        {
          "body": "Grandpa used to work at Schlitz.  They’d get an hourly “beer break”.    If you like beer the Busch could be a good opportunity.",
          "score": 11
        },
        {
          "body": "Job market is crap right now. What comes down must go up. Keep on applying, take care of your physical and mental health, and stay positive",
          "score": 8
        },
        {
          "body": "Reyes is an enormous holding company that owns a ton of distributorships and distibutors do a lot including merchandising. It’s not retail like you’re thinking, but it’s low on their totem pole. Still a good company to work for though.",
          "score": 3
        },
        {
          "body": "Reyes is fucking terrible, they work you to death. Don’t bother",
          "score": 3
        },
        {
          "body": "Life is bullshit, you liv3vto work, then die",
          "score": 2
        },
        {
          "body": "Post office will take anyone with two arms and a pulse",
          "score": 2
        },
        {
          "body": "UPS hires Seasonal workers this time of year.  Amazon is also hiring in advance of Peak.",
          "score": 1
        }
      ]
    },
    {
      "title": "Recruiter callback 14 months after applying",
      "body": "I’m naming names here, even though it’s a company I support.\n\nAnd it’s a long post. \n\nI applied for a Dealer Support Manager position at Costco in their Auto Program arena in early November of 2024. Followed up several times for \\~ 6 months, both via email and LinkedIn messages to their hiring team with zero response (left on “read”). I took the common advice we always see and simply moved on to other applications, assuming it was a silent rejection. No harm, no foul. \n\nThis morning I receive a call from one of their recruiters asking for a good time to interview. I was slightly irritated, but remembered that I’m still on the job hunt, so I agreed and asked for clarification about the role, duties and pay (which was not in the original advert). It’s $20/hr to \\*sell and train\\* dealerships on a platform almost none of them use, and it’s a field SALES role - not a SUPPORT role. \n\nIt would be my car, my gas, and only a partial reimbursement for insurance costs. \n\nI’ve represented 2 different lenders in my region for about 10 years, and for about 125 dealerships (not all are active relationships), and averaged about $80k per year, which is pretty standard for where I am on the west coast. I would actually be losing money if I took this role, but the recruiter’s response was “we have no room in the budget for negotiations”. \n\nAt some point this shit has to stop. The vast majority of jobseekers are simply looking for a role they can adequately perform at a place that treats them like an actual human being, and for a salary they can use to live at least somewhat comfortably. \n\n\\*STOP THE MADNESS\\*…please. And apologies for the rant, I know I’m by far not alone in this, but nothing changes if we keep our mouths shut. ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1qcyoij/recruiter_callback_14_months_after_applying/",
      "comments": [
        {
          "body": "the reason is they are just so desperate especially in your area that they are trying everything. When I was in Dealerships as F&amp;I  we said throw enough crap against the wall and maybe something will stick. They were hoping that you and all the other applicants they have ever had with any type of experience might just be so desperate or maybe even someone might want to try and piggybacking this on with their current job.",
          "score": 2
        }
      ]
    },
    {
      "title": "Got an interview but the commute is long",
      "body": "Im tryin to get out of my current job goodwill as its to a point that being there really kills my mood and I got an interview for costco but the bus ride is an hour and 20 min since rn I dont have a car is it worth the commute? Ive heard good things about working for costco ",
      "subreddit": "jobs",
      "score": 8,
      "url": "https://reddit.com/r/jobs/comments/1npmwsq/got_an_interview_but_the_commute_is_long/",
      "comments": [
        {
          "body": "It doesn't hurt to go to the interview and sometimes a long bus ride can be calming. I recommend going to the interview just to see how it is. You may really enjoy it!",
          "score": 6
        },
        {
          "body": "Costco pays good",
          "score": 2
        },
        {
          "body": "Is it 1 hr 20 mins total or all together?\nEdit: I mean there and back",
          "score": 1
        },
        {
          "body": "That’s pretty far away",
          "score": 1
        },
        {
          "body": "Ive had many supervisors that commute an hour to work in their cars and stuff too",
          "score": 1
        },
        {
          "body": "That's pretty far away but it can't hurt to do the interview, as long as you don't mind the long commute (I personally just throw in earbuds and watch Netflix so it's not too bad) and you leave extra early to avoid any bus problems, then go for it",
          "score": 1
        },
        {
          "body": "Thanks everyone who has replied I will do the interview and hopefully land the job cause im just not happy with where I am now so thanks for all your advice",
          "score": 1
        }
      ]
    },
    {
      "title": "Having Doubts about this Sales Rep Job",
      "body": "Recently I got a job for being a Sales Rep, selling AT&amp;T stuff. I've been applying for what feels like hundreds of applications and got accepted to this one. It's not AT&amp;T themselves, but a separate company, they're basically the guys you see at a Costco or Target kiosk trying to sell you phones or plans. Had a phone, then Zoom and finally in-person interview where we went to a store location and he asked me questions while showing me a little bit of what they do. I just wanted a job so I could make some cash I so took it.\n\n  \nHere's where I started feeling some suspicion or doubts. For one, in the office you are required to wear business professional (suit and tie) for the first 2 hours before you wear a polo for when in the actual stores. They have meetings everyday and it's super high energy, they're saying a bunch of slogans, talking about sales tips and what they need to do, like stereotypical hustler sales energy. Genuinely feels like the Wolf of Wallstreet vibes, doesn't help that some of the guys literally had hundred dollar bills tucked into their jacket pockets. \n\n  \nAnother weird thing is that during orientation, the guy was talking about how to grow in the company you gotta get good sales, and eventually get promoted, hire more people, and eventually get your own team and keep growing. Literally the first concern he assumed we had was if it was a pyramid scheme, which he \"disproved\".\n\n  \nPay also feels weird. Basically, you need to make enough sales for the week. You're technically paid minimum wage (16.50), and say you work 40 hours. You need to make more sales than the minimum wage pay (around $680) each week. If you make enough sales for $1000, you made $1000 for the week. However, if you don't hit that $680 sales goal by the end of the week, you have you make it up next week. If you made only $500, next week you gotta make that $180 on top of $680. \n\n  \nI just feel weird now. Is this not worth the time, or am I overreacting?",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1oraeyb/having_doubts_about_this_sales_rep_job/",
      "comments": [
        {
          "body": "Having a commission threshold that is your base salary isn't uncommon in sales",
          "score": 2
        },
        {
          "body": "r/devilcorp \n\nRun",
          "score": 2
        },
        {
          "body": "Congrats, welcome to your first sales job. \n\nSome people love it. Some people hate it. Not all sales jobs are like what you describe, but this 100% checks out for low end telecom sales. \n\nMe personally, fuck all that shit.",
          "score": 1
        },
        {
          "body": "It’s an MLM. This is NOT a typical sales job. Get out immediately.",
          "score": 1
        }
      ]
    },
    {
      "title": "how do i make sure i won't just be a seasonal again?",
      "body": "i'm 19, my second year of college. around this time last year i got my first ever real job (i worked through a government youth employment program before) at a costco. i know jobs and employment aren't meant to be fun or enjoyable, but i genuinely loved working there. a wide open space, a lot of friendly or just neutral customers, coworkers i generally got along well with, and praise from coworkers and higher ups.\n\nonly problem? i was a seasonal. two months later, first week of january my term ends and they let me go. through the entire time they said out of \\~20 people who'd be hired for seasonal, about 4-5 would make it onto costco for good. the day they let me go i asked when and how i would know i'd be coming back, they first said give it until february... then march... then april... then may...\n\nby march i needed a job so i put pressure on one that was walking distance to where i lived and on paper would pay decently; mcdonald's. huge contrast in the 'quality' of customers i handled, i was getting 50 cents more hourly than i did at costco but i only ended up with 13 hours a week. that and working there took a mental toll on me so 4-5 months later i left.\n\ni have an interview for the costco i was working at last year in two days, if i get hired my biggest worry is staying on; how can i make it clear to my higher-ups that i'd really like to stay on? how can i guarantee that?\n\nmy mainly unsuccessful side hustle business aside i've been unemployed these last few months and i'm desperate to starting earning, not being able to earn has made me feel less every day",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1on1hg1/how_do_i_make_sure_i_wont_just_be_a_seasonal_again/",
      "comments": []
    },
    {
      "title": "Rejected after four interviews spanning one month",
      "body": "I'm devastated. I thought this was the one. My experience was a complete match to what they were looking for on the JD and the interviews all went great. Today, I woke up to the dreaded email that they are moving forward with other candidates.\n\nI don't know what to do anymore. It has been a year of sesrching for jobs. My unemployment has run out, my savings have run out, and I can't get a job whether it's in my field (software support, which is being killed by AI and offshoring anyway) or at Costco or a bartending job.\n\nI feel sick. I feel tired. I feel sad.",
      "subreddit": "jobs",
      "score": 9,
      "url": "https://reddit.com/r/jobs/comments/1o1btzu/rejected_after_four_interviews_spanning_one_month/",
      "comments": [
        {
          "body": "We should all be in a support group for each other",
          "score": 2
        },
        {
          "body": "Did you ask the interviewer for feedback",
          "score": 1
        },
        {
          "body": "I had 6 interviews over 1.5 months for a remote role and was told I was their only real candidate.. ended with ”decided to go with someone local who can work with the team more closely” only positive feedback. Felt like a real waste of time.",
          "score": 1
        }
      ]
    },
    {
      "title": "Should this Job Seeker Consider a Name Change?",
      "body": "Hello all,\n\nI am helping someone close to me in an employment search. Last time this person was out of a job it was the so-called Great Recession and their employer closed its doors.\n\nMy job seeker worked as an on-call contractor until landing a permanent position. However, it took a crazy long time for that to happen — nearly three years and \\~3,000 job applications. Part of that stemmed from the fact that the field this person works in became overrun by H1-b visa workers. Many of the callbacks met a dead end when the “recruiters” found out they were dealing with an American citizen. \n\nThere was also a fair amount of uncertainty because in the end this person also applied to all manner of jobs — i.e. Costco, Walmart, etc. — and never received a single callback to schedule a job interview. (We speculated that he was “over qualified”. Meanwhile, he was accused by family of turning down lesser-paying job offers, which simply wasn’t the case.) In the end, I just chalked it up to being a combination of the fact that *all* his prior employers had either gone out of business or underwent mergers and were impossible to contact, the economy had crashed and the recovery was slow. However, I remember also concluding that many job postings must be “fake” because even on 100% qualified jobs, callbacks requesting interviews were exceedingly rare.\n\nFast forward to 2025 and now I am dealing with a similar situation as described above. In the span of one week, two staffing agencies reported that jobs this individual applied for were not actually open but “on hold”. With nearly two years worth of a job search underway, I am once again asking if a lot of these jobs even reflect genuine openings at all? \n\n*Am I imagining this or do others have the same impression?* \n\nGiven that each application, cover letter and the like is tailored to the job position, to say I have an ethical problem with employers/recruiters just wasting applicants’ time is an understatement. (Perhaps someone who works in HR/talent acquisition can jump in and shed light on the prevalence of just casting a line out there “fishing” for applicants only to cut bait and not actually hire anybody?)\n\nNow that it has gone from feeling like long-ago “bad luck” to a pattern with this job seeker, it also occurs to me that one of the issues is that this individual has an unusual first and last name. The first name is a conventional sounding American name but a European spelling that I have personally never seen in use here in the U.S. Their last name is also extremely uncommon, as it was butchered by Ellis Island many decades ago (names of immigrants in those days were often shortened). Not only is his last name difficult to pronounce but when people ask they always assume it is Jewish (confuses even actual Jewish people).\n\nAwhile back I found another Reddit topic dealing with names hiring managers can’t pronounce. Somebody there had posted a link to an old study showing that unusual names can be a liability for a job seeker. I can only imagine the situation is worse in 2025 given the rise of anti-Semitism.\n\nI may be straying into the weeds on this one but the job seeker is desperate and may be forced to sell their home out from under them if they don’t get an income coming in soon. As a result, I’m thinking about suggesting the nuclear option: A legal name change. \n\nIt goes without saying that automation/AI has made the employment landscape tougher. And there are obstacles my job seeker faces, like working in a professional field with many decades of experience but non-degreed and nearing retirement age. However, I am specifically interested in hearing thoughts on the prevalence of fake job postings and/or whether a legal first and last name change might help this job seekers’ luck.\n\nThank you in advance for replies!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1mxmk8y/should_this_job_seeker_consider_a_name_change/",
      "comments": [
        {
          "body": "Ho-lee rambling meander.\n\nWe know from research that \"John\" statistically gets more calls than \"Jhanda\" with an identical resume. We also know that statistics apply en masse and not in each specific situation.\n\nIf you think your name is hard to use and will cause problems, try using a similar but \"whiter\" one and see if it makes a difference. There is no need to do this at a courthouse.",
          "score": 2
        }
      ]
    },
    {
      "title": "Anyone else here retaliates to an employer who rejected your application or interviews — by never purchasing from them ever again, or by never being a potential client / customer in the future?",
      "body": "Before I finally landed my Biostatistics job in a top hospital (Weill Cornell Medicine), I was unemployed and struggling to get a job for one year. I was rejected from many white collar and blue collar jobs, while simply even considering for entry level or minimum wage jobs because I desperately needed to survive, from: banks (TD Bank, Chase— even simply as bank tellers— even though I have a 3.9 GPA in maths and statistics and have Finance-Accounting certificates!), retail (Nordstrom, Aldi, Trader Joe’s, etc.), healthcare (Small clinics, Health First and other health insurances, because I am a former licensed Medical Assistant.), Insurances (State Farm), Air Travel (Delta, Alaska Air, etc.— Because I even contemplated on just being a flight attendant), etc. Since they  wasted my time through 2-3 interviews or never gave me any updates, and they therefore never gave me a chance to help me get a job to help me during my long unemployment days, I vowed to never ever buy anything from them (I even transferred all my Chase accounts to another bank!)— even after a year later and finally getting a well-paying job. That’s why I purchase products and services from their competitors instead (Whom I haven’t applied to anyway), and personally boycott them throughout my life. Like when some sales agent from State Farm tries to sell me insurance, I will outright tell them that I will never be a client from them, and whenever I receive emails from Chase offering me their Sapphire Credit Cards, I too will decline them. I never fly with Delta nor Alaska anymore, and I now prefer Turkish Airlines (International flights), and American or Southwest/JetBlue for US domestic flights; I never buy from Aldi, TJ, Nordstrom anymore, and just prefer Costco, Amazon, Macy’s now.\nEmployers should know that they just can’t recruit hundreds of thousands of applicants and just reject all of them (Like a ghost job offer) or just at least one of them, and expect them to still purchase from them as clients or customers! \nThey should know that by rejecting an applicant— expect that they will also retaliate by rejecting any sort of trade from them as well, by severing their loyalty to their company or they will never be potential clients or customers in the future.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1jjh42a/anyone_else_here_retaliates_to_an_employer_who/",
      "comments": [
        {
          "body": "Uhh…no. That’s really weird.",
          "score": 5
        },
        {
          "body": "This is insane. Sure be pissed at a company that ghosted you. But to state that if a company simply rejects you as an applicant you shouldn’t be a patron of them is extreme.\n\nSome jobs get thousands of applications there is only one opening. So 99.9% of people are gonna face rejection",
          "score": 2
        },
        {
          "body": "Only if they are unprofessional in their behaviors. If they drag people through a half dozen interviews to ghost them, then Yes I will be moving to a business that conducts itself\nmore professionally. \n\nUsing and publishing my test assignment(s), illegal onboarding to marketing lists without consent, abuse of references, and mishandling of data including third parties is also a permanent ban.",
          "score": 1
        },
        {
          "body": "That's pretty weird. But whatever floats your boat.",
          "score": 1
        }
      ]
    },
    {
      "title": "Just sharing my progress.",
      "body": "And to also give space to anyone else who wants to vent. I know it's tough out there. It's only been 4.5 weeks for me. My heart breaks for all of you who have been looking for months, maybe even 1-2+ years. I'm thinking of applying to the nearby Costco just to be safe. \n\nIdk why, maybe I need some catharsis but I feel like sharing my progress. All of these jobs are \"EA to CEO\". I have like 5-6 years of experience being an EA to CEO's/C-suite individuals for companies of all sizes. \n\n- Job #1: Made it to 2nd Zoom interview but didn't get an offer and was told 2 business days after the last interview. I did really want this one because it was the first job possibility I got after being laid off and it was mostly remote. However, I'm grateful that the recruiter told me fairly quickly that a different candidate got selected. Also, I got \"impossible-to-please\" vibes from the CEO so part of me feels I may have dodged a bullet.\n\n- Job #2: Made it to 2nd interview (phone call w/ current EA). But I found out the job was not quite what I was expecting. I said I was still interested, but I got ghosted after the 2nd interview. I was a little peeved that I didn't get an email or text saying they're not moving forward with me, but since the job isn't what I expected, it was easier for me to shrug off the ghosting.\n\n- Job #3: Made it to 2nd interview (in person with the HR lady and CEO). CEO was great and this is the one I really wanted. CEO told me it'd take like 1-2 weeks for a final decision. I emailed the HR lady 1 week after the 2nd interview for any updates or info. This was a few business days ago. No response. Technically, that 1-2 week window will be over by this Friday, so I'll give it until then. But it feels like ghosting to me.\n\n- Job #4: Recruiter reached out to me on LinkedIn. This one is actually not EA to CEO but it's remote so I was interested. Recruiter chose a time for an initial phone call. Never called. I messaged back to try to reschedule. Ghosted. Idk why, but this one made me especially angry. I wanted to go off on her. But I also don't want her to screenshot my message and then put ME on blast on social media or something. So I think I'm just going to delete my message thread with her.\n\nI was very optimistic when I had my interviews for job #3, but since it feels like I'm getting ghosted, the depression's been hitting me hard. I do have a new round of initial interviews today and tomorrow, so I'll see how they go. But whether you've been job hunting for just 1 month or 10 months or even more, it's fucking brutal. I also won't belabor all of you with my gripes about capitalism and the entire concept of \"work\". We all know it and we're all feeling it. If you want vent here or post about your job hunt escapades for some catharsis, please do. You're not alone. &lt;3",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1jq115c/just_sharing_my_progress/",
      "comments": []
    },
    {
      "title": "My job search rewind",
      "body": "After ~7 months of job searching, I finally got a great comms job paying $120K at a biotech/pharma research company in Texas, fully on-site. Had 3 rounds of interviews -- starting with a screening call, then talking to the VP of Operations, then a VP, director, and the COO back to back. \n\nA very roughly estimated accounting of the statistics of my job search with a recent master's from a top 20 school and looking for marketing/adjacent jobs, wonder what numbers you guys are at:\n\n- 5,000-6,000+ applications total \n- 20-40 stupid ass assessments/'games' completed for no reason at all\n- About 15-25 interviews given throughout, 5-7 Round IIs, one round III\n- 300-400+ cold DMs on LinkedIn/cold emails sent. About 1-2% response rate, response was never helpful\n- 100s of cringe LinkedIn posts from others humblebragging about their jobs/offers read while cursing under breath\n- 7-8 different job boards tried, from BuiltIn to Lensa to FoundIt to whatever the fuck, and the usual LinkedIn and Indeed. Nothing. Fucking. Worked.\n- Dozens upon dozens of worthless pyramid scheme/sell phone plans in costco 'jobs' blowing up my fucking phone and making me have to research them every time to see if it was a scam or not\n- ∞ times contemplated how fucked this whole system was\n- 7 months wasted not letting myself do anything else since I was permafucked to hell if I didn't get a job, for many reasons\n- 1 offer\n\nGod, what a horrible time.\n\nEach of those thousands of applications and rejects took away chunks of my soul I'll never get back. Does anyone else feel like the job market is 1000X more cooked than the rosy job reports we keep hearing about? How the fuck are people getting jobs these days?! ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1it5vvw/my_job_search_rewind/",
      "comments": [
        {
          "body": "This has been my experience as well! 10 months, 6K+ applications, 30+ interviews. It's a nightmare out there!",
          "score": 1
        },
        {
          "body": "I suppose it depends on the job field. I could literally get a job tomorrow as a CDL A driver anywhere and get paid about the same or more. I do feel for you though.",
          "score": 1
        }
      ]
    },
    {
      "title": "COSTCO INTERVIEW",
      "body": "I was just notified that I’m moving forward to the next stage for the Costco Travel Reservation Agent position, and I’m trying to get a better idea of what to expect. If anyone has recently gone through the process (or currently works in the role), I’d love to hear:\n\t•\tWhat the phone interview with the recruiter was like—was it more behavioral or job-history focused?\n\t•\tCommon questions they asked\n\t•\tWhat the in-person interview consists of (if applicable)\n\t•\tHow long the hiring process took from interview to offer\n\t•\tWhat the training/orientation is like and if it’s fast-paced or hands-on\n\t•\tAny tips you wish you knew ahead of time\n\nI’m very interested in this position and just want to make sure I’m prepared and have realistic expectations about schedule, training, and overall work environment.\n\nThank you in advance to anyone who’s willing to share their experience!",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1oguxb7/costco_interview/",
      "comments": []
    },
    {
      "title": "Costco Interview",
      "body": "Hi everyone,\n\nI just had my first interview with Costco today and I thought it went pretty well.  I was nervous but thought I handled it well.  I do have retail experience.  They told me that they had more interviews today and tomorrow. They also told me that they would start giving call backs on Monday and if I didn't hear from them by Wednesday to give them a call. I just checked my email and saw that I got an email from them saying that I have not been selected for hire, my question is, is it normal for them to reject you that soon after an interview? Not even 5 hours after. I'm genuinely asking and not looking for rude remarks. I do appreciate any advice and feedback. Thank you.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1c22o6v/costco_interview/",
      "comments": []
    },
    {
      "title": "Costco Interview",
      "body": " Any questions that I will be getting? Interview to Costco.",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/108y0mk/costco_interview/",
      "comments": []
    },
    {
      "title": "New college grads beware!",
      "body": "Please be cautious of any entry level marketing/brand ambassador roles. If you apply and get a call within an hour or same day, ask what the exact duties are, not generalizations. This is prime season for direct marketing MLM schemes to target fresh graduates. The following are places to stay away from:\n\nNewbern excel\nFresh success marketing group/ultra success\nImmense gratitude\nNe excel\nResolute marketing \nScorpion enterprises\nCampbell marketing solutions\nMotus solutions\nNew eagle solutions\nImpulsum inc\nSunfire solutions\nImpact events\nMillennium events\nFuture innovations\nRocksteady promotions\nLumos marketing group\nMarie’s consulting\nWestway promotions\nAlphalete marketing\nDauntless marketing group\n\nThere are more out there but these are the ones I know. They are subsidiaries of Smart Circle (or Devil Corp) and will pitch you an internship or full time job (the same thing for them) and it will be nothing like what they pitch. \n\nThese companies either do door to door sales or sell products inside sams club or Costco. They will not tell you this, and if you ask or push on more details they will disqualify you or kick you out of their interview.\n\nIf the website is geared more towards the candidate and the ad is more of what they are giving you, it is fake. They will suck you in with manipulation and spit you out post bankruptcy citing you just didn’t put enough into it. \n\nPlease read their negative reviews first, there’s always going to be bad reviews but see where they’re coming from. Are they really a few disgruntled employees or are they all saying the same thing?",
      "subreddit": "jobs",
      "score": 77,
      "url": "https://reddit.com/r/jobs/comments/um2cj4/new_college_grads_beware/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "&gt; Newbern excel Fresh success marketing group/ultra success Immense gratitude Ne excel Resolute marketing Scorpion enterprises Campbell marketing solutions Motus solutions New eagle solutions Impulsum inc Sunfire solutions Impact events Millennium events Future innovations Rocksteady promotions Lumos marketing group Marie’s consulting Westway promotions Alphalete marketing Dauntless marketing group\n\nThat's a lot of scammers. Thank you for posting this.",
          "score": 12
        },
        {
          "body": "That happened a lot to me when I graduated. It was all the same; you'd interview with owner, they would tell you that you would start entry level ans you could move up, and profit. I think I went on three or four of those interviews before I smartened up.",
          "score": 9
        },
        {
          "body": "Oh God I fell for the initial interview and spent a hot summer day schlepping stupid coupons to bored admin assistants. But I’m amazed how they can recruit so many people to come back for day two.",
          "score": 3
        },
        {
          "body": "Add Impulsum Inc. in Raleigh, North Carolina to that list. I recently worked there and it is the same thing. The owner was under Richard OP",
          "score": 3
        },
        {
          "body": "Just an update but there's two companies (Legacy Executives and Scorpion Enterprises) that came from Newbern Excel here in the Bay Area (East Bay part to be exact)\n\nI had in person interviews scheduled with both and ended up declining because honestly it seemed fishy and after further research I was proven correct. (Their social media's were absolutely messy for a company let alone one focused on marketing, both companies had reused the same photos on social, there was Newbern Excel related tagged photos. Office space looked way too rundown for a \"successful multi million dollar company\")",
          "score": 3
        }
      ]
    },
    {
      "title": "Unfulfilled, seeking job advice",
      "body": "TL;DR:\n27, stuck in a stable remote job making $32/hr but totally unfulfilled. Lifelong dream is creative work (film, photography, games). Lived in LA chasing it, learned stock analysis too. Now just trying to find a way back to something that actually feels meaningful.\n\n-\n\nEver since I was a kid, my dream jobs were always in filmmaking, video game production, or anything visually creative. That passion has stayed with me my whole life—I’m now 27, and I still absolutely love video games and movies. Over the years, I’ve consistently dabbled in both photography and videography on the side. It’s always been something that excites and fulfills me creatively.\n\n-\n\nMy first job was at a movie theater in high school, where I worked for about five years. After that, I briefly worked a seasonal job at Costco right after graduating. It paid more, but I hated it. I then moved on to Starbucks, where I stayed for about a year. One day, while shopping for AirPods and an iPhone at the Apple Store, I had a great conversation with an employee. We bonded over our shared love of technology—another big passion of mine—and he encouraged me to apply.\n\n-\n\nA few weeks later, I built a résumé and walked into the store in person to ask for a manager. I didn’t realize that nobody really does that anymore and that everything is usually handled online. But the manager respected the initiative and told me there was a group interview happening in 30 minutes—so I stayed. A few weeks later, I got the job.\n\n-\n\nI started off doing a little bit of everything at Apple, but I eventually found my place at the Genius Bar. I worked hard, moved up quickly, and became a bit of a leader there. After three years, I was offered the chance to help open a new Apple Store in LA. I saw it as a sign—an opportunity to both grow professionally and chase my dreams in a city full of creative potential.\n\n-\n\nWhile I was in LA, I doubled down on photography and began trying to transition that into filmmaking, hoping to build an audience on social media and work my way up from there. I also started studying the stock market and technical analysis during my time there. I fell in love with it—the charts, the strategy, the logic. It became another passion I never expected to find.\n\n-\n\nBut LA is expensive, and the city wore me down. After about two years, I couldn’t keep up financially and had to move back home. Apple had told me I’d have a spot waiting at my original store, but when I returned, that opportunity was gone. I couldn’t stay on a leave of absence forever, so I had to quit.\n\n-\n\nAfter that, I went through a rough patch—fell into a depression and spent the next year applying to hundreds of jobs every week. I rarely heard back. I’m not sure if my résumé was weak or if it was just getting filtered out by automated systems, but nothing stuck. Eventually, I figured Starbucks would take me back—and they did. I stayed there for nearly a year.\n\n-\n\nDuring that time, I met my girlfriend, who worked at a hospital. One thing led to another, and she helped me get a job there. It was a big step up financially—more money than I’d ever made before. About a year in, I transitioned into a fully remote role that pays significantly more than what I started with—currently around $32 an hour, 40 hours a week.\n\nThat brings me to now. I’m incredibly grateful for the stability and income, but I’m also extremely unfulfilled. Working remote isn’t what it’s cracked up to be. I have no coworkers, no collaboration, no stimulation. The work is repetitive—mostly data review, scheduling patients, and getting more and more tasks thrown at me. I don’t care about the work at all. I’ve been doing this for about six months, and it’s slowly driving me crazy.\n\n-\n\nI know I’m lucky to be in the financial position I’m in. But I desperately need something that excites me again—something creative or technical that I can actually be passionate about. I’m trying to figure out what that next step looks like.\n\n-\n\nI would love some advice from people here that read this and see the skills that I’ve accumulated and could recommend what to do, where to apply, or what I need. Thank you.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1k06vft/unfulfilled_seeking_job_advice/",
      "comments": []
    },
    {
      "title": "Just Need to Vent",
      "body": "I'm near the end of my rope, and of my savings. I got laid off in October and have been submitting 3-5 applications a day, sometimes more. I got one interview since then, and just got rejected today after the second round. It would have been a great place to work with great pay, too. They liked me as a person, other candidates were just more qualified.\n\nI do tech/software support, but it seems like hiring teams want you to have intimate experience with their proprietary software instead of a basic understanding that they can train on. I've been on LinkedIn and Welcome to the Jungle (Otta). Now, I'm applying for anything and everything. I even applied to cut meat at Costco and pour beers at a nearby brewery.\n\nMy fiance is talking about using her annual bonus (if she gets it, her company is stingy) to cover my share of the bills to give us more runway, and potentially selling the house. Unemployment is a fraction of what I need.\n\nI feel like a failure. I've been working since I was 15. I'm 30 now, and while there have been bumps along the way, I've never had long stints like this or felt desperation. I wasn't foolish with my money, either, I had five months worth of expenses saved up (wouldxhave been more if I wasn't laid off), thinking surely that would be enough. I've always been kind of lucky, but I guess my luck has run out.\n\nAnyway, I'd love some words of encouragement or advice. Thanks.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1iy71l3/just_need_to_vent/",
      "comments": [
        {
          "body": "I’m started CS this year (and I know what’s going on in tech and the hiring and stuff) so I still believe that things will get better. I reckon just apply anyway even if they list a ridiculous amount of stuff. The thing is that they need to hire someone, and if they just want to hire a mythical programmer that can do everything well that’s just not realistic so they have to get over that. Would you ever think of doing an internship (one that pays) that will give you more tech skills? I’m really sorry this is happening.also all my advice might be moot as I’m only entering the field but I’m just chatting ideas. I’m sorry you are feeling like this. Honestly recruiters are kinda freaks for the moment. I think people are getting sick of job hunting because useless robots only look at applications.",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm losing hope.",
      "body": "Hi guys. I'm losing hope in being able to find a job. Every job I have had has been retail or customer service oriented, and recently, I've applied to HUNDREDS of places. I've only have maybe 5 or 6 interviews. I worked for Target seasonally back during the holidays, and now I cannot find a job anywhere. I have been out of full time work since September of 2016 and I'm out of resources to keep my bills paid. I'm afraid that I'm going to lose my apartment, my car, or even worse, my relationship. My family seems to think that I'm not trying or that I'm being lazy but in reality I'm applying to dozens of places EVERY DAY and I either never hear back OR I interview and am not selected for hire. I had an interview with Costco on Monday and received an email yesterday saying that I have not been selected for hire. I had an interview with Starbucks and they said they're waiting on deciding which location to put me at (this was a month ago. I have called several times and no one will return my calls). I interviewed with a local credit union and was not selected for hire. \n\n\nI'm losing hope. I don't know what's wrong with me or what's making employers not want to hire me. I have excellent customer service skills and I consider myself a social butterfly (lame, I know) but I have absolutely no idea why anyone will hire me. \n\n\nMy appearance is mostly professional, I wear a collared shirt and solid black shoes. I don't own any dress pants whatsoever, I literally cannot afford them. \n\n\nI'm just not sure what I can do anymore. I'm on the verge of a mental breakdown because of this. I just want to work. \n\n\nIf anyone has any advice or ANYTHING, please help me. I am so beyond desperate. Thanks for listening to me ramble. ",
      "subreddit": "jobs",
      "score": 79,
      "url": "https://reddit.com/r/jobs/comments/5x9y05/im_losing_hope/",
      "comments": [
        {
          "body": "What's your pant size? I can send you a pair. PM me :)",
          "score": 72
        },
        {
          "body": "Have you looked into temp agencies and applying through them? The name can be misleading - they often have a bank of jobs that either aren't temporary or they're temp-to-hire meaning you start out as a temp and if you do well, they hire you on. \n\nLook at craigslist too if you haven't yet. I applied to something off there the other day and am going for an interview today after they called last night (I didn't have to submit a resume or anything, just my interest and contact info). \n \nAlso, go to goodwill and see if you can find some dress pants on the cheap. Not making a good first impression, even if it's only a clothing choice, can really affect your odds.",
          "score": 11
        },
        {
          "body": "I recommend picking up a serving job while you search for something more viable.  I'm currently in the service industry and absolutely miserable, but it pays the bills while I look for more traditional office jobs.  If you don't want to deal with the Applebees/TGIFridays crowd, I'd recommend at least trying to be a server assistant at a fine dining place if you have a reputable one in your area.  The pay is usually enough to keep you from being homeless.  \n\nHonestly, I am losing hope of ever finding a job with benefits/upward mobility.  The thought of being stuck in the service industry past 30 (I'm 29) and still scraping by (student loans are a bitch) is incredibly bleak and sometimes I can barely stand it.   Good luck.  ",
          "score": 6
        },
        {
          "body": "In a similar situation as you. Keep trying and I hope it works out for you!",
          "score": 3
        }
      ]
    },
    {
      "title": "How can I prepare for a Part-Time Product Demonstrator interview at Costco?",
      "body": "Hi everyone,  \nI have an upcoming interview for a part-time Product Demonstrator position at Costco. I’d love some advice from anyone who has been through this interview or worked in this role.\n\nWhat kind of questions should I expect?  \nWhat skills or experiences should I highlight?  \nAny tips on how to stand out or what the interviewers are really looking for?\n\nThanks in advance for your help!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1kasfkc/how_can_i_prepare_for_a_parttime_product/",
      "comments": [
        {
          "body": "They probably are going to ask you to sell a pen to them to demonstrate your salesmanship.\n\nYou typically start by asking the person across from you (the customer), if they need a pen. If they do, ask what they‘ve bought in the past and then you go over how this pen aligns with their previous experiences and how it can also exceed what they’re looking for all at a reasonable price. If they aren’t looking for a pen, don’t proceed to try and sell to the interviewer They may want to see how you handle no.\n\nThey will likely want to see your people skills. You gotta be comfortable at first intros. The interview will start before you’re in the building; show up on-time (5-10min early).",
          "score": 2
        },
        {
          "body": "My virtual interview was this past week and because it's close to Thanksgiving before my interview I was making cookies so I showed my HR my cookies 🍪😀 and she loved how creative I made the interview even though it was unintentional but I was hired ❤️🍪🤗",
          "score": 1
        }
      ]
    },
    {
      "title": "Any advice for Costco interview?",
      "body": "I have an upcoming interview for React Developer position for experienced developer. I could not find much about Costco interviews online. Does anyone here know anything about what kind of intererview can I expect?\nAny suggestions or advice is helpful.\n\nThanks in advance",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/184s1oa/any_advice_for_costco_interview/",
      "comments": [
        {
          "body": "Any updates here ? \nHow was your interview experience and what kind of questions were asked in interview?",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview at Costco in less than an hour, is this a good question to ask?",
      "body": "My friend who works there got me an interview. She told me that end the end when they ask if you have any questions to ask, “What does the ideal employee look like to you and if I get the job, how can I meet those standards?” \n\nI formatted the question, she just told me to ask something like that. Does it sound dumb? She said she asked something along the lines of that when she interviewed a couple years ago and got the job.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/pxxfse/interview_at_costco_in_less_than_an_hour_is_this/",
      "comments": [
        {
          "body": "That's a good question. But I would say \"what are some characteristics of a strong/successful employee\" instead of \"the ideal employee/ look like\"",
          "score": 6
        },
        {
          "body": "i asked a similar question during an interview and at the time where there was no vaccination, i asked what did costco do when the pandemic started ( like for the safety of their employees and such, any protocols etc.)",
          "score": 2
        },
        {
          "body": "I ask a variation of this \"If hired, what would I need to do to make sure you succeed?\"",
          "score": 2
        },
        {
          "body": "I think this is great. I think it is a bit of a mouthful though because it’s a two part question so Id simply to make it conversational. Just ask the first part. Anyway you would know the second part right? Like if they want someone to radiate sunshine then you can smile a lot.",
          "score": 1
        }
      ]
    },
    {
      "title": "I’m 16 and landed a job interview 11 am TWOMARROW for student summer program",
      "body": "I’m a 16 year old high school student with no job experience. I applied 4 days ago and got a call last night inviting me to an interview.\n\nThe department I’m getting interviewed for is I believe the membership desk/customer service?(if anyone could tell me the name of that department exactly that would be great). \n\nIs there anything I should bring with me like a physical copy of my resume? Or My references written down? I am bringing a notepad with my questions on them. \n\nI’ve prepared a good amount but I’ve never been to a job interview before. If anyone could give me tips or advice for two-marrow that would be greatly appreciated. ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1kysmx4/im_16_and_landed_a_job_interview_11_am_twomarrow/",
      "comments": [
        {
          "body": "Tomorrow is not spelled TWOMARROW. Good luck on the interview.",
          "score": 3
        },
        {
          "body": "Sorry forgot to mention it’s at Costco😅",
          "score": 2
        },
        {
          "body": "Congratulations. You write very well and that tells me you’re a good communicator. That’s a strong quality. Take what you can. Don’t panic if you can’t print out your resume. Costco is one of those places where if you get there you can stay for years and make good money and carve a career path. Make the best of the opportunity. Brush your teeth, drink some water and don’t over think it. Let them know your eager to learn and grow with them.  Let us know how it goes. Good job applying and wanting to work! ",
          "score": 2
        },
        {
          "body": "Sorry to be that person, but...tomorrow*",
          "score": 1
        }
      ]
    },
    {
      "title": "Just finished up my interview, need some guidance.",
      "body": "Just finished up my interview at Costco, and I thought it was going very well. They were laughing and smiling and making eye contact with men more than their notes, but then at the end they hit me with that \"were still interviewing several other candidates so we will be calling you to keep you updated\". \n\nI'm really not sure how to interpret that. I NEED a job. I'm so close to being evicted. I'm not sure if that means \"sorry, no\" or he was being honest with me. \n\nShould I follow up in a few days?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/5wqcrp/just_finished_up_my_interview_need_some_guidance/",
      "comments": [
        {
          "body": "That's pretty standard, and it's honestly the truth. It doesn't mean you didn't get the job. I was told the same thing before I got an amazing job. You should contact them the day after the interview with a thank you email to refresh their memory of what a great fit you would be for the roll.",
          "score": 3
        },
        {
          "body": "that's a very standard response. it means they have other people scheduled, and did before you interviewed. you could still be the best. just keep your phone on.",
          "score": 2
        }
      ]
    },
    {
      "title": "Manager and Final rd interview, no behavioral questions?",
      "body": "I went through all steps of the interview process for a company and they did not ask me a single behavioral question. The first call was with the skip manager 45mins then with the HM for 30 mins. Both instances the interview was predominantly asking just about my past experience and explaining what the role is. The questions they asked were not deep. Just stuff like “have you ever been apart or GRC?” Or “what was leading the team like”. Just seems to be revolving about what I did.. the one with the HM was even more casual. After explaining the role, goals, gave the second half of the time to let me talk a bit more about myself and for my questions. Seems suspiciously casual. \n\nIs this more likely to be a good sign? Or a bad one?\n\nCompany is Costco IT. Position Product Manager.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/112j1yn/manager_and_final_rd_interview_no_behavioral/",
      "comments": [
        {
          "body": "I have had this as well in the past.  Honestly I find the behavioral questions the most difficult.  Not sure why but would prefer a technical interview.   I don't think its a good or bad sign.  Maybe they don't really value those types of questions.  Maybe them letting you fill the last half of the interview was a test on how you would respond..  Don't think to much into it.  I hope you hear from them soon.",
          "score": 2
        }
      ]
    },
    {
      "title": "I feel like phone interview is harder than on site interview. Is this normal?",
      "body": "I feel like on site interview, I am able to see nonverbal communications and somehow direct feedbacks from the interviewer helps me to answer questions better. For me, it feels awkward to speak to myself for 5 minutes without any response (direct feedback) at all. I was interviewed by Costco face to face and I felt a connection between the interviewer and me, but not during my phone interview with other companies. It is also to note that Costco asked harder questions too yet I answered them better than the phone interview questions.\n\nIf this is not normal, what suggestions could I use to be better at phone interviews? Thank you very much.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/4i26qk/i_feel_like_phone_interview_is_harder_than_on/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    }
  ]
}