{
  "company": "cvs-health",
  "post_count": 20,
  "exported_at": "2026-01-18T17:44:53.269Z",
  "posts": [
    {
      "title": "Excuse me?",
      "body": "https://preview.redd.it/4lmh3aqurl0f1.png?width=817&amp;format=png&amp;auto=webp&amp;s=196e17fed98ea46a7ae1f9d8db150df07df4f5dc\n\nIs this to rule out people who are poor or to just piss off all of your applicants out of the gate? What a joke. Refunded or not, im not dropping $ to apply for a job.   \n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1klvd2l/excuse_me/",
      "comments": [
        {
          "body": "This is a scam I am pretty sure.",
          "score": 3
        },
        {
          "body": "It's a scam",
          "score": 2
        }
      ]
    },
    {
      "title": "Does anyone have experience interviewing for a software development engineer position with CVS Health?",
      "body": "I have a phone interview scheduled, and I'm unsure what to expect. Google search hasn't turned up valuable results. I'm reviewing some javascript and react/redux questions but not sure what type of question to expect since all the recruiter said is the phone interview would be technical.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/yuq9nf/does_anyone_have_experience_interviewing_for_a/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Has anyone worked at CVS Health",
      "body": "There is a recruiter that has been really strong forward with this position. What I mean by that is even though she had others she was hard selling this one. The pay is a little less than expected but by a fraction and the tech stack looks fairly decent and similar to what I do. \n\nThe interview is only a 30 minute interview and by EOD they say they'll have an answer. She told me it's between me and another candidate. They haven't even interviewed or talked with me, just heard what my recruiter said and from my background. \n\nI'm getting some red flags from this because of how quick the process is and how forward she has been with the position. \n\nHas anybody worked here before? Is there anything I should ask specifically tomorrow during the interview? What should I keep an eye out for? I've never had such a short interview process before. It's a contract to hire position.",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/y8gvop/has_anyone_worked_at_cvs_health/",
      "comments": [
        {
          "body": "Has anyone heard back who applied for the 2025 term for this program?",
          "score": 1
        },
        {
          "body": "Wondering what happened with this? Just applied to a fullstack engineering training program",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm a former big tech sales person - Here's how I usually approach job hunting",
      "body": "Hi everyone!\n\nI've been on the hunt for a while and wanted to share some creative strategies that have really boosted my interview rates. Hopefully, these tips can help you too!\n\n### 1. Using Google Advanced Search\n\nI use Google’s advanced search to find job listings that might not be on the main job boards. Here's a step-by-step guide:\n\n- **Step 1:** Go to Google and enter the following search query:\n  ```\n  \"[job title]\" + site:greenhouse.io/* + \"[country]\"\n  ```\n  Example: `\"Sales Manager\" + site:greenhouse.io/* + \"USA\"`\n  \n- **Step 2:** Add date filters to find the most recent listings by including terms like \"Aug\" + \"2024\":\n  ```\n  \"Sales Manager\" + site:greenhouse.io/* + \"USA\" + \"Aug\" + \"2024\"\n  ```\n\n- **Step 3:** Use variations of this search across other job boards (listed below) to uncover hidden opportunities.\n\nThis method helps me find jobs that others might miss.\n\n### 2. LinkedIn Screening\n\nAfter finding a job listing, I go on LinkedIn to identify the hiring manager or team members. Here’s how:\n\n- **Step 1:** Search for the company and filter by location and department.\n- **Step 2:** Look for recent posts or activities related to the job. Engage with their content by liking or commenting.\n- **Step 3:** Send a connection request with a personalized message:\n  ```\n  Hi [Name],\n\n  I came across your profile while researching [Company]. I noticed your post about [relevant topic] and found it insightful. I'm very interested in the [Position] role at [Company] and would love to connect and learn more about your team. Thanks, [Your Name]\n  ```\n\n### 3. Getting email addresses\n\nI use tools like Hunter.io or Kaspr.io to guess email addresses. Here’s my process:\n\n- **Step 1**: Use the tools to generate possible email formats.\n- **Step 2**: Verify emails using services like NeverBounce if available.\n- **Step 3**: If verification isn’t possible, send anyway with a personalized touch.\n\n### 4. Crafting Personalized Cold Emails\n\nI send out cold emails that are custom-tailored. Here’s a template that usually works for me:\n\n```\nHey [name], I’m [Your Name], a [Job Title] currently at [Company]. I was excited to see your team is hiring for [Position] and wanted to reach out directly. I’ve attached my resume for your review. I’m particularly interested in [specific project or aspect of the position you're vying for], and I believe my experience in [relevant skill/experience] could add value to your team. Here’s a quick overview of my work: [Link to Portfolio/Project] \nIs it okay if I drop my resume to see if I can get it forwarded to the right person via you? I'd love to apply ^^\n\n[Your Name]\n[Your Website/Portfolio/GitHub]\n```\n\n### 5. Engaging Follow-Ups\n\nI follow up with a friendly nudge a week later to keep the conversation going:\n\n```\nHi [name], Hope you’re doing well! Just checking to see if you had a chance to look at my resume. No worries if it’s not the right time or I'm not the right fit. Just let me know with a quick \"Not hiring right now!\" and I won’t bother you again ^^\n\nThanks,\n[Your Name]\n```\n\n### 6. Doing it at Scale\n\nFor each iteration of my resume, I use a specialized resume builder (rezi.ai works well but for for ppl on a budget consider using resumeai.app - it's super effective at rewriting your cv's bullet-points) to help me find the right keywords. This ensures 1/ that I can pass the ATS, and 2/ have my hiring manager resonate with the content of my resume. These small tweaks will for sure lend you more interview calls than when you apply a vanilla version of your resume.\n\n### 7. Networking in niche circles\n\nI also tap into niche communities and forums related to my industry (since I'm in tech it's either Blind or FishBowl).\n\n---\n\n**Job Boards for the Advanced Google Search Hack:**\n\n- Greenhouse\n- Lever\n- SmartRecruiters\n- AngelList\n- Built In\n- WayUp\n- VentureLoop\n- Authentic Jobs\n- AngelList Talent\n- Idealist\n- ArtStation\n- Stack Overflow Jobs\n- Dribbble\n- TechCareers\n- Remote OK\n- We Work Remotely\n- GitHub Jobs\n- Mediabistro\n- Crunchboard\n- Jobcase\n- Local job boards (e.g., Craigslist)\n- State and city-specific job boards (e.g., New York State Job Bank, WorkSource Oregon)\n- Handshake\n- FlexJobs\n- Upwork\n- Hospitality Online\n- HigherEdJobs\n- Salesforce Jobs\n- eFinancialCareers\n- Health eCareers\n\n---\n\nIf you're interested in more detailed templates, I actually have a small library of cold-email templates specifically tailored for job hunting. They’ve been quite effective for me. If there's enough interest, I'd be happy to share more about it! Slide into my DMs if you're interested!\n\nHope these tips help.\ngood luck, everyone!\n\n- Edit: sorry for the poor formatting on the emails!!! I'm a markdown noob, will edit later!\n- Edit2: links/tools are added back!",
      "subreddit": "jobs",
      "score": 246,
      "url": "https://reddit.com/r/jobs/comments/1f7vije/im_a_former_big_tech_sales_person_heres_how_i/",
      "comments": [
        {
          "body": "Adding this to come back and read it later lol.",
          "score": 35
        },
        {
          "body": "Cold emailing and guessing email addresses? I thought we weren’t doing this anymore. Most will see it as spam. Applying for a job also means following directions on how they want you to apply.",
          "score": 27
        },
        {
          "body": "I found on the [csMajor subreddit ](https://www.reddit.com/r/csMajors/comments/1ens0yj/2025_us_internship_job_list/)that google \"JobRight 2025\" could also be useful for us internships. It seems to scrape real-time online internship information from companies' official job hunting pages.",
          "score": 6
        },
        {
          "body": "Great stuff. Thanks for sharing",
          "score": 2
        },
        {
          "body": "&gt;I send out cold emails that are custom-tailored\n\n\n\n&gt;Hey \\[name\\], I’m \\[Your Name\\], a \\[Job Title\\] currently at \\[Company\\].\n\n  \nIf I get a cold email that starts like this I'm going to be immediately thinking \"I don't have a reason for the company to email me, I don't know who this person is, I don't want what they're selling\" and your email gets trashed and you're added to the block list as a spammer.",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "jobs are hard to find and hard to keep",
      "body": "  \ni’ve been looking for a job for some time now. sent many CVs, got some interviews, but no luck yet. some jobs pay too low, some want 100 years of experience \n\nlast job i had was okay but super stressful. manager was always angry and the pay was bad. i left because my mental health was going down…\n\nnow i just want a simple job where people are nice and i can save a bit of money. is that too much to ask?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1nw9qdd/jobs_are_hard_to_find_and_hard_to_keep/",
      "comments": [
        {
          "body": "So it’s hard to keep\nBecause of your self nothing more.",
          "score": 0
        }
      ]
    },
    {
      "title": "Should I just go back to college?",
      "body": "So I'm working as a WHS Specialist at Amazon, and I'm kind of miserable because the hours and physicality of the job is just brutal (I'm up at 5 and am going to rotate to night's soon and am my site POC) . However I simply can't get hired or interviewed for any Healthcare Administration entry level or mid level job, even with a degree and a management background.\n\nI've gone to get my resume evaluated at UCF and EFSC and both say it looks great, and helped me write a few CVs, but I'm just not having luck. \n\nMy passion is in Healthcare and I'm perfectly fine going back to college while working to become a health laboratory scientist or technician as I like lab work. \n\nI'm just not sure if I should just do it, especially since if I finish my prerequisites I'd be able to take the MCAT and apply for medical school, or go into the remaining courses for health lab. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jjum83/should_i_just_go_back_to_college/",
      "comments": []
    },
    {
      "title": "Is this offer a scam?",
      "body": "About a week ago a very frantic call from a staffing agency asking for my resume. I asked if I could send it in 5 minutes when I got home and he said it would be too late by then. I sent him my LinkedIn instead and forgot about it. \n\nFast forward to yesterday he called again and said they would like to interview with me. I ended up interviewing with them and about an hour later he called and said I got the job. The description said that it was to work as a designer for CVS, but the email from the interviewer was from Athena health and the business name in her email signature said something entirely different. \n\nThe staffing guy that initially called me started asking for my information (address, middle name, etc) once he said they wanted me to start, and I asked if I could fill in that information on my own. He got pissed at me that I didn’t say it over the phone and hung up on me. \n\nThe position is a 6 month long contract, meaning that I would get no benefits and I would be out of a job before the end of the year. The positives are that it pays about $4 more an hour than my current position and it would be entirely remote. The onboarding document for this came from the staffing companies website which I thought was a bit odd. For some reason all the workers there seemed desperate. They made the onboarding documents due less than a day later and disregarded the fact that they said I have until Monday to decide.\n\nI really despise my currents job and have been looking for a way out, but is this a scam?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/14c53ff/is_this_offer_a_scam/",
      "comments": [
        {
          "body": "I used to work in the healthcare marketing space. CVS processes its MinuteClinic payments through Athena Health, which is owned by at least two private equity firms. \n\nIt’s also possible that Athena Health gives the staffing firm so much work that it has an account team specifically responsible for that client. \n\nThe idea that they’re rushing you to get a job is unsettling. Double check the email addresses (click on them) to ensure they’re not getting spoofed.",
          "score": 2
        }
      ]
    },
    {
      "title": "I want to quit my job but I feel so guilty",
      "body": "I recently got hired through recommendation as a pharmacy assistant at my local CVS. I had no prior experience in pharmacy so I was very excited to get this job without an interview. However, a few months into this job and I absolutely hate it. From the beginning, I received no training and was basically thrown into the fire while having to learn everything on the go. I am constantly yelled at by the pharmacist and he expects me to know more than I am taught which doesn’t make any sense since he won’t take the time to properly teach me. I understand times are busy right now but from what I’ve heard the pharmacist just has an attitude all the time and has a very short temper in general. I cannot ask questions without getting anxiety as my coworkers act like they cant be bothered or get annoyed when I don’t understand something. I know so many people have lost their jobs from Covid so I feel so guilty for wanting to quit. However I feel this job taking a toll on my mental health and I’m so conflicted if I should just quit or tough it out since I will quit eventually when I start school in January. Staying seems like the logical thing to do but 8 months seems like an eternity when you dread this job as much as I do. I cry before some shifts and feel anxious during my days off as well. On my break sometimes I’ll type up my two weeks notice but can never finish because I feel guilty. I know people have it worse right now and I just started this job. And advice? To tough it out or just dip?",
      "subreddit": "jobs",
      "score": 12,
      "url": "https://reddit.com/r/jobs/comments/g8ya3x/i_want_to_quit_my_job_but_i_feel_so_guilty/",
      "comments": [
        {
          "body": "Have you tried talking to the pharmacist about your situation? If not, go in early and talk about your issues away from coworkers. Explain to them how you want some more training. You could ask coworkers for advice as well. Communication is key in the work environment and it seems like it's lacking. Do whatever you can to learn your role. \n\nThe job outlook is not good so I would strongly suggest trying to talk it out first. I'm sure someone will get on here and tell you to go collect daddy fed couch money but that's temporary and puts you in a group of people who will all be looking for work when this is over.",
          "score": 8
        },
        {
          "body": "If you have some experience in pharmacy, there are better opportunities out there for technicians! You could look into getting certified by PTCB as a first step. Hospitals, insurance companies, and independent pharmacies tend to treat their techs a lot better than big chain pharmacies. I am a certified tech and I'm happy to help or answer any questions you may have.",
          "score": 4
        },
        {
          "body": "Pharmacist here. First I want to apologise for you having to work with a bad one. The system isn't easy. And people always have problems with their prescriptions or insurance. It's a steep learning curve. Been with CVS for 4 years. Whenever we have a new coworker, all the pharmacist here are happy to let them ask and show them as ultimately the more you know, the more you can be effective. \n\nYou just got unfortunate to work with someone who isn't smart enough to understand that and I'm sorry.\n\nA job shouldn't cause you this much anxiety daily. Pharmacy already is a stressful job so I understand. I will say it gets easier as you learn a thing or two each shift. But no shame or guilt in wanting to leave. If you are able to find a new job or will be okay leaving, don't feel guilty. There are great jobs and great coworkers, just have to find a place you can be happy in.\n\nBest of luck.",
          "score": 3
        },
        {
          "body": "Completely my same situation to a tee. I got a job offer yesterday to go somewhere else but the idea of going to my boss of only 3 months and quitting terrifies me. You owe nothing to any job. Whatever your heart says. Just have a back up.",
          "score": 3
        },
        {
          "body": "Bro I'm in the same boat as you and I'm financially stable so I'm quitting my job tomorrow. I honestly can't stand my coworker who constantly withholds information purposely.",
          "score": 1
        },
        {
          "body": "You need to make the decision that’s best for your mental and financial health but please understand the impact on the person that recommended you. It might also change your relationship with them if they went out on a limb for you. Good luck.",
          "score": 1
        },
        {
          "body": "I started a new job just before pandemic hit. Got 2 short weeks in (still in training/orientation) and everyone was sent to work from home. Because I hadn't learned their proprietary systems yet, I was basically furloughed even though I could have picked up and contributed equally from home. Collecting unemployment now and have been getting calls from other applications I submitted. If I get a better offer (pay and benefits weren't exactly great), I'm ducking out. I don't really owe them anything and the department I would be working in is essentially the redheaded stepchild; everyone hates them (not because they're bad people, but because they are dealing with higher priorities and when others need assistance, they're kind of on the back burner). I liked the people, but I'd love for a better opportunity to present itself.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Coming back from a career break and trying to get into HR (UK)",
      "body": "Post uni, I had a couple of admin jobs in local government and higher education but ended up with severe depression. I had 2 years completely out of the work force. I haven't been able to work much since so I then did some voluntary work in the arts with others with mental health problems for 2 years. I realised that wasn't going to really help me employability-wise so for the past almost 3 years I've been a part-time volunteer adviser with my local Citizens Advice Bureau. I'm now at the point where my meds have finally got me stable and I'm itching to get back to full time work. Because of my background in admin mixed with my dealing with employment issues at CAB I'm thinking that HR could be a good focus. Only I'm not even getting an interview. I've applied for dozens of jobs- some basic HR assistant/administrator, some just general admin. Some really basic.  I can't afford to go back to uni, at least not unless I get a decent paid job first and do it part-time. I realise I'm trying to get into a popular field.\n\nI feel I have 2 possible options- what do you think? \n\n1. Get a general admin job for a year (hoping this will be a bit easier to get), or series of temp jobs and study for my level 3 CIPD certificate in the evening online. This'll wipe me out financially as it costs about £1900 and would be a financial gamble. Then hope that I can get an hr administrator/assistant post afterwards.\n2. Try to get some work experience in HR by sending out speculative CVs to local companies that are large enough to need an HR department. Due to benefits regs I can only do 2 days a week maximum but perhaps over 5-10 weeks?\n\nI'm getting my CV and covering letter looked at (I've already cut it down to 1 page- it could apparently be more interesting).  I'm entering into an employability scheme for people with disabilities who offer work placements but I don't know if they can offer me much more than shelf-stacking in a supermarket. If not, I'm happy to arrange my own work placement, if you think it would help. I'm open to any other suggestions you might have.  Thanks in advance.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/cvch5p/coming_back_from_a_career_break_and_trying_to_get/",
      "comments": []
    },
    {
      "title": "Is it wrong/unethical to turn down job after accepting?",
      "body": "I accepted a job at a hospital recently. The pay was not the best (11.55/hr). When I was going in for my health screening I got a call from another hospital. I forgot I signed up for a phone interview. It was a super quick interview the person was like\n\n\"I see you work at CVS, what do you currently make and what would it take for you leave?\"\n\nI kinda lied and said \"I make 11.50 (actually make 10.49) and I would ideally want at least 12.50/hr\"\n\nHis response was quickly \"Oh we can definitely do that. We start our people out at 11.90/hr, and with your experience you should easily be offered about 13/hr.\"\n\nHe started the process and said the pharmacy manager would give me a tour soon and get to know me. I'm honestly really excited, but kinda feel bad because I just went through drug test and HR. I don't start until the 14th though. \n\nWould it be wrong to lead both companies on or would it be the \"right\" thing to do to turn down the 2nd hospital?",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/6q02q3/is_it_wrongunethical_to_turn_down_job_after/",
      "comments": [
        {
          "body": "It's perfectly fine to renege on an offer. Stuff happens, and especially with a job like this they have a million people that they can hire instead so you don't need to feel any guilt about screwing anyone over. Just do what is best for you, and just make sure that you let the other job know once you have made a final, for-sure decision so that they can move on and hire the next person in line.",
          "score": 6
        },
        {
          "body": "No, it's not wrong or unethical to renege on an offer. \n\nIt is unethical however to lie about one's pay. ",
          "score": 4
        },
        {
          "body": "Think about it this way: if you were engaged to be married, and then you realized that you didn't love your fiance(e) anymore, and were actually in love with someone else, would you still get married, or would you break off the engagement?",
          "score": 2
        },
        {
          "body": "Just rescind the job offer, always go for the higher pay.",
          "score": 1
        }
      ]
    },
    {
      "title": "CVS Data Engineer Interview",
      "body": "Hello Folks,\n\nI have a data engineer interview coming up at CVS Health. It has a coding round based on Python and SQL. \n\nWhat should I expect out of it? \nWhat topics of Python and SQL should I prepare? ",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1cerozg/cvs_data_engineer_interview/",
      "comments": [
        {
          "body": "Hi Guys, I have interview scheduled for CVS health associate data engineer. Is there any tips? Recommendations? Maybe anyone can share their experience? Or know which tools to use to prepare",
          "score": 2
        },
        {
          "body": "Here is a good catalog of [Python](https://devinterview.io/questions/web-and-mobile-development/python-interview-questions/) and [SQL](https://devinterview.io/questions/web-and-mobile-development/sql-interview-questions/) questions (and answers) to get a sense of what to expect in an interview",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm getting angry",
      "body": "I need a job. \n\nI have approximately six weeks. After that, it's potential homelessness. My student loan was covering rent. \n\nUni is finished now. That's six years of higher education. Six years with the best qualifications available to me: an A followed by  a 1st class degree classification.\n\nWhat jobs have I done to get by? You know those portaloos you get at music festivals and events? The ones with the harsh chemical that breaks up your shite? I've cleaned them out for minimum wage. You know those industries where displacement ripples down the hierarchy to the folk paid the least, like the guy washing dishes? Yeah, that's been me. \n\nLook, there's a new email in my inbox. Oh, it's a company that I applied for. Wait till I tell you with a relatively high degree of certainty what it will say. 'Thank you for your application, sorry to inform you that you have not been shorlisted for an interview'. It's okay, the application only took hours to complete because CV's and short covering letters are not accepted.\n\nA fucking generic response. \n\n'Why don't you phone up and ask them for individual feedback on your application?' Fuck off, my application isn't the problem. Stop blaming individuals for a systemic problem, the job-market is fucked and this generation are getting fucked over royally.  'Do you want me to look at your CV?' Again, fuck off. My CV is not the problem, and next to no employers even look at it. I'm sick of it. I (like the majority) don't have the intelligence, resources or talent to start my own business. I do however have the work ethic, knowledge and competency to get a job that at least pays above minimum wage and isn't absolutely soul destroying. \n\nAnd do you know where this leads me? I feel like giving up. Source some drugs, find an escape, and then who would people blame? Me of course. I'm lazy, a junkie or whatever the fuck you want to call it. \n\nThe system is rigged against poor people and I'm not even wanting to climb any ladder, just want to be afforded an opportunity to stay afloat. \n\nI should have learned from my grades at school that your hard work and ability are not a reflection of opportunities or lifecourse. I wish I didn't give a fuck and hadn't invested so much time and effort into things which have bore no rewards. \n\nMy mental health is clearly sinking, like so many of the unemployed masses that go unheard and treated like criminals.",
      "subreddit": "jobs",
      "score": 15,
      "url": "https://reddit.com/r/jobs/comments/13i7aq9/im_getting_angry/",
      "comments": [
        {
          "body": "I'm so sorry that you're in this position. Do you have a safety net at home? Family or similar you can lean on? \n\nI relate to this so so so much. I've even been homeless (living out of my truck \"camping\" with a remote job) while having a FT job (US-based btw) at a marketing agency earning $42k/yr. I was able to get to making $100k/yr within about 2 years, but I'm not going to say that's even remotely a guarantee. \n\nWhat is your degree in?",
          "score": 3
        },
        {
          "body": "I’m right there with you. I’ll let you know if I figure it out. Stay sober though.",
          "score": 2
        },
        {
          "body": "Seems like you know your only option is to start a business.. why not start a business cleaning the same type of areas you already cleaned?",
          "score": -1
        },
        {
          "body": "Bro you got a sports degree and are complaining. It’s not a magical thing that gets you free money. Maybe shoulda thought about it for a bit before hand",
          "score": 0
        },
        {
          "body": "What country?  Degree?",
          "score": 1
        }
      ]
    },
    {
      "title": "How to get job as a student?",
      "body": "I posted this earlier on 4chan but got no help so I'll just copypaste my story\n\n&gt;psychology student, in october starting last year of my masters degree program\n\n&gt;also starting psychoanalysis school in october\n\n&gt;as part of training I need to have my own psychotherapy\n\n&gt;3 times a week for 3 years\n\n&gt;very expensive, and my dad won't bankroll me that one\n\n&gt;need to get a job to pay for this\n\n&gt;during a week I have uni and psychotherapy school is one weekend a month\n\n&gt;need a job with elastic work hours\n\n&gt;make a cv\n\n&gt;list all my previous work experience\n\n&gt;sales department, call center, several internships at mental health facilities\n\n&gt;list what I learned in uni and in the jobs\n\n&gt;say that I want to become a psychotherapist and that I'm starting training\n\n&gt;send out CVs\n\n\n&gt;almost no callbacks\n\n&gt;psychology jobs don't want me because I don't have a degree yet I guess\n\n&gt;get an interview from a place for mentally handicapped people tho\n\n&gt;I thought it went well but they didn't hired me\n\n\n&gt;send out CV to ~50 companies\n\n&gt;almost no callbacks, I guess they see that I want to become a psychotherapist and won't stick around with them\n\n&gt;get 1 interview so far, it was today\n\n&gt;selling cofee machines on the weekends\n\n\n&gt;We talk about the therapy school. Can tell she doesn't like how I'll be unavailable for one weekend every month\n&gt;asks me what I know about the company\n\n&gt;it's fucking Nescafe, Nestle subsidary, don't know more than that. Didn't told her that I also know they use slave labour and did a lot of other shady stuff\n\n&gt;Asks why I applied for a job\n\n&gt;Say it's because of money (truth) and I'm not going to sugarcoat it\n\n&gt;asks me to define what is customer service\n\n&gt;tell her it's everything that has to do with customer - handling complaints, talking to them in a shop etc.\n\n&gt;she looks perplexed\n\n&gt;asks me what I think is good customer service\n\n&gt;tell her about how I went to a shop yesterday and I brought my stuff to the counter I asked for a bag. Then the cashier scanned the bag. placed it on the counter and then scanned the rest of products placing them also on the counter and not in the bag\n\n&gt;she was surprised that it was my expectation from a shop\n\n&gt;even though placing stuff in the bag and not next to it would be a good example of good customer service\n\n&gt;asks me to tell something about psychology\n\n&gt;afterwards asks me dumb questions\n\n&gt;tell me your 3 best qualities\n\n&gt;tell me your biggest achievement\n\n&gt;I tell her about how during one of my internships I used a more informal communication style than rest of the personnel with the patients which allowed me to get their trust faster and easier\n\n&gt;after that she says she has no more questions for me and says she'll reach out to me on tuesday\n\n&gt;whole interview was 10 minutes long\n\n\nI guess I need to bullshit them more and pretend I actually care about the job for reasons other than money. I think it's doable and I can modify my CV to fit that more. sooner or later the therapy school is going to come up and they'll know that my plans are different. Also my busy schedule doesn't help much. I don't know what to do. I could get a mcjob but I treat as a last resort. I worked it previously and it was horrible\n\ntldr: I need a job to pay for psychotherapy training but I get no callbacks and if I do I don't get hired anyway",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/15mfttw/how_to_get_job_as_a_student/",
      "comments": []
    },
    {
      "title": "Everything feels hopeless and I don't know what to do",
      "body": "I (23F) graduated almost two years ago with a 1st in History. Before the pandemic, I was working part-time with the intention of taking a gap year to travel before going to graduate school.\n\nLike many others, I found myself out of work when the pandemic hit. Due to that, and losing multiple family members (not Covid-related though), my mental health completely tanked. Since then I've been unable to find work. I've had multiple interviews (most recently a historical research job that they said I interviewed really well for), but nothing has come of them due to my \"lack of experience\" - even though I've done multiple internships and was employed in my part-time job for 4 years.\n\nI don't know what to do. I feel like I've tried everything: networking, signing on with recruitment agencies, written more tailored cover letters and CVs than I can count etc. \n\nI'm just so tired and ashamed.",
      "subreddit": "jobs",
      "score": 22,
      "url": "https://reddit.com/r/jobs/comments/nl065m/everything_feels_hopeless_and_i_dont_know_what_to/",
      "comments": [
        {
          "body": "You’ve just graduated at a shit time unfortunately. It’s going to take you longer to get your career started because the economy sucks right now. \n\nI graduated in 2008 (also a shit time) with a degree in marketing. My first job out of college was working at Trader Joe’s (grocery store) as a cashier. Then I worked in hospitality where I got promoted to a manager position and then after that I was able to leverage my skills into better paying office jobs when the economy started improving. I only started getting good jobs 7-8 years after I graduated. Literally had to fight my way there. It was hard, not gonna lie. \n\nNow I have a lot of experience so this time around when the economy tanked I’m getting interviews more easily simply because I’ve been working for over a decade. \n\nIt’s hard to understand when you’re young, but things happen in cycles. Yes it’s bad now, but good always comes around again and then bad again, so on and so forth until the end of time.",
          "score": 2
        },
        {
          "body": "Ever considered using a staffing/employment agency?\n\nYou may not get a super attractive job, but they’ll help secure some sort of job.",
          "score": 1
        },
        {
          "body": "I understand how you feel. I have a less tailored work experience and just graduated with a degree in theatre. I'm currently enrolled in an English master's program but still don't know what I want to do with my life. I'm a substitute teacher for now and absolutely hate it. I wish I had some wise words or advice, but all I can tell you that you're absolutely not alone in this hellscape. I know it's easier said than done when talking about keeping your head up, but I think a time will come where we will break out of this awful cycle. You're on the right track by reaching out in any capacity. Just don't shut yourself out and internalize everything. I wish the best for you and hope things will fall into place.",
          "score": 0
        },
        {
          "body": "retweet",
          "score": 1
        },
        {
          "body": "Get better at networking as that's how 80-90% of all jobs are filled.",
          "score": 1
        }
      ]
    },
    {
      "title": "Career path advice?",
      "body": "I have an interview with a cable company tomorrow for a position answering their phone line for billing questions. It'll be 2.50 more per hour than what I'm making now, but the commute will be a half hour each way versus my current 5 minute commute. My parents think if I get an offer u should refuse it because that pay increase won't make the commute increase worth it, and also my car is maybe on its last legs right now.\n\nI don't think I'll enjoy this job, but I don't enjoy my current job either. \n\nI've recently started thinking about going back to school to get a certification to be a pharmacy technician, and I currently have a couple of applications out for retail pharmacies like Walgreens and CVS. Since my experience is in retail, I'm Fairly certain I'm qualified to get those positions, but a couple of months ago when I was applying to other retail jobs, I only got a couple callbacks and interviews, so maybe I'm not.\n\nEither way, I'm pretty much determined to go back to school. My options as I see them are: 1) stay in my current job, save up to start school spring 2020, keep applying to pharmacy retailers, or 2) take this other job, save up for school spring 2020, not applying to pharmacy retailers so as to not have an extremely short tenure on my resume. Either option I'm assuming will be equally costly on my mental health.\n\nWhat would you advise me to do?",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/ctmi8i/career_path_advice/",
      "comments": []
    },
    {
      "title": "Can't seem to get an interview",
      "body": "(apologies for the rambling, kinda in a sour mood after yet another rejection).\n\nSo almost a year ago, I started looking for other work when I suffered some trauma at my previous job (not their fault, it just happened whilst I was there). I eventually resigned 4 months back because I couldn't face going back there. In this year, I have had not even gotten to the interview stage.\n\nFor context, I think my weakest thing that they would see on my Resume is that I have only ever had one job. Prior to that job I was a full time carer, and prior to that I was at university. I worked as a teacher of games development for a couple of years in which (because the institution was majorly underfunded) I also acted in an admin capacity + was a course leader. I literally designed a curriculum where there was none before (a new experimental course) and was good enough that my students got their works noticed by triple A companies. As a tutor, I helped students get jobs themselves and even had students I don't teach come to me with their cover letters/cvs because I had built a reputuation for being good at this.\n\nI ended that role on good terms. Although I expressed I couldn't come back for my health, (for context, the stress after the trauma was so much that after an Ofsted inspection I was taken to the emergency room because I coughed up blood) I was told by my employers that I could come back to work for them at any time and that the role was always open.\n\nSo I applied whilst in work and got no results. Applications since I left, same result.\nI am now a father and getting pretty damn desperate for a job. If I apply for some jobs, I am told that I am too overqualified and they won't accept me, and every other job says that I am underqualified. \n\nHas anyone else gone through this?",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/74iy4d/cant_seem_to_get_an_interview/",
      "comments": [
        {
          "body": "Sounds like bad timing... Did you contact your previous employers to see if they have any open positions?  It can be over a quick catch-up over a coffee. Also reach out to recruiters and let them know you're ready to join the workforce again.  Make sure your LinkedIn profile is to update.  Have you applied to jobs via Indeed, Careerbuilder, Ziprecruiter, and LinkedIn Jobs?\n\nI'm currently going through a similar situation where i'm constantly told I'm overqualified at the initial interviews (which i felt comes with a fear of me quitting within a year for a different position).  Upon some reflection, I realized every resume submitted can use some edits to better tailor yourself to the requirements listed, no more, no less.  For interviews, I'm going to try to prep ahead &amp; also say what they want to hear and nothing more.  At least, this is what I am trying now. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Final interview went great, now ghosted and auto-rejected by CVS Health for an sde1 role?",
      "body": "Hey everyone,\nI’m a bit confused and hoping to get some insights from folks who may have been in a similar situation.\n\nI completed my final loop interview with CVS Health about 3 weeks ago. A week after the interview, I reached out to the recruiter, and they mentioned that due to internal team restructuring, they weren’t able to make external offers at that time.\n\nI followed up again another week later, and was told the role is on hold until internal team evaluations are complete. The interviews themselves went really well — no red flags, and I was feeling good about it.\n\nNow, two days after that last recruiter message, I’ve received an automated rejection email saying I’m no longer under consideration, and my application status on the portal reflects the same.\n\nHas anyone experienced something similar with CVS Health? Do they typically send automated rejections after a time threshold, even if the role is on hold? Or is this just their way of rejecting candidates without the recruiter formally reaching out?\n\nWould appreciate any thoughts or experiences — trying to figure out if this is truly the end of the line or if it’s worth following up again. Thanks in advance",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1jvqvmm/final_interview_went_great_now_ghosted_and/",
      "comments": [
        {
          "body": "If you received an email stating you were rejected it most likely is a rejection email. If the position is on hold I am not surprised they rejected you. I have more of a feeling they are gaslighting you stating the position is on hold rather they chose someone instead and than they sent out the rejection letter. I was told CVS recruitment is horrible.",
          "score": 2
        },
        {
          "body": "something similar happened to me. I applied, had my interviews and it's been 3 months now. portal shows \"under consideration\" but the recruiter and coordinator never reply to my emails. absolutely ghosted me",
          "score": 1
        }
      ]
    },
    {
      "title": "Your Resume is a Failure and I Haven’t Even Met You Yet.",
      "body": "Do not abbreviate the year you graduated. “I’ve got a 15 diploma.”  Uh-huh. How’s that different from a 24 diploma?  Try, “David Douglas High School. Graduated 2015. General Education Diploma.”\nDo not abbreviate the programs or systems you have used as I don’t know what those mean. “I held a BHT position for 6 res in an adult ward.”  “I roomed patients PRN all day long.” I’m not sure I really want to know what that means.  You might try, “Behavioral Health Technician for adult foster care facility with 6 residents.” Not only do the abbreviations mystify me, they also make me wonder if you can’t take the time to write something out, where else you will cut corners when you come to work for me.  \nToday, I combed through 34 resumes looking for candidates who might have a job with me on Monday. 11 for Los Angeles, 7 for San Diego, 9 for Phoenix, 4 for Tucson, 3 for Portland.\nFive people said they did not have a resume. Five people got instructions on how to go to the local library and ask the librarian to show them how to construct a resume. It may take an hour, but they will walk out of there with a sheet of paper showing their strengths and job history. I hear a lot from people who have promising careers of professional whiners.  \nSix people sent over an Apple Pages document. I have a Windows PC. I can’t open Apple Pages document and I don’t want to, either, as my company frowns on non-Windows docs. I sent out 6 email requests to cut and paste the resume back to me. Why would you NOT want to get your shining resume into my hands any which way you could? If you are wondering why you are not getting a response to your emails resume and you sent an Apple Pages doc, which just might be why. One man sent an Apple Pages, a Word .doc and a .pdf. Got to be prepared. I bet he has it on a thumb drive in his glovebox.  \nNow, I understand about privacy. Really, I do. I tend to get my fair share of hangups, heavy breathers, strangers knocking on my door, and love letters from assorted Nigerian Princes. I want all of you job hunters to put your city and state on your resume header. Mary Louise had a Washington DC cell number, an Anchorage, Alaska current place of employment and graduated from school in The Philippines. She was looking for work in Tucson, but I never would have known if I had not called her.  \n\tMichael Robert was a highly successful tank operator in the 465th, with assorted medals and awards. His last address was in Germany on a command structure. He had done an internship with a hospital in Louisiana and his cell phone was a Hawaiian number. I had to call him to find out he was 19 miles away from me. “I am responding your Craigslist ad for widget polisher in Daly City, CA.” Excellent.  \nYour resume reads that you want part time work, in daylight hours, in months with no letter “R.”  No. The position I screen for is a flexible shift. That means that the scheduling software can organize two four-hour shifts, a 12-hour shift or two hours for 4 parts. I need people around the clock. 7:00am to 7:00pm most days and more on the weekends.  If you tell me that you can’t work on Sunday because you have church and family obligations, that’s good. Family is big with me. But that just cut you out of the 24 hours straight Sunday to Monday shift. That is some beacoup bucks. If you tell me you can’t work after 3pm because you pick up the kids from school, that’s good. Kids are big with me. Just go get a sitter and come back and work the 5:00pm to 1:00am shift for me.  You’re up until 1:00am watching Jimmie K anyway. Why not make some bucks while you’re awake?  \nDoes your resume who that you are a licensed driver with a vehicle in good condition with insurance? I need you to be a licensed driver and I don’t want to hear the reasons why you don’t have a license. It’s 2016. People start driving when they are 13. If you cannot drive Mrs. Johnson over to see Dr. Tolliver at 11:00am on Tuesday, I’ll find someone who will. No, you won’t take Mrs. Feinbaum on the bus with you over to the CVS to get her prescriptions. Your value to me starts to fall. Mr. Garson got out of St. Joseph’s Hospital this morning and called to get someone to bring him home. If you don’t drive are we supposed to let Mr. Garson stand there on the hospital steps? I don’t think so. On top of that, Mrs. Johnson, Mrs. Feinbaum and Mr. Garson all play canasta on Tuesdays and Thursdays. You better believe they talk about who treats them right.  \nIf you cannot pass a background check, please don’t insist on going through the interview process. Yes, we may be able to see and hear what a wonderful person you are as you stand there in your shirt and tie. Last month I got back the bad news that 16 people did not pass the background check and their fingerprints plainly showed they could not be hired. You can explain all you want until you are blue in the face, but I won’t have you walk in the front door. I’ve got a license and a reputation to protect and I am a watchdog for that one person who might wreck it all. It’s right there in black and white in the ad: must be able to pass a background check. I’m not joking.\nIf you don’t show up to the interview that I screened you for, the water in the Death Valley Desert will freeze before I set you up with another. Either you want the job and will show up, or you don’t. Break a radiator hose on the freeway?  Call me, I’ll reschedule you. Child in the ER?  Call me, I’ll reschedule you. Don’t show up and then 7 days later send in another resume for an interview? No. Send in another resume after that and you are instantly on the blacklist. From this side of the interview table we count ourselves lucky we dodged that bullet now. I get 4 of those every month.  \nMake your resume show that you are eager, ready to hit the ground running, promise to do your best and ready to learn. Stop your resume from telling me that you are in it for the money and will let me wake up in a vacant lot.\n",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/4fr9fo/your_resume_is_a_failure_and_i_havent_even_met/",
      "comments": [
        {
          "body": "As one recruiter to another? [_} The coffee is ready for your next round.\n\nI think you forgot to mention\n\n* the video resume. \n* The letter of reference with no resume. \n* The scanned copy of anything BUT a resume. \n* The email just pleading for a job and telling the recruiter how they suck (I'm sorry - did you apply?)\n* The stalker who calls over and over and over and thinks I don't have caller ID\n* The applicant who's phone service lets me know \"the subscriber has chosen to not accept incoming calls\n* The applicant who gets mad that this position is only $1,000 more a year if they are going to be considered and they won't consider it unless it's $1,500 difference in pay (That's a difference of $0.24 an hour. If the position offers OT you will more than make up for that. Don't insult me for $0.24 an hour.)\n* The repeated follow up emails - or the alternating call one day and email the next - hoping to wear me down because the \"enthusiastic job seeker\" REALLY wants the job\n* The applicants who have every reason for failing a drug test (a poppy seed muffin didn't make you test positive for THC)\n* The ones that announce they have scheduling restrictions after saying 5 times in the process they don't\n\n\n(I can't wait to see how this list grows... Thank you for posting this.)\n",
          "score": 2
        }
      ]
    },
    {
      "title": "INTERVIEW",
      "body": "Anyone having an idea about how CVS Health video screening looks like?\n\nThanks in advance ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n20wkd/interview/",
      "comments": [
        {
          "body": "You'll likely face a mix of pre-recorded questions where you record your responses and possibly a live conversation with a recruiter or hiring manager. Expect behavioral questions about customer service scenarios, handling difficult situations, and why you want to work in healthcare or retail. They often ask about availability, especially for pharmacy and retail positions since those require flexible scheduling. The technical setup is usually straightforward through their applicant portal, but test your camera and microphone beforehand because technical issues can throw you off your game.\n\nThe good news is that CVS tends to focus more on your personality fit and willingness to learn rather than trying to trip you up with complex scenarios. They want to see that you can communicate clearly with customers and handle the fast-paced environment of their stores or corporate offices. Practice talking about specific examples where you've helped people or solved problems, since healthcare and retail are all about service. I'm actually part of the team behind [interviews.chat](http://interviews.chat), which helps people practice these kinds of video interview questions and get real-time feedback on their responses - it's particularly useful for getting comfortable with the format before the real thing.",
          "score": 1
        }
      ]
    },
    {
      "title": "CVS Data Engineer Interview",
      "body": "Hey everyone,\n\nI received an interview call for Data Engineer role at CVS health. I got laid off in September and have been applying since then. \n\nWanted to get as much info as I can about the interview. According to Glassdoor, there's a case study problem during the interview. Anybody who has an idea about what kind of case study they ask or ANY other info will be really appreciated.\n\nThank you and a Merry Christmas!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/18r307v/cvs_data_engineer_interview/",
      "comments": [
        {
          "body": "Hey, how did it go?",
          "score": 1
        }
      ]
    }
  ]
}