{
  "company": "deloitte",
  "post_count": 65,
  "exported_at": "2026-01-18T17:44:53.270Z",
  "posts": [
    {
      "title": "Deloitte virtual interview for isms am",
      "body": "hi guys I recently got a mail from Deloitte. I have 48 hours for this virtual interview for isms am. what type of questions they are going to ask and its going to be pre-recorded questions. if anyone has done before it I need help.\n\nhttps://preview.redd.it/j6r8zm0z6bof1.png?width=1827&amp;format=png&amp;auto=webp&amp;s=95aed98f435a1251c078eb6d748c35eb932d8ab9\n\nIs anyone hired from these types of interviews?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nd8zvp/deloitte_virtual_interview_for_isms_am/",
      "comments": [
        {
          "body": "Deloitte's virtual interviews are usually behavioral questions with a timer. Expect stuff like-tell me about a time you solved a problem or describe a leadership experience.\n\nSince it's pre-recorded and you're probably nervous about it, I'd suggest doing some mock interviews first. I used Final Round AI's mock interview feature when I was prepping for similar role for accenture and it really helped me get comfortable with the format and timing.\n\nGood luck with the 48 hour deadline, that's always stressful.",
          "score": 2
        },
        {
          "body": "For Deloitte's virtual interviews, especially in ISMS AM, expect a mix of behavioral and technical questions. Brush up on the STAR method for the behavioral ones. On the tech side, review ISMS principles and common security challenges. Good luck!",
          "score": 1
        },
        {
          "body": "You'll likely face questions about handling difficult projects, working in teams, managing competing priorities, and your understanding of information security frameworks. Since it's pre-recorded, you'll have limited time to respond to each question, so practice being concise and structured in your answers.\n\nYes, people do get hired from these virtual interviews - Deloitte uses them as a legitimate screening tool, not just a formality. The key is treating it like a real interview even though you're talking to a camera. Practice your responses out loud, ensure good lighting and audio quality, and have specific examples ready that demonstrate your technical skills and leadership potential. Since you're dealing with pre-recorded questions and time pressure, I actually work on [interview helper AI](http://interviews.chat) to navigate exactly these types of tricky interview formats and unexpected questions that come up in virtual assessments.",
          "score": 1
        },
        {
          "body": "The interview is primarily behavioral, so be prepared to share experiences that highlight your problem-solving and leadership abilities. I practiced using the IQB interview question bank to extract relevant prompts, and then did a mock interview with a Beyz interview coach to ensure I had the right timing and delivery.",
          "score": 1
        },
        {
          "body": "I gave the same interview 2 days ago for same post, in my case no video recording was done, i typed all of my answer so it took around 30-40 mins to complete this virtual round, i double checked while typing, my camera was not in use, so i am not sure if i was getting recorded, just want to know if there is any rule to give answer in a limited time or complete test in limited time? Also by when can i expect an update?",
          "score": 1
        },
        {
          "body": "I attended it on Friday night and till now i have not received any update after that.",
          "score": 1
        }
      ]
    },
    {
      "title": "Don’t ever give up",
      "body": "This post goes out to all of you struggling to find a job right now (especially entry level positions). Not too long ago I had nearly lost all hope of landing a job. I was convinced employers had no interest in me because I had no internships or didn’t work with every tech stack known to man. Most employers ghosted and never even gave me the opportunity to do a coding assessment. I had a whopping 1 interview this whole year until recently I was contacted by a recruiter from Deloitte. Shortly after I became very worried when I got put in a zoom breakout room with other candidates that had 3+ internships, 3.99 GPAs, AI research, etc. Well, I ended up getting an offer from them, and I couldn’t be anymore happy right now. If I had to give advice to anyone that’s currently having a rough time finding a job, just don’t stop applying. Stay confident in what you can provide for the company, don’t worry about anyone but yourself, be prepared for the few opportunities you get, and most importantly, show the employer that you truly want the position. Don’t seem like it’s your desperation last resort. I truly am blessed to have received a great offer from such a massive company. I wish everyone the best!",
      "subreddit": "cscareerquestions",
      "score": 566,
      "url": "https://reddit.com/r/cscareerquestions/comments/m448ti/dont_ever_give_up/",
      "comments": [
        {
          "body": "Congratulations man. Thank you for the motivation, it's rough out here. So celebrate that win!",
          "score": 88
        },
        {
          "body": "Congrats! I’m in a similar boat too. For around 2 years I’ve been working in a job that I wasn’t really happy with and I’ve been trying to land my dream job and I cannot tell you how many applications, coding assessments, phone interviews, and final rounds I’ve done and got rejections from. It’s demoralizing but just recently I got an offer after a long interview process! Next week I’m going to give my notice in and I’m so excited. Persistence pays off, really!",
          "score": 36
        },
        {
          "body": "Congratulations! Yes, I’ve been told that employers can smell desperation a mile away. Thanks for the inspiration and congrats again!",
          "score": 37
        },
        {
          "body": "I never got an internship and gave up trying. Finding a job will be even harder. Feels like only the best of the best make it I struggle to do my classwork well let alone projects and internships",
          "score": 19
        },
        {
          "body": "I am still hunting for a SWE job and I am not even a fresh and still finding the market tough for me to get a job, granted I am not from the states.",
          "score": 16
        },
        {
          "body": "Congrats. Getting an entry job pre covid was hard enough, I can’t imagine what it’s been like this past year.",
          "score": 6
        },
        {
          "body": "Congrats! I gave up.",
          "score": 6
        },
        {
          "body": "Congrats bro! As a cs major, I had a few questions about Deloitte. What kind of entry level jobs does Deloitte offer for a cs major? Does Deloitte hire international students?",
          "score": 14
        }
      ]
    },
    {
      "title": "Who here has run into those companies that fake CS experience and background checks to get you $100K+ jobs?",
      "body": "In 2022 I was in a group for employment and was very naive eventually figured out that we were going to fake our experience by adding 5 years and the company would fake our background checks before shipping us to the employer. Even in 2025, they're still here and now with AI like cluely, it just makes everything much harder for fair players to get a break. One manager says that it's nearly impossible to get interviews without adding experience and that this is VERY common. All the people that I was with got jobs at Master Card, JP Morgan, Deloitte etc. Of all the posts I see here dreading about not being able to land a junior role, I'm quite surprised about the lack of stories about running into such companies.",
      "subreddit": "cscareerquestions",
      "score": 315,
      "url": "https://reddit.com/r/cscareerquestions/comments/1nwoaa9/who_here_has_run_into_those_companies_that_fake/",
      "comments": [
        {
          "body": "I know a couple of guys who've worked at those, one confessed to us on his last day, they don't get 100k+ jobs, their companies do get paid that, they get 25-40/h when they start, after a while their true experience starts to replace the fake one and they get better salaries or switch employers, after he confessed, a lot of weird conversations I had with other devs made a lot of sense and I'm pretty sure at least half of that team was fake, a friend of mine worked for another one somehow someone found out and turned it that most of his team was the same, they shared stories on how the cheated in interviews, the funniest one is that the give the \"dev\" a headset with a large microphone that covers most of their mouth and another guy has the actual microphone and takes the interview, while the \"dev\" just lip syncs, those two were working at F500 companies",
          "score": 84
        },
        {
          "body": "I don’t understand how anyone can get a job with fake experience in your resume. Every company I worked at conducts background checks through third party. They rarely check for references. I have worked at a lot of different companies over the years. Especially anything from mid to big companies will rarely bother calling your references. \n\nNot even that, these third party companies have ways to contact HR departments of the companies you previously worked at.",
          "score": 253
        },
        {
          "body": "because those stories refers to consultancy companies not actual client companies, you said \"shipping us to the employer\", meaning you're still on consultancy company's payroll not the client's, it's a bit like you worked at your employer for 1 year (let's say... Tata Consultancy) and your employer say \"nah you've worked here for 4\", so you'd shrug and say \"ok I guess I have 4 then\" and Tata ships you to Apple, Apple's HR doesn't care as you're not employed by Apple anyway, you're employed by Tata\n  \n&gt;All the people that I was with got jobs at Master Card, JP Morgan, Deloitte etc\n  \nyou have to be more specific here, are those people on Mastercard's payroll or some 3rd party consultancy company's payroll?",
          "score": 66
        },
        {
          "body": "I can chime in on this. The one I worked for targeted new grads. \n\nGot shipped off to Atlanta to a house they owned with about 7 other guys. They then did a 6 week boot camp to teach the tech stack. They then had their in-house professional write a resume that had multiple companies that none of the students worked for as well as coach on soft skills. For mobile tech stack I know they used paid apps to make it harder to check. When an interview was gained they had the “subject matter expert” sit on the interview to feed answers in case an unexpected question arose.\n\nIt was probably one of the better “mills” but before they dropped the bombshell that all our experience would be made up we had to sign a two year contract stipulating that if we left while under contract we’d owe 20k or 20% of lost profits if on project, whichever was more.\n\nAnother fun thing was that they had people pretend to be us on screening calls, we only ever talked during actual interviews. All the references were also employees who’d give glowing reviews or pretend to be managers from the companies we never worked for.\n\nThey billed at 120+ dollars an hour but, talking to the other guys, our pay ranged from 22 to 31 dollars an hour",
          "score": 25
        },
        {
          "body": "This is exactly why we only consider reputable past employment. We won’t hire someone who ever worked at a WITCH, and we’re very carefully about evaluating where applicants came from in general. It can be really tough to know if the experience in a resume is legitimate.",
          "score": 19
        },
        {
          "body": "There’s an entire industry that does this, I won’t say too much but there’s a reason you see so many contractors from one country. They are in a legal gray area but then again what company isn’t?",
          "score": 29
        }
      ]
    },
    {
      "title": "Deloitte Interview (X-Post to /r/consulting)",
      "body": "I have my face-to-face interview with Deloitte next week for a Consultant Java Developer position. I have been reading up on glassdoor, but thought I would ask here if anyone had any advice for the interview. I am a little worried about the case study, as I don't have any business experience. My background is as a software engineer, so I am unsure how the case study will relate. I would love to hear any advice, feedback, or anything else about the interviews I should know. Thanks!",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/1eu3hw/deloitte_interview_xpost_to_rconsulting/",
      "comments": [
        {
          "body": "I had an interview with BoozAllenHamilton for a similar position, so hopefully it's relevant. \n\nWhen I went they were interviewing several hundred candidates at the same time, so there wasn't a lot of time to push yourself. We had a 'personality' interview (which was 20 minutes chatting with another developer) and the 'case study' (which was basically just a developer saying \"Ok, here's what a client wants, design part of the system to do that\")\n\nHopefully your experience will not be like mine, because I found it unrewarding.",
          "score": 3
        }
      ]
    },
    {
      "title": "Encouragement for People Out There",
      "body": "Hey Guys,\n\nI have been seeing a lot of people struggle to find positions here or have been accepting positions way below their worth (bc i guess I believe in people). I have been seeing it first hand too with a bunch of my friends struggling to find gainful employment for almost a year.\n\nYou guys might want to try out different metro areas where you work as a government contractor. The roles are plentyful, junior engineers get treated like junior engineers and are expected to know not much coming in, and frankly its a great space to get noterirty if you are a go getter. You WILL make a name for yourself. Oh and did i say no leetcode style interviews?\n\nQ3 is generally when the vast majority of contract work drops for the prime contractors, so be on the lookout for new positions. \n\nSome metro areas with a lot of cleared/defense work: Washington DC metro, Denver CO, Los Angles CA, Huntsville AL, Orlando FL, Cincinnati OH, Fort Worth TX, Austin TX, Phoenix AZ.\n\nIf you land a full time position at the sub contracting role, your base salary can compete with that of FAANG, and that is no joke.\n\nDM me with any questions. Hope you guys are doing well out there\n\nEDIT- https://www2.deloitte.com/us/en/insights/industry/aerospace-defense/aerospace-and-defense-industry-outlook.html\n\nPer popular demand in my DMs, here is an article by deloitte on the defense industry and its health. TLDR: Despite an influx in workforce talent, A&amp;D (Aerospace and Defense) will continue to experience significant talent shortage\n",
      "subreddit": "cscareerquestions",
      "score": 26,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ekaeqy/encouragement_for_people_out_there/",
      "comments": [
        {
          "body": "An insightful, helpful post on CSCQ?\n\nI am shocked.",
          "score": 22
        },
        {
          "body": "[deleted]",
          "score": 8
        },
        {
          "body": "The problems I've seen trying to get hired with government contractors is that many of them require TS/SCI clearance. I apply, but most of them respond with the fact that I don't have the clearance even though they didn't initially require it in their job postings. Thank you for the heads up for Q3 though.",
          "score": 5
        },
        {
          "body": "Have you seen any gov't internships? Genuine question.",
          "score": 1
        },
        {
          "body": "How do you search for these positions?",
          "score": 1
        }
      ]
    },
    {
      "title": "Daily Chat Thread - June 01, 2022",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/v2axfv/daily_chat_thread_june_01_2022/",
      "comments": [
        {
          "body": "Sent off an application to a company I'd really like to work with. What if I just, you know, never read my email again so I won't have to worry about getting a rejection letter?\n\n(/s... mostly)",
          "score": 1
        },
        {
          "body": "Are companies forgiving at all of people being sick during interviews? I had one today and felt I could not think well at all, and had told my interviewer upfront I'd been/was still sick, and just really felt off my game and thrown off by some questions. This company is notoriously tough to begin with. Towards the end I asked whether they felt we'd covered everything because I felt my sickness was clouding everything, too. I know they don't know me prior to this or have much context for what I know other than my resume/my previous round with their recruiter. This role is important to me and I'm so worried I messed it up, can't stop thinking about it.",
          "score": 1
        },
        {
          "body": "Anyone have advice for someone relatively new in their career moving to a Product Owner position? I’m in the Defense Industry and my manager asked if I wanted the position, which I was surprised by with how young I am. He knows I want to remain technical so he offered me the PO job of a smaller project/team so I could continue to do development work (50-50 split between developer role and PO). The opportunity to lead a team is exciting but I don’t foresee myself down the road in management and afraid this role could overwhelm me.",
          "score": 2
        }
      ]
    },
    {
      "title": "Implementation Consultant -&gt; Software Engineer Difficulties",
      "body": "So I'm a new grad as of this semester and got a job as an implementation consultant for 96k base (109k comp), and I'm already applying to new jobs before having started this one. My main concern is that it will be difficult to move from this position to full dev roles in the future. We use some pretty outdated technologies and nothing seems like it would transfer over to \\*actual\\* dev work at a different company. Keep in mind this company works primarily for the government. Can anyone here speak to the experience of moving from a consulting position to a developer role?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/13mfj2e/implementation_consultant_software_engineer/",
      "comments": [
        {
          "body": "it is what it is.  \nIf you want to be a dev, start in the closest job you can get to a dev, and then apply to dev roles. That seems to be exactly what you are doing.",
          "score": 3
        },
        {
          "body": "Is this at Deloitte?",
          "score": 3
        }
      ]
    },
    {
      "title": "Interning at Deloitte?",
      "body": "So one of the few places that got back to me was for an internship at Deloitte's US delivery center. I have my first interview with them next week. The position is for \"Systems development\". I'm still not super sure what this company does but from the research I've done it seems like they do tech consulting and offer various software services to large companies.\n\nNow I have 0 interest in becoming a \"tech consultant\", I want to develop software. Does anyone have dev experience with Deloitte? The internship app made it very clear it was a SWE dev role and not consulting, but I'm having second thoughts now. It may be Deloitte or bust though, haven't had luck with my other applications for various reasons.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/j4jb4v/interning_at_deloitte/",
      "comments": [
        {
          "body": "Do the interview but be careful of a bait and switch for something like tech consulting/implementions, IT, support type roles instead of SWE",
          "score": 5
        }
      ]
    },
    {
      "title": "Daily Chat Thread - May 27, 2022",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/uysfbe/daily_chat_thread_may_27_2022/",
      "comments": [
        {
          "body": "Which company to join? I am a B. Tech fresher from IIIT Bhubaneswar, India. I have two offers, from Deloitte and Falabella. Falabella is offering 8.5 in hand salary and Deloitte is giving 6. The position at Deloitte is Business Analyst and at Falabella is Software Engineer. I am confused about which one to join. I need advice about which will be better. Deloitte has its brand value but Falabella is giving me the domain I want to work in.",
          "score": 1
        },
        {
          "body": "anyone know what windows laptop is offered for the Amazon sde onboarding package?",
          "score": 1
        },
        {
          "body": "I have received an offer from one company and have signed it. At the moment, I have many other last rounds of interviews that I have given and will give. Potentially, I expect at least 2 of 5 to be positive. Can I accept and sign multiple offers and later decide which one to take?\n\nI have heard of this company and many others rescinding an offer at the very last moment and want to play it safe.\n\nIs that allowed and legal in an at-will contract?\n\nWould it affect my current or future employment even if I find someone to fill my spot?",
          "score": 2
        },
        {
          "body": "How is goldman sachs as a company? The job would be working on distributed systems",
          "score": 1
        },
        {
          "body": "Got an offer from Amazon (AWS). Are the horror stories true? Note: it’s a security role (not dev). I think it’ll be a tremendous experience and really open up a lot more doors. Currently working at a faang-equivalent as a contractor. Thoughts?",
          "score": 1
        }
      ]
    },
    {
      "title": "Non of the Jobs I got asked algo questions ( 4 yoe)",
      "body": "As the title says I haven't gotten much exposure to algorithms and data structures in my career. I always had procrastinated when it came to learning them and I was putting it off till I ran into interviews that asked me about them... The thing was those interviews never did ask me about them. I have had 2 interviews that had me do coding problems. One with Aws that was a algo question but it was one of the first easy ones you would do on leetcode and I happened to remember the solution because of how simple it was and the other was for an interview at Deloitte which was an assignment (not live coding) that had leetcode easy like questions but they emphasized that I would not be judged on the efficiency or memory usage of my solutions... And considering I got the job I believe them. All of my other interviews do practical tests both live and take home assessments. And I've done a lot of interviews. I've always had a plan for how I would study when the time came. Just algo expert and anki for the most part but I'm at a point in my career where I'm not sure if it will ever be necessary. Fang seems to most likely to give this style of interviews but I have experienced exceptions to even that.\n\nAre only new grads getting these kinds of interviews? What kinds of companies actually give these kinds of interviews aside from fang if any?And are there any others who have done a fair amount of job hopping and interviews like myself who have similar experiences?",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/17ck1cl/non_of_the_jobs_i_got_asked_algo_questions_4_yoe/",
      "comments": [
        {
          "body": "my experience says you should expect leetcode-style questions **regardless** of company size (so, not just FAANGs) in SF Bay Area/Seattle/NYC\n  \noutside those 3 regions I have no clue\n  \nbut I can say for SF area I don't recall a single company even asking LC-easy, ever, it was all LC medium or LC hard, again keep in mind this is **regardless** of company name or size, Google Mountain View? expect leetcode, 100-employee startup in San Francisco? leetcode; 2000 employee company in San Jose? leetcode",
          "score": 25
        },
        {
          "body": "Most companies don't do leetcodey questions. LC medium/hards are mostly only done in some big tech and quant/HFT. Some of the big techs prefer more practical variations (Amazon, Stripe, for example). Outside of those, the landscape varies a lot, from quizzes to take homes to stack-specific tests.",
          "score": 18
        }
      ]
    },
    {
      "title": "DevOps Engineer opportunities at Deloitte: is it worth it, and how might I best prepare?",
      "body": "Hi there!\n\nPer the title: a recruiter recently reached out to me about DevOps opportunities with Deloitte: I let them know I would certainly consider it.  \nI'd been reached out to before by Deloitte about various positions, but a non-compete agreement prevented me from pursuing them at the time. I will admit, I've been curious about them.  \n   \nFull disclosure: I don't primarily consider myself a DevOps engineer. I'm more of a Full-Stack guy, with pretty solid experience in automation / pipelines / etc. But I do feel DevOps is an area I want to further grow in, to a more senior level.  \nAny engineers at Deloitte who would be willing to give me some insights on what tools are being used day-to-day, as well as how to prepare for any kind of interview?  (Stackshare gives me somewhat an \"unfulfilled\" picture of [their tech stack](https://stackshare.io/deloitte/deloitte)... not sure how accurate it is.)  \n\n\nI appreciate anything you can offer. 🙂 Thank you so much.",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/13c0ydd/devops_engineer_opportunities_at_deloitte_is_it/",
      "comments": [
        {
          "body": "There’s no standardized dev ops practice. Your stack will be specific to the project that you are on. I enjoyed my time at Deloitte, but experiences vary wildly based on the project. They are essentially each their own different ecosystem.",
          "score": 5
        },
        {
          "body": "With a consulting company, there will be a ton of variation of what their stack is. They might have a recommended/preferred stack, but they also need to factor in what their clients are using/want to use. I don't have experience with Deloitte but work at a competitor and have worked at other competitors in the past. I'm mainly in the AWS space. I'd think some mix of CloudFormation (or equivalent), Terraform, and possibly Ansible would be a starting point in terms of tools, and then they'll want to know what kind of experience you have standing up and managing different types of infrastructures.",
          "score": 2
        },
        {
          "body": "Wow... reading up on the Deloitte Reddit, I think I'm going to pass on this one for the time. o\\_O",
          "score": 2
        }
      ]
    },
    {
      "title": "Ghosted after 4 stages",
      "body": "Had a 4 stage interview with Deloitte in Australia. \n\nThey literally called me and asked if I would be interested in a senior cloud engineer role. Told them I'm not at a senior level, recruiter responded that's okay they take other levels as well. \n\nHad the initial screening call. \n\nTechnical interview where I did well. \n\nMeeting with a director who told me that he would love to hire me and all good from him. \n\nHad an interview with the partner where it went well and he said the same thing pretty much \"I have to sign off on this but you'll hear an outcome within a day\" \n\n1 week later nothing. \n\nContact the recruiter nothing. \n\nFollowed up a week later and they said sorry I'll get the outcome. Again nothing.\n\n12 weeks has gone by since the day of my final interview and I get a rejection email saying my application was unsuccessful when I didn't even put an application in because they literally contacted me from downloading my resume off a job search website. \n\nOverall a great experience I would love to do it again....",
      "subreddit": "cscareerquestions",
      "score": 21,
      "url": "https://reddit.com/r/cscareerquestions/comments/vdkrzv/ghosted_after_4_stages/",
      "comments": [
        {
          "body": "They probably intended to hire you but then implemented a hiring freeze type situation due to the economy. So it's possible that nobody got that position that you were to fill.",
          "score": 16
        },
        {
          "body": "It is also a possibility that they were interviewing multiple people and the person after you just edged you out.  The fact that it took 12 weeks is pretty crappy though.  In my most recent job hunt the longest anyone took from my final interview was 3 days, and I had already gotten two other offers before they got back to me.\n\nOn the plus side, you did well enough to get past the tech interview so you're doing something right.  If you want to make a move keep at it and you'll get the offer eventually.",
          "score": 4
        },
        {
          "body": "Lol they ghosted me too after 2 interviews",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "They do that. Won't pick call not going to call back. Good choice will be move on.",
          "score": 1
        },
        {
          "body": "Had a similar thing happen with Oracle a few weeks ago. 3 stages, was told interview went well. Got a courtesy call a few days later saying they'll need a few more days. Then boom ghosted. Super frustrating.",
          "score": 1
        }
      ]
    },
    {
      "title": "What is the consensus on working for consulting companies?",
      "body": "Places like: Deloitte, EY, PwC, and KPMG. \n\nAre they sought after or frowned upon?\n\nWhat is the culture/work environments like?",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/vyzmz7/what_is_the_consensus_on_working_for_consulting/",
      "comments": [
        {
          "body": "Some people prefer it over the typical SDE job. Some just use it to gain some entry-level experience and to move away from consultancy as soon as they can.\n\nThe consultant is expected to have more business skills (they need to bill/sell you to the client). You work on different projects, hence breadth as opposed to depth.\n\nCompensation-wise, it's usually lower than Big Tech (sometimes dramatically lower) but there's a higher ceiling if you are good at climbing the business hierarchy and networking. You also work more hours (usually) and travel more often.Culture-wise, it's more competitive, sometimes it gets to the extreme \"dog eats dog\" type of competition. Getting on the right project with high visibility will make your career, and you get there by pushing very hard during your first years. The attrition rate will be very high for this reason, those who survive can build a career as consultants.\n\nEntry barriers are lower, because they don't care about you being technically excellent (again, breath vs depth), but they want you to be a well-rounded individual that is able to get things done with good communication and soft skills.",
          "score": 5
        }
      ]
    },
    {
      "title": "Deloitte AI &amp; Data Consultant vs In-house data analyst",
      "body": "Hello, I am an experienced hire with a few years of experience located in Asia. My **mid-term goal is to immigrate to Germany** and stay there, so I need a profile that can support me to find a job there before I consider getting a master's degree there.\n\n(Why Germany - I prefer the European living style, and Germany is the economic powerhouse of Europe. I also know mid-level German and can improve myself)\n\n\\---\n\nI received 2 offers:\n\n1. **Deloitte AI &amp; Data - Consultant**\n2. **Multinational logistics company - Data Analyst**\n\nI am currently struggling between the two. They offer similar pay and benefits, and the pros and cons I identified are the following:\n\n**Deloitte**\n\n(Job area - digital project implementation, dashboards, solving client data silo, data strategy and governance consulting, help with proposal)\n\nPros:\n\n1. Exposure to different clients and industry\n2. Resume builder and strong international brand\n3. Exposure to new technology\n\nCons:\n\n1. Workload - I won't be able to maintain my hobby and side income\n2. Less strong industry expertise compared to in-house\n\n**Multinational logistics company**\n\n(Job area - data analysis and insights, data storytelling, dashboard, BAU report generation, competitor research, some automation)\n\nPros:\n\n1. Better develop industry expertise which makes it easier to find a job in DHL, UPS etc\n2. Significantly less workload than Deloitte\n3. People are easy-going from my interview experience\n\nCons:\n\n1. Less exposure to different industries\n2. Less exposure to new tech\n\n\\---\n\nCould you please advise me if my understanding of Deloitte Consulting AI &amp; Data is truthful? Which offer would you recommend me to accept based on your experience?\n\nThank you!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1bp6ji9/deloitte_ai_data_consultant_vs_inhouse_data/",
      "comments": [
        {
          "body": "Deloitte is very recognizable and will open many doors, as will “AI” in your title.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Quiting a student job after 9 months?",
      "body": "Hi there, I'm currently doing a double bachelor in information science and artificial intelligence. At the same time I'm working as a SWE at a big 4 accounting firm for 24hrs/week. The job is decent but the pay is low (literally minimumwage) and I've been seeing some vacancies for student developers/data scientists that pay a lot more and also would allow me to work a more reasonable 16hrs/week (already got me an interview in two weeks). The thing is I've only worked here for a little over 8 months. I know that generally it's not a great visual when you leave a job after such a short while. That being said, I would definitely appreciate making 50% more money (hourly) and working less. Do you guys think I should sit it out for a couple more months so that I can put that 1 YoE on my resume or should I take a new job (assuming I'll find something better)?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/16nn324/quiting_a_student_job_after_9_months/",
      "comments": [
        {
          "body": "I quit my second job after 9 months and my next job did not give a damn- the concept of \"you must stay at least a year\" is outdated imo. It is well known that there are plenty of toxic or low paying tech companies.   \n\n\nIf its a guarantee that you can make a jump and considering you already have an interview I wouldnt worry about it. However do keep in mind that connections matter. I know former Deloitte consultants that have gotten farther in their career faster working at consulting prior to joining tech (if it's them you are working for).",
          "score": 1
        }
      ]
    },
    {
      "title": "Career growth as a new grad",
      "body": "Hi! I'm a junior who'll be on a hunt for full-time opportunities soon.\n\nDoes starting my career at a consulting firm, such as Deloitte, be more helpful than working at a software-focused company, whether it be a unicorn or the Big-Ns?\n\nI feel like being at a consulting firm would present more diverse project opportunities in different fields, whereas at software companies, I would dive relatively deeper into fields. My perception is depth v width. Is that about right?\n\nThanks!",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/uihh0s/career_growth_as_a_new_grad/",
      "comments": [
        {
          "body": "Maybe you would learn more at Deloitte, but the resume value of working at a Big N would easily outshine that. And it doesn't matter what you learn if you never get the chance to show it in an interview.",
          "score": 10
        },
        {
          "body": "[deleted]",
          "score": 6
        },
        {
          "body": "\\&gt; Does starting my career at a consulting firm, such as Deloitte, be more helpful than working at a software-focused company, whether it be a unicorn or the Big-Ns?\n\nNo. A Big N or Unicorn will probably provide more interesting job opportunities, mentorship, growth, and most importantly, pay + exit opps than Consulting.\n\nThere is a reason every Deloitte person on Blind is asking about interviews at FAANG.",
          "score": 3
        },
        {
          "body": "The number of years of experience tends to matter more than where you work at, although having a big name (or at least recognizable name) on your resume definitely can help.",
          "score": 1
        },
        {
          "body": "Honestly, it's up to you. A lot of people will say it's better to work for a big-N, but it really depends on the job and team. Worked a year at a Big-N and learned absolutely nothing. They were a terrible team and wouldn't trust me with a single project worthy of my degree. On one hand, I have a big-N on my resume, on the other, I'm behind on knowledge and out of practice, my experience is in outdated tech. So it's pretty much worthless.\n\nOn the other hand, maybe you work for a little crap company, make a lot less, and you're the smartest guy in the room. You can make big changes and update their tech stack because there's less red tape. You get more flexibility to try things. Now you've gained experience but have less attention.\nAlso big-N aren't be-all-end-all. Some people want to make 6 figures at a big-N, have to work overtime and they're burned out and switching careers in 2 years. Others work at a local company that pays $70k, projects are a little boring sometimes but you get to go home at 5 o'clock everyday. Shrug",
          "score": 1
        },
        {
          "body": "I did this and came out very specialized and more equipped to understand customer needs. Left after 6 months to join a unicorn and doubled my TC.\n\nI disliked billable hours and meetings. But I got the chance to work with a lot of Fortune 100 companies and a variety of projects.\n\nhttps://cloudirregular.substack.com/p/every-engineer-should-do-a-stint\n\nHowever, if you can get an offer from big N or unicorn off the bat, that is way better.",
          "score": 1
        }
      ]
    },
    {
      "title": "3 virtual on sites, about 200 applications, and 1 offer.",
      "body": "So I was in tech consulting at a B4 consulting firm (KPMG, EY, Deloitte, PwC), doing VBA development for first 6-8 months then started doing C# / SQL development in January which became my full-time role at beginning of August. Do not have a CS degree although I'm working on that.\n\nI was aware of how horrifically underpaid I was, so when firm laid off 5% of my business unit and gave me a 2% raise, decided it was time to shop around.\n\nEven with a resume that was vetted by over a dozen people as being solid, great GitHub, etc. and a big name on resume with 1.5 YOE, it was a brutal search. Mostly rejections or no responses.\n\nThe offer I got was for a company where I just started talking to someone on LinkedIn, since I regularly connect with new engineers to build the network, and he offered to do resume and GitHub reviews for junior engineers because he knew how bad the job market was. Very nice guy. Ended up getting a referral from him, not by directly asking but asking if he thinks a job req I saw would be a good fit for me and he offered to refer me, and that caused the HM to actually see the resume and went from there for an offer with real SWE title, no more body shop tech consulting BS, and 30% bump in TC.\n\nIt can be done but a lot of suggestions or advice I got was just not helpful. No one read my cover letter as far as I can tell nor did it make a difference in my abysmal response rate. Tweaking your resume can't do much beyond a certain point. Practicing LC is silly if you aren't getting interviews.\n\nI hate the idea of DMing people randomly on LI to get traction but honestly that's the only thing that worked. More than anything, if you are struggling with your job search, I recommend adding more connections on LI and try to build some real connections vs. just clicking the button. You can also get referrals elsewhere like on repher.me but you absolutely need referrals in this job market it seems. Applying to hundreds of jobs without them didn't seem to make a difference for me. YMMV. Good luck everyone!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/k5nyjn/3_virtual_on_sites_about_200_applications_and_1/",
      "comments": [
        {
          "body": "I'll be honest, people that DM me on LinkedIn asking for a referral get yeeted (am I using that term correctly?) from my network pretty quick. I even had someone guess my work email after I ignored him on LinkedIn. That being said, you miss 100% of the shots you don't take, so I can't really blame them for trying.",
          "score": 12
        }
      ]
    },
    {
      "title": "Federal DevOps engineer, Deloitte GPS or Booz Allen Hamilton?",
      "body": "Hey all, so as the title suggests I’m a federal DevOps Engineer/software engineering consultant in DC. Have 3.5 years experience, and currently have an offer from Booz as a senior consultant doing DevOps/AWS. I have an interview this week with Deloitte for essentially the same thing, federal contracts etc. High probability ill receive an offer with them as well, and assuming offers are similar (although Deloitte gives yearly bonuses and Booz does not), what’s your take? Cultures? I know the gist of it between the two, Deloitte name as a brand is globally well known and prestigious. Bah in the federal world has a great reputation. \n\nI’m 31 and have a young family, 2 kids so work life balance is important to me, and I know Deloitte traditionally atleast in their Big 4 nature has a reputation of long hours. My hope is it being GPS the work won’t be as cut throat, but would love to hear some thoughts from y’all.",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/wpzq2m/federal_devops_engineer_deloitte_gps_or_booz/",
      "comments": []
    },
    {
      "title": "Is Deloitte a good start to a software engineering career",
      "body": "I accepted an offer for a GPS solutions engineering analyst and the interviewer and recruiter made it clear the role would be a technical one with full stack development. \n\nMy question is how does Deloitte look on a resume when applying to software engineering roles?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/teg65k/is_deloitte_a_good_start_to_a_software/",
      "comments": [
        {
          "body": "Sorry, you do not meet the minimum sitewide comment karma requirement of **100** to post a submission. Please try again after you have acquired more karma. Please look at the [rules page](https://old.reddit.com/r/cscareerquestions/w/posting_rules) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Lots of accounting internship experience but want to get into Consulting. Any advice?!",
      "body": "Hi everyone! As of recently I’m a junior Majoring in Finance with a minor is Business Analytics. Until this semester I was an accounting major— I have been interested in getting into the consulting field. Here is my prior experience. Freshman year I had two offers one from Deloitte and one from PWC. I chose Deloitte because they gave me a $2,500 bonus and it was client facing. After my audit and tax internship that was this Summer of 2020 I asked to intern in their advisory practice. I interviewed and got assigned to their internal control department specializing in tech assurance and a possibility to rotate in cyber risk! Also, I wanted to get a busy season internship since the Deloitte internship was cut short due to COVID so I applied to literally 30 companies and all the small firms rejected me and I only had ONE offer and it was for PWC?! To me I thought that was just crazy that I had more luck at one of the top firms than a mid tier one—very bizarre. For PWC it starts in January and I’ll be in their external audit department. So my advice is I know I’ll have a lot accounting internship experiences but one of my dreams is to work for Google or Microsoft—not sure what exact department but would love to. Or to go into management consulting or tech consulting. Any advice?!",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/k67qvl/lots_of_accounting_internship_experience_but_want/",
      "comments": [
        {
          "body": "i don't think google or microsoft employ management or tech consultants.",
          "score": 2
        }
      ]
    },
    {
      "title": "Internship in Deloitte or an API mine start up",
      "body": "I recently got offers from both. In Deloitte I just did a small HR interview and the next day I got offered the job. I asked them when I should reply and they told me in one day. With the startup I have done both a regular and technical interview and they have decided they want to work with me. I am really conflicted I really like the startup project and team but it might not give as many career prospects as one of the big 4. What's your take on this?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/sjedno/internship_in_deloitte_or_an_api_mine_start_up/",
      "comments": [
        {
          "body": "Yeah, nobody in tech cares about accounting Big 4. I have a dim view of Deloitte after being extremely underwhelmed by the their interview process and this post is just more of the same it aeems. Work for the start up that actually asked you technical questions, OP. I guarantee your co-workers will be way more competent.",
          "score": 4
        },
        {
          "body": "Call your Deloitte recruiter and tell them you need more time. See how much the start up is offering you. If the start up is offering same or more. Take the start up. You most likely dont know what you’re gonna be working on at Deloitte. Even if the start is making less I would still take it. I personally don’t know what the big career prospects are when you leave Deloitte I think that applies to jobs outside cs",
          "score": 2
        }
      ]
    },
    {
      "title": "Prestige and Career Growth at Deloitte",
      "body": "I recently received an offer from Deloitte for the role of Government and Public Services (GPS) Consulting Solutions Engineering Analyst and I was just curious what you all thought about that role. Is this a role where I would learn a lot and be able to advance my career, or would this kind of role be looked down upon in the software engineering field? I have a masters degree if that makes any difference. The offer comes with a salary of 93k with a sign on bonus of 12k in Arlington VA. Since this will be my first job out of college I want to start out on the right foot and pick a position that will have good exit opportunities for me. I am also interviewing at a few other places so I just wanted to get an idea of whether I should be excited about this offer or whether I should prioritize getting offers from some of the other companies I am interviewing with. Thanks for the insight, I really appreciate it!",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/qet3l8/prestige_and_career_growth_at_deloitte/",
      "comments": [
        {
          "body": "Deloitte is a recognized company for sure. I don't know exactly what a Consulting Solutions Engineering Analyst does as far as software engineering is concerned, but it seems like a nice offer as a new grad. If it involves things you are interested in doing, that should be your main focus. If you work hard and do well, opportunities will present themselves.\n\nI just don't think you should worry about 'prestige'.",
          "score": 9
        },
        {
          "body": "It's hard to say much about that role just off of the name - \"Consulting Solutions Engineering Analyst\" could mean pretty much anything.  \n  \nDeloitte isn't a particularly prestigious name in tech. That's not to say you shouldn't take it, it does't have a \"bad\" reputation like say Revature, but if the job description doesn't seem like it'll get you the SWE experience you're looking you shouldn't accept it just \"to get the Deloitte name on my resume\" or whatever.",
          "score": 5
        }
      ]
    },
    {
      "title": "I want to be a SWE again. Would I be an idiot if I left a great company?",
      "body": "I work for an amazing company (same tier as FAANG), but as an implementation consultant, not a SWE. I graduated college from a top 10 CS program at the end of 2019, and took this position because I didn't think I wanted to be a SWE when I was graduating school. I am kind of extroverted and thought \"oh i can speak to people I'll be a great consultant!\" and now I am regretful (although super aware and happy that I am in a great situation regardless in the grand scheme of things.) I was always resistant to becoming that heads down software engineer that really digs into the details of things because it didn't seem like it was for me. I got good grades, generally understood most concepts and had fun with it, but I was never that kid who was super hype to explore the differences between Java 7 and Java 8.\n\nI thought I wanted to talk to customers and boy was I wrong. I am pretty much the first point of contact after people buy our product, and the limited scope of my consulting engagements (they're about 4 weeks of teaching the basics and standing up the 'phase 1' of our product.) can cause me to constantly tell people I can't help them with more advanced things that they want (what the salespeople told them is possible down the line). Also at this point I am pretty much doing the same thing. I configure, I don't really build. I wanted to wait it out (been since January now) and make sure I'm not being impulsive, and at this point I have decided I officially wanted to go to back to being a SWE. A Solutions Engineer reached out to me and thought I'd be a great fit but I think I'd be chasing money at that point, and I care much more about being happy (SWE's make more than enough for me and often don't deal with customer BS).\n\nI didn't want this to be impulsive so I tried to answer to myself why I don't like my job and why I would want to be a SWE:\n\nI don't like my job because:\n\n* Meeting with some of my clients gives me so much anxiety. I wake up in bed early in the morning and can't fall back asleep because I think \"What if he/she says this? How will I answer? Will he/she be mad if I don't know?\" This has affected me less as time goes on, which I bet has to do with experience since I've never been in a client facing business role, but I want to be able to sleep through the night and not worry about a 50 year old man getting mad because I can't do something more complicated for him.\n* I have no skin in the game. I want to build out cooler and more complicated things but my scope just scratches the surface. I often think back about how my past customers were doing and wish I could have built out more for them.\n* I don't really build much at all. I tell my friends I 'configure', I don't build. I pretty much collect requirements, then declaratively configure to meet my customer's needs. I've become a lot more excited by tech recently and would rather be building a product and coding than what I'm doing now.\n* I am social but I realized I like talking about music/video games/sports/hobbies, not so much talking to people about the problems with their business. I do try to get genuinely interested for my and the clients' mutual benefit, but I don't enjoy this as much as I thought I would and can sometimes turn into someone who just gets vented to.\n\nHowever, I have tried to be optimistic because my job also has given me great experiences:\n\n* I directly interface with the execs at small/medium business which is pretty scary but neat because I'm just some random kid who just turned 23. I independently lead the entire engagement from start to finish. This has probably subconsciously helped my communication skills more than I realize. I think at a consulting company like Deloitte I wouldn't actually talk to clients until years down the road.\n* I figure out business requirements and am able to translate those into solutions. It is something I've never done before and I think it's good experience even if I want to switch to SWE. I learn how customers/end users actually think which I think could help me when I work on creating a product.\n* Work life balance is great and my company is awesome. I would love to stay here if there were SWE positions. My worry is that they won't have anything for me. I've talked to my boss and he wants to get me to a position I like but is hesitant to let me escape consulting. He tells me my personal skills would be wasted.\n\nIt seems like generally the company wants you to stay at a position for a year before switching which would be February 2021 for me. Even then, I don't know if I am guaranteed a SWE job and internal recruiters haven't been the most helpful.\n\nI've started to prep for interviews and am working on a side project with some relevant tech (MERN + Heroku) + so I can show companies I actually am capable of doing SWE work. I hope this would help me get interviews then it would be up to me to convert them into offers.\n\nFebruary seems like a lifetime away. In a perfect world, if I somehow manage to crush an interview at somewhere else that's awesome, I'd probably jump ship and treat it as a reset, however if I only manage to get an offer at somewhere that doesn't get my as excited as my current company, I'm worried I'd feel like an idiot for leaving. I'm fortunate to have a job so I am trying not to be in a rush (I do qualify for new grad positions still though and want to apply to them sooner than later before I am no longer officially a new grad). What do you guys think? What would you guys do? Sorry if this is a novel.",
      "subreddit": "cscareerquestions",
      "score": 13,
      "url": "https://reddit.com/r/cscareerquestions/comments/j6wex7/i_want_to_be_a_swe_again_would_i_be_an_idiot_if_i/",
      "comments": [
        {
          "body": "!remindme 2 days",
          "score": 1
        },
        {
          "body": "I'm in exactly the same boat now. I also configure instead of create and get extreme anxiety ahead of customer interactions.\n\nGetting a head-down job would be ideal for me but feel I lack the experience and skillset after some years of little programming practice at work.\n\nWould love to hear how you got on.",
          "score": 1
        }
      ]
    },
    {
      "title": "Deloitte - Final Interview (November) Process",
      "body": "I did my final interview for a Data &amp; AI role in November, submitted the documents requested after the interview, and did follow up and was told I’d been shortlisted, but that timelines may take longer due to internal planning. \n\n**Is it because of year-end?** \n\n**I’m still waiting** \n\n👉 Has anyone else had a Nov–Dec final interview and waited into January?\n\n👉 Did it eventually move forward to an offer?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1q63rrj/deloitte_final_interview_november_process/",
      "comments": []
    },
    {
      "title": "I have my first interview for Auditor Jr in Deloitte. How does this work?",
      "body": "I will have to participate in a Challenge in which I will be asked to play the role of a Manager at Deloitte. What does it consist of?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/10q55se/i_have_my_first_interview_for_auditor_jr_in/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Deloitte Referral: Does profile selected mean shortlisted for interview",
      "body": "Hi,\n\nI recently got referred to deloitte by a friend. She got this message a few days after the referral. Does this mean i will be interviewed for the role or just another acceptance message from deloitte. It has been close to a week and there has not been any response. Should i keep hoping for a call or this is another dead end ?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5e094dgrub571.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=0409cbff4d9ec0dc023001862aed4f7a267fe1e5",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/o01nd4/deloitte_referral_does_profile_selected_mean/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "how long does it take to hear back from Deloitte US India after first round of interview...?",
      "body": "",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/45vq06/how_long_does_it_take_to_hear_back_from_deloitte/",
      "comments": [
        {
          "body": "What did they tell you in the first round interview?  If it's been longer, contact them and ask the status. ",
          "score": 2
        }
      ]
    },
    {
      "title": "Career advice and placement drive suggetions",
      "body": "So I am from the best private engineering college of West Bengal (at least had a great name the time I joined in). Now in our cse core department the av placement is about 6.5 lpa and almost all the students of our department gets placement. Usually more than half gets equal or over 6 lpa .\n\nNow I am in 4rth year, placement season has started, now in kolkata there are very few product based company and almost all of them (around 10-15)come to our college but takes around 5-10 candidates accross departments , our department may get 3-7 max on av and they offer generally 6-10 lpa . \nAround 20-30 opportunities at Max come each year that's more than 10 lpa for across departments . Maybe at Max our department gets 10-12 of them having 215 students.\n\nNow for mass recruitment tcs, wipro , cognizant, Capgemini, LTI Mindtree, infosys each take atleast 100 students. 30 percent of that having 5 lpa + offers, tcs digital takes around 80-90 , tcs prime 40-50 , infosis dse and pp combined 20-30 but this year it is supposed to be thrice as per placement co ordinator since they have opened a large new campus in kolkata , Capgemini 5.75 takes 70 , \nCapgemini 7.5 takes 12-15 , cognizant pro and genc next takes 50 combined max ,etc\n\nAll the big 4 comes and takes 70-90 and gives 4.8 package, \nDeloitte only gives 7.6 but takes 30-40 candidates .\n\nNow our college have a policy of blocking each company until 2x offer in case of a placement under 5 , and blocking each unitil 1.5x for 5- under 9 lpa offer, and if got any 9 or over then completely blocked.\n\n\nNow my sinereo I am a above average guy maybe in the top 30 of our department including all things considered. \n\nIst oportunity was a 6 lpa local product based company I missed to fillup the form but they took only one guy .\n2nd oportunity was hyland for 8lpa i couldn't clear the oa round due to some miss management, they took 7 of our department \n\n3rd was ap moler for 10.5 lpa , I cleared the oa round , sat for interview along with 25 of our department, they took only 2 of them\n\nNow cause I am doing cognizant fse online I am not allowed for ofline cognizant which have come now .\nNow there comes ey offering 4.8 and usually takes 100 students form our college maybe 15-20 form our department.\nSo I am confused should I sit for these and if I get this most probably this will be my last job from this college cuse i don't think I can convert any job over 9.6 after this . \n\nI have a big brother of 15 years older cousin basically but brother like he has been in tcs for 14 years , have got to very high and now in uk earns in crores , and I have lot of respect towards him .Yesterday I called him and he told me that ey will be way better opportunity than Capgemini tcs cognizant 5-7 lpa packages, and if I didn't sit for this in hope of those product based company then it can be risky based on the current situation. Cause in most cases they don't directly provide ppo they give intership and based on performance they give full time offer so I can be hung anytime and I will not have any options left even after I crack one of those . \n\nI am also aspiring for gate which is basically my main goal though couldn't give first priority because of the situation but if I get any placement then that will be my top priority.I got 5k rank on completion of half silebus even after getting 50 marks due to this absurd grace marks this year they gave the other shift , \n\nI am confused that if I get this ey and I see people way below my quality getting good jobs 7-8 lpa then will I be happy in case I don't make it in gate . What should I do any suggestions will be helpful. \n\nMy basic point I have no doubt ey as a oportunity is a great thing. But cause I know how many companies and opportunities come to our college my only concern is me getting blocked in basically everything after this and also I have a biased towards more computer science related or product based companies.\nIn case I couldn't crack any other and ey comes during the end I always would have targeted that blindly. But now in August it makes me  confused.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1moe2zi/career_advice_and_placement_drive_suggetions/",
      "comments": []
    },
    {
      "title": "AI Interview is a complete SCAM and alarming for the future",
      "body": "I accepted an interview request for a Program Manager job with Deloitte. They had me go through a first round interview with an \"AI interviewer\". I thought okay, why not?\n\n\n**BIG MISTAKE.**\n\n\nI showed up to the AI interview dressed up and prepared, as they were recording video and audio. I expected the AI to ask me some generic questions and maybe crawl through my resume to ask some more personal questions relating to my experience, but what I got was far worse.\n\n\nI started off with a self introduction as the AI requested, but it cut me off MID SENTENCE after 5 seconds. It immediately went into the second question, completely ignoring that it had cut me off mid answer and I didn't even get to finish my sentence. This went on for EVERY SINGLE QUESTION I got. I did not get to answer ANY questions at all since the AI would finish their question, then wait 5 seconds and immediately start their next question. I was expecting the interview to last around 30-40 minutes, but instead the entire interview lasted a total of 3 minutes due to the AI interview cutting me off every single question.\n\n\nI work in the tech space and have experience building AIML products -- I know that what I've just experienced is so completely broken that it would have NEVER passed QA or could be considered an MVP at any stage. I am incredibly disappointed that Deloitte's name could be attached to something like this at all and it's making me realize how many companies are out there simply slapping \"AI\" as a keyword on whatever broken crappy product they're shoveling out. As someone who actually built AIML products, this is incredibly disheartening to see and realize this is the future.",
      "subreddit": "jobs",
      "score": 706,
      "url": "https://reddit.com/r/jobs/comments/1hqng6m/ai_interview_is_a_complete_scam_and_alarming_for/",
      "comments": [
        {
          "body": "Almost feels like they are using people as guinea pigs. AI interviewing fundamentally should not be allowed if you asked me. I'm at the point where I only DM hiring managers lol",
          "score": 160
        },
        {
          "body": "People seem to be very accepting of AI mistakes. If any other tool messed up as much it would be unacceptable.",
          "score": 327
        },
        {
          "body": "Any type of ai interview or one way video interview is an immediate pass for me. I just tell them I don’t do those. Have some self respect.",
          "score": 75
        },
        {
          "body": "This is peak Deloitte",
          "score": 45
        },
        {
          "body": "We are currently in the phase where they are just label-slapping 'AI' onto every product and shipping it. We are in the midst of the 'AI' hype cycle. Shitty products are getting shipped no matter what.\n\nIt will settle down eventually but this is what we are in store for over the next few years.",
          "score": 43
        }
      ]
    },
    {
      "title": "Deloitte interview scheduled for tomorrow",
      "body": "Interview is scheduled for tomorrow, \nJob: operational risk (accounting &amp; internal control) i just got a call and they set up the interview on teams with 3 members in it, no information on whether its a technical round or a hr round, how do i prepare?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/qruavs/deloitte_interview_scheduled_for_tomorrow/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "You should be prepared for both technical and HR rounds. This isn't college where you can study for one test, completely forget your answers after the test and study for the next one.\n\nIf your question is how do you prepare for a HR or technical interview, Google is your friend.",
          "score": 1
        },
        {
          "body": "You could look up the memebers on maybe linkedin? If any of them is a manager, it won't be a pure HR interview. Maybe make sure to log out when doing your research, if you don't want them to feel stalked. But i'd say it's normal looking up your interviewers. They probably won't even care. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm being offered an interview for an internship in Risk Advisory Function at Deloitte. How should I prepare?",
      "body": "I have never done a corporate interview before. What and how should I prepare? What do you think they would ask? I'm being interviewed by the Risk Advisory Senior Manager.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/c2yynb/im_being_offered_an_interview_for_an_internship/",
      "comments": [
        {
          "body": "Great company, you're gonna be up against amazing candidates. Research the company and highlight your strong points. Research the role and how your past experience will allow you to excel in the position",
          "score": 2
        }
      ]
    },
    {
      "title": "Career advice and placement drive suggetions",
      "body": "So I am from the best private engineering college of West Bengal (at least had a great name the time I joined in). Now in our cse core department the av placement is about 6.5 lpa and almost all the students of our department gets placement. Usually more than half gets equal or over 6 lpa .\n\nNow I am in 4rth year, placement season has started, now in kolkata there are very few product based company and almost all of them (around 10-15)come to our college but takes around 5-10 candidates accross departments , our department may get 3-7 max on av and they offer generally 6-10 lpa . \nAround 20-30 opportunities at Max come each year that's more than 10 lpa for across departments . Maybe at Max our department gets 10-12 of them having 215 students.\n\nNow for mass recruitment tcs, wipro , cognizant, Capgemini, LTI Mindtree, infosys each take atleast 100 students. 30 percent of that having 5 lpa + offers, tcs digital takes around 80-90 , tcs prime 40-50 , infosis dse and pp combined 20-30 but this year it is supposed to be thrice as per placement co ordinator since they have opened a large new campus in kolkata , Capgemini 5.75 takes 70 , \nCapgemini 7.5 takes 12-15 , cognizant pro and genc next takes 50 combined max ,etc\n\nAll the big 4 comes and takes 70-90 and gives 4.8 package, \nDeloitte only gives 7.6 but takes 30-40 candidates .\n\nNow our college have a policy of blocking each company until 2x offer in case of a placement under 5 , and blocking each unitil 1.5x for 5- under 9 lpa offer, and if got any 9 or over then completely blocked.\n\n\nNow my sinereo I am a above average guy maybe in the top 30 of our department including all things considered. \n\nIst oportunity was a 6 lpa local product based company I missed to fillup the form but they took only one guy .\n2nd oportunity was hyland for 8lpa i couldn't clear the oa round due to some miss management, they took 7 of our department \n\n3rd was ap moler for 10.5 lpa , I cleared the oa round , sat for interview along with 25 of our department, they took only 2 of them\n\nNow cause I am doing cognizant fse online I am not allowed for ofline cognizant which have come now .\nNow there comes ey offering 4.8 and usually takes 100 students form our college maybe 15-20 form our department.\nSo I am confused should I sit for these and if I get this most probably this will be my last job from this college cuse i don't think I can convert any job over 9.6 after this . \n\nI have a big brother of 15 years older cousin basically but brother like he has been in tcs for 14 years , have got to very high and now in uk earns in crores , and I have lot of respect towards him .Yesterday I called him and he told me that ey will be way better opportunity than Capgemini tcs cognizant 5-7 lpa packages, and if I didn't sit for this in hope of those product based company then it can be risky based on the current situation. Cause in most cases they don't directly provide ppo they give intership and based on performance they give full time offer so I can be hung anytime and I will not have any options left even after I crack one of those . \n\nI am also aspiring for gate which is basically my main goal though couldn't give first priority because of the situation but if I get any placement then that will be my top priority.I got 5k rank on completion of half silebus even after getting 50 marks due to this absurd grace marks this year they gave the other shift , \n\nI am confused that if I get this ey and I see people way below my quality getting good jobs 7-8 lpa then will I be happy in case I don't make it in gate . What should I do any suggestions will be helpful. \n\nMy basic point I have no doubt ey as a oportunity is a great thing. But cause I know how many companies and opportunities come to our college my only concern is me getting blocked in basically everything after this and also I have a biased towards more computer science related or product based companies.\nIn case I couldn't crack any other and ey comes during the end I always would have targeted that blindly. But now in August it makes me  confused.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1moe2mv/career_advice_and_placement_drive_suggetions/",
      "comments": []
    },
    {
      "title": "Gave Up Job Interviews",
      "body": "This was the final nail in the coffing.\n\nHad a deloitte second round today,in which the interviewer asked data engineering question in data science.\n\nNeedless to say i cannot answer properly interview ended in 20 minutes out of 30 minutes.\n\n  \n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1kz2iz7/gave_up_job_interviews/",
      "comments": [
        {
          "body": "A data scientist is faaaaar more valuable when they know some basics of data engineering.",
          "score": 2
        },
        {
          "body": "coffing?",
          "score": 1
        }
      ]
    },
    {
      "title": "Job rejection",
      "body": "I don't know why i got rejected this time the interview went really well he appreciated for my self introduction.. it was all good .. but i didn't got selected.. Deloitte was my dream company... Huh but life has to go on..",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1j8okon/job_rejection/",
      "comments": [
        {
          "body": "In the job hunt, the candidate is actually competing against others.\n\nYou can be overlooked for selection because you did something wrong, or didn't do something well enough, or because someone else did things better.\n\nIt doesn't have to be due to failings on your part.",
          "score": 1
        }
      ]
    },
    {
      "title": "(*SCAM*) INVITATION TO INTERVIEW WITH GOVCIO (*SCAM*)",
      "body": "Luckily I started to catch on before providing any essential/critical information to these people. I'll allow myself to be the idiot of the day just to bring awareness to their tactics.\n\n**IF YOU SEE ANY PART OF THIS SCRIPT IN A JOB OFFER SENT TO YOU, TURN AWAY IMMEDIATELY.**\n\nHERE YOU GO:\n\nEmails Associated with this scam:\n\ngovcio59@   gmail.    com\n\nnicholegattohahn40@   outlook.   com\n\nGood day,\n\nI hope this message finds you well.\n\nThank you for your interest in joining GovCIO. Your application has been thoroughly reviewed, and we were impressed by your qualifications. We would like to extend an invitation for you to participate in an interview via the Microsoft Teams app. This interview will provide an opportunity for us to discuss the position in further detail and to gain insight into your background and experience.\n\nAt GovCIO, we offer a comprehensive training program for new team members, along with flexible working hours. This position is available for both full-time and part-time candidates, with competitive pay rates starting at $15 per hour during the training period and $30-35 per hour for Full-Time or Part-Time roles, depending on skill level. Additionally, we provide medical and retirement benefits to our employees. Your verification code, (DOC-101), will serve as your identification number throughout the online hiring process.\n\nWe currently have openings for the positions of Customer Service Representatives and Data Entry Specialists. Please note that these are work-from-home positions.\n\nTo facilitate the interview process, we kindly ask that you configure and install Microsoft Teams if you haven't already done so. You can download the app using the following link: \\[MS Teams Link\\]. Alternatively, you can add Nichole Hahn at Nicholegattohahn40@   outlook.   com. She will be available via Microsoft Teams to conduct the job briefing/interview and provide any necessary details. This is the initial step to proceed further, and we look forward to your timely response.\n\nShould you have any further questions or require additional information, please do not hesitate to reach out to Nichole. Your prompt response would be greatly appreciated.\n\nWe are excited about the possibility of welcoming you to our team at GovCIO and look forward to the opportunity to speak with you further.\n\nBest regards,\n\nKim Williams\n\nRecruiting Manager\n\nGovCIO\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nCONVERSATION CONTINUES ON MS TEAMS\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nME:\n\nHello Nichole, I am Silly Butt.\n\nI received an invitation to interview and I was informed to get in contact with you to start the process. Is this correct?\n\nSPAM ACCOUNT:\n\nSilly Butt, thank you for contacting GovCIO. My name is Nichole Hahn, and I am the Communication Hiring Manager at our Head Office.\n\nWould you prefer to proceed with the interview section immediately, or would you like to schedule it for a later time?\n\nME:\n\nI am happy to proceed with the interview section immediately, if that is okay.\n\nSPAM ACCOUNT:\n\nBefore we proceed, I need to confirm the verification code provided to you by the recruiter?\n\nME:\n\nThe verification code is: DOC-101\n\nSPAM ACCOUNT:\n\n(DOC-101 Verified) Let’s proceed, Welcome to GovCIO! I believe you are ready to proceed with the job briefing and interview. As we move forward, you will gain a deeper understanding of the open positions.\n\nIt's a pleasure to meet you. Please note that your timely responses are highly appreciated throughout this process.\n\nME:\n\nThank you. It is a pleasure to meet you as well. Do I need to call?\n\nSPAM ACCOUNT:\n\nNo\n\nTo begin, could you please introduce yourself by providing your full name, sex, and location?\n\nSPAM ACCOUNT:\n\nHave you participated in online interviews previously?\n\nME:\n\nYes, I have participated in a few online interviews previously.\n\nSPAM ACCOUNT:\n\nAlright, I will brief you on the open position and our company. You will receive our company's job briefing document shortly. Please review it thoroughly and confirm once completed, so we can proceed to the next steps.\n\nIn preparation, I encourage you to visit our website at \\[GovCIO page link (Legit)\\]. Please take approximately three minutes to review the site and learn more about our organization.\n\nOnce you have completed this task, kindly let me know, and we will proceed with the briefing.\n\nME:\n\nNo problem at all, I will do that now.\n\nI have completed the task.\n\nSPAM ACCOUNT:\n\nJob Description:\n\nWe are seeking a highly skilled Data Entry/Administrative professional to join our team. The successful candidate will be responsible for:\n\nHeavy data entry and administrative tasks\n\nUpdating client information in our computer system\n\nRunning and processing multiple documents utilizing Microsoft Word, Excel, and Access\n\nInputting purchase orders and performing various administrative tasks\n\nEntering information from multiple sources into a computer database\n\nPotentially taking customer orders and entering them into a tracking system\n\nSPAM ACCOUNT:\n\nThis is a remote-friendly position, allowing you to work from home. Alternatively, if you prefer an office setting, we can discuss relocation options.\n\nSPAM ACCOUNT:\n\nWe offer both part-time and full-time positions:\n\nPart-time: 20 hours/week (overtime up to 30 hours/week)\n\nFull-time: 30 hours/week (overtime up to 40 hours/week)\n\nSPAM ACCOUNT:\n\nThe hourly rate is $30-35, depending on your skill level.\n\nSPAM ACCOUNT:\n\nCan you handle the job duties and responsibilities outlined above?\n\nME:\n\nYes, I can handle the duties and responsibilities outlined above.\n\nSPAM ACCOUNT:\n\nAs part of your onboarding process, you will participate in a two-week online training program from the comfort of your own home. This training will be conducted via video conference with your designated training supervisor.\n\nDuring this training period, you will receive a compensation rate of $15.00 per hour.\n\nIn terms of your work schedule, you will have the flexibility to set your own hours and choose between full-time and part-time arrangements. Our company offers flexible working hours to accommodate your needs.\n\nSPAM ACCOUNT:\n\nIs this arrangement acceptable to you?\n\nME:\n\nYes, this arrangement is acceptable to me.\n\nSPAM ACCOUNT:\n\nRegarding the work from home situation, if I wanted to come to the office to conduct work a day or two a week, where would be the nearest location I could do that?\n\nSPAM ACCOUNT:\n\nOur head office is in VA, but this is actually a remote job position.\n\nME:\n\nOkay, that’s no problem at all. I am happy with that.\n\nSPAM ACCOUNT:\n\nJob Requirements:\n\nTo be considered for this position, please confirm that you meet the following requirements:\n\nCitizenship: U.S. Citizen, Canadian Citizen, or Green Card Holder\n\nLanguage: Fluent in English (written and verbal communication)\n\nBackground: Clean criminal record\n\nTyping Speed: Minimum 35 words per minute (wpm) average\n\nSoftware Proficiency: Microsoft Office\n\nOrganizational Skills: Strong organizational abilities\n\nSPAM ACCOUNT:\n\nDo you meet all of the above requirements?\n\nME:\n\nYes, I meet all of the following requirements.\n\nSPAM ACCOUNT:\n\nOk good, Let's begin the interview session. Kindly pay attention to the questions I will ask you.\n\nI will now ask you a series of questions. Once you have answered all questions, please indicate \"Done\" to proceed. Shall we begin?\n\nME:\n\nYes, we can begin.\n\nSPAM ACCOUNT:\n\nInterview Questionnaire:\n\nTo better understand your qualifications and preferences, please answer the following questions:\n\nCould you provide a brief overview of your background and experience?\n\nWhat methods have you used to secure your previous positions?\n\nWhat types of roles have you held in the past?\n\nDo you have any prior military experience?\n\nAre you currently employed?\n\nWhat motivates you in your career?\n\nAre you seeking a full-time or part-time position?\n\nWhat is your typing speed (words per minute)?\n\nDo you have experience using Microsoft Excel?\n\nWhat is your highest level of educational attainment?\n\nWhen did you receive your highest diploma?\n\nHow long do you intend to work with our company?\n\nWhich postpaid network provider do you use (AT&amp;T, Verizon, or Sprint)?\n\nWould you prefer to receive payment on a weekly or bi-weekly basis?\n\nDo you have a credit card? If so, what is the credit limit?\n\nWhat is your credit score?\n\nWhat payment method do you prefer: direct deposit, check, or wire transfer?\n\nWhich bank do you use, as we need to verify compatibility with our company's salary payment account?\n\nME:\n\n(No response to the questions yet.)\n\nSPAM ACCOUNT:\n\nDear Silly Butt\n\nI am impressed with your performance during our Q&amp;A session. If you are selected to join our team, you will receive a payment to facilitate the setup of your home office.\n\nThis payment will cover the costs of purchasing necessary accounting software, shipping logistics, and other office equipment. Please note that our company will also be sending you additional equipment.\n\nThe Head Department of our company will be responsible for issuing the payment, which will enable you to acquire all the necessary software and office equipment to commence work.\n\nCan we rely on your full trust, commitment, and diligence in this role?\n\nME:\n\nAll sounds great! Yes, you can.\n\nSPAM ACCOUNT:\n\nThat is good. You have done impressively well answering all my questions. I need to forward our conversation to the company head department to enable them to see if you are qualified for the job. If being considered to join company’s team. I will have your W-4 form sent to you. This will conclude our meeting for now, I need you to contact me by 6:00pm est later today. have a good day ahead.\n\nME:\n\nIs there anyway I can call to discuss a few details?\n\nSPAM ACCOUNT:\n\nYou can write me on here\n\nYou will be called only during and after your interview section.\n\nME:\n\nI would like to stop the process. I have been offered another position.\n\nSPAM ACCOUNT:\n\nAlright.\n\nME:\n\nCan I request a phone call to verify the validity of the opportunity?\n\nSPAM ACCOUNT:\n\nWell, there is a number you can reach on the company site given to you. Like I told you earlier you are going to have a call from your training supervisor during the training process.\n\nIf you would like to withdraw your application now you let me know before your consideration.\n\nME:\n\nI'm sure you understand that there are scams designed to target vulnerable people who are desperate for work. I've experienced 1 too many red flags during this process. I only need a very brief phone call to verify the validity as I am excited about this opportunity, but do not want to fall victim to a clever scam.\n\nSPAM ACCOUNT:\n\nI understand but this is not a scam if it's about the check mailing they can be another process whereby the equipment for you to work will get to you. You don’t have to be skeptical about us.\n\nME:\n\nHow can I be sure that this isn’t a scam? I need more reassurance.\n\nSPAM ACCOUNT:\n\nYou can withdraw if you don’t trust the process Silly Butt\n\nYou will be receiving your offer letter soon it’s been processed.\n\nME:\n\nI do trust the process, but I need help understanding what: 'Valiant Integrated Services', 'AECOM', and 'Deloitte' represent. Can you elaborate on what this means?\n\nSPAM ACCOUNT:\n\nThose aren’t my companies. There is a mix-up I guess.\n\nME:\n\nI spoke with Ronald and he said it shouldn't be an issue to speak with you all directly. Do you know him?\n\nSPAM ACCOUNT:\n\nYou shouldn’t call me without my approval.\n\nWho is Ronald?\n\nYou’re mixing up the company.\n\nPlease I would be pleased to have you withdraw your application with GovCIO because you seem to be over sensitive and skeptical about this.\n\nME:\n\nI apologize, I don't mean to be skeptical.\n\nRonald Fog said it wouldn't be an issue to call in. Is he not associated with you or the company?\n\nSPAM ACCOUNT:\n\nWhere did you speak with him?\n\nI’m sorry but I need you to provide me the conversation you had with him.\n\nGet done with your research and let me know if you are withdrawing Silly Butt.\n\nME:\n\nI emailed him directly a few hours ago and he said the company should have no issue with calling employee prospects to provide more information. Is this not correct?\n\nSPAM ACCOUNT:\n\nSend me a screenshot of the email.\n\nThere is no Ronald Fog that works for GovCIO.\n\nME:\n\nDo you know Ronald Fog at all? Is this a fake email message?\n\nSPAM ACCOUNT:\n\nYou are going through fake research.\n\nYour Employment Confirmation Letter has been sent to your email address. Please check your inbox and spam folder for the email.\n\nOnce you receive the letter, kindly review it carefully, print, sign, and scan it. Please return the signed document to me via email for confirmation purposes.\n\nThank you for your prompt attention to this matter.\n\nSPAM ACCOUNT:\n\nAs the next step, we require you to complete our company's onboarding form. Please find the link below:\n\nEnsure that you upload all required information clearly and accurately.\n\nCongratulations on your new role, and we look forward to welcoming you to our team!\n\nME:\n\nI have received the email.\n\nME:\n\nThe link you provided says unavailable. Beg...\n\nSPAM ACCOUNT:\n\nDon’t try outsmarting yourself.\n\nME:\n\nWhat do you mean?\n\nSPAM ACCOUNT:\n\nThat link is valid. Other employees used it, why is it unavailable for you?\n\nClick on it and it will redirect you.\n\nME:\n\nI receive this when I click on it? \\[inserted fake 404 error page\\]\n\nSPAM ACCOUNT:\n\nLol.\n\nI think it’s time to cancel your application.\n\nHave a great day.\n\nME:\n\nAre you proud of scamming people?\n\nSPAM ACCOUNT:\n\nGo ask your forefathers.\n\nME:\n\nWhy? I can just ask you? Or are you too much of a coward to speak for yourself?\n\nCat got your tongue?\n\nOr do you need to run your replies through AI first?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1i98ph8/scam_invitation_to_interview_with_govcio_scam/",
      "comments": []
    },
    {
      "title": "Rejected from Deloitte after failing an obvious question",
      "body": "I always practice extensively for my interviews. I even compiled a master document with hundreds of questions I can practice from when the time comes, yet I have never encountered this one question that seems embarrassingly easy in retrospect. \n\n\"“Is It Better to Be Perfect and Late or Good and On Time?\" or \"Would you be willing to miss a deadline if meeting the deadline meant compromising on the quality of the finished project?\" something along those lines.\n\nI said that it would depend and that I would ask the boss and learn what the cultural norm is at Deloitte in that situation. I said if its only a little bit late then I would. I've since learned, in case you didn't know, the correct answer is to be good enough and on time. That's at least what my research tells me. Others say some company cultures may allow the \"it depends\" answer but clearly not Deloitte\n\nReally bummed about this because it felt like the interview went super well and I thought I had it in the bag. And it seems like a really easy question lol. This is a new grad Accounting role and although I'm older I have the experience of a new grad, so it was exciting for me. Im getting too old to apply to new grad roles but I dont have the experience to go beyond them. But hey, we move.",
      "subreddit": "jobs",
      "score": 10,
      "url": "https://reddit.com/r/jobs/comments/175yl52/rejected_from_deloitte_after_failing_an_obvious/",
      "comments": [
        {
          "body": "No loss for you. Deloitte, like all members of the big 4, is not a worth it company. The crunch and unpaid over hours are signs of a terrible workplace. Imagine working 2 jobs and getting paid only for one.\n\nAlso, this type of questions shows a job that is not for adults, but for kids. Adults do not have to ask each other shit like this.",
          "score": 28
        },
        {
          "body": "It is actually a great question because it just revealed what a BS work ethic they have at the company.\nA better employer would expect the best work possible, and in return treat their employee the best way possible. You absolutely dodged a bullet with this one.",
          "score": 10
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "ah",
          "score": 1
        }
      ]
    },
    {
      "title": "Offering a free Java session for beginners and folks switching from other tech stacks",
      "body": "Hey folks,  \nI’ve been working as a Java developer for over 4 years now, and I’ve managed to crack interviews at companies like Deloitte, PwC, TCS, Infosys, Virtusa, etc.\n\nI’m planning to conduct a **free online session** for:\n\n* People coming from **non-Java backgrounds** who are looking to switch to Java\n* **Students** who want to learn the **basics of Java** and understand how to get started\n\nThis won’t be useful for those already working on Java projects — the session is aimed at beginners and folks looking to make a transition.\n\nI'll cover fundamentals, how to approach learning Java effectively, and also share some real-world tips that helped me during my interview prep and on the job.\n\nIf you're interested, just comment below or DM me, and I’ll share the session details once finalized.\n\nHappy to help anyone who's serious about getting started with Java! 😊",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1kn2bed/offering_a_free_java_session_for_beginners_and/",
      "comments": []
    },
    {
      "title": "Confused? ",
      "body": "Scammed? Has anyone ever worked for infinite computers Solutions- with Veteran Affairs deloitte? I have been contacted by their recruiter, they seem very pushy with getting me to interview and keep calling me. It feels  sorta  unprofessional something feels sketchy any advice or experience would be greatly appreciated! ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1i2hq2d/confused/",
      "comments": []
    },
    {
      "title": "What should i do? Quit Deloitte or not on the very first day of joining ",
      "body": "So basically i graduated from be last 3 months ago and was looking for a job in the software developer role but as you all know that the current market situation is very bad bad it's difficult finding a job .. So here the things i got an offer letter from Deloitte as a executive in Risk Strategy and transaction but my interview was based on sql so i asked the hr about the role she said that haven't u confirmed about ur role from the manager that took your interview and the manager itself didn't knew my role and asking me about the role what a fuss .. The maij point is accepted the offer letter and now i am feeling miserable because i was passionate about coding so is there any possibility to change role or department in Deloitte just after joining or should i just quit the job ...please anyone kindly help i feel so blank right now and miserable and don't understand what to do in this moment right now",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1f75knl/what_should_i_do_quit_deloitte_or_not_on_the_very/",
      "comments": [
        {
          "body": "Do you need money now?\n\nIf so… take the job… take the money… then in a bit, start to keep your eyes out for other opportunities both internally and outside the company.\n\nBeing able to operate from a position of strength (employed/financially stable) is always a better option.",
          "score": 3
        },
        {
          "body": "Quit",
          "score": 0
        }
      ]
    },
    {
      "title": "My story :)",
      "body": "\"Hey guys, here’s my story. I recently graduated from a university in Chandigarh, though I'm originally from Nagpur. I'm the kind of guy who’s into that David Goggins extreme mindset, always pushing myself, even in things I didn’t fully understand—but still managed to do well.\n\nLife has been pretty unfair to me lately. During placements, my professor promised me an 80k job at PGI Chandigarh. He made me do a ton of research work, only to ditch me during placement season, move to a different university, and stop answering my calls. Because of this, I missed out on good companies, and all that was left were a few sales roles and sketchy companies.\n\nTo make matters worse, I cleared the first interview I got. The job description was for a market strategy role, but they ended up giving me a cold-calling sales role instead. While my friends landed jobs at Deloitte, KPMG, and other great companies, I found myself stuck. But I pushed through, determined to give my best.\n\nNow, it feels like I've hit rock bottom. The founders at my current company are too rigid, with strange rules like wearing a grey shirt every day for no apparent reason. Plus, they don’t provide legitimate leads, just invalid or uninterested ones, yet they still put pressure on me to make sales. I’m only getting 1-2 leads a day, and it’s impossible to perform in this situation.\n\nAll I need is an interview at a decent company, big or small, where the founders actually make sense.\"\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ga8csr/my_story/",
      "comments": []
    },
    {
      "title": "CMV: Hiring Managers are the ones most obsessed with prestige",
      "body": "I just had this shocking experience where I interviewed for a job at Deloitte and the hiring manager went to US News rankings to check the university which was listen on my resume in front of me. I won't say the university, but this person then said \"oh, it's Top 50 so you met the standard.\"  Like, I know people say university prestige but it is really this much. Ofc, for like a job at McDonald's university prestige does not matter, but it seems like the better the job pays, the more that prestige matters?!",
      "subreddit": "jobs",
      "score": 17,
      "url": "https://reddit.com/r/jobs/comments/18hrt3k/cmv_hiring_managers_are_the_ones_most_obsessed/",
      "comments": [
        {
          "body": "I think that's more of a Deloitte and similar thing than anything else. I'm a hiring manager at a software company and don't give two shits about if you even went to college",
          "score": 14
        },
        {
          "body": "I've known plenty of state school kids that got jobs at big 4 firms prestige really only matters at mbb firms and investment banking.",
          "score": 9
        }
      ]
    },
    {
      "title": "Should I stay at current job or move back to big4?",
      "body": "I am currently work at a bank as fixed term contract. My boss and my team are nice, job is easy, good flexibility and pay is good. However everyone in the team is quite senior so sometimes I feel like I am the low level role in the team, like team assistant because I have arrange team meeting, team offsite etc…\n\nRecently I just got call from my old boss from Deloitte and she recommended me to go for job interview. Then I talked to the hiring manager and got a job offer from my old company. This will be manager level - higher level than before. Similar role to before but different department, I will have to build the new function and I will be on my own from beginning. I would expect they will hire more people if my job is too busy. It sounds like good opportunity but I am worried it is too much work and challenge for one person.\n\nI am not sure whether to stay or not. Current job is easy job, good team but fixed term, so I am concerned if I go on maternity leave and . My manager said she intends to keep me till 2025 however she can’t guarantee promotion, she said she will help me to have concrete plan to get there. I plan to have a baby soon and Deloitte has great maternity benefit (18 weeks pay, then when return to work, you can work 3-4 days and they pay you additional day). Deloitte would have better title - manager however they pay 5k less than my current job and I know it would be not much work life balance at least 6 months to a year. Although they have good flexibility. In addition, I don’t know if the manager is nice until I work there. He seems nice and flexible in the interview.\n\nIf I want to have kid soon, is it better to stay at more chilled job or move to a more challenging role but better maternity leave later? If too challenged, would this affect my ability to have kid (e.g. stress level)?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/14hguw9/should_i_stay_at_current_job_or_move_back_to_big4/",
      "comments": [
        {
          "body": "Big 4 has better health options and probably\nMaternity leave.",
          "score": 1
        },
        {
          "body": "No, take the job with Deliotte. \n\nThis is the obvious choice here. You have no ability to grow with the contract role, and you're settling because it's boring and safe.\n\nPut in your two-week notice with the contract role, and go back to Deloitte.",
          "score": 1
        }
      ]
    },
    {
      "title": "How’s your search going working in technology?",
      "body": "Job market for product\n\nHow is it going for product managers laid off this year?\n\nI was laid off in May and interviews were tough to get until November, but when I’ve had interviews I’ve had terrible questions from companies I would never consider and pay I would never consider and gone through multiple interviews at a company only to get no offer.\n\nI feel like these companies are either looking for unicorns or cheaper pay , I just don’t know anymore \n\nI’m tired and drained , keeping hope alive and praying for all of you going through this struggle too\n\nBackground:\n\n15 years of product management working at a senior level at these companies:\n\nNYSE\nDeloitte \nPwC\nATT\nE*Trade\n\nPray for me please, it’s been a lot",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/18c6a0g/hows_your_search_going_working_in_technology/",
      "comments": []
    },
    {
      "title": "What questions do freshers face in Deloitte Cyber Gurukul interviews?",
      "body": "Can anyone please tell me what was the actual questions are asked by Deloitte cyber gurukul program from a freshers.I have a interview on campus on Deloitte cyber gurukul program.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p3mf04/what_questions_do_freshers_face_in_deloitte_cyber/",
      "comments": [
        {
          "body": "Hey, I went through the Deloitte cyber gurukul process last year. They mostly focus on basic networking concepts, some cybersecurity fundamentals, and general problem-solving scenarios. Nothing too crazy technical for freshers - they're more interested in your learning attitude and communication skills\n\n  \nGood luck with the campus interview!",
          "score": 1
        }
      ]
    },
    {
      "title": "Don’t sleep on the HireVue interview! I landed a Deloitte internship off mine as a first-year (no GPA, no referrals)",
      "body": "Hey everyone, this subreddit helped me a ton, so I wanted to give back. I recently started a YouTube channel to share the advice I wish I had when I was applying. This post is based on a breakdown I did of how I prepped for my Deloitte HireVue, which helped me land an internship as a first-year student (no GPA, no referrals). That one interview ended up kickstarting my whole career, so I wanted to share a few things that helped me:\n\n🎯 **Why it matters**\n\nMy Deloitte team later told me they watched my HireVue together in a conference room, with popcorn. It ended up playing a big role in moving me forward. After doing more interviews, helping friends, and spending way too long figuring out what works, I’ve realized: it’s not about being perfect. It’s about being *prepared* and *intentional*. HireVue is often just the gatekeeper to a real human. And the AI stuff? Mostly overblown, it’s just analyzing what you say. They’re looking for someone who seems real, thoughtful, and easy to work with.\n\n✍️ **Top tips that worked for me**\n\n* Prep stories as bullet points (not word-for-word scripts) using the STAR method\n* Film yourself answering practice questions: it helps eliminate filler words\n* Don’t over-rehearse. Smile, pause, and take your time so you sound natural\n* Use ChatGPT/Glassdoor/Reddit to research common questions + time yourself\n* Adapt to the company vibe: casual? T-shirt. Finance? Buttoned up.\n\n🔍 **One thing I didn’t expect:**\n\nMost people overthink the tech or try to sound overly polished. But your mindset totally affects your delivery. That’s why I focused a lot on confidence, calmness, and clarity. Those show more than any fancy words or rehearsed answers.\n\n📹 **If you’re curious, here’s the full breakdown I made**:\n\n[How I prepped for HireVue and got a Deloitte internship as a first-year (YouTube)](https://youtu.be/Y4AW0H8v-w8)\n\nWould genuinely love feedback, especially if there’s something I missed or could explain better. Still early in this YouTube thing, just trying to keep it real and helpful. Happy to answer any questions too. Hope it helps 🙌",
      "subreddit": "interviews",
      "score": 10,
      "url": "https://reddit.com/r/interviews/comments/1l8bbrf/dont_sleep_on_the_hirevue_interview_i_landed_a/",
      "comments": []
    },
    {
      "title": "Interview experience with Deloitte USI",
      "body": "I recently had an interview with Deloitte usi.\nThe position was a support technical role- stated as analyst consultant. 2 years of experience \n\nHad 2 rounds, I don’t know how many rounds happen coz I was out after the second one.\n\n1st round was around 30mins, knowing about my background, projects I have worked with, skills questions asked were about python basics, sql, power bi. The interviewer gave me feedback on what areas to improve. Took his advice worked on power bi. \n\n2nd round got rescheduled once due to interviewers unavailability after 20 mins of waiting. After 4/5 days had the next interview. The interviewer didn’t seem interested, I was asked what was the most complicated SQL query I have solved after I told her I have worked with python in my last organisation with only using sql to fetch tables. I had no answer to it, how to optimize a sql query which I answered correctly, no other skills were asked , interview got over in 20mins, when I asked about anything she feels will be a area or concern or feedback, stated hr would get back to me.\n\n3 days latter got the rejection.\n\nHave been looking for job after 7 months of unemployment with no offers or interviews now it seems all hard.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1j6enf6/interview_experience_with_deloitte_usi/",
      "comments": [
        {
          "body": "Delliote is place you go to have all happiness, love, and joy sucked out of your life. You would have been in a never ending cycle of peer reviews and it would have driven you mad. Most people only go to one of the big 4 because it looks good on a resume, which never made sense to me because I haven’t met a lot of people that have come out with a sense that their skills actually increased.",
          "score": 3
        }
      ]
    },
    {
      "title": "Deloitte and KPMG group assessment interviews",
      "body": "What are they all about, how can I prepare adequately, and what type of questions do they ask?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1cxd644/deloitte_and_kpmg_group_assessment_interviews/",
      "comments": [
        {
          "body": "Group assessment interviews at Deloitte and KPMG are often focused on evaluating how well you work in a team setting. They might involve group discussions, case studies, or problem-solving activities. To prepare, focus on honing your teamwork and communication skills. Practice active listening, contributing thoughtfully to discussions, and collaborating effectively with others. Reflect on your past experiences working in teams and think about specific examples you can share during the assessment. Remember to stay calm and be yourself – these interviews are as much about how you interact with others as they are about your technical skills. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "Round two interview at Deloitte",
      "body": "I was drawing blanks during my technical interview, questions that I do know the answers to just weren’t coming to me. My outward expression was cool and calm but internally I was dying inside. I feel like I did good in the other interviews.\n\nMy recruiter told me that it would be two weeks until I hear back with an answer. Anyone have any similar situation? Am I doomed or is there hope?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/11zs32i/round_two_interview_at_deloitte/",
      "comments": [
        {
          "body": "I just finished my 3rd round interview 2 days ago. The first 2 were technical and the last one was behavioral. I'm not sure how long it will be until I hear back. Have you heard anything back yet?",
          "score": 2
        }
      ]
    },
    {
      "title": "Deloitte Audit &amp; Assurance Campus Placement",
      "body": "Heyy. Deloitte is coming to our campus for recruitment for Audit &amp; Assurance. The aptitude test is scheduled on 27th this month and if we pass the zest then we'll have group discussion and interview on 4th next month. I am very nervous and currently preparing for my semester exams that are starting from tomorrow. I was wondering if anyone can share any advice or any tips or their experience regarding the whole recruitment process. It is tough and how the interview works. ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ovec3z/deloitte_audit_assurance_campus_placement/",
      "comments": []
    },
    {
      "title": "Help",
      "body": "Hey folks,\n\nI’ve got an interview coming up for a role that’s all about executive-level data visualization in enabling areas for Deloitte.Has anyone been through something similar? \n•\tWhat was the interview process like (tech test, case study, presentation, etc.)? \n•\tDid they focus more on tools (Power BI/Tableau/SQL) or more on storytelling &amp; exec communication? \n•\tAnything you wish you knew before going in?\n\nAny advice or personal experiences would help a ton. Thanks in advance! 🙌",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n331bo/help/",
      "comments": [
        {
          "body": "From what I've seen with Deloitte, expect a mix: a case study or tech test is common. They generally value your ability to turn complex data into simple narratives, so storytelling and exec communication usually weigh heavily. Brush up on your tech skills (Power BI, Tableau) but definitely be ready to discuss how you can translate data into actionable insights for strategic decisions. Good luck!",
          "score": 1
        },
        {
          "body": "They lean heavily toward the storytelling and communication side since you'll be presenting to C-suite audiences. Expect a case study where you'll need to transform messy data into a compelling narrative that drives business decisions - they care less about your ability to write complex SQL and more about whether you can distill insights into actionable recommendations that executives actually want to hear. The technical test usually covers intermediate skills in their preferred tools, but the real make-or-break moment is demonstrating you understand the difference between showing data and telling a story with data.\n\nThe biggest mistake candidates make is getting too deep in the technical weeds when Deloitte wants to see you think like a consultant who happens to use data visualization tools. They'll throw curveball questions about handling conflicting stakeholder requirements or explaining complex analytics to non-technical executives, so practice translating technical concepts into business language. The interview process often includes a presentation component where you'll defend your visualization choices and explain your thought process - this is where they separate candidates who just make pretty charts from those who can influence executive decision-making through data.\n\nI'm on the team behind [interviews.chat](http://interviews.chat), and we built it specifically to help with these kinds of complex interview scenarios where you need to think on your feet and articulate technical concepts clearly.",
          "score": 1
        }
      ]
    },
    {
      "title": "Deloitte interview for Automation Consultant role | \"Interview In-Progress\" Status",
      "body": "Myself -4 YOE, Automation Testing Consultant\nI gave my first rounds of interview on Aug23rd and followed by second round Interview by Aug 28th ..but still no updates from them..\nStatus in Portal shows \"Interview In-Progress\"..I mailed them and called them but no response..My LWD is Sept 15th and my joining date in another MNC is 22th Sept.. here this MNC offers less hike.and I like to join Deloitte..I m confused and what shall I do? Anyone interviewed for the same role recently? Or anyone faced this situation..how to tackle this?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n95swo/deloitte_interview_for_automation_consultant_role/",
      "comments": [
        {
          "body": "Yeah, this situation's pretty standard. With HR often swamped, delays happen. Keep the other offer as a safety net, but maybe reach out to the hires' manager or the team on LinkedIn for a nudge. Don't hold all on Deloitte; momentum's key in your career progression. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "Disheartened by Deloitte usi response: interview went well",
      "body": "I (Male) graduated with bca in '24. This year I applied for NLA. I gave exam on 29th Jan. Interview on 14th Feb. And to be honest the exam as well as the interview was very easy. 90 min exam completed in 60 min containing maybe a total of 55 aptitude, reasoning and computer fundamentals. 2 coding questions were there very basic level. In the interview she asked me for introduction, project work and other hr related questions. I replied very fluently. \nYesterday I got mail that they are not ready to move with my profile. I mean agar lena hi nahi to itna sab kuch karke kya fayda.\nExperienced similar with Womenture in the past (Sept'24 to Nov'24). Fed up with these behaviour.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1iyiaoi/disheartened_by_deloitte_usi_response_interview/",
      "comments": [
        {
          "body": "Keep pushing forward—one rejection doesn’t define your worth.",
          "score": 1
        },
        {
          "body": "I have been waiting for atleast a 25 days for there results. Still no email. How much time they take",
          "score": 1
        }
      ]
    },
    {
      "title": "Anxious, Technical round interview at deloitte",
      "body": "So this will be the first round of interviews for a Document Review Services role. They told me that this is a technical round but no clarity on what things i should be prepared for. This is an online interview with a 30min duration. \n\nThis is my very first time that i am being interviewed for a big company and that's getting me nervous because I feel i somehow will be very underpreped  for what's to come. \n\nI recently graduated in may so this is a role for a fresher. I have given interviews and some of them did convert to job offers which i did not end up taking and honestly i was still not that prepared for them but i never felt anxious because these were not big names. \n\nSo in my head I feel the standard of there interviews is going to be much higher and i would really like to have tips to be able to bag this one. ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1fx5qpn/anxious_technical_round_interview_at_deloitte/",
      "comments": [
        {
          "body": "Deloitte's technical round for a Document Review Services role will likely cover your understanding of document management systems, data analysis, and attention to detail. They're not expecting you to be an expert – they know you're a recent graduate. Your fresh perspective and willingness to learn are valuable assets.\n\nPrepare by reviewing your coursework and any relevant projects you've done. Practice articulating your problem-solving process and how you approach tasks methodically. Big companies like Deloitte are looking for potential and adaptability as much as technical skills. You may also want to review common [Document Review Analyst interview questions](https://www.interviews.chat/questions/document-review-analyst) to get a better sense of what to expect.",
          "score": 1
        }
      ]
    },
    {
      "title": "Need help - Deloitte Enabling Areas : UI ReactJS Developer Interview Prep",
      "body": "I am a ReactJS developer with 2+ years of experience. I have a interview scheduled for the role of Reactjs developer at Deloitte, the job title is Enabling Areas: UI ReactJS Developer. Need all your inputs and concepts to prepare for the interview. If you can share any interview experience for the same role will be much appreciated.\n\nThe concepts I should more focus on.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/16ec4gm/need_help_deloitte_enabling_areas_ui_reactjs/",
      "comments": []
    },
    {
      "title": "Have any of you applied for Deloitte Informational technology Services[ITS], internships or full-time, and given the interview?",
      "body": "Could you elucidate the whole interview process?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/61dm9b/have_any_of_you_applied_for_deloitte/",
      "comments": []
    },
    {
      "title": "Feeling miserable after failing in interview today",
      "body": "I'm a 2024 CSE graduate from a tier-2 college. During college, I received an offer from Deloitte, but I had reject it. I wanted to a developer role even if it meant earning less because I really like coding and building things.\n\nUnfortunately, COVID disrupted my studies for two years, and I couldn’t focus much. My GPA dropped below 7 (I have 6.88), which made me ineligible for many companies right out of college.\n\nStill, I’ve worked hard to become a good developer. I’ve built several projects, learned the MERN stack, solved over 400 DSA problems (I’m confident with medium-level questions), and picked up languages like C++ and others during college.\n\nI’ve attended a few interviews. Some HRs ghosted me. I was rejected in the second round at Amazon once, and in a behavioral round another time. Recently, the rejections have been piling up.\n\nToday was especially disheartening. I was rejected because I couldn’t solve some aptitude questions questions I didn’t expect for a software developer role. They didn’t even care about my technical skills or the effort I’ve put in. Just dismissed me.\n\nIt’s been 1.5 years of job hunting. I apply to companies daily. Most don’t respond after resume screening. No one wants to take a fresher with zero experience, no matter how much I’ve learned or built.\n\nI feel miserable. I’ve learned a lot from past rejections, but this one hit differently. It’s hard not to feel hopeless.\n\nRight now, I have no idea what to do. I feel completely lost... I was on the verge of crying after today’s interview. It just broke me.\n\nI don’t know what I expect from this post. Maybe just sharing my feelings will help me feel a little less alone.",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1njbfse/feeling_miserable_after_failing_in_interview_today/",
      "comments": [
        {
          "body": "Don’t let GPA or one rejection define you. You’ve built good skills (MERN, 400+ DSA problems, projects), that’s a strong base already.\n\nAt this stage, focus on smaller companies and startups, they care more about what you can build than grades. Highlight one solid project in your resume/portfolio with a clear demo or GitHub link.\n\nGet any kind of real-world experience, even freelance or short-term contract work. A couple of small gigs look better than “fresher, no experience.”\n\nAlso, practice timed aptitude and mocks since that’s what tripped you. Even 30 minutes daily makes a big difference in performance under pressure.\n\nMost importantly, keep applying, but also network, alumni, LinkedIn, coding communities. A referral will get you past resume screens faster than cold apps.\n\nYou’ve done the hard part learning. Now it’s about strategy and persistence. You’ll land something.",
          "score": 2
        },
        {
          "body": "What a downer today, but honestly, don't focus on the aptitude of that rejection, it was stupid. Something similar happened to me with a position that I really wanted and they eliminated me for a super stupid behavioral question that had nothing to do with what I was going to do. My best advice is to stop applying to large companies for now and stop focusing only on the technical if you already have 400 DSA problems solved, because you already show that.\nNow it's time to change your strategy: dedicate the next two weeks to aggressive networking on LinkedIn. Find software engineers or team leaders from medium-sized companies that you like, send them a direct message saying: \"I'm a recent graduate, I love what you do with [mention a specific project or technology of theirs], I would like to know what it takes to join your team.\" I swear, 90% of worthwhile jobs for juniors are found by talking directly to engineering people, not HR. You have the stack and the claw, now you just have to skip the application queue.",
          "score": 2
        }
      ]
    },
    {
      "title": "Consulting position at deloitte lux",
      "body": "I had my interview with partner on 17 June, until now didn’t hear anything back from HR despite sending polite reminder. It’s been 3 weeks now. Is it normal with interviews given during summer in Luxembourg. Also the portal is still showing “collecting the feeback”. Has anyone gone through the similar thing before, need your suggestions please.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mna7ho/consulting_position_at_deloitte_lux/",
      "comments": [
        {
          "body": "Yes, the post-interview delay, especially during summer and in large firms, isn't unusual. HR and partners often take longer to consolidate feedback and make decisions. The \"collecting the feedback\" status usually means they're still gathering inputs from various interviewers. Since you've already sent a polite reminder, I'd recommend giving it a few more days. Meanwhile, keep preparing by reviewing common case interview frameworks and behavioral questions relevant to consulting.\n\nSometimes, practicing with AI-based mock interview platforms can help keep your skills sharp and reduce anxiety during this waiting period. Stay proactive and use this time to refine your strategy—it often pays off when offers come through!",
          "score": 1
        },
        {
          "body": "Waiting 3 weeks, especially in summer, isn’t unusual, unfortunately. HR processes can slow down due to vacations and internal approvals. The \"collecting feedback\" status suggests they’re still deliberating, so patience is key. That said, it’s good you sent a polite reminder already; you don’t want to appear pushy by over-following up. In the meantime, keep prepping and maybe try mock interview practice or refining your pitch. When you do hear back, ask for feedback regardless of outcome—that helps for future rounds. If you want structured prep, some platforms offer AI mock interviews that adjust to your role and provide detailed feedback, which can really boost confidence for next interviews.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview",
      "body": "Two weeks ago, I completed a 30-minute final round interview with a Partner at Deloitte. Leading up to it, I was strong enough it seems, only one day after both my HR and technical interviews, I was moved to the final round, which I saw as a promising sign.\n\nThe Partner focused heavily on behavioral and passion-related questions, with two technical ones included. While I answered confidently and articulated my responses well, I later realized that one of my technical answers was incorrect. Still, I maintained composure and continued to engage confidently throughout the interview.\n\nThe Partner challenged me extensively, pushing me to my limits. I responded thoroughly and with assurance, and at times received nods and slight smiles—possibly signaling a positive impression. Toward the end, they invited me to ask questions, which I did, and they concluded by saying I would hear back soon, without me having to prompt.\n\nHowever, it has now been two weeks, and the application portal still says “Collecting feedback following your interview.” I sent a polite follow-up but have not received a response yet. The overall experience left me with mixed feelings.\n\nFor those who have been through this process: what do you make of this? What are the typical timelines and indicators at this stage?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mhgqd8/interview/",
      "comments": [
        {
          "body": "Cooked . L",
          "score": 2
        },
        {
          "body": "Delays at this stage are pretty common, especially with senior interviewers who may have tight schedules or multiple candidates to evaluate. Two weeks of \"Collecting feedback\" doesn't necessarily mean rejection; it often means decision-makers are still aligning. Since you had strong behavioral responses plus maintained composure despite the technical miss, you likely left a good impression. To stay proactive, use this time to reflect on your answers, identify areas to improve (especially technicals), and practice explaining the technical question you missed more confidently in case of follow-up. Also, keep a steady routine with mock interviews or question drills to stay sharp. If you want a place to simulate high-pressure interviews and get personalized practice on your weak spots, some AI-based platforms can help tailor mock interviews on demand—great for turning uncertainty into preparation.",
          "score": 2
        },
        {
          "body": "It sucks &amp; I feel you.  Just hang in there, it’s not over until it’s over! (Btw i think it’s totally f’d up that they don’t keep you in a loop especially after your follow up, given amount of time &amp; effort you put in)",
          "score": 1
        }
      ]
    },
    {
      "title": "30 Most Common Questions I get asked an Interview Coach",
      "body": "Hey, I've been an interview coach since 2013 and here's the 30 questions I get asked the most in paid sessions (thousands of them...)\n\nAny reference to my business or products has been removed, it's just helpful content I wanted to shared. **The worksheets are copyable Google Documents.**\n\nHappy to answer additional questions below , I am UK based and have helped people interview for most well known companies, though predominantly banking, finance and professional services. Roles vary from apprentices to senior managers, and I mainly attract clients from the UK, US and Australia.\n\nThe Questions;\n\n1. How do you research a company quickly?\n2. How do you research the job and what you'll do quickly?\n3. How do you stay up to date with recent industry news?\n4. How can you know what questions you'll get asked?\n5. What different types of questions could you get asked?\n6. How do you introduce yourself in the interview?\n7. What's the format of the interview going to be?\n8. How long should your answer be to each question?\n9. What are the most likely questions I could get asked in my interview?\n10. How much time should you spend doing what?\n11. How do you write great interview scripts?\n12. What stories should you use in your interview scripts?\n13. Does it matter if you repeat the same stories in your scripts?\n14. What's the best formula for answering interview questions?\n15. What's the best way to check your scripts for being readable and not having spelling, grammar and punctuation mistakes?\n16. How can you sound confident and not robotic and nervous when you're reading out your scripts?\n17. How can you shorten your interview scripts once you've written them?\n18. How can you memorise your interview scripts easily?\n19. What's the best way to practise for your interview?\n20. How can you prepare for an interview if you've never done it before?\n21. How can you make sure you look good in your video interview?\n22. You're an introvert and the thought of even recording yourself for a video interview fills you with dread. How can you increase your confidence?\n23. What should you do the night before an interview?\n24. What should you do the day of the interview?\n25. What are some useful tips when you're doing your interview?\n26. What should you do when you're asked a question you didn't expect?\n27. What are the best questions to ask an interviewer?\n28. What's an easy way to get interview feedback and see whether what I'm doing is right or not?\n29. How long should I wait to get a response to my interview and how should I chase it up?\n30. Should I write a thank you email after the interview?\n\nThe Answers:\n\n# How do you research a company quickly?\n\nMost people don’t bother to research a company at all. \n\nBut this is something you can do in as little as 15 minutes, that will really show someone you’ve put in the effort to show you care about the company\n\n1. Open up Google\n2. Type the company’s name into Google + “Facts” or “News”\n3. Use “CTRL + Left Click” on your mouse” to open the top 5 tabs. This opens new tabs while keeping your existing tab open.\n4. Scan each page to see unique facts about the company\n5. Have a separate document open and copy and paste 5 to 7 facts you find interesting\n\n**Types of Facts** \n\n* **Financials:** Profit, Loss, Revenue, %age up/down vs last year, buying other  companies, selling parts of the business, certain divisions that did better than  others \n* **Clients:** Famous clients \n* **Key events:** Products, Projects, Policies, \n* **Awards:** Industry, Community, In the UK or abroad \n* **Unique Language:** Google, Facebook, Apple, Core Values Ideals, Mission Statement \n* **White Papers:** Research, Being cited in the news, Consulting Papers - History: What are they famous for? \n* **Industry news:** Innovations, projects and ideas that have shaped the industry\n\n**Sources** \n\n* The companies “About Us/History” page \n* Annual or Quarterly report: Read the first few pages, the Chairman or CEO’s statement \n* Google News \n* Large News websites: BBC, Reuters, Wikipedia, Al Jazeera, RT, CCTV\n* Wikipedia: Use for sources rather than facts\n\n**===&gt;** [**Click here for “Why this company?” script template**](https://docs.google.com/document/d/18-qfEUYwDA_Mc3qkLkAyOnKWxjc81w5-1RhaN3ORvkg/copy)\n\n# How do you research the job and what you'll do quickly?\n\nYour interview is going to be based on the job description.\n\nSome companies provide great job descriptions which have:\n\n* A bit about the company\n* What the role involves\n* Day to day tasks \n* Key Skills\n* Bonus Skills (Not always)\n\nPrint a copy of the job description and have it to hand, so you can structure your answers around the things the company is looking for in that particular job.\n\nIf the job description is really vague, then just take the job description, put it into Google and find a job description from another company that’s helpful.\n\nThis will help you answer 4 key parts for a great answer:\n\n1. What does this role involve?\n2. What would you do day to day?\n3. What skills do you need to do this job well?\n4. What training would you receive?\n\n**===&gt;** [**Click here for “Why this role?” script template**](https://docs.google.com/document/d/1PPMMZzcMKnAW1_ivyy97ofP9m6WQJViw/copy)\n\n# How do you stay up to date with recent industry news?\n\nThe internet is full of specific industry news sites around different niches.\n\nFor example, if you’re looking to work at the Big 4 Professional Services firms (PwC, Deloitte, KPMG and EY) then you would check out [AccountancyAge](http://www.accountancyage.com).\n\nEvery industry has their own.\n\nJust open up google, and type “INDUSTRY + News Site” , and you’ll find a website that caters to your industry.\n\n**TIP:** Sign up to their mailing list, so you get weekly updates straight to your inbox.\n\nAlso, you don’t need to be an expert.\n\nJust have a basic understanding of the industry and the issues that it faces, and be able to speak competently and clearly on 1 or 2 issues.\n\nNow, more than ever companies also place a special emphasis on how technology is affecting how their industry does business.\n\n# How can you know what questions you'll get asked?\n\nIt’s rare that an interview will have more than 7 questions.\n\nWhy? Because 7 questions, with an average of 2 minutes to answer and 1 minute to think  = 21 minutes.\n\nMost video interviews have 3-5 questions.\n\nAs the longer each interview is, the longer it would take to deliver, and to analyse (whether that’s by a person or a robot, in the case of AI driven interview platforms like Hirevue)\n\nThis is especially true for 1st round interviews (i.e. the first interview you get with a company)\n\nThe general structure tends to be\n\n1. Tell me about yourself\n2. Why this company\n3. Why this role\n\nAnd then a few (probably no more than 4) competency or strength based questions, which come from the job description.\n\nCompetency questions are a chance to tell a story of an experience demonstrating a particular skill like teamwork.\n\nStrength questions tend to be more direct asking your opinion on something.\n\n**Competency Example:** Tell me about a time you led a team\n\n**Strength Example:** What does teamwork mean to you?\n\n# What different types of questions could you get asked?\n\nThere are 7 types of interview questions:\n\n1. Motivational (Why you/this role/ this company)\n2. Competency(Tell me about a time when… / Give me an example of…\n3. Strength (What does success look like?)\n4. SJT (A work based scenario and how you would respond to it)\n5. Commercial awareness (Tell me about a recent piece of business news)\n6. Technical (For roles that involve hard skills like trading and software engineering)\n7. Brainteasers (How many light bulbs are there in London? Common in consulting and some investment banking roles)\n\nThis list is arranged in order of most likely to least likely.\n\nIn my experience 80%+ of interviews only contain motivational and competency questions.\n\nStrength and SJT questions are increasingly common.\n\nCommercial awareness, technical and brainteasers are industry and role specific.\n\nThis is all based on good research of what previous candidates have been through.\n\n# How do you introduce myself in the interview?\n\nWe’re aiming for an answer that is:\n\n* Roughly 2 minutes long when spoken\n* Between 200 and 250 words written out\n\nNote: These are rough starting guides, not rules. Once you have completed a 1st draft you can make this longer or shorter as needed. 👍\n\n**🌟 The 7 Steps to a Great Intro 🌟** \n\n1. What are you doing now?\n2. Last 3 years?\n3. What do you want to do next?\n4. Work Experience?\n5. Voluntary/ Extracurricular\n6. Skills and Interests\n7. End with a Bang/ Curiosity Hook\n\nThe key to a good introduction in an interview is practising a good script with the parts outlined above.\n\nA rule of thumb is at least 5 times.\n\nIdeally this is also something you can do without having to look at notes.\n\n**===&gt;** [**Click here for a Personal Introduction Template**](https://docs.google.com/document/d/1BXjOhe8WRQDQqcYo6613rIVGg7Rp4pMO/copy)\n\n# What's the format of the interview going to be?\n\nInterviews can only really be 3 types:\n\n1. Face to face\n2. By phone\n3. By video\n\nVideo interviews now easily make up 70-80% of 1st round interviews.\n\nThey can be 1-way or 2-way.\n\n1-way is you sitting in front of the screen answering questions displayed on a screen.\n\n2-way is someone else on a video call, or a group of people (often called a panel interview) depending on the seniority of the job.\n\nFace to face interviews tend to be reserved for the final stage.\n\nFor a company they are the most time consuming and require a senior person to make the time in their schedule to fit in the interview.\n\nPhone interviews are increasingly less common, and tend to be used for first round interviews or “HR screeners” , basically where someone from human resources will call and quickly run through your CV to see if you're a good fit.\n\n# How long should your answer be to each question?\n\nIf you have never prepared for an interview before, you’re probably wondering two things:\n\n1. How long should my script be?\n2. How long should I speak for?\n\nThe answer is 200 – 250 words and 2 minutes.\n\nWhy? Because if you speak for faster than 125 words or longer than 2 minutes, we tend to find it’s either too fast, or too much.\n\n# What are the most likely questions I could get asked in my interview?\n\nThere are lots of different questions you can prepare for, but in our experience of helping candidates with 1,000’s of interviews. These 28 questions represent 80 - 90 %+ of the questions you’ll get asked in an interview.\n\nLearn to answer these and you will be massively ahead of the competition.\n\n**Common Motivational Questions**\n\n1. Introduce Yourself\n2. Why this Company?\n3. Why this Role?\n4. Why You?\n\n**Common Competency Questions** \n\n1. Tell me about a time when you resolved a conflict? \n2. Describe a situation where you worked as part of a team \n3. Describe a situation in which you influenced or motivated people \n4. Describe a time when you led a team \n5. Tell me about a time when you creatively solved a problem? \n6. What has been your greatest achievement? \n7. What do you expect to be doing in five years’ time? \n8. What are your strengths? \n9. What are your weaknesses? \n10. How would you describe yourself? \n11. What makes you the right person for this job? \n12. Give me an example of a time when you failed to hit a deadline? \n13. What was your biggest setback? \n14. Why did you choose your university, and what factors influenced your decision? \n15. Why did you choose your degree subject? \n16. Tell me about a time when you built up a relationship with someone? \n17. Tell me about a time you had to create multiple tasks? \n18. Tell me about yourself? \n19. Tell me about a time you had to handle a stressful or pressurised situation? \n20. Describe a difficult problem you had to overcome? \n21. Give me an example of a time you showed initiative? \n22. Tell me about a time you solved a problem in a new/innovative way? \n23. Give me an example when you had to manage your time and prioritise tasks? \n24. What do you think you need to be, to be successful in this job? \n\n# How much time should you spend doing what?\n\nTech Republic reported that 86% of 1st round interviews for top companies are by video.\n\nThe average time to prepare and submit for your interview is 5 days. \n\nThere are only three things you need to do:\n\n1. Research the questions.\n2. Prepare your scripts.\n3. Practise your answers.\n\nFor best performance you want to split your time like this:\n\n* Research (10%)\n* Scripts (40%)\n* Practise (50%)\n\nMost people will spend 70-80% of their time researching the questions and writing their scripts.\n\nThen the day before, or the day of the interview they have a mad dash to remember 30 pages worth of scripts, and feel their brain melt.\n\nThis is wrong. What do you do most during an interview?\n\nSpeaking.\n\nSo, you can imagine how researching and writing scripts doesn’t really help as much as practising would. You want to practise speaking your answers out loud as much as possible.\n\nIf you had 5 days to prepare.\n\n* Day 1 and 2 are spent researching and getting your scripts done.\n* Days 3 to 5 you will be practising your answers as you move from a full script you read out loud to bullet points and maybe even no script at all\n\n# How do you write great interview scripts?\n\n**I don’t like interview scripts.**\n\nFor me, most people spend far too much wasted time, writing pages and pages of scripts, and thinking of a different story to tell for 30+ random questions that they copied and pasted from the internet.\n\nA great interview script for me, and the clients I’ve worked with since 2013 is just 5-6 STAR Stories, that you can easily adapt and tailor to any competency question you get asked (this is where most people spend ages writing scripts)\n\nI like STAR stories, because they are stories you like, you want to talk about and make you look good.\n\n# What stories should you use in your interview scripts?\n\nPicking your STAR stories is going to form the basis of your interview answers. \n\nHere are some tips for finding the best examples for your STAR stories: \n\n* **The best examples are from work, and the worst are from your personal life.** Why? Because you are interviewing for a job, not telling a story at a house party. So there is an order in terms of where your stories should come from, as seen below:\n* **Start with the stories that put you in the best light.** The kind of things you’d love telling your friends and family about.\n* All your examples should have positive results.\n* **Choose 5-6 examples which you can clearly explain.** Pick examples you feel confident and happy talking about i.e. If you are not comfortable talking about work, then talk about volunteering.\n* **Once finished, pick one negative example**. You may get asked a question, which is based around you making a mistake, missing a deadline or having to change what you did. Choose an example where this has happened and then you put in the right course of action to correct that mistake. For example, perhaps you missed a deadline for a piece of coursework, and then next time you got more organised, drank less (ish) and actually scheduled time to study and ended up doing really well on the next piece of work\n\n# Does it matter if you repeat the same stories in your scripts?\n\nNo.\n\nThis is a super common mistake people make.\n\nMost people only have so many good stories.\n\nImagine a guy who's only had 1 job for 20 years. All his stories for interviews will revolve around that one job.\n\nYou want a bit of variety, but it’s no problem repeating the same story twice or even three times.\n\n# What's the best formula for answering interview questions?\n\nThis depends on the question, but each one can be broken down in a simple way.\n\n**Why this company?**\n\n* 5 Fast Facts\n\n**Why this role?**\n\n* What would you do in the job\n* What skills would you have\n\n**Competency questions**\n\n* STAR\n\n**Strength questions**\n\n* Direct Answer\n* STAR\n\n**Commercial Awareness**\n\n* Recent piece of microeconomic news\n* Simple facts and story\n* Your opinion if relevant\n\n# What's the best way to check your scripts for being readable and not having spelling, grammar and punctuation mistakes?\n\nThe spell checker for Word and Google Docs is fine, you don’t need to use much more than that.\n\nA good trick to improve readability is using [Hemingway](https://hemingwayapp.com/).\n\nIt’s a tool that writers use to simplify the language of what you’ve written.\n\nIdeally you want to aim for a 7th grade reading level (about the same as a 12 year old)\n\nWe actually use their AI tool function in the business as well. (but you have to pay for this)\n\nI also like to print off a piece of writing, and read it out loud.\n\nThat way I can check how it actually “sounds” , sometimes things can look good, but sound awful.\n\n# How can you sound confident and not robotic and nervous when you're reading out your scripts?\n\nPractice.\n\nIf you absolutely have to read a script it’s good to have BIG TEXT on screen (at least 20 point) and ideally have your answers summarised as:\n\n* Bullet\n* Points\n\nPeople who read a script word for word always sound robotic, and it’s pretty obvious if you’re watching it.\n\nYou could also use a [Teleprompter](https://cueprompter.com/).\n\nThis displays the words on the screen at a reading speed that suits you.\n\nIn exactly the same way that someone would read the news on the TV.\n\nBut, if you haven’t practised speaking your scripts out loud, you’re always going to sound robotic.\n\nNerves always get better with practice.\n\n# How can you shorten your interview scripts once you've written them?\n\nOnce you’ve written your script. Take the main points and put them into bullet points. \n\nI’d suggest no more than 6 bullet points per answer.\n\nThink of it like the “chapters” in the mini-story that you’re telling.\n\nAlso, it's useful to think about writing out the stuff you'd likely to forget; people’s names, dates, numbers and key ideas.\n\nThe trick is that every time you answer a question, it’s always going to be a little bit different, you’re going to miss something out.\n\nAnd that’s ok.\n\nYou want just enough notes, so you can reference them at a glance with ease.\n\nWhether that’s on the screen in-front of you.\n\nOr printed off and stuck on the wall, or around where you’re doing your interview.\n\n# How can you memorise your interview scripts easily?\n\nYou don’t.\n\nTrying to memorise scripts is a losing battle.\n\nA lot of people will take 10+ pages of scripts, and sit for hours mumbling under their breath treating it like it’s exam revision.\n\nWhat you want to do is to be able to tell good stories.\n\nIt’s easier to remember something that makes you look good.\n\nThe other problem with memorising scripts, is that if you get a question you don’t know, it will completely throw you off, and you’ll probably end up freezing up and fluffing your answer.\n\n# What's the best way to practise for your interview?\n\nAnswer as many random questions as you can in 20 minutes and record yourself.\n\nMost people don’t actually practise for interviews.\n\nThey spend almost all their time writing their scripts and then reading them out loud.\n\nYou want to spend as much time speaking out loud as possible.\n\nHere’s a simple way to practise which though highly uncomfortable will massively improve your performance in a real interview:\n\n1. Create a list of likely questions you could get asked\n2. Set a timer for 20 minutes\n3. Type in \"random number generator” into Google\n4. Put the numbers of questions into the fields (i.e. if you have 20 questions, let the generator choose a random number between 1 and 20)\n5. Start recording yourself on your phone\n6. Hit “Generate”\n7. Answer as many questions as you can in the 20 minutes\n8. Watch the recording back and see what you can improve\n\n# How can you prepare for an interview if you've never done it before?\n\nHere’s the stages you’re going to go through when you get an interview.\n\nYou wonder what questions they are going to ask you \n\n⬇️ \n\nYou research the questions \n\n⬇️ \n\nYou prepare scripts for the “WHY?” questions \n\n⬇️ \n\nYou prepare your STAR stories \n\n⬇️ \n\nMatch your stories to competency questions \n\n⬇️ \n\nYou practise \n\n⬇️ \n\nYou crush your next interview\n\nThe only difference with a 1st interview, is you want to front load as much time as possible on speaking.\n\nThe more interviews you do the easier it gets to just sound natural.\n\n# How can you make sure you look good in your video interview?\n\nTo look good in a video interview comes down to 5 things:\n\n* Know Yourself\n* Setting the Scene\n* Checking your equipment\n* Your internet Connection\n* Creating a peaceful environment\n\n**Know Yourself**\n\n1. Record yourself multiple times\n2. Answer questions and time how long you speak for\n3. Watch back your videos and self assess (before you do the real thing)\n4. Check your sound (too quiet, too loud, does it crackle?)\n5. Check for your volume, tonality, body language and facial expression\n6. Basically do you look happy and excited to work for that company?\n\nThis creates a checklist.\n\n7. Good eye contact looking at the camera (I know sometimes on laptops this is weird, don't stress, do what comes naturally to you)\n\n8. Make sure your face can be clearly seen\n\n9. Wear business dress\n\n10. Do you have good video and audio quality?\n\n11. Are you speaking slowly and clearly?\n\n12. Don't take longer than 3 minutes to answer a question (a generalised rule of thumb that makes in most but not all cases)\n\n13. Does it look like you are reading from a script (eyes off centre, going left to right, and sounding robotic - this is bad!)\n\n**Setting the scene**\n\nMake sure your background is:\n\n14. Clutter free\n\n15. Well lit\n\n16. Tasteful decor\n\n17. OR just blank walls\n\n**Checking your equipment**\n\n18. Sit at least 30cm away from the camera\n\n19. Is your picture clear?\n\n20. If you're using a phone make sure it's secured to a tripod (so it doesn't slide off or down if you nudge the table)\n\n21. If your sound quality is bad (crackly) buy a cheap microphone, or a headset\n\n22. Can we clearly see your face? Is the lighting ok?\n\n**Your internet connection**\n\nIf you share a house, dorms, or know you're internet can be bad then:\n\n23. Record during the day if possible\n\n24. Avoid evenings and weekends, if you are on a shared connection\n\n25. Conduct a speed test on the day \"Just Google 'internet speed test' \"\n\n26. A speed of less than 10Mbps (download) will compromise your video\n\n**Creating a peaceful environment**\n\nIf you think you may get interrupted, communicate with people you live with and:\n\n27. Put your phone on silent\n\n28. Let everyone know not to disturb you\n\n29. Close your windows\n\n30. Keep background noise to a minimum (other devices, fans etc.)\n\n# You're an introvert and the thought of even recording yourself for a video interview fills you with dread. How can you increase your confidence?\n\nSo, many people lack self confidence before interviews.\n\nHere’s a short and a long answer.\n\nThe short answer is… get out of the house and talk to people more.\n\nInterviews are basically about talking to strangers in English and answering questions. \n\nThe simplest way to grow in confidence is to do that more.\n\n**A lot of people who struggle with confidence though, are shy or introverted and want to find another way to do this, without leaving the house.**\n\nThat is possible.\n\nWhich leads me to the long answer.\n\nHere’s a step by step guide to improve self confidence in interviews if you are shy, introverted or lacking in confidence.\n\n1. Make a list of common interview questions you could get asked.\n2. Write out answers to the questions.\n3. Set a daily task of reading 3 answers out loud from your script.\n4. After 5 days start reading your script out loud from memory, but have your notes to hand if you forget what you’re saying.\n5. After another 5 days, shorten your answers to fit onto 1 index card per answer like below and start reading out your answers in front of the mirror. Try to make eye contact with yourself.\n6. Find someone you can practise with and give each other supportive feedback.\n\n# What should you do the night before an interview?\n\nDo everything in your power to make sure you get a good night’s sleep.\n\nNo other one thing will determine your performance more than being well rested on the day.\n\nSet a clear stop time for preparation, ideally no later than 8PM.\n\nDo something that helps you relax and doesn’t get you hyped up (like going out for a drink and dancing like a lunatic in a nightclub the day before.\n\nA hot bath.\n\nGood food.\n\nSomething nice to watch.\n\nWhatever gets you in the zone for the land of nod.\n\n# What should you do the day of the interview?\n\nAs little as humanly possible.\n\nWe’ve all got lives, and maybe you don’t have the choice about whether you can shut the world out until the interview.\n\nBut there is a strong case for mental fatigue based on the number of decisions you make each day.\n\nThe basic idea is you want to be as well rested as possible for your interview.\n\nSo, do as little as possible before.\n\nIf you’re having a face to face interview, get there early. Ideally by at least 30 minutes.\n\nIf it’s on phone or video, check your tech and make sure you’re all set up the morning of the interview.\n\nAnd if you have a choice when to interview, earlier is better.\n\nYou’re fresher, more well rested and sharper.\n\nThis also means avoiding email and your phone like crazy.\n\nDon’t sit there mindlessly scrolling, sending WhatsApp messages and refreshing your email.\n\nThat’s a sure fire way to feel brain dead once your interview comes.\n\n# What are some useful tips when you're doing your interview?\n\nHere’s a few simple bits of advice that can really help you:\n\n1. **SLOW DOWN.** If I had a pound coin for every time I said this to someone, I’d have super heavy pockets 😂. The slower you talk, the more time you have to think and the less mistakes you will make. When people are nervous they tend to speed up, and fudging up your interview becomes a certainty.\n2. **Listen to the question.** I’ve heard a lot of people go off on a tangent, or talk for 30 seconds and then go “Wait… what was the question?” , pausing for a few seconds before your answer is wise. A lot of people falsely believe that any “pause” means you will get marked down.\n3. **Speak your truth not theirs.** Many people will try and spend their time trying to fit their answers around what they think the interviewer wants to hear. Yes, you should mould your answer to the job description, but use examples and stories that you feel most comfortable talking about. Remember, if it bores you, then it will bore the person listening to you\n4. **It’s all practise.** Often people will put way too much pressure on themselves. Particularly if they haven’t done an interview before, or if it’s been a while. Just treat it as practise, it really helps people to relax, and they’ll often do much better than they hoped. \n\n# What should you do when you're asked a question you didn't expect?\n\nThis is most people’s big fear.\n\nCouple of things:\n\n1. If you prepared STAR stories (rather than individual answers) then just think what’s the most appropriate story to tell\n2. Repeat the question back to them e.g. They ask “ Can you give me an example of teamwork?” , you say “The time when I worked in a team was…” This gives you a few seconds to think on your feet\n3. Pause, if you need to, a few seconds to think will help.\n4. Ask them to repeat the question again if you are really struggling.\n5. Never be afraid to just be honest and say “Sorry, my mind's gone blank, can we come back to that question?” Better this, than rambling on.\n\n# What are the best questions to ask an interviewer?\n\nThe interview's over and the interviewer asks “Have you got any questions for me?”\n\nYou're probably thinking of asking something like:\n\n* When will I start?\n* How much will I get paid?\n* When will I hear the result of my interview?\n\nThat's not going to impress anyone.\n\nWhat's going to impress your interviewer is you asking a question about themselves where they can give an OPINION.\n\nEveryone loves being asked what they think.\n\nTry asking one of these 9 cool questions.\n\n* How did you end up working here?\n* What are you working on right now?\n* What’s the best piece of advice anyone has given you?\n* What’s the best advice for someone just starting work here?\n* What’s the most interesting project/client you’ve worked on?\n* What’s a common mistake you see new starters make here?\n* What’s something I can learn that would really help me on the job?\n* Have you got any articles or books you read recently that you think would be interesting?\n* If you could go back in time and give one piece of advice to yourself when you graduated what would it be?\n\n# What's an easy way to get interview feedback and see whether what I'm doing is right or not?\n\nPractice beforehand with someone who knows what they are doing.\n\nDon’t ask in the interview.\n\nA lot of people complain that they never get feedback, but honestly it’s a tough thing to do.\n\nImagine interviewing 10 people, say 1 gets the job.\n\nThat took half a day.\n\nNow , try calling 9 people to give them all personalised feedback.\n\nI don’t know about you, but some Monday’s I forget what I did at the weekend.\n\nLet alone how you interviewed 2 weeks ago.\n\nEmployers are under no obligation to provide feedback, so if you’re wondering, ask someone who has interviewed successfully recently.\n\nDon’t just ask anyone, as most people struggle to give constructive feedback, they tend to just fold and say “Yeah, you’re great” because they don’t want to hurt your feelings.\n\n# How long should I wait to get a response to my interview and how should I chase it up?\n\nIf you don’t hear back from your application/interview within 7 days, here's a simple follow up email you can send to find out what’s going on. \n\n**Email Template**\n\nDear &lt;NAME&gt; ,If not then…Sir/Madam, \n\nHope this email finds you well and I appreciate that you must be busy. \n\nI previously &lt;sent an application/ had an interview&gt; for a &lt;name of role&gt; at &lt;name of company&gt; on the &lt;INSERT DATE&gt; and just wanted to follow up and see &lt;if this position is still open?/when I will hear back the results of the interview&gt;? \n\nThanks so much for your time. \n\n# Should I write a thank you email after the interview?\n\nI don’t think it hurts.\n\nBut I also don’t think it makes much difference.\n\nPersonally I always think a bit of personal correspondence shows class.\n\nJust don’t use it to beg for a job.\n\nThat’s not classy.",
      "subreddit": "interviews",
      "score": 8,
      "url": "https://reddit.com/r/interviews/comments/1lfz6zf/30_most_common_questions_i_get_asked_an_interview/",
      "comments": [
        {
          "body": "This is genuinely solid advice from someone who clearly knows what they're talking about. The emphasis on practicing speaking rather than just writing endless scripts is spot-on - most people do spend way too much time crafting perfect answers on paper and then sound like robots when they actually have to deliver them. The STAR story approach is brilliant because it's way more efficient than trying to memorize 30 different responses, and those stories will naturally sound more authentic since they're actually your experiences.\n\nWhat really stands out is the practical stuff that people often overlook, like the video setup tips and the reminder to slow down during interviews. The question suggestions for the end of interviews are particularly clever - asking someone about their own experience gets them talking about themselves, which people love, and it shows genuine interest beyond just \"when do I start.\" The whole framework of spending 50% of your prep time on actual practice rather than research and writing is probably the most valuable takeaway here, even though it goes against what most people instinctively want to do.\n\nIf you're looking for help navigating these kinds of tricky interview questions and want to practice your responses, [interviews.chat](http://interviews.chat) can be a useful tool for getting real-time feedback and working through your answers. I'm on the team that built it, and we designed it specifically to help people get comfortable with the speaking part of interviews, which as this post makes clear, is where the real work happens.",
          "score": 1
        }
      ]
    },
    {
      "title": "Need help for Deloitte USI 1st round",
      "body": "Got a round 1 interview at Deloitteusi for ui ux design\n\nHey guys I need help!\nI got call for first round of interview after 6 months of my application and wanted to know how does the first round goes for a UI ux designer with 2+ years of experience.\n\nAlso they offered 6.5 fixed which feels quite low for the experience and Deloitte usi. Can anyone please suggest me how to prepare and negotiate?\n\nThe role listed 1-2 years of experience.\nLocation - Hyderabad \n\nAny help would be highly appreciated since I have the first round within 1 day🙏🏻",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1jcl7yg/need_help_for_deloitte_usi_1st_round/",
      "comments": [
        {
          "body": "For the first round expect questions about your design process, portfolio projects, and how you approach user-centered design. They'll likely ask about your experience with design tools, your ability to collaborate with developers, and how you handle feedback. Be ready to discuss specific examples of challenges you've faced and how you solved them. Prepare to showcase your problem-solving skills and your understanding of current design trends.\n\nRegarding the salary, 6.5 LPA does seem low for Deloitte USI and your experience level. During the interview, focus on demonstrating your value and unique skills. If they bring up compensation, express your enthusiasm for the role but also your concern about the offer. Research market rates for similar positions in Hyderabad and be prepared to discuss your salary expectations based on your experience and the value you'll bring to the team. If you're looking for help preparing for tricky interview questions, I'm on the team that made [AI interview prep](http://interviews.chat), which can help you practice and refine your responses.",
          "score": 1
        }
      ]
    },
    {
      "title": "What should i do?",
      "body": "Hi, \nI had the technical interview at Deloitte and it was so good and the manger was so positive to to have me in his team, after the interview i got email from HR said that they will contact me soon, it been 10 days and I didn’t received anything from them, is that okay ? I just cant stop thinking about it.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/x6nwhh/what_should_i_do/",
      "comments": [
        {
          "body": "Since it's been 10 days, I think it will be good to drop a follow up email saying it's been great to have an opportunity to interview and if they have an update for you. I wouldn't mind doing that than just waiting around for an update.",
          "score": 1
        }
      ]
    },
    {
      "title": "Aspiring AI Engineer |Aiming for Big 4 (Deloitte,PwC,EY,KPMG)",
      "body": "I'm currently preparing to land a role as an AI Engineer or Machine Learning Engineer in companies like big 4. Over the past year, I’ve built a pretty solid base in Python, machine learning, deep learning, and now more advanced stuff like AI agents, LangGraph, LangChain, RAG pipelines, and recently started diving into multi-agent systems using AutoGen.\n\nI’ve been building hands-on projects and staying consistent, but now I want to focus my prep toward the actual interview process. So if any of you are working in Big 4 or similar companies I’d genuinely love to hear from you. What kind of questions did they ask you during interviews? Was it more about ML theory, coding, or systems design? Did your projects matter, or was it more about DSA and CS fundamentals?\n\nAlso, how did you prepare? Any resources, mock interview platforms, or strategies you found helpful? I’m especially curious about what you wish you knew earlier or would’ve done differently.\n",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1m6907p/aspiring_ai_engineer_aiming_for_big_4/",
      "comments": [
        {
          "body": "Your technical foundation sounds solid, but Big 4 interviews for AI/ML roles are going to test you across multiple dimensions that go beyond just knowing the latest frameworks. These firms typically focus heavily on your ability to explain complex ML concepts in business terms, walk through end-to-end project lifecycles, and demonstrate how you'd handle real client scenarios. They'll ask you to break down your projects in detail - not just what you built, but why you made specific architectural decisions, how you handled data quality issues, what metrics you used to evaluate success, and how you'd scale solutions for enterprise clients. The coding portion usually involves implementing ML algorithms from scratch rather than just using libraries, so make sure you can code up things like gradient descent, decision trees, or neural network backpropagation without relying on sklearn or PyTorch.\n\nThe systems design component is where many candidates stumble because it requires thinking like a consultant who needs to solve business problems, not just a developer building cool projects. They want to see you design ML pipelines that can handle millions of records, discuss trade-offs between different approaches, and explain how you'd monitor model performance in production. Your projects absolutely matter, but they need to tell a story about business impact and problem-solving methodology. Practice articulating the \"so what\" behind each technical choice you made and be ready to defend alternative approaches they might suggest.\n\nI'm on the team that built [AI interview assistant](http://interviews.chat), which helps candidates navigate exactly these kinds of multi-layered technical interviews where you need to seamlessly blend ML theory, coding skills, and business acumen in real-time.",
          "score": 1
        }
      ]
    },
    {
      "title": "Partner Interview",
      "body": "Having an upcoming interview with the Audit Partner at Deloitte Australia. What questions can I expect? Thanks a lot!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1l9dnaf/partner_interview/",
      "comments": [
        {
          "body": "You can expect questions about why you chose audit specifically, what you know about Deloitte's values and recent market developments, and scenarios that test your judgment and problem-solving approach. Partners often ask about times you've shown leadership, handled difficult situations, or worked in teams, so have concrete examples ready that demonstrate these qualities.\n\nThe partner will also likely explore your career aspirations and how you see yourself growing within the firm, so be prepared to articulate a clear vision of your professional goals. They might throw in some challenging behavioral questions or even hypothetical client scenarios to see how you think on your feet. Since these conversations can take unexpected turns and cover complex situational questions, having a tool like [interviews.chat](http://interviews.chat) can be incredibly helpful for practicing responses to tricky partner-level questions and building confidence for these high-stakes conversations. I'm actually part of the team that built it, and we designed it specifically to help candidates navigate these kinds of challenging interview scenarios.",
          "score": 1
        }
      ]
    },
    {
      "title": "After several interview rejects finally gave my best one...and got selected",
      "body": "Got selected in Deloitte as Business tech analyst after so many interviews in different companies",
      "subreddit": "interviews",
      "score": 45,
      "url": "https://reddit.com/r/interviews/comments/ldqjbq/after_several_interview_rejects_finally_gave_my/",
      "comments": [
        {
          "body": "Congrats!! 🎉",
          "score": 2
        },
        {
          "body": "The same thing happened to me, after getting rejected by small startups, I got an offer from a big company. Congratulations!!!!!!",
          "score": 1
        }
      ]
    },
    {
      "title": "Valuations Job Interview in Dublin, Ireland",
      "body": "Hi Reddit! I have an interview lined up next week with Duff &amp; Phelps (Kroll) for job role in Dublin, Ireland. The job profile is Valuations. I am an Indian CA working in Valuations, Deloitte from past 3 years and I live in Delhi.\n\nThis is my first international interview and I am clueless as to what will be asked. Need someone who was in a similar position to help me out.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/sb03uy/valuations_job_interview_in_dublin_ireland/",
      "comments": []
    }
  ]
}