{
  "company": "disney",
  "post_count": 54,
  "exported_at": "2026-01-18T17:44:53.270Z",
  "posts": [
    {
      "title": "im willing to give up on my dreams (just to have health insurance)",
      "body": "I will start this off by saying the title honestly isn't as depressing to me as it sounds written out. Yes, im sad about it but I'm definitely at the point where I'm kind of ready to force myself to be an adult. I'm a 23F who graduated college in December 2022. I was the first in my household to do so and while my family were soooo excited to see what my future had in store I already knew in the back of my mind that my options were limited. I received my bachelor's in arts for an animation/game design degree plan and my school's animation program wasn't even complete for all 4 years that I attended. All of us in that building understood getting a job in art would be difficult and the teachers themselves were never too optimistic. Of course, I still tried to apply to as many art internships as possible before I did the graduation ceremony and months later all the rejections would pour in. I'm not in California and I don't have money to live or even fly there so I could never apply to all the cool Disney jobs my parents were so sure I could get (idk about that). For the entirety of 2023, I applied to every job in my area, most that just required a high school diploma and it was always radio silence or rejections after months of waiting. I had a single spell of luck and had 2 phone interviews for office secretary jobs which I was rejected for and then the cycle of silence and rejections returned. I applied to maybe 150 jobs over the year (which seems like a small amount compared to people in this sub). I already knew how hard it was for people to get jobs, especially after college, so I still had determination until my family started turning on me. Every single day I would get yelled at or questioned about getting a job, and I would always explain how many I'm applying to and how hard I'm trying but it would still end with the same lecture about how I will be 26 soon and I will lose my insurance. The health insurance guilt trip has been a huge source of my anxiety about finding a job for a while thanks to my parents. When I was a teen it was more annoying because I knew I wasn't close to 26 but now I'm 23 and will be 24 this year, so things are becoming more real. I can't just NOT have health insurance because I have heart disease, and I can't have subpar health insurance because I need something that can pay for heart surgery if I need another one. My mom and dad work the same government job with the same government health benefits and they've drilled into my head how important it is for me to have the same type of benefits. My latest application cycle has been all federal/local government jobs and so far I have a tentative job offer for a job that I can't see myself lasting in at all but there really isn't much choice for me.\n\n tldr; i wanted a job relating to art but ive been forced to look for jobs with federal insurance for my heart disease",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/198qgxi/im_willing_to_give_up_on_my_dreams_just_to_have/",
      "comments": [
        {
          "body": "You can have a side job of selling art.",
          "score": 2
        }
      ]
    },
    {
      "title": "What’s the deal with Disney and the WFH/Hybrid approach?",
      "body": "I’ve been interviewing for the past few months as a software engineer and the recruiters always tell me “are you willing to go to work on-site 4x a week if needed to”?\n\nI understand Bob Iger requested all employees to go back on-site starting March 1, 2023 but I’ve heard that most tech workers are still remote even up to this day. Some interviewers even told me that they have never been onsite. So what’s the deal here? Is it safe to say that purely onsite works isn’t enforced? \n\nI believe some locations even purposely downsized so going back to fully onsite is not physically possible.\n\nEDIT: lol honest question here being downvotes… have a nice day y’all\n\nEDIT 2: i meant i heard most DISNEY tech workers - not just all tech",
      "subreddit": "cscareerquestions",
      "score": 46,
      "url": "https://reddit.com/r/cscareerquestions/comments/1dq2yvj/whats_the_deal_with_disney_and_the_wfhhybrid/",
      "comments": [
        {
          "body": "I work at company that has similar setup. For first year when we were told to return to office it was not monitored and many people ignored it and stayed remote anyway or filed exceptions with reason of it's 1 hour  commute. Well after that 1st year, the company decided no that's no longer good enough exception and started doing badge tracking and keeping counts of how often you actually go to office. Now it's moderately enforced. I don't know if someone's been fired for it, but I do know my manager recieves reports of his team's days in office per week.\n\nFor company saying statement like that I'd assume they may be lax today, but may tighten up at anytime and you should be ready to either quit/come in 4x.",
          "score": 42
        },
        {
          "body": "&amp;#x200B;\n\n&gt;Is it safe to say that purely onsite works isn’t enforced?\n\nNo.  The role you are accepting is not 100% remote.\n\nThe recruiter is being 100% transparent that the role officially requires you to be onsite 4x per week.  If you want to take the gambol and assume it's 100% remote because people have so far ignored the request then that's on you.  You will get no sympathy from people if they start enforcing the rules at some point in the future.",
          "score": 81
        },
        {
          "body": "&gt;What’s the deal with Disney and the WFH/Hybrid approach?\n  \nI mean \"the deal\" here (and this isn't for Disney, it's for all companies wanting you to come in really) is you're either OK with it, or you're not OK with it\n  \nif you're OK then proceed, otherwise just decline the interview, you're not who they're looking for and vice versa, nothing wrong with that from either side\n  \nwhat they DON'T want is you say OK then later on you go \"actually... I'm not OK\" = waste of everyone's time",
          "score": 31
        },
        {
          "body": "Know someone who is there but is pretty high up. It’s only that way if you have the seniority and your team works that way. This team definitely isn’t so I would not expect to be remote, especially as a fresh employee.",
          "score": 2
        }
      ]
    },
    {
      "title": "Staff Software Developer at Disney, conflicted with the news of the move and lots of employees retiring and the huge salary quoted..",
      "body": "So I am usually not the person to work for a huge company I prefer small companies and startups, I do like some risk, but I was just recruited by Disney for a staff software developer role, that is a significant title and salary pump for me if the number online are anything to go by, and they seem to match what the recruiter said. But I am not very impressed by the news surrounding their \"Imagineering\" facility move from Burbank to Florida, with forced retirement and many employees being forced to move. Also I just don't want to be another cog in the wheel of a huge corporation, I want to have impact.\n\nWhat do you guys think?",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/udb9g6/staff_software_developer_at_disney_conflicted/",
      "comments": [
        {
          "body": "Why not interview -- and ensure you're interviewing them too -- and see what it might be like?",
          "score": 7
        },
        {
          "body": "Depends more on the org than the company. If you go and you find your org isn't doing meaningful work, just move to a new org within the company. \n\nAlso, as a staff SWE, you'll have significant influence over which work gets done. If it's not impactful work, go find better work to be doing lol",
          "score": 3
        },
        {
          "body": "A coworker of mine left for Disney and came back because it was “soul crushing”.",
          "score": 4
        },
        {
          "body": "Well hey, no income tax would be a pretty sweet incentive for me. If theyre offering stock comp as well disney is never a bad choice. Honestly being a staff level at a place like disney sounds amazing. You know your projects will get in front of millions of people and make others happy",
          "score": 6
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "with less staff the chance for you to have an impact increases.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewing for iOS engineer at Disney and need advice?",
      "body": "Does anyone know Disneys hiring process? I've built 30 iOS apps but I failed a programming test for another company the other day. Any advice on how to prep?",
      "subreddit": "cscareerquestions",
      "score": 11,
      "url": "https://reddit.com/r/cscareerquestions/comments/1oob53/interviewing_for_ios_engineer_at_disney_and_need/",
      "comments": [
        {
          "body": "Maybe you should tell us what went wrong with your last programming test. Did you start coding without asking enough questions? Did you implement the solution in a way that suggests you don't know fundamental data structures and algorithms? We're you unable to articulate your thought/problem solving process?",
          "score": 4
        }
      ]
    },
    {
      "title": "Do companies not bother to give you feedback at all after rejecting you?",
      "body": "Is it actually common for companies to have you go through phone and a couple onsite rounds and reject without giving any sort of feedback?\n\nIn fact upon being asked as to what was the feedback from the interviewers, you get a response saying “What kind of feedback are you looking for?” It took me by surprise and that too coming from a staff engineer at F500.\n\nI’m more curious cause I was able to solve all the coding challenges that were thrown at me though I did stump on a couple of theoretical questions. I’m fine being rejected. But at least knowing what went wrong shall be of immense help so one could work on in the future to avoid making similar mistakes",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/uculb6/do_companies_not_bother_to_give_you_feedback_at/",
      "comments": [
        {
          "body": "They gain nothing by giving you feedback.\n\nFirst of all, it takes up time of the recruiter and probably hiring manager. They’re busy people who have business objectives to focus their time on. Those don’t include coaching people they’re not going to hire. Recruiters in particular can be juggling many candidates at one time. Spending time writing and communicating feedback to candidates would add up. \n\nIt creates liability for the company if anyone says something that could be construed as illegal discrimination. \n\nFinally, a lot of candidates get angry or frustrated if they disagree with the reasoning. “Your coding skills were below par” “What do you mean? I solved the question correctly!?” They might argue with the recruiter. They may perceive the company worse and tell their friends not to apply.\n\nIt can turn into a real headache for companies with no benefit to them.",
          "score": 18
        },
        {
          "body": "I even get ghosted after several rounds of intereviews. \nWhat do you expect 🤣",
          "score": 8
        },
        {
          "body": "It is pretty common for companies to not provide feedback.",
          "score": 6
        },
        {
          "body": "They have zero incentive to do that, and - worst case - by providing you with reasons they are inviting you to sue them for all sorts of reasons.",
          "score": 8
        },
        {
          "body": "If you ask them why they rejected you, they'll tell you. At least, that always works for me.",
          "score": 3
        }
      ]
    },
    {
      "title": "DEAR PROFESSIONAL COMPUTER TOUCHERS -- FRIDAY RANT THREAD FOR June 04, 2021",
      "body": "AND NOW FOR SOMETHING ENTIRELY DIFFERENT.\n        \nTHE BUILDS I LOVE, THE SCRIPTS I DROP, TO BE PART OF, THE APP, CAN'T STOP\n        \nTHIS IS THE RANT THREAD. IT IS FOR RANTS.\n\nCAPS LOCK ON, DOWNVOTES OFF, FEEL FREE TO BREAK RULE 2 IF SOMEONE LIKES SOMETHING THAT YOU DON'T BUT IF YOU POST SOME RACIST/HOMOPHOBIC/SEXIST BULLSHIT IT'LL BE GONE FASTER THAN A NEW MESSAGING APP AT GOOGLE.\n\n(RANTING BEGINS AT MIDNIGHT EVERY FRIDAY, BEST COAST TIME. PREVIOUS FRIDAY RANT THREADS CAN BE FOUND [HERE](https://www.reddit.com/r/cscareerquestions/search?q=Friday+Rant+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).)",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/nrytqn/dear_professional_computer_touchers_friday_rant/",
      "comments": [
        {
          "body": "IM SITTING IN ON AN INTERVIEW AND THIS WOMAN HAS A 5.5 PAGE RESUME WITH 4 YOE I ALREADY DONT WANT HER TO MOVE TO THE NEXT STEP GOD DAMNIT",
          "score": 1
        },
        {
          "body": "SOMEHOW THE CHIEF MARKETING OFFICER HAS DECIDED EVERYONE REGARDLESS OF TITLE AND ROLE, SO LONG AS THE TITLE ISNT MANAGER, UNDER THE CTO SHOULD WORK A SATURDAY END USER SUPPORT ROTATION BECAUSE HE FEELS THAT IT WILL IMPROVE CUSTOMER SERVICE PROVIDED BY PART TIME SATURDAY STAFF AT ONE SINGLE BRANCH OFFICE IN A SMALL VERY RESTRICTED BUILDING WHERE NO ONE IS GOING TO FUCKING GO ANYWAYS. NOW THE REST OF THE EXECUTIVE TEAM AND CTO AND MANAGERS UNDER THE CTO ALL AGREE. THERE ARE TOO MANY PUSHOVERS ON OUR TEAM TO WALK OUT IN UNISON.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "HEY AMAZON RECRUITER IF YOU SAY YOU WANT TO TALK DON'T JUST SAID FRIDAY AFTERNOON TELL ME THE TIME WHEN I SHOULD EXPECT THE CALL. YOU BETTER NOT GHOST ME!!!",
          "score": 1
        },
        {
          "body": "IF I HEAR ANOTHER COMPANY THAT HAS BEEN AROUND FOR OVER A DECADE SAY \"WE'RE A STARTUP LMAO\" TO EXCUSE POOR WORKING CONDITIONS OR COMPENSATION I'M GOING TO EMAIL THEIR HIRING MANAGER A PICTURE OF MY DOG'S LATEST SHIT",
          "score": 1
        }
      ]
    },
    {
      "title": "Software Engineering Culture at Disney (Orlando)",
      "body": "I am currently a software engineer with a little over 3 years of experience and have recently moved into the Orlando area, and have been taking a look at Disney as a potential employer. There's not a ton of info on what the culture looks like, so I am mostly interested in the interview process and what the expectations are of individual contributors in the software orgs that are housed in Orlando, which seem to mostly be around the parks. \n\nAny help is appreciated, and also would love to meet (virtually or otherwise for now) any software folks in the greater Orlando area!",
      "subreddit": "cscareerquestions",
      "score": 61,
      "url": "https://reddit.com/r/cscareerquestions/comments/pifs31/software_engineering_culture_at_disney_orlando/",
      "comments": [
        {
          "body": "Spent 9 months in Disney as a SWE intern in DPEP(Disney Parks, Experiences and Products). Disney really treats most of their interns as just another cast member though, so it was more of just a regular role that a SWE would have. Personally, I'm a big Disney person so I absolutely loved being there.\n\n\nIn terms of the culture - it's really nice. The atmosphere overall is relaxed and work-life balance is super strong. People aren't working late or having to do anything on weekends. Everyone on my team and the other teams around me were very nice and you could really tell that people made friends in the office, and that felt nice.\n\n\nThere's two things I will say about Disney that may be bad for some people. The first is that the average age for engineers there is probably late 30s to early 40s. So if you're in your mid 20's there won't be as many people your age, but they certainly do exist. That doesn't seem to matter too much though, since we all work for The Mouse everyone it still gives a lot of people that more youthful atmosphere about them, if that makes sense. The second thing is that if you work at Disney then 9 times out of 10 you work there because you want to be a part of Disney. Don't come here thinking that only some people are big \"Disney people\". Almost everyone is and if that's not you it can certainly be a bit awkward when everyone else is fawning over anything going on in the parks and you're just not into it.\n\n\nThere is a caveat to this - the full time \"cast members\" are the kind of people that I mentioned above. Disney does use a hefty amount of contractors who are not like this at all. And overall their work quality is...lacking. You will also have a relatively large amount on your team that is offshore in India(usually). You will only be able to communicate with them during your daily stand up since that is the end of their work day.\n\nYou mostly talked about culture but I'll give a quick blurb on technology - unless you're in the few research groups that are in Disney(i.e. 'Emerging Tech') you typically won't be working on anything wild and innovative. Their tech stack is Java/Azure/JS/Angular/a little AWS(at least from where I was at). The work isn't archaic and legacy, but it's definitely not cutting edge for the most part.\n\n\nOverall I absolutely adored my time at Disney. The culture, people, and work really made me feel at home.",
          "score": 53
        },
        {
          "body": "I know someone who works in cybersecurity for one of the major parks in the Orlando area. He seems to really, really like working there. There are some interesting perks for working in a place like that, like early knowledge of massive projects (not that you should value this super highly). He has mostly positive things to say about the culture and workplace culture. However, he is not in software engineering and your experience is likely on a team by team basis.",
          "score": 20
        },
        {
          "body": "[deleted]",
          "score": 16
        },
        {
          "body": "It's a Mickey Mouse organization and you gotta be fucking Goofy to get hired there.",
          "score": 6
        }
      ]
    },
    {
      "title": "Daily Chat Thread - March 16, 2018",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).\n",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/84tlvo/daily_chat_thread_march_16_2018/",
      "comments": [
        {
          "body": "how important is the system design portion of an onsite for a new grad?",
          "score": 2
        },
        {
          "body": "When do companies start hiring for fall co-ops? ",
          "score": 1
        }
      ]
    },
    {
      "title": "Where to go as an EM for amazing WLB",
      "body": "I'm in my mid 30's. I've held most Eng roles (SWE, EM, PE, Support). I love being an EM, but what I don't love is the pressure and anxiety that comes with the job at certain companies.  \n\n\nI don't need a FB level paycheck, and I don't need the startup kool-aid + insane pre IPO equity. What I want is a job where I can get paid a good (again: \"good\", not \"great\") amount of money (since I do feel I'm very good at my job), but not have to deal with the insanity of the job. I don't want the anxiety on Sunday nights, I don't want to feel like I can't take a vacation because everyone sees me on the critical path, I don't want to be in meetings 100% of the day to the point I cannot actually help my team. I want to be able to focus on leveling up my team and have the structure to focus on problems without being pulled in a million different directions.  \n\n\nWhere's the best spot to aim for an EM role at to get this type of WLB and not have to take a significant enough paycut to leave the Bay?  \n\n\nFrom reading posts here it seems like Google might be that type of gig but it also seems hard as hell to get in as an EM there. I have a family and a bunch of things to take care of outside of the office and I'm not ready to Leetcode for 3 months straight and become a \"hard problem\" expert just to get a job at this point. I will prepare and interview my ass off, but I want it to be representative of what I will be doing on the job.  \n\n\nI've also tossed around the idea of working for a company like Microsoft or Disney. I love MSFT tech and I've always been a huge Disney fan and both of those companies seem to have great WLB (although I'm guessing MSFT pays way better).",
      "subreddit": "cscareerquestions",
      "score": 31,
      "url": "https://reddit.com/r/cscareerquestions/comments/o4j0um/where_to_go_as_an_em_for_amazing_wlb/",
      "comments": [
        {
          "body": "Cannot give you an option but as you may already have in your mind I could say Google is not your option. Being a SWE/SDE in Google could a very WLB job, but EM is crazy. I sometime check the Google’s EM schedules, they are full of meeting everyday (6 hrs+), but at the same time, they have a bunch of doc to review and write. Apparently, some of these work should be done out of working hours. Not to mention the paper work an EM will do when the evaluation date comes.",
          "score": 22
        },
        {
          "body": "Not Amazon.",
          "score": 17
        },
        {
          "body": "Cisco fits many of your requirements",
          "score": 11
        },
        {
          "body": "Stay away from Disney. Disney creative efforts are great but the software engineering culture is a shit show of constant reorg and under appreciation.",
          "score": 10
        },
        {
          "body": "I think that r/ExperiencedDevs will give you better feedback on your question! Good luck OP",
          "score": 9
        },
        {
          "body": "[deleted]",
          "score": 8
        },
        {
          "body": "What does EM stand for?",
          "score": 8
        },
        {
          "body": "Not sure how many roles they have in the Bay Area, but I feel like its hard to compete with MSFT when it comes to WLB. \n\nThey're hiring pretty agressively in general atm, but usually prefer internal promotions over external hires for leadership positions (which, imo is a good thing). If you do manage to find an open position though, it definitely wont be hard leetcoding for an EM interview.",
          "score": 7
        },
        {
          "body": "Have you considered Shopify? WLB is generally considered good.\n\nBiggest complaint is usually that pay isn’t competitive with FAANG, but that doesn’t seem to be your main focus anyway. Can attest that I’m quite happy with my pay though!\n\nHappy to give a referral if you want. Lots of lead engineer openings atm and it’s fully remote! Also plenty of management roles.\n\nFeel free to toss me a pm if you want a direct referral :)",
          "score": 6
        }
      ]
    },
    {
      "title": "Can I achieve my goal of 180k in Seattle?",
      "body": "I'm looking to relocate to Seattle, so I've been looking for software engineering jobs out there. So far I've been rejected by Google, Dropbox, Amazon, Hulu, ExtraHop and Glowforge. Microsoft are very unresponsive. Google and Dropbox have both told me to reapply in six months. It sounded like Dropbox was a close call—they said they'd enjoyed talking to me and spent a week trying to figure out if there was somewhere I'd fit. One thing that seems to be holding me back is my lack of any formal technical leadership, but it's hard to get that if you don't already have it.\n\nI enjoy systems programming and most things network-related, but I'd also love to get into embedded.\n\nOnce I start looking at less well-known companies, am I still going to be able to get a decent salary, or am I going to have to lower my expectations? I'm now looking at SkyTap, Starbucks and Disney, and I'll probably try applying for more at Amazon and MS. Are there any other great companies there that I should be looking at?\n\n(My resume for reference: https://danellis.me/)\n",
      "subreddit": "cscareerquestions",
      "score": 17,
      "url": "https://reddit.com/r/cscareerquestions/comments/9a02gr/can_i_achieve_my_goal_of_180k_in_seattle/",
      "comments": [
        {
          "body": "You should definitely be able to get $180k total and maybe even base.\n\nOther smaller companies or lesser known:\n\n- Zillow\n- Redfin\n- eBay\n- Expedia\n- Docusign\n- Tableau \n- Twitter \n- Groupon\n- Apptio\n- Uber\n- Grab\n- Airbnb\n- Lyft\n- F5 Networks \n\n...to name just a few ",
          "score": 11
        },
        {
          "body": "Facebook has an office in Seattle.",
          "score": 11
        },
        {
          "body": "[deleted]",
          "score": 27
        },
        {
          "body": "180k is very easily achievable in Seattle for total compensation with 20 years of experience. With that much experience, most companies wouldn't even bother offering you less.\n\nIf you want the highest possible pay, look into Oracle, Snap, and Facebook. Though they're all paying above the market to make up for some other issues at the company. If you're happy with normal market rates that are still higher than 180k, try Zillow, Indeed, Tableau, Redfin, Twitter, Uber, Lyft, Airbnb, and Grab.",
          "score": 10
        },
        {
          "body": "With that much experience you should be shooting for much higher than 180k. New grads in Seattle can make around that in TC at the higher end. ",
          "score": 6
        },
        {
          "body": "I’d also look at Nordstrom.",
          "score": 3
        }
      ]
    },
    {
      "title": "Software Engineer at Disney Streaming Services?",
      "body": "Does anyone here have any work or interview experience with Disney Streaming ? Got contacted last week about the position. I searched up previous posts here, but those were not related to the streaming brand. \n\nThe position highlighted Java, Database languages and AWS services. I would love any recommendations for concepts/technology to study for a job related to streaming services like Netflix/Hulu ",
      "subreddit": "cscareerquestions",
      "score": 17,
      "url": "https://reddit.com/r/cscareerquestions/comments/b6yh1s/software_engineer_at_disney_streaming_services/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 12
        },
        {
          "body": "After what [Disney did to their last tech workers](https://www.numbersusa.com/news/fired-disney-workers-drop-lawsuit-against-company), I'd stay away from any Disney jobs on principle.",
          "score": 22
        },
        {
          "body": "I interviewed for a full time position at Disney Streaming Services. It was a fairly standard Leetcode style question (on the easier side) for the phone screen, and the onsite had *tons* of Java trivia as well as one or two Leetcode style questions and one system design question.",
          "score": 8
        },
        {
          "body": " I worked for them when they were DSS and when it was still Bamtech Media. I was part of Bamtech before they were bought out, and also during the transition phase where some people still referred to us as Bamtech, and others as DSS. Left in August of last year.\n\nI can't tell you much about the interview process since mine was a bit different. I worked on the mobile team, but I can tell you everyone I interacted with on various teams was great. Lot of good engineers you can learn from, and at least during my time there, pretty understanding about working remotely if and when needed.",
          "score": 3
        },
        {
          "body": "Is the job in LA? If you I believe I got contacted by the same guy and I'm 90% sure it's a scam/spam job app, but if you think you can do it, go for it. I replied to the guy and they kept adding more odd conditions (work may end prematurely, large portion of salary is actually bonus)",
          "score": 2
        }
      ]
    },
    {
      "title": "Have 3.5 years of experience and a lot of trouble getting interviews compared to when I was a recent grad",
      "body": "When I was a recent grad I applied to level-1 type software engineering positions and it was crazy how many interviews I got in spite of having 0 experience and a crappily written resume and applying for positions that didn't match my knowledge base at all. Now I have experience, a better written resume and only apply for positions that closely match my experience. Rejections galore.\n\nHere are some local companies (either based in my city or have outposts in my city) that rejected me right off the bat recently: \n\nDisney, Zillow, Redfin, Uber, Palantir, Lyft, SpaceX, Airbnb, Hulu, Expedia, some others you probably haven't heard of (e.g. Axon)\n\nThe only company I heard back from is MSFT and that's for a position I'm not sure I want (Service Engineer). \n\nAnyone else experience something similar to this? I feel like I need a time machine. I bet part of the reason why it's hard to get hired at big-name companies is because if you've worked 3.5 years at multiple jobs none of which are a big-name company, you've kinda branded yourself as \"not good enough\" to work at a big-name company.",
      "subreddit": "cscareerquestions",
      "score": 31,
      "url": "https://reddit.com/r/cscareerquestions/comments/6posml/have_35_years_of_experience_and_a_lot_of_trouble/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 95
        },
        {
          "body": "It's hard to tell without seeing your resume, but here's some speculation based solely on what you mentioned:\n\n* You pigeonholed yourself into maintenance roles that don't seem to be relevant to the positions that you're applying for. This is based on the fact that you were selected for a \"Service Engineer\" interview at Microsoft. \n\n* You have a history of job-hopping that is seen as a red flag by most recruiters. I don't know what  you mean when you say \"multiple jobs,\" but if it's more than 3 then this could be a serious issue for you because people will make assumptions about your professionalism and/or competency. \n\n* Related, you showed no career growth during the last 3.5 years in the form of promotions or increased responsibilities. If you've been continually stuck in entry-level positions, it's a signal that you might be lazy or you've reached the maximum of your potential. \n\n* You might be working for really shitty companies. As another commenter said, it's not critical for you to have a bunch of fancy names on your resume. But if you've worked at multiple places with established reputations of having extremely low standards, that could be a factor. \n\nAgain, this is all speculation. I'm not saying that any of these are true, but I think there's a decent chance that your resume displays one or more of these qualities. ",
          "score": 19
        },
        {
          "body": "Not getting interviews is a resume issue. Post your resume in the weekly resume thread. Maybe do additional personal projects?",
          "score": 11
        },
        {
          "body": "Not to hijack, but, I'm in a similar boat. \n\nI've relocated to Seattle late last year. I've been applying to jobs for which I meet the requirements for every week since. While I've gotten dozens and dozens of phone screens, second rounds and at least 6 on-site interviews, I'm still not employed. I always have a current lead I'm chasing (phone screen -&gt; awaiting next step) but, man, is it hard to be patient as time goes on. Especially when the pressure of running out of savings. \n\nBeing told on the initial phone screen \"you're a great fit, I'll forward your impressive profile to our hiring manager\" so many times just to be ghosted or receive a rejection before the next step I can only attribute to competition.\n\nThere were at least two of those on-sites where I felt confident I did well, the other I felt I did my best but, that doesn't mean I did well.\n\nI have about 2.5 years of experience at one job but, mostly it was a maintenance role within a Microsoft stack. I did learn quite a bit about being a developer on the projects I was given and did my fair share of coding.\n\nI remember just before graduating I started my job search. Despite being so late it only took a little over a month to secure my first full time developer job locally. \n\nI never thought I'd have so much trouble getting my next gig after having industry experience. As I said, I always have some follow up or lead I'm chasing each week so, I'm not losing hope.",
          "score": 4
        }
      ]
    },
    {
      "title": "Entertainment Jobs",
      "body": "Hello everyone! I have been applying to entry-level and associate jobs for NBCU/Sony/Warner Bros/Sony Music Group/Disney and have yet to have any luck interview-wise with 1.5+ years of experience working for a marketing agency. Any tips to get an interview?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/15qbtpu/entertainment_jobs/",
      "comments": [
        {
          "body": "Good luck as this is a terrible time to be in the entertainment industry.  Writers and actors are on strike.  The ripple effect is that a lot of other entertainment industry people have been laid off or on hold because there's nothing to work on.  You are currently joining a long long long line of people in the entertainment industry who are fighting for the small number of jobs currently open.  You are going to have better luck at this time looking elsewhere",
          "score": 1
        }
      ]
    },
    {
      "title": "Disney Streaming Services as a Software Engineer",
      "body": "Has anyone had an interview with Disney Streaming Services? Just want to know the types of questions that can be expected for an on-site and what I should prep for?",
      "subreddit": "cscareerquestions",
      "score": 19,
      "url": "https://reddit.com/r/cscareerquestions/comments/bwhuos/disney_streaming_services_as_a_software_engineer/",
      "comments": [
        {
          "body": "I interned for them. Everyone uses Java the technical question was about counting unique words in a paragraph. Asked a lot questions about REST, aws, web app and API security, JWT tokens, how rest calls work etc.",
          "score": 16
        },
        {
          "body": "Was asked about microservices, and REST. Medium level leetcode problems (count words in string file). Phone screen guy was great and so was recruiter, hated the on-site. They were extremely cold and gave a condescending vibe, no greeting either; the instructions were basically: Park, go up 7 floors, walk into the interview room and wait.",
          "score": 10
        },
        {
          "body": "I dunno man, it sounds like a Mickey Mouse Operation to me.",
          "score": 11
        },
        {
          "body": "Is this for the nyc office? Were there any multithreading questions? Db questions or design patterns",
          "score": 1
        }
      ]
    },
    {
      "title": "Best roadmap to get a job/internship in the US as a foreigner?",
      "body": "I am a CS comminity college student (outside the US) studying Web development, PostreSQL, and Node.js for backend.\n\nThe goal of that extensive study is to be able to make all kinds of consumer software products with web technologies. However, it is not a given that any of my apps will succeed, so preparing for a job should simultaneously be a major line of the study.\n\nA lot of times there are some doubts in my head about how easy/hard would it be to get employed in America (Visa sponsorships), with Node.js/SQL full-stack web dev skills.\n\n# Java development?\n\nIn addition to these doubts, I've been interested in Java and its resprective tools/frameworks.\n\nIt's a third most popular programming language (If you assume that JavaScript and Typescript are the same thing) and is used mainly by large companies (most of FAANG along with Oracle, Cisco, Disney and others), the ones that offer visa sponsorphip.\n\nHowever, its backend web frameworks are not that popular (according to StackOverflow surveys), and It's hard to imagine the language's main corporate use cases besides developing Android and Financial applications.\n\nThere are also some concerns that it is a legacy technology, its popularity may start declining in the future.\n\n# Python?\n\nI am being skeptical about diving deep into Python (being the 2nd popular tool) and its frameworks, for the reason that the use cases of the language are really industry specific (Most notable: Data Science, DevOps, CloudEngineering, Cybersecurity). Yeah, there are jobs in Python/Flask/Django. I am not really sure if it's good a way to maximize the chance of getting US job or whether If majority of companies with that stack offer H1B/Green card sponsorships (I've seen that pattern that smaller SAAS companies tend to use Python for backend, and not offer any visas).\n\nIn addition, It seems like C# frameworks are far ahead in popularity to Python.\n\n# A few things...\n\nI am making research on what languages/stacks to master, because for some companies it matters what stack you have under your belt. If your stack has major overlap with what the company you are interviewing for uses, then in case if you join the team, they are going to spend less effort teaching and preparing you company's technologies. Hence, you'll be seen more favorable to be hired.\n\nThe goal is just to hired as a Junior developer/SWE/ Web dev with H1B/Green card sponsorship.\n\nNot really sure if React/Node/SQL/TypeScript stack would the best for that goal",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/wzz4e7/best_roadmap_to_get_a_jobinternship_in_the_us_as/",
      "comments": [
        {
          "body": "Worry a lot less about the specific technologies you're working with.\n\nWorry a lot more about finding an internship with a company that has immigration lawyers on staff. Think big banks, international logistics, your big-name retailers, FAANGs, etc. Identify those opportunities, learn the skills they're asking for. Work backwards from \"I have identified a set of jobs I want\".\n\nThis approach casts a very wide net:\n\n&gt; I am making research on what languages/stacks to master, because for some companies it matters what stack you have under your belt. If your stack has major overlap with what the company you are interviewing for uses, then in case if you join the team, they are going to spend less effort teaching and preparing you company's technologies. Hence, you'll be seen more favorable to be hired.\n\nUnderstand that an incredibly small minority of US-based companies, even if they wanted to sponsor your employment and thought you were a top notch employee, will be unable to sponsor your employment. The immigration process is a fucking morass, with all sorts of \"gotchas\" that can completely reset the process to the beginning. Immigration lawyers are fucking expensive. Not every company has the financial means, and the vast majority of them have zero incentive. There's often local candidates who, while they may not be as \"good\" as you, can do the job perfectly fine. If those people are citizens or on some other permanent status, and they can do the job, it is an absolute no-brainer for most businesses to hire that person. And if they didn't hire that person, they need to explain to whatever government official is reviewing your visa application why they didn't hire the citizen.\n\nTo the best of your ability, address the \"immigration is fucking difficult\" problem first. It's much more important than aligning your hard-skills with a vast swath of job descriptions.",
          "score": 7
        },
        {
          "body": "internship is fairly straight-forward, the common one I think is J-1 visa, however it may be difficult to convince (translation: up to you to demonstrate that in the interview process, by outperforming all the local candidates) the company to bring in immigration lawyers, filing all that paperwork with USCIS, with the company knowing that you'll be gone in 3-4 months\n  \nH1-B visa is a completely different story, there's already perhaps thousands of posts online regarding this topic, mainly that it's not guaranteed, so company could spend thousands of dollars filing petition, but you don't get picked in the lottery drawing, now you can't work and company have to rescind their offer, so no competent company is going to even start the interview process without some kind of back-up plan (translation: what if you don't get picked in H1-B drawing?)",
          "score": 1
        }
      ]
    },
    {
      "title": "Disney Streaming Software Engineer Internship",
      "body": "I have an interview with Disney Streaming as a software engineer intern coming up next week and was wondering if anyone can provide any information on what the interview is like. I couldn't find much online and just wanted to be best prepared for it.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/t5e5po/disney_streaming_software_engineer_internship/",
      "comments": []
    },
    {
      "title": "Moving to your dream company after your first ever job in the field.",
      "body": "How easy is it to move from your first job at a small-midsized company X to a FAANG fortune 500 type after X years (1-2yrs) or dream job? I'm a new grad first-gen with zero internships and zero field experience (under 5 years of work experience non related)\n\nI managed to apply to 35+ companies with ~7 interviews so far ranging from small-mid size and Disney being the only largest company I've applied too. I've been taking Udemy courses on the side to continue learning web / mobile dev and been revving up LC. I also managed to get a final interview after 3 rounds at a midsized company small dev team and awaiting to hear their response (2LC easy 45 mins, 15 mins behavioral) I did well I believe.\n\nHow is it from getting interviews/offers based on your opinions or experiences after being exposed to the field. I am honestly afraid of applying to big tech companies with zero field exp. but I will shoot my shot this month with them since the worst they can say is no. I'm also applying to more places that interests me internship/FT (California).\n\nAlso, feel free to PM and connect! I am hoping to  talk to other SWEs and Devs out there. Thank you for your time!",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/mrl4ke/moving_to_your_dream_company_after_your_first/",
      "comments": [
        {
          "body": "Internship experience is very valuable in industry. \n\nThat being said.. ~7/35 companies applied to is pretty good compared to a lot of other people in similar situations. I went from and internship with Disney (coincidentally) —&gt; a great tech company—&gt; a Unicorn tech company—&gt; LinkedIn. I was able to get most of those experiences based on tenure at the previous experience. \n\nFortune 500 doesn’t mean shit in tech. LinkedIN is fortune 950 or some shit and is one of the highest payers in the bay.",
          "score": 2
        }
      ]
    },
    {
      "title": "Advice regarding unpredictable, unprofessional and volitile manager",
      "body": "Last year I lost my job in a wave of contractor layoffs in my company. I onsite interviewed at quite a few places and ended up only getting one offer for a company I was really interested in, with which I had a great interview experience. Everyone I talked to seemed pretty down to earth and friendly, the atmosphere was startup-ish but was backed by a large company. I took the job.\n\nMy first impression of my manager, lets call him Dave, was that he was a very high energy, fun person that likes to have fun and wants new people to feel included. What's not to like? I was actually enjoying my onboarding because I got accepted right into the dev team, people liked me and the atmosphere was very light. It was very different from my last jobs working with larger companies. \n\nHowever after a week things started getting weird. Dave would suddenly get serious and chastise me in front of the whole team. For example, I one time whipped out my laptop during meeting to Google something we were talking about and he tore me a new one about not being a team player. I didn't how to react and I couldn't even get a word out. I thought \"Ok, he doesn't like that. I won't do that.\" One time I asked why we designed part of our system to do X and we ended up arguing for like 15 minutes, but I was confused that I didn't even understand where the argument was going and I felt very attacked by the way he was talking to me, very aggressively and condescending. \n\nThen started a couple months of me discovering the wonderful personality traits of Dave:\n- Dave will spew BS about how our system works in front of the CTO at meetings. These are things that are completely wrong and he is guessing, but the CTO believes him and this gets us into trouble later on.\n- Dave will argue about anything and everything when it comes to design\n- Dave will never give up on an argument. Sometimes he will argue a 1/2 hour past our meeting time just so he can come out being the winner.\n- Dave will argue about something and change his point of view in the middle of the argument so that he's right. Yes. I might be arguing that X = Y and he thinks X = Z. Once I get to the point where it's obvious I'm right, he will say \"Well, yeah, like I was saying, X = Y.\" But... you just said X = Z?\n- Dave seems to not have a very good memory. He approves changes that I make then later chews me out for doing what I did. When I try to explain that he approved it and ask when I'm being reprimanded it just gets worse so I end up documenting all the code changes I do and specifically write in Jira that Dave approved it.\n- Dave will sometimes spend hours filling out surveys online. (I sit next to him)\n- Dave will sometimes watch full length Disney movies at work.\n- Dave will sometimes just sit and zone out for hours at a time.\n- Dave sends the whole team at least 3 youtube videos a day\n- I would save Dave does about 2 hours of actual work a day.\n- Dave asks super basic questions about our infrastructure that I learned my first couple days here. \n- I'm realizing I know about 50% of our codebase while Dave only knows about 2%, even though he's been here years longer than I have.\n- The only work Dave does is performing releases and writing a powershell script once in a while.\n- Dave hits on most women in the office (he is middle aged and single).\n- Dave gives me advice about women on the daily. I am married and 10 years younger than him.\n- Dave likes to discuss which are the best strip clubs around and invites everyone on the team to go with him.\n\nSo, that's about it. Basically, I can't believe this guy is managing a dev team. I can see how he could get hired. He's really good at reading people and knowing what they want to hear. But, I can't believe he's lasted this long. I think CTO has a soft spot for him because I can't see how he still has a job. I looked at his resume and he hasn't stayed more than a year at his previous 5 jobs.\n\nDoes anyone have any advice? I love the product I'm working on and really want to stay here. It's the first job I've had that I find the work to be both challenging and interesting. But I can't keep working with this guy ... I'm at such a high level of stress that I need a fix here.\n",
      "subreddit": "cscareerquestions",
      "score": 15,
      "url": "https://reddit.com/r/cscareerquestions/comments/acjqrq/advice_regarding_unpredictable_unprofessional_and/",
      "comments": [
        {
          "body": "[People leave managers, not companies](https://www.google.com/search?source=hp&amp;ei=T5YvXKzlL8if0gL3vZ_gCg&amp;q=people+leave+managers+not+companies&amp;btnK=Google+Search&amp;oq=people+leave+managers&amp;gs_l=psy-ab.3.0.0.21.1924..2669...0.0..0.159.2187.11j9......0....1..gws-wiz.......35i39j0i131j0i131i67j0i67j0i10.U3tcpxBr0Ow).\n\nBest advice I have is hang out in this sub and start prepping to move on.",
          "score": 11
        },
        {
          "body": "What do you want to do, and what options are available to you?\n\n-\tDo you want to stay at the company in general?\n-\tCan you transfer to another team under another manager?\n-\tIs there a skip-level manager between Dave and the CTO, or does Dave report directly to the CTO?\n-\tDo you feel comfortable sharing your concerns with Dave's boss?\n-\tDo other people also share your concerns?\n-\tDo you believe that it will help to escalate?\n-\tDo you even want to “fix” Dave, and continue working under him, assuming his behavior changes?\n\nAnswer these types of questions for yourself, and decide what outcome you're hoping for that is also realistically achievable, then work backwards from that to decide what actions you need to take.",
          "score": 8
        },
        {
          "body": "[deleted]",
          "score": 6
        },
        {
          "body": "You can't fix \"bad manager.\" \n\nYou can find workarounds and ways to avoid triggering him, but he'll still always be your manager.\n\nI suggest start looking for another job sooner rather than later. You'll be glad you did. ",
          "score": 2
        },
        {
          "body": "&gt;chastise me in front of the whole team\n\n&gt;He approves changes that I make then later chews me out for doing what I did\n\n&gt;Dave hits on most women in the office\n\n&gt;Dave likes to discuss which are the best strip clubs around and invites everyone on the team to go with him.\n\nIn a healthy office environment, he would have been removed months ago for these things. Who is his manager, and is that person aware of Dave's winning personality?\n\nSince his behavior is clearly not being addressed by the company, you'll have to remove yourself.",
          "score": 2
        },
        {
          "body": "keep your head down and do your job. improve your skills and try to stay employed until you can get another job. volatile managers tend to fire a lot of people.\n\ndo not go around him to complain. if he lasted this long, others probably complained about him. that is typically a job ender.\n\nbeen there. you gotta keep your head down. Do NOT respond to comments about women or strip clubs. If someone overhears you this can lead to termination. Avoid the subject and DO NOT RESPOND. ",
          "score": 2
        },
        {
          "body": "As somebody said, people leave managers not jobs, so it benefits your company to tell them about a potential source of employee hemorrhage.",
          "score": 1
        },
        {
          "body": "*I can't keep working with this guy*\n\nNot much else to say, stop working for Dave. Start looking for other jobs in other companies, in parallel with talking to Dave's manager, or other managers, or HR.\n\nSometimes internal transfers get blocked, but when the valued employee is clearly on the way out unless the transfer gets approved it can suddenly become unblocked.\n\nI've found good managers to be uncommon, working with new people is always a gamble.",
          "score": 1
        }
      ]
    },
    {
      "title": "Phone Screening Interview w/ Disney World .. Advice Needed!",
      "body": "",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1c1hclk/phone_screening_interview_w_disney_world_advice/",
      "comments": [
        {
          "body": "Dude it's just a phone screen. They're just going to ask you questions about your background.",
          "score": 2
        },
        {
          "body": "Do your best impression of Mickey",
          "score": 1
        }
      ]
    },
    {
      "title": "235 Applications - 11 Interviews, Here is What I've Learned So Far",
      "body": "Background on Me:\nI have major self esteem issues. Enough that I am in therapy for it. I view myself as the worlds biggest loser for reference. This is not to make it a pity party for me but I think context is important. \n\nMonths ago I was thinking I was a straight up loser in the job market. Working a dead-end entry-level job. No REAL business experience that could translate well into a new job. The only roles recruiters ever reached out to me about were for Admin Assistant positions, which I was not interested in. When I told them, I was looking for more business fronting roles, they would stop replying to me or acted like I was stupid.  \n\nBut here I am. The biggest advice I have is to sell yourself with soft skills and buzzwords when you’re lacking in more important qualifications. Every company loves hearing how I manage multiple different inboxes and tasks. And how I am great at multi-tasking and staying organized. Do I really believe I am good at this stuff? Heck no. I receive tons of great reviews and awards for my work but to me it’s all just luck. But you must be your biggest advocate for just the interview.  \n\n\n\nApplications:\n\nOriginally, I started using Indeed, but felt like it wasn’t getting me anywhere, so I switched to LinkedIn. LinkedIn is where I've gotten 8 of my interviews from. It’s been a mix of both Easy Apply and applying on the company website. If I see the application is long and tedious, I just leave. I have yet to apply with a cover letter. If its a major company like Disney or Google, I would obviously use a cover letter.  \n\nI've applied to jobs that I was good fit for, and for those that I was a close fit, but was maybe missing a few qualifications. \n\nOut of the 11 interviews \n2 were from Indeed\n8 were from LinkedIn\n1 of them was a reference but has led to 2 interviews in different departments \n\nI do not waste my time on assessments BEFORE an actual interview is offered. I don’t see a point in wasting 30-45 minutes of my time just to see if I even qualify for an interview. \n\nI've accepted every interview I've been offered even if I wasn’t initially interested. I think practicing my skills in these situations is incredibly important. And you never know how the opportunity may evolve. If it doesn’t work out, you can see if there’s another position available for you. \n\n\n\n\nThe Interview\n\nI am actually pretty good at interviews. At least in my opinion. I am a hardcore researcher. I look up interview questions on Glassdoor and I have my typical answers for the most basic questions. I learn as much as I can about the company, and you would be surprised at how many managers are surprised I did my research. And whenever a question stumps me, I say \"wow that’s a really good question. I never thought about that before\" and I proceed to answer. And then I write it down so I can come up with a better answer if it ever gets asked again. \n\nOne question I always answer \"honestly\" is the weakness question. I also say I am working on sharing responsibility since I can end up overwhelming myself. And almost every interviewer has thanked me for not giving a generic answer, such as being \"too hardworking\" or \"a perfectionist\". Set yourself apart by answering this request with a real weakness and how you’re working to overcome it. Or just that you've acknowledged it. \n\nAt the end of every interview - I take the time to thank them for their time and I appreciated it. I also let them know that if they are interested in me as a candidate, I am interviewing at multiple companies for full \"transparency\". I do that even if I am not. I am not interested in an interview process going on longer than a month. And as a result, I've got 2 rounds at multiple companies in 1 week. \n\n\n\n\nMe asking Questions - \n\nSome questions I have been asking that have my interviewers saying \"good question\" and are generally impressed with. \n\nFor higher ranked positions: \n - The average tenure of an employee is around ___ years_. What do you think is contributing to this and what is the company doing to retain top talent? \n\nFor possible colleagues:\n- What are some of the challenges you've faced in this role and how did you over come them? Did you feel like the training was useful?\n\nEveryone:\n- Is there anything about my qualifications or me as a candidate that concerns you? I'm happy to clarify anything or answer any additional questions you may have before we part ways.\n\n\nI have yet to receive an offer but I am also way further than I thought I would be in the process.",
      "subreddit": "jobs",
      "score": 486,
      "url": "https://reddit.com/r/jobs/comments/otayai/235_applications_11_interviews_here_is_what_ive/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I find it interesting that people keep track of their numbers, like some kind of sports stats. I've never done that personally. I have no idea the number of jobs I applied to how many interviews I've had, etc. Not saying there's anything wrong with it, I just find it interesting.",
          "score": 107
        },
        {
          "body": "And if you're funny don't forget that it's a powerful asset. If you got the interview, at that point personality can be stronger than business answers.",
          "score": 91
        },
        {
          "body": "What was your general feedback in a phone screen that led you to advance to an interview with a hiring manager?\n\nI honestly just had a phone interview yesterday with a pretty large tech company and the recruiter asked very vague questions about my experience. I feel like I do a bad job of rambling on about my current role because it’s highly specialized.\n\nHowever, she did ask if I was interviewing elsewhere and for my salary expectations. I kindly replied that my salary preference is negotiable. She then proceeded to give me their budgeted salary for the role and I said it was within my range.",
          "score": 14
        }
      ]
    },
    {
      "title": "[VENT + ADVICE] Interviewed with NYT, Spotify, BuzzFeed, Paramount, Pinterest, etc. — but still no offer. What am I doing wrong?",
      "body": "TL;DR:\n\nI’ve spent the last few months interviewing with some of the biggest media and entertainment companies in the world—NYT, Spotify, BuzzFeed, Amazon Music, Pinterest, etc.—for senior marketing roles. I’ve been poached, made it to final rounds, and poured myself into tests and presentations. But despite it all, I haven’t gotten a single offer. I’m exhausted, grateful, frustrated, and looking for advice—especially from other POC professionals. What finally worked for you?\n\n⸻\n\nHey everyone. This is part vent, part reflection, and part request for advice.\n\nOver the last 4–5 months, I’ve interviewed with some of the biggest media and tech companies in the world for senior marketing roles—including The New York Times, Spotify, Pinterest, BuzzFeed, Paramount, Scribd, Dotdash Meredith, Bloomberg, Amazon Music, Simon &amp; Schuster, HarperCollins, Penguin Random House, and The Atlantic. I’m also interviewing with iHeartRadio and Disney next week, and potentially Tubi as well.\n\nOn paper, it sounds like a dream scenario. And in many ways, I know I’m extremely lucky. These are hyper-competitive roles with callback rates around 2%, and the fact that I’ve made it to final rounds—sometimes without even applying—speaks volumes. (Pinterest, Amazon Music, Dotdash Meredith, Paramount, and Spotify all reached out to me cold after finding me on LinkedIn—they essentially poached me.)\n\nIt tells me I’m clearly in demand, and that my experience speaks for itself.\n\nI have 11+ years of marketing experience spanning publishing, audio, and media, with a focus on brand, growth, and lifecycle marketing. Without naming names, I’ve worked on high-profile, multimillion-dollar campaigns with top clients and celebrities across major media companies. I’ve consistently delivered.\n\nAnd I want to be clear: I am deeply grateful to be where I am. I know how many people would love to be in this position. This isn’t a complaint about opportunity.\n\nBut despite all that… I haven’t gotten a single offer. And it’s starting to wear me down.\n\nMost of these roles are senior-level—Senior Manager through Senior Director—which means 6 to 8 rounds of interviews, case assignments, strategic walkthroughs… it’s like a second job. And when you go through all of that and still hear, “We loved you, but went with someone else,” over and over again, it stings. Deeply.\n\nTo add more nuance: I’m a Black woman. And in nearly every single panel, I’ve been the only Black person in the (virtual) room. That’s not a guess—it’s a fact. And while I’m not here to cry racism or make sweeping claims, I am saying it’s impossible not to wonder about unconscious bias. It’s something I carry with me into every interaction.\n\nFor example, I’m always collaborative in how I work and communicate—that’s core to who I am. But in earlier interviews, I leaned more into confidence and sharp strategic thinking… and I worry that may have come off as “too assertive.”\n\nSo in my most recent process with the New York Times (where I made it to the final two), I changed the way I presented myself. I was intentional about balancing confidence with deference—not just showing collaboration, but at times even appearing submissive. And while I hate that I even have to name that dynamic, I don’t think it’s a coincidence that this was the farthest I’ve gotten.\n\nI do believe some of us—especially Black women—are expected to code-switch, or to shrink ourselves just enough to seem “manageable.” It’s exhausting to navigate.\n\nStill, I also take accountability. Maybe I’m not giving deep enough answers. Maybe I’m over-preparing and sounding too rehearsed. Maybe I’m not specific enough with KPIs or GTM tactics.\n\nI always ask for feedback—but 95% of the time, I get, “You were great. We just went with someone who was a better fit.” What are you even supposed to do with that?\n\nOnly one company—Dotdash Meredith, which I’ve interviewed with multiple times—gave me anything constructive. One recruiter said the other candidate’s answers were “more in-depth.” Another said I “sounded memorized.” That’s it.\n\nMeanwhile, I’ve gone through multiple interview rounds across the same organizations:\n\n\t•\tNYT: 5 different roles\n\t•\tDotdash Meredith: 6 roles\n\t•\tPenguin Random House, Simon &amp; Schuster, HarperCollins: multiple roles across years\n\nTo be fair, I’ve worked with some of these companies and still do. But I’m looking to pivot out of publishing and into media/entertainment more broadly. The volume and intensity of these processes have taken a toll.\n\nSo again: this isn’t a “woe is me” post. I know I’m fortunate. I know I’m in the running. But I’m also exhausted.\n\nIt’s devastating to keep getting this close and not breaking through—especially when the demands are so high. Full decks. Marketing briefs. End-to-end strategy. Creative ideation. Interviewing with 6+ people across multiple weeks. You give it everything. And still… no.\n\nI’m trying to stay hopeful. Trying to stay strategic. But I’d be lying if I said it wasn’t starting to shake my confidence.\n\nSo here I am: venting, yes—but also genuinely asking:\n\nIf you’ve been through this—how did you push through? What changed for you? Was there something you did differently that finally got you the offer?\n\nAnd if you’re a person of color, or someone who exists at the intersection of different identities—especially someone not cis/white—I’d especially love to hear from you. What helped you cross the finish line?\n\nI’m open to all insights. Truly. But I know that when you don’t look like anyone else in the room, the game changes. And I want to know how you kept going, and how you broke through.\n\nThanks for reading. I know this was long. I appreciate the space to share.\n\nSigned,\nExhausted—but still holding on,\nCandidate\n",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/1nsv06y/vent_advice_interviewed_with_nyt_spotify_buzzfeed/",
      "comments": [
        {
          "body": "I don’t think you’ll find much advice here. Not a lot of people who work in high-level media, and I think you’d benefit more from talking to people on your level in the industry. No shade to the people here. I’ve worked in entertainment before but at the junior level. I wonder if the “better fit” comment has to do with race, especially in this political environment. That was the first thing that came to mind, and they often use that to say “you’re not like us.” \n\nAgain, entertainment is perhaps one of the most diverse industries (and that’s saying a lot), but I do think those biases still exist. And it sounds like you’re shrinking yourself down to appear humble or “not like the other Black people.” Gender plays a role here too.\n\nHave you tried Black media companies? They would really be lucky to have you. \n\nAlso, this was written with AI?",
          "score": 11
        },
        {
          "body": "I was in a similar boat, but as a white guy. 10+ years in agency comms, marketing, looking to move from a kind of hellish company (6 days a week, 65+ hours per week, 4hr round trip commute). I had a couple interviews with Macquarie Group, smaller comms firms, etc. without traction. I think the white collar market is so heavily saturated right now it’s really tough for a company to justify paying for experience when dozens of new grads compete with experienced professionals to get paid the least for roles. It’s all fake growth signaling to boost valuations. \n\nI’ve been noticing quite a lot of real, tangible growth in blue collar and local small business communities for marketing and sales, at least where I live on the west coast. The salaries aren’t great, but they are hiring. I went from $56k to $83k just by transitioning fields, and now I am sales ops support at an electrical company looking to modernize their systems. Their interview process is way more straightforward, no take-homes or bullshit like that, literally went from interview to hire in a week, and if you advocate for yourself the benefits are comparable. \n\nYour mileage may vary, but a/e/c fields are currently on the lookout for experienced people that can optimize their systems and shore up inefficiencies. Might not be a bad avenue to explore if you’ve exhausted your options.",
          "score": 3
        },
        {
          "body": "Just wanted to commiserate. I've been runner-up a couple of times in this god awful market. I'm a (visibly) white dude in tech, but I'm from a very atypical background, and I really suspect I'm being profiled sometimes. It goes both ways, being cast as bougie when I'm not, or \"not diverse\" when I'd count, or that I agree with the politics of the place I ran away from, or they're looking for cheap immigrants and assumed I'm foreign. Which accent should I use? What do I do with my hair? And how are my bougie colleagues just pulling money and jobs out of the air when I don't get interviews?\n\nRecently I've been on a charm offensive, and I'm having some success with networking that way. I have tons of stories from the hood that just blow these people away if you package it right. At this point I'm just embracing \"being different\" and focusing on selling my image to whoever's buying. It leaves me feeling a little like a prostitute, but prostitutes get paid, so...",
          "score": 2
        }
      ]
    },
    {
      "title": "The Job Market Is Insane Everywhere",
      "body": "I've been living in the Netherlands for almost a year and a half and since I hit the ground I've been learning dutch &amp; trying to find a job. I did not anticipate it would take this long to find employment. I've applied for positions via staffing agencies, recruiters and looking on job boards on my own in the following categories administrative, customer service, contract management &amp; travel. My previous employers have been Disney, Universal, Vitol Oil &amp; Gas, First Investors Financial and AAA Texas. At this point I've lost count of the number of companies I've applied to. Yet I've only managed to get 2 interviews in the time I've been here. The vast majority of the companies I've applied to I dont hear from at all even after sending a follow-up email about my application. And everytime they say they like me and my work history but they go with another candidate because I'm \"over qualified\" or \"dont have enough customer service experience\". Which for clarity makes absolutely no sense to me given I was with my last employer for almost 10 years and my position was combo of customer service &amp; administrative duties. I've always had a job since I was 18 years old so not working just doesn't feel right to me.\n\nHere in the Netherlands they have to pay you based on your age. Legally the older you are the more they have to pay you. I was recently told that the \"over qualified\" reasoning is because of my age and companies would need to pay me more. I'm at the point where I'm deeply discouraged and I feel like a complete and utter failure as a person. Depression is starting to set in and Idk if I will make it out of the hole this time.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1cu06zm/the_job_market_is_insane_everywhere/",
      "comments": []
    },
    {
      "title": "How is disney streaming as a place to work for a SWE?",
      "body": "Online there seems to be mixed reviews (and by that I mean a lot of recent bad ones about the company not being truly competitive compared to other tech jobs). I'm in the interview process, but maybe its because I'm jaded by the title \"Disney\" but it seems like a place I would want to work.\n\nAnyone who's worked there or heard things about it have any thoughts?",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/qmosta/how_is_disney_streaming_as_a_place_to_work_for_a/",
      "comments": [
        {
          "body": "I was an intern in the Seattle office. I had a really good experience. Everyone was very nice and I learned a lot. Definitely got a corporate vibe, but everyone seemed really passionate about what they're doing.",
          "score": 6
        },
        {
          "body": "I hear the Mickey interview is hell.",
          "score": 7
        },
        {
          "body": "Their pay is definitely not as competitive, especially with their stock not even really beating SP500",
          "score": 3
        },
        {
          "body": "They’re decent, but their growth pipeline isn’t good and their level of dev is mediocre. Probably a tier below Capital One, but a tier above non-tech companies.",
          "score": 5
        },
        {
          "body": "https://www.reddit.com/r/cscareerquestions/comments/pxzp1j/i_did_the_last_software_engineering_internship_at/\n\nThis guy did an internship at Disney. Maybe it'll help you get some ideas.",
          "score": 1
        }
      ]
    },
    {
      "title": "About to have a dialog at Disney media and entertainment distribution (DMED) to work on Disney Streaming Services",
      "body": "So I spoke to a recruiter today, I'm looking at moving to Disney to work on the streaming services as a SWE P2. It's a fully remote position and more than doubles my current comp.\n\nI'm very dissatisfied by my current job and my current company. I want to make the move away from it, but this is the only job I've had after college.\n\nMy question is what sort of questions can I expect in the interview? What can I expect in terms of signing bonus? How is Disney to work for? I'm nervous but excited. Any experience folks have had with DMED would be great to hear.",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/v4ga7c/about_to_have_a_dialog_at_disney_media_and/",
      "comments": [
        {
          "body": "I didn't work at Disney but I worked at a company that was a vendor for disney. Lots of red tape there. Getting the smallest thing done seems to require weeks of approvals.",
          "score": 3
        },
        {
          "body": "i’m getting coffee",
          "score": 1
        },
        {
          "body": "FYI the company you're looking to work for used to be BAMTech and was more associated with MLB than with Disney.  If people have experience with Disney corporate it's not the exact same culture.  They did such a good job with MLB.tv that MLB spun it off as their own business and they became the first choice for other companies who wanted to contract out a streaming service but didn't want to bring it in house. Eventually Disney bought them out to start Disney+.",
          "score": 1
        }
      ]
    },
    {
      "title": "People who did Internship INTRVIW with Disney",
      "body": "Hi Everyone I have a quick question from people who have done the group zoom interview with Disney managers/recruiters I was wondering to know how long did it get them to get back to you with their decision?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/ueyblv/people_who_did_internship_intrviw_with_disney/",
      "comments": []
    },
    {
      "title": "How much easier is it to land internships?",
      "body": "vs junior developer jobs? \n\nI am finishing up a coding camp in 2 months with Python, Java, Javascript under my belt.\nI wanted to apply for an internship at disney. Im just wondering should I be prepared to go through a coding interview with intense algorithms and etc considering that many interns have  not finished college yet? \n\nPS. Have university degree in a stem/engineering field",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/7w9h30/how_much_easier_is_it_to_land_internships/",
      "comments": [
        {
          "body": "Disney requires that interns:\n\n&gt; Must be enrolled in an undergraduate program at a college/university taking at least one class in the semester/quarter prior to participation in the internship program, AND returning to school for at least one semester/quarter at the completion of the internship\n\nSo it doesn't really matter, you're not qualified. Typically the interviews for interns/new grads are not extremely different.",
          "score": 5
        },
        {
          "body": "I barely got my first internship.\n\nI couldn’t keep track of how many recruiters were trying to get me an actual jr dev job.\n\n\nI busted my ass to get the internship.  I didn’t even apply anywhere for my first job.  All random recruiter emails.\n\nMy internship had a way more difficult interview than my first dev job.",
          "score": 2
        },
        {
          "body": "I found it much harder getting interviews for internships than new graduate.\n\nThe interviews themselves are typically easier though.",
          "score": 2
        },
        {
          "body": "It depends.  There are certainly cases where internships are more competitive than full time jobs.  A lot of large companies also don't hire interns unless you are currently enrolled in school so those might not work for you.  It would do you better just to shoot for full time.",
          "score": 1
        },
        {
          "body": "Depends on where you are. my experience is strictly in bay area:\nboth interviews are similar in difficulty but sometimes internship interviews are much shorter. \n\nI was able to land internships based on 1-2 phone screens and no onsite, half of them dont require onsite from what ive seen. Junior devs always require phone screens AND onsite",
          "score": 1
        },
        {
          "body": "disney at burbank? from what i saw they don't ask crazy algorithm questions, in fact most companies in LA don't ask those besides snap.",
          "score": 1
        },
        {
          "body": "I seem to have had the opposite problem as you. I had multiple offers for internships, but every junior developer job but 2 have ended with a \"we're pursuing other candidates\" email.",
          "score": 1
        },
        {
          "body": "Substantially easier to become an intern at Facebook than it is to become a full-time employee. An intern requires 2 on-site interviews or 2 telephone interviews. In either case an interview consists of two Leetcode medium questions and some prodding about your thought processes. I believe the requirement for a full-time employee is 5 such interviews. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Two Entry Level Offers: Cant Decide Which to Pick (Aerospace vs Small RF Company)",
      "body": "*I'd say Im a total newbie to this industry. I've lurked these forums for a while so I hope those more experienced could help me make an informed decision. Disclaimer:  the offers aren't as great as those discussed on here.*\n\n**A little about me:** I worked with USAF for the past 3 years but mostly in roles with little to no software development. Prior to USAF I worked in semi-conductors for a bit. My current salary is $88k. I was fortunate enough to navigate my way through the red-tape and landed in a project that gave me relevant experience sometime mid last year gaining experience in OS, linux, and concurrent programming n c++. I began applying sometime in Late Nov. Im in grad school expected to graduate fall 2021. With that said, my timing for job apps was never great and I struggle to find the time to apply. These may very well be my only 2 offers for a while.\n\n**Offers:** I applied to these 2 companies for entry level SWE roles. Boeing worked faster than expected and gave an offer at 88k with 15k bonus. I negotiated and received 92k with 15k sign-on bonus. At this point I  heard nothing from Company X. I was on a time crunch to accept the offer, so I accepted Boeings offer before it expired. Today, a week later, Company X reached out with a verbal offer of 110k. They will send out the official offer within 1-2 weeks. I will likely counter offer to offset Boeing's 8% matching (I will likely counter offer around 115k or so?). Anyways this is great news, I can finally leave the air force and go into software!  But I don't know which company to pick or why (or if I even can because I already accepted Boeings! This is a lesson learned to request for extensions in the future.)\n\n**Offer comparisons:**\n\n|Boeing (South Los Angeles likely with  minimal opportunity to WFH)|Company X (Bay Area but permanent full-time WFH)|\n|:-|:-|\n|Real Time Software Embedded Engineer II|Software Engineer|\n|Salary: 92k with 15k sign on bonus w/ standard benefits and 401k with 8% matching|Salary: 110k (no bonus) w/ standard benefits but 401k has no matching. Privately traded  no RSUs or plans to go public.|\n|Aerospace Defense but in their Space Division|Telecommunications (approx 100 employees) works on Routers, Modems, Gateways and recently in IOT enabled devices. Sounds like I would work on the backend for the latter.|\n|Real time embedded (i have no clue what I will be doing other than \"embedded\". I assume Windriver's IDE or some RTOS and non-commercial hardware)|Backend (work on backend/database/mobile for their recent IOT product line).|\n\nSome things on my mind (nothing in order):\n\n* I intend to leave defense and aerospace within couple of years (Im prepping for interviews to apply to Amazon/Disney as these are some places I'd like to work at someday in LA). I believe defense won't help me since the tech-stack is so different it wont help me get the experience necessary for these developer jobs (not for embedded role anyways).\n* Boeing has 8% matching while Company X has no matching. Seems like a huge factor as TC is higher in the long run with Boeing.\n* Maybe a factor but Company X is full time WFH. Boeing requires me to go on-site because of the hardware.\n* Gambling on small company = losing security clearance. Though I intend to leave the defense industry completely (for something like Amazon/Disney) the timing doesn't seem right with covid. keeping the clearance might be better for now and sticking to defense compared to a smaller company.\n* Again with covid, stability is everything and I think Boeing is more stable\n* I already accepted Boeing's tentative off (still going through pre-employment formalities). Am I locked in or what? Can I bail? Is it bad?\n* I could reach out to either managers  for clarification on jobs responsibilities but it sounds like everyone is hitting the holidays until early January\n\nTLDR: Applied to 2 companies. Didnt hear back from other company so I accepted the first offer after negotiating. After accepting a week later second company gives offer. I dont know what to do.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/kg6rzq/two_entry_level_offers_cant_decide_which_to_pick/",
      "comments": [
        {
          "body": "I don’t know how Boeing does it but I accepted an offer from a similar defense company in September and just went through their on boarding. My offer was conditional on a background check and drug test, when they sent out the email for this stuff there was an option that said “I am no longer interested in this position” so you are def not locked in.",
          "score": 1
        }
      ]
    },
    {
      "title": "Advantages/disadvantages of working at non-tech company as first job?",
      "body": "Im meeting with a non-tech company tomorrow. This particular company is a home furniture manufacturer. I was wondering what are the benefits and drawbacks of working as a software developer at a non-tech company for your first job?  \n\nThanks\n\nP.s. What should I answer if they ask Why do I want to work for them? Im not about that FANG life, (at least not yet), but I feel like saying that would mean that Im implying the work being done here is not important.",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/e0u0fw/advantagesdisadvantages_of_working_at_nontech/",
      "comments": [
        {
          "body": "You are looking at it the wrong way. This \"non-tech company vs tech company\" thing is not really an issue that should be divided along these lines. The dividing line is really on companies that see value in tech vs companies that don't see value in tech.\n\nDisney is a perfect example. Disney is not a \"tech company\" per se, but boy, did it invest a crap ton of money into Disney Plus and Hulu to try to compete with Netflix and Amazon.",
          "score": 14
        },
        {
          "body": "Currently I am in department of 'data-analytics' in Fortune 500 company. It was said to be the best company to work for in my country. I am directly hired, and this is my first job.\n\nThey dont have git server, no proper workflow, no code review, etc. Maybe someday I can improve this department, but again, I would have to learn a ton of things and convincing the management is not easy.\n\nIf I can reverse time, I would take unknown company that knows what are they doing.",
          "score": 3
        },
        {
          "body": "Disadvantage - you may not be using relevant modern tech and will likely be working with people approaching retirement with no motivation to change, learn, or advance their positions.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewing with Disney",
      "body": "Hi guys, I am just trying to document my journey interviewing with Disney. I am really excited and nervous about the opportunity and I really hope I get the job.\n\n5/11/2025 - I applied through a job ad on LinkedIn \n\n17/11/2025 - 18/11/2025 - the recruiter reached out to clarify my information and schedule the initial screening call.\n\n20/11/2025 - I had my initial screening call\n\nI am now just waiting and hoping I get to the next stage, the call was great and there was great energy. He said he would give the hiring manager my profile and should reach out to me to schedule the next round of interviews. I’m very anxious! \n\nHas anyone been through the process or have any advice in general It’s a UK based role and I never really know if a job interview goes well, or if I’m a god candidate. \n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1p6bzcm/interviewing_with_disney/",
      "comments": [
        {
          "body": "Update! \n\nI got invited to the interview round and I am very excited!!! Any tips and advice will be amazing!",
          "score": 1
        },
        {
          "body": "Hi, I’m on the same boat. Would you mind to tell me what questions asked during initial screen call? I assume it was 30 min, was there any behavioral questions included?",
          "score": 1
        }
      ]
    },
    {
      "title": "In-person interview at Disney, but live somewhat far away.",
      "body": "I've went to work at Disney World as a college program, and I loved it so much I wanted to stay, but couldn't because I racked up too many points (the last points were because I was so sick, couldn't even get out of bed...called in but still counted :() Anyways, a few months have passed and now that I'm eligible to apply for a job at Disney again, and did - and now I have to schedule an in-person interview but I live in Georgia (about a half-day or more drive) or so. I was willing to move to Florida if I was accepted but for an interview I'm not sure. I really want to go back, though... and I was looking into a phone interview but couldn't find any info on it. So the question is should I actually drive down there to do in-person interviews? e-mail them about my situation and ask them if there are other options like phone interviews? Did anyone make that kind of a commitment for an interview?",
      "subreddit": "jobs",
      "score": 11,
      "url": "https://reddit.com/r/jobs/comments/1in3gm/inperson_interview_at_disney_but_live_somewhat/",
      "comments": [
        {
          "body": "You should drive down there for an interview.  They want to talk to you in person.",
          "score": 10
        },
        {
          "body": "I'm not sure what these points are about... but if they let you go for any reason, and you've managed to secure an in-person interview: I would drive. You want to sell them on why you deserve a second chance to work for them. Driving all the way from Georgia would help sell them on how much you want to work there.\n\nBest of luck! ",
          "score": 5
        },
        {
          "body": "There is zero chance you would be getting the job if you don't want to do an in person interview. You gotta drive down there. And if you want the job that much, this shouldn't even be a question!",
          "score": 5
        },
        {
          "body": "Ok thanks everyone. Going to get ready to go down just need to schedule right. Can't wait but the most dreaded thing is actual driving...there's absolutely NOTHING on the road, lol.",
          "score": 1
        },
        {
          "body": "That must be one of the easiest places in Florida to get to; I'm sure you can find a bus or flight that'll take you there.",
          "score": 1
        }
      ]
    },
    {
      "title": "Did you get a job out of college without any internships?",
      "body": "I have applied and applied to so many internships and for some reason I’m not getting a single one. I’m making it to the final stage where I meet with people and it seems like it’s going so well. We talked for a long time and they seem to really genuinely interested in the conversation. But for the last eight months I’ve gone to so many interviews and keep getting denied.\n\nMy major is marketing and I’m trying to do any internship that involves it. It can be IP management or social media, human resources just anything. \nI know my resume is fantastic. I bring my portfolio that displays all my creative work because the job that I’m applying for involve needing proficiency in Microsoft office and adobe Photoshop. \nWhat am I doing wrong? And will I be able to get a good paying job out of college? \nIs there anyway way to learn what an internship will teach me at home?\n\nEdit: wow, I didn’t think this will blow up. I literally haven’t checked it since yesterday thank you so much for all the feedback I’m gonna read and respond to everyone now.\n\nEdit: To clarify about my resume, The only reason I say it’s fantastic is because recruiters at huge companies, for example Universal and Disney, say my resume spoke volumes but they rather have someone who has specific internship experience even though the experience I have is experience but it’s just not classified as an internship because it’s “freelance” work, which sucks. They also want me to have more guest experience since I work behind the scenes at Universal and not specifically in the park talking to guest every day.",
      "subreddit": "jobs",
      "score": 232,
      "url": "https://reddit.com/r/jobs/comments/fp0prr/did_you_get_a_job_out_of_college_without_any/",
      "comments": [
        {
          "body": "Yes. It was a miracle. But I do think internships are kind of overrated - several of the people I know didn't really learn, they were just cheap monkey labor for the company.",
          "score": 1
        },
        {
          "body": "No. I didn't do an internship and graduated with no experience (in 99).\n\nI had to take low level customer service slash tech support jobs for a few years until some doors opened for me.",
          "score": 1
        },
        {
          "body": "Start driving an Uber or work at a country club and try to make connections. It’s not beneath you and you’d be surprised by how many people respect the grind and the hustle if you are humble and hungry.",
          "score": 1
        },
        {
          "body": "Internships are valuable not just for learning hard skills, but for learning soft skills as well— navigating office culture and learning professional norms for your industry. Employers look for that experience too.\n\nIt might be worth finding a position that’s not 100% related to marketing but is still in an office— like admin— so you can have something to put on your CV.\n\nBut keep trying! Jobs are hard to come by, and now with the pandemic, even harder. Good luck.",
          "score": 1
        },
        {
          "body": "Got a job in a call center within a company, fairly quickly progressed into an accounts receivable role off the phones and worked my way up, am now a senior management accountant.",
          "score": 1
        },
        {
          "body": "I was hired a week after graduation. I’m a technical writer for a federal contractor (USA) and earn a decent salary. I did have previous experience in the field I’m in, so that helped. But, I haven’t been privileged enough, so to speak, to get an internship. I had to go about things a different way, including working unpaid giga in my college town. \nSo... don’t worry about it. :)",
          "score": 1
        },
        {
          "body": "Not right out of college (did a lot of interviewing), but I now work for a hospital as a data analyst and love it. Took about 3 months to find.",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone know any good companies that are hiring for remote work?",
      "body": "I’m currently looking for a remote job and I’ve been looking since 2022;\n\nI’ve gotten lucky enough to find some companies that were hiring like Paramount, Guinness World Records, and even Disney for social media manager but I’ve never heard back from any of them including companies I have found throughout the years;\n\nI’m into marketing/advertising, gaming, and social media and wanna be able to get into a good paying position with a well known company;\n\nI also watch Jazzy Mac on YouTube who helps people find remote jobs, I even applied to some of the ones she’s found and no email back regarding if I got an interview or not\n\nAnyone please, please help as I’m trying to move away from retail and dealing with customers 🙏🏻",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1c4ax7b/anyone_know_any_good_companies_that_are_hiring/",
      "comments": [
        {
          "body": "Have you checked WFHalert? It's a great email alert system for WFH opportunities, and it sends job postings. Might help you land something remote soon!",
          "score": 15
        },
        {
          "body": "Lol...",
          "score": 11
        },
        {
          "body": "Totally get your frustration, the competition is wild out there. While you're waiting on callbacks from big companies, you might want to try building up side income with platforms like **Freecash**. Some folks use it to earn doing surveys or trying out apps, and it can help ease the stress while you job hunt. Keep applying, your breakthrough will come!",
          "score": 3
        },
        {
          "body": "You and everyone else looking for work…",
          "score": 2
        },
        {
          "body": "Here are 75 companies that hire for fully remote positions: https://www.reddit.com/r/RemoteJobs/s/JrwA3jTTMo I’ve posted thousands of remote jobs. Check my profile and search for a job title or country.",
          "score": 2
        },
        {
          "body": "Also check all the different search sites, in your case onwardsearch might have some leads.",
          "score": 1
        },
        {
          "body": "Explore platforms like We Work Remotely, and Remote.co, which specialize in listing remote opportunities. Also, consider using LinkedIn to connect directly with hiring managers in your desired industry.",
          "score": 1
        },
        {
          "body": "Are you still looking? I saw on I think r/remote jobs or something someone said going to the career section of companies on their website to see if they actually have. Someone there found some remote position with Amazon like that. I’ve also heard that Otta is good, I only applied to a few jobs on there without tweaking my resume so I didn’t hear back from any from there but I know 2 people who have",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Does Disney hire international students for full-time roles?",
      "body": "Hi all,  \n  \nDoes Disney hire international students? For context, I am a STEM student who just started my OPT and am interviewing for Disney. They've never explicitly asked my immigration status but they've asked me if I needed sponsorship and I said no because I don't plan to apply for H1-B after my OPT of 3 years end. I heard mixed comments about this and now I am very confused and I don't know what to do.\n\nGetting a job at Disney has literally been my dream job and I just hope they give international students opportunities. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1l4fnh0/does_disney_hire_international_students_for/",
      "comments": [
        {
          "body": "Did you end up getting it ?",
          "score": 1
        }
      ]
    },
    {
      "title": "If I get this University job, how long must I stay until I'm able to move out of state?",
      "body": "Greetings, I'm a 30-year-old male living in Alabama and graduated from my university back in 2017 and the only work I was able to get after graduation was a couple internships (one of which was with Disney) and remaining work has been stuck in retail the past 5 years. I'm finally able to land a job with the university I graduated from, I'm due for an interview next week for office assistant. And I just don't want to sound like I'm being too confident or anything... but if I do in fact get this job, how long must I stay with the university until I can relocate and find another similar job like this in another state (say like Pennsylvania, Florida or California)? I've been told by my family that I need to stay at least for 4-5 years but I'm a little impatient because I want to move out of this small town and explore the world. It just annoys me that I've been stuck in the same place for ages and I want to get out while I'm still young. Any advice?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1gbco49/if_i_get_this_university_job_how_long_must_i_stay/",
      "comments": [
        {
          "body": "You need to work at least 2 years.",
          "score": 1
        }
      ]
    },
    {
      "title": "How do I tell a job that I just landed that i have a vacation next month?",
      "body": "I just landed a job and during the interview they asked if I had anything coming up in the next 2-3 weeks that could conflict with the hiring process. I didnt think to bring it up at the time but in May I have a trip planned to Disney, I just accepted the job offer, when and how should i bring it up?\n\nEdit: I was also unsure during the interview and told them that I would have to get back to them with specifics. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1juwakl/how_do_i_tell_a_job_that_i_just_landed_that_i/",
      "comments": [
        {
          "body": "Yes. Be transparent as you can. \n\nNever a good idea starting employment without telling them about your non refundable booked trip first. \n\nYou should shoot an email out asap or cancel.",
          "score": 7
        },
        {
          "body": "Cancel the trip or risk being unemployed. They specifically asked you. In their eyes, you just flat out lied. Not good.",
          "score": 4
        },
        {
          "body": "yikes. Is your trip non refundable? If yes just be honest with them, if it's an issue you just have to suck it up and cancel your trip. Bring it up ASAP. Give them time to plan a head.",
          "score": 1
        },
        {
          "body": "Wait. So they asked and you didn't think to bring it up? Did you forget about the trip or just really wanted the job? ",
          "score": 1
        },
        {
          "body": "Tell them ASAP",
          "score": 1
        }
      ]
    },
    {
      "title": "Job search for four months while I was preparing to graduate and these were my results",
      "body": "I had been finishing up my master's degree the past four months and had also been job hunting at the same time as I was dealing with my thesis. For reference, my job field is dealing with meteorology, so jobs are all over the place thanks to most people going to do broadcast positions (which my degrees aren't in).\n\nAfter four months, I got an otticial job ofter yesterday! I know the job market sucks right now, but I know y'all will find jobs.",
      "subreddit": "jobs",
      "score": 9,
      "url": "https://reddit.com/r/jobs/comments/1lls14f/job_search_for_four_months_while_i_was_preparing/",
      "comments": []
    },
    {
      "title": "Anyone else jealous or angry at people that love their job?",
      "body": "I really want to work for Disney corporate. I’ve worked in the parks. I have tons of management and operations experience. Yet can’t even get an interview or have my dozens of applications go anywhere other then received to no longer under consideration. \n\nThen I see all these people in manager positions blogging about partying in the parks all day and like not actually having to do work. How are they getting in. I can’t work the parks for 15 years and maybe get promoted. How are people getting jobs they like?\n\nI am a swm and I feel like it’s hopeless to apply at any big company. HR is mostly women and everyone hates the straight white guy right now. So as soon as that gets figured out my application goes in the trash.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/17vs77r/anyone_else_jealous_or_angry_at_people_that_love/",
      "comments": [
        {
          "body": "holy victim syndrome, batman",
          "score": 9
        },
        {
          "body": "I think your attitude is the problem.",
          "score": 9
        },
        {
          "body": "No one likes a victim, and somehow, it's ALWAYS obvious to everyone they meet.",
          "score": 3
        },
        {
          "body": "You being a single white guy is not the problem. You thinking of yourself as a victim and assuming leadership isn’t really working is the true problem.\n\nSometimes, the problem with not getting a job is self-inflicted. This sounds like one of those situations. Taking a deeper look at your attitude and how you view the world, as well as your qualifications for the jobs you’re applying for, might be a great first step.",
          "score": 5
        },
        {
          "body": "\nOne thing to note is sadly very few companies have a direct promotion path, especially from tier 1 workers like you’re talking about , into management, back of house, or the more white color side of the business.\n\nSo your best bet is to get hired as the exact roll you want at Disney, but for a completely different company. You have to get that exact job title on your résumé and a year of job  experience in that role at another company for at least a full year.\n\nThen you go back and apply at Disney at the position you want. I bet you will be hired. This time you have a year of experience doing the job, and have proven yourself. \n\nI’ve suggested this to students I’ve mentored in the past and it’s worked every time .\n\nOften the bigger companies can be pickier. They’re looking for somebody who has experience in the job role.  But the same big companies often do not have a direct pipeline for Frontline people to get there. They have no one to train them, no one to supervise them, and frankly, companies just don’t care. The big companies can put up a job posting and find hundreds of candidates with the exact experience already without having to train them. That’s what they want.\n\nIt doesn’t matter how fantastic you are on your front line position you are completely unproven in the back of house positions and that’s the problem \n\nUnfortunately, like I mentioned, few companies promote from within, especially from the front line tier 1 workers  aka customer service, receptionist valets, janitorial, mail room there’s basically no chance you’re going to escape from there and be promoted in the same company anymore.\n\nI think it’s incredibly stupid, but companies started doing this about 30-ish years ago when they dropped the pensions. 80s Reganomics for you. “It’s so much cheaper if you don’t train or invest in your employees it’s so much better for shareholders to get money.! “ that’s basically the logic behind if, just greed.\n\nHonestly, sir you are dead wrong about the white male thing. Sir, you as a white male have an incredible advantage like biased, astronomically large advantage over every woman in every might already out there. I know that’s hard to hear but bias and racism is still so strong, even the name of a person matters.\n\nI’m going to  post a  scientific research study that shows minority names are discriminated against, that’s just the name, to get to an interview. Also, in every case, the white male sounding name got the interview,  the job, the higher pay, or the promotion. More white men in management and leadership.\n\nA company is considered diverse if like 10% of the employees are minorities, think about that that’s 90% people that look just like you still!!!!\n\nhttps://www.nber.org/digest/sep03/employers-replies-racial-names\n\n More digestible article based on that\nhttps://www.shrm.org/resourcesandtools/hr-topics/employee-relations/pages/viewpoint-how-a-persons-name-can-prompt-hiring-discrimination.aspx\n\nThe reason the ads onlinehave a line encouraging women and minorities to apply is that they historically don’t apply. \n\nFor whatever reason, women and minorities are more likely to undervalue their experience and expertise and think they aren’t qualified when in fact, they are. So research found that putting a line in encouraging them to apply actually works. It’s still again only 10% out of the average companies workforce it’s minuscule you’re in the vast majority in the blessed positively biased group.\n\nhttps://hbr.org/2014/08/why-women-dont-apply-for-jobs-unless-theyre-100-qualified\n\nhttps://phys.org/news/2019-03-women-percent-hiring-men.html\n\nSo it’s not your gender and it’s not your race . It’s also not your fault it’s just a rigged system. \n\nYou do have to pay attention to your hard and soft skills the exact résumé formatting, learning how to sell yourself, how to communicate, how to send proper business emails, etc..\n\nYou mentioned you may be on the spectrum. I highly recommend finding a a therapist who can work on presentation and social skills and also a group called Toastmasters, which is invaluable for learning public speaking which you’ll need an interviews and any managerial or public facing role you have \n\nI know that job hunting is confusing and frustrating these days precisely because it is not based in logic but based in these incredibly damaging economic policies that started in the 80s and are just continuing to bear, rotten fruit.\n\nNow I’m hoping with some of this more evidence-based research, science and facts. I can help steer you in the right direction. \n\nBefore you make assumptions, go look at the research look at reputable places I look at colleges, public hospitals and museums with a good reputation, because generally those studies are not funded by corporate interests.\n\nGood luck 🍀 stranger you can do it!",
          "score": 1
        }
      ]
    },
    {
      "title": "I got a phone call about being a job opportunity candidate and I have a Zoom interview tomorrow morning, but it seems too good to be true.",
      "body": "Out of the blue, I got a call from a company which was even included in the caller ID. It seemed legitimate because the company seems to exist. It has a location which matched what the caller said (\"close to the \\*\\*\\*\\*\\*\\*\\* airport\") I reluctantly said yes as I am in need of a job and money and getting entry level positions after college are not easy. But I'm a little suspicious and skeptical. First, they said they found my resume on Careerbuilder which is not true as I do not have an account on that site and I took my resumes down from Indeed and Linkedin a week ago. They could have gotten my resume elsewhere when I did have it public, but he said Careerbuilder. So that is a little weird. Second, my education and work background is that of science and this job they wanted me for is marketing. It does not make sense that one in business would want to recruit someone in the science or technical field for marketing or sales. I even told the person on the phone that I have no business or marketing skill, just maybe a pipe dream of being CEO of Disney one day but that's it. But still, he insisted that I would a good fit as they liked my resume. That does not make sense at all. But either way I still promised to come to the Zoom meet tomorrow morning. What should I do? Should I attend this meeting and hear them out? Or should I not show up and never deal with them again?",
      "subreddit": "jobs",
      "score": 36,
      "url": "https://reddit.com/r/jobs/comments/11ermdq/i_got_a_phone_call_about_being_a_job_opportunity/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "This is likely a recruitment for MLM or another commission-only sales job. Decline the invite and move on.",
          "score": 85
        },
        {
          "body": "Sounds like the \"marketing\" jobs where you sell directv out of a Costco",
          "score": 14
        },
        {
          "body": "I would ghost them. Definitely not legit.",
          "score": 8
        },
        {
          "body": "I would skip it. There is almost no chance this is legit. Next time, ask “what specific item in my resume stood out to you?” Chances are they won’t have a response or it will be vague. Because they likely didn’t even see your resume. They cold call people hoping even a fraction they call will fall for it. \n\nThey can make the number look like it is coming from a legit business when it isn’t. Get their name and then look the company up online and call the number on the website. Verify that the person works there and that the appointment is legit.",
          "score": 7
        },
        {
          "body": "&gt;this job they wanted me for is marketing\n\nIt's a MLM.\n\nIf you have the spare time attend the group meeting and make sure to inform the other attendees. r/antiMLM should be a good place for information",
          "score": 3
        }
      ]
    },
    {
      "title": "I'm getting really tired of interviewers telling me I don't have enough experience for a role and then seeing a fresh graduate get the same role or one that requires more experience.",
      "body": "I graduated in 2020 with five amazing internships in the film industry at places like Sony Pictures, ViacomCBS, and Snapchat. Of course when I graduated, literally nobody was hiring. I managed to get a semi-adjacent job at a social media start-up and now I'm finally starting to get interviews at big name places since things are opening back up. But in a lot of interviews, they tell me I don't have enough experience because I couldn't find a film job when I graduated (along with 99% of the class of 2020). As if my internships don't count for anything.\n\nI think that's fair enough, but then I see 2021 graduates on LinkedIn posting their long acceptance speeches for jobs that I applied to that told me I don't have \"enough experience\" and sometimes for jobs that require even more experience. Then I go through their profiles and see that either they have similar internship experience or sometimes even LESS than what I have. \n\nI get it, part of it is luck and being at the right place at the right time. Maybe they interned at the place and their entry level boss was leaving and it made sense to hire them for that role. Or maybe their dad played a round of golf with the SVP of Marketing at Disney. But whatever it is, it's so frustrating and I don't know how to deal with it. Every time an interviewer says I'm a good culture fit but \"lack experience\", I wish I could send them screenshots of those god damn acceptance speeches. But I know I'm just being bitter.\n\nHas anyone else noticed that?",
      "subreddit": "jobs",
      "score": 99,
      "url": "https://reddit.com/r/jobs/comments/mr4ahh/im_getting_really_tired_of_interviewers_telling/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Don’t take any of this personally, I’m trying to help. \n1. Candidates with less experience are able to sell themselves. Your internships and past experience get you in the door, your selling ability gets you the job after interviews. Do you interview prep? Watch Andy Lacivita on YouTube.. he talks a lot about how you have to put in the interviewer in the future and how you solve their problems, not in the past. \n2. Bigger companies that it sounds like you are targeting are going to be way more competitive, just the nature of the game. Advice: target smaller to mid size companies that you can get a better title at and often better pay. Big companies have a lot of options and they *typically* pay less. \n3. Do they really tell you “you didn’t get a film job right out of college”? Or are you making an assumption? Either way, can you take some courses, certifications, or do freelance work to build up film experience?\n\nGood luck and keep your head up!",
          "score": 36
        },
        {
          "body": "How do you know other fresh graduates are getting the same roles?",
          "score": 7
        },
        {
          "body": "It's especially obnoxious when the interviewer(s) themselves talk about how they started working at the company right out of college. Like oh cool so you should understand the struggle yet you're directly contributing to it cool cool.",
          "score": 7
        }
      ]
    },
    {
      "title": "Is NBCUniversal even possible without being a former intern or page?",
      "body": "I've submitted too many applications to count at NBCUniversal and I've NEVER heard back (not even an initial recruiter call), which feels like every application goes into a void and that they won't even consider you unless you've previously been an intern or page. I've worked at other notable networks (WBD and Disney) and definitely have the experience for the roles I'm applying to, but it's truly feeling like it's impossible to get into that company otherwise and that feels so defeating! \n\nHas anyone else ever gotten even an interview @ the company let alone a job here without having been an intern or page or former worker at the company at all? I'm curious to hear your experience if so!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ezgnpl/is_nbcuniversal_even_possible_without_being_a/",
      "comments": []
    },
    {
      "title": "got an interview for a Disneyland Sketch Artist position. what should my portfolio look like?",
      "body": "I have a portfolio ready to go from my general artwork involving sketching and colored pencils, but if you’ve had this position or are in this position, what did your portfolio look like? what did it have in it?",
      "subreddit": "jobs",
      "score": 139,
      "url": "https://reddit.com/r/jobs/comments/dyicn4/got_an_interview_for_a_disneyland_sketch_artist/",
      "comments": [
        {
          "body": "Generally, your work should reflect the kind of things you'll be doing on the job. Not a sketch artist myself, but I work in the creative field and that's typically been the advice I give to others. So for this example, fully rendered pieces that you pour hours into aren't as relevant as what you're able to do within a span of minutes.\n\nBut more importantly, your personal skills will likely be a larger factor in this sort of position. You're there to deal with kids, families and the occasional Karen. Show that you're a person that can put a smile on each of their faces because in the end, they care more about that customer/visitor satisfaction more than the quality of your work.",
          "score": 53
        },
        {
          "body": "Congratulations, this sounds like an amazing role! You should check out lulusketches on YouTube. She’s worked for Disney and has some amazing portfolio advice videos. Best of luck x",
          "score": 68
        },
        {
          "body": "I am not even in the field but when I read that you got an interview for a Disneyland Sketch Artist, I was like \"damn, that's insane!\" Just want to say congrats for getting the interview, hope you bloody get that one hell of a position!",
          "score": 33
        },
        {
          "body": "Idk but that interview offer sounds sketch",
          "score": 27
        },
        {
          "body": "Just show what you’re capable of. Cartoony drawings, realistic, humans, animals etc. good luck, sounds like a dream job.",
          "score": 10
        },
        {
          "body": "Just came here to say that sounds awesome and good luck!",
          "score": 5
        },
        {
          "body": "No experience with sketching nor working for Disney but I work with someone who worked at Disney World for a while.\n\nYour position or \"role\" as they may put it is customer facing. Due to that, you'll want to smile a lot and show enthusiasm and a friendly demeanor in the interview. They want happy people. Combine that with pleasant conversation, as long as your portfolio is impressive, you should be fine.",
          "score": 3
        },
        {
          "body": "First of all, congrats !! This is a really big deal and hopefully you'll knock their socks off and go far with the company.\n\nYour post reminded me of an episode of 'The Employables' on A&amp;E a few months back. Season 1, Episode 3 shows a guy who is a high functioning autistic into creative drawing. Not to spoil it, but he eventually gets an interview with the local Highway Department.\n\nBeing autistic, you become obsessed with certain subjects. For him, it was highways. They asked him, we need to put in an intersection here and this is the amount of traffic we have, what would you suggest? He sat down and drew out the types of exits, the layout, etc., etc and they were blown away....and again not to spoil it...but they gave him a job.\n\nIt can be found on YouTube or TLC's web site. Here's the description: \" **Matt, 27, has a severe form of Tourette Syndrome that causes sudden violent body movements (tics), spitting and vocal outbursts, often triggered by being in cars or tight spaces. Nathan, 31, has high-functioning autism, also known as Asperger’s Syndrome, which makes it difficult for him to navigate social interactions; he also has an extraordinary obsession with roads and maps. Both Matt and Nathan have found their conditions to be a barrier to meaningful employment, but when experts Dr. Nancy Doyle and Dr. Ali Mattu reveal their strengths, they gain much needed confidence to explore the job market.** \"\n\nPoint being, just show what you're passionate about. Let your talent speak for itself. Don't feel like you need to go overboard. And remember, if it doesn't work out, don't get down on yourself. It just wasn't meant to be and there are many, many more opportunities out there. Best of luck!!!\n\nEdit: Just watched a local newscast story on him from his hometown of Anniston, Alabama. Found out he actually runs/maintains GeekAlabama DOT com. Not a professional site by any means, but are you kidding me? This dude is pretty friggin' awesome for sure. I think something like this is needed in my state. If there are geeks in Alabama that can appreciate his site, there have to be thousands in other states. lol",
          "score": 3
        }
      ]
    },
    {
      "title": "Why do I hate every job I’ve take ?",
      "body": "I’m 25F and can’t help but wonder if something is wrong with me. Yes I do have some mental health concerns but I’m medicated and feel like at some point I have to belong somewhere.\n\n16-18: work in restaurants. It is terrible but it’s all I can do at that point. I leave to work at sprint. \n\n18- I accept a job selling phones at Sprint. I mostly liked it until the company sold and the commission structure tanked. Then it was hardly worth my time. \n\n19- I work at disney world and a doctors office. I was busy but disney didn’t pay enough. I liked my friends and that was kind of it. I did enjoy “making magic” but it was exhausting and guests are rude. The doctors office had a horrible manager that gossiped and made me feel weird when I was there. I transferred to another location and still didn’t fit in. I wanted some upward growth and something I could stick in. \n\n19-20- I started working in leasing at an apt complex. 4 years go by and I like it for the most part.  Promoted to management and couldn’t handle the horrible co manager any longer. \n\n24- I start working in account management. I think it’s mostly okay but I feel miserable just like I did when I started the restaurants. I don’t fit in with anybody. There was no work/life balance so I felt I had to leave. I feel relieved when I don’t have to be at work. I begin trying to get back into property management because i enjoyed it the most. I thought. \n\n25- now I work in community association management and I absolutely hate it. The work load is terrible, the training is terrible, I thought I would enjoy not working with the general public but I’m bored and aggravated all the time. It’s only a matter of time before I walk away from this too. I have interviewed at other apartments and to even imagine going back to that career sounds awful. \n\nIn the mix I went to college, flight school, some state certifications, etc. I don’t fit in anywhere and I don’t know what to do. Oddly enough I feel like I’m mostly good at whatever I choose to do but I tend to grow bored and check out. \n\nWhat do I do? I can’t keep starting over or I’ll never find somewhere to stay. It’s driving me crazy. Is something wrong with me? Are my expectations too high? I like to think I should start a business but the way my attention span is set up… I don’t want to keep wasting money on school or hopping jobs. \nSomeone, anyone help me 😩",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/17w1nt7/why_do_i_hate_every_job_ive_take/",
      "comments": [
        {
          "body": "because every job is awful\n\nsays me, someone whos had over 20 jobs in the past 7 years",
          "score": 6
        },
        {
          "body": "I mean, no one *wants* to work. I really like my job but I’d still rather lay on the beach reading all day. Life costs money, and we have to figure out what we are willing to trade from our lives for how much money we get for it. More money = higher trade offs. There seems to be some blame in your post (rude guests, bad managers), so I’d investigate what made you leave those other jobs. What was so terrible about them? Focus on the job, not the title. Do you like working outside? Moving around and not being at a desk? Limited people interaction? Do you like “owning” something or being responsible to see a project through its different phases, or do you prefer executing a checklist of similar tasks each day? \n\nIs there a coping skill that you can learn that will help you with a job you did like? Like the co manager. Sometimes there is just no working with someone, but sometimes it’s possible to find a common ground that lets you get through your day.\n\nAlso, don’t rely on work for your total happiness. It’s nice to have a job that doesn’t suck. It’s nicer to have friends, family, a hobby, a special interest club, etc to look forward to.",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": -4
        }
      ]
    },
    {
      "title": "Advice on getting internship/job with Disney",
      "body": "Hello! I’m currently a Junior in University and getting a degree in Information Technology. It has been a dream &amp; goal of mine for work for Disney, specifically Walt Disney Imagineering. I applied for a few technical internships that I saw for Summer 2023, however I unfortunately was rejected for all of them, did not even get an interview. I wanted to ask if anyone has any advice on techniques for landing an internship with them? Or could give me some advice regarding my resume? Please let me know! If you also currently work or have ever worked for Disney I would really appreciate any tips!! Thanks in advance!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/160n2zy/advice_on_getting_internshipjob_with_disney/",
      "comments": [
        {
          "body": "Check out the DCP program! Idk if you’re applying to the one in Orlando, but a lot of people do that program for internships.\n\nThat will be the best and closest thing you can do to getting a job there other than brute applying on their site",
          "score": 2
        }
      ]
    },
    {
      "title": "Disney sd 2 interview",
      "body": "Got an invite for 30 minutes recruiter call from Disney, what’s the structure of Disney interview process.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oob2b1/disney_sd_2_interview/",
      "comments": []
    },
    {
      "title": "Technical interview with Disney data science internship. What to expect. Please help.",
      "body": "I’ve never done an internship or interviewed for an internship before but somehow got all the way to the technical interview for a data science internship with Disney. Any idea on what might be asked at an intern level? Will they expect you to know everything or are they more lenient on interns? Machine learning is not mentioned in the job description and the interview is only 30 mins long. I was told there’s no live coding. ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1cxhpu1/technical_interview_with_disney_data_science/",
      "comments": [
        {
          "body": "In my experience, internship interviews usually focus on your basic understanding of concepts rather than expecting you to know everything. They might ask about your projects or coursework related to data science, your problem-solving approach, and maybe some technical questions about statistics or programming languages you've worked with. Since there's no live coding, they might ask you to explain how you would approach solving a hypothetical problem or interpret data. Just be confident, show your passion for data science, and don't stress too much about knowing everything.",
          "score": 1
        },
        {
          "body": "My interview was pretty technical for the like first 2/3 and then behavioral for the last 1/3. The technical questions were about exploratory dataset analysis, unsupervised vs supervised ML algorithms, my experience with data visualization, and a SQL question. The behavioral questions were standard stuff about my resume and how I deal with people in various scenarios.",
          "score": 1
        }
      ]
    },
    {
      "title": "Frustration on Glassdoor Interview Reviews",
      "body": "Hello everyone, \n\nIm new to this community but, have been in talent acquisition for the last 10 years and worked at Meta, WPP and Disney. I have been looking through alot of posts as inspiration for a new platform idea to capitalise on what Glassdoors weaknesses. \n\nMy Friend and I recently came up with a concept that is an interview review website whereby you can anonymously share your interview experiences, including questions asked, company culture insights, informing others about ghost jobs, determining length of process and overall impressions in addition to some deeper analytics.  \nOnly some companies have surveys for candidates who have participated in this survey and although its useful for them to adapt the process, this information is also useful for future candidates to prepare for the interview. \n\nWould love any thoughts/criticisms/idea?\n\n  \nKindest\n\nJ\n\n",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1g3en4v/frustration_on_glassdoor_interview_reviews/",
      "comments": [
        {
          "body": "Am a nurse. \n\nI have been asked questions like, \"Tell me about your weakness?\"\n\nMy answer that I really want to say is, \"Dealing with stupid questions like yours.\" but I usually say, \"Green tea ice cream.\"\n\nAm serious.",
          "score": -1
        }
      ]
    },
    {
      "title": "Disney Case Study Interview",
      "body": "Does anyone have experience with Case Study interviews for Data Analyst position @ Disney? Would appreciate any and all insights or helpful tips ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1lpyjqw/disney_case_study_interview/",
      "comments": [
        {
          "body": "They love testing your ability to think like a business partner, not just a number cruncher. You'll likely face scenarios around park operations, streaming metrics, or guest experience optimization where they want to see how you structure problems, identify key metrics, and translate data insights into actionable business recommendations. The tricky part is that Disney cares deeply about storytelling and customer experience, so your analysis needs to go beyond just finding patterns in the data to actually understanding what drives guest satisfaction and business outcomes.\n\nThe good news is that Disney case studies are usually grounded in real business challenges they face, which means you can prepare by thinking about their core business drivers like guest satisfaction scores, wait times, revenue per guest, and content engagement metrics. They'll want to see you ask clarifying questions, break down complex problems into manageable pieces, and communicate your findings in a way that non-technical stakeholders can understand and act on. Since these interviews can throw some curveball questions about prioritizing competing business needs or handling incomplete data, you can use [interview AI](http://interviews.chat) to practice structuring responses to tricky case study scenarios - I'm on the team that built it and know how helpful it can be for navigating those complex analytical questions that require both technical skills and business acumen.",
          "score": 2
        },
        {
          "body": "Hello, may I ask what kind of questions do they ask for the case study interview? I also have a data analyst interview coming. I would appreciate any insights!!!",
          "score": 1
        }
      ]
    },
    {
      "title": "Recruiter Questions",
      "body": "I recently applied to a job and it's been about a week with no update. I know it is a little soon, but I reached out to a senior recruiter via an email a former coworker at the company (Walt Disney World) gave me. I haven't interviewed yet, but I wanted to express interest in the position. The recruiter said he would be happy to answer any questions I have, but now I'm stuck....what should I ask? I know roughly what the job looks like, it is a housekeeping role and I was a houseperson on my DCP, but I guess I'm just looking for polite ways to ask for advice on getting the job. ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mbjk60/recruiter_questions/",
      "comments": [
        {
          "body": "&gt;I know roughly what the job looks like, it is a housekeeping role and I was a houseperson on my DCP, but I guess I'm just looking for polite ways to ask for advice on getting the job.\n\nAsk about housekeeping and see if they have positions open, what is the way to apply and submit your resume. Recruiter is not going to know too much on what housekeepers do but first questions should always be if there are positions open and you were referred by a former employee.",
          "score": 1
        },
        {
          "body": "You just have to be patient and wait. There's nothing more you can do. They will contact you if they are interested. Continue to look and apply to other jobs. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Is this a good thing ",
      "body": "So a had an interview with the Dr it went great he told me the I have a lot of potential then he had me come in and meet the rest of the staff and I guess it's up to them if they all like me enough to work with me but I only met half of them for 5 minutes so basically the staff is supposed to discuss if they like someone from ' hi I'm blank and like lord of the rings and disney movies '  the staff went back to work and i thought that was it but i chose to stay and shadow for a  bit 3.5 hours later I'm second guessing and nervous about the whole thing. I don't know I can see why the Dr is letting his staff with the interview process but isn't that why you have probation periods? ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1e522bi/is_this_a_good_thing/",
      "comments": [
        {
          "body": "He let the staff meet you because they have to work with you. Being there for that long made it like a working interview. So the staff was watching and they’ll help decide.",
          "score": 1
        },
        {
          "body": "Just an update I was in the final two and didn't get the job because someone came in with 2 years of experience but they did really want me ans willing to keep me on file (Idk if that was just them letting me down easy ) I just sucks because I really did see  myself being there for years",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone with experience with art related interviews, what kind of portfolio did you show?",
      "body": "I need a Little help im so nervous for my interview at this caricature art place in Disney. \n\nMy question is, what kind of art examples do you show them? Is there anything specific reguarding my skills that I should show them? \n\nI have not dabbled in caricature art, but on the indeed post for the job, it says experience in caricature art was not needed. (Training for it would be provided) Of course though, I do art. I just don’t know what I would show them to really wow them or make them think “wow, this person really deserves this position!” You know? \n\nPlease help me 😭",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/17efnya/anyone_with_experience_with_art_related/",
      "comments": [
        {
          "body": "I’d put oc’s ur proud of and a Waise range of art pieces. Showing you have creativity and are open to adapt and try new art. Or that you already have a lot of art stiles. (If not then I dunno but most people dabble in other art styles to see if it’s for them at some point. You must have smt)",
          "score": 1
        }
      ]
    },
    {
      "title": "Marketing Internship Phone Interview",
      "body": "Hi everyone! \n\nNot sure if I should be posting this here or on a Disney subreddit, but I applied for a Strategy and Consumer Marketing Internship (television &amp; series) with National Geographic and I now have a phone interview coming up! I'm incredibly excited and really want to do my best. I'm sure the competition is insane, but this makes me so happy.\n\nI'm a non-traditional student, I'm a smidge older than the normal undergrad with a few years work experience. I'll graduating this semester with a marketing degree. I also am working towards gaining skills outside of a school that will make me more attractive marketing candidate.\n\nDoes anyone know what I should expect with a phone interview from NatGeo/Disney? I read a bit about Disney but couldn't find much over National Geographic phone interviews. Any advice would help!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/f34fgn/marketing_internship_phone_interview/",
      "comments": []
    },
    {
      "title": "Internship Offers: Paramount vs Disney",
      "body": "Hi!\n\nAfter several rounds of interviews, I've received two internship offers with Paramount and Disney over the last couple months and I'm super conflicted on which one to choose. Both are full-time (40 hours a week) roles. Here are some of the highlights/details of the individual roles:\n\nDisney: 4 Days in Office (Friday Remote), Lasts through at least December, pays $21.70/Hour, NYC-Based\n\nParamount: Option to be remote or in NY or LA, Summer-only internship (based off research, has the potential to extend through fall, but no guarantees). Pays $20.00/Hour. Already made offer and accepted.\n\nBoth roles align with my interests/long-term \"dream department\" and the individuals I met with all seemed fantastic. What should I do? Which would be the better company for \"opening doors\"?\n\nThank you for any advice or insights. ",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1br79zm/internship_offers_paramount_vs_disney/",
      "comments": [
        {
          "body": "An internship with Disney will get you a professional job for the next 10 years...  Disney has the advantage for offering a longer internship (through December) more to learn, more points on the resume, more contact to be made.",
          "score": 3
        },
        {
          "body": "Disney over Paramount any day. That's a golden ticket. Take it.",
          "score": 2
        }
      ]
    },
    {
      "title": "Tattoos",
      "body": "I have an interview next week and I have a half sleeve (Disney tattoos). I always covered up them in the past interviews because I didn’t want people’s eyes to go there first. Is it that big of a deal? Or am I overthinking it?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/17d5lut/tattoos/",
      "comments": [
        {
          "body": "What's the job? If it's creative, probably okay. If it's a formal place, cover them up. I generally wear a blazer or sweater to an interview, anyway.",
          "score": 1
        }
      ]
    },
    {
      "title": "I had the worst interview today",
      "body": "It was for a sales and marketing position.\n\nI drove 2 hours to get there, I arrived 10min early but he was running behind on his interviews so I waited around for like 30min. \n\nI used the restroom and didn't notice the floor of the bathroom was wet, guess the toilet leaked...my entire left pant leg was wet, thankfully you couldn't see that on black slacks but it was uncomfortable...but not as bad as the interview itself.\n\nThey also made you bring in a hard copy of your resume and references but had you fill out a forum that said the exact same info, thought that was overkill.\n\nHe didn't ask me a single question, I opened up my padfolio and he saw I had questions written down, and made me ask all my questions. The job description did not tell much about the job and the website was super vague so I asked typical interview questions like the ones my college professors say to ask...a list I had compiled on the internet (along with a few of my own questions I developed to get to know things).\n\nThe only question he really asked was when I could move there and I said I should have the money by the end of next week, that didn't seem to make him happy - I thought it was a good timeline.\n\nFirst question I wanted to know was if the job was commissioned based, he answered it like it was a stupid question but the job description nor the website stated this information. He then said \"I guess you know nothing about this job, let me tell you about it.\" Of course I didn't know, it wasn't stated...also he barely told me anything.\n\nI asked a couple of more general questions such as \"how is success managed?\" \"What is the hardest aspect of the job?\" Both of these he talked about himself and not the position, he did that a lot.\n\nI asked a couple more and he stopped me and said \"are these off the internet?\" (Why does that matter? I couldn't form my own questions if you give me nothing to question). I told him \"of course, I do a lot of research on interviewing techniques before I go in for an interview.\"\n\nThen he started talking about how he started in the sales and marketing and worked his way up into an office job. The job description said all promotions are internal. I told him that was great that he achieved that so fast and that I hope to work my way up to an office job because i enjoy them. He rudely stated \"I'm not hiring for an office position.\"\n\nApparently this job has you stand out in parking lots at stores like Sam's Club and talk to people and ask them if you could look at their windshield and if you find a crack you recommend them fix it at a certain location (This was not in the job description). He kept talking about how they partner with tons of big companies like Disney, so I figured that meant they did other things than find windshield cracks so I asked about what other opportunities there were and what kind of trainings I would receive. He said \"you look at windshields, what kind of special training do you think you need? None.\"\n\nThe worst thing happened when he answered a phonecall and a text message during the interview.\n\nI was so upset but I didn't say anything - didn't think it was my place to do so, I wish I had though. I kept going like everything was alright until he rudely said \"are you done with your questions or do you have anymore?\" I told him I had two more that I would liked answered before I left.\n\nI wanted to cry but I kept it in until I got to the car, I have never had such a rude interview before.\n\nI have been debating on calling him tomorrow to discuss his interview etiquette but I'm not sure... also considering Glassdoor.\n\nI know I didn't get the job because he had 16 interviews and was only going to call 4 back later that day for another interview the next day.\n\nI was never given a chance, I dont understand how people can be so rude. If you are so checked out of an interview because you don't want to hire that person, do one of two things: end the interview early, or sit though it like a professional and conduct it as such.\n\nI'm glad I didnt get the job though, I'd never want to work for a jerk like that, plus I dodged a real bullet with that line of work, I would not have been happy.\n\nEdit: I don't know if it was all a sham or if he already had people picked in his mind, or if he was just plain rude. At one point he mentioned that when he first applied he wondered if it was a pyramid scheme but decided it wasn't, still unnerving to hear those words.\n\n\nTL;DR: Had a bad interview where the guy was rude verbably, and for the fact that he answered his cell phone and text messages during the interview.",
      "subreddit": "interviews",
      "score": 7,
      "url": "https://reddit.com/r/interviews/comments/4z53qk/i_had_the_worst_interview_today/",
      "comments": [
        {
          "body": "It seems you made out ahead.  Don't take it personally, he probably had other shit going on personally.  Decided to take it out on you.  You don't want to work for anyone like that anyway.  Good luck!",
          "score": 3
        },
        {
          "body": "It seems you dodged a bullet there.",
          "score": 1
        }
      ]
    }
  ]
}