{
  "company": "docusign",
  "post_count": 29,
  "exported_at": "2026-01-18T17:44:53.271Z",
  "posts": [
    {
      "title": "I got OA link from DocuSign but I'm not free at the given internship date. What to do ? This is URGENT",
      "body": "The internship starts at 12th May. But I'm not free until mid August. I'm confused as to what to do. \n\nShould I give the OA and interview and just hope that the company might shift the date when I request them to ?\n\n\nThe OA is tomorrow so please tell me what should I do. I am very confused. Please someone guide me. ",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1jqjfzc/i_got_oa_link_from_docusign_but_im_not_free_at/",
      "comments": [
        {
          "body": "You're barely at the OA stage. You're worrying about things you shouldn't be worried about. First pass the OA  and get an interview scheduled before you worry.",
          "score": 15
        },
        {
          "body": "Internships don’t start whenever you want. Just take the OA and if you pass, tell them you can’t actually do the internship. At the very least, it’s good practice.",
          "score": 4
        },
        {
          "body": "Nah just let the OA expire",
          "score": 3
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "There is no magic answer. You have to decide which is more important if you can’t do the internship and whatever else you have planned at that time.",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "update on getting the director of engineering position instead of DBA one",
      "body": "edit: thank you for all your kind responses. i am as disappointed as youare.\n\ni am making an edit to notify you with an additional update.\n\nearly this morning i had a voicemail from the manager himself.\nhe was apologizeing and saying that therecruiter had mixed up the dba and\ndirector salary profiles and mistakenly told me the salary range for the dba\nposition because he was under the impression that was what i was applying and\ninterviewing for. (yeah right.)\n\nunfortunately, the 180k-200k was still a 'clerical error' on oneof their\nhr people's part (interestingly a 'clerical error' that\npersisted until yesterday) and that the real range in the budget for the director\nrole was 80k - 95k, but hes going to work with hr and try to get me the\nmaximum possible. he said they usually never pay that high and even the \ncto there isn't making that much. \n\nhe told me that i sould get back to him ASAP.\n\nwhen i opened my email just a few minutes ago here's what i found:\n\nhttps://i.imgur.com/WLfOf03.png\n\nive emailed him back tell him im not interested any longer and gently hinted that\ni prefer to work with people that a little bit more mature,\nand hes yet to respond.\n\n(ive redacted it to preserve anonymity.)\n\ni really am holding my tongue back on this one and there\nare some choice words i want to say but i dont want to get blackballed\nor banned from anywhere so thank you all for the very helpful advice,\nsadly it didnt work out but i guess it is what it is\n\n------------------------------------------------------------------\nhere is the link to the old post: https://www.reddit.com/r/cscareerquestions/comments/7kt7mu/was_given_incorrect_assessment_but_did_it_anyways/\n\nI bring some good and bad news:\n\nthe good: they said they'll be very interested and gave me tickets to fly me out to nyc from des moines plus 1 night at the westin in times square and a $150 allowance to travel around manhattan and see some things during the day on saturday.\n\nthen I came in at 6 pm, interviewed and they asked me several round of various technical and math questions -- but nothing like the leetcode challeng e. then that transitioned in to some management and people skills questions, but turned in mainly things about my experience and my stories over the 47 years ive worked.\n\nthat went on for a total of 2 hours, then we went to a fancy restaurant for a late dinner and then the manager and a lead engineer and i talked even more.\n\nthat was on friday. we wished each happy christmas and new years and i left feeling very good. i flew back on saturday.\n\nthe bad news: the recruiter called me today and told me that i got the job but unfortunately the salary range was 'mistated' and it is really 60k to 75k, instead of the 180k-200k base salary they said before, and they will be more than happy to give me 75k.\n\ni said whatwas the $180-200k range that was communicated by both him and the manager during the interview and discussionsprior?\n\nhe said, \"Soo, sorry, Mr. SG, that was a clerical error. Heh. My deepest apologies, Mr. SG. Sorry for the inconvenience. Heh. I'm going to email you the docusign-\"\n\ni said no thanks and then he said, \"I can ask mymanager if he can do eigh-\" to which I said, \"no thank you, im not interested\", wished them the best of luck, said goodbye and hung up.\n\nhe called back 15 minutes later but i didn't pick up. \n\ni dont know what to think :(\n\nthanks for listening and the great advice anyways. i appreciatei t.\n\nalso i want to give thanks to the very nice person who gilded me. Thank you",
      "subreddit": "cscareerquestions",
      "score": 118,
      "url": "https://reddit.com/r/cscareerquestions/comments/7mk0im/update_on_getting_the_director_of_engineering/",
      "comments": [
        {
          "body": "Director of Engineering in NYC... 75K. I can smell the blatant bullshit coming from this company through my laptop. That's insane. Did they somehow find out what you were paid before? \n\nEven so, if they liked you enough and felt you were qualified for a Director role in engineering, which must be a tough position to fill... 75K... I'm gagging.",
          "score": 141
        },
        {
          "body": "&gt; i said whatwas the $180-200k range that was communicated by both him and the manager during the interview and discussionsprior?\n\nSo they gave that number not only in the vacancy text but also **during** the interview?\n\nIf that's the case it's not a mistake but simply a tactic. They try to get people to spend a ton of their free time based on a high salary and cool sounding job title. And when you get through that they pull the bait and switch and say 'my bad, it's really a junior dev role for 75k'. They are trying to abuse the [sunk cost fallacy](https://youarenotsosmart.com/2011/03/25/the-sunk-cost-fallacy/) principle (in that you spent a lot of time already) to get you to sign that contract.\n\nIt's the shittiest of shitty recruitment tactics and I would urge you to name and shame them to prevent others from wasting time on them. ",
          "score": 70
        },
        {
          "body": "Sorry to hear that dude.\n\nIf they call again, pick up. They might be bluffing and actually willing to give you  higher pay. Pick a number that would make you say yes, and just keep saying no until they offer it.",
          "score": 45
        },
        {
          "body": "&gt; 60k to 75k, instead of the 180k-200k base salary they said before, and they will be more than happy to give me 75k.\n\nThere's a service called The Work Number. Their pitch is 'we'll handle employment and salary verification requests'. Then they can farm it to a variety of places. Credit card companies. Potential employers. Insurance companies. Market research firms.\n\nHonestly, blowing them off for a day is fine. They'll call back tomorrow. Here's the deal: it's expensive as fuck to live in NYC. Nevermind the obviously manipulative lying, you can't accept that salary in NYC. If/when you take their call tomorrow, try something like the following script:\n\n THEM: Thanks for taking my call.  \nYOU: Not a problem.  \nTHEM: So I was chatting with the executives and they're willing to go as high as 80k.  \nYOU: And I'm willing to go as low as 150k. New York is an expensive town, after all. Especially compared to a place like Des Moines. I'm frankly shocked by how low your offer is, and if the budget is truly that low then I'm taking on far more risk than expected.   \nYOU: Additionally, the recruiting process here has been consistently subpar, making multiple mistakes, and that's going to be an obstacle in my duties to recruit and retain talent into the firm.  \n\nFrom here, this kinda depends on data I don't have. This feels like a young startup, given you interviewed at 6pm on a Saturday. The way to measure a role is by the number of people below you. A director is typically considered a 'manager of managers', meaning your organization would have something like 20 - 50 people below you. But titles are free, and cash constrained startups will happily gift you a director title if you want it (hint: employers can tell when a director is in title only). Assuming you're talking to a series A startup, where you'd only be managing a team of 5-10, here's where you go from there.\n\nTHEM: Well, as a startup, we're trying to preserve our capital as much as possible to extend our runway.  \nYOU: I get that startups are cash constrained. As it happens, so am I. I can't pay rent with equity.  \nTHEM: Well, our founders are currently paying themselves minimum wage.  \nYOU: Well I'm happy they've built up a warchest for themselves. But they're also substantial owners in the firm, and I've not even heard a hint of equity in the compensation package.  \n\nBut I really don't know what to tell you; $75k is chumpchange in NYC, and startup equity is a lottery ticket, and this firm appears to be run by fools. Even if they offer you some kind of equity, you really have to value it at zero unless you really believe in the firm's ability to execute -- sell, build, bill, collect -- and your ability to execute your bit.",
          "score": 33
        },
        {
          "body": "[deleted]",
          "score": 56
        },
        {
          "body": "You should work 10am to 1pm every day, stating that you misstated your availability. \n\nWhat are they going to do, fire you?",
          "score": 48
        }
      ]
    },
    {
      "title": "Applying to New Grad positions but not technically a new grad",
      "body": "Hi everyone!  \n\n\nSo I just got laid off from DocuSign last Wednesday and I've started the recruiting grind right away. I just graduated from undergrad in May 2022 and worked for 3 months. I've been looking at a lot of applications from different companies and a lot of the non-new grad entry level positions require 1-3+ years of experience while new grad positions require you to be graduating anywhere from between December 2022-June 2023. Due to my very short tenure at my first job out of college, many jobs are unavailable to me. That said, I do still feel like a new grad and I want to try applying to these positions. Do you think companies would still go through with the new grad interview process with me despite me not fitting their listed criteria? I don't want to waste my time applying to these new grad positions if they just auto-reject me. Any advice would be much appreciated!",
      "subreddit": "cscareerquestions",
      "score": 32,
      "url": "https://reddit.com/r/cscareerquestions/comments/xzb8va/applying_to_new_grad_positions_but_not/",
      "comments": [
        {
          "body": "I can tell you for sure, amazon won't care.",
          "score": 41
        },
        {
          "body": "It never hurts to apply. Lots of times job descriptions are written by hr, not the development team",
          "score": 11
        },
        {
          "body": "I also graduated in May 2022 can confirm your still a new grad. Its still within the year so its fair game I've had a lot of luck applying to new grad roles.",
          "score": 10
        },
        {
          "body": "It varies by company but I would think most places would still consider you a new grad given youve only been out of school a few months. It may be tricky though because if you put professional experience on your resume, the auto-filters might pitch you out as a new grad. I guess if I were you I'd apply to both new grad positions (maybe without your docusign experience) and low experience positions. Include your experience on those.",
          "score": 21
        },
        {
          "body": "You’re still a new grad",
          "score": 5
        },
        {
          "body": "Was a DocuSign intern this summer with no chance of getting a return offer at this point. How has your search been going so far? It seems like new grad positions are scarce at the moment.",
          "score": 4
        },
        {
          "body": "&gt; graduated may 2022\n\n&gt; 3 months experience \n\nYou're still a new grad",
          "score": 3
        }
      ]
    },
    {
      "title": "Linkedin Scams? - Brookesource Recruiter scam?",
      "body": "I am about to graduate with a CS degree and live in California. I applied for a job on Linkedin for a remote position at a company called Brookesource for about $80,000 a yr. I get a return email saying I had been advanced into the second round of hiring and I was asked if I was still interested in the position. After stating I was still interested I was given a interview questionnaire, all of which were... off, as well as a statement of my expected pay roughly $145,000 a yr. The questions  could easily be answered with a quick google search and one or two personal experience questions. Weird. I knew my resume needed work and didn't stand out so I was already a little suspicious but I know imposter syndrome is real and I am not used to the hiring culture in tech jobs so I continued. \n\n&amp;#x200B;\n\nA day later, on a Saturday, I get an e-mail asking why I haven't submitted the answers. I comment to him that I expected him to be out of the office and was planning on submitting on Tuesday (Monday was Martin Luther King Jr. Day) so I could be sure my response wasn't buried by a weekend of unread emails but sent him the answers for good measure. Two days pass.  \n\n\nLate night Tuesday I am told I have been chosen to be hired I was not being offered about $130,000, I would be given a check to purchase a brand new Mac computer with all the bells and whistles and I should send him my name, address and email address to be added to the contract. I sit on the email to ask some people I know about whether I should or not but I end up sending him the info. He sent back an email that he expected me to print out and sign as my contract.  That is when I blocked him. My brother in Christ, you work for a tech firm that does contract work for fortune 500 companies and you don't have Docusign, or even the ability to export this non-contract to a pdf?!  \n\n\nAre scams like this normal on LinkedIn? I don't see it spoken about often but the Brookesource website seems to get it often enough to have a page stating that they only use emails ending in '@brooksource.com'. Has anyone else experienced this, what were they after?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/19ezsxr/linkedin_scams_brookesource_recruiter_scam/",
      "comments": [
        {
          "body": "Common fake check scam\n\nhttps://consumer.ftc.gov/articles/how-spot-avoid-report-fake-check-scams",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "Just for clarity, it’s not Brooksource that’s the scammer, it’s whoever was impersonating them. I actually worked with brooksource as a contractor and they were great. Helped me get into a contract to hire role.",
          "score": 2
        },
        {
          "body": "https://www.southside.com/blog/post/job-scams/#:~:text=Fake%20remote%20jobs%20may%20try,you%20to%20a%20scam%20vendor.",
          "score": 1
        },
        {
          "body": "The fake check scam has been around for decades. Every few years, scammers find new ways to \"dress up\" the scam. The newest iteration is with fake jobs.",
          "score": 1
        }
      ]
    },
    {
      "title": "Incompetent recruiter. what are my options?",
      "body": "**Situation**: I am in the final stage of candidacy at a FAAN***G*** company. Recruiter and I verbally negotiated and came to a happy agreement on total comp. Few days later she said **it was officially approved** and I should get the docusign contract within 48 hours. 48 hours passed: radio silence. I contact her and she leaves me on read all day, only to come back and say she made a mistake on the paperwork and **the comp was rejected**. She then described a TC package that was **less** than the original agreement. I told her \"absolutely no.\" She went back to comp review with \"candidate rejects the offer, counters with $XXX\", where XXX is the originally-agreed-upon TC.\n\nI suppose I could wait to see how this last maneuver works out, but honestly she is misrepresenting the situation by saying I am countering. I am not countering, I am asking them to honor our original agreement.\n\n**Questions**: Should I go full Karen and ask to speak to the manager? If yes, should I try to get the manager's contact details from the recruiter, or go around to the original sourcer and see if they can help me out? Or should I just chill and see what happens next?\n\n**Everything past this line is a supplementary rant:**\n\n**This is not the recruiter's first mistake.** I have been dealing with her for **4+ months**. She straight up ghosted me after the virtual onsite, and I assumed they were passing on me. Turns out I got all positive ratings from interviewers, but she just forgot about me (and my voicemails and emails). She reached out **two months later** like \"oh hey, where'd you go??\" Other than that big f-up, it has been death by 1,000 paper cuts. Every time she says she will get back to me by such-and-such a date, she fails to do so. Every milestone in the candidacy process that has a deadline (set by her), that deadline has been surpassed.\n\nFinally, as a personal affront, in her attempt to get me to accept the low offer, she tried to convince me that base and equity were equivalent in value. e.g. an offer of 200k base and 50k equity is the same as an offer of 50k base and 200k equity (not the actual numbers we are working with). As an educated professional (hell, as an average adult), thats one of the most disingenuous things I have ever heard. Anyone who has ever been anywhere near a bank account or credit card or a mortgage understands the time value of money, and concepts like volatility, risk and liquidity. Like, bish, if base and equity are the same, then give me 250k base and 0 equity!\n\n[Seems like others have been down this road before](https://www.reddit.com/r/cscareerquestions/comments/anjajb/comment/eftxnz0/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/vywbar/incompetent_recruiter_what_are_my_options/",
      "comments": [
        {
          "body": "You can maybe contact a more senior recruiter somehow, but I don't think you'll be able to (or that it would be appropriate to) contact the manager who checked decided they'd like you on the team. This is a recruiter issue that the manager typically has no control over.\n\nI'd try to speak with someone more senior; at any point in the process was a more senior manager in the CC or contacted you directly? I know it'll depend on company, but when I interviewed with the Rainforest a more senior recruiter contacted me / called me prior to the onsite.",
          "score": 5
        },
        {
          "body": "The recruiter isn't going to admit to their boss that they made a mistake.  I.e., promised you X but the actual offer was for less.  The recruiter probably is more willing to lose you as a candidate than try to fix the situation.  I.e., they'll just tell their boss \"candidate rejected offer\" rather than explaining what happened.\n\nA better question is: Why do you think this is a good place to work?  If they're this incompetent with recruiting someone they want to hire, how do you think it will be to actually work there?\n\nExcept for their search/ad cash cow, what exactly have they invented that's so great and profitable?  Android and YouTube were acquisitions.  Gmail is nice but only makes a tiny amount of money.",
          "score": 5
        },
        {
          "body": "That is a tough and shitty situation. Here's the problem: I'm all about possibly going over her head on this, BUT she might have fucked up on the comp being approved in a way that the company would still not approve it even if they knew all the details. Meaning it will be irrelevant that she is horrible at her job at the end because the company just wasn't going to ever pay the agreed upon (between you and her) total package. But she needs to be fired for this as I'm sure you aren't the only one being messed with.\n\nMy experience with the few FAANG recruiters that have reached out me has been only positive, I'm surprised....especially from G as they've been top notch.",
          "score": 2
        }
      ]
    },
    {
      "title": "Software Engineer at DocuSign",
      "body": "Has anyone here worked or interviewed at DocuSign recently? I have a virtual onsite coming up and looking to get some information about what to expect for the interview.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/r8dop3/software_engineer_at_docusign/",
      "comments": [
        {
          "body": "I don't work at DOCU but I'd proceed with extreme caution if they give you an offer (their stock basically got halved today, -43% in 1 day) and I'd expect lots of people to jump ship soon",
          "score": 5
        }
      ]
    },
    {
      "title": "Help! Can't tell if opportunity is worth the risk",
      "body": "I am currently a senior IT business analyst looking to make the formal jump to a Product owner/manager. \n\nI'm currently in healthcare, and have it all right, I'm just burned out and the opportunities don't exist at my company. \n\nI had a recruiter from Saicon reach out for a business analyst/PO position contract to hire for Walmart. The pay would be $50/hour, and is about 30% more than I make now. I want to take it, but my gut is telling me no. \n\nTo start off, I think the firm outsourced to India which isn't bad, but the recruiter or HR rep don't understand verbal english. So phone conversations go nowhere. The second red flag was when the recruiter lied about me getting the position and started asking for my social. I reached out straight to my interviewer and he said he didn't make a decision yet. Also when I asked the recruiter if I'd have insurance, can take time off, he said yes to all of it. Yet the paperwork from HR listed my position as a computer programmer (all docusign btw, no workday for onboarding) without insurance. \n\nI told them when I have proof from Walmart I got the position I'll fill out the paperwork. Finally this week a person who is english proficient reached out and sent an email screenshot of Walmart confirming to move forward with me. I reached out to the interviewer from Walmart to discuss long term career expectations to make sure this purely a 6 month contract and we chat tomorrow. \n\nSo I feel trapped between a rock and a hard place. I would love the opportunity and experience working somewhere like Walmart could offer (it's supply chain tech), however I am STRESSED about having anything to do with Saicon. There are SO many red flags I'm questioning if it's even worth the risk. Has anyone heard or worked with Saicon? What would you do in my position or if you've been in a similar experience would you advise?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/n5uvax/help_cant_tell_if_opportunity_is_worth_the_risk/",
      "comments": [
        {
          "body": "If you want PM experience, just take it.  Getting the first PM job is the hardest.  \n\nObviously do you research on glassdoor and other forums, but it just sounds like a body shop.  \n\nWhat's the worse that can happen, you lose your current low paying job?",
          "score": 1
        },
        {
          "body": "&gt; The pay would be $50/hour, and is about 30% more than I make now.\n\nDon't directly compare the pay between a contract and full-time role.  The general advice I've ready says to subtract at least 20% from contract roles to make up for the lack of benefits and security.\n\nTo your main question, I wouldn't take this role.  Keep in mind my perspective, though.  I tend to have a relatively low risk tolerance when it comes to jobs.  I strongly prefer direct-hire roles to contract roles.  I prefer larger companies to startups.  I prefer companies that offer good benefits.\n\nAll that said, the main reason I wouldn't take this role is because of Saicon.  There are just too many red flags here.  Keep in mind you would be working for them, not Walmart.  I wouldn't want to deal with them for at least six months.  And also keep in mind it's entirely possible after six months that Walmart decides to end your contract or even extend it instead of hiring you.  This would be a hard pass for me.",
          "score": 1
        }
      ]
    },
    {
      "title": "Offer but they're really quiet and slow to respond",
      "body": "I'll try to keep this short \n\nI interviewed with a company -- starts with U and rhymes with boober -- in SF \n\nWhen they sent me the offer, they didn't call me, they just emailed me a docusign offer letter, which I signed \n\nI emailed my recruiter and the hiring manager saying the start date in the offer was before my grad date (I'm still a student).  I didn't get a reply back until 2 weeks later, my h/m said that my recruiter (cc'd in the email) would get back to me on this and change the start date to 2-3 weeks later. \n\nThis was late January and haven't heard back from them since\n\nI don't want to keep emailing them if they're busy, but I also want to make sure they didn't like forget about me or something...\n\nThe place I interned at last summer reached out to me recently saying they have an opening for me (I'd rather work at U-Boober though). \n\nIs there a chance they'll rescind me for no reason or something?  If they do, how far in advance would they be required to notify me?  I hear a company can rescind \"for no reason\" if they have budgeting issues or something.  \n\nI understand I'm being paranoid but I don't want to say no to my last-summer-internship-company until I'm 100% locked in with boober \n\nThanks everyone \n\n",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/83jt84/offer_but_theyre_really_quiet_and_slow_to_respond/",
      "comments": [
        {
          "body": "Number 1 lesson of job hunting: Never sign an offer that isn't finalized. You should've asked them to replace the start date and send you a new offer letter with the corrected date. \n\nWith respect to rescinding: You're in the United States. We have no real rights when it comes to jobs. [They can rescind whenever they want, no notice is required.](https://www.cio.com/article/2436771/careers-staffing/careers-staffing-nine-things-you-need-to-know-about-rescinded-job-offers.html). Most companies don't do this unless some serious issue crops up (i.e. you lied about your qualifications, background check fails, or money is pulled).\n\nEmail the recruiter and ask for an update. If you don't hear back from the recruiter, hit up the hiring manager and ask them to look into it. \n\nIf that gets you nowhere, you should really reconsider working for 'boober'. A company that can't even give you the time of day to sort out an offer isn't really a company that respects your time. If you can score jobs in SF, you have a lot of opportunity open for you.",
          "score": 4
        },
        {
          "body": "Just reach out, they have the option of ignoring your email if they're too busy. On the other hand if you don't reach out they might have the exact impression of you as you have of them right now, that is you don't care about them.",
          "score": 1
        },
        {
          "body": "Do not stop aplying until you start. Companies will blow you off",
          "score": 1
        }
      ]
    },
    {
      "title": "US company asked me (resident of another country) to complete W8 form, send my national ID, and to sign a consulting agreement on Docusign to start their \"paid trial portion of our interview process\", is that a common practice?",
      "body": "I am interviewing for a remote software engineer position for a company located in NYC. I am not a US nor Europe citizen so I am not familiar the common practices there. The company sent me a W8 form and asked me to fill it along with sending a copy of my id, and a written confirmation of my participation. After all that is received they will send me a consulting agreement through Docusign. \n\nIs all that a common practice? and is it safe to send/sign these documents through Email? I feel like this is an overkill for just a technical assessment. Could this data be used in a malicious way?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1cs53ex/us_company_asked_me_resident_of_another_country/",
      "comments": []
    },
    {
      "title": "Highspring/Intuit Scam",
      "body": "I used ChatGPT to compile the info I wanted to share:\n\nI’ve been contacted by a recruiter for a QuickBooks Online Live Expert contract role via email. Everything initially looked legit: the company (Highspring/Vaco) has an official website, corporate phone numbers, and recruiters with @highspring.com email addresses.\n\nThe process has gone like this:\n\t1.\tRecruiter Contact:\n\t•\tRecruiter’s email: kimberly.garcia@highspring.com (official domain).\n\t•\tLater, another contact: justine.mcgury@highspring.com (also official).\n\t•\tEverything matches Highspring’s corporate address in Brentwood, TN.\n\t2.\tApplication / Tracking:\n\t•\tI received a link via Aplitrak, a known applicant-tracking system. The link was long and included a Base64-coded ID that decodes to something like morganturner.91549.5403@vaco.aplitrak.com.\n\t•\tFrom research, this is standard ATS behavior — it forwards applications to the recruiter while tracking source. Not inherently suspicious.\n\t3.\tBackground Check:\n\t•\tI was asked to complete a background check through InstaScreen (scoutlogic.instascreen.net).\n\t•\tInstaScreen is a legitimate pre-employment screening service, often used by staffing firms.\n\t•\tHowever, I haven’t fully verified the job offer yet, and providing sensitive info (SSN, DOB) without confirming legitimacy feels risky.\n\t4.\tDocuSign Job Offer / Onboarding:\n\t•\tI received the offer via DocuSign. It looks legitimate (docusign.net), but:\n\t•\tThere’s a typo in the contact email.\n\t•\tThe attached benefits packet is for 2025, not 2026.\n\t5.\tMy Thoughts / Verification Steps So Far:\n\t•\tVerified recruiter emails match official corporate domains.\n\t•\tCross-checked Aplitrak, InstaScreen, and Highspring’s reputation — all appear legitimate.\n\t•\tDecoded the Base64 ad ID in the ATS link to confirm it’s routing to Vaco/Highspring.\n\t•\tConsidering calling Highspring corporate line (844‑880‑8226) to confirm recruiter identity and onboarding documents.\n\nI had a teams interview with Kimberly Garcia, the following day I had a teams interview with another recruiter. I also completed an eSkills test but the software screenshots were very dated. \n\nI got offered the position after the second interview, they said they were reaching a target of 100 new hires by 12/1 and I need to get me onboarded quickly. Everything keeps seeming legit but the typo in the onboarding docs, the vague requested info in it (name DOB and address) and 2025 benefits packet make me wary. \nThe recruiter is on linked in and so are all the other copied email names. But their profiles dont seem very personal. \n\nI may be overthinking it. \n\nHours are PST, pay and hours are verified in the job offer. \nThe background check expires tomorrow. I forwarded emails to intuit and Highspring to get confirmation on these employees but the background check needs to be completed by tomorrow. \n\nWhat’s the risk of submitting the background check through scout?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1p0lei7/highspringintuit_scam/",
      "comments": [
        {
          "body": "So this position is for Intuit QuickBooks, but you haven't actually interviewed with anybody from Intuit? You've only interviewed with a couple people from this Highspring company?\n\n\nThat seems very suspicious. Also, it's common scammer behavior for them to rush you along and make you feel a sense of urgency (\"complete this by tomorrow or you'll lose the job offer.\") It's designed to make you ignore your better instincts.\n\n\nI will say though, if this is a scam, it's an incredibly sophisticated one. I'd try calling Intuit and see if you can get ahold of somebody to confirm that they are actually using this Highspring company for recruiting, and also if it's normal to receive a job offer without ever interviewing with somebody from Intuit.",
          "score": 1
        },
        {
          "body": "I am among one of the people hired for this starting date as well. And I’ll admit, I had some reservations regarding the hiring process just because it was so quick but it seems to be legit and I’m hoping for the best going forward.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is this a normal hiring process or a scam? (Insight Global + Kaiser Permanente)",
      "body": "Hi everyone,\n\nI talked to a recruiter from Insight Global about a Network Technician job at Kaiser Permanente (on-site, contract role).\n\nFirst, I had a short interview with Insight Global. After that, they sent me a DocuSign form. The form asks for:\n\t•\tMy full name\n\t•\tMy date of birth\n\t•\tThe last 4 digits of my Social Security number\n\nThey told me Kaiser requires this information before they will interview me.\n\nSome details:\n\t•\tThe recruiter has a real LinkedIn profile and works at Insight Global\n\t•\tThe email came from @insightglobal.com\n\t•\tThe document came through DocuSign (docusign.net)\n\nI’m still uncomfortable giving the last 4 digits of my SSN before I even interview with Kaiser.\n\nIs this a normal process for staffing agencies and healthcare IT jobs, or does this sound suspicious / like a scam using Insight Global or Kaiser’s name?\n\nHas anyone gone through something like this before?\n\nThanks.\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1qbaxqb/is_this_a_normal_hiring_process_or_a_scam_insight/",
      "comments": [
        {
          "body": "Hi OP, I’ve worked with many Fortune 500 companies and international entities. I hate when their legal, compliance, HR departments, including their staffing personnel get this greedy and discourteous. Here is a courteous professional message that I would send, that I have dictated, and cleaned up for you to use as you wish…\n\nHello,\n\nThank you, I’m interested in the role and happy to move forward. Before providing DOB and SSN last 4, can you confirm: (1) the Kaiser req ID / submission system you’re using, and (2) how that data is stored/used at this stage?\n\nAs a policy, I don’t share DOB + SSN details prior to speaking with the client. I’m happy to provide what’s needed after the Kaiser interview (or at conditional offer). If you need a unique identifier now, I can provide birth month/day only or another candidate ID.\n\nBest Regards,\n\nOP",
          "score": 4
        }
      ]
    },
    {
      "title": "Does a background check usually mean you got the job?",
      "body": "I’m a self taught developer and interviewed at a company today and it went amazing, it really felt like I was just having a conversation with the interviewer. They sent me a background check document via docusign just now and I was wondering what the likelyhood I got the job might be? I filled out all the required forms on it but I left some stuff blank or “N/A”\n\nEdit: I got it :D",
      "subreddit": "jobs",
      "score": 134,
      "url": "https://reddit.com/r/jobs/comments/1an26ke/does_a_background_check_usually_mean_you_got_the/",
      "comments": [
        {
          "body": "Usually there is a contingent offer made before a background check but if not going through it means you Arena final candidate at least.",
          "score": 41
        },
        {
          "body": "They are paying an outside source for verification most likely , so You are ahead of all the candidates who do not get the back round check , but given the limited information provided I'd still say its a good sign",
          "score": 18
        },
        {
          "body": "Temper your expectations. You never have a job offer until you actually have it. And a thousand things can still go wrong. Even if you get an offer, they can rescind it. And even if you get a job offer and you accept, they can still rescind it.\n\nI had to learn that lesson the hard way when the latter happened to me once.",
          "score": 10
        },
        {
          "body": "I have 5 references who got a background check note before HR called and made an offer. Very good sign.",
          "score": 11
        },
        {
          "body": "[removed]",
          "score": 8
        },
        {
          "body": "A background check costs a lot of money. They are only conducting them for candidates they are serious about. Otherwise, they would spend way too much money. While it's a good sign, it's not a guarantee. If something concerning was found in the check, or something changed with their employment needs, it could all be canceled. \n\nMore often than not, I'd say it's a good sign you're getting hired.",
          "score": 9
        }
      ]
    },
    {
      "title": "Received offer letter, cannot tell if scam",
      "body": "I received an offer letter today for a job I have been interviewing for. As for a timeline of events, they are as follows:\n\nI applied for the job on 5/13 via Indeed.\n\nReceived a message on Indeed on 5/14 expressing interest to interview me. I replied and got no response. Followed up on 5/16 and then received a message on 5/20, then my first call, and had my first screening.\n\nHad a follow up call on 5/21. Did not hear back, but it was a holiday weekend, so I figured it may take a little extra time. I follow up yesterday 5/27 via Indeed (where all of our written communication has taken place) and then received a message today asking for my email address so that they could send me an offer letter. I did not receive a call first where I could express verbal acceptance, which is pretty normal in my industry.\n\nThe offer letter looks legit for the most part, but there’s a few red flags. Under the PTO policy, it says that the PTO is accrued in accordance with NJ state laws (where I live and the company is based). I don’t believe NJ has a mandatory sick/PTO policy, so that would depend on the company, no?\n\nI have not met anyone face to face - no virtual interviews, no in person interviews. I responded to the last message on Indeed asking if I could come tour the office before signing any documents. They have not responded yet, but I am hoping for a response tomorrow. I also cannot find the name of the HR Administrator that sent me the offer letter via Docusign on LinkedIn, Google, or anything. So I can’t even verify if she’s real. I checked their LinkedIn and they have people working there, for several years now, but I still have a gut feeling something is off.\n\nAlso, my offer letter says they would like it signed by 6/1 (Sunday) and that my start date is 6/2. I told them I could start immediately, but we never discussed a start date prior to this offer letter being generated. The offer letter was sent via Docusign.\n\nI can’t tell if this is a scam, and if it is, it’s a really good one. I can name the company, but I wasn’t sure if that’s against the rules. Any and all help is appreciated - thank you for reading!\n\n*edit: I can also include more information if anything needs any clarity - first time posting here and not sure if I included everything that needs to be included!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1kxzse2/received_offer_letter_cannot_tell_if_scam/",
      "comments": [
        {
          "body": "Just call the company directly. Find their contact information on their website, and call them up. Ask their HR office to verify that the offer is legit.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "My Daughter who is in HR says An offer letter should have: \nname of co;\nTittle of the job you are being hired for ;\nDirect supervisor name;\nSalary or hourly rate of pay;\nWork hour’s;\nTraining timeline;\nHours of training ;\nAll benefits that come with position;\nAddress of where your working; \nNeed to disclose background check if applicable; \nStart date ;\nNeeds a employer signatory- HR rep or C Suite ;\n\nIf none of this is on there, I don’t recommend signing the letter\n\nShe says you shouldn’t have to hunt for co info or chase info down. Sounds suspect.",
          "score": 1
        }
      ]
    },
    {
      "title": "Logistics Company Scam",
      "body": "I was testing waters in the job market when I applied for a position on Indeed. I was contacted a couple weeks later by what appeared to be their careers/HR team. However, it was a .team domain rather than a .com. I didn't think about it too much and thought maybe it was an extension or outside resource of the company. \n\nAnyways, I was contacted by a William Parker who asked for my availability. I responded and he then asked me to set up an interview with a Katherine Wilson by contacting her on Teams. Odd already.  He provided attachments of job description and company info with the real company letter head and address.  Believable for now. \n\nOnce I contacted her, she asked if we could conduct a chat-based interview that day. Red flag. She stated it was a new method that the company was using; I assumed again that the company had outsourced their recruiting. She said written communication was essential to the role and this was part of the interview process. I had time so I went through it. She asked 9 questions related to the job and they seemed valid. After interview, I asked her a couple questions and she was very descriptive in her responses. I asked her specific questions to the role and she provided accurate responses, almost as if she was a former employee or had access to company SOPs. I was convinced it was real and believed there would be a live follow-up interview.  After interview, she then asked for 2 references and I provided them. \n\nThe next day, she told me to expect a phone a call.  I received a phone call  but it appeared as spam \"client services\" on my phone so I ignored it. Another red flag. She messaged me and told me they had attempted to call me. So I checked my call log and sure enough the phone call was from the area code that of the real company. There was a voicemail from an Operations Manager with a heavy foreign accent.  I returned the call and spoke to a \"Tom Schmidt\", but I could barely understand him, major red flag. He asked me a few questions such as: how would you rate the interview process, why do you want to work here, and when can you start. He said they checked my references but I knew they hadn't yet because I had just spoken to them that day. I confirmed after the call they did not. Red flag again.  He then offered the position and said to look out for an email from William Parker.  \n\nAfter hanging up, I quickly got an email via DocuSign with the offer letter and a maxed out salary. The 2nd page of the offer letter was a direct deposit form which was required to sign. This instantly confirmed my suspicions and I stopped there, never submitted or filled anything out.  I started investigating everything. That's when I researched the . team domain and also could not find any of these names on LinkedIn. I called the real company the next day and they stated it was a scam. They had received multiple calls already and have reported it corporate. I sent them an email to their careers page as well.   \n\nJust raising awareness on how these scammers are getting creative. I've heard other stories about individuals even putting in 2 weeks notice. Scammers are posing as real companies and they are using the same tactics on LinkedIn and Ziprecruiter across multiple industries. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1m48b30/logistics_company_scam/",
      "comments": [
        {
          "body": "Your first mistake is you used indeed.",
          "score": 2
        },
        {
          "body": "Yeah it's all spam and Bots. Just trying to get your information so they can sell it in my opinion. I too am in supply chain and it is a boondoggle",
          "score": 2
        }
      ]
    },
    {
      "title": "Craigslist Job Offer: Was I scammed?",
      "body": "1. During the phone interview for the sales position advertised on Craigslist, I’m offered the job. Remote sales job with Capital Remodeling.\n\n2. I’m told to text my SScard and my DL to the interviewer. After that I will be receiving DocuSign PPW to start position. This is on Friday morning.\n\n3. Friday, don’t receive anything.\n\n4. Today (Monday) I call the company directly and ask if there is someone there by that name. Yes, they say. And the company does advertise on Craigslist. \n\n5. I text the interviewer again. He says ppw was sent on Friday. I verify email address, he says he will have it resent. \n\n6. Early this afternoon around 1:00 p.m. Still nothing. I text interviewer. He says he will take care of it.\n\n7. Now it’s 4:30 p.m. and still no paperwork. \n\nDid I get scammed? If so, what should I do?",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/158m7ea/craigslist_job_offer_was_i_scammed/",
      "comments": [
        {
          "body": "Please tell us you didn’t text your social and your DL to them…",
          "score": 16
        },
        {
          "body": "Is this Capital Remodeling in VA? Have you tried contacting them from the number on the website? Seems like somebody is using them to scam people, wouldn't be the first time.",
          "score": 3
        },
        {
          "body": "This has to be a scam. There is no reason to text your ssn and definitely not ss card.\n\nCheck with all 3 credit bureaus and freeze your credit file. Just remember if you need to do anything g with your credit yourself you will need to unfreeze it.",
          "score": 3
        },
        {
          "body": "Definitely a scam. Never text someone you don’t know information like that. A business will use an hr program with a secured network.",
          "score": 3
        },
        {
          "body": "Yes you got scammed",
          "score": 3
        },
        {
          "body": "Never EVER send photos of sensitive documents or information over text. A real employer would use some sort of HR system or other background/verification system for that info. The fact that you were solely communicating over text initially in and of itself was a huge red flag",
          "score": 3
        },
        {
          "body": "If it sounds too good, too easy, pays too much, asks for personal information, is done via text….. it’s a scam.",
          "score": 2
        },
        {
          "body": "Also, you'll have to watch out for unemployment scams and tax return scams using your info. Not to mention rental (car, house, etc) scams. Might be best to see if you can file a police report. At least that way, there will be a paper trail if your identity gets used.",
          "score": 2
        }
      ]
    },
    {
      "title": "Please help me understand this onboarding process",
      "body": "I interviewed via MS Teams call and saw the team and manager about the job. \nThen received an email by HR requesting ssn, address, bday for background and drug tests. \nThen received docusign offer letter asking for the same info along with the regular job duties, non compete disclosure, etc. \nI called the company via google maps to verify if they were legit and asked if they also sent personal info via email when being hired they said yes. \nWhen I asked if there was an alternate method of providing the personal info they said no.\nHR works remotely at another US State.\nI do not have a official start date outlined in the offer. It is contingent upon completion of all onboarding and your manager will be in touch to discuss start date.\n\nTypically do job offers ask for personal details such as this? Is this secure even if it is via docusign? \nI checked the alternate signing method via docusign’s main website to view the offer letter. \n\nWhat should I do? \n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1iuk61r/please_help_me_understand_this_onboarding_process/",
      "comments": []
    },
    {
      "title": "Job offer revoked ",
      "body": "Two Thursdays ago, I went in for a face-to-face interview with a director after having an interview with HR on the phone earlier in week and clearly discussing salary. I wouldn’t have wasted my time going in for the face-to-face if I had known that, it was not within my target range. I killed the face-to-face and could tell that I was going to get an offer. I received the offer two days later. I not only received an offer letter via email but I also received an email to DocuSign the offer and to send it back without receiving any sort of benefit information prior to me signing the DocuSign. There was no way I was not going to negotiate, and there was no way I was not going to sign this DocuSign without knowing any of the benefits. I was shocked to see that the offer was completely lowballed and did not indicate any benefits within the offer or any vacation time. Of course, a few days later thought it over and negotiated the salary and asked to have the benefits and vacation time outline for me. I was then sent the handbook and was shocked at how terrible everything looked. I lost all excitement and had red flags. The Director came back and did not move the ball on salary, which I was disappointed in. I wrote back one last email to him and told him that for it to financially be worth it for me that I needed additional money. Days went by and crickets. I heard nothing from him last week when my start date was supposed to be yesterday. Well on Saturday I looked at my email to see that the DocuSign offer had been rescinded and revoked. Then I received a follow up email stating that they hired somebody else. This is how I was treated prior to even being on boarded. I can only imagine how I would have been treated if I had accepted the job. My gut told me no on this one and I’m glad!! ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1gq3fsk/job_offer_revoked/",
      "comments": [
        {
          "body": "I'm glad you went with your gut! Major red flags.",
          "score": 2
        },
        {
          "body": "You avoided a shitstorm. I get that the economy is bad and finding a job is extremely difficult at this time, but you shouldn’t sell yourself to this company that will treat you like a diseased animal.\n\nThat director is pretty much proof of how spineless he is in not ever responding to your email. \n\nIf any company wants “loyalty” from employees, maybe they should start treating them with fair pay and have the decency in responding to salary/pay rate lol.",
          "score": 1
        }
      ]
    },
    {
      "title": "Bad Boss: Now I’m In Charge",
      "body": "\n\nBad Boss Story Time:\n\nSo I was working at a company for 6 months when I had an unrelated injury that required emergency surgery &amp; needed to go on FMLA for four long months due to limited mobility. Before my injury I loved my employer and colleagues as we were a well functioning team and everyone got along well. When I returned, our Director had given notice and there was a replacement that had been hired to commence employment the following January. For about a month of my return, everything went smoothly as we awaited our new leader. When we met our new boss, I didn’t get great energy but being someone who prides themselves on their work ethic, I was sure I would win her over with my work product (that was a delusion). Soon after she settled into her role she began to implement changes to our processes; we all adapted without complaint. One day the new boss asked me into their office, they complimented my organization &amp; the labels on every file and my clear sense of direction. As I took in the compliment, things took a turn. The boss then proceeded to ask me to label all of their files and cabinets, because they loved the label maker look. Confused by this request, and also a bit slighted (being the only woman of color) as I was not an administrative assistant or secretary, I responded that I could always add a label maker, on her behalf, to our supply order. She didn’t like that, her entire demeanor changed and she then cut the conversation short and I went back to my cubicle. Shortly after this exchange, she began to nitpick anything I turned in requiring her approval or signature. It created this constant back and forth of time sensitive documents and I perceived her to be doing this on purpose. I tightened up every single thing she could nitpick and began submitting literally perfect documents that she couldn’t refuse to approve or sign. So she assigned me a new duty that required training from our deputy director. The deputy was amazing, kind and informative, we developed a great relationship. However, they were rusty on the process and expressed guidelines needed to be updated and approved by our HR department since it was related to hiring. I completed the project, received all the approvals but she began to nitpick that as well. Constantly choosing to invalidate a document over minuscule reasons such as she didn’t like the printing format of Docusign so she would reject documents unless they were hand printed &amp; singed (action that didn’t align with our policy but okay).  \n\n\nTime went on and I continued to put my best efforts forward, improved &amp; learned from every mistake and was starting to feel confident in not only my abilities but my contributions to our team. So what does the new boss do to knock me down a few notches? She sends me an email detailing every mistake that I had made since her arrival without mentioning a single accomplishment (and there were many).  I felt like I was deflated in confidence, even the deputy didn’t understand the tone of the email, they believed I had done a great job. But I was determined to stay and turn this around, continued to submit excellent work products and started learning higher level processes. So she then decides to change my supervisor from the deputy to one of our recently promoted colleagues. His office was across the floor, several rows away from us, I requested to move my work station there since he was my supervisor now. AT the time, my work station was directly in front of this directors office and she would constant glare, state and try to figure out if I was on my phone. I do not engage in “don’t use your phone” policies unless it’s actually affecting my work load. If I have downtime I’m not going to make up a task out of thin air if I have done absolutely everything I was required to do, as well as work for others just to contribute. I  am adult and I will use my phone, how I would like, and on my time, but I will always make sure work comes first. She began to pester my new supervisor to write me up for phone usage but he refused because I was doing my own work AND his most of the time. Seeing he was on my side, she refused to allow me to move my work station, mostly so SHE could micromanage the air I had to breathe. \n\nThings calmed down for a while because I complained to our union about their WFH policy. One of my colleagues still within their probationary period was allowed to telework while I had seniority and had been recently denied DUE TO MY PROBATIONARY STATUS. However, the union was practically useless, I never really felt protected by them. The grudge the new boss would hold would be felt immediately. Since she could no longer complain about my work product, she began to constantly seek dress code violations as an excuse to harass me. Constantly making comments and sending me home during work hours in two different occasions, one incidence accompanied by security because I was wearing a linen shorts women’s dress suit and “shorts” were not allowed in the office (yes it was summer). I was furious, this boss had consistently made attempts to undermine my abilities, humiliated me by bringing up mistakes we had previously discussed in private in the company of my colleagues as a way to embarrass me. The list could go on, this was so beyond toxic I started having panic attacks about coming to work. It was the worst I had ever been treated my entire life. \n\nAfter being escorted by security and my colleagues assuming I was fired I returned to work. Everyone was shocked that I had been escorted from the building over a dress code violation, never-mind business slack shorts. From that day forward, the gloves came off. She had become accustomed to receiving requests from senior level management, forwarding them to me and having me build graphs, reports, even presentations. Once she received the work product, she would then slap her name on it and claim it as her own. Why? Because she was a boomer who didn’t even understand how to use excel. Yes, this “Director” only in title couldn’t even really understand how to use any of our softwares…. At one point she asked us to develop a training lesson on how to operate Docusign. Yes, you read correctly, she wanted a training on how to fill in the LABELED fields when sending out a Docusign. It was so insane. When she would usually ask me for a report or audit of information condensed into a report, she would normally send me the email of the senior manager requesting the info. I began to send the finished product directly to the senior manager negating her ability to pass it off as her own. I was then banned from emailing senior management and she no longer made those requests. (Hehe. Thanks, I love that for me.)\n\nHer next form of attack was to constantly blame it on the staff if something had not been completed (that was her duty to complete) or if she didn’t read the email pertaining to that subject she would make the insinuation that it must not have been communicated to her. I began responding to the emails with absolute sass. I would make it clear it was on her desk waiting for her signature for the past week. One time, she had executed a document, forgot, and responded to a senior level management email with: “Where is this document? It was your responsibility and I haven’t seen it!” Of course I was irate, so I responded with a few deadly words: “You already signed it, it’s in the digital file as well.” 🤭 Needless to say, she was mortified and embarrassed. Oh well. She then stopped responding to emails without asking me in person first, which could’ve saved her a bunch of strife but I digress. \n\nWhen I decided to become combative, I also began to apply for other jobs. The boss was always complaining about our medical appointments and time off, even though she had no legal right to do so. The terms of our employment also didn’t give her the ability to deny reasonably submitted requests which meant 14 calendar days prior to the absence. Due to my injury and frequency in therapy appointments I had very little PTO to go interviews in person. So I was doing a ton of virtual interviews, but at this point, I didn’t care who knew that I was seeking employment elsewhere. It was clear she wanted me to leave, my duties had been diminished to a glorified secretary and that was not my job title or description. So what did I do as a form of malicious compliance? I started booking our conference rooms and using their equipment to conduct my interviews by using my lunch hour in exchange. I knew this made her furious but she also wanted me to leave so she would just be evidently irritated about it but wouldn’t address it out loud. It was nothing short of hilarious to watch her want to complain but having no ground to stand on. Removing her control clearly drove her insane. \n\nIn the end, I found a new position within the same company structure. I ended up at a level higher than hers in management, making a very close wage to hers, but the difference was that she had 15 years of tenure, I had been with the company a little over a year. The icing ? The role I was awarded makes final decisions on what my previous bosses can or can’t do within their department &amp; ironically those decisions are now at my discretion. Ain’t life grand ?! 🤣",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/1cc26eg/bad_boss_now_im_in_charge/",
      "comments": [
        {
          "body": "Not enough to make \"life grand\" but good for you. Let's see how your company splits the pay-outs after that big annual profit. That's when you find out if life is grand or not. LOL",
          "score": 1
        }
      ]
    },
    {
      "title": "Got a written offer in form of an employment contract, but it wasn’t signed on their part",
      "body": "Hi there!\n\nI’m turning to you for an advice because I don’t know what to do.\n\nSo, after interviewing for 2 months I finally received a verbal offer which was followed by contract of employment for me to docusign. \n\nI signed the contract and gave my notice at work 10 days ago, but still haven’t received a signed contract. \n\nOn Monday I asked the hiring manager about it and he answered me straight away that he’ll contact HR and get it sent. However, I didn’t get the contract or any further info.\n\nShould I reach out again or would that seem pushy and untrusting?\nShould I be worried?\n\nOh also, might be important - my start date isn’t for almost 3 more weeks. \n\nThanks guys.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/17rio3p/got_a_written_offer_in_form_of_an_employment/",
      "comments": [
        {
          "body": "Sorry, I contacted the recruiter, not the hiring manager.",
          "score": 1
        }
      ]
    },
    {
      "title": "Job Application Process for Remote Positions?",
      "body": "Hello!\n\nWould anyone be able to share with me what a job application process is like for a remote position? I've primarily worked with on-site positions and have no red flags with which to figure out whether an e-mail is a scam or not.\n\nSo far, here's what I've been receiving. I don't recall ever applying to these companies, but the responsibilities of these roles are similar in nature to what I am looking for. \n\n* E-mail comes from DropBox/Docusign/HelloSign with a PDF detailing the position and the hiring manager's e-mail from a similar-looking domain. \n* The interview is done on Zoom Messenger / WebEx / Signal \n* The e-mail includes a code to enter the interview\n* Additional recipients show a GMail account",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/14retk2/job_application_process_for_remote_positions/",
      "comments": [
        {
          "body": "For me there hasn't been much difference in the application process because a job is remote.\n\nI've typically still had screening via phone or zoom, followed by an interview. And I work with real people.\n\nWhat you are describing I've often seen in scam job postings.\n\nEmails should come from company domain\nYou should generally be able to see the job posting on the company site or have a company site to refer to\n\nAnonymous apps.like Signal , Telegram are used by scammers\nUnless a general group email is sent to other candidates,  gmails involved is sketchy.",
          "score": 2
        }
      ]
    },
    {
      "title": "Hired and Agreement Signed - But Job Won't Start for Another Month. Is it Normal?",
      "body": "I was offered a position yesterday and DocuSigned the agreement (as has the company's CEO, so the agreement is fully executed) for the full-time permanent position. My job is not set to begin until mid-July. I have never had such a delay between my acceptance of an offer and the actual start date and am worried that this may mean that they are still interviewing in the meantime to see if someone better comes along.\n\nI do have to fly out to get my equipment from the employer, so maybe they have to arrange around this as well, but from what I understood, they would have needed someone for the job for a while now, so the delay makes me wonder.\n\nDoes anyone know what I should expect? I'd love to hear from people if this may be a red flag because otherwise, a one-month-delay actually means that I can travel and have some fun in the meantime, but I don't want to go into my vacation doe-eyed. Should I still be looking for jobs in the meantime just in case they back out of the offer?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/o3kuig/hired_and_agreement_signed_but_job_wont_start_for/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Yeah this is no big deal at all. You have the job. A month before starting could be a bit longer than average wait to start but honestly not by much. Maybe the person’s position you’ll be filling isn’t finishing up until around that time. Whatever the reason is, they would not hire you just to keep looking for candidates",
          "score": 4
        },
        {
          "body": "I wouldn't worry about it, I've had delays between offer and start date be a month or more. Maybe they have some red tape to sort through before you get started or they're trying to coordinate your onboarding with other hires.",
          "score": 2
        },
        {
          "body": "I wouldn't worry about it, but it wouldn't hurt to ask. It could be they have a number of people starting and want them all to get on-boarded at the same time. Or it could be a budget or financial calendar issue. Or it could be someone is out of the office that you'll need to work with.  It's not abnormal and there should be no problem if you ask they why.",
          "score": 1
        }
      ]
    },
    {
      "title": "Received an offer without an offer attached",
      "body": "I've never done offer negotiation before, simply signed the last two I got as they were entry level jobs with non negotiable salaries.\n\nI am back on the job hunt now and received an \"offer\" yesterday that stated:\n\n&gt; As discussed during our phone interview if you choose to accept this offer, I will send you an offer letter via DocuSign in order for you to complete. \n\nExcept there was no offer attached.\n\nWas busy doing other things and didn't realize something was up until today. On the fence about the position and emailed back letting them know compensation package would be a determinant for me (first mistake) and asked if they could send an offer. Instead got an email back citing the salary range I mentioned and was asked what I want.\n\nDon't want to reveal what I want salary wise and either didn't ask or notate (second mistake) what most of their benefits are.\n\nWhat do I do here?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/lseuqr/received_an_offer_without_an_offer_attached/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "This all sounds a bit weird to me, but it seems like if you don't provide a number, they won't send you an offer letter. You could try asking them for a written offer again just so you can look it over, though I'm guessing they'll send back the same response or ignore you. You could provide them a number and see what they come back with. I'm of the opinion that telling them what you want isn't a bad thing assuming you've done your research. I've discussed salary before I even got to the interview stage for my last two jobs.",
          "score": 2
        }
      ]
    },
    {
      "title": "How common is it for employers to reach out to applicants?",
      "body": "I have been job searching for ten months. Just recently, I had two employers reach out to me by LinkedIn and gmail.\n\nFor LinkedIn, I went to the interview in person. They had a office suite in a big building. Only a couple guys were there. It was a startup company and there was little to no information about it online. It was a delivery job promising 20/hr and they were very interested in me so I gave them my resume and they told me they would follow up when they have an account ready and they had enough drivers to do all their jobs.\n\nFor the gmail one, this was a little sketchy because I got an email from a job agency at betterchoiceag.com (A redirect from CareerBuilder which I have an account on) and they were interested in interviewing me by phone. It was a work-at-home job where I inspect packages sent to my home address and after finishing inspection, I reseal everything and ship it back. The company hiring was called SGS Post which I couldn't find any info on google, only \"SGS\" which is very similar and probably a branch of that company because their documentation had the same address as SGS. Paid an average of $2500 a month for 20 something hours a week. I didn't give them a resume either but they had told me that they would hire me and all I needed to do was fill out a docusign form with a picture of my Driver's License. This was after the phone interview and signing the document which they told me to read very thoroughly. In addition, I was also sent a 10 minute video describing what the job will be like. \n\nAre there any red flags I should be looking out for?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/fr0u6w/how_common_is_it_for_employers_to_reach_out_to/",
      "comments": [
        {
          "body": "Can't tell you anything about the delivery job, but the job that reached you by Gmail is 100% a scam.",
          "score": 3
        },
        {
          "body": "Possibly sending your drivers lisence. Without ever having a in person interview.",
          "score": 1
        },
        {
          "body": "I don't know what they will do with your driver license information.\n\nAnd yes likely they will send you a fraudulent check.",
          "score": 1
        }
      ]
    },
    {
      "title": "Docusign intern interview",
      "body": "Has anyone given their docusign interview first round today?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1k51s10/docusign_intern_interview/",
      "comments": [
        {
          "body": "I haven't personally interviewed with DocuSign recently, but I can share some general insights about their intern interview process. Typically, the first round for tech internships at companies like DocuSign involves a mix of technical and behavioral questions. They might ask about your coding experience, problem-solving skills, and relevant projects you've worked on. Be prepared to discuss your resume in detail and explain why you're interested in interning at DocuSign specifically.\n\nIf you're feeling unsure about how to approach certain questions or want to practice your responses, you might find [live interview AI](http://interviews.chat) helpful. It's a tool I worked on that provides real-time suggestions during online interviews. It can be particularly useful for navigating tricky questions or situations where you're not quite sure how to respond. Just remember, the goal is to use it as a support, not a crutch - your own authentic responses and experiences are what will really make you stand out to interviewers.",
          "score": 1
        },
        {
          "body": "I did a recruiter call, and I have a technical interview next week. Wbu?",
          "score": 1
        }
      ]
    },
    {
      "title": "Docusign interview",
      "body": "Hi guys,\nI have an interview for renewal coordinator at docusign, what questions should I expect? I've researched the company and the role but I'm kinda confused.\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n4v7i2/docusign_interview/",
      "comments": [
        {
          "body": "The renewal coordinator role at DocuSign is all about customer retention and ensuring existing clients continue their subscriptions, so expect questions focused on relationship management, problem-solving, and understanding SaaS metrics. They'll likely ask about your experience handling customer concerns, how you'd approach a client who's hesitant to renew, and scenarios where you need to collaborate with sales or customer success teams. Since DocuSign operates in the digital agreement space, they might test your understanding of their product ecosystem and how renewals fit into the broader customer lifecycle.\n\nYou'll also face behavioral questions about managing multiple accounts simultaneously, dealing with rejection, and how you prioritize when everything feels urgent. They love asking about specific situations where you turned around a difficult customer relationship or exceeded retention targets. The confusion you're feeling is totally normal because renewal roles can vary significantly between companies, but at DocuSign it's really about being that trusted advisor who helps customers see ongoing value in their digital transformation journey. I'm on the team that built AI for [interview prep](http://interviews.chat), and it's designed exactly for situations like this where you want to practice answering tricky role-specific questions and get real-time feedback to nail your responses.",
          "score": 1
        },
        {
          "body": "What helped me most was just getting really comfortable with behavioral questions like “tell me about a tough client situation” or “how do you keep track of multiple renewals.” They want to see that you can stay organized and keep relationships positive, more than deep technical stuff. For prep I pulled a bunch of practice Qs from [Beyz interview question bank](https://interviewquestionbank.com) to get used to the phrasing. I also ran a few mock sessions on Beyz interview assistant to stop myself from rambling. Tbh that part helped me more than cramming company facts.",
          "score": 1
        }
      ]
    },
    {
      "title": "Renewal coordinator",
      "body": "I have an interview with the regional renewals manager for this role at Docusign, this is the 2nd interview in this hiring process. What do you guys think its going to be about?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ndbd97/renewal_coordinator/",
      "comments": [
        {
          "body": "The interview is going to dig deep into your ability to manage customer relationships and drive revenue retention. They'll want to understand how you handle challenging renewal conversations, your approach to identifying upsell opportunities, and your strategies for preventing churn. Expect scenario-based questions about dealing with unhappy customers who are considering leaving, how you'd prioritize a large portfolio of accounts, and your experience with CRM systems and renewal metrics. Since this is DocuSign, they'll also want to see that you understand their product ecosystem and can speak to the value proposition that keeps customers coming back.\n\nThe regional manager will also assess your analytical skills and how you think about the renewal process strategically. They'll likely ask about your experience with forecasting, how you track renewal health scores, and your approach to collaborating with sales and customer success teams. This conversation will be more tactical than your first interview - they want to know you can actually do the job, not just talk about it. Be ready to share specific examples of successful renewals you've managed and how you've turned around at-risk accounts.\n\nI'm on the team that built [interview AI helper](http://interviews.chat), and it's designed exactly for situations like this where you need to prepare for role-specific questions and practice articulating your experience in a way that resonates with hiring managers.",
          "score": 1
        },
        {
          "body": "How was the interview? If u can share questions they asked ?",
          "score": 1
        }
      ]
    },
    {
      "title": "I’m not sure which is worse 🫠",
      "body": "I’m not sure which is worse — not hearing back after an interview OR being contacted, going through two interviews, receiving a job offer, and being congratulated over the phone, only to be left with no updates afterward. HR said they would send me the DocuSign for the onboarding process, but I haven’t heard anything since that call.\n\nHonestly, I would’ve preferred not hearing anything at all rather than being congratulated and given false hope. I’ve already sent three follow-up emails but still haven’t received a response. 🫤😥",
      "subreddit": "interviews",
      "score": 19,
      "url": "https://reddit.com/r/interviews/comments/1hc0wmm/im_not_sure_which_is_worse/",
      "comments": [
        {
          "body": "I had a job offer in-hand.  \n\nTraveled 3 hrs. to the interview, did the interview, drove home, and on the drive home was called by the recruiter congratulating me and offering me the job.  I accept, receive email with HR documents, order a new phone with new number, start getting everything ready for a move.\n\nTwo days later, the recruiter calls back.  Tells me they pulled the offer.  Apparently, one manager took his sweet time doing his portion of his interview report, and they rescinded the offer.  Talk about blowing a gasket.\n\nHope it all works out for you, though.",
          "score": 9
        },
        {
          "body": "Well the second one is defective worse.",
          "score": 7
        },
        {
          "body": "‘How to follow up after a job interview \n\nExplained’  by [toprecruiter](https://www.youtube.com/@toprecruiter) on YT - Bob (former VP HP Staffing, KPMG &amp; more) has an informative and concise video that I've personally tried. I use the same template &amp; add my authentic personality. \n\nThought these would benefit others going through the same experience. Best of luck!",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "I had an interview the on 4th and I still haven't heard back 😔.",
          "score": 1
        }
      ]
    },
    {
      "title": "Did I get the job?",
      "body": "I received this email today. I had a Zoom meeting with someone from the team last Thursday, and they recommended me for the position. Does this mean I got the job, or am I just scheduled for a second-round interview? 🤔\n\nEmail:\n\nHeard you had a great meeting with Lauren. We would like to move forward in your candidacy and schedule a second interview with the greater team. Can you please let me know what your availability is for an hour-long meeting for the rest of the week and next?\n\nAlso, I will send over an NDA via DocuSign later today for your signature. Please let me know once it's signed. \n",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1inauu4/did_i_get_the_job/",
      "comments": [
        {
          "body": "I bet a couple more interviews before a written offer. I hope you get it though OP! Best of luck while I spiral 🌀",
          "score": 2
        },
        {
          "body": "In my opinion, I don't think so. There will be a second round.   \n  \nPrepare well! good luck.",
          "score": 1
        },
        {
          "body": "Read the email again. You didn't get recommended for the job. You got put through to the second round. Am I missing something here?",
          "score": 1
        }
      ]
    },
    {
      "title": "Received NDA after screening with the hiring manager — good sign?",
      "body": "I’m trying not to get my hopes up too much since I felt I bombed the pre-interview a bit. The HM was eager to meet me, and while I make sure my application materials and portfolio are near-perfect, my actual interviewing skills need a lot of improvement. They said they’ll “be in touch” and I got an email a few hours later asking to sign an NDA — literally the Docusign request and a vague message from the recruiting team.\n\nThis might be a stupid question, but does this mean I’ll progress to the next step? Wouldn’t they usually send it before the initial interview? The HM discussed a lot of details about the role, so I’m just wondering if they realized and sent it after the fact. Maybe I’m just overthinking it?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1h92l7h/received_nda_after_screening_with_the_hiring/",
      "comments": [
        {
          "body": "It doesn't mean anything, I'd say it's more a negative rather than a positive regarding the company itself",
          "score": 3
        },
        {
          "body": "Honestly, it's not uncommon for companies to send NDAs after an initial screening with the hiring manager, especially if they feel like you're a strong candidate. In my experience, it usually means they're getting close to moving forward with the interview process. It's possible that they just realized they should've sent it before our meeting, but I wouldn't read too much into that.\n\nWhat might be more telling is the fact that they're already discussing details about the role with you - that suggests they're considering you for the position. My advice would be to stay optimistic and respond to their NDA request asap, so you can move forward if they decide to proceed.\n\nOne thing that helped me when I was in a similar spot was using an AI tool that listens to interview questions and provides suggested responses in real-time. It's not a guaranteed fix, but it made me feel more confident during my own interviews. If you're interested, I'd be happy to share the link with you.",
          "score": 1
        },
        {
          "body": "I had to sign an NDA before the interview but never after.",
          "score": 1
        }
      ]
    }
  ]
}