{
  "company": "dropbox",
  "post_count": 36,
  "exported_at": "2026-01-18T17:44:53.272Z",
  "posts": [
    {
      "title": "Tips on an interview coming up.",
      "body": "I have an interview on Tuesday for GameStop. I have a years worth of experience in my schools student store, and the manager will give me a good reference if they decide to contact her. I just wanted some tips because even thought I worked in the student store, this will be my first legitimate job. Here's a copy of my resume I'm bringing in: https://www.dropbox.com/s/b43pbha2eutah3w/nathan%20smith%20resume.docx?dl=0\n\nAnything I should change? Should I wear a standard dress shirt and slacks? Also, my hair is dark brown (the roots start black, then lighten to brown after a centimeter) but over summer it fades to a light blonde toward the ends but I feel like it might give me a young or unprofessional look. It's surfer hair. Should I dye it to a complete dark brown? Also, I'm 18.",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/2eh7uy/tips_on_an_interview_coming_up/",
      "comments": [
        {
          "body": "Resume looks nice, but lead and led are two different things. I led my sales team. Or I am the lead salesman. \n\nI've hired for a lot of entry level positions like this. I'm mostly looking for job history and trying to determine if you are a stable person with similar skills for what I need. I might glance at education as well, but the rest of it is fluff that I don't really read. I have to go through 20-30 resumes some times, so I don't have time. I would summarize your skills, communications and leadership paragraphs into one succinct paragraph on why you think your current job skills would fit in and help me at Gamestop. Anything longer than 3-4 lines, won't really get read.\n\nYes, wear a dress shirt and slacks. I don't think they'll care about your hair as long as it is neat. I can't say I've ever considered hair coloring when hiring, mostly looking to see if the person is dressed appropriately and neatly. \n\nHope this helps",
          "score": 2
        }
      ]
    },
    {
      "title": "Need some constructive criticism for my resume/online portfolio. Looking for jobs in the creative field (movies, videos, commercials, graphic design, illustration, etc)",
      "body": "I need help with someone looking over my resume and online portfolio. I've gotten interviews in the past but I always seem to get the response I'm either too creative or not creative enough. What should I do to update? My most recent skill I've been teaching myself is After Effects, so I know for certain I need more videos demonstrating my skills in the special effects area. Next move is to teach myself 3D animation. Anyways, how does it look and what do I need to change?\n\nLink to word doc resume: https://www.dropbox.com/s/zw408y8jhqlqhow/Kohdy%20R.%20Woods%20Resume%202014.docx\n\nLink to online portfolio: http://kohdywoods.portfoliobox.me\n(BTW my online portfolio does not show up when I google my name, how do I change that?)",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1yclqr/need_some_constructive_criticism_for_my/",
      "comments": [
        {
          "body": "I have hired hundreds of people in my career, from interns to senior managers, so I can read your resume as would a manager who'd be asked to consider you as a potential candidate.\n\nHEADER: \n1. Too much space for the header. Doesn't matter if you're relocating unless your job is affected by it. \n2. Make the name font larger. \n3. I'd certainly highlight the portfolio link. (italics, larger font, different color, different item...one of these. we'll see in the next version) \n\nMAIN BODY:\n5. Lose the 2 column format. Highly distracting to the point of being irritating. It takes so much effort to read this format that I'd have thrown this out almost on this basis (not quite, but it's irksome enough)\n5. Use bullets for skills, awards. Break the text.... \n6. Achievements? What did you achieve in all of your jobs and internship assignments...huge issue. All i read is 'I held this job, did this work...) the message you are sending out is you have no pride or passion for anything you did!\n7. Put work experience before internship assignments, not after\n\nGENERAL \n8. I think my biggest critique is - it doesn't build a picture for me as to what and who you are as a person, potential employee. It doesn't say to me 'I'd really like to talk to this person'. It's hard to tell why (till you fix all of above), and I can review again, but it's very disjointed.\n\nPublish a revised version and I will help you take another pass. I think you might need to add a narrative in the form of a 'career objective' as well, but we'll see.\n\np.s. : You should get someone to take a look at your portfolio as well. I think it doesn't do you any favors at the moment. I am not an expert in fine arts, media or graphic design, but I think you may need to revise your portfolio look and feel.",
          "score": 2
        },
        {
          "body": "Listing your name in a larger, bolder font than the rest of the resume is the first thing any resume writing book/website will tell you, which makes me think you haven't researched this very much. It also looks weird to have your resume stretch to two pages, when the second page has so little information on it. This could just be the fact that I'm opening a .docx using Libre Office instead of Word -- but that's another thing. You should really submit copies of your resume in PDF format unless specifically asked otherwise. PDFs don't change how they look when your potential employer decides to open it on it on a different program than you built it on. Lose the two column format - it looks messy and confusing.\n\nI glanced at your website. If you just recently created it -- it will take time before it starts showing up in Google's index. Maybe weeks. Your best bet is to have an online profile, like LinkedIn, that hiring folks usually check and have that link to your website. The more links you have going to you website, the faster it will be discovered and indexed by Google. **[See this article](http://blog.kissmetrics.com/get-google-to-index/)** about getting your site indexed faster. As far as the design of the website goes, something about that tiny menu list doesn't look very appealing. Make it bigger &amp; more attractive. Make your name stand out on the homepage. It also seems a bit bare... maybe add very clear information about how these are the skills you have and this is what people can hire you to do and such-and-such are the programs you used to create these things.",
          "score": 1
        }
      ]
    },
    {
      "title": "Graduated in 2023, still no SWE Job looking for possible advice.",
      "body": "Graduated with a CS-adjacent BS in Sep 2023. Been applying since Fall 2023 and haven’t landed anything yet.\n\nI’m not really here to complain, I know how rough the entry-level is as I've been deep in it. I’m mostly trying to sanity check whether I’m focusing on the wrong things, or if I should just rotate to something else at this point.\n\nI've gotten interviews, but not many in the actual roles that I want, full-stack, etc.\n\nI've been doing a few things since graduating ranging from working on personal projects (full-stack apps, Flask/JS/SQL, Docker, CI/CD, some cloud stuff), I've been working at the post office a bit as well, and have recently applied to Georgia Tech’s OMSCS because I’m thinking longer-term this might help, especially with getting back into applying for internships.\n\nThat said, I’m starting to wonder if I’m just missing the obvious issues, I probably haven’t done enough LeetCode/DSA relative to everyone else, I think my resume looks fine on paper but not competitive for filters, as I said, the entry-level is just insanely saturated and I’m at best average in a very strong pool.\n\nI guess, for people who’ve hired, interviewed, or broken in recently, Is grinding LeetCode actually the best use of time here? Do projects like this move the needle at all? I'm mainly doing them keep up with my skillset. Also, does doing an OMSCS help early-career people, or does it not really help? If you were in my position, what would you focus on and what would you stop wasting time on?\n\nHere's my resume if anyones wants to take a look,\n\nhttps://www.dropbox.com/scl/fi/2gnaiaecnwy5r6fnpu159/Copy-of-Resume_2026.pdf?rlkey=ehvvv3wlqof0ufotzmlhurkfv&amp;st=bc8z8kt2&amp;dl=0\n\nI can link my portfolio to folks if that's useful either",
      "subreddit": "cscareerquestions",
      "score": 132,
      "url": "https://reddit.com/r/cscareerquestions/comments/1qbxb2o/graduated_in_2023_still_no_swe_job_looking_for/",
      "comments": [
        {
          "body": "After 2.5 years, the only thing on your resume that’s relevant for SWE on your resume is 3 fullstack projects.\n\nAdd in a no name school, no experience even though you started school in 2019, no cs degree and you’re cooked. Not extremely cooked like some people here but just cooked.",
          "score": 207
        },
        {
          "body": "FYI, you leaked your first and last name so delete if you are not okay with this.",
          "score": 40
        },
        {
          "body": "It's a horrible market out there.\n\nI know a couple of friends with years of experience out of work.\n\nHere's a guide I wrote based on my own 2025 job search.\n\nGoogle Doc (not spam; not selling)\n\n[https://docs.google.com/document/d/1YiRdeAXFpFSMU2zfivMaQMj\\_IVk-wgH499aQV7e853I/edit?usp=sharing](https://docs.google.com/document/d/1YiRdeAXFpFSMU2zfivMaQMj_IVk-wgH499aQV7e853I/edit?usp=sharing)",
          "score": 37
        },
        {
          "body": "yeah you leaked ur name, also i peeped your LinkedIn and it doesn’t look like you’ve tried networking. I would try networking and trying to gain opportunities from there at the very least.",
          "score": 24
        },
        {
          "body": "I was kind of in the same situation, graduated 2023 and didn’t get interviews for 6 months straight. I started an online masters in Fall 2024 similar to the Gtech one and just mass applied for internships. Got lucky with 2 big tech internships last year and now starting full time at one. Internship to full time imo is the best route forward, and even if you don’t get a RO you at least have real experience you can use in future interviews.",
          "score": 9
        },
        {
          "body": "fwiw, i graduated december 2024 also with no internships and landed a contract to hire role in august 2025. albeit, i do think i got incredibly lucky to land the role that i did. \n\nlook into recruiting agencies! the benefits are dogshit and there typically is no PTO but in an environment where experience is king, 1 year experience is better than 0. \n\nalso, i'll mention that my interview was not a leetcode style interview at all. just a pretty general \"do you know how to use this language\" style interview. i had maybe &lt;50 leetcode questions under my belt at the time lol",
          "score": 7
        }
      ]
    },
    {
      "title": "Dropbox FT Interview With Almost No Knowledge of Concurrency",
      "body": "I managed to land an interview with Dropbox, but looking at past questions, they often seem to involve some sort of element about concurrency. I haven't worked with anything strictly concurrency related since my OS class 4 years ago, will I still be able to get by? Also, are the questions really always the same like Glassdoor seems to suggest?\n\n(And if anyone has helpful resources on concurrency in Java for interviews, I'd be much obliged!)",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/32ps50/dropbox_ft_interview_with_almost_no_knowledge_of/",
      "comments": [
        {
          "body": "If you're looking for advice specifically for Java, definitely Google around for information on Java's ForkJoin.  If you study up on that you'll hit several important concurrency concepts such as thread pools.  I'd give you some resources in particular that I've saved for ForkJoin but I'm on my phone, I'll edit some in later.  You should have no problem finding stuff on it though\n\nAlso, good luck on your interview!",
          "score": 4
        },
        {
          "body": "Where can I find concurrency questions that were given at past interviews ? (Not necessary dropbox).\n\nAlso a free book that I found really good: http://greenteapress.com/semaphores/",
          "score": 2
        },
        {
          "body": "Give us an update on your interview :)",
          "score": 2
        },
        {
          "body": "A company as awesome as Dropbox will probably not care whether you know about concurrency in Java or Python. But, just in case, they use a lot of Python, so you might want to take a look there too. \n\nDavid Beazley has a good talk on it. Hope that helps! and Good luck! ",
          "score": 1
        },
        {
          "body": "IIRC they run solely on Python (I think the father of Python even works there) so it should make your research easier (hell atleast easier to understand), if not at least more narrow.",
          "score": 1
        },
        {
          "body": "If they are a (mostly) Python shop as others have suggested, the lack of concurrency questions could be explained by the fact that Python doesn't do actual multithreading (read about the GIL)",
          "score": 1
        }
      ]
    },
    {
      "title": "Software Engineering Internship Interview at Dropbox. What can I except",
      "body": "\n\nI recently got an offer to interview at Dropbox. I'm not really sure what to expect, and what to prepare for. I've interviewed at other companies in the valley with a variable amount of success. But I've heard Dropbox is harder, or different?\n\nIf anyone can give me some advice or share their experience that would helpful.\n\nThanks\n",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/3tcc7b/software_engineering_internship_interview_at/",
      "comments": [
        {
          "body": "1) start taking all of the papers on their desk, photocopying them, and putting them in a box with a cloud drawn on it. Then drop this box. That will demonstrate that you're om board with their product design. \n\nEdit: uh oh looks like some Dropbox shills found my comments. The admins have been notified. ",
          "score": 4
        },
        {
          "body": "Just practice difficult data structures and algorithms questions.",
          "score": 1
        },
        {
          "body": "Try solving medium and hard level problems in Leetcode. Once that is done, you can try Topcoder Div 2 500/1000 pnts and Div 1 problems for that sweet spot.  ",
          "score": 1
        },
        {
          "body": "&gt; What can I except\n\nFor example, if they tell you \"write a function with the signature divide(numerator, denominator)\" you can except when denominator==0.",
          "score": 1
        }
      ]
    },
    {
      "title": "Dropbox Intern Interview advice",
      "body": "I have an onsite dropbox interview coming up and in the packet they told me to be prepared for concurrency questions, which I have no experience with.\n\nI have also heard that they have some of the hardest interviews out of any tech company in Silicon Valley. Does anyone have any advice on what to expect or how to further prepare for it?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/59dsp4/dropbox_intern_interview_advice/",
      "comments": [
        {
          "body": "Well you should probably learn about concurrency",
          "score": 3
        },
        {
          "body": "Concurrency is actually no joke for Dropbox - I interviewed twice and got concurrency in my questions every time. It's not something you should just hope you won't get, you are guaranteed to get questions about concurrency. Know what locks semaphores mutexes conditional variables are, learn on concepts like dead lock and understand how to parallelize algorithms. ",
          "score": 2
        },
        {
          "body": "Also interested... if you have advice on the technical phone interview, let me know cause I have mine coming up",
          "score": 1
        },
        {
          "body": "When did you guys apply for it?\n",
          "score": 1
        },
        {
          "body": "java thread safety, singleton, polymorphism, ",
          "score": 1
        }
      ]
    },
    {
      "title": "Are dropbox internship interviews as difficult as full time?",
      "body": "Hi everyone! \n\nI passed the Dropbox hackerrank and am now starting the regular interview process. The literature that I've read about full time interviews makes it seem pretty intense. Are the normal internship interviews equally difficult? What should I prepare? \n\nThanks!",
      "subreddit": "cscareerquestions",
      "score": 11,
      "url": "https://reddit.com/r/cscareerquestions/comments/580v67/are_dropbox_internship_interviews_as_difficult_as/",
      "comments": [
        {
          "body": "It uses the same interview questions and criteria as the full time interview, except there's one fewer question during the onsite. Study recursion, concurrency, the usual algorithms etc\n\nSource: I conduct them.",
          "score": 26
        },
        {
          "body": "While it is unreasonable to expect an intern to answer full time interview questions, it be a fair assumption that preparing for those questions will definitely prepare you for the internship type questions.",
          "score": 3
        }
      ]
    },
    {
      "title": "Anyone had Dropbox onsite(skype) interview for internship?",
      "body": "",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/4co0m3/anyone_had_dropbox_onsiteskype_interview_for/",
      "comments": [
        {
          "body": "Friend is working at Dropbox as an intern this coming summer. He had his onsite on campus in CA.",
          "score": 1
        }
      ]
    },
    {
      "title": "Dropbox Interview",
      "body": "I was just curious to know which concepts in cs/programming/math are essential to know if one has a Dropbox software engineer intern interview ? (besides data structures and algorithms) ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/5b1uzu/dropbox_interview/",
      "comments": [
        {
          "body": "- Concurrency\n- Real-world system design and making tradeoffs\n- Performance estimation based on expected use patterns / inputs\n- More concurrency\n",
          "score": 3
        },
        {
          "body": "Hey, I have my interview next week. How was your experience ? What do you recommend ?",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview at Dropbox - solutions architect",
      "body": "Hi All, \n\nI have an interview for a solutions architect position at Dropbox. Wondering if anyone around here has interviewed for this position before, or indeed knows anything about the interview? \n\nIve seen online that networking, active directory etc do get asked so I'm studying up on those now. Any help appreciated! \n\nThanks! ",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/57lfj3/interview_at_dropbox_solutions_architect/",
      "comments": []
    },
    {
      "title": "Big N Discussion - September 11, 2019",
      "body": "Please use this thread to have discussions about the Big N and questions related to the Big N, such as which one offers the best doggy benefits, or how many companies are in the Big N *really*? Posts focusing solely on Big N created outside of this thread will probably be removed.\n\nThere is a top-level comment for each generally recognized Big N company; please post under the appropriate one. There's also an \"Other\" option for flexibility's sake, if you want to discuss a company here that you feel is sufficiently Big N-like (e.g. Uber, Airbnb, Dropbox, etc.).\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Sunday and Wednesday at midnight PST**. Previous Big N Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Big+4+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/d2m6hj/big_n_discussion_september_11_2019/",
      "comments": [
        {
          "body": "Company - **Google**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 3
        }
      ]
    },
    {
      "title": "Big N Discussion - February 13, 2019",
      "body": "Please use this thread to have discussions about the Big N and questions related to the Big N, such as which one offers the best doggy benefits, or how many companies are in the Big N *really*? Posts focusing solely on Big N created outside of this thread will probably be removed.\n\nThere is a top-level comment for each generally recognized Big N company; please post under the appropriate one. There's also an \"Other\" option for flexibility's sake, if you want to discuss a company here that you feel is sufficiently Big N-like (e.g. Uber, Airbnb, Dropbox, etc.).\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Sunday and Wednesday at midnight PST**. Previous Big N Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Big+4+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).\n",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/aq3wjg/big_n_discussion_february_13_2019/",
      "comments": [
        {
          "body": "Company - **Microsoft**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 7
        },
        {
          "body": "Company - **Amazon**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 8
        }
      ]
    },
    {
      "title": "Big N Discussion - April 10, 2019",
      "body": "Please use this thread to have discussions about the Big N and questions related to the Big N, such as which one offers the best doggy benefits, or how many companies are in the Big N *really*? Posts focusing solely on Big N created outside of this thread will probably be removed.\n\nThere is a top-level comment for each generally recognized Big N company; please post under the appropriate one. There's also an \"Other\" option for flexibility's sake, if you want to discuss a company here that you feel is sufficiently Big N-like (e.g. Uber, Airbnb, Dropbox, etc.).\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Sunday and Wednesday at midnight PST**. Previous Big N Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Big+4+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 11,
      "url": "https://reddit.com/r/cscareerquestions/comments/bbj16t/big_n_discussion_april_10_2019/",
      "comments": [
        {
          "body": "Company - **Amazon**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 12
        },
        {
          "body": "Company - **Microsoft**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 6
        }
      ]
    },
    {
      "title": "Dropbox Interview",
      "body": "",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1q0hgvk/dropbox_interview/",
      "comments": [
        {
          "body": "My ex worked there. She was a contractor. It was nice for free food but that was about it. Pay was average for large tech city. It's a shark eat shark place too. Drop you in on your first day with a laptop expecting you to figure people out, who your team is etc.",
          "score": 1
        },
        {
          "body": "Their approach to interviewing tells me everything I needed to know. Even with the use of Brighthire AI… STILL… they require hours and hours of your time. Major red flag! Even Amazon (who use to have similar model) has changed to a max of three interviews! Clearly they need significantly more help than I could ever possibly give them.",
          "score": 1
        }
      ]
    },
    {
      "title": "After 200+ job apps, one screener call, and 199 rejections, I finally got a [12 month contract] job.",
      "body": "I got laid off Feb 1st. It’s been six months, 200+ job apps, one screener, and the rest rejections or never heard back. \n\nI got the contract job thanks to a connection in my people network. For everyone else on the unemployment struggle bus, LEVERAGE YOUR NETWORK! \n\nPut your name and face in their face! Tell everyone you talk to what you’re looking for, ask them to keep you in mind, write the silly LinkedIn posts. People will not think of us unless we ask/tell them to! Also, people WANT to help, they just won’t know until they know! \n\nAlso, clearly I stopped tracking the status, bc they were all applied &gt; rejected/no response. \n\nOf all, I got one contract job interview then an offer. ",
      "subreddit": "jobs",
      "score": 94,
      "url": "https://reddit.com/r/jobs/comments/1m3d8wc/after_200_job_apps_one_screener_call_and_199/",
      "comments": [
        {
          "body": "👏👏 congratulations",
          "score": 3
        },
        {
          "body": "Congrats on the contract job. But it seems like you're just applying to anything and everything. I get that it's super tough in the current job landscape, but I'd argue that during these times, it's better to be more hyper focus in your search. It's when the economy is more job seeker friendly is when you can be more adventurous with different roles.",
          "score": 3
        }
      ]
    },
    {
      "title": "Can anyone vouch for this company?",
      "body": "I'm looking for a job that won't make me want to cry when my alarm goes off every morning and I came across a Sales Representative job for \"NX Direct\" in Atlanta Georgia. they claim to be a marketing company and my job would be to sell at&amp;t in best buys. they claim 500/week for the first couple weeks of trading and then guaranteed 600/week plus commissions. I've seen a couple Glassdoor reviews calling them a pyramid scheme and a reddit post as well. I can see the red flags but I can also see that it seems like an actual company? maybe? the interview was nothing crazy and I actually quite enjoyed talking to the three people I spoke with. I guess I'm just wondering if anyone else has had an experience with this company whether that's just an interview or actually working for them. also if there's any slouths out there that can find anything else on the internet about them that I didn't find that would be appreciated. thank y'all in advance ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1mvtcom/can_anyone_vouch_for_this_company/",
      "comments": [
        {
          "body": "If they were awesome it wouldn’t be a secret. \n\nCell phone kiosk salesmen in big box stores are pretty universally disliked, and I think that’s the best case scenario for what this role entails. If you’re down with that, cool, but the fact that they talk about variable weekly rates rather than hourly or yearly base is a red flag itself. If it’s not a kiosk salesman role, it sounds like an MLM.",
          "score": 1
        },
        {
          "body": "Im about to have the first interview with them in the next few hours, and Im stumbling upon all these red flags right beforehand... account manager/Customer rep positions... Debating not even going to said interview at this point.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is this a scam? (Check the photos) Software Engineer Position",
      "body": "\nSo i’m sussed out for a couple reasons:\n\n1) Berkeley Research Group is most definitely a real company. I was reached out to by someone 1 day after applying that i was to message this “David Martinez” with a GMAIL address (not a company address).\n2) i reached out, and the interview was the very next day (two days after applying) and it was nothing but 17 questions i had to type to answer. I sent that back with answers and I David Martinez responded saying I’ll hear back within two hours, then i got the offer extended \n3) I sent the four bits of info they wanted for an offer letter because i was curious and they sent this, a document with HelloSign which I have no clue of. Yet they’re using the name of the company. This email is thinkbrg@applyworkonline.com which seems sus, their real email has ___@thinkbrg.com\n\nthis is a scam right?? I was so happy for a second that a long, long, depressing job search was over but i fear not.\n\nAlso, they still have not even seen my face with a virtual interview, just those 17 questions. Everything seems odd and I don’t want to open the offer in case.",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/1axmpnp/is_this_a_scam_check_the_photos_software_engineer/",
      "comments": [
        {
          "body": "It says equipment purchased by check. It's definitely a scam.",
          "score": 7
        },
        {
          "body": "This is a well known scam. It's posted on here multiple times daily.\n\n\nThe check that they send you will be for an amount that is far more than what you need to buy the equipment, and they'll ask you to send the remaining balance back to them. Then the original check they sent you will bounce, and you'll be out whatever money you sent them.\n\n\nYou can read more here: https://consumer.ftc.gov/consumer-alerts/2022/05/want-work-home-spot-scams-first",
          "score": 2
        },
        {
          "body": "Dear,  xxxx, yyyyy\r  \n\r  \nWe appreciate your interest in applying for the Berkeley Research Group, LLC position of Software Engineer (Remote), which was listed on Indeed and our website. We are pleased to notify you that you have been chosen for an online interview scheduled for this Monday, based on your experience. $100,000 to $230,000 per year for a full-time position\r  \n\r  \nThe time of the interview is 8 a.m. to 4 p.m. on Monday, March 04, 2024, EST. Please send an email to martinezyvn@gmail.com to confirm that this email was received, set up an interview time, and confirm that you are available for the interview with David Martinez, a member of our HR staff. For Monday's interview, you must be available via email as soon as possible. David Martinez should be contacted as soon as possible to let him know your availability for the job interview, which is scheduled to begin between 8 a.m. and 4 p.m. EST for Monday. Your prompt and efficient answer to this position is highly valued. Have a wonderful weekend.\r  \n\r  \nLooking forward to hearing from you.\r  \nAll the best\r  \nHR TEAM\r  \nBerkeley Research Group, LLC",
          "score": 2
        },
        {
          "body": "Just got one very similar except the person’s name was Bart Jackson.\n\nHello Dear, (name redacted)\n\nWe are grateful for your interest in applying for the remote, work-from-home ECCO Select position of IT Support (Remote), which was posted on Indeed and our website. We are happy to inform you that, as a result of your expertise, you have been selected for this Thursday's online interview. $75,000 to $100,000 annually for a full-time job.\n\nOn March 14, 2024, a Thursday, the interview will take place from 8 a.m. until 4 p.m. EST. To ensure that our HR staff member Bart Jackson reaches you, please send an email to bartwfh@gmail.com to confirm receipt of the email, schedule a time for the interview, and validate your availability. It is necessary that you be reachable by email as soon as possible for the Thursday interview. As soon as possible, get in touch with Bart Jackson to let him know that you are available for the job interview, which is set to start on Thursday between 8 a.m. and 4 p.m. EST. We really appreciate your quick and effective response to this inquiry. May you have an amazing day.\n\nLooking forward to hearing from you.\nAll the best\nHR TEAM\nECCO Select",
          "score": 1
        }
      ]
    },
    {
      "title": "How to Attach a Visual Portfolio to Your Resume",
      "body": "I wanted to share something that worked for me in my job hunt — especially for roles where showing your work matters (engineering, design, trades, art, software, construction, etc.).\n\nInstead of sending people a big zip file or linking them to my Instagram/Dropbox, I started using a little web tool that lets you upload photos or videos and gives you a clean, single link to share. No sign-ups for the viewer, no random ads, no clutter. Just attach the link to the application. This is the album I used\n\nhttps://pxalbums.com/shared/album/566dd22f-41ab-4f83-9915-d12938a8fce3\n\nNow recruiters can see my skills before they even talk to me — and I’ve had multiple interviews mention the portfolio link as a reason they reached out.\n\nIf you work in any field where showing your work matters, I highly recommend trying something like this. It’s made my resume feel more “real” instead of just words on paper.\n\n\n\n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1mm2qjk/how_to_attach_a_visual_portfolio_to_your_resume/",
      "comments": [
        {
          "body": "[removed]",
          "score": 0
        }
      ]
    },
    {
      "title": "Required to upload a video interview for my schools mental health desk job",
      "body": "Hi, so I need advice. This is my first time applying to a job and its something close to my future field. However, it requires me to upload a video of myself for the first round of interviews. I have a shit ton of anxiety regarding being on camera and they want us to upload it onto a google drive where other candidates can see it. I really really don't like the idea of other people having access to a recording of me. I just emailed the recruiter telling him about my concerns and asking if I could instead email it to him or send it in a dropbox. So idk what to do on that front.\n\nThe other thing he's asking for is for us to be creative. So do I do something silly like where a cowboy hat and talk in a southern accent or do I not put any effort in?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1mjm78f/required_to_upload_a_video_interview_for_my/",
      "comments": [
        {
          "body": "Use an AI host with a script.",
          "score": 1
        },
        {
          "body": "I hate shit like that. I would say read the job posting and base your creativity off of that sadly. Do keep the \"creativity\" low-key and professional though.\n\nIn the video, just talk about how excited you are about being considered for the opportunity, and list what skills you think you could bring that would be helpful to the role. Perhaps mention a PC hobby that you either do or don't have in real life. \n\nAt the end of the day, work is supposed to be professional, I wouldn't overthink it.\n\nEdit: you really wouldn't want to work for a place that wants you to put on a cowboy hats to entertain them. Being friendly, personable and competent should be enough for that kind of a role. If that's not good for them then you've just dodged a bullet cuz otherwise it could be a bit of a loony bin there.",
          "score": 1
        }
      ]
    },
    {
      "title": "A not so simple: Job Application Guide!",
      "body": "**Tl;dr** [info-graphic summary]( https://www.dropbox.com/s/3yuhnucmsey3alb/INFOGRAPHIC.pdf?dl=0)  \n[Resume Layout explained with comments](https://www.dropbox.com/s/lxy1mchfseq1do8/Resume%20professional%20example%20layout%20with%20comments.pdf?dl=0)  \n\n**About Me**  \n\nI am a Certified HR Professional with over 6 years of experience.  \nMuch of my experience has been in recruitment (*I am not a recruiter though*). What this means is that I am the person creating the jobs themselves, creating the postings for the jobs, receiving the applications, screening the applications &amp; applicants, and conducting interviews with / coaching the managers on selection.  \n\nI had many friends and colleagues approach me, throughout my career, asking for advice about their applications and job search *(engineers, nurses, pharmacists, business admin, and various entry level positions.)* ; all were successfully placed after receiving my advice within a reasonable time period (all under 6 months, within a labour market with an average 7.6% unemployment rate over the last 5 years).   \n\nMost recently I was laid off from a job at the end of July (summer is slow job season), and got myself placed within 3.5 weeks after my lay-off.      \n\nI've been reading through many posts about people sending applications and not getting any responses so I decided to create this guide to job search, application writing and submission.  \n\nHope someone finds it useful.  \n\n**Guide Summary**  \n\nRemember, HR is not a science it’s an art. The purpose of this guide is to give you the knowledge that I have from HR’s side, relevant to screening and selection so that you can better your application and thereby increase your chances of being selected.  \n\nThis guide is broken down into 3 segments:  \n\n* Applicant\n* Job posting\n* Application  \n\nIn the applicant segment I go over competencies and core competencies.  This covers your strengths as an applicant and what you should focus on in your application (cover letter and resume).  \n\nIn the job posting segment we will dissect a sample job posting and go through what is what and where to look for key information when gearing up your application for submission.   \n\nIn the application segment we will cover what you should include, what you should not include and typical do-s and don’t-s when it comes to your application.  \n.  \n.  \n\n**Applicant**  \n“What I can offer”\n\nSo you graduated university and are out to look for a job, you think you’ve had no prior job experience and that the road ahead is simply a dead end to part-time work in a field that is unrelated to what you studied.  \n\nOr you’re simply a person who just got laid off and is not having any luck with your job search. Feeling that the world betrayed you and that you’re worthless?  \n\n**FALSE, YOU SHOULDN'T**  \n\nFirst things first, start with your attitude – you need to be in the right mindset when applying for jobs. You need to be confident but not cocky. Also, self-loathing applicants reflect that in their applications – trust me.  \n\nBefore we talk about your strengths, we need to cover what **competencies** are.  \nUnderstanding competencies is important, because that’s what determines what the right **“fit”** is for a company.  \n\n&gt;Competencies are the measurable or observable knowledge, skills, abilities, and behaviours (KSABs) critical to successful job performance. Choosing the right competencies allows employers to: Plan how they will organize and develop their workforce.  \n[Source](http://www.hr.wa.gov/WorkforceDataAndPlanning/WorkforcePlanning/Competencies/Pages/default.aspx)  \n\nSo companies will be looking for a specific set of KSAs (competencies) from their applicants. What this means is that you should *understand your own competencies and their limitations*. People faking it and lying in their job applications are easy to spot to be honest, and get weeded out very quickly. If you somehow slip through and make it, expect a very hard time in the job you landed with false information, unless you ninja your way through and manage to pick up the skills needed as you go. But be honest and ask yourself, do you really want to suffer through that, or would you rather be in a job that is rewarding in terms of experience and brings peace of mind?  \n\nThose competencies are very specific in what they are. So how do employers define those competencies?  \n\nSimple, competency dictionaries – here is my [favourite one](http://campusservices.harvard.edu/system/files/documents/1865/harvard_competency_dictionary_complete.pdf)  \n\nLook through it and understand what you are putting on your resume. For example, when a company asks for good communication skills they typically want what’s in that dictionary. The dictionary will also go through “Key Actions” and “Job Activities” that demonstrate what good communication is. This dictionary is a sample one and does not contain everything and anything of course. Use google.  \n\n**TIP**: Transferable skills, you have them and they cross over nicely to many fields or industries - if you worked as a barista, for example, you have been developing certain competencies: verbal communication, organization and time management, contributing to team success, stress tolerance etc. Those are applicable to working in an office environment, trust me.\n  \nSo now that you understand what competencies are, take a look at what you’ve done in the past in terms of work experience and schooling. Ask yourself these questions:  \n\n* How have they shaped and developed your competencies throughout your life and career?\n* What can you do well?  \n\n**Your cover letter and resume need to convey your competencies, VERY CLEARLY.**  Here is the ideal layout of what you should include in your cover letter  to showcase your competencies:  \n.  \n.  \n\n-----------------------------------------------  \n  \nDate  \nName  \n\nDear XXX,  \nIt is with great interest that I submit my application for XXX position with your awesome company, your company is great because (**blah blah blah I’ve done my research about your company i.e. I’m not writing a generic letter here**) etc.  \n  \nWhat I can offer / what sets me ahead of other applicants is XXX (**list your competencies here, talk about them and about how they can benefit the employer, best yet talk about how they match what they are looking for in a candidate**) etc.  \n  \nMy experience, schooling and qualifications have prepared me for this shit, I am awesome and you will love me immediately I promise (**paraphrased, do not include that as is**).  \n  \nI look forward to further discussing my qualifications with you, I can be contacted at XXX.  \n  \nSigned,  \n  \n-----------------------------------------------  \n.  \n.  \n\n**Job Posting**  \n“What they’re looking for”  \n\nSo, now we move on to looking at what a job posting will have and what we need to look for when applying for a job.  \nLet’s go with [this sample](http://www.hr.umich.edu/empserv/department/newsletter/sampleposting.pdf) for now.  \nYou will notice some key elements that you need to look at:  \n\n* Typical work duties  \n* Minimum qualifications (must haves)  \n* Desired qualifications (nice to haves)  \n\nFor *typical work duties*, you need to read carefully through them and start mapping your experience and expertise to those duties, relative to your competencies.  \n\nFor minimum qualifications or MUST haves, you need to make sure that you have those. If it says min 5 yrs experience, you better have that or make one hell of an argument for that. If you do not have the min qualifications DO NOT WASTE YOUR TIME.  \n\n**TIP**: Students, your degree counts as condensed experience! For all those of you who say: “Scumbag employer says entry level but requires experience” **YOUR DEGREE IS YOUR EXPERIENCE!**  \n\nFor nice to haves or *desired qualifications*, make sure you check off as many of those as you can – not having them will not impede your ability to do the job, but having them will tell the employer that you can definitely do the job easier.  \n\n**TIP**: What this typically means is that, as an employer I’m willing to train you on how to do this but it would be nice if you already knew how to.  \n.  \n.  \n\n**Application**  \n“Why you should hire me”  \n\nSo now that we understand what you as an applicant can offer and what the employer is looking for. Let’s communicate that to them!  \n\nDo:  \n\n* Include sample work done prior, as long as it is relevant!  \n* Be concise but don’t skimp out on the important information  \n* Review your application  \n* Make sure that you have the minimum qualifications  \n* Make sure that your resume’s layout is appropriate: clear font, legible, appropriate for the job  \n* Place your strengths first, if you’re a student – education goes first with a summary of what you learnt in each class that is applicable in terms of competencies. If you are experienced, place your work history first (chronologically, summarize the relevant material but don’t skimp out on including juicy details)  \n* Be honest with yourself, always  \n* Use action words: achieved, organized, obtained\n* Use [smart](http://www.dartmouth.edu/~hrs/profldev/performance_management/performance_objective.html) when communicating your achievements  \n**Example of SMART**:  \nSuccessfully executed and supported an effective XXX strategy to achieve XXX within X time period.    \n\nDon’t:  \n\n* Include protected property, any work that you’ve done for a company while under their employ will TYPICALLY belong to them, check your previous contract that you signed – you can get sued if you violate it\n* Include company logos or indicators on previous works done if you are submitting  \n* Lie about your experience, you will be caught eventually and it will suck for you and the employer\n* Take the shotgun approach; it’s not a numbers game……  \n* Send out generic cover letters, the layout is the same but please edit the material and content (if I see your company, my generic application sensor starts tingling)\n* Be oblivious when contacted for a phone interview, know your applications and the positions and companies you applied to  \n* Send out generic resumes; tailor your resume’s layout to the job posting. Highlight the competencies the employer is looking for first – if it’s not on the first page, it will most likely not be read!\n* Send out a novel of a resume. You say you have excellent written communication skills? Prove it by summarizing your experience into a cover letter and resume without compromising the integrity of the information you’re conveying\n\nSample resume layout ([experienced edition]( https://www.dropbox.com/s/nw72uc5hc411slt/Resume%20professional%20example%20layout.pdf?dl=0))  \nSample resume layout ([student edition]( https://www.dropbox.com/s/im6ou10a3rh3knu/Resume%20Student%20example.pdf?dl=0))  \n",
      "subreddit": "jobs",
      "score": 202,
      "url": "https://reddit.com/r/jobs/comments/2eukex/a_not_so_simple_job_application_guide/",
      "comments": [
        {
          "body": "disagreeable soft humorous concerned ghost aloof existence numerous terrific capable\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 5
        },
        {
          "body": "&gt; If you do not have the min qualifications DO NOT WASTE YOUR TIME.\n\nWhat if they ask for a decades worth of Hadoop experience as a minimum qualification.",
          "score": 5
        },
        {
          "body": "This is mind-blowing, and not in a good way.\n\nYou're using all the terms and the concepts, but it's shocking to see someone who is supposedly so well-credited in the industry, write something like this. It's as if the academic/applied gap issue is non-existent, so obviously the poor hiring experiences we're all facing is due to applicants not being prepared. It's as if employers can't do anything beyond just reading cover letters and resumes, so we should all stick to that and play along.",
          "score": 6
        },
        {
          "body": "Great guide. I thought the competencies section was especially helpful, I'll use that information to improve my resume.\n\nquick question: At what point do you think unrelated education should be cut out of a resume? I have a 4 year degree in a very niche subject. Some people tell me that it's a good idea to include it for unrelated fields because it proves that I actually went through college. However, I've begun to think that maybe it has been hurting me because it's usually one of the first question I am asked during interviews (\"what's with the degree in X?\", \"how do you feel a degree in X helps you in this line of work?\" etc.)",
          "score": 2
        },
        {
          "body": "Wow this is an amazing overview of doing everything to get that job application through the door. Thanks!",
          "score": 4
        }
      ]
    },
    {
      "title": "What's wrong with this resume?",
      "body": "Can you tell me what's wrong with this resume, please? \nhttps://www.dropbox.com/s/j111y6je5vet23b/yourname.pdf?dl=0\n\nWhy is it impossible to even get an interview?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/u1ggxf/whats_wrong_with_this_resume/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Off the top of my head as an initial glance:\r\n\n'trying to make it' sounds like you don't know what you're doing\r\n\n* last sentence of introduction is weirdly structured\r\n* Job information contains tense shifts 'understanding ... produced'\r\n* 'interviewed lots of people ... etc' is very casual\r\n* 'content writer' section contains typos (audicence) and weird sentence 'with the useage of'\r\n* Right-hand column contains typos.\n\nHope that helps you make some improvements!",
          "score": 4
        },
        {
          "body": "ATS might not be able to read it due to the formatting. Make it one column and get thee to /r/resumes.",
          "score": 3
        },
        {
          "body": "There are some grammar issues, especially in the personal statement. I'm on the fence about whether those are even useful or needed. Some people really love them, so maybe have 2 resumes, one with it and one without. \n\nAlso remember to adjust your resume for the job. If a job ad uses specific keywords, change the resume to match those, where it makes sense. So if they say they're looking for someone who is \"good with math\" and you say you're \"good with numbers,\" I'd adjust the resume to say \"good with math\" rather than \"good with numbers,\" to connect with the ad's keywords.  \n\nIn job descriptions, I would try to be specific. Rather than saying you interviewed lots of people, say \"conducted 50+ interviews with athletes and celebrities, including Michael Jordan, Celine Dion, and others,\" especially if anyone even slightly recognizable was interviewed. \n\nMake achievements stand out - if you wrote things that were the most viewed, give that its own bullet point. If you only have 1 or 2 bullet points, aim for 2-3, and break up longer bullet points into detail-driven, concise statements. \n\nRather than me saying \"I hired interns and managed and delegated work to them,\" I would break that up: 1) Oversaw intern hires 2) Managed 30 team members 3) Delegated work to new hires. Wherever detail can be used, use specific data and numbers, rather than broad or vague statements. For skills, everyone can use email, and most people in your field can use Excel a little, so I'd either drop or change that. \n\nI would either put interests in there (what do you like that makes you unique? Rock climbing, guitar, expert juggler, learning 25 languages?), or be specific. \n\nAs examples, depending on industry and skills, I would say: \nExcel: Advanced User; Email: Marketing, HTML; Coding: Python, Java; Video Editing: Final Cut Pro, Adobe Premiere Pro. \n\nOr, Excel: Intermediate, pivot tables; Marketing: SEO, Email (I have no idea about Excel or marketing, so I'm making that up, but you get the idea). \n\nAim for specific detail, and highlight exactly what you can do with a program that makes you marketable. Assume no one will click links, so make sure as much specific detail as possible, to demonstrate clear achievements. \n\nAlso: try not to be discouraged. The last time I did a job-ad hunt back in 2014, it took 8 months and 20-30 emails every day to get a few dozen interviews, till I found one that was right for me and offered me the job (I had a few offers that were impossible to accept). That was with an Ivy League degree and 10 years of experience in my industry. I'm leaving that industry, cause I'm tired of the competition. But it's a tough job market for everyone.\n\nIf you can, find jobs through company websites and apply directly. If a company you love doesn't have a job, cold-email the hiring department (politely) and say why you love their work and that you are wondering if they have openings, and to keep your resume on file if not. The last job I got (without ads) was from cold-emailing a company I loved, and they needed someone. If you have mutual contacts at a company, use those. Tell everyone you know you're job hunting. Post on social media that you're looking and for anyone to let you know if they see something right for you. Have references ready. Find mutual contacts at companies you are interested in via LinkedIn, and see if a friend will make an introduction for you. If you see a company that has a good job listing, see if you know someone who works there already, and let them know you're interested. A lot of jobs are about networking and who you know, so do a lot of networking.\n\nI hope that's helpful!! I hope you find something amazing soon. I'm about to do the same thing, and I need to write my own resume and start searching, and I know it's super hard!",
          "score": 3
        },
        {
          "body": "It’s not ATS compliant. Get a professional to fix it.",
          "score": 2
        },
        {
          "body": "As mentioned, with good suggestions, have a professional look it over. The wording is off, it shows little actual skillet without reading into duties performed. If they have to think to hard on you, they'll pass. Also, it is likely as mentioned getting flagged through algorithms.\n\nPS. I see youre listed as bilingual but.. You've quite literally got more than one language going on there... review your timelines and *years*",
          "score": 2
        }
      ]
    },
    {
      "title": "Cover letter after 4th interview?",
      "body": "I applied to said company a little over 3 months ago.  To my surprise I received an email requesting I fill out the ATS application on the company site.  When I originally applied I did not submit a cover letter.\n\nI'm torn now though, there are dropboxes for all pieces of information and the final decision will be made tomorrow.  This includes thd application itself, a resume, list of references, and finally a cover letter.\n\nIs it tacky at this point to make one?  Do I draft one in a thank you format to everyone in the interview process?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/lcyb1u/cover_letter_after_4th_interview/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "That’s fine. Don’t stress over it. An antiquated document required by most companies isn’t going to make or break you after you’ve been interviewed.",
          "score": 2
        },
        {
          "body": "Maybe just reiterate some of the key points of the interview.\n\n“As discussed during my interview, I have extensive experience in...”",
          "score": 1
        },
        {
          "body": "It’s likely just to fill the application requirements and a formality at this point, submit a cover letter including what you now know about the company.",
          "score": 1
        }
      ]
    },
    {
      "title": "Help me moving out of India!.😢",
      "body": "Hi Redditors!.\n\nI want to move out of India since I get paid peanuts and competition is cut throat.\n\nFeels like I'm in a rat race,specially when I open LinkedIn.I try not to open LinkedIn a lot since I start to feel bad about myself.\n\nI need referrals from firms which can sponsors my visa.\n\nI'm open to relocating to Canada/Germany/Ireland/Netherlands or any other that you can help in getting a referral for.\n\nTalking about my interview prep, I can solve most of  easy/medium \nLeetcode ds algo based question (still suck at dp/tries and grphs sometimes tho) that are thrown.\nI can design tinyurl,dropbox, Twitter, Facebook news feed,etc.\n\nI've a solid open source contribution  which makes my github all green.I mostly code in golang and bash.I also have a lot of experience with kubernetes/docker and can explain containers to even a 5 year old kid.\n\nI have delivered talk in conferences like fosdem in Belgium,last year and got selected for FOSSASIA singapore but couldn't make it due to covid back in 2020.\n\nI don't care about CTC at the moment since my first priority is to relocate.\n\nI'm open to join a startup/big tech firm ANYTHING.\n\nIn my free time, I run a lot (8-10kms everyday), play football/table tennis and make Making these daily ish vlogs on YouTube.\n\nPlease help me in getting out of India.Shoot me a dm or comment down below. I reply usually in 200 seconds.\n\nThanks\n\nTc: 10lpa\nYoe:~2\n\n\n#tech #referrals #relocation  #help",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/m57lnl/help_me_moving_out_of_india/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Where would you pick if you were me? Tibco or DropBox/HelloSign",
      "body": "Hello,\n\nI'm currently a Solutions Engineer with about 1-1.5 years of SE experience and 6.5 years of Sales experience. I recieved an offer from Tibco and HelloSign/DropBox and I was wondering which one I should pick and was wondering if anyone that knows of the 2 companies can advise.\n\nTibco Offer:\n\n* 115K Base Salary...164,286 OTE\n* They initially interviewed me for a Lead Solutions Engineer role and then changed my title to a Senior Solutions Engineer role....but said that I can keep the Lead title for social media and such. This is important to me because it'll help me transition into leadership on my next gig\n* Why I liked Tibco. Very well known Company with a deep product suite. I transitioned into an SE role by learning AWS and I have a passion for Cloud technologies. Tibco has a lot of products that'll allow me to work within the AWS ecosystem and orchestrate the process of building cloud-native applications from a simple GUI. I feel like as an SE, I'd enjoy the products at Tibco.\n* Didn't really get a feel for Company culture as they interviewed me virtually due to the pandemic. \n* I had to take a CCAT Assessment test, basically like a mini IQ test before interviewing with Tibco and that made me feel like they're very careful in who they selected. \n\nDropBox(HelloSign) Offer:\n\n* 125K Salary....155,000 OTE\n* $23,800 RSUs of DropBox stock \n* Every perk you can think of (7k to spend on whatever you want, paid cellphone bill up to 100, paid internet up to 45 bucks)\n* Killer Benefits (Too many perks to list)\n* Boring product from what I saw. HelloSign is an e-signature platform and I feel like I'd fall asleep demoing this product over and over. However, there is a huge need seeing as a majority of companies out there are moving to an e-Signature platform. I'll hit my numbers. \n* Very easy interview process; their tech screen was just a convo about HTTP protocols, cookies, how the internet works, what an API is, and what a webhook is. They basically alluded to the offer right away. Unlike Tibco who gave me an assessment test prior. \n\nSummary: I think I might make more money with HelloSign/DropBox and be bored. Also, I'm not sure which brand helps my resume more in the long-run. Having Tibco or DropBox(HelloSign)?\n\nAny advice would be greatly appreciated. I have till Monday to make my final decision.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/le09w8/where_would_you_pick_if_you_were_me_tibco_or/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Ghosted AFTER getting the job?",
      "body": "I recently applied to be a wedding vendor for a company. I have great experience and portfolio, the recruiter was excited to be talking with me and she was extremely responsive during the interview process. Every email I would hear back from her within hours. So a week after I applied they send all the paperwork I need to fill out to be contracted for a year (not an employee), they got the contract and I still had a few things to send over, next day I send over portfolio images they requested, tax info, etc. then I don’t hear from her. I emailed several days later to make sure she received the images I sent through Dropbox no response. It’s been a week now and I haven’t heard from anybody, I don’t know if I should contact the recruiter again. My page is still up where I can customize my calendar, I’m not sure if I should try calling or what now. Is a week normal when someone’s been so responsive? It feels weird to hear crickets after someone’s already signed you on..",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/bxiv40/ghosted_after_getting_the_job/",
      "comments": []
    },
    {
      "title": "I keep getting laid off from my jobs, in my programing career. How do I handle this and fix it? It's negatively affecting my finances and way of life.",
      "body": "I have a really bad recurring problem in my career. I get laid off at almost every job, and I want to know how to handle it properly so I can prevent this from happening as much as possible. I do mostly web dev and consultaing for web agencies, but also have been at a few early startups.\n\nSince graduation, I've always been going back and forth between working as a contractor (and also low paying at that) for about a year or two, and applying for jobs for another year or two. And going back to being broke in the process.\n\nThis has been going on for 4 different jobs, over the span of around 10 years. Also, I'm not sugaring it up to avoid saying \"fired\". At these jobs, it was never stated to me that I was fired or terminated. Goes well for a while, then the company says they don't need me and lay me off. Usually it's because these places have high worker turnaround and unstable budgets to begin with. They have no more projects on the line, or the work they have no longer fits my set of skills.\n\nSince most of these jobs were also contractor jobs, I do not qualify for unemployment insurance when I leave, which makes for a double dose of bad.\n\nI understand that layoffs happen even in the largest of companies, but what I don't know is how can I protect my ass so that it doesn't get me back to square one. It's not like these places paid well, so I use up all my saved money in a year. What? Surely you would have found another job within a year, you might say. Not always true.\n\nSo I have no idea what to do here. How to end this vicious cycle?\n\nAside from looking for work, I spend my unemployed time learning new programming skills, and just doing usual family errands since I get more time to spend with them. I live with my mom, but still pay for my own bills. Misc. facts: 35, male, Hispanic, no kids.\n\nI know a few friends and colleagues, but they don't have much business worth in this situation, as leads for programming jobs usually come up cold with them.\n\nSome questions I anticipate that I could answer beforehand:\n\n**Why do you keep going back to contract jobs? Don't you want something full-time?**\n\nInitially, I took what I had. After I graduated with a degree, I applied to a few places on Craigslist. Now I apply in multiple job websites, for a wide variety of programming work. I take the \"shotgun resume\" approach. However, the only types of offers I get are from the contract jobs. The last full-time salary job I had was working at a department store when I was in college!\n\n**Have you used job recruiters?**\n\nYes, multiple times. I have met with about a dozen local recruiting agencies in the local area. Usually, I hand them my resume, they call a few companies that are looking to hire, and sometimes get into job interviews. Never have I gotten an interview convert to an offer with a job that was discovered by a recruiter.\n\n**Is the local market too small? Would you consider relocating?**\n\nThe local job market for programmers is not really small here in Chicago. It just feels, like, whatever. Most of the options we get as programmers are local web agencies (which I got burned out from), a bunch of startups but nothing West Cost level, and loads of financial companies, which I am not used to working for.\n\nI would relocate contingent on an offer that includes paid relocation. So usually that would mean working for a company that has their budget well placed for their employees.\n\nFinally here's an anonymized resume for your reference: https://www.dropbox.com/s/h60xf53q47zw23z/web_resume_o.pdf?dl=0",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/7iza5a/i_keep_getting_laid_off_from_my_jobs_in_my/",
      "comments": [
        {
          "body": "Chicago is not known for being a strong tech area, if your experience for the past decade has not been good, I think you probably need to really prioritize other areas. There isn't any particularly interesting tech I'm aware of coming from there, so it's relegated to the level of any other backroom operations function, which is essentially commoditized labor. ",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm going to get deported because I can't find a software job in Silicon Valley",
      "body": "Hey guys, I really need some help. I graduated with a BS in Computer Science back in May and got my work auth at the end of August from USCIS. I'm a foreign student from Canada on an F1 Visa, and I did my entire education in the USA. After getting my work auth I immediately set out to find a job, but so far (~60 days later) I still can't even find part time or volunteer work in my field. I need to find something with 20 hours a week or more by November 23rd or else I'll be kicked out of the USA and forced to move back to my home country, where I'll have even less of a chance at employment because I know essentially no one. I feel like I've applied multiple times everywhere, but I've landed exactly one in-person interview and 3 phone interviews, and have been rejected or ghosted by all other applications.\n\nI really don't know what to say here except please for the love of god help me. I'm at the end of my patience here. I'd take a job at McDonalds gladly if I was legally allowed to. I want to work, I want to contribute to society and I want to make money, but it seems like the entire system, government included, is against me. If anyone, and I mean anyone, can give me a job that the US government will think is in my field and that gives 20 hours of work per week or more, I will take it. I don't even need money, I just don't want to be deported.\n\nResume here: https://www.dropbox.com/s/gqmc60iib7m28aj/Resume%20Spencer%20Belleau.pdf?dl=0\n\nThanks in advance for any help you can provide.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/5b8ih8/im_going_to_get_deported_because_i_cant_find_a/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "Start networking. Contact people from your alumni network and ask to meet for coffee, bring your resume with you. ",
          "score": 2
        },
        {
          "body": "Come to Seattle, neighbor. There's a million tech jobs here: Amazon, Microsoft, Expedia, Nintendo, to name a few. Then if you don't find one, you'll be like the million or so illegal immigrants here already.",
          "score": 1
        }
      ]
    },
    {
      "title": "A Detailed Analysis of the Evolution of an Undergraduate Student Resume",
      "body": "###A Detailed Analysis of the Evolution of an Undergraduate Student Resume\n\n\nI thought I would take some time to reflect on my career path this fall Sunday, and more importantly, countless mistakes I had made with my resume.\nThis morning I found a file of old resumes as I was cleaning my hard drive. In fact, I was able to locate one from each year of college.\n\n\nLet’s profile the progression of an undergraduate student resume to help you benchmark your current resume. Use this analysis of past resumes to identify best practices, learn when to seek help, and what mistakes to avoid.\n\n\n###Freshmen Year^r^r^r^r\n\nA lack of professional experience coupled with insufficient knowledge of resume mechanics will make it difficult to position yourself as a competitive candidate, especially for those who are seeking their first internship.\n\n\nFreshmen don’t have time to worry about effective resume preparation, let alone educate themselves on tedious resume details. I was not an exception. Rather then grouping sections by experience, I chose to organize sections by competencies and use examples from various self-directed projects and organizations to support the claim. This approach resulted in some weird resume/cover letter hybrid:\n\n[Freshman Year Resume](https://rezi.io/wp-content/uploads/2015/07/Y11.png)\n##Resume Elements include\n\n• Objective\n\n• Skills summary\n\n• Skills and Experience\n\n• Computer Skills\n\n• Education and Training\n\n\nLuckily, as an undergraduate, you’ll have many university provided resources at your disposal. I suggest reaching out to your university’s career advising center…but heed my warning, those guys are busy; really, really busy. If I remember correctly, they suggested I highlight any time I learned or used a technical skill.\n\n\n###Sophomoreo Year^r^r^r^r\n\nWhile freshman year should be spent integrating yourself into student organizations, exploring academic opportunities and developing technical skills (I suggest you take advantage of free university-provided software training classes. These courses will help develop a foundational technical understanding and can be included on your resume). Sophomore year is a time where the ambitious gain an advantage by applying to competitive internships or research positions. A proper resume is paramount to landing such a position…\n\n\nFall semester of my sophomore year I started an e-commerce business and was faced with a dilemma…how does this new experience fit into my existing resume? The answer: It didn’t. The resume of freshmen year had to go.\n\n\nThis iteration of my resume focused on proper formatting mechanics (poorly) more so than the content:\n\n[Sophomore Year Resume](https://rezi.io/wp-content/uploads/2015/07/Y2_Page_1.png)\n\n\n##Resume Elements include:\n\n• Objective shortened\n\n• Education highlighted\n\n• Defined experience sections. Organized by themes of freshmen achievements\n\n• Introduced bullet points\n\n• Skills section in list form to increased ATS readability\n\n• Font &amp; typeface selection\n\nIf you’ve developed great experience but have little knowledge of formatting, take a look at a Resume Template. Let someone else's knowledge of resume mechanics take care of the dirty work while your experience does the talking.\n\n###Junior Year^r^r^r^r\n\nCareer fairs, mock interviews, networking…junior year should be your busiest yet. Hopefully by now, you are well emerged in student organizations and maybe your persistent dedication has landed you a leadership position (LPT: that’s the goal of student organizations).\n\nYour chosen career path should be more clearly defined. Now that you’re past the halfway point, you should really think about want you want to do post-graduation. The summer following your junior year will be the launching pad of your career. Aim to use this period to excel in a position related to your vocational goals.\n\nKeep in mind these positions are even more competitive. Your resume must be on point, master the tedious mechanics if you want to see results. Luckily, my roommate was a resume reviewer for the university business school. Here is the resume we created together:\n\n[Junior Year Resume](https://rezi.io/wp-content/uploads/2015/07/Y3.png\n)\n##Resume Elements include:\n\n• Objective deleted\n\n• Education highlighted\n\n• Defined experience sections organized by accomplishments\n\n• Introduced well thought out and actionable bullet points\n\n• Skills section in list form to increased ATS readability\n\n• Font &amp; typeface selection\n\nIn this iteration I focused on quantifying accomplishments and making sure my experience descriptors contained critical elements. I also made a major shift in the format. This is the resume was used to land my first “competitive” internship\n\n\n###Senior Year^r^r^r^r\n\nSenior year was essentially building on the experience I developed during the previous years and tailoring my resume to reflect this. It was around this time that I first heard about Applicant Tracking Systems, or ATS. The first version was used to land my second “competitive” internship. The second semester version of this resume is my first attempt at optimizing it to pass ATS.  Let’s take a look:\n\n[Senior Year 1st Semester Resume](https://rezi.io/wp-content/uploads/2015/07/Y4.1.png)\n\n##This is the final resume that was ultimatley used to land interviews at Goldman Sachs, Google, Dropbox, and more for marketing related positions. [Proof 1 Google](http://i.imgur.com/ByiXqm4.png). [Proof 2 Goldman](http://i.imgur.com/0jDHBAN.png).\n\n[Senior Year 2nd Semester Resume](https://rezi.io/wp-content/uploads/2015/07/Y4.21.png\n)\n\nYour resume may take a similar path of continued improvement but we suggest you skip right to the punch. Take advantage of years of development and check out the Rezi BETA Resume Template.  From the students Rezi has talked with, a commonality that we are seeing with student resumes is they do a pretty poor job of pulling key skills out from education. \n\nMany students don't have relevant work experience to highlight those skill sets. The goal of the [Rezi BETA Resume Template](https://rezi.io/optimized-resume-template/) is twofold, to show the employer that the student has learned the skills they need to be a successful employee, and simultaneously increase employer knowledge on educational programs to increase the perceived relevance and value of education. \n\n\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/40vkxm/a_detailed_analysis_of_the_evolution_of_an/",
      "comments": [
        {
          "body": "Your resume is well written though I'm not a fan of the registered trademark symbols -- they look silly.  I would suggest you try to make it even more concise. \n\nLayout and design has room for improvement of you intend on staying in marketing.  Graphic design, marketing and advertising gives you room to make something slick. \n\nEdit: Just want to add that I like what you wrote for the Adwords Marketing Intern section. \n\nEdit 2: hah, I skimmed the intro initially and missed the part where you said these were old resumes.  ",
          "score": 2
        }
      ]
    },
    {
      "title": "23(M) little luck finding a Job in Nashville; Music Industry",
      "body": "Like the title states, I am 23 and somewhat recently graduated with a BA in Media Arts (December 2015). \n\nI worked as a social media manager while in college doing various marketing and promotion, and was lucky enough to land a summer internship (Summer 2015) at a very large artist management company in Nashville doing the same kind of work (digital marketing strategy and post production editing). After returning to school for my final semester, I continued to pursue a career in music business by taking classes that would benefit my work (music entrepreneurship, audio engineering, LOTS of web design and video editing) in addition to being employed by the school as an Audio Engineer’s assistant. \n\nI absolutely loved my internship and the company, as I have been involved in music business from a young age, and has been my primary focus since about age 14. \n\nSkip ahead to January 2016-July 2016 and the only jobs I have had are working at a restaurant (don’t mind, just want more) and a non-paid position writing live concert reviews for an entertainment website. \n\nI have applied to well over 50 jobs in the greater Nashville area, and have had only 2 interviews. I’ve attached my resume to see if there is possibly anything that looks iffy, and have done multiple background searches and google searches to see if there is any negative thoughts about me (None found yet, have never been in trouble other than a speeding ticket). \n\nShould I just throw in the towel and apply for a position that isn’t the music industry? I have only had one job that didn’t deal with music on a day to day basis in the office, being a legal assistant, and found it wasn’t for me. I am incredibly sociable and outgoing, and feel very comfortable communicating with artists, managers, and venues alike. \n\n It just bothers me that I am never considered for positions, even with past experience and references. \n\nThanks for any feedback, I need all I can get. \n\nhttps://www.dropbox.com/s/m83iknlvisxr5b7/Reddit%20Resume.pdf?dl=0\n\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/4tmnn1/23m_little_luck_finding_a_job_in_nashville_music/",
      "comments": [
        {
          "body": "Just seeing this post. Any updates?\n\nI would suggest adding more facts and figures to your resume to show the results of what you did. One example:\n\n&gt;Promote the website through social media influence\n\nCan you say how many visitors came to the site from social media posts? Or how much the follows/likes/other stats grew over your tenure? \n\nHappy to give more feedback if you're still interested.",
          "score": 1
        },
        {
          "body": "Do you freelance?",
          "score": 1
        }
      ]
    },
    {
      "title": "Job search postmortem - Advice and resume/cover letter examples (non-apology apology for the long post)",
      "body": "As a warning, this is going to get pretty long. I'll try to keep it as clear to read as possible and try to put things in a meaningful order of importance.\n\nI just started a new job after a 2-month job search, so I wanted to offer some advice on things that worked for me during this time so that others can hopefully benefit from my experience. I hope this helps someone.\n\n**Disclaimer:** Before I start, I'd like to state for the record that my resume and cover letter landed me just over a 70% response rate which feels pretty good considering that I have short employment terms and often fall below the \"job requirements\" posted in most ads I applied to. I just want to say, by presenting yourself well, anyone can do it.\n\n* **Step 1: Figure out what you want to do**\n\nThis sounds somewhat obvious, but I used to drift from one job to the next, mostly just looking for a paycheck and not having a clue where I wanted to be in the next year, let alone 5 years. Once I got an idea of what I really want to do, it means I can focus my job search, and that every job I take on this path is valuable, relevant experience. No more trying to get the next programming job with 6 months of waiting tables in between.\n\nIt also means I can spend downtime carefully crafting my portfolio into something that prospective employers will be looking for instead of bumming around with no idea how to get ahead.\n\n* **Step 2: Get those skills**\n\nBefore you can land the dream job, you need to be able to do it.\n\nThis is a step that I've managed to do while somewhat short-circuiting the system. I don't have a college degree, and lucky for me, that's becoming less and less necessary as higher education goes under society's microscope. What I did have, however, was a strong ability to Google for information, and the start of a portfolio that's getting stronger all the time.\n\nFor software development specifically, I'd recommend a site like codecademy or teamtreehouse to get some chops. For other industries, I'm certain there are ways to get yourself at least a basic level of hands-on skill. Tinker with things, take things apart that other people have made, work on projects/build things in your spare time. Just do a little bit at a time that will put you closer to your goal.\n\nYou don't need to be an expert. Your goal should be to learn as much as you can about as many relevant topics as possible. Details can be learned in the course of working a job, as long as you have the foundation in place.\n\n* **Step 3: Look in the right places**\n\nNot too much to say here other than be sure to look in nearby locations. As an example, I live near Denver and also checked Boulder craigslist regularly.\n\n* **Step 4: Get your resume to make sense**\n\nEven in the last few years when I started to discover my passion, I still had random jobs on my resume that almost certainly didn't help, like working in a lab 5 years ago, or being a waiter a couple years before that. I've since pared things down to the nuts and bolts of what matters, and left off experience that doesn't. *I get the occasional random question like \"you've only been working for a couple of years?\" but it's definitely better than having people think I don't know what I want. Most people get it.*\n\nI've overhauled my resume more times than I'd care to admit, and each time it gets a bit easier to read and digest, and makes me come across stronger and more confident. The latest version is written in more of a speaking tone, with less \"powerpoint-like\" bullet points and more sentence structure; things like \"I worked on...\" instead of \"Performed duties such as...\" etc. Personally, my work experience has been cut short at some companies (working for small businesses leads to circumstances outside my control) so in those cases I've listed a reason for leaving. Any job that's lasted longer than a year shouldn't need this.\n\nI absolutely believe that a resume should be no more than one page. If your work experience goes back farther than what you can list in that space, consider cutting out older and/or less relevant points. You don't need 10 bullet points for every job.\n\n**Here's a link to an anonymous version of my resume. I really think this stands out due to the way I've structured it. https://www.dropbox.com/s/wqgpq32ytnae9ll/Resume-Anonymized.docx**\n\n*Pro-tip:* Laying out my skills into meaningful categories hopefully means my resume is more scannable by a person. Make those 30 seconds count!\n\n* **Step 5: Prepare a good cover letter template**\n\nMy cover letter gets sent out as the body of the contact email. I keep it in a .txt file, I do not have a word doc version. It's got a couple of sentences about who I am as a person, what drew me to their company, what key skill I possess that will be an asset based on the job description, and then bullet points describing things I've done - effectively a rehash of my resume. Again like my resume, this is written in a tone that sounds more conversational. I do this to show a bit of my personality, which is an important part of the fit for me.\n\nIf my cover letter does its job correctly, they shouldn't even need to open my resume to see that I'd be a fit for the job, it's just icing on the cake. No droning on and on about how I heard through Jimmy that they were hiring and that I'd be happy to work my way up from toilet scrubber just to get that foot in the door. Remember to have some dignity, and that they want someone confident just as much as you want the job. **The cover letter is not for you to kiss their butt, it's for you to show any strengths that your resume doesn't convey.**\n\nBe sure to make [minor] changes for each company. It shows that you read their description closely and aren't just throwing your resume into the wind hoping it lands on the jackpot. When you say what draws you to the company and/or what skill you possess, really mean what you say.\n\n**Here's a link to an anonymous version of my cover letter. Feel free to steal it, modify, fold, spindle, and mutilate it to your heart's content. https://www.dropbox.com/s/3yycmc9zvxtp1mg/cover-letter-anonymized.txt**\n\n*Pro-tip:* The last line has an interesting sentiment in it. The people you're applying to will become your coworkers, and putting yourself into their mind in this way is a little bit of a psychological hack.\n\n* **Step 6: Email exchange -&gt; Phone interview -&gt; In-person interviewing and beyond**\n\n*I'm not the best at interviewing, so I wish I could offer better advice in this section. I can definitely say that practice makes you better, so use each interview as an opportunity to think about how to do a better job in the next one.*\n\nAlways be polite and courteous. You don't have to bend over backwards to make weird times fit, but try to be available when you can. I like to interview from 11am-3pm and suggest these as available times for me. It keeps me from having to fight rush hour in either direction (going into an interview MORE stressed? no thanks!) and gives me plenty of time to wake up, shower, and otherwise get ready to face the day.\n\nIf an interviewer asks if you're interviewing with other companies, *always say yes!* Even if this isn't true at the moment, it makes you look like a better candidate because other people are interested in you as well. Don't give out names with this, or get nervous and start going into detail, just say something like \"I'm in the process with a few other companies\" and leave it at that.\n\nUse the interview as your chance to get to know your potential employer and/or coworkers. I'm pretty guilty of trying to make a square peg fit in a round hole, but if you know the interview is just going terrible, try to salvage it as a learning experience and move on. As a software engineer, I've had interviews that range from friendly, non-technical personality feels, to standardized-test-level grill sessions and everything in between. The latter always frustrates me, because I know that the job just won't be a fit, but it's impolite to end things early. Keep in mind that if they don't really get you, it's probably not the place you want to work.\n\n* **Step 7: Following up and getting the offer**\n\nWhen it comes to anticipating an offer, don't get too cozy with any company you interview with. What I mean is, don't let interest with a company you like bring your job search to a halt otherwise. Nothing is solid until you receive a formal offer, and as much as you may try to push things along, you're working on the company's timetable. Some companies have up to multi-month hiring processes, so do what you need to do.\n\nDefinitely follow up on emails and phone conversations. It's perfectly ok to send a thank you or followup note by email. Handwritten notes are indeed better, but make sure you send them out quickly since snail mail takes longer. Don't feel the need to handwrite a note to everyone that invites you to a phone interview, I would probably save this for a \"dream employer\" because of the extra effort involved. In general, a good rule of thumb is to follow up about once a week with a brief email renewing your interest (and hopefully renewing their interest in you) - mention a couple of small details about the previous conversation like \"I really enjoyed talking with you about ... \" (something not in the job description, maybe you connected on a personal note) - They will let you know if they're no longer interested in you as a candidate, so until this happens, be persistent!\n\n* **Closing thoughts**\n\nDon't give up hope. Something will come along, and it'll be the result of your hard work and diligence. At the end of the day, that feels amazing. ",
      "subreddit": "jobs",
      "score": 9,
      "url": "https://reddit.com/r/jobs/comments/244tek/job_search_postmortem_advice_and_resumecover/",
      "comments": [
        {
          "body": "This is a great read. Thanks for taking the time to write this up for us! I find it particularly helpful. ",
          "score": 2
        },
        {
          "body": "Do any Pros have any tips about speaking in first person in your resume?  Is speaking in first person ideal?  If so, I need to make some changes to my resume.  ",
          "score": 1
        }
      ]
    },
    {
      "title": "International Business Resume Critique",
      "body": "From what I could find this doesn't seem to contravene any subreddit rules, so here goes.\n\nI've been applying to jobs ranging from policy related to consultancy and some finance things for the last 3 months and have yet to land an interview of any kind. I'm thinking it may have something to do with my resume not being written well. I tried to follow the rules I've seen on resume writing guides but if you guys have any suggestions, any and all would be very appreciated. I've removed any of the obvious identifying information.\n\nhttps://www.dropbox.com/s/g27xiu4onsprkpz/Resume%20Reddit%20Critique.pdf?dl=0\n\nThanks guys!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/3g0zml/international_business_resume_critique/",
      "comments": [
        {
          "body": "I don't think it is a matter of being written well, but of a weird work history for the types of jobs you are applying for.   The description and work history make it sound like you are probably just taking a job until you come up with your next start-up idea.    \n\nI think if you want a regular job, you need to focus on the aspects of your start up that relate to the job and give yourself a job title at your start-up that relates to the role that you want.  \n\nAlso, your summary is a bit long.  It isn't easy to pick out the key skills/differentiators you have. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Worked 4 years doing help desk work; looking to climb the IT ladder and be financially stable. Help is appreciated!",
      "body": "It's nice reading posts here with people in similar situations knowing I'm not alone, so maybe explaining my story will help.  \n\n\n***Backstory***\n\nI'm 31, live in Northeast Pennsylvania, and recently lost my help desk job I was at for four years. Before that, I worked at a warehouse job doing manual labor for a three-year stint before going to college for my Associates Degree and then doing the same warehouse work on a separate shift for another year before being disgusted to the point of walking out. Before *that*, I worked a few years doing minimum wage retail jobs at a few places. \n\nMy Associates degree is in Music Recording Technology since I got bit with the \"Money isn't everything! I want to have a job that's FUN!\" bug when registering for college. It being my \"dream\" job is a good reason too. I adore music and would eventually like to play on stage in a band and be around more live/studio recording sessions to learn more things and have enough money to one day have my own recording equipment to tinker with. I'm also slowly learning my way around the guitar and want to take vocal lessons eventually. \n\nGood grades were never an issue. My college has four honors societies and I'm a member of all of them and graduated with a 3.9 GPA. Graduated in the top 10% in high school with a similar GPA as well. \n\nAs you can most likely discern, there are no lucrative jobs in the music industry out of college. I was left twisting in the wind after graduation since I figured I would at least get my foot in the door somewhere and move up as I got more and more experience. So, in order to fund my \"Plan A\", I've fallen to my \"Plan B\": Computer work (hence the four years at a help desk). \n\nI'm naturally an introvert, but the reason I stayed so long at that help desk position was because it was easy. The company I worked at takes calls from pharmaceutical employees for tech support and is broken up into different desks. I went from one dealing with several different companies to one of these accounts breaking off onto their own independent \"wing\" of the help desk company after a successful job interview and being in the good graces of the Help Desk Manager for that particular account.  \n\nFrom then on, I worked night shift (which I don't mind since I've always been a night owl) and took anywhere from 3-6 easy calls over the course of 8 hours and got to surf the web, watch videos, etc. In hindsight, I should have studied for certifications more and watched Youtube videos less, but I grew apathetic due to a combination of this company hardly ever giving raises or chances for promotion, me being complacent, no other jobs I've applied for getting back to me, and them just being unprofessional in general. \n\n\n***Present Day***\n\n\nSo that's the past, and now for the present: This aforementioned company is blocking my ability to temporarily get unemployment benefits for \"willful misconduct\" (which is complete bullshit; have an appeal hearing on Tuesday), my savings are gone, I'm barely keeping my head above water by paying my bills with my mom's SSI (which makes me feel like a scumbag; feeling like I'm being a burden on someone is one of the worst feelings in the world), my SUV from 2001 needs repairs on it and gets 13mpg on a good day (at least it's paid off and is phenomenal in the snow), and my fiancee is 2 months pregnant and we have been trying to move out of the 4-room apartment she's lived in for over 10 years and I'm freaking out because I can't help her financially at all and want some financial stability in our lives before our child is born. \n\nMy ideal computer job would be a desk job (I can't stand for a long period of time anymore due to being born with a club foot and have increasingly bad arthritis pain in it as I get older) where I do \"behind-the-scenes\" work and flex my existing IT skills and learn new ones too. A local Lowe's distribution center had a \"night planner\" job I applied for due to a recommendation from someone who already works there that was basically an computer job tracking inventory with minimal supervision. According to him, I killed it at the job interview I eventually got, but they had to give the job to someone else who already worked there because of a special circumstance. This was devastating as I was perfectly qualified for that job. It would have been perfect. :( \n\nI'm on LinkedIn, Indeed, Monster, and Careerbuilder in addition to having a headhunter from a staffing company try to find me a job after explaining all of this to him. I keep trying to follow-up with him, but don't get anywhere. I've applied for pretty much any IT job within 20 miles of me (plus an IT job at Amazon that's 40 miles away, which will kill me in gas, but I don't have any options left), but my phone isn't ringing. \n\nMy resume is here (took out my personal info from the header) https://www.dropbox.com/s/6pbgzb8fqgyp5l6/Updated%20Resume.doc?dl=0.\n\nAnd due to recent modifications on my resume, I have placed my Objective Summary in a new Cover Letter I whipped up: https://www.dropbox.com/s/7u7ldqkd0kky6yb/Cover%20Letter.doc?dl=0\n\nAm I doing something wrong? Should I be searching for a very specific computer position I keep missing on my searches? Let me know what the best way would be to re-format the Objective and Skills sections to say: \"Yo, I'm pretty good at this computer stuff since I've been messing around with them forever. Give me an IT job where I can use these skills, learn new skills, not want to pull my hair out every 5 minutes, and eventually move up and make enough money to be a provider and take care of myself finanically.\"\n\nSorry if I rambled too much but I really don't have anyone to talk to seriously about this stuff, am pretty discouraged, and get my thoughts down on \"paper\" much better. Thank you for anyone whom has read this and can help at all. :)\n",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/3jxhfk/worked_4_years_doing_help_desk_work_looking_to/",
      "comments": [
        {
          "body": "- I'm not sure what you're searching on the job sites but you might be able to widen your net a little and aim higher than help desk or the equivalent positions (analyst is a term I always start with). These positions may come with the added requirement of \"related degree desired\" though. \n\n- The resume should be changed with each job you apply for (at the very least the objective to mention the company's name and the position you're applying for).  \n\n- On my resume, I have a section for each hard and soft skills where hard skills is MS Office, SQL Server, and programming languages with the number of years experience I have in each (quick reference for people who browse the resume quickly). Soft skills contains things like analytical, project experience, etc. \n\n- I would personally get rid of the skills sidebar but others may say there's nothing wrong with it. If you do keep it, get rid of VLC Media player and WinRAR, and Creating CDs and DVDs. \n\n- If applying through an online process, make sure you have a cover letter to go along with it. Also make sure both the cover letter and resume have as many words relating to the posting as possible (to increase the chance of getting through any electronic filtering system). \n\nFeel free to PM me to discuss more, I work in IT currently. ",
          "score": 2
        }
      ]
    },
    {
      "title": "Choosing jobs to pursue?",
      "body": "I'm a recent college graduate. I'm combing through hundreds of job postings and I can't seem to find anything beyond basic administrative jobs ($9-12/h) which ask for extensive experience. I'm hoping to find something career oriented to get some level of valuable experience. \n\nHere is a link to anonymous resume I've been using so far. https://www.dropbox.com/s/ckzkrb3tds8nd3u/SampleResume.pdf.doc?dl=0\n\nCurrently I'm working part time retail at Macys. I've spent about 4 years as a dishwasher before and during college. I've also spent a short time at Walmart on contract. \n\nI had hoped my senior thesis and two internships would help land a semi decent position. So far I haven't even had an interview for anything but other basic retail jobs (Mcdonalds, Kmart, etc). \n\nIf you're wondering, I didn't get a position after my internship simply because none were available and they were upfront from the beginning but I felt the name recognition (very high across the U.S) and good will towards the Senator was worth something. All the positions were filled before the internship started and none of the interns in the last few years have gotten jobs.  \n\n\n\n\n",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/2vlvf1/choosing_jobs_to_pursue/",
      "comments": [
        {
          "body": "Your resume definitely needs work. Go look around [r/resumes](http://www.reddit.com/r/resumes) and find examples to follow. \n\nSince you work at Macy's and you're a recent college graduate, have you ever considered Macy's Executive Development Program? There are rotational programs for various fields like store management, asset protection, product development, information technology, human resources, etc. Connect with a recruiter on LinkedIn and join Macy's Student Network group. ",
          "score": 2
        },
        {
          "body": "The resume looks like 1997, and you should drop the references bit. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Applying for a entry level trade job, need help with resume and interview skills.",
      "body": "Hi, I'm looking to get a job at a ship building yard. This will be my first job in that line of work. They have three openings that I am looking to apply to. I want to apply for the Helper, Steel Welder and Pipe Welder positions. I have decided that I am done with college for the time being, and wish to get a trade, specifically welding pipe. But I will take other options. They offer training in the trade if I were to get hired. If you all could help me get my resume up to specs, and any tips for interviews, assuming I get one, that would be awesome.\n\n[My Resume](https://www.dropbox.com/s/n3p0axcwl5gubpg/My%20Resume%202.docx?dl=0)",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/2pdpcx/applying_for_a_entry_level_trade_job_need_help/",
      "comments": [
        {
          "body": "You may wish to present a resume to us that excludes your personal information.",
          "score": 1
        }
      ]
    },
    {
      "title": "Having a horrible time with on-campus recruiting",
      "body": "Greetings Jobs,\n\nI have been having a hell of a time landing an offer from any of the firms recruiting on campus at my school.\n\nI have decent grades (3.4gpa), great work experience (regional manager for a small chain of restaurants), and I feel like I've been killing my interviews (Able to answer all questions using STAR technique, have applied large amounts of coursework at work, significant leadership experience).\n\nSo my question is, can you look at my resume and tell me if there is something scaring recruiters away. I didn't even get an offer to interview with any of the Big4 despite massive amounts of networking and I'm confident that my interviews with a regional audit firm and a regional consulting firm only came about because my Tax professor really likes me and knows people at both firms.\n\nI really don't know what to do because I've left both interviews feeling incredible and don't know how I can do better.\n\nHere is a link to my resume [1] http://dl.dropbox.com/u/5454885/Nameless%20Resume.doc\n\nPlease help! I'm desperate!\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/ltx01/having_a_horrible_time_with_oncampus_recruiting/",
      "comments": [
        {
          "body": "&gt; I didn't even get an offer to interview with any of the Big4...\n\nI don't think you're being realistic. You probably aren't going to get a Big 4 interview with that GPA unless you are at a top tier university, or they are recruiting you.\n\n'Decent' grades don't get you entry-level jobs at such places. 'Excellent' grades do that... along with a lot of luck.\n\n&gt;I really don't know what to do because I've left both interviews feeling incredible...\n\nStop doing that, for starters. Most entry-level folks will go through *dozens* of interviews or months and months of looking for work until they land an offer. You need to get used to rejection.\n\nRule #1 about job hunting: have an even keel. *Never* get too up about thinking you aced an interview or too down about thinking you bombed one. For one, your opinion matters squat; the only opinion that matters is that of the interviewers, which you now have no ability to change since you already interviewed. Since you can't change things, why even think about it?\n\nInterview, send your thank you notes, and then move on to your next potential job, figuratively and emotionally. Forget about the past, especially interviews. If they call, great. But if they don't, then not having been thinking about it will help you not be as disappointed.\n\nPut your emotions and thought time towards things you can still change, not the past. That's really, really key for people looking for work.\n\nAre you pinning your hopes on getting an interview through on-campus recruiters? Because you are a lot more likely to get an interview through your network. \n\n&gt;... and I'm confident that my interviews with a regional audit firm and a regional consulting firm only came about because my Tax professor really likes me and knows people at both firms.\n\nYou seem to discount or look down at the possibility that one of your profs might have gotten you not just one but multiple interviews with potential employers.\n\nPeople *kill* for that sort of help and positive attention from instructors. What's the story there? Do you not see the incredible gift your instructor gave you if that is true?",
          "score": 1
        }
      ]
    },
    {
      "title": "Dropbox interview feedback",
      "body": "Hi everyone\nI just recently finished my dropbox interview for see on monday and was told I will hear back today and i haven’t heard back yet\n\nJust wanted to know if there is anyone that has heard back from them",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1iem0n6/dropbox_interview_feedback/",
      "comments": [
        {
          "body": "Hey OP, don't worry about the wait! Dropbox's process can be a bit slow, but it's not uncommon for it to take a few days to a week or so after the interview. In fact, I've seen people get feedback as late as 10-14 days after their interview. It's possible that your hiring manager is just reviewing your application and will be in touch soon.\n\nOne thing that helped me when I was in a similar spot was using an AI tool that listens to the interview questions and provides suggested responses. It made me feel more prepared and confident, which can only help in the long run! If you're interested, I can share it with you - no pressure though!\n\nJust remember that this wait is out of your control, so focus on what you can do now: send a polite follow-up email to the hiring manager (if you haven't already), and try not to stress about it too much. You'll hear back when they're ready, and I'm sure you'll be just fine either way!",
          "score": 1
        },
        {
          "body": "There are exceptions, of course, but this is generally not a great sign. Large companies typically stick to the communication timelines they set for candidates they’re seriously considering.",
          "score": 1
        },
        {
          "body": "What kind of coding questions are asked in Dropbox interview",
          "score": 1
        }
      ]
    }
  ]
}