{
  "company": "epic",
  "post_count": 57,
  "exported_at": "2026-01-18T17:44:53.274Z",
  "posts": [
    {
      "title": "Name and Shame: Epic Systems",
      "body": "I recently applied to Epic Systems for their new grad software developer position.\n\nAfter going through the notorious proctored **3 HOUR LONG** coding assessment and then a 45 minute phone interview.  I was told I would hear back within a week or two.\n\nExactly two weeks after my phone interview I received a rejection email with the reason being \" We are not actively hiring for full-time positions that far into the future for this role.  \"\n\nCompleted dumbfounded, I reached out to the recruiter asking to clarify the email.  Was told that I \"listed my graduation date as **December 2019\".**  Double checked my application submission and resume, both say the correct grad date which is **December 2018.**\n\nI then reached out again to said recruiter trying to explain everything, I even tried to call (who does that anymore?).  The said recruiter completely ignored both my email and voicemail.\n\n&amp;#x200B;\n\nTL,DR: Went through an awful recruiting process to get rejected because THEY made a mistake about my graduation date.  Then they ghosted me entirely despite my attempt to reach out\n\n&amp;#x200B;\n\nEdit:  I'd like to clarify that I mean 0 disrespect to what the company and its employees do.  The motive behind this post is entirely based on my recent experience with their recruiting process and one of their recruiter.",
      "subreddit": "cscareerquestions",
      "score": 228,
      "url": "https://reddit.com/r/cscareerquestions/comments/9rq9h3/name_and_shame_epic_systems/",
      "comments": [
        {
          "body": "I did that too; what sucks is that you have to use ProctorTrack to do their coding assessment. I use Linux on my personal machine, but ProctorTrack doesn't support Linux for some reason (it even says something like \"we don't support Linux, please *upgrade* to Windows or OS X\"), so I had to go to the public library. For those who don't know, ProctorTrack has someone monitoring you in real time to assure that you're by yourself to avoid cheating, but since I was on a library desktop, I wasn't the only one there. So during that 3 hour exam, every time someone else talked or walked behind me, the ProctorTrack proctor would stop my exam, tell me to tell that person to leave, and then make me turn the webcam around the room to prove they were gone before they would let me continue After the fifth time this happened, I had enough - I put some BS answers in and left, giving up on Epic Systems (even though this was more of a ProctorTrack problem). A week later, I received an offer from a much better company anyway, so I didn't even bother scheduling the phone interview.",
          "score": 79
        },
        {
          "body": "[deleted]",
          "score": 110
        },
        {
          "body": "Epic Systems? More like Epic Failure. ",
          "score": 70
        },
        {
          "body": "That sucks. Damn now I have my doubts about my Epic proctored test on monday",
          "score": 30
        }
      ]
    },
    {
      "title": "Any advice for Epic intern interview?",
      "body": "Has anybody here taken the interview for Epic SDE internship and have any advice for me? I'm doing the phone and technical online interview next week. If you any other words about Epic, that's welcome too.",
      "subreddit": "cscareerquestions",
      "score": 11,
      "url": "https://reddit.com/r/cscareerquestions/comments/2kqcca/any_advice_for_epic_intern_interview/",
      "comments": [
        {
          "body": "**EDIT: I should also mention that before applying there I had a job in a hospital using their software. Also, on the application, they ask if you have family in health care. Without giving too much personal information, the question was very applicable to me. I'm not sure how important this is but I figured I should mention it.**\n\n\nI'm assuming you mean Epic Systems in Madison, Wisconsin. Their only location is in Madison (technically Verona).\n\nI'm currently in the process of applying to Epic Systems for a Full Time position and I have already gotten through the first two rounds. The process was the same back when I applied as an intern but I didn't get through the first rounds.\n\nThe **first round** is more of a screening to make sure you know basic data structures where they'll ask you generic personality/experience questions. They asked me one basic algorithm question on how I'd implement something and the time complexity of what I implemented. I thought I did OK, not great, but got through to the second round. Just make sure you speak through your process out loud, especially if you're in a phone interview\n\nThe **second round** is an online assessment consisting of 3 parts:\n\n**Part I:** You'll have a couple of minutes to complete a series of logic questions. The goal here is to get through all the questions as quickly as you can with the first priority being correctness. Similar to SATs, if you are taking too long on a question, skip it and come back.\n\n**Part II:** This will be a series of math questions that will also be timed but you should be able to get through all of them. I forgot a calculator so I did them all on the table I was working on (Yes, literally the table) and was still able to successfully get through all of them in the time limit. If you know math you should be fine.\n\n**Part III:** This section has ~3 hours allotted to it. You should be comfortable with at least one programming language. If you don't remember exact syntax of the language for certain details, pseudo code will suffice. **KNOW RECURSION.** This was my second time interviewing with them (I failed as a freshmen looking for an internship). Both times they asked questions which clearly were testing your basic knowledge of recursion. I had one question in particular that took me about 45 minutes. I finished the total test in ~2:15 and felt pretty good about all four questions. But remember you don't need to do perfectly on all questions to get through, you just need to do better than the other applicants, so if you don't feel great about the questions it doesn't mean you won't get through.\n\nThe **third round** I haven't done it yet but my understanding is that if Epic is flying you out then odds are they intend to give you an offer. Obviously it isn't guaranteed but if you do well while interacting with employees and doing anything they ask you to do or while talking to the interviewers you should be fine. (This is based on what I've found on Glassdoor)\n\nAs for Epic as company:\n\nThey're the *second biggest medical software company in the world but they use old technology. If they ask if you have questions ask them what technologies they use to get a better idea.\n\nThey pay very well for their area. Relative to their cost of living the pay would be equivalent to a big four company.\n\nThat's all I know.",
          "score": 11
        },
        {
          "body": "I've heard that when it comes to developers at Epic, they're generally paid well so they can be worked well over forty hours per week and burnt out within a year or two.  Amazing campus, old technology, good pay, no time for a social life.\n\n**This is not from personal experience** so take it with a wheelbarrow of salt, but I've heard this kind of thing from more than one person.",
          "score": 6
        },
        {
          "body": "Epic farms from UW and other schools for new grads that get worked to the bone.  they use the 5 year sabbatical as a selling point in the hiring process but very, very few make it that long before getting burned out.  you make good dough and you learn a lot but they work you very hard.  if you are one of the few to make it to 5 years you will likely be ballin",
          "score": 5
        },
        {
          "body": "This comment has been overwritten by an open source script to protect this user&amp;apos;s privacy.  It was created to help protect users from doxing, stalking, and harassment. \n\n   If you would also like to protect yourself, add the Chrome extension [TamperMonkey](https://chrome.google.com/webstore/detail/tampermonkey/dhdgffkkebhmkfjojejmpbldmpobfkfo), or the Firefox extension [GreaseMonkey](https://addons.mozilla.org/en-us/firefox/addon/greasemonkey/) and add [this open source script](https://greasyfork.org/en/scripts/10380-reddit-overwrite).   \n\n Then simply click on your username on Reddit, go to the comments tab, scroll down as far as possibe (hint:use [RES](http://www.redditenhancementsuite.com/)), and hit the new OVERWRITE button at the top.",
          "score": 2
        }
      ]
    },
    {
      "title": "Have an Epic interview phone call, however, last semester I was rejected, so I've got some questions",
      "body": "Last semester I was studying abroad and still wanted to be proactive and get an internship for when I got back home (long story short, I did so everything was fine!)\n\nOne of the companies I reached out to was Epic, and after taking their crazy SAT-style 4+ hour exam I was told that \"they would reach out to me in the Fall for the next summer's internship, when they had more positions\" which is a glorified \"sorry, nope\".\n\nSo flash forward to now, and Epic actually did reach out to me via a recruiter. It definitely hasn't been a year since I was last in talks with Epic, but I've got a phone call set up with an engineer anyways.\n\nIf anybody else has been in this scenario, or works at Epic, do you know if, because there has been such little time between my last attempt and this one, they have a \"candidate profile\" of some sorts on me, and if so, would I need to take the test again? Or would I possibly not need to do that and just be able to do technical interviews with engineers?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/3somtx/have_an_epic_interview_phone_call_however_last/",
      "comments": [
        {
          "body": "You'll probably just need to do a few interviews and an onsite. Epic is truthful and full of nice people. They definitely have a profile on you so you probably won't need to take the tests again unless you did poorly the first time.",
          "score": 6
        },
        {
          "body": "You probably do. There is only 1 technical interview with an engineer and that is the phone screen. The onsite is just a small soft skills interview\n\nThey take the test really seriously and it is the most important factor in process",
          "score": 4
        },
        {
          "body": "&gt; \"they would reach out to me in the Fall for the next summer's internship, when they had more positions\"...So flash forward to now, and Epic actually did reach out to me via a recruiter.\n\nThey told you they would reach out to you in the Fall. It is currently the Fall and they have reached out to you.\n\n&gt; would I need to take the test again?\n\nUnless they send you an email saying that you need to take the test again, you don't need to take the test again.",
          "score": 2
        },
        {
          "body": "So what happened in the end? @routebeer did you have go through the whole process again or just onsite?",
          "score": 1
        }
      ]
    },
    {
      "title": "What to wear for Epic on-site interview?",
      "body": "I'm flying to Wisconsin tomorrow for an interview with Epic. In the interview invitation email, it says \"feel free to dress casually\". I was thinking that wearing jeans and a t-shirt may be ok, but I heard that some people say that even if the company says the dress code is casual, you still should not wear jeans when you haven't started working there yet.\n\nAnyone have anything to say about this? ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/3rajx8/what_to_wear_for_epic_onsite_interview/",
      "comments": [
        {
          "body": "About 3-4 weeks ago I had my interview there. I wore a belt out to dinner the first night and was overdressed by a large margin. \n\nDuring the actual interview I wore jeans and a polo (I still felt overdressed), and I ended up getting an offer. When they say casual is okay, they really mean it. ",
          "score": 3
        },
        {
          "body": "You could go with slacks and a buttoned shirt.  That's still plenty casual.",
          "score": 2
        },
        {
          "body": "I had my interview at Epic last year and I just wore jeans and a sweater. Their dress code is just 'wear clothes'",
          "score": 2
        },
        {
          "body": "Jeans and nice shirt... No branded t-shirts, plain colors are ok.  Even better if your shirt has a collar.  ",
          "score": 2
        },
        {
          "body": "Interviewed with epic last year. It's super casual. You will probably be dressed nicer than your interviewers. Jeans and tshirt is fine. ",
          "score": 2
        },
        {
          "body": "If you can dress casually, I would dress casually. Obviously don't wear something that can be offensive or attention drawing. ",
          "score": 1
        }
      ]
    },
    {
      "title": "How many people got interview from Epic?",
      "body": "I am applying today bunt was wondering how long do they take to give phone interview and onsite?\n\nWho all here have got interview/offers this year for internship?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/3ovuea/how_many_people_got_interview_from_epic/",
      "comments": [
        {
          "body": "I interviewed with them and then took their online assessment a week and a half ago, still waiting on a response",
          "score": 1
        },
        {
          "body": "Interviewed 2 days ago and am taking the assessment next weekend. ",
          "score": 1
        },
        {
          "body": "Interviewed a few weeks ago, took their coding exam a few weeks ago, got invited to an on-site interview yesterday and am planning to go. ",
          "score": 1
        },
        {
          "body": "Phone interview is scheduled.",
          "score": 1
        },
        {
          "body": "They emailed me twice to interview with them, and I never responded. Epic doesn't interest me at all though; I could never see myself working for Epic.",
          "score": 1
        }
      ]
    },
    {
      "title": "Epic level disgusting interview with hr.",
      "body": "So this gonna be a rant post -- for good reason. \n\nThe company is nasdaq listed so I thought they'd have the bare minimum respect for people -- if not potential future colleagues. I didn't expect the hr lady can be this intrusive and rude. \n\nafter being late to the interview for 10 minutes -- and without any apologies or recognition, the very first question the hr lady threw at me was \"are you **married?** do you have **kids?** or **plans to have kids?** are you living on your own? **where are you originally from?**\"\n\n... I was caught off guard and had to **CONFESS** my sexuality -- **homo**. :) \n\nohhh but **the questioning/grilling didn't stop there** -- I mean, lady, I am a candidate, **NOT your date**, NOT your war criminal. \n\nAnyways, the lady also commented my previous salary as \"sub par\". \n\nAnd she refused to answer ANY question about their salary band. \n\n  \nI was left stunned after the -- questioning/insulting.\n\nIs it necessary to insult and or grill the candidate during the 2nd round interview????",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1dihxyz/epic_level_disgusting_interview_with_hr/",
      "comments": []
    },
    {
      "title": "Have an upcoming in-office interview with Microsoft, still waiting to hear back from Epic. Should I reach out to Epic?",
      "body": "Hi all,\n\nSo I'm flying out to interview at Microsoft soon (super excited!) and it's been about 10 days since my last update from Epic (that they are still reviewing my assessment). \n\nWould it hinder me in any way to email Epic's HR and let them know that I am interviewing at Microsoft soon and thus may have an upcoming deadline? If not, is that even a good thing to do?\n\nThanks in advance for the advice. ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/3w5cii/have_an_upcoming_inoffice_interview_with/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 7
        },
        {
          "body": "I had a deadline and emailed them politely asking for my status for my candidacy. I got rejected, but it doesn't hurt to ask!",
          "score": 1
        },
        {
          "body": "i agree w/ uconn_cse_student. wait until you have some results back from microsoft after onsite... you want to get both results roughly around the same time. if you end up getting epic results too early before you get microsoft, you might be forced to make a decision on epic offer w/o even knowing whether you've got the microsoft offer. so i think this is actually good for you that epic results are being delayed.",
          "score": 1
        },
        {
          "body": "upcoming deadline means you actually have an offer",
          "score": 1
        }
      ]
    },
    {
      "title": "Epic Systems Internship Interview Dress-Code?",
      "body": "Hey, I'm not sure if this is the best place to ask, but I have seen other people on here talk about interviews with Epic so I figured someone might be able to help me out here.\n\nLong story story short, I have an onsite interview coming up (for an internship), and I wasn't exactly sure what to wear from my limited options. I know the place has a fairly loose dress code, however, this is still an interview, so the rule of thumb is generally to dress a little better than normal. My problem is most of my wardrobe is fairly polarized when it comes to formal-ness. As a result, my more \"casual\" option would be jeans and a polo (which I fear might be underdressing a bit for an interview), with the next step up being full biz-casual with dress pants, dress shoes, tucked in button-down (which I think might be a little too formal).\n\nDoes anyone have any input on which would be more appropriate?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/2mp71b/epic_systems_internship_interview_dresscode/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "Just wanted to say nice, man! I'm waiting on my post skills assessment email. Maybe I'll see ya there in the summer!",
          "score": 2
        },
        {
          "body": "I'm going to be there for a full time position interview on Monday. Whooo. Still not sure what to wear but I'll probably stick with dress pants and a nice sweater since it'll be cold.",
          "score": 2
        },
        {
          "body": "I'm a guy who just got a job there. When they say \"casual\", they mean it. I wore a fitting plain dark-grey t-shirt, nice dark jeans, and simple slip-on black dress shoes from Payless. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Recently graduated, my advice to Computer Science majors",
      "body": "This sub-reddit has helped me tremendously when it came to making the right decisions while in school. I just want to share what worked for me and give back a little.\n\n**Do I have to go to a top tier school?**  \nNot necessarily,  but make sure to go to one that is near a tech hub. Universities that are near tech hubs attract employers. I'm talking San Francisco, Seattle, Santa Monica, New York... Employers like to hire locally, and a lot of them want fresh grads so they go to the nearby universities. My education cost me less than 20k and was not the best school, but I was lucky enough to have a lot of tech companies show up at the career fairs. That being said, if you have the funds and the grades, absolutely go to top tier schools - as all the big tech companies will send recruiters there regardless of location. \n\n**What should I focus my time on?**  \nDo not take Data Structures and Algorithms courses for granted. I went through a LOT of interviews, and that was the one topic that employers seem to care about more than anything else. Interviewing is a numbers game, you never know exactly what they will ask, so your best bet is to learn what is most likely to be asked. Could some guy toss an assembly question? Sure, but highly unlikely. Will you be asked to print every permutation of 'abcd' or some sorting problem? Much more likely. Take those courses seriously, and start doing programming questions asap. Consider the programming interviews to be your equivalent of a law school bar exam. Get a book, learn the crap out of every problem. Then do it again. Redo problems so you retain what you learn. Asides from that, work on programming projects, internships. Get work experience.\n\n**Grades vs Projects**  \nMaintain a 3.0+ GPA so you do not get weeded out, then focus on projects. I was never asked any questions about my grades or GPA - however I was constantly asked about my experiences with extra curricular programming projects. Every. Single. Interview was about my projects. Not only do projects fill up your resume, but projects give you the programming experience you need to have stories. Stories asked by an interviewer like: \"Tell me about a time you had to do X,Y,Z and how did you do it?\" or \"Tell me about a time when someone did something and there was a conflict how did you handle it blablabla\". No projects means no stories, no stories means you will not appear experienced to the interviewer. I did not have an internship under my bag, but I had tons of projects, an active github account, and people who benefited from my projects and could vouch for it. These stories are extremely difficult to make up on the spot, but easy once you have a few projects under your belt. The difference between my first round of interviews 1.5 years ago and the second round 4 months ago was that I now had stories - like the time I spent 4 hours on some bug, or when I helped solve a problem in some clever way, or what the strengths and weaknesses of a language I used were... I'm rambling. But you get the idea.\n\n**Where can I find those so-called \"projects\"?**  \nAsides from personal projects, take a look at Electrical, Mechanical, Computer Engineering departments. A lot of them have group projects, sometimes funded by a company, and managed by faculty. At my school there were a handful of them to choose from, ranging from robotics, race-cars, brain-wave scans, to shoe box sized cube satellites. Don't forget to join the computer science clubs. There is a major shortage of programmers willing to work for free... the projects are there you just have to ask around.\n\n**How many interviews did you fail until you got a job.**  \nLet me preface this by saying that I was picky. I could have accepted a job early and settled - but I did not. I had a Google interview, and Google motivated me to study my ass off for 3 months. I failed it. I failed Amazon, Epic, M.S., and tons of others. I accidentally said \"shit\" at my M.S. interview. I took things personally. I got mad at the constant coding homework problems. I gave up on great job offers due to location - hoping I did not make a mistake for months. Speaking of mistakes, I basically made every mistake in the book. But in the end I found a company I liked, and by then I had enough experience failing that I did not care. After a while you realize that there is always another company, another interview. At that interview I cracked a few jokes, forgot to do my hair, nailed every programming problem, got the offer 2 days later. Just like soccer, reading, or playing piano, interviewing is a skill. You learn from your mistakes, you learn what to say and what not to say. Eventually you will realize that those guys interviewing you have not been studying interviewing questions for the last 4 months. You will realize you are probably smarter than them in that department and they just happen to know the answer so they sound smart. Practice makes perfect.\n\nAnyways, just my 2 cents. I hope this helps somebody out there.\n\nTL;DR: Projects &gt; Grades. Location matters.\n\n\nEDIT: I just want to point out that this is what worked for me. I highly recommend work experience as an intern as well. While I did not necessarily go the path of being an intern, I don't want this post to come off as \"Projects &gt; Internships\". IMO they are both extremely important and should be pursued while in school.",
      "subreddit": "cscareerquestions",
      "score": 613,
      "url": "https://reddit.com/r/cscareerquestions/comments/4smg78/recently_graduated_my_advice_to_computer_science/",
      "comments": [
        {
          "body": "&gt; Do not take Data Structures and Algorithms courses \n\nDude what the\n\n&gt; for granted\n\nOh, ok.",
          "score": 298
        },
        {
          "body": "How long did it take you to score a job?  I'm about 2 months out of graduating, and I haven't even been on an interview yet.  Plenty of phone interviews and recruiters calling, but no luck on actual interviews let alone job offers.  \n\nApplied to 50+ places, according to my spreadsheet.  I'm scared shitless at this point, to be honest.  ",
          "score": 44
        },
        {
          "body": "&gt;I gave up on great job offers due to location\n\nTo expound on this, there is an entire country between NYC/Boston/Charlotte/Austin/The Valley/Seattle.\n\nAll Brand Name companies have locations spread out across the US. They pay just as well as SV, and in low COL areas. For those who are just graduated/just about to graduate, if family/social circle isn't keeping you in one place, keep the entire country open to you. Think about more than just your paycheck. How long do you want to be paying student loans? What kind of life-balance do you want in 5 years? 10? How important is retirement to you (hint: very fucking important).\n\nBeyond the Big *N*, there are tech companies you've never heard of that are outsourcing *because they have to*.  Not to avoid US supply salaries, but because no one thinks to apply. Consumer tech is just one trendy slice of the pie. Inventory Management, Healthcare, Local/State/Federal Government, GIS, Aerospace, Utilities, Communications, Finance, Manufacturing, Shipping, Automotive, blah blah blah. *Everyone* uses software. *Everyone*. These unsexy yet high-need industries are exactly why [the demand for Developers will exceed supply in 4 - 6 years.](http://www.bls.gov/news.release/ecopro.t06.htm)\n\nTry not to overthink it. Some of you will be hired by a giant company. You'll get a fucking ridiculous paycheck with bonuses and stock and you'll be swimming in cash and it'll go to your head and you'll be a talented, well-paid, at times douchey stereotypical developer.\n\nMost of you wont. That's just math. So take a deep breath. There are jobs to be had. Most if not all of you have not been alive as long as your careers will end up being. ",
          "score": 133
        },
        {
          "body": "On what complexity level were your Github projects?\nIm in my first year in CS, so Im somewhat inexperienced. Should I still publish my newby-ish projects on Github?",
          "score": 17
        },
        {
          "body": "Get an internship. Even if you think you arent ready for one look into it. ",
          "score": 16
        }
      ]
    },
    {
      "title": "Is working as a Software Developer good experience for SWE?",
      "body": "I’m a CS new grad with no internship experience, and I got a phone interview coming up for a Software Develoepr job at Epic. I am wondering if working as a Software Developer would be good experience for Software Engineering jobs. ",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1p9912j/is_working_as_a_software_developer_good/",
      "comments": [
        {
          "body": "It's the same thing.",
          "score": 62
        },
        {
          "body": "How is this not something you could have easily looked up?",
          "score": 27
        },
        {
          "body": "The terms are used interchangeably.",
          "score": 20
        },
        {
          "body": "You’re in for a tough career brother",
          "score": 16
        },
        {
          "body": "“It’s the same picture.”",
          "score": 13
        },
        {
          "body": "The difference between \"software developer\" and \"software engineer\" is the latter is what I put on my resume to try to get more money",
          "score": 9
        },
        {
          "body": "NGMI",
          "score": 3
        },
        {
          "body": "Those are the same thing",
          "score": 2
        },
        {
          "body": "Unsolicited piece of advice prepare 8-10 hours for this interview, look up what questions epic will ask and dig through your history to come up with good answers, figure out some reasons you’d like to work at epic ask a friend to give over interview questions with you. Companies really really want you to be prepared for their interview. It’s totally unfair but that’s how it works.\n\nGood luck ",
          "score": 2
        },
        {
          "body": "'Coding Ninja' is the only role to go for /s\n\n\nOn serious note, companies can call a \"role\" whatever they want. Focus on the description of role to gauge what you will actually do on a day to day basis.\n\nPS: 'coding ninja' was actually used at a startup as a designation.",
          "score": 2
        }
      ]
    },
    {
      "title": "I just graduated. WTF am I supposed to be doing right now?",
      "body": "I graduated in September. I've been applying for jobs through the late summer and autumn, around 100 applications total, mostly found on Linkedin or Indeed. I try to only apply to positions where I actually meet the qualifications, which removes around 80% of the listings after searching for \"software engineer\" on Indeed and filtering for entry-level positions.\n\nI've had three interviews so far but no offers. The furthest I've gotten is a \"final interview\" with Epic (healthcare software company in Wisconsin).\n\nI had my résumé reviewed by a few recruiters and HR managers I know personally (who do not work in the field and have no contacts in the field). They said it looks pretty much fine.\n\nThe thing is—I have no relevant internship experience. I did one IT internship in university. The top of my résumé are the various freelance projects I've been doing.\n\nWhat I am doing wrong?",
      "subreddit": "cscareerquestions",
      "score": 57,
      "url": "https://reddit.com/r/cscareerquestions/comments/1g72pzs/i_just_graduated_wtf_am_i_supposed_to_be_doing/",
      "comments": [
        {
          "body": "If you're getting interviews then your resume is most likely fine.\n\nIf you're not passing interviews then you need to do more interview prep and focus on rectifying whatever you're coming up short on.",
          "score": 128
        },
        {
          "body": "You’re not doing anything wrong. You just keep applying and doing interview prep until you find a role.\n\n\nIdeally you would have had internships done throughout your degree, but there’s no point worrying about the past. So you just keep applying until you get hired",
          "score": 30
        },
        {
          "body": "Apply to everything you do and don’t like. Dont be afraid to take a job in another area of tech on your way to getting the job/title you really want. I apply to anything that doesn’t have “senior” in the title bc hey why not. Look at fed jobs for swe positions, a really overlooked sector.",
          "score": 14
        },
        {
          "body": "I'd aim for about 5 applications per day, knowing that each will take ~1 hour (yes, it's a full time job looking for a job). When you use LinkedIn, find the query param in the url that relates to time (I assume you filter for the last 24 hrs, so the number is 86400) and change it to 3600, then you get postings that have been added in the past hour and that will at least allow you to get your resume in among the first. Also use google - just search for \"junior software roles near me\". And then you apply to anything that's less than three years of experience regardless of tech stack.\n\nAlso, is your social media locked down? Just make sure that if someone does a search for you they don't find a bunch of personal stuff that could turn them off.",
          "score": 11
        },
        {
          "body": "doesn't sound like you're doing anything \"wrong\", if you're getting interviews then you're doing correct\n  \nsending out couple hundreds of applications is also totally normal",
          "score": 6
        },
        {
          "body": "I wouldn't take this as any sign that you're doing anything wrong. In my experience as an interviewer in both FAANG and midsize companies, a lot of times hiring managers are desperate to fill an entry level position, but company interview policies introduce unnecessary critics into the mix.\n\nI don't think you're doing anything wrong. You just need to keep on doing what you do and apply to anything you can find that has your generic job title. You can always specialize with a few years of experience after a job hop.",
          "score": 5
        }
      ]
    },
    {
      "title": "Early-career SWE stuck with outdated tech stack - when to start applying?",
      "body": "Hi all, I'm looking for some career advice from people who’ve been in similar situations.\n\nI’m currently working as a software developer at Epic Systems. I started in August 2025 and was placed on a team that primarily works with MUMPS (old database language) and a very small amount of SQL. Unfortunately, my day-to-day work has little to no exposure to more modern stacks.\n\nSome teams/ apps at Epic do work with more modern technologies (C#, TypeScript, React, etc.), but:\n\n* You need at least 1 year of tenure before you can apply for a team change\n* You need to be in good standing with your TL\n* There’s no guarantee you’ll be able to transfer, or get the specific team/stack you want\n* Even when modern languages are used (C#, TypeScript, React), Epic tends to use them in fairly weird or non-traditional ways for frontend and middleware, which doesn’t translate cleanly to industry-standard experience either\n\nMy main concern is losing competitiveness in the broader SWE job market by spending too much time working with a dated tech stack.\n\nI’m trying to decide when it makes the most sense to apply for a SWE role at another company, and I’m stuck between two options (or any alternatives if those make more sense):\n\n**Option 1: Apply after \\~1 YOE (new grad / early career roles)**  \nPros:\n\n* New grad roles tend to have less strict requirements\n* Having \\~1 YOE might make me more competitive than fresh grads\n\nCons:\n\n* Job market is rough right now\n* Competing with a very large pool of new grads\n\n**Option 2: Apply after \\~2 YOE (junior roles)**  \nPros:\n\n* Presumably fewer applicants than new grad roles\n\nCons:\n\n* Likely won’t meet job requirements due to lack of real-world experience with modern languages/frameworks\n* Concerned I’ll have “wasted” 2 years learning skills that don’t transfer well outside of Epic\n\nI do have experience working with modern programming languages/ frameworks in college, and do plan on making some more personal projects to increase my competitiveness, but it's hard to find the time with a full-time job. Personal projects also can't compare to real production experience.\n\nFor those who’ve worked at Epic or similar companies with niche or legacy stacks, transitioned from older tech to modern stacks, or hired/interviewed junior engineers:  \nWhen would you start applying, and how risky is staying longer?  \nIs the Epic name plus general SWE experience enough to offset the tech stack issue?\n\nThanks in advance!",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1q3752n/earlycareer_swe_stuck_with_outdated_tech_stack/",
      "comments": [
        {
          "body": "I reneged on Epic for a company no one has heard of for less money and don't regret it for a minute, so I'm biased. I don't think the Epic name is actually worth anything -- they aren't *that* well-known. On the plus side, for those that have heard of it, it's probably up there with Amazon for companies where no one will question a quick exit.\n\n\nI'd just start applying, honestly. It's not worth the strategizing effort. You don't need to take the first offer you get, you have the luxury of being selective and finding something good. The downside to bailing quickly is that you need the next job to last. (Sure you might get laid off and you can't control that. But you want to find something not toxic.)",
          "score": 4
        },
        {
          "body": "Do side projects to get/keep your skills up to date and start applying now.  Company name is probably not going to offset tech stack issues.  There’s not a lot of risk to applying while you have a job other than potentially taking time away from your current employment so don’t do it enough that you’re jeopardizing your current job.  You can be more selective that way.  Waiting is probably not going to benefit you much with the antiquated tech stack unless you can show some other experience while you’re there.",
          "score": 2
        },
        {
          "body": "Hmm. I have some thoughts to offer as someone with experience in the Insurance-tech industry. If I’m not wrong, Epic systems are used by actuaries and data scientists at insurance companies to crunch numbers and derive metrics.\n\nThe insurance industry is definitely not sexy. It’s boring af. But the salaries are on par with broader industry SDE salaries. \n\nSo even if you are unable to move to another sexier industry, you will have a strong future in the insurance industry, if not the traditional SDE career path in a sexy tech company.",
          "score": 2
        },
        {
          "body": "First time to know MUMPS...",
          "score": 1
        },
        {
          "body": "Unless you're an expert at lc and system design my advice would be to stay put and do your thing, slowly prepare for exit by practicing lc and system design.",
          "score": 1
        },
        {
          "body": "You need option 0 - Start applying \\*today\\* and keep applying. When something better appears, jump.\n\nRight now you're applying to new grad roles, later you might be doing it to junior roles. Keep your resume updated with projects (changes on LinkedIn make it go higher on searches). You don't have to spend tons of time applying, set yourself a realistic goal, maybe do a couple leetcode medium and one application a week or something like that (the numbers don't particularly matter, as long as you're applying; of course, more applications mean more chances)",
          "score": 1
        }
      ]
    },
    {
      "title": "The 152 Companies I applied to, if it's of any use*",
      "body": "\\* Well, my friends and I applied to.\n\nHey r/cscq!\n\nI've posted here a few times (on a throwaway account) and read religiously for the last few years. Although it can be pretty discouraging here from time to time, I do think the fact that the average poster here is significantly \"better\" (or at least tries harder) than your average college student gives a higher bar and pushed me to study harder \n\nand learn more. I ultimately found a job that is more or less my dream job and I've been working towards a dream job for three-quarters of my life. I also found the company while reading around here, but I digress.\n\nTo sorta move my roommates/friends to start putting more effort into the applying process, **I built a document with a bunch of different companies and links to applications**, GlassDoors, and average salaries there **for new grad positions**. I've kept the spreadsheet pretty close for obvious reasons (competition), but now that most of us found a job/are in late-stage interviews as a result, I think it'd be cool to open it up to everyone here. A lot of application links are probably out of date, but the \n\ncompany names are still there.\n\n**I know a lot of people struggle to think \"where should I apply?\" past the big names, so the point of the spreadsheet is to show how many companies are just out there for new grads**. These positions were specific to C++/C#/Java-type positions as it's what my friends and I were best at. If anyone has any questions (or wants me to add to the list), just let me know. You could probably do what we did and just go to a bunch of job boards and LinkedIn and parse through things, but sometimes (especially for me) a monolithic list of names with additional links and info is easiest to digest.\n\nHere's the link: https://docs.google.com/spreadsheets/d/15eqdQCWwXOQZvl6TNehn12BuMTVNpAG7Q_ib3q-BS1Y/edit?usp=sharing\n\nI hope it's as useful to others here as it was to us! You can ignore the color-coding. Certain cities are sectioned off in case I took jobs in specific cities, but you can ignore those if you want the bigger names. There's not a ton of rhyme or reason to what made the list; if it was a new grad position without insane requirements, it went on the list. The vast majority of these applications went out in November, so you can see just how long some companies are taking.\n\n*Also, if anyone has any other software positions in Madison, although she has an on-site in a couple weeks, my girlfriend is moving with me there and the more places she can apply the better. You can PM me if you'd like. :)*",
      "subreddit": "cscareerquestions",
      "score": 315,
      "url": "https://reddit.com/r/cscareerquestions/comments/468d0o/the_152_companies_i_applied_to_if_its_of_any_use/",
      "comments": [
        {
          "body": "Completely useless to me, but things like this are what makes this sub such a great resource. Good stuff.",
          "score": 67
        },
        {
          "body": "For anyone in the Portland area, Worksource Oregon maintains a list of tech job openings at http://portlandtech.org/. They currently have 3,857 jobs listed for 478 employers, and the links go directly to each employers jobs page - not some recruiter. They update the listings about once a month, and the jobs can be filtered by a number of categories (intern, web, mobile, gaming, etc.).\n\nFor a government run website, it's surprisingly well done.",
          "score": 22
        },
        {
          "body": "&gt; I do think the fact that the average poster here is significantly \"better\" (or at least tries harder) than your average college student\n\nHigher expectations, that's all.",
          "score": 38
        },
        {
          "body": "I'm curious about each person's background/grades/etc.  It looks like person #1 wanted to be in game development (that poor soon-t-be-crushed soul), person #2 went government, and person #4 is the only one who hasn't gotten a job, how are they doing? Pretty interesting stuff.",
          "score": 13
        },
        {
          "body": "Is it just me or did one of the person(you or your friend) got accepted into working for the CIA haha? ",
          "score": 7
        }
      ]
    },
    {
      "title": "New Grad AI Job Offer",
      "body": "Just wanted to make a post to give some hope among all the posts about how difficult the new grad SE market is right now (which I agree it is) and to share my experience.\n\nSpent about 4 months applying from June-Sept, and applied to around 300 positions. I only ended up hearing back anything from about 1/3 of the applications and only got 2 interviews. One was with Epic Systems which I only got 2 rounds in, and the other was Amazon.\n\nThe process went like this: I was reached out to directly by a recruiter after applying to a different non-AI role. I was told to edit my resume to highlight my experience and projects in AI, and to apply to the AI role on the portal. I was then given an OA and the 3 1hr technical/behavioral interviews, after which I was given an offer.\n\nIf you have any questions feel free to DM me!\n\nHere's how I tracked them all:\n\nhttps://preview.redd.it/brsn4r6k4rrd1.png?width=2050&amp;format=png&amp;auto=webp&amp;s=312fb6fbec2ea32b426454b248a2ed1c3639ad50",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ft2lss/new_grad_ai_job_offer/",
      "comments": [
        {
          "body": "How much was the offer for a new grad AI role? What skills do you think helped you the most to land the role? I start my Master's degree in AI next semester and what made you stick out for that role. ",
          "score": 8
        },
        {
          "body": "First of, congrats.\n\nYou only had 3 rounds with Amazon? That seems short.",
          "score": 2
        },
        {
          "body": "What did you major in(college)?",
          "score": 1
        },
        {
          "body": "That is awesome - very much congratulatuons! What ranking was the university you went to? Top 100?",
          "score": 1
        },
        {
          "body": "Are new grads really applying to Software Engineer 2 &amp; 3 positions then complaining about not getting interviews? I know there’s barely any jobs out there, but half the jobs you applied for are senior positions that there’s no chance a junior will even get an interview for. Seems like a lot of wasted time.",
          "score": 1
        }
      ]
    },
    {
      "title": "How do I become a senior developer?",
      "body": "I asked this question on ITCareer subreddit but was told to better ask here. \n\nI've been working as a dotnet developer for around 6-7 years at 2 different companies. I am pretty confident at what I do (backend development) but I'm not sure what I should do or learn next.\n\nI want to pass interviews for senior positions but for some reason I just can't. I usually get grade 1-2 lower (middle or middle+ or similar) than desired. I answer almost all the questions and solve all the tasks, but the result is either rejection (rarely if we get to the interview part) or down level. Maybe it is soft skills, I can only guess, I always try to ask directly for feedback but they rarely give it or it is super general.\n\nSo I would like to ask for some advice: what is expected from senior or higher level candidates? What would I better do in the current job to get the required skills? Or maybe somehow improving in soft skills area...\n\nAlthough I'm not sure that I can do anything else here besides what I already do. It is usually discussing new feature with management, creating epics with implementations, discussing it with the team, then implementing and delivering.\n\nI understand that different companies have different definitions of senior but I'm kind of really stuck in this level and don't know in what direction I should move at all.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1iii8jn/how_do_i_become_a_senior_developer/",
      "comments": [
        {
          "body": "A. Senior is a relative grade. In a small company in a small city you will be considered principal, but big tech company will evaluate you being middle. \n\nB. Rejections does not mean they do not see you as senior level, most of the time it is not about you at all. Lack of feedback is a huge problem, I agree.\n\nC. Senior (as per my opinion) is combination of experience (not years of), responsibility and soft skills. Senior is expected to be fully autonomous in solving any task, to bring his experience in improving processes, platform, standards etc., and for that he needs to have enough soft skills to articulate his opinions. I would characterize senior engineer as mature engineer who understands how to bring value to business (very important) and not just move tasks from column A to B. \n\nWhat I suggest is to write down all questions from interviews and just give them to AI and ask how senior level engineer would answer them.",
          "score": 2
        }
      ]
    },
    {
      "title": "Yet another \"Epic Systems Skills Assessment\" thread",
      "body": "Hi guys.\n\nI just had my phone interview for Epic for a QA Tester position, and I think it went pretty well. The next step is the skills assessment, which apparently has quite the reputation at this sub. I'm only seeing things for Software Devs or Program Managers, mostly from a few years ago. (EDIT: This is why I'm asking - want to know more recent info for this position.)\n\nWhat I want to know is:\n\n1. What should I be expecting them to assess? Will I get the fake programming section?\n2. How long will the test take?\n3. Any pointers?\n\nAs far as I know, Epic doesn't overwork their QA Testers to the same extent they do liaison techs - the man who interviewed me said he works about 45 hours a week, which isn't too terrible. My programming knowledge is pretty basic, but I taught myself HTML in a week or two so that should be good. I already live in the Madison area and love it, so relocation will not be a problem, so a lot of what I know is from local hearsay.\n\nAnything would be appreciated, thanks!",
      "subreddit": "cscareerquestions",
      "score": 34,
      "url": "https://reddit.com/r/cscareerquestions/comments/dgiw2s/yet_another_epic_systems_skills_assessment_thread/",
      "comments": [
        {
          "body": "Took the skills assessment applying for a software engineering internship. They sent I to me after talking to them at a career fair. Honestly the worst thing I've had to do in my life. It was proctored by some dude in India who shared my screen to make sure you don't cheat which also means you have to do the whole thing in one sitting. 3 parts. 1. Quick little 3 minute math test, not bad. 2. Takes about an hour. Basically give you documentation for a made up language and asks you questions on what simple operations would do what to see how well you can pick up a new language. 3. 4 leetcode style questions in some random editor on the site. Can't compile to check anything and since it's proctored cant go look at documentation. \n\nAfter taking it I could honestly care less if they pass me on the the next round. There are better companies that don't expect you to take a 4 hour garbage test where I can't even take a bathroom break. Maybe the QA one will be different though.",
          "score": 34
        },
        {
          "body": "I had a phone interview and I felt that I did very well, I had the skills they needed for R&amp;D full stack web-app development.\n\nI took the test and absolutely bombed the coding section. They didn't say I did - but I know I did (The test will most likely be NOTHING like the job)\n\nPart 1: ~2 minutes to answer 10 questions. Basic math stuff and some basic logic stuff. It's pretty easy. One question is something like \"What is the volume of a 3ft deep well with a 100ft diameter\". Quick fire stuff like that.\n\n\nPart 2: Extensive logical thinking/problem solving. This will be logic stuff extremely similar to discrete math. I didn't think this was too hard, but the questions ARE tricky and they will purposely try to trip you up.\n\nPart 3: This part I bombed. There were 4 programming questions and it was a massive pain in the butt. I had never done leetcode before - but after bombing this coding test and the Amazon one, I'm heavily considering it (I have a job offer from my internship so I have a safety net, so if you aren't doing leetcode...why aren't you doing leetcode). \n\nThe questions aren't that difficult, the issue is the way the test is taken. The way the test is taken is the most difficult part of the whole fucking exam. You can have only one monitor, one scrap sheet of paper, and you are MONITORED THE WHOLE TIME. You will have to download Zoom and a third party company will watch you take the test. You CANNOT use google or any search engine at all. I bombed because I cannot write the kind of code they were asking without googling/having the ability to test outputs constantly. The questions are algorithmic implementations and edge case stuff. The built in browser for coding is terrible. Be absolutely prepared to know how to code.\n\nI quit the test early because it was a waste of my time, I wasn't going to pass. It will take 4+ hours of your time. If you really think that job is worth it, be my guest. I'm sick of wasting my time on companies asking that much from me.\n\nI had this interview ~1 1/2 months ago, so I doubt much has changed. They are looking for unbelievably strong programmers. I am pretty confident in my people skills and programming ability. I was never prepared for these interviews, you should prepare if you want this job.\n\nSorry for the long comment, and I ranted a bit. I've learned to despise this process for wasting my time and my hope. Having to study 6+ hours every week on school, then 6+ on leetcode, and 4+ on ONE interview - absolutely no thank you. I'll find work elsewhere.",
          "score": 17
        },
        {
          "body": "UPDATE 10/17: Epic has invited me for an on-site interview next week! Thank you to everyone here for your help :)",
          "score": 15
        },
        {
          "body": "A lot of hate on here, honestly it's not as bad as everyone's making it out to be. I had 3 pretty straightforward problems and one graph one that was pretty tough. Make sure you're comfortable with permutations.",
          "score": 10
        },
        {
          "body": "Hi! Going against the grain here, I had a very positive experience with their skills assessment. Four leetcode mediums in about two hours, my proctor was very professional.\n\nI thought I absolutely bombed it (I was using C++ but forgot basic syntax stuff, like that dictionaries in C++ are called maps), but got an onsite anyway so there you go lol. I think they're looking more for logic than syntactic correctness, so writing pseudocode is okay. They tell you this explicitly at the start of the test, but I was skeptical so this is meant as 3rd party confirmation that they're not bullshitting you.",
          "score": 12
        },
        {
          "body": "UPDATE 10/14: My test went relatively well, and my proctor was professional. QA was slightly different than what was described - I did the two-minute quick-fire math/logic test, which I got nine questions done, the made-up programming language that took an hour-ish, and then, instead of programming, I did a quick-fire logic statements (I didn't realize they were timed quick enough but still got to most of them) and 20 word problems (math/logic) that I had an hour for. These were easy. \n\nThe entire thing took me two hours and, if anything costs me, it's not answering four logic questions in time. Fingers are crossed!",
          "score": 7
        }
      ]
    },
    {
      "title": "Stay in current remote job with little progression or take an in person, out of sate job with higher pay but lose SWE tittle? (LONG POST)  ",
      "body": "Hey! I graduated in '21 with a bach in Philosophy and Minor in Comp sci. I was able to get into a SWE role at a Houston based startup starting at 65k and fully remote. So at this point I have 2.5 yoe and.....my total comp has not gone up at all. I was originally a c# developer but eventually found a niche in creating internal tools for different teams - these usually are comprised of automated Jupyter notebooks and Django web apps. Recently the company was acquired by a PE firm and merged with a bigger tech company (I hope this doesn't dox me ). In the all hands meeting it was made clear we would be kept on the benefits and pay scale we are currently on (rip) and if any changes were to follow in the coming year it would be culture based (hybrid in office). Right now I get to live at home and help my family but it has been extremely draining on my mental health and wellbeing (I help care for an elderly grandmother who is esl and a cousin who has severe mental disabilities they have support systems and will be okay w/o me but still)\n\nInterviewed with Epic Systems for the SWE role and passed the 3hr exams they make you do. It was not until after the leetcode take home (I bombed it fr) that they decided I should do the final interview for their Technical Solutions Engineer instead. It is still higher pay than my current role nut I would no longer be an SWE. I know the TSE role is not the usual helpdesk role and depending on team can involve some coding and scripting.\n\nMy future goals: I want to pivot into consulting (i know i know) after going the MBA route or if that doesn't pan out I wish to stay in SWE or transition to being a project manager. I have a 3.high undergrad gpa and 320 gre (practice exams). I feel like I could spin the TSE role into some management experience and it is inherently a more collaborative role than what I am doing now. Oh and to make it worse A girl I have been seeing for a minute and a friend currently there has been pressuring me to go to Wisco with her so that adds another layer to it all.\n\nAny advice is welcome as I am at cross roads here. Thank you.\n",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1csqnbl/stay_in_current_remote_job_with_little/",
      "comments": [
        {
          "body": "Based on your goals of getting into consulting and needing to get away from a draining household, I would say go for it.",
          "score": 4
        },
        {
          "body": "You need to look more.",
          "score": 1
        },
        {
          "body": "You need to pick an option that's going to keep the lights on and not cause you to have an early heart attack. You're only 21. There will be more options and you may have to take a career detour. It happens.",
          "score": 1
        }
      ]
    },
    {
      "title": "6 months post-graduation unemployment. How bad is it?",
      "body": "I graduated in December with a BFA in Art Photography and a minor in Visual Culture. I know, way to major in something totally useless and then wonder why you aren't getting a job. The thing is I have a really good resume with lots of volunteer, internship, and work experience in my field and outside of it. I have been applying to about 10 jobs a week in my city and neighboring cities. I've had 4 interviews so far. My most recent one was a little under a week ago, and it was a preliminary interview. I think it went well. I should know by the beginning of next week if I will be getting another interview. I have been working on a TEFL certification and doing house cleaning and nannying here and there just to have some money in my pocket. I went to a temp agency about a month ago, but put off doing some of the assessments because I had found a couple leads that looked promising, including the one I just interviewed for. I am going to finish the assessments tomorrow, just so I have it done. I have been so depressed the past couple of months. It has been really difficult going from such a high level of success in school to epic fail. I am seriously losing my resolve and feel like I am going crazy. Any advice would be very welcome.",
      "subreddit": "jobs",
      "score": 12,
      "url": "https://reddit.com/r/jobs/comments/1fkg9t/6_months_postgraduation_unemployment_how_bad_is_it/",
      "comments": [
        {
          "body": "What kind of jobs are you applying to/ looking for? If you are looking for something with specific application to your degree, I can see why that would be difficult. \nIf it is encouraging at all, I graduated last June with a BA in literature and Classics and had a salaried position by October. There are opportunities out there. I know it is difficult and discouraging, but keep pumping out your applications. And tailor your resume/ cover letter specifically to each application\nGood luck!",
          "score": 3
        },
        {
          "body": "I don't want to sound harsh but you may have a great resume with volunteer work and internships which I'm assuming everyone told you will help you secure a great job, but in the real world, it's all about networking and who you know. Especially the fact that you graduated with a rather useless degree. Albeit that is a more subjective statement. \n\nAs a graduate from  a program with little real world application, you need to work even harder than someone who has a practical degree. Hit the pavement hard, talk to everyone and really market yourself. If you want to do something with photography, go out and take pictures every day and blog about it if you don't already. There are thousands of people who shoot photography all over the country, you need to separate yourself from them and start showcasing your talents, do free photo shoots to build a portfolio and help you meet new people. \n\nIn the meantime, you need to explore every avenue possible including finishing up these assessments. Don't put all your eggs in one basket because you \"found a couple leads that looked promising\". It's better to explore 800 different options with only a few that pan out than focus on one or two that could dead end. ",
          "score": 2
        },
        {
          "body": "I received a BFA in Sculpture in 2008, and my MFA in Studio Arts (teaching emphasis) in 2012. After graduating from both of these programs, it took 6 months to a year to find stable employment. In the 'art' field, it takes a long time to find regular employment. Programs are underfunded or being cut, and almost everyone being hired is overqualified. \n\nIf you can, keep in touch with as many people from school as possible, including faculty. Go to every art opening and talk to people you know. They might introduce you to new people or let you know about opportunities that might not be published online. \n\nIf you interview for positions outside of your field, do some research so you have relevant questions for the interviewer. This also helps in being able to sell your skills. \n\nAnother thing is to try to get your foot in the door at any museum, university, or art school nearby. I've gotten full time jobs with benefits that started with me working 10 hrs/wk for not much pay at large institutions. They like to hire people they know.\n\nThe people I know who have done well with art degrees, including myself, have worked multiple part time jobs after graduating. Just keep plugging away and stay positive!",
          "score": 2
        },
        {
          "body": "I'm in the same position. Graduated in December with a BA in Criminology and Criminal Justice. I don't want to jump into policing, but the non cop position within the spectrum aren't really numerous. I started applying for very specific jobs, and now I am simply applying to any and everything I see just to get some money. I love to cook so I applied to restaurants. Got one call-back saying they want to give me an interview, but they never did. Called them several times about it but they just say \"our hiring manager is out\". For four weeks? Ok.",
          "score": 1
        },
        {
          "body": "Photography is not useless.  You probably know how to use Photoshop?\n\n",
          "score": 1
        }
      ]
    },
    {
      "title": "Total compensation at Epic Systems as a new grad",
      "body": "Hello,\n\nI have a final interview with Epic Systems coming up soon. Is it true that the final interview is mostly a formality, and they'll just try to sell themselves to me? I assume I did well on the coding test, and I have internship experience/a high GPA. I don't particularly struggle in behavioral interviews so I'm not really worried about it.\n\nI don't love the idea of moving to Madison, WI but the compensation is insane &amp; it seems like a good way to start my career. Speaking of the compensation, I've seen $110k + $10k relocation; is there any stock including in that at all? Some of the offers on levels.fyi have stock, others don't. Finally, in case I hate it and want to leave, are there any former employees that know if you have to stay a certain amount of time to keep the stock/relocation bonus?\n\nThanks!\n\nEDIT: Also does anyone know the details of their 401k match? I'd juice that thing like an orange.",
      "subreddit": "cscareerquestions",
      "score": 39,
      "url": "https://reddit.com/r/cscareerquestions/comments/rfo5ie/total_compensation_at_epic_systems_as_a_new_grad/",
      "comments": [
        {
          "body": "110k + 10 start + 50 stock vest over 5 years (10 a year) 50% of 8% 401k\n\nThey will try to sell themselves for like 2/3 of it, other parts are case challenge and a bit behavioral\n\nEdit, 110k not 100k starting",
          "score": 39
        },
        {
          "body": "Do they still do the multi-hour coding assessment where you have to have a live camera to proctor you?",
          "score": 22
        },
        {
          "body": "[deleted]",
          "score": 20
        },
        {
          "body": "[deleted]",
          "score": 12
        },
        {
          "body": "About 100,000 Vbucks",
          "score": 40
        }
      ]
    },
    {
      "title": "Will be new grad in less than a month and no offers",
      "body": "Hi everyone, I am graduating in less than 1 month and I have no offers yet so I'm a bit worried at the moment. I was invited to a phone interview with Epic Systems but ultimately ended up messing up real bad on the technical assessment so I ended up getting rejected. I haven't gotten any other call backs or interviews since then and I admit I did fall into a slump after that assessment. This was the resume https://imgur.com/a/Q8vszqy that got me an invitation for a phone interview from Epic Systems and I have been using it for other applications before changing it up https://imgur.com/a/Fr2Pz57. It might also be worth mentioning that I did get a message from a recruiter on LinkedIn about the SWE job if that made a difference. \n\nI'm not sure if I should go back to my old resume or keep using my new one for future applications. Thank you for any advice!",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/12p1sak/will_be_new_grad_in_less_than_a_month_and_no/",
      "comments": [
        {
          "body": "Get rid of the cashier job.",
          "score": 23
        },
        {
          "body": "Your cashier job is front and center. It doesnt count for much. You can remove it and expand projects or if you want to keep it, replace it with the skills section.",
          "score": 11
        },
        {
          "body": "Looking at both the resume, they look mostly similar with mostly order of projects and sections being changed. I do not think it will create much difference, and you can go ahead by using any of them. In terms of any improvements, I would suggest you to add github or demo links to your project section if available. The market in general is tough currently because of all the layoffs and hiring freeze, so that could be one of the major reason for not getting a callback.",
          "score": 3
        },
        {
          "body": "Cashier? Bro you for real?",
          "score": 4
        },
        {
          "body": "Not a cashier, but a point of sale device administrator.",
          "score": 2
        }
      ]
    },
    {
      "title": "American Express v. Epic Systems?",
      "body": "I'm a college senior graduating in May 2023, and have received offers for American Express in Sunrise, FL, and Epic Systems in Madison, WI. Epic's salary is 30k higher than American Express, and I would like living in the Madison more than Sunrise, but the Glassdoor reviews have me worried.\n\nFor example, Amex has an overall rating of 4.3, while Epic has 3.2. 93% of Amex employees approve of their CEO, while it's only 37% for Epic. I've heard that the work-life balance and tech stack isn't great at Epic, but from their demo on interview day, it seems like they've migrated to a more modern tech stack recently.\n\nIt seems crazy to leave 30k on the table for Amex, but I'm really worried about the reviews. I also have a final round with Vanguard this week, and am hearing back from PNC. The recruiter for Vanguard told me upfront that the salary ranges from 80k to 90k, so I'm wondering if I should cancel the final round or not. What would you do in my situation, both in terms of offers and final interviews?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/y6rpji/american_express_v_epic_systems/",
      "comments": [
        {
          "body": "Hi I’m from Madison. \n\nEpic is notorious for burning people out. Salaried jobs but you work 70 hrs/wk so the hourly ends up being much lower than you’d expect. It’s still decent money but theres a very high turnover rate because of the demanding workload. It’s pretty much a part of their culture and business model to high young recent grads that only end up staying for 1-2 years. People mostly work there as a resume builder and jumping off point. \n\nExact Sciences is also in Madison and is a better company in terms of work-life balance.",
          "score": 18
        },
        {
          "body": "As a software developer for Epic, it definitely is tougher being in office 5 days a week, but it certainly helps me focus more than being at home. The most I've worked in a week was 45 hours and that's the outlier. Most of the burnout comes from IS people, and they treat SDs well and compensate well compared to the surrounding area.\n\nThe tech stack isn't cutting edge but it's definitely modern enough where you won't be screwed if you want to jump ship later on.",
          "score": 15
        },
        {
          "body": "Amex has an awesome work culture tbh, default is hybrid 1 day a week in office and 4 days remote but a lot of directors are open to fully virtual if you ask them so could live anywhere in the USA. Compared to epic which is 100% in office (I think they get 5 remote days per year lol) this would heavily influence my decision. Also florida has no state income tax so can bump the florida offer by 5k saved in state taxes.\n\nCould also be worth asking your recruiter if there are any spots in the nyc office for amex? More fun than Madison or Florida.",
          "score": 10
        },
        {
          "body": "I’ve heard nothing but good things about AmEx (I’ve never worked for them). Don’t know anyone who has worked for Epic.\n\nIt looks like Sunrise is about 16% more expensive than Madison, so you’re really down closer to 35k, and back to the original 30 or so due to no state income tax. \n\nThat being said, I’d try to find out how Amex handles raises for fresh grads. Don’t trust HR’s word for it. Talk to actual employees if possible. I normally wouldn’t suggest this, since it’s not necessarily guaranteed, and anything not in writing doesn’t really exist, but that Glassdoor rating for Epic is WAY too much of a red flag. Might be worthwhile to see if you’re likely to be close to parity after 12 months or so (and how bonuses stack up, and if SWEs actually get the ones they’re promised).",
          "score": 6
        },
        {
          "body": "I've certainly never heard anything good about Epic online. From what I've read it really depends on what team you're on. \n\nIf it were me I'm taking the extra 30K and being geographically as far away from Florida as I can.",
          "score": 3
        },
        {
          "body": "I would take American Express, but I would hate the Florida location since I ain't trying to melt like a popsicle.",
          "score": 4
        }
      ]
    },
    {
      "title": "Should I pursue my career as an engineer or go to college as a teen",
      "body": "Hey I want some advice in my situation.\nIm currently a high school student(17) in Japan working full-time at a SaaS company as \na web developer(contract) while going to an online school. Im fluent in Japanese and English so school and work is okay communication wise. Im coming up to my senior year in high school and I need to make a decision wether if I should go to college or pursue my career as an engineer. I put a lot of thought to it and it’s a really though call, both point in my opinion are valid.tho I have many many things to learn and will face a lot of hardships I believe I have some skills.\nlet me introduce you to my background.\nI was first introduced to programming when I was in sixth grade(12) when I got my first laptop.\nit was a used old laptop but It was intriguing. I loved technology and having a computer was my \nbest gift ever. My mom introduced me to a robotics club short after tho I didn’t understand what I was doing I enjoyed making robots using Ardino. After I got into middle school I didn’t do any programming for a while. But I was interested in operation systems and hacking, I watch YouTube videos and had some fun. \nOn the last year of my middle school I went to a coding bootcamp. Thats when I learned javascript, I made some cool and simple project as well as doing a little bit of game creation with unity. Since I live in Japan and go to a Japanese school I had to take a test to go to a school of choice. School wasn’t really a thing for me, I didn’t like the system of it so I epically failed. \nAfter failing my test and my mom very disappointed in me I went to a pretty famous online high school with a good system to give me a lot of free time.So when enrolled I took a lot of web development courses via my school and Udemy. I made many projects and, It was honestly fun and I enjoyed something for the first time that gave me skills. After three or four month I went to a lounge meetup with some engineers. \nThere I met my mentor Nate who worked at a FAANG level company. \nHe was a really cool guy.\nHe took me under his wings letting me work as an intern teaching me and helping me build a path for being an engineer while getting paid to help with his project.After a year or so my internship ended so I decided to give it a shot and submitted my resume to a company posted on indeed. And luckily a company hired me. \nI was pretty impressed with my self because I didn’t use any connections and was able to pass my interview at this company. \nAnd it leads to now. \nI’ve been working little over a month now and I have learned so much. And my adaptability was tested since the framework changed from \nReact to Vue and it was a docker based project.\nI needed some time but I managed to get used to it. I have gone through a lot and Im enjoying what I’m doing a lot. But I just don’t know If I should go to college. People say its only 4years give or take but 4 years for a person in their early 20s sound a lot for me. Not only that but it cost almost 100k witch is just crazy. I asked on quora and many people answered I should go to collage because my pay will get better or I will get a better role but I wasn’t sure if that applies to the programming industry. Im just stuck here and need advice. Thank you\n\nEdit: I probably confused some people. I’m in Japan because I have dual citizenship, us and japan. I’m Japanese/American. Sorry for the confusion 😓😓 I can go to the USA citizenship wise and planning to go after high school.",
      "subreddit": "cscareerquestions",
      "score": 25,
      "url": "https://reddit.com/r/cscareerquestions/comments/pru8nb/should_i_pursue_my_career_as_an_engineer_or_go_to/",
      "comments": [
        {
          "body": "A college degree gives a reliable return, and will give you a solid foundation to build on. It will also let you explore depths to computing you might not otherwise be exposed to. Another factor is it's much easier to get foreign work visas when you have a degree. Go to college, it's a safe bet.",
          "score": 28
        },
        {
          "body": "You should go to college. Since you already know a great deal about the field, you will be in a good position to do well in college. But what you are lacking are assets. College can give you these assets. Connect with people your age and help you get to your next job after your current one. I’m sure you can figure it out.",
          "score": 52
        },
        {
          "body": "I also started programming young (11) but I still went to do my undergrad and now my masters.\n\nIt opens a lot more doors and you learn in depth computer science knowledge, you are very young, University is the best option in my opinion.",
          "score": 9
        },
        {
          "body": "Were you thinking of an online college or moving abroad?\n\nIn the USA, college is seen as both a way to get into upper management and a higher salary, but it's geared toward making a well rounded individual.\n\nYou will take courses that you are not interested in, and they will not partain directly to CS. That is the point. The classic IT nerd in his basement that doesn't have social skills is a thing of the past. \n\nIf you think this will be a struggle for you, then college is not the answer. At least in the USA.\n\n日本では...しりません。でも、あなたは日本に住んでいますから、あなたがしります。すみません、ぼくの日本語がまだ下手です。\n\nI just hear that in Japan your college has a large influence on where you can work.\n\nEdit: typo",
          "score": 6
        },
        {
          "body": "I think most people here will tell you to go to college, but I actually think you should keep working and go to college part time.\n\nThink of it this way, who will make more money?\n\nA recent college graduate\n\nOr\n\nAn engineer with 4 years of experience\n\nIn some places 4 years you're already a senior dev, if you're really good at what you do. That's just my humble opinion but look at what people say and do what's best for you.",
          "score": 10
        }
      ]
    },
    {
      "title": "Career Advice",
      "body": "I am a (somewhat) recent graduate with my BsCS degree. I graduated without any internships, but a high GPA and some good extracurriculars. I’ve spent the last year applying to jobs like crazy and working on projects/constantly revising my resume. I got two interviews shortly after graduation, one with Epic and another with a small insurance company, but neither resulted in a full time offer. \n\nLately, it’s been nothing but crickets. \n\nDesperate to get out of the restaurant industry and start putting my degree to use, I applied to a new grad program with a fintech company as a Business Technology Consultant. During my initial behavioral screening the recruiter mentioned that the program has a lot of room for lateral mobility and I’m hoping that after getting some more relevant experience it will then be more possible to move from this position to a traditional SWE position or, depending on what I’m exposed to, a PM position. \n\nI know traditional consulting is not highly praised in this subreddit, but I have to get out of the restaurant industry and I feel that this position would at least be part of the SDLC. \n\nMy question is: has anyone here successfully made a similar transition after taking a non-SWE position to break into the industry? \n\nTIA for your responses ",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1bu6mmq/career_advice/",
      "comments": [
        {
          "body": "Yes. You can definitely do it if you are coding and keep your skills sharp in what you are doing.",
          "score": 3
        }
      ]
    },
    {
      "title": "Apply to Universal Studios",
      "body": "I lurk around here a lot and take away a lot of good information/advise. So I want to give back. \n\nFor my people in Central Florida or looking to move, the new Epic park is under construction and they are already hiring while in progress. I was asked to come interview for a position I didn't even apply for. They're looking to hire now and once new park opens to move them over.\n\nUnfortunately (or fortunately) through good advise from here I had already accepted a great offer elsewhere.\n\nBut just wanna help out my peeps in here. I know it's hard out there right now and might not be the exact position you're seeking but benefits are good and something for now!\n\nGood luck!\n\n\nEDIT: Yes, IT/SWE *related* jobs. I'm not a developer but I work with SQL and Scripting. The position I was poached for was to work in that area. ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/19fnb74/apply_to_universal_studios/",
      "comments": [
        {
          "body": "SWE roles or park employees lol",
          "score": 3
        }
      ]
    },
    {
      "title": "I’m coming up on a panel interview for an Epic Analyst position and I’m looking for any tips.",
      "body": "",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1md857c/im_coming_up_on_a_panel_interview_for_an_epic/",
      "comments": []
    },
    {
      "title": "Pretty sure I’m getting fired in the next 7 days",
      "body": "Oct 1st is my work anniversary and I’m pretty sure I’m getting fired in the next 7 days. \n\nI have been pressed against the glass ceiling when they changed my boss this year, shot down on a promotion and even somewhat demoted in my work duties in that. \n\nThey hired a peer for me vs hiring a direct report to help me. \n\nMy boss hasn’t had a 1-1 with me in 2 months. This after giving me a new MBO target that was insanely unobtainable for this year and next. Of course they don’t have the tools to even measure it regardless. \n\nMy boss rarely if ever responds to me. Not over email. Not over chat.  If I escalate an issue to my boss they often ignore it or just doesn’t want to deal with it. \n\nMy work anniversary would dictate they owe me an extra week of severance so I’m guessing this is my last 7 days. \n\nFrom a work perspective the company is in free fall. Dozens of long time people have left in the last 2 months. The brain dump is epic. \n\nI’m one of the few left who know anything.\n\nThe c-suite could care less as they continue to add VP after VP but let attrition cut her count week after week. \n\nIt’s so bad that 7 ppl quit the same day all with tenure &gt; 7 years.\n\nI have been looking for a new job. Some interviews. But nothing has materialized. \n\nI’m exposed to a lot that happens with the exec team and the dysfunction at this company is absurd. No one rights things down. They are nice on a call but then do everything they can to undermine every other department. They throw each other under a bus every chance they get. \n\nIt’s utterly toxic yet the exec team has convinced themselves that they are the greatest place to work. \n\nI have had the ceo talk out of both sides of his mouth more times than I care to count as he desperately try’s to keep his job after utterly tanking this company. \n\nI landed this job during Covid as I was laid off of my last job. It was a great place to work for a while. We were sold and the new ceo has made bad decision after another to destroy our sales. \n\nI will figure things out but I busted my butt to get financial stable after Covid and it’s going to be back to square one once more. Ugh\n\nUpdate: on Tuesday I had a 1-1 placed on my calendar for Thursday with my boss. Haven’t had a 1-1 with my boss in 2-3 months at least. \n\nEvery meeting for Wednesday and Thursday where my boss and I were on together has been pushed or canceled until after this 1-1.  That includes my team meeting which never moves. \n\nThe meeting had a simple “quick connect” subject (oddly similar to when I was last laid off actually) \n\nNo context to the meeting, and we recently had a quarterly board meeting (which is usually the trigger for layoffs) \n\nMy business trip next month was canceled, one I have spent months putting together mind you, and my boss is going instead of me. \n\nThe team meeting was pushed out until tomorrow which will be used to “break the news” if I had to guess.\n\nI’m pretty sure today is the day. \n\nCould I be wrong? Yes, however I seriously doubt I am. \n\nThat said if it happens I am at peace with it. Feeling it was coming and not having a few irons in the fire had my stress levels high af. But I have been interviewing, and have 2 very promising potential jobs in the works. My interviews reinforced that I’m still quite good at what I do professionally and that this situation is a result of the business and their leadership flailing and nothing to do with me. \n\nI’m probably more thrilled I don’t have to deal with their insane ways of working more than anything else. Frankly they can drown without me at this point. I could care less. \n\nMy HD is backed up. My personal laptop is updated and ready to go, And frankly im ready to go and start negotiating my severance at this point.\n\nOn the interview side of things. Round 5 completed on one of the jobs (large org) and a 2nd round (smaller shop) is in the books for next week.  At least for the big org opty they said they want to have a final decision by the end of the month. And the smaller shop could move just as fast. \n\nSo best case I’m working again 2-4 weeks from now and I get some double dip on pay. \n\nUpdate 2: today was indeed the day. At least I figured it out well in advance so I wasn’t blind sided. \n\nUpdate 3: I have come to learn that I was on the list about 8 months ago, somehow I managed to not get let go, that said everyone on the list this time around was let go. \n\nClearly cutting ones nose to spite their face as there is no plan to backfill some of these roles and the people left behind wouldn’t know where to begin to figure out who some of these people worked with. \n\nIt’s become clear that they are in deep financial hell and their overlords won’t give them another penny.\n\nOne bright spot is my lawyer was blunt that their “laughable non-compete” is completely unenforceable \n\nSeverance is terrible but tbh I need the health insurance as otherwise my family won’t be covered for a month and that’s not a viable option at all. ",
      "subreddit": "jobs",
      "score": 104,
      "url": "https://reddit.com/r/jobs/comments/1fnhyhu/pretty_sure_im_getting_fired_in_the_next_7_days/",
      "comments": [
        {
          "body": "This sounds like somewhere you want to get out of anyway. You may be a bit paranoid, but if you’re right then take the severance and unemployment and hit the job market HARD.\n\nAs for them not being able to function, you won’t have to deal with it anymore. Good riddance.",
          "score": 76
        },
        {
          "body": "Sounds like if you play it right, you could be a well paid contractor for the company. Especially when they figure out the have no idea how to steer the ship.",
          "score": 20
        },
        {
          "body": "Be smart and dip while you can.",
          "score": 10
        },
        {
          "body": "Same boat. Good luck",
          "score": 8
        },
        {
          "body": "Time to take a week of vacation or sick leave 🤷‍♀️ \n\nIf they want to play games, play better than them",
          "score": 6
        },
        {
          "body": "I haven’t seen my boss in 3 years, feel like when I do see him it’ll mean trouble lol",
          "score": 5
        }
      ]
    },
    {
      "title": "Rejected after over a month of interviews",
      "body": "Spent over a month interviewing with this company I thought I would be perfect for and the perfect situation (skill match, location, etc.).\n\nInterviewed with six different people over this time.  Each time HR would get back to me that day to discuss who I would be talking to next and to schedule, a sure sign that I was doing great.\n\nDuring the fifth interview, the person said I would meet with the CFO next, blah blah blah, nothing but good vibes from all these interviews.\n\nHR contacted me THAT DAY (Tuesday before Thanksgiving) and wanted me to meet this person the day after Thanksgiving, yep, Black Friday which I pounced upon.\n\nAnother great interview, we even chatted past the allotted hour and talked about our personal lives etc. and I even got the final interview coveted \"when do you think you can start?\" question.\n\nThis past Tuesday, got the dreaded rejection email, \"After careful consideration, we’ve decided to move forward with another candidate...\" etc., very generic, cold, no one copied, from a generic HR address signed \"HR Department\", not by any person in HR that I had been working with for over a month.\n\nSo disappointed, so frustrated.  Pissed off beyond belief.  What a waste of time and epic rug pull.  Like WTF could have happened?\n\nAnyway, just wanted to vent, thanks.",
      "subreddit": "jobs",
      "score": 10,
      "url": "https://reddit.com/r/jobs/comments/1peaguo/rejected_after_over_a_month_of_interviews/",
      "comments": [
        {
          "body": "If an interview process is more than 4 interviews or 4 weeks, they don't actually need to fill that role. They're just filling their own time.",
          "score": 5
        },
        {
          "body": "Nothing happened on your end. They misled you and ended up changing their mind at the last minute. This has happened to me several times. They are all really nice to you, right? Yah. It doesn't mean anything.",
          "score": 3
        },
        {
          "body": "Similar happened to me recently as well.",
          "score": 2
        },
        {
          "body": "What I’m seeing is any company that wants you to interview more than 3x doesn’t want you. It should be a total of 3 tops.",
          "score": 4
        },
        {
          "body": "Same. This happened twice now. One went on for 6 weeks of interviews. 4 interviews total then the generic soul crusher email.  I’ve had to take a cue from Pat Benatar and “Harden my heart”.  Seriously it’s practically impossible to remain emotionally neutral in a situation that in normal circumstances points to a positive outcome. \nMaybe we come out of this with a more cynical view of life and somehow are more prepared for the future. \nI don’t know… here I am being hopeful again.",
          "score": 1
        }
      ]
    },
    {
      "title": "Hows the tech industry these days? Would it be possible/practical to enter for someone from a media art background?",
      "body": "Like the title says, I have a media art background. I studied stuff like film, digital art, and web design in college, and then for almost 3 years, Ive self-studied game design to try to enter that industry. But now, I'm fed up with all this reliance on portfolios and luck-of-the-draw networking. I'm done with jobs that aren't taking me anywhere, and I want to actually get into a career.\n\nA few days ago, I applied at a medical software company called Epic (not related to Epic Games) for an A/V position, and I managed to get an interview scheduled in under a day. There was no portfolio asked for, no unnecessarily long list of required qualifications, just a background in media. The whole thing got me thinking that maybe I should check out these industries. I got some coding experience with C++, Python, and HTML5. I’m not a math guy in the slightest, but I do have experience with design. Honestly, at this point with the market, I feel like it’s worth taking a chance and just applying. Would rather be applying to all these jobs and companies than worrying about the quality of my portfolio.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1mm1pdg/hows_the_tech_industry_these_days_would_it_be/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "You got an interview at epic because they are a churn-and-burn software company that goes through workers like crazy. They're always hiring.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is working at Epic worth it?",
      "body": "I applied at Epic System and I don't know lock about coding. I did the assessment and I am sure i failed all the questions including math. The role introduction/interview is coming up soon this week. If it works out I might have to move out of state. I did some research and I saw people saying at it's not worth it and i don't even know the pay for the job position I got. \n\nI currently have to jobs and will have to quit to move. I don't want it to be a wait to time and money if it doesn't work out.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1lusy0l/is_working_at_epic_worth_it/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Fake it till you make it. Can always be trained",
          "score": 1
        },
        {
          "body": "These \"Is is worth it?\" threads are terrible and the mods really need to start taking them down.\n\nThe whole idea of a job being \"worth it\" is completely subjective and ambiguous. Only you know your personal situation. Land the job, evaluate the pros and cons, then make a decision like a responsible adult.",
          "score": 1
        }
      ]
    },
    {
      "title": "Stuck between a rock and a hard place: Admin job pays more, but other jobs pay less but are more focused on my interests?",
      "body": "Okay, I am currently working as a Digital Analyst in the UK (NHS). I am on a fixed term contract for a year, which will be dissapearing in October as the department itself is dissapearing. Up to now, all my work experience has been working within the healthcare sector in various areas which cover both the back-end and front-end. My career has led to me to working in digital transformation through different project officer/project support role. This has led me to being proficient in project coordination and management, as well as developing knowledge in T-SQL, Oracle, VBA, Python, C++, Jira, PowerPoint, Cerner Millenium and epic to name a few. \n\nAfter sending a couple of applications, I have gone through had a phone interview as well as various invitations for face-to-face interviews, all of them still related to healthcare; for the sake of clarity I will call them jobs a, b and c:\n\nA - A six month fixed contract working as an order comms development specialist for a hospital trust in the outskirts of London. The commute is 35 minutes by train and it pays 31000 pounds (39476 dollars for the US crowd). It is a relatively low paid job, but if successful in the interview and I get the job, it is a job that can really push my career forward\n\nB - Working as a Project Coordinator for Cerner. Pay is 32000 pounds (41032 US dollars) however it would allow me to get experience outside the public sector and to explore growth within the private sector. Would involve agile working and up to 50/50 share between being in the office or elsewhere in the UK. This role is permanent.\n\nC - Team Administrator for the Transformation team in an NHS Trust. It would involve administrative, payroll and EA duties. Pay is the best out of the three at 36,000 pounds or 46000 dollars per year. This role is permanent.\n\nWhat are your thoughts r/jobs? Because of the money I am leaning more towards the Team Administrator role because of the pay, as we (me and my partner) could really do with the extra pay. However, working with Cerner would provide me more experience outside the NHS and the order comms one would be using the skills I have acquired so far through my work.",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/fd4pnt/stuck_between_a_rock_and_a_hard_place_admin_job/",
      "comments": [
        {
          "body": "Take B. Project Coordinator at a big company could set you up for a career. Admin won't. 4k is nothing - after tax it's 250/month.",
          "score": 3
        },
        {
          "body": "Don't know anything much about coding etc so I can't advise in that respect. \n\nBut consider what your priorities are, what your ambitions/long-term goals are, etc. Maybe you want more experience, maybe more money, maybe the office culture at one site suits you better than at another. Maybe you want the opportunities for career progression. None of these are wrong, it's all about what you want. \n\nI'm also in the UK. When job-hunting, I flat out refused to look at anything in central London, because just the commute would make me utterly miserable. (Much as I love visiting London for fun.)\n\nI recently lucked out and accepted what is my dream job - data-entry type admin in one of my favourite towns, in a lovely office with lovely people. Both interviews at this place, I instantly felt comfortable and accepted, and like I belong. I'm looking for somewhere to live that will allow me to walk to work, because that's a priority for me and ideally, I don't want to spend 30 minutes sat on a bus (and pay for it).  \n\nThe job is less money than some other jobs I applied to, and especially compared to most of the central London jobs I refused to apply for, but I haven't stopped smiling since I got the offer.\n\nSo do what feels right to you. :)",
          "score": 1
        }
      ]
    },
    {
      "title": "Entry level Epic analyst role",
      "body": "Hello! During the HR screen, i was asked about my salary expectations—I said “negotiable”.  I already did my interview with the hiring managers for this company. They just reached out again with 2 questions. Can you please give advice as to how to answer these questions? I really want this job\n\n1. Do i have other interviews or offers? \n\nI do not have another interview or offer but i am still applying to other jobs and i am communicating with another HR person from a different company. Is this considered a yes? How specific should I give info to them?\n\n2. What is my salary expectations? \n\nCan I say negotiable again or do i need to give them a number since this is the second time they are asking?\n\n",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1kcoanc/entry_level_epic_analyst_role/",
      "comments": [
        {
          "body": "Regarding question 1, I like to tell companies that I am in various stages of interviewing with various other opportunities, but my top priority is finding the best fit. Even if none of that is true at the time, it's still my go-to answer.\n\n\nRegarding salary, never give them a number. Ask them what the budgeted pay range is for the position. They want you to give them a number because they know entry level workers are much more likely to lowball themselves.",
          "score": 2
        },
        {
          "body": "Epic is new grad central you should be able to find expected salary ranges online or on Glassdoor. I'm surprised they even ask",
          "score": 1
        }
      ]
    },
    {
      "title": "I left my job on July 18 with no leads of any kind and no savings whatsoever. Yesterday, I got an offer at my dream job. Here's how I did it.",
      "body": "On June 21, I thought I had found the next step on my career path. Literally less than a month later, I quit. I was working 80+ hours a week for not enough money. It was taking a toll on my happiness and my relationship with my girlfriend. \n\nI didn't know what to do. I had no savings (besides part of my last paycheck and a paycheck that would be small). However, I hustled and here's how I got a job that I feel I'll love with no help from a network, friends or family. \n\nFirst off, I treated finding a job like it was a job. I'm sure you've read this before and it's not a joke. From 8 AM to 5 PM, I searched for and applied to jobs. I wrote a specific cover letter for every one of them. Whether it was the cover letters or the website's crazy antics in regards to the information I had to give, it would take around an hour to thoroughly apply for the jobs. So then, I was turning in 8 applications a day, give or take a couple. I feel that every cover letter I sent was epic. On top of this, I still treated my life the same. I woke up at 7 and cooked breakfast. I went to the gym after \"work.\" I even went out with friends on the weekends. By the first weekend, I had had a few phone interviews so I felt going out would be fine as I'd hear back from someone. On top of this, I updated my resume to reflect the skillset that I had garnered or expanded upon in my last job. I also killed a lot of the white space on my resume. I don't even have a G.P.A. on it. I feel like a lot of places understand that a G.P.A. isn't really indicative of anything anymore. I had a 3.003 out of school. Not the best and definitely not the best for some careers (so keep that in mind, engineers, IT, etc.) Regardless, I revamped my resume. Reach out to someone if you're not sure. Do not be embarrassed. I would always try to hide my resume from friends or family when I could've used the help. I didn't want them to know how poorly I'd done in college.\n\nSecondly, I found my job on my state's job board. It's a nonprofit that works to help people find jobs. I don't know if EVERY state has these nonprofits, but I just looked up a few in a few major states. Regardless, I'm sure SOME nonprofit in every state focuses on this. Someone can correct me if I'm wrong. Why I think this played a major role, however, is because this essentially (in North Carolina, at least) weeded out all the Vector Marketing (sorry Vector people!) and bullshit jobs. Now, if you're in IT or something like that, this may not be an issue for you. But I know plenty of people who are \"qualified\" for some jobs, will get calls back in 30 minutes of applying, and find out that it's a pyramid scheme or uncomfortably close. Regardless, I had confidence that every job that I applied to was a legitimate organization. This meant that I was spending my time wisely.\n\nSo I got a phone interview. People put so much emphasis on the actual, face-to-face interviews (and they should), but the phone interview is a very real thing now. You need to be preparing for the phone interview as you apply. If you get a call from a random number, it's probably time for a phone interview. If you're not ready, I can only imagine how hard it is to get to the actual, first interview. Regardless, I figured it was coming and knocked it out of the park. If you get a call from a random number and it's for a job you applied to, IT MAY BE A PHONE INTERVIEW! If you're not ready, tell them you're busy. Do anything that you can to hold them off. Telling them, \"Sorry, I'm headed to a three hour movie\" while you prepare for the interview is obviously reasonable considering they randomly called you. If it's not for some organizations, you probably don't want to work there anyway. \n\nSo I got called in for a first interview. At this point, I had spent the past TWO DAYS studying the organization and practicing my answers. In these two days, I still treated finding a job like my job, but I didn't apply to any new jobs. I simply prepared for this first interview. By the time I got there, there wasn't a question they could throw at me that I didn't have the perfect answer to. I came here to r/jobs, I searched for first interviews, I searched for first interview questions to ask, etc. I studied my answers and how I would say them--at what speed, how I would use my hands, etc. I also practiced my posture so that I could have a confident posture as I interviewed. During the actual interview, I kept careful notice of things like my hand movement and posture and adjusted them accordingly. I kept good contact with all three individuals who were interviewing me. I threw a bit of my personal traits in (like my humor) and made them laugh multiple times. When I couldn't think of an answer RIGHT off the bat, I took my time. I'd sit there in silence for 10 or 15 seconds and gather my thoughts. Then, I'd knock it out of the park. Those of you who aren't necessarily personable, practice it. Practice it for the sake of the interview. I can only imagine how many people have not gotten jobs despite being very qualified for them simply because they seemed a bit stiff or awkward. \n\nDuring this first interview, you obviously want to relate every question they ask back to your previous experience or education. This may not work for computer science or engineering, but in a lot of careers, you are going to be asked the EXACT SAME QUESTIONS that you read whenever you Google what questions you may be asked. I can't quite hone in on how many questions I got, but I would say a good 25% were questions I'd heard plenty of times before and had mastered. I had mastered exactly how I would tie them back to my previous experience. \n\nI knew I killed the first one. I texted all of my friends and let them know that the job was mine. After my first interview, they told me that I'd hear back from them by the end of the week (my first interview was on Tuesday), and that there would only be a second interview if there was another great candidate. On Wednesday, I awaited my offer. Cocky, I know. But I flat-out murdered that first interview. Nothing on Wednesday. On Thursday, I received a call... They needed me for a second interview. Fuck. I had some real, true competition. I was one of two possible candidates. Did I fret? Did I cry and hope I'd get it? Nope. I went back to the drawing board. \n\nThis time, I researched the second interview. I'd actually never had one despite having four jobs since 18 (I'm 24 now). I read that there was a possibility that it'd be a tour and that they'd want to see how I fit in with the organization. I read that the questions would get a little bit more in depth. So I prepared. I prepared my ass off. By the way, the second interview was at 4 PM, and they called me to ask if I could come in for another one at 12:30 PM. Maybe that's their technique... but on my end, it just seemed like a short amount of time. Regardless, I got ready as much as I could. I got more in depth with my answers, and literally practiced how I would speak to people I met to show how I'd fit in with the organization. I went deeper in my research. I went through the first 20 pages on Google to read anything I could on the organization. I could've done more, I'm sure. I knew names, dates, facts, and figures. I knew their outcomes, their budget, their programs, etc. I was ready when it came down to it. \n\nI went in and was as personable as I could be. They had someone new there to interview me. I had expected the CEO from my research (and prepared questions and answers for her in particular!) but it wasn't her. Regardless, I had practiced everything so many times it didn't matter. I took a tour of the facilities, asked NEW and more SPECIFIC questions to see if I wanted to work there (that's what they're looking for on a second interview, I'd read), and walked out of there feeling like I'd kill that interview too.\n\nBut tomorrow, 9 AM came. And no call. I waited and I waited. It seemed like I waited for an eternity. No call. DON'T let this psyche you out. Sometimes it takes time as I learned today. Well, I guess that's obvious. But I just always think they'll call the person who gets the job right away. Anyway, I got the call. Every time I've gotten a job, actually, the person on the other end extending the job offer to me has always sounded somber like they had some bad news for me. This was no different. But I heard the words. \"We'd like to offer...\" I literally teared up. I had no savings. I had reached out to my friends and family but to no avail. I had to continue to make money immediately. And I succeeded when I had to. It literally made me flat-out cry. \n\nSo what did I do exactly? I listened to all of the advice I'd ever gotten. I read long ass bullshit like this. I internalized all of the advice that I'd ever read. I was confident mainly. I answered every question like I'd already had the job. r/jobs had helped me out more than they knew. They'd taught me so much about interviewing and fine-tuning a cover letter or resume. Thank you so much, r/jobs. You helped me find work that is righteous. I'm working for a nonprofit that helps at-risk women. This is an important goal to me. This was also the first job I'd ever gotten where there was solely one position. Every other job I'd ever gotten, there were multiple positions open for the same job title. This one was special. And all the research I did, including here on r/jobs helped me tremendously. \n\nStay hopeful. And I hope this information helps someone as r/jobs has helped me. \n\n",
      "subreddit": "jobs",
      "score": 271,
      "url": "https://reddit.com/r/jobs/comments/2cfcep/i_left_my_job_on_july_18_with_no_leads_of_any/",
      "comments": [
        {
          "body": "/",
          "score": 7
        },
        {
          "body": "hey if you don't mind me asking so what's this dream job that you found?",
          "score": 9
        },
        {
          "body": "Thank you providing your insight bro",
          "score": 8
        },
        {
          "body": "That was incredibly inspirational to read.  I'm very happy for you.",
          "score": 8
        },
        {
          "body": "I want to thank you for taking the time to write this, as it's the most helpful and inspirational thing I've read on r/jobs. I've been out of work for 10 months now, my self esteem is shot, and my finances are in bad shape. I have an interview on Tuesday for a job that looks like it will be a good match for me. Just know that the effort you took in writing this is helping me be more prepared and inspired to knock it out of the park.",
          "score": 6
        },
        {
          "body": "YES!  Customize the resume and cover letter for every application, and do a tremendous amount of research and preparation for each application- so much better than just spamming out applications like most people do.  Well done OP, you definitely earned this one.",
          "score": 6
        }
      ]
    },
    {
      "title": "Is it okay to submit for a a job you know you're not qualified for?",
      "body": "Hi everyone!  So I currentlybwork for a hospital, and through the hospital, I'm working towards a bachelor's degree in IT.  Now, my BIL works in IT and I've talked to him about a few things.  \n\nSee, I'm floating between choosing an EPIC analyst path, Data Analyst path, or just a general Bachelors in IT.\n\nA see a few positions open where all they are asking for is a bachelor's in IT as a minimum qualification.  I'm like a year out from finishing.\n\nWould it be a waste of time to submit an application, just to see what an interview would be like?",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/1fa8p37/is_it_okay_to_submit_for_a_a_job_you_know_youre/",
      "comments": [
        {
          "body": "Yeah, why not? Maybe you get the job, but your experience needs to be somewhat related to the job you are applying to, otherwise they will ignore you.",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "Yes. If you get the job, of course, awesome. If you don’t get the job, nothing changes. Besides, it’s great to dump more work on asinine recruiters and asinine hr hiring managers lol",
          "score": 1
        },
        {
          "body": "I mean, why not? It's not like they're going to arrest you or something for applying to something you aren't qualified for.\n\nWorst that happens is they say no and then you re-apply when you are qualified.",
          "score": 1
        },
        {
          "body": "In the private sector yes, but in government you must demonstrate on your resume that you have the experience they are asking for.",
          "score": 1
        }
      ]
    },
    {
      "title": "Totally Disappointing Rejection ",
      "body": "Long-ish story ahead (also, venting because I'm really disappointed, feeling very let down,  pretty epically pissed off, and unsure about WTF I'm going to do next...)\n\nI started looking for a new job last Jan (2024) as I've topped out where I'm at and that is no longer sustainable with my family, rent, etc. In my current position I've interacted with a lot of people in town, many of whom could be potential customers in the industry I was looking into. \n\nLast March I was auto-rejected by a job via email after applying and getting a very good recommendation from a friend that is a top performer for the company - apparently I am not qualified for the position of \"sales.\" My friend was disappointed that the application clearly didn't even reach a human being, but he also said the AI is probably looking for someone with a sales book in my area, so he gave me a few recommendations for \"competitors\" (much smaller companies in the same industry) in my area.\n\nI was able to get contact information for a district manager for one of the competitors and we started chatting about how I thought I could bring in a lot of business where I live (the original company has some presence here, but I've heard from many of their customers that they aren't super happy about their rep). We chatted a few times, he had me do a Zoom interview with their HR Dept, we followed that up with an interview with him and his boss, followed by another conversation between he and I where we actually started planning what my territory would look like. The only holdup, as far as I understood it, was the company was waiting for a contract to be signed with a particular vendor before they opened up hiring more in my area. The guy I was in contact with said it could be a few days or a few months - he had no idea. In the meantime, we chatted a few times a month, every time he let me know he was pressing his bosses to bring me on, but that contract was still holding things up. At the beginning of August he let me know he was leaving the company and going back to his previous employer at the end of the month but he let me know his replacement would have all my info and he was on board with what was going on. I stayed in touch with his replacement through Sept and into Oct, when he let me know that they were bringing in a new guy to run the part of the district I would be in. I thought that was a good sign, because this new guy is in the same state, meaning, to me, that contract must be signed. I had a great conversation with the new guy a couple weeks before Thanksgiving where he was basically going over how I would get paid, health benefits, 401k, mileage reimbursement, how typical weeks look for schedule, etc. He said he wanted to meet in person between Thanksgiving and Christmas. We agreed to chat again after Thanksgiving. As I was still working my current job, he said he could work around my schedule. The first week of Dec he found out the company issued a temporary hiring freeze and he said he was trying to find out if that was just until the New Year or what. He knew I would be traveling to see family until Jan 7, so we agreed to touch base again when I got home. I let him know the day I was heading home. I followed up two days later since I hadn't heard back yet (which wasn't out of the ordinary during this whole process) and then I followed up again yesterday morning... I got a text back that they were holding off hiring right now because they just brought 10 people over from a competitor (the original company I applied with) and they would keep me in mind if they need to fill any holes in the future. \n\nI feel like everything just blew up in my face. It was supposed to be a matter of time to get this opportunity and it just disappeared.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1i1hnnk/totally_disappointing_rejection/",
      "comments": []
    },
    {
      "title": "I need a clinical-based job in Houston, TX",
      "body": "I (23F) have been looking for a job in the Houston, TX area for the past 4-5 months with no luck. I’m constantly getting hit with rejections and every day I’m growing more discouraged. I’ve applied to over 35 jobs across Houston for various positions and still nothing. So far I’ve gotten 2 interviews, but no call backs. So I don’t know whether this may be a resume issue or that I’m lacking interview skills or both.\n\n\nFor background, I’m a pre-medical student who graduated with my Bachelor’s in Biology (GPA 3.5). I am currently working as a medical scribe in the ED since 07/2022 and as a caregiver at an assisted living facility since 01/2024. \n\nI have experience working as a manager in a “superstore” from 07/2019 to 07/2022, as well as managing a small cosmetic store from 07/2018 to 07/2023. \n\nI was also once a receptionist from 08/2018 to 12/2018. \n\nNow I do have plenty of other job experiences as well (considering I’ve been working since I was 16) but I figure these were the only jobs that are pertinent. I also have my CPR and BLS certification, HIPPA certified, have extensive training in using EPIC, fast typing speed, and is well-versed in medical terminology/medication names.\n\nSo anyways, I’m getting desperate. I’ve been applying to random clinical-related jobs whether it is as a research assistant, medical assistant, technician jobs that don’t require further certification, phlebotomy I, etc. And so the reason why I’m looking for another job is because of pay and poor management. My workplace environment has become very toxic and I would like to leave, but I can’t due to having bills. Additionally, even though I work 2 jobs, both jobs combine do not pay me well enough to compensate the work I put in causing me to work more hours. For reference, I get paid $12 as a medical scribe and $15 as a caregiver. Over time, I have also become exhausted as a caregiver since I have to carry heavier individuals and help them with ADLs. So please, if anyone is able to help me with a job opening please reach out to me or DM me. Honestly, I am looking for a job with starting pay of at least $18/hr, but truthfully I would prefer $20+/hr. Thanks",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1folzs1/i_need_a_clinicalbased_job_in_houston_tx/",
      "comments": []
    },
    {
      "title": "Former attorney - struggling to find a second job in my new field",
      "body": "I’m 36 and for the last 2 years I’ve been working as a Senior Administrative Analyst for the state government in Albany (and it is 100% not for me, I miss NYC tremendously.) I want to move back to New York City but I’ve been having extreme problems in finding a job. I was originally an attorney (top 35 law school), but I struggled to find steady work in that career due to extreme depression (feat. a suicide attempt, etc,) and some other issues. Emotionally, I’ve been vastly better now since I got my current job and was able to move away from my abuser.\n\nI only worked as an attorney for a year and a half, plus some volunteer gigs, from 2009 to 2017. Although I have gotten two promotions in 2 years, I only earn $56k from my salary, which is pretty lame for a law school graduate at my age. The next job I get doesn’t have to be high-paying at all, if I can make enough money in NYC to get by, even with a roommate (I have friends I could be roommates with,) that’ll be fine, I just want to get back there as soon as I can. If I could find a $55k job in NYC with normal or normal-ish hours, I would be thrilled.\n\nI'm non-competitive for attorney positions, so that’s probably not an option for me. There are “document review” jobs for attorneys, which do not ever lead to real attorney jobs, and it’s basically temp work with no benefits where you determine if e-mails are relevant to a case or not. I really don’t want to take that kind of a job if I can avoid it; I’m not even sure if I’d be competitive for that work or not. The idea of working as a paralegal also makes me kind of sick, because I know I’m a lawyer and I’d feel like a complete failure every day because it would be a constant reminder. I like to just forget that I have a law degree most of the time. Also, I have heard that law firms don’t like hiring attorneys as paralegals because they know they won’t be happy in those roles.\n\nI could get a real estate license (waiving the test since I’m still licensed as an attorney) but something tells me that that would still be a competitive field. Also I don’t know anything about it, and although I’m not awkward, I don’t have the outgoing personality that I think you need to have to be succesful in a sales position, such as real estate.\n\nI could try to become an LSAT tutor (I had a 171 score, which is considered pretty good. Most places require a score of 170 or 171 to be a tutor) but I’m not sure if I’m outgoing/entertaining enough to do it. It’s not just about knowing the material, it’s also sort of an edu-tainment thing where you have to be funny and engaging, and I think I would need acting lessons to do that. Also I’m not sure if it would really pay the bills or not.\n\nI’m also considering enrolling in a tech boot camp in NYC in January if I haven’t found something by then, and hopefully getting a job that way, but I’ve heard that it can still be very hard to get a job through those, especially if you’re in your 30s (since startus generally have a youth culture.) (I do look really young for my age, however.) I learned some Python a few years ago from my brother (who works in tech) and he said that I definitely have an aptitutde for it, but I don’t like the idea of not having a job and knowing it would be an epic struggle to get one after I finished the program. My “heart and soul” are not in tech but I would love to have a steady job, especially one where I’m not on the phone for 3 hours a day like my current job.\n\nI am an introvert, but am willing to network or do whatever I had to do socially, as long as it would have some reasonable chance of helping me get a job. I’m not a disaster socially - I’m articulate and professional, etc. The problem is that I’m in Albany, and the jobs I want are in NYC, so the networking opportunities I have would be for Albany jobs. If I was 27 or 28 I would be okay with staying in Albany for a few more years, but I’m getting older and I can’t deal with this place much longer.\n\nIn addition to my salary, I have started making  money running an online business that I hope to one day build into a career. However, I will need a day job at least for a couple more years. I very strongly prefer to work on my business while having a steady day job that covers my bills.  \n\n\nI’ve applied to about 100 jobs since I had an emotional breakdown and realized that I needed to move back to NYC as soon as I can. Out of those, I recieved 1 phone interview for a NYC city government job that would pay about double my current salary. This was about a month ago; they said that there’s a hiring freeze and that it would take months for them to hire anyone. They seemed to be somewhat impressed (I was well-prepared, and I’m actually decent at interviews) but I have a feeling I’ll never hear from them again.\n\n* Should I hire a resume expert to help me write a better resume? My current resume style is a bit old-fashioned and boring; it focuses mainly on my current job and runs 2 pages long.\n* My net worth is about $150,000 due to some investments, an inheritance, and living frugally, so I could theoretically burn through my life savings and move back to NYC without a job, but I’m terrified of winding up having to move back in with my parents. I am not a skilled enough attorney or good enough at networking to open my own law practice. I have no student loans or any other debts.\n* Aside from Administrative Analyst jobs, of which there seem to be few, what other jobs can I apply for with my skills?\n* Does anyone have any recommendations or advice for me?\n\nPlease try not to be hugely negative - I understand that my current bad situation is due to my own bad decisions. I get that and there’s no need for anyone to pile on and criticize me for not having made more of the opportunities that I’ve had.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/cmyi57/former_attorney_struggling_to_find_a_second_job/",
      "comments": [
        {
          "body": "i have to admit, i only skimmed the first part of your post, but i'm skipping ahead to tell you as quickly as possible:\n\ni have a friend who graduated from nyu law and subsequently passed the bar in both ny and sf, and after her first year as an associate at a firm in sf, determined that lawyering wasn't her jam.\n\nshe fell into attorney recruiting shortly thereafter, and 20 years into the game, earns between 200K and 350K a year, commissions depending.  even when she was just starting out, she was outearning her attorney friends who stayed in the lawyering game.\n\nshe works on 100% commission (though prior gigs were base plus commission - she switched to pure commission when a colleague informed her she was selling herself way short).\n\nin all honesty, she might have two months where she earns nothing (or, back when she was base, earned only base for a month here and there), but the months where she places a couple of partners more than makes up for it.  she can have $0 march and april, but $150K the next three months.  \n\nshe also works about 25 hours a week on average.  maybe 70 hours a week for two, and then virtually nothing for the two following.  it's basically just wine and dining the candidates.\n\nsomething to consider...",
          "score": 2
        },
        {
          "body": "I think you should do doc review and actively search for a job in the meantime. The pay doesn’t seem to be terrible and you can take a break from working anytime you need to work through your mental health. The downside is no benefits, but you will have flexibility to figure out exactly what you want to do without worrying about money and I’m pretty sure non-lawyers you would be interviewing with wouldn’t even know the stigma of doc review. \n\nAlso, I think you might want to look into something JD advantaged like contract work. Low level positions like contract or regulatory specialist aren’t that hard to get at they pay around the same as what you’re making now. Once you develop expertise in those fields, you can make pretty decent money in middle management positions. You just need to emphasize that you do not have plans to be a lawyer, because they will be worried about the flight risk.",
          "score": 1
        }
      ]
    },
    {
      "title": "Final interview ",
      "body": "Hello everyone! Hoping that maybe people can provide some information. I finished my final interview which was a team interview on Wednesday. Before this I had 2 interviews with the boss of the team which I thought was backwards. Typically you meet with the high ups lasts. I met with him twice and the second time I passed the EPIC test and he got back with me and said I would be meeting with his team for the final interview.\n\nThe final interview went really well I feel I had all the answers and that the guy I would be working with kept saying how he loved my answers and my background. I did everything I was supposed to, I did my follow up email thanking the team for the interview and answered all questions using STAR.\n\nYesterday I emailed the boss of the team since most of my contact has been with him to follow up to see if he had anymore information on the position. I got an out of office email until July 2nd which is today. He did respond to my email and said he wants to schedule a quick meeting. I feel this is a rejection because I had to reach out to him granted that it may be because he was out of office but I just don’t know. Also he isn’t HR but I feel he’ll be the one making the decision.\n\nWhat have you guys typically experienced when it comes to this? \n\nEdit:  He just sent the meeting now and it’s actually not a phone call like I thought it would be.  It’s a Teams meeting so if it’s a rejection it will be even more embarrassing because I’ll be on camera.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1dtvu3v/final_interview/",
      "comments": [
        {
          "body": "If you were going to get rejected, he would have just sent an email or ghosted you.",
          "score": 2
        }
      ]
    },
    {
      "title": "Can anyone share career path advice or tips?",
      "body": "First of all, I really appreciate you read this long post.\n\nAnd if this is too personal and unrelated to the topic, my apologies. I have no place to visit and ask, or someone directly talk to...\n\nI was working as a Mirth interface engineer about 6 years from 2013. And there was a career gap around COVID, which was quite a regretful years though... Then came back to work as a self-employed, which was false hope and not even well prepared :(\n\nThe problem, or my biggest mistake, is that I was fascinated by .NET MAUI and decided to create my own interface engine with C#. It was quite hard to build the monolithic app from scratch by myself, front-end and back-end all together.\n\nI don't know why, but I didn't check the job market during the development whether this will be helpful. Like living on the island where there is no internet or phone... I naively thought this would be a good preparation for my career path, but the result, which is still a prototype, is not promising.\n\nMoreover, there is almost 0 job opening on .NET MAUI windows app.... There are few MAUI + Blazer jobs, but still I'm not used to the web and cloud. (Agile, React, DevOps, CI/CD, git, kubernates...)\n\nI don't mind contract jobs, but I didn't even have an interview at all...:( \n\nSo, I cast my net a little wider by checking the interface engineer jobs. But the situation is not different from regular developers, i.e., cloud skills.\n\nEven more frustrating is, these days EPIC is dominating and related certificates are must-haves. Even relevant experience is not acceptable.\n\nAfter few weeks of job search and rejection mails, I'm quite nervous for my future.\n\nAnd even I'm not sure how long I can work with my age....\n\nAs I wrote above, my career gap might be a bad sign to the recruiters?\n\nSorry for the job seekers who struggled for more than months. \n\nAs an old man, I'm not confident about getting a job. Tried to reconnect previous co-workers, but they are not responsive :(\n\nI'm struggling to figure out what to prepare and how to prepare every day.\n\nJust honing cloud skills everyday personally? And post my personal work somewhere, like LinkedIn?\n\nI'm even thinking about publishing my app on GitHub as open source, if that appeals.\n\nAnd even is it the right approach?\n\nHow long it's gonna take, 6 months or a year?\n\nI may have a part-time job at local stores to pay my rent while doing this...\n\nLots, lots of thinking and still not clear... :(\n\nAny advice or comment will be sincerely appreciated. \n\nThank you and I hope all job seekers have their own dream jobs.\n\nOne mere developer.\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1f3obrq/can_anyone_share_career_path_advice_or_tips/",
      "comments": []
    },
    {
      "title": "Do any of you call your State House rep and State Senators offices to...",
      "body": "let them know about your job search challenges and ask what major employers are hiring?\n\nThe more people who call their elected officials, the more these issues of unemployment can be put into the forefront of their agenda.\n\nI believe this is a crisis of epic proportion. \n\nI get interviews and I listen more and talk less to learn if they are really serious about hiring. \n\nAsk, \"What did you like in my interview that interested you to contact me\" to make sure its legit and that they really read your resume. \n\n\"How long has the position been open?\"\n\n\"Where did the last person in the role go?\"\n\n\"What do you like about working here?\" \n\nYes, I call my elected officials regardless because their legislative aids who pick up the phones are in the know. They may tell you things you didn't think about. \n\nAmerica's neighborhoods look almost identical, big box stores, chain restaurants, gas stations, supermarkets....and lots of empty corporate office parks with for lease signs on them. \n\nI hope everyone has a good day. Feel free to share your comments.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1dzzfoc/do_any_of_you_call_your_state_house_rep_and_state/",
      "comments": []
    },
    {
      "title": "Diving into the Unknown: My Upcoming UX Design Internship ?",
      "body": "Hey Reddit! 👋\n\nPicture this: after a grueling six months of UX Design training, here I am on the verge of my very first internship in the vast ocean of an international company that’s a real mover and shaker. Exciting, right? 😄 But here’s the twist: during the mission briefing, I was presented with an epic overview of the UX team’s activities — heaps of focus groups, idea generation workshops as far as the eye can see, and a deluge of user interviews.\n\nBut… (and this is where it gets juicy 🍿), all that encompasses what the whole team does. And me, in all this? A humble intern with big dreams, what exactly will be my role in this saga?\n\nSo, I turn to you, wise and seasoned Reddit community, in search of your advice and stories. 📚 What specific tasks might fall to a little intern in UX Design, ready to conquer the world but fully aware of their current limitations? Will I be the hero of focus groups, the strategist behind ideation workshops, or perhaps the silent guardian of essential logistical supports?\n\n🌟 Your mission, should you choose to accept it: share your experiences, advice, and maybe even some closely guarded secrets on how to shine (or at least not fade away) in a UX Design internship at an industry giant.\n\nDo you have fail-proof techniques to add value while soaking up knowledge and experience like a sponge? Are there any ninja skills I should polish before stepping through the office door on day one?\n\nThank you a thousand times for your help and insights, which will be my compass in this uncharted jungle. 🧭\n\nLet’s rock this internship! 🚀🎉",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1b1bj0b/diving_into_the_unknown_my_upcoming_ux_design/",
      "comments": []
    },
    {
      "title": "Job offer from Epic",
      "body": "Hello, I recently got a job offer from EPIC as a project manager and the salary offer was underwhelming. The recruiter mentioned ahead of time that the salary cannot be negotiated and I have to move to Verona, Wisconsin for the job. I read a lot of reviews about the company online and they are mainly negative. Mentioning how the experience is not useful in future careers, long work hours... I am looking into other jobs right now and have interviews but was hoping for advice or any previous experience people had with this company. Also, this might not be the best idea, but there is no contract yet and start date is in 1 month so would it be terrible to accept the position for now and possibly decline in the future if I am unable to find something better before the start date?\n\n&amp;#x200B;\n\nEdit: Does anyone know if EPIC requires a contract to be signed upon accepting the offer? So can I accept and back out later or do I sign a contract committing me to the role.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/odo1ko/job_offer_from_epic/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "If the salary won’t make you happy, you should not take the offer. Is it poor even when considering that life in Verona is probably pretty cheap?",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Some advice from a recruiter...",
      "body": "For all of you out there trying to find a position? I am not your enemy.\n\nI'm fighting the fight WITH you but I'm often overwhelmed.\n\nI know you hear numbers about unemployment being under 5% but that number is skewed.\n\nUnemployment reports are based off who is getting unemployment benefits versus the total labor force. That's not the real number of people who are unemployed. Because someone is no longer eligible for UI benefits because they've been out of work too long doesn't mean they aren't still unemployed.\n\nThis month we have (in the us) 94 million people \"not in the labor force\" The U-6 is once again over 10%. You are applying as one small fish in a very large pond.\n\nCan I fix that? No. Can I help you? Maybe.\n\nStart this process by realizing I'm not your enemy. I'm trying to keep a hiring manager (who's job isn't hiring... it's to do their job but they need someone to fill a slot and they don't have a CLUE about this process or what to do) from doing something epically stupid. And I'm trying to find a way to get you through this process.\n\nLet me give you an example.\n\nI posted a job 22 hours ago and I have 324 applications. The job posting has now come down. In less than 24 hours I have 324 applications.\n\nI will be reviewing candidates and I need to find a way to have the hiring manager interview 5 people. No more than 5.\n\nHow will I make this determination? I'm not sure, yet. I will start sifting in a few hours. Will I be looking at spelling on resumes? Yes. Will I look at experience? Yes. Will I be looking at what you think you want to make for this position? Yes. (If you are a recent college grad saying you want $60K for an entry level job? You're not helping yourself. This position is going to be about $19 an hour / just shy of $40K if you don't work overtime )\n\nYou think your life is frustrating when you apply to a few hundred positions in a month? I get a few hundred applications a DAY for one position. I am honestly trying to filter the best candidates for the role and I might not always call every person who applied (Who am I kidding? I can't call over 300 people and tell them why they didn't get an interview... I just CAN'T... Heck, half of you applied from a \"quick apply button on careerbuilder\" and don't have a clue what you applied to. &lt;- whoever invented the quick apply button hated recruiters and hiring and never wanted to help you get a job, just FYI)\n\nSo.. if you want to better your chances? Do this\n\nSubmit your resume as a *.doc (No one is going to change your resume. Our systems like Docs. You won't have to copy and paste as much. And we can search and find your resume later. A PDF looks like a picture to most ATSs and you just jumped into a black hole of resume hell if you sent in a PDF)\n\nStop sending recruiters to voicemail. If you see a phone number you don't recognize? ANSWER THE PHONE. Don't send me to voicemail if you can answer. I have 3 minutes before my next conference call to try to talk to you. ANSWER THE PHONE.\n\nCheck your email. When you ignore my call I will send you an email. I have a very limited amount of time. Calling me or replying 3 weeks later won't help you. The job has been filled.\n\nStop trying to play games with me. I'm a recruiter. I do this for a living. I can smell BS a mile a way. I am asking your questions for a reason. Don't try to play with me so you can get the upper hand. I do this FOR A LIVING. You don't. I will win. You won't get a job.\n\nSTOP STALKING ME. I do have caller ID and calling me 20 times when I'm trying to run a conference call WILL make me look up your phone number and disqualify you from the process because you're apparently unable to leave a voicemail and WAIT. I WILL DQ you from a position (even if you look like a rockstar on paper) because you are completely incapable of listening to my outgoing message that says \"please leave a message and I will return you call\" OH - And I'm a recruiter! REMEMBER that I don't spend my entire time in the office. I often have you forwarded to my cell phone. Calling me 11 times on a Sunday? That's not going to win you points. You're not eager. You're not realistic in your expectations. \n\nDitch the cover letters. Unless you are asked for one? No one will read it. I can read your resume in less than 7 seconds. No one wants to read your life story. Your needs? I don't care. Answer the questions you were asked. Upload your resume and fill in the blanks. DO NOT try the \"I will submit my resume when I am offered an interview\" tactic. \n\nRemember - I find people for jobs. Not jobs for people. My main goal is to put a qualified butt in a seat. If you are skilled? I'll help you. If you are demanding and think you're special? You'll get passed over.\n\nYou are not special. You are one of 324 who applied in 22 hours. I'll get to you when I can get to you. I am not supporting 1 job. I usually have 30-50 open positions at any given time. \n\nDO THE MATH. 50 positions times 300+ applications =s 15,000 people to deal with. When you call me and say \"This is Lisa. I applied for a job you posted. I'm looking for an update.\" &lt;- UM... you need to give me a freaking HINT on who you are, what you applied to, and why you are calling me a few days after you applied.\n\nIf this is supposed to be your job? You'll get it. If it's not? Calling the hiring manager or stalking me on LinkedIn or by email or via voicemail isn't going to do anything but lessen your chances.\n\nI have 42 voicemails from this weekend that I get to listen to in 4 hours. 42 voicemails Xs 2 minutes each? I will spend an hour and a half just listening to people call me and leave a name and a number to ask for an update or tell me they're really interested in their position. Then I can get to work\n\nTL:DR - getting a job is like getting a date. Don't get stalkerish and weird. Don't lie. And don't ask to get married the first time we talk. And be patient. If you are the best qualified applicant? You will get the job. \n\nStop hating on recruiters and stop trying to do the run around. That will help you in your search. \n\nApply - fix your linkedin - and don't think you are owed a job because you think it's \"perfect\" for you. This is the dating game. Don't be a creeper and STOP STALKING HR AND THE HIRING MANAGER. There is a process. Learn to WAIT. This takes a minute.\n\n*Rant over*\n\n\n\n",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/4iipy7/some_advice_from_a_recruiter/",
      "comments": [
        {
          "body": "I agree with the vast majority of this but I do have a few issues. FYI, this is from the hiring manager position (as opposed to recruiter) primarily in organizations where the hiring manager does everything but the final hiring paperwork.\n\n&gt;Ditch the cover letters. Unless you are asked for one? No one will read it. I can read your resume in less than 7 seconds. No one wants to read your life story. \n\nThis one actually really bothers me. When we post a job, particularly for an entry-level position (which your rant seems to be aiming at), 95% of the applicants are completely qualified for the position (and the non-qualified are easy to weed out). This means that we end up with hundreds of nearly identical resumes. The only differences are where the applicants went to school (not particularly important), and their previous work experience (if any). \n\nThe cover letter is the main thing that sets applicants apart and is completely invaluable. The resume only tells me if someone is qualified, the cover letter tells me whether or not I actually want to deal with the person.\n\n&gt; Submit your resume as a *.doc (No one is going to change your resume. Our systems like Docs. You won't have to copy and paste as much. And we can search and find your resume later. A PDF looks like a picture to most ATSs and you just jumped into a black hole of resume hell if you sent in a PDF)\n\nYou, or your employer, need to get with the times if this is the case. PDFs are *the* format for important documents. It's all well and good that \"no one is going to change your resume\" but that's hardly the only reason for using PDF. Docs often get completely messed up when opened with the 'wrong' version of word processor, they also rely on a proprietary software (Microsoft Office) that not everyone has access to. Further, a lot of your rant is about how much time everything takes, well PDFs are almost always smaller files than docs, making them faster to open and faster to download. Black-holing applications because people used the right format for the job (instead of the one you happen to like) is idiotic.\n\nLike I said, I agree with most of what you said, but those things seem really wrong to me.\n",
          "score": 7
        },
        {
          "body": "LOL. This fucking guy",
          "score": 7
        },
        {
          "body": "[deleted]",
          "score": 10
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "I agree with most of this.  Recruiting is a super challenging industry and function, one of which people don't appreciate.\n\nHowever, even when on the job hunt I do not answer unknown numbers (all though this is usually because I am busy, or in a loud location, or at work and I think it is rude to run out of a meeting to try and answer the call).  What I find works well for a recruiter is to leave a message and say \"I am available from XX to XX today, and it would be best for you to call then.\"  I ALWAYS make sure to call the recruiter back at that time, because I understand how busy they are.\n\nAnd, as for contacting those who applied but didn't get it, I totally understand that.  I think most people get upset when they make it past a couple of rounds and don't hear anything.  I applied to a F500 company, made it to the final round, and heard nothing from the company!  This was after 3 rounds of interviews over 3 months, and not even the sense to email me and say \"we went with someone else, good luck on your career search!\"\n\nThat's rude, no excuse!",
          "score": 1
        }
      ]
    },
    {
      "title": "Previous manager won't give my girlfriend a reference - advice needed",
      "body": "I am writing this on behalf of my partner - she's having the work issues but I am running out of ideas on how to advise her.\n\nThis is might be a long one so apologies for length.  Plus, I should add, this is everything I have been told from my girlfriend's perspective, so happy for people to play devil's advocate.\n\nMy girlfriend started a new job at the start of the year, as maternity cover, at a university.  Prior to that, she'd been at the same company for 6 years (interrupted by a year maternity leave), during which she was promoted several times.  And prior to that, she has been a longstanding employee at several other jobs.  I would say she is a model employee.\n\nShe left at the end of 2018, for a new challenge, and soon started the new job.  She was trained up in the role by the lady for which she was covering.  The role was, in basic terms, preparing for an event happening about 4 months from her start date.But after that lady went on her own maternity leave, my gf soon learned a few things about the role:\n\n* No-one, other than the lady now on maternity leave, seemed to know what was expected of the role, in terms of procedures or outcome.\n* The role was unique to that university - very few, if any, other universities have a similar role.  It's incorporated into different departments at other universities, so using another university as a gauge as to what was expected wasn't an option.\n* My gf wouldn't have a manager for a couple of months, so she was pretty much left to figure things out, unguided, and instigate programmes and procedures for which she had basic training.  Which naturally led to errors.\n\nSo my girlfriend, for the first couple of months, felt undersupported and undertrained.\n\nShe then got a new manager after a couple of months.  This manager was promoted from within the university, from another department.  As much as I know about her, I would say she is a yes person.  Tells the bosses what they want to hear to cover her own back.  A jobsworth.\n\nThings got difficult with the manager really quickly.  Errors started popping up in the run up to the event.  the manager would expect my GF just to perform tasks for which my GF had no training.  When my GF asked her new manager for extra support, or if she could come in on weekends or work late, to prepare for this event, every request was met with a 'no' with various different reasons.\n\n3 months passed in the job and my GF had her mandatory probationary period review.  And in that review the manager tore her apart.  Basically said my gf was underperforming drastically and if the manager didnt see any improvement, she'd seek to terminate her employment within 3 weeks.\n\nThe list of complaints (which I saw) were insanely detailed and epically long.  Like the manager had been detailing every error as they happened to cover her own back, rather than try and solve the issues as they arose with my gf.\n\nMy GF asked for a meeting with HR, in which she gave her own version of events (no support, refusal to requests).  Naturally, as you would expect, the manager disputed this.  Which left my gf felt like she was facing a path of being let go in 3 weeks.  If she was unsupported in the run up to this meeting, why would she be supported in the next 3 weeks, in an effort to save her job?\n\nSo she resigned - she had my full backing to do it.  She wasn't happy.  Why stay in a job if you aren't happy?\n\n&amp;#x200B;\n\nThat was about 2 months ago.  My GF has since been looking for work.  She has had a couple of promising interviews.  One company was very interested.  Practically offered her the job.\n\nThey asked for her references, to which she gave several.  But then the hammer blow - 'we'd also like a reference from your previous manager'\n\nI think you can guess what happened next - my girlfriend, reluctantly, contacted the manager to ask for a reference and the manager refused.\n\nAnd the job offer was rescinded.\n\nSo my question is:  is there anything she can do in future (or to respond to this job offer that was rescinded)?  How can she broach this with future employers?  It's frustrating to think that this one terrible experience might hamper her work opportunities.\n\nOr should she considered short term contracts so she then has more recent managers to call on for references?\n\nCheers for any advice.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/cwuhyf/previous_manager_wont_give_my_girlfriend_a/",
      "comments": [
        {
          "body": "First, I feel for your girlfriend. She was put in a terrible position. \n\nSecond, I just quit my job of almost 14 years for many of the same reasons. Screw companies that don’t give any support or training or guidance to their employees. Seriously. Screw them with a ten foot pole.\n\nThe only advice I have, if your girlfriend isn’t comfortable telling prospective employers the out and out truth, is to say something like “my manager and I didn’t agree on the culture of the team” or “we didn’t agree on the path forward.” I’m not being eloquent (not my strength but hopefully you get the drift.\n\nAnd last, good for you for having her back. At times, I felt like I was crazy or maybe I was the only one seeing things clearly. I doubted myself for a long time, and I regret it. I quit one week ago and I feel so free of the toxicity and clown show that occupied every day of my life. I’ll never work in a place like that again. I’ll bag groceries or work at Starbucks, before I’ll work in such a dysfunctional environment again. No amount of money is worth that stress (and I made good money). \n\nGood luck to your girlfriend. Her dignity and integrity are worth more than whatever that place was paying her.",
          "score": 1
        },
        {
          "body": "The phrasing I used more than once was along the lines of \"I had been doing the job successfully for x months when I got a new manager. Within y weeks it was obvious that she and I had different ideas about what my job was and how to do it. I made several attempts to come to an understanding with her, but to no avail. Since I could see the writing on the wall, I chose to leave and pursue my next great opportunity.\"\n\nEssentially you are signalling that the reference given would not be favorable. Should that come to fruition, it shows the company you are honest and realistic. Any truthful  negatives shared by the ex-manager would effectively be canceled out.",
          "score": 1
        },
        {
          "body": "&gt;So my question is: is there anything she can do in future (or to respond to this job offer that was rescinded)? \n\nWhat did she say when they asked for \"reference from your previous manager\"?\n\nIt is okay to give one of the previous managers (ask them) from when she was a model employee.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is working at Epic System worth it?",
      "body": "I applied at Epic System and I don't know lock about coding. I did the assessment and I am sure i failed all the questions including math. The role introduction/interview is coming up soon this week. If it works out I might have to move out of state. I did some research and I saw people saying at it's not worth it and i don't even know the pay for the job position I got. \n\nI currently have to jobs and will have to quit to move. I don't want it to be a wait to time and money if it doesn't work out.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1luszh2/is_working_at_epic_system_worth_it/",
      "comments": [
        {
          "body": "You did your research and people are saying its not worth it. Trust your gut as you stated you have to quit two jobs.\n\nAlso since you stated you don't know coding I would not waste time with this role or make any life changes if you have no coding experience. There is a ton you have to know past the intro interview. They will test you on the coding too.",
          "score": 2
        },
        {
          "body": "Epic Systems is a mixed bag that really depends on what you're looking for in your career right now. The company is known for intense work culture, long hours, and high turnover, but it also provides solid technical experience and looks impressive on a resume. Many people use it as a stepping stone to better opportunities, especially in healthcare tech. The pay is typically decent for entry-level positions, though not exceptional, and they do provide relocation assistance. However, if you're already struggling with the technical assessment and have zero coding background, you might find yourself overwhelmed once you start, which could make the experience more stressful than beneficial.\n\nGiven that you'd have to quit two jobs and move out of state, this is a significant risk that requires careful consideration. The fact that you're unsure about the pay and role details is concerning - you should definitely clarify these specifics during your upcoming interview before making any decisions. If you do get an offer, negotiate for as much information as possible about expectations, training timeline, and compensation. The interview itself will likely focus on problem-solving abilities and cultural fit rather than deep technical knowledge, so prepare for behavioral questions and scenarios about handling pressure and learning quickly. I'm on the team that made [AI for interviews](http://interviews.chat), which can help you navigate these types of challenging interview questions and prepare responses that highlight your adaptability and learning potential.",
          "score": 1
        },
        {
          "body": "Epic's got a mixed rep - great training but notorious for burnout and long hours. If you bombed the assessment that badly, they'll probably figure that out in the interview.\n\nMoving out of state for a role you're not qualified for while leaving two jobs seems like a huge risk. I'd keep interviewing elsewhere while you wait to see if this even pans out.\n\nWhat's drawing you to Epic specifically? There might be better paths that don't require such a big leap.",
          "score": 1
        },
        {
          "body": "did you cleared interview??",
          "score": 1
        }
      ]
    },
    {
      "title": "how does one get a decent job at a university?",
      "body": "i been wondering how people get decent staff jobs at universities. to me it seems like these jobs are based on three criteria. \n\n1) you have a masters degree / been in the field for a long time\n2) you have some connection to the people at the university.\n3) you have to be a ga/ta and then get a job after your masters\n\ni been applying to some student affairs jobs at a major university in the south nearby me and its been an uphill battle. whenever i go to talk to the department about the positions they have available, they just point me at hr and i never hear back from them. nobody is interested in hiring you on the spot, you have to wait for them to review every single person who applys (or as they say) and if your lucky and win their lotto, then you get one interview to even have a shot at the job. it doesnt matter what my actual experiences are or who i am, they dont seem to care unless im like superman, which in that case i dont get why they think i would only take 25-30k in salary. what makes really no sense is how the job descriptions say \"bachelors / vague experience is needed\", which i more than qualify for. i would really like to work at a college for a bit since i enjoy helping students and its a pretty decent job pay and benefit wise, but this is painful wasting any time on an application if i have zero chance.\n\ni feel like one of the problems is that i am applying to major schools and due to the bureaucracy, its impossible to have any real interaction. shit i have even applied to the local community college and never heard from anyone. i know that i am not that unqualified since i graduated from college and spent a lot of time doing things in student affairs so i have a good amount of experience of what they are looking for. these arent really complex jobs i am applying for either. i am applying for crap like being an general studies adviser or working in housing. it doesnt take some epic human being to do any of this stuff.\n\nhow has anyone (if anyone) gotten an entry level job through a university when there is so much bureaucracy that one has to get through? do i have to just settle for a smaller school somewhere else or do i have to be a grad student who takes a ta/ga job and then gets a job? feels just having a bachelors and a bit of experience isnt good enough to run a simple office job at a school. i feel too since universities belong to the government that its impossible to work for them unless you have some good connections.",
      "subreddit": "jobs",
      "score": 13,
      "url": "https://reddit.com/r/jobs/comments/3xb47b/how_does_one_get_a_decent_job_at_a_university/",
      "comments": [
        {
          "body": "I have an M.A. and I am a TA - have been for almost 3 years - and I'm still struggling to get entry level. \n\nThe truth is, unless you have a graduate degree specifically in Student Affairs or Higher Education Administration *and* relevant experience in the specific department you want (admissions experience for admissions, advising experience for advising, student life experience for housing) it's incredibly difficult. \n\n\nIt's not about connections, it's about the fact that for each job posted there could be up to 100 applicants, and most of them will have a relevant graduate degree and direct experience. Entry level jobs in academic affairs are very competitive, since most colleges pay well, offer good benefits, and you can easily build a career. \n\n\nYour totally dismissive attitude about graduate degrees is exactly the opposite attitude they're looking for. Dude, it's higher education. *Of course* they value graduate degrees. That's literally their industry. They want to see a commitment to it, and to higher education in general. ",
          "score": 5
        },
        {
          "body": "See if they have a temp pool, that's how I got in (after 6 months, I was made permanent) Their temp pool was within the university not an outside organization.\n\nGood luck!",
          "score": 3
        },
        {
          "body": "I have what I consider to be a decent staff job at a university, which I got with just an undergrad degree and very little experience. I did go to undergrad at that university, and one of my references was a professor there, but the job was in a separate administrative department and he wasn't actually acquainted with anyone on the hiring committee. It's a large public university so there is definitely a lot of bureaucracy. For months I applied for every job I felt reasonably qualified for and got nothing more than a (very slow) string of automated rejection emails. The only job where I got any further than that was the job I ended up getting.\n\nAt least at my school, I think if you have some connection to the school (alum or internal applicant), it's significantly easier to get an advising job without a master's degree. However, even when none of the applicants are internal or alumni, my office would never hire someone we didn't know on the spot and I don't know why you'd expect anyone to do so. \n\nAre you considering behind-the-scenes jobs or only student-facing jobs? If you can bear a \"stare at a screen all day\" job for a while, that might be easier to get and then you'd have your foot in the door for advisor jobs as an internal applicant. My job is in a central administrative office that deals with every academic department, and if I wanted to get a job in an academic department, I feel like I'd be a versatile candidate since I've now learned a bit about every department, and it's good networking since I know someone in every department just by doing my job. I know at least two people who used to work in my office are now advisors in academic departments.\n\nAlso, how much experience do you have working with faculty in a capacity other than just being a student in their class? If you have any, play it up in your applications. ",
          "score": 1
        },
        {
          "body": "Decent Job =\\ University.  \n\nSorry I don't know how to do the not equal sign.  ",
          "score": 1
        }
      ]
    },
    {
      "title": "So, I am 16 years old, no car, no work experience. help with my first job?? ",
      "body": "I have an amazing resume (below) how does one get a first job?? I need help in order to save for college, also for dates and such, I applied for gamestop and blockbuster and i will not work for fast food or wal-mart. end of story, they do not care about their employees and i would rather be in a happy environment. I have already called and been persistent with both stores and I am considering applying for a job at the local pawn shop (family owned) what are good jobs, i do have a snagajob. Help?? \n\ntl;dr: ap classes, football team, computer geek, social skills, lots of service/volunteer\n\n**The most EPIC resume you have ever seen from a person with no employment history** \n\n\n**Giantchar20**\n\n\n**123-456-7890 0 East 0 South, derpville, Utah, 12039**\n\n\n**Objective**:\n\n\nMy objective is to obtain my first job at a retail store for weekend work, to obtain positive references for future jobs, and to earn and save money for college. \n \n\n**Intrapersonal, Interpersonal Work and educations:** \n\n•\tOn the Youth Football team during 7th and 8th grade\n\n\n•\tOn the Freshman Football team\n\n\n•\tCurrently on the High school Football team (out for the season due to a torn ACL)\n\n\n•\tCurrently in AP Biology, AP English, and Medical Anatomy \n\n\n•\tPreviously enrolled in AP US History and AP Chemistry\n\n\n•\tPreviously enrolled in Honors English 10 &amp; 9, Honors world history, Honors World Geography, &amp; Honors Biology. \n\n\n•\tPreviously in FBLA, (sophomore year) \n\n\n•\t1st class Rank in Boy Scouts of America\n\n\n•\tAbility to care for people with special needs (class in school) \n\n\n•\tI speak French, English, and Geek.\n\n\n•\tTook a basic computer tech class, 3d animation class, and learned HTML5 and CSS3 from youtube. \n\n\n•\tAdvanced knowledge of Computer use and structure\n\n **Volunteer work:**  \n\n\n\n•\tBoy Scouts of America volunteer work including:\n      \n\n  o\tMentally disabled citizens assistance.\n\n\n  o\tCommunity, roads, and parks cleanup.\n \n       o\tWildlife conservation assistance.\n        o\tAssistance to the needy and poor by gathering food, money, and necessities and stocking our local churches storehouse. \n         o\tAssistance to the military in Iraq &amp; Afghanistan by both making and obtaining cards and then sending them.\n\n\n•\tToys for tots assistance\n\n\n•\tBear hugs for kid’s assistance\n\n\n•\tHelping build an orphanage in Uganda by selling necklaces and baskets made and sent over by the children, (partnered along with Starbucks coffee) \n\n\n•\tHave fixed various computers via posts on craigslist for underprivileged and needy people. \n\n\n **Computer skills:** \n\n\n•\tProficient in Microsoft word, Microsoft Powerpoint, Microsoft Excel, Blender, Google Chrome, Internet Explorer, Firefox and Opera. \n\n\n•\tI can Type at 40 WPM \n\n\n•\tProficient with Windows XP, Windows Vista, Windows 7, Snow leopard, Tiger, and Lion \n\n\n•\tMalwarebytes Antimalware, Avast Antivirus\n\n\n*“Hire me, and various dreams of yours will come true” (Offer is subject to change, restrictions apply)* \n\nedit: I accidentally a word\n",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/116970/so_i_am_16_years_old_no_car_no_work_experience/",
      "comments": [
        {
          "body": "Reorganize your resume headings.  Split it up into\n\n**Objective** \n\nTake out the first person language.  Just say \"To to obtain a part time job at a retail store that values hard work and flexible employs while building relationships with management, employees and, customers alike.\" Or something. Be a little vaguer and use more business jargon. Some companies might nix you if they think they can't have you any on weeknights and you want to get a face to face interview and make them love you before you go over scheduling details.\n\n\n**Education**(Big and Bold)\n\n*John Smith High School Class of 2014* Put Highschool info here \n\n*Relevant Course Work* here(personal finance or intro to marketing or something like that, whatever is relevant to a retail job.\n\n*Special classes here* (all your APs and your special needs class)\n\n**Activities**\n\n*Boy Scouts of America*\n   \n    -First Class Rank\n    \n    -Wildlife conservation assistance \n    \n    -Blah blah this project that project \n    \n     -Toys for tots\n\n*Varsity Football*(leave out youth football it's not relevant at this point)\n    \n     -Team Captain(you may not have been but you see this is where you add in details about this activity)\n\n*Any other club or activity you think is worth putting on there*(but not just any old thing)\n\n**Skills**\n\n*Computer Skills*\n    \n    -Clean this up a lot.  For example just put proficient with Microsoft Office suite don't list the whole thing out\n    \n    -Type at 40 words per minute\n    \n    -Proficient with Windows and Apple operating systems\n    \n    -Whatever computer skills you have that *actually* set you apart, every dumbass can run internet explorer that's not an appropriate thing to put on a resume it just makes it look like you're struggling to find good things about yourself\n\n*Language Skills*\n     \n    -Fluent in English, French, and I hope you meant Greek because it's highly inappropriate to put \"Geek\" on there.\n\n*General Skills*\n     \n     -Other things can go in this basket or if you have that many skills you can make other skill categories, really simplicity is key here the simpler the better.\n\nYou need to clean it up and trim it down.  It should be crisp, organized and absolutely a page max.  Don't speak in sentences(except for the objective) - more in bullet points.  The big business men don't have time to read your life story they want quick data bytes.  So when you talk about \"Helping build an orphanage in Uganda by selling necklaces and baskets made and sent over by the children, (partnered along with Starbucks coffee)\"  Don't type that put \"Uganda Orphanage Foundation Project\" or whatever your troop called it.  Then let them ask about it in an interview or bring it up in your interview if they ask about something related to it(maybe they ask about leadership skills or organizational skills you may have you could say \"oh as you see on my resume I was a part of this project where I did xyz which helped me learn to communicate and lead better\") don't just spell it all out right out in front they don't wanna read it all like that it comes off unprofessional.  \n\nChange your categories to Objective, Education, Activities, Skills and Volunteer Work and really if you feel like it's reaching(maybe some of your older activities or classes you took a while ago) just take it out.  The more concise and relevant the resume is, the better.  Employers don't just want a laundry list of kind of good things you've done they want specific, relatable, relevant examples and reasons as to why you're **awesome** for this job.  Take out the quote at the end, I don't know who told you that's a good idea but it's not scrap the entire *“Hire me, and various dreams of yours will come true” (Offer is subject to change, restrictions apply)\"* if that's actually on there.\n\nI'm in the process of graduating college and have nabbed 5 interviews so far from various career fairs and opportunities through my school.  I'm in a class in our College of Business that is specifically designed to help you get a job and we spent 4 weeks on resume building so I'm just passing along things I learned in class. \n\nSo yeah, clean it up, trim it down, make it as professional and simple as possible and come back and let us help you prep for you first interview! Good luck!",
          "score": 3
        },
        {
          "body": "Seems like you're on the right track. Good luck with gamestop and blockbuster, those are frankly the best jobs you can hope for at your age and experience level.\n\nIf you don't wind up working at either of those places, try applying for host or busser positions at restaurants. If all else fails, don't rule out fast food or Walmart. There's no shame in working those jobs when you're 16, and a paycheck is a paycheck.\n\nLooks like you're kinda into computers. Keep going with that.",
          "score": 2
        },
        {
          "body": "Did I miss it? What do you want to study to become?",
          "score": 1
        },
        {
          "body": "I currently work at McDonald's and they're one of the best jobs I've had (am 23). As a company they're great and my manager is very fair and professional. You're going to get both great and shitty managers at both great and shitty companies. Even wal-mart isn't that bad. Most of their issues come with overtime-related stuff, and as a minor that wont really be a problem for you.\n\nJust saying. You can be picky and choosy if you want, or you can be employed ASAP. And it's not like you have to stop looking once you get a job.",
          "score": 1
        },
        {
          "body": "boy scout camp. they pick up people easily. free room and board. but the pay is bad. I worked at tanah keeta for my first job at age 16\n\n**if you want a summer job you have to start applying during spring break** \n\ni gave out 100 resumes and applied to 150 places before i got a job offer at 18 so just work at it. \n\nedit: dont expect a job from any chain store like McDonald, gamestop, blockbuster. They hire but they are swamped with applications so it can be months before they finally hire you. if you have the time to wait then go ahead and apply.\n\nEdit Edit: teachers spend 100% of their time with 16 year old kids who live in your area, they know where to find jobs for kids. ",
          "score": 1
        },
        {
          "body": "I would remove the quote at the end. Also the future jobs reference needs to go. \n\nYour experience area is too big. Only need all football experience in 1 line. \n\nAlso too much wasted space for AP classes. Say something like \"AP Classes taken: (list)\"\n\n",
          "score": 1
        }
      ]
    },
    {
      "title": "Burnt Out &amp; Interview Brain Freeze: My Epic Interview Fail",
      "body": "Man, I was on fire cranking out resume after resume, cover letter after cover letter—like hitting wings one after another on Super Bowl Sunday! LOLOLOL! I was desperate, almost out of a job, and totally burnt out.\n\nI stopped keeping track of which resume or cover letter I sent where. I just wanted to submit applications 24/7, but still keep the quality good enough for my own hiring standards. I’d name my resumes after companies and cover letters after recruiters or hiring managers—sometimes even gave them nicknames. Yeah, it got messy. Imagine the chaos!\n\nMy epic fail? One day I had three back-to-back interviews, no time to prep, totally fried. The interviewer says, “Alright, I’ve got your resume here—tell me your story and why you’re a fit for this role.”\n\nAnd… my mind went totally blank. I was scrambling, trying to remember which version of the resume or cover letter matched this company or recruiter. I straight up told them, “Honestly, I can’t remember the exact position or company. I’ve applied to so many places and done 10-15 interviews recently.”\n\nI blew it! Hahaha! Now, six years later, I can laugh at it—but man, it felt like a nightmare then.\n\nLesson learned: keep your materials organized and don’t burn yourself out.   \n  \nWhat’s your most memorable interview or resume fail?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mnzr6z/burnt_out_interview_brain_freeze_my_epic/",
      "comments": [
        {
          "body": "Man, this place is quiet. When I bombed my last interview, I practically wanted to tell the story to anyone with ears. 😂 Either you all are acing every question… or you’re holding out on me. Spill your best fail story?",
          "score": 1
        },
        {
          "body": "AI generated slop tends not to get much traction",
          "score": 1
        },
        {
          "body": "I had an interview yesterday for a job that I applied for on July 8th. I was not prepared and butchered the interview lol",
          "score": 1
        },
        {
          "body": "Just remembered another one.. I bombed hard this other time at my buddy’s software startup. Lol I was working as a senior data scientist transitioning to a managerial position so I was mostly planning and directing and it had been a minute since I did hands on full-stack..\n\nSo this one week I almost rage quit and called up my buddy for a possible gig and he introduced me to the team and got me a shot to interview so the team could see if I was a fit right?\n\nMan I bombed bad! Got handed an SQL test and some AWS-specific devops challenges and all that good stuff and I failed miserably since I was not prepared at all!! \n\nThen to top it off I was swamped with work so didn’t get to showcase my coding with the ‘interview project’ they asked me to complete! 🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview - an epic fail",
      "body": "I totally bombed my interview! 😭 I figured it'd be a breeze, like chatting with a buddy, so I didn't stress. I was even early and super prepared, having researched the company and the role.\n\nThen, bam!  First question: \"Tell me about yourself.\" I started my spiel about my professional experience, but he cut me off wanting to know about *me*, outside of work.  My mind went completely blank. I wasn't ready for that at all. 🤦‍♀️ Not only that, I felt that I have not showcased my strengths. Anxiety really kicked in. \n\nHow do you deal with this kind of thing?  I feel like I can't think that quickly. #InterviewFail #JobHunt #Nervousness #BrainFreeze ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1jv807m/interview_an_epic_fail/",
      "comments": [
        {
          "body": "just sounds like to me you need to prepare more. Treat every interview process, doesnt matter if you think or know if its casual or professional, treat it professional. Practice al lthe necessary things down well, like intros, experiences, resume, portfolio, case studies, questions you will ask, etc...  \nBut yeah dont feel too down, use it as good experience to fuel for your next!",
          "score": 2
        },
        {
          "body": "So they pulled the outside of work \"Tell me about yourself\" question. That sucks. They did that to me on the 2nd interview after the 1st interview I explained my professional experience. I had to change it up a bit about how I got myself into IT and have the passion of it.",
          "score": 1
        }
      ]
    },
    {
      "title": "Bodged",
      "body": "Has anyone ever failed an interview so bad that they've had to retract themselves form the process.\n\nWell that just happened to me today, I was interviewing for a senior position which is directly accountable to ministers and to directors of DEFRA.\n\nPart of that was a simple 5 minute presentation based on an appropriate question, something I've done a million times.\n\nAnyway, today my brain decided to melt and I completely frozen, lost my chain of thought and couldn't form sentences.\n\nOnce I'd composed myself I apologised profusely and withdrew myself from the process and thanked them for their time.\n\nI didn't see the point in carrying on as I'd already failed on an epic scale.\n\nWorst thing is that I do this sort of thing almost daily 🤣.\n\nI'm praying it won't have any reputational damage.\n\nBeating myself up pretty badly as I should, but there's a lesson somewhere to be learnt surely 😅.",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1oue8kp/bodged/",
      "comments": [
        {
          "body": "Hmm instead of withdrawing, couldn't you have powered through and let the company dismiss you?\n\nI've \"bombed\" many interviews only to be told they liked me and moved me to the next stage.\n\nSeems like you may have overreacted here",
          "score": 1
        }
      ]
    },
    {
      "title": "Ran into First Interview in Bathroom but they didn't wash up. awkward handshake followed.",
      "body": "tl;dr: same as title, lol.  \n  \nThis happened super early in my career.  I showed up for a final in-person interview a little early and decided to hit the lav so that I'd be comfortable during upcoming chats.  \n  \nWhen I finished up, I washed my hands (because I wasn't raised in a barn).  Roughly the same time, a dude walked out of one of the stalls, grunted \"hey\" in my general direction and then exited.  End of interaction.    \n  \nI went back to the lobby, and then a few minutes later, the receptionist said, \"Mr. Dergle?  Your first interviewer is here to get you started.\"  \n  \nIt was the dude from the bathroom.  And when he reached out to shake my hand, I suddenly realized that he had exited the bathroom- specifically a poop stall IN the bathroom, without washing his wiping hand.  Which was now extended in my direction.  \n  \nI looked at his hand.  He looked at his hand.  We made brief glancing eye contact.  Looked down again.  He pulled his hand away just slightly...  And then I just fucking reached out and grabbed it and said \"Nice to meet you. I'm Henry Dergle.\"  \n  \nThe interview went well, but if there had been an outsider who was aware of preceding events in the room, it would have been obvious to them that we both kept that handshake and the reason for it being awkward in our minds as we talked.  \n  \nIn the end, they offered me the job- but I turned it down because that would have been my new boss.  And a) I would never be sure if I got the job because he was trying for some kind of weird redemtion arc, and b) I had already given him the nickname \"Poop Hand Paul,\" and I didn't want to work for a guy named Poop Hand Paul.",
      "subreddit": "interviews",
      "score": 12,
      "url": "https://reddit.com/r/interviews/comments/1nhjs6l/ran_into_first_interview_in_bathroom_but_they/",
      "comments": [
        {
          "body": "One time after an interview, I was at the bathroom sink, doing my thing. Then my original interviewer came out of a stall, looked me in the eye, and walked out without washing his hands.\n\nI was so grossed out, I almost couldn’t finish jorking it.\n\nOther than that, I think the interview went well.",
          "score": 1
        },
        {
          "body": "I read this as a nostalgic epic about the days when you could afford to refuse jobs over things like poop hands lol.",
          "score": 1
        }
      ]
    },
    {
      "title": "Follow up call fail",
      "body": "Applied for a role, was able to see there had been 358 applicants, got the initial screening call of 15 minutes from recruiter which then led to an in person 30 minute with senior team member and recruiter. I did the thank you email and got the invite to interview with founder. It got bought forward a day and it was virtual with founder and senior member. \n\nThe call went for 2.5 hrs, there were some actual scenario type questions but mainly it was vibe check and there was a lot of laughter. \nSafe to assume I'm in the final choices, right? Sent a follow up email advising I'm very keen and feel free to reach out with any follow up questions. \n\nThe senior team member calls me at 6.45pm (1.25hrs after this epic call has ended) whilst I'm cooking dinner for my child and my brain is mush. She hits me with 5 interview type questions and I fumbled hard as I didn't have my notes and prep, heck I was already in my PJs.\nI think I done screwed this one up. I feel sick as I was on such a high. \n\nPlease reassure me, is there any way back from this?",
      "subreddit": "interviews",
      "score": 18,
      "url": "https://reddit.com/r/interviews/comments/1lwinjf/follow_up_call_fail/",
      "comments": [
        {
          "body": "yes there’s a way back  \nbut you gotta move fast\n\nsend a short, sharp follow-up tonight  \nown the stumble without groveling  \nsomething like:\n\n\"Appreciate the unexpected follow-up today and sorry if I seemed a bit off—was in full parent mode. I’d love the chance to clarify a couple thoughts I fumbled. This opportunity still excites me and I’m happy to chat again if helpful.\"\n\nshows you’re human, self-aware, and still in the game\n\nrecruiters don’t expect perfection  \nthey want momentum, clarity, and accountability  \nthis doesn’t erase a great 2.5hr call  \nit’s just a plot twist  \nrecover with poise\n\n[NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some sharp takes on interview recoveries and momentum shifts worth a peek",
          "score": 12
        }
      ]
    },
    {
      "title": "How to avoid interview red flags",
      "body": "I was chatting with my intern friends recently, and also saw some related posts on reddit. I would like to share some interview advice from the perspective of a \"recruiter\".\n\n1. Don't go into \"details\" about yourself. Recruiters don't need a candidate's entire career history because it's all on their resume. They're interested in understanding your motivations and relevant background.\n\n2. Prepare stories that are **relevant** to the job you're applying for. Many people prepare the same resume and the same set of stories for a certain industry or position. Use a gpt interview coach or beyz interview assistant to prepare for the interview. The STAR method helps a lot. It's not hard to come up with some work experiences that can be discussed within this framework, and it makes you more confident without sounding boastful or boastful. **But don't think that training yourself to be fluent with an interview assistant is the end. **\n&gt; I usually make a point to stick to the present and the now, but some people sound like they prepared a speech in advance and they completely ignore this issue.\nPreparing for the interview is good, but in the actual interview, always remember to \"apply\" your skills to the job you are about to get. For example, if you are a designer, when you talk about your portfolio or design concept, please remember to add a sentence: Based on this idea, I think the next design style and direction of XX product can be like this; from my previous job, I found that this design can gain user popularity, expand product exposure, and solve the current problems of Y company. etc.\n\n3. Don't make up false information.\n&gt; \"Have you made any major mistakes?\"\n\nThis question is to check whether you are a normal person (fire hydrant question in interviews), but many people miss the point of such questions.\n\nNo need to cite those crazy or outrageous examples. This is not the point. They want to **assess your personality and work style to see if you are suitable for this team. **\nWhen recruiters interview someone and ask them to tell a mistake they made and how they dealt with it, they don't want to see a dramatic epic.\nThey want this person to make mistakes, recognize and accept mistakes, **find solutions, and gradually grow and learn. **",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1kqnnjt/how_to_avoid_interview_red_flags/",
      "comments": []
    },
    {
      "title": "Weirdest Interview Ever",
      "body": "Recently I applied to a company that somewhat match my credentials. I say somewhat because the description itself was brief. It mentioned the software Epic but not a lot. A few days later I get a call from a lady that sounded like she hadn't had much sleep. The lady tells me she would like to bring me in for an interview. We agreed on a date and then she proceeds to ask me interview questions (How you found out about the position? Why are you looking to leave your current role? Do you think you'll be a good fit?). I answered her questions but found it weird she was asking me those over the phone. I asked her what to expect during the interview and how many people would be in the interview. She replied, just me and another person. Cool.\n\nInterview day comes, I get to the building and she proceeds to give me a tour of the place. 3 different floors. Telling me who this and that person was. I'm thinking to myself that was a very good sign. After all, whenever I interview anyone, I just bring them to a conference room, interview them and off they go.\n\nShe introduces me to 3 different team members, shows me the desk the new hire is going to get. I am feeling very comfortable. We get to the conference room and in walk the 3 team members. I'm thinking to myself, what the h3ll is going on in here? For context a brief description of the 4 people.\n\nSupervisor: In her 50's. She's the one that I spoke on the phone and the one that gave me the tour.\n\nFemale 1: In her 20s. She seemed like the overachiever type.\n\nFemale 2: In her 20s. She seemed normal.\n\nMale 1: In her 20s. Quiet guy.\n\n\n\nRectangle table. I'm sitting bottom left. Female 2 is top left, directly across from me.\n\nFemale 1 is sitting top right (4 empty chairs between females 1 &amp;2). Supervisor is sitting next to her but not really by the table. The guy was sitting across from them (to my right).\n\nhttps://preview.redd.it/k892jrj5r21d1.png?width=445&amp;format=png&amp;auto=webp&amp;s=8e83fa76a5924f995bdfa74ac07b8770180545a4\n\nInterview starts and there's an awkward silence for a few seconds. This tells me they were not prepared. Finally supervisor starts speaking, telling me what they do in there. She doesn't ask me any of the typical interview questions. A few seconds later female 1 takes over. She asks me how am I with Excel, SQL, and Epic. I answer for the first two but told her I'm not too familiar with Epic. I know is not a software you can learn on your own. That you basically need to be working for a company that uses it. She proceeds to talk about Epic for almost 30 minutes. Female 2 adds to the conversation. The guy doesn't speak at all. Only whenever they ask him questions and he answers in one word answers. He threw me off because I kept wondering why he was there. He was not adding to anything. Even the supervisor wasn't saying much. Weird. There were more instances of awkward silence. I had to push the conversation by asking them my routine questions I ask interviewers. Towards the end of the interview we were talking about other things except the role. Female 1 got so comfortable that she got up, sat down with her feet on the chair. I thought I was being pranked. Interview was finally over. Supervisor walked me out and told me she would call within the next 2 weeks. 3 weeks later I sent her an email asking if there was an update. A week after that she replies saying I didn't get the job but to keep applying for other roles.\n\nThis was probably the weirdest interview of my life.\n\n\n\n",
      "subreddit": "interviews",
      "score": 9,
      "url": "https://reddit.com/r/interviews/comments/1cujyvb/weirdest_interview_ever/",
      "comments": [
        {
          "body": "It does sound like a prank. At least you now have a cool story to tell your grandkids.",
          "score": 3
        },
        {
          "body": "I am soooo curious about what company this is!",
          "score": 3
        },
        {
          "body": "I like how you provided a diagram.\n\nSounds like these people don't know how the hell to interview and were just winging it. Either that, and/or they already knew they were going to pick, but they were just going through the motions to be \"fair\" in their hiring practice.\n\nWhatever the reasons, though, it sounds like you dodged a bullet. I wouldn't want to work for a place that had such a dysfunctional interview.",
          "score": 3
        }
      ]
    },
    {
      "title": "Good or bad sign?",
      "body": "I recently interviewed for a job I really want, at a very good company. Today they got back to me and said that unfortunately they have moved forward with another candidate but a different division wants to interview me for the  same position.\n\nDoes this say anything about my performance on my previous interview? Is this good bad or neutral?\n\nThank you all!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/16unjea/good_or_bad_sign/",
      "comments": [
        {
          "body": "Simply means that you did well enough that they want to attempt to find you a role within the company. That's a great sign you did well just someone did a bit better.",
          "score": 8
        },
        {
          "body": "Sounds like a very good sign to me. \n\nIt would appear that they like your skill set and your personality.",
          "score": 1
        }
      ]
    },
    {
      "title": "Do interviewers *try* to intimidate or scare their candidates in a job interview?",
      "body": "I ask this because I feel like I’m noticing it the more I do interviews. It’s hard to describe, but you can tell they are not trying to make you comfortable like a normal human conversation. They seem to go out of their way to describe the job in the most high-stakes terms. Saying things like “Do you realize that you’ll be in charge of ____ and you’ll be expected to ___? Can you handle a responsibility like that?” And fill in the blanks with epic descriptions. Am I misinterpreting this or is this an actual, intentional thing hiring managers do?",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/10a6461/do_interviewers_try_to_intimidate_or_scare_their/",
      "comments": [
        {
          "body": "They shouldn’t, but some do, cause they like the ego trip. If they’re trying to intimidate or scare you, or you’re just not getting good vibes, thank them for their time and look elsewhere. How the interviewer acts is a reflection of their environment and culture, so if you don’t feel comfortable in the interview, you definitely won’t feel comfortable when you’re hired.",
          "score": 5
        },
        {
          "body": "In my experience, they are asking questions in this way to see how you react to pressure, likely because there will be pressure in that role.",
          "score": 2
        },
        {
          "body": "I haven't had anything like this. That's very bizarre.",
          "score": 2
        },
        {
          "body": "The hr manager at world wide tech is a stuckup prude that can't get with the times or take a harmless joke. The hiring manager loved me though. Enjoy the bed you made.",
          "score": 1
        },
        {
          "body": "As an interviewer no. I want to see the person at their best.\n\nOnly time I would want to do that is if the work environment called for handling serious stress then I’d want to see how they perform.",
          "score": 1
        }
      ]
    },
    {
      "title": "Was this a test",
      "body": "I received an interview for an internet based company. Today I received a call at 9am asking where I was, I was flustered and jumped on the interview and apologized. It was SO unlike me and I was kicking myself aalll day wondering how I missed such an important event. I looked through my emails and found another invite sent by the same person for the time I thought the interview was a few days from now. Was this a test I epically failed or a mistake on the companies fault?",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/s7itve/was_this_a_test/",
      "comments": [
        {
          "body": "Their mistake, but the worst part is it seems they think it was yours. \n\nForward that email invite to this person, ask for a clarification. Apologize profusely too. \n\nIf they are worth working for they will admit their mistake.",
          "score": 8
        },
        {
          "body": "Seems very unprofessional, test or not",
          "score": 1
        }
      ]
    },
    {
      "title": "Getting a Reference from an Internship that has Offered me a Job",
      "body": "Hi, first post here so I wasn't sure if there was a more specific sub for this problem. If there is one, please let me know.\n\nI have an interview for a full-time position with a big tech company in the Madison, WI area (EPIC Systems) and they've requested that I bring a printed list of 3 references with me. I've gotten my first reference from my campus IT support job but I need two more. I have had 3 past internships that all provided valuable experience and as such I made sure to stay in contact. As a result I now have standing job offers from two of them and just completed a technical interview with the third. \n\nObviously none of this sounds like a problem but here's my dilemma. My best references would definitely be from the two companies that I have offers from but I'm unsure if it's uncouth to ask for a reference from someone that has already given you an offer. Am I at risk of losing my offers if I ask them to be references? Or is this a common situation that I'm worried about for no reason.",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/dhsvc2/getting_a_reference_from_an_internship_that_has/",
      "comments": [
        {
          "body": "They know you’re looking for positions everywhere. I honestly don’t think that they would mind, and the fact that you are requesting references means that they know you are past the initial stages. Could mean more negotiating power (and also might not). Nevertheless I don’t think they would bat an eye that you are asking them for references.",
          "score": 1
        }
      ]
    }
  ]
}