{
  "company": "etsy",
  "post_count": 38,
  "exported_at": "2026-01-18T17:44:53.276Z",
  "posts": [
    {
      "title": "Why is my $350 Top Resume STILL not getting me a job?",
      "body": "I've been using Google Docs templates for my resume. I bought an Etsy resume and cover letter template and neither of these help with earning me a job! The Etsy resume was suppose to be ATS friendly.\n\nNow I bought the most expensive of services on Top Resume and it's worth $350 to have an expert write my cover letter, resume and LinkedIn.\n\nGot my new resume and cover letter but not LinkedIn yet. So I applied to a few jobs to see how it goes. I'm rejected from both after 1-2 days of applying with my new resume. JUST like before I bought this service, I'm being rejected.\n\nJobs that I want are Data Entry or non phone work from home jobs. But I have applied to call center jobs. I have data entry as my skills/expertise on my resume. I have call center experience as well. I just need a job that pays at least $17 per hour. I've only been able to get jobs that pay no more than $15 per hour or jobs that don't require interviews/drug tests.\n\nWhat's going on?",
      "subreddit": "jobs",
      "score": 110,
      "url": "https://reddit.com/r/jobs/comments/11axssa/why_is_my_350_top_resume_still_not_getting_me_a/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "&gt;non phone work from home jobs.\n\nThose are jobs **Everyone in the entire workforce wants**. They are so saturated and overwhelmed that no perfect resume or cover letter are going to break through the noise there. \n\nI think resume services make sense when you're mid-career and looking to step up to a new level, when your resume has an unclear story and through line (like you took several years off, pivoted, job hopper, etc), or you need to write a resume after 20 years at the same company or something. \n\nIt doesn't make much sense for entry level 'data entry' jobs--I'm not 100% convinced those exist anymore, as most of them have been folded into other jobs--like the data is entered by HR, payroll, accounting, finance, etc. \n\nHaving said that, just keep at it.",
          "score": 265
        },
        {
          "body": "First off, I just want to say that there's a misconception out there that paying for a nice looking resume template will magically cause recruiters to start calling you. Dude, recruiters aren't stupid and you're not dazzling them with fancy formatting. **It takes good content tailored to the employer's needs.** \n\nWith regards to your new resume, I would wait a few weeks before you jump to conclusions. It takes a good sample size (think 20+ applications) to get an idea as to whether the resume is working or not. \n\n**Make sure you document your job search in a spreadsheet**. This will make it easier to troubleshoot. Track info like: \n\n* Name of company\n* Name of position\n* Date you applied\n* Response (if applicable)\n* Date of response\n* Key/basic requirements of the job\n* Do you meet 70% of the requirements (Yes/No).",
          "score": 189
        },
        {
          "body": "How much experience do you have. If you're just fighting with 1000 other entry level people a good resume will help but it's just a numbers game.",
          "score": 60
        },
        {
          "body": "You are looking for Remote jobs.. enough said.\n\nI am not sure how many times people need to be told this... Everyone is chasing remote opportunities.. even those currently employed\n\nSo expect rejection more than once unless you have skills no one else has. which sounds like you don't.\n\nSorry for the blunt words, but your case is not expectional, you are just facing a supply and demand problem and no resume can fix it",
          "score": 36
        },
        {
          "body": "Top Resume is garbage.",
          "score": 62
        },
        {
          "body": "[deleted]",
          "score": 61
        },
        {
          "body": "[deleted]",
          "score": 50
        }
      ]
    },
    {
      "title": "Anyone every interview for ETSY?",
      "body": "If so what was the process like? What type of questions did you get during the phone screen etc..",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/4e45pn/anyone_every_interview_for_etsy/",
      "comments": [
        {
          "body": "Rejected from Etsy 3x with no interview AMA",
          "score": 9
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Etsy Data Scientist Process",
      "body": "hi guys, i have an interview tomorrow with etsy for a data science role. All they have informed me is that its a technical interview, however, usually when i am told about technical interviews they will let me know if it will be live coding. has anybody else interviewed with etsy for data science positions? ",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/15wpe95/etsy_data_scientist_process/",
      "comments": [
        {
          "body": "Dang I was disappointed no one commented. Was thinking of applying to a job there. How’d it go?",
          "score": 1
        }
      ]
    },
    {
      "title": "This is making me unnecessarily stressed out",
      "body": "So currently I work at five below, I just put in my resignation letter today because of this new job situation thinking that’ll help fix the problem but now I’m even more stressed. \n\nI also work seasonal at Vans which I’ve been really liking and hoping I’ll get to stay on the team when the holidays are over and now here’s the stressful part. \n\nI recently got the opportunity to interview at this privately owned shoe company that they started on Etsy and move on to more socials and finally bought a physical warehouse so they want to hire an employee. \n\nDid the interview, they loved my experience, got the job offer, they only thing they failed to mention during the interview process was they want a full time, 9-5, 40 hour work week. \n\nWHICH IS AN AMAZING OPPORTUNITY I LOVED THE SOUND OF THAT but having a seasonal position at vans that is a bigger brand company and part time at five below is a more secure position and vans neeeedddsss full open availability which doesn’t seem like this private company is willing to also be flexible on. \n\nSo I do not know what to do.. do I try to negotiate it or thank them for the opportunity and stick to bigger corporate jobs or what??",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ouzxq8/this_is_making_me_unnecessarily_stressed_out/",
      "comments": [
        {
          "body": "Not sure of your age but regardless my advice is to take the risk with the Etsy company.  It seems that’s where your gut is.  They bought a warehouse so must feel comfortable about the future.  All the risks that I’ve taken in my career, including moving halfway across the country, have been worth it. So I say take it.",
          "score": 1
        },
        {
          "body": "i mean, do you really think vans wouldn’t hire you back if things went south? they seem like the kind of place that is often hiring",
          "score": 1
        },
        {
          "body": "This all depends on your needs. If you need the money and stability of a full time job, take the new job. If you need the flexibility of part time for school, maybe staying at VANS makes sense. You didn’t disclose and wages/benefits so I can only assume they are comparable. \n\nAlso, working at VANS retail, may not offer much of a career path for growth.  The new job may have more opportunities as the grow, for you to move into other positions. They also might get gobbled up by a bigger company in the future, or just not make it at all at the scale they want to be at. There are a lot of unknowns. But, being able to get in at the beginning of a company is always exciting.",
          "score": 1
        }
      ]
    },
    {
      "title": "First Coding Challenge Feedback",
      "body": "I was recently rejected from a job after a coding challenge and I want to use it as a learning experience instead of getting down in the dumps about it. This was for a late-entry/early-junior level role. I've never had a programming position, proper, so I've never really had a lot of guidance when coding and am looking for feedback. The repository for my code can be found here: [https://github.com/marmstr3/EtsyCodingChallenge](https://github.com/marmstr3/EtsyCodingChallenge).\n\n&amp;#x200B;\n\nThe prompt was to use the Etsy API to analyze 10 Etsy stores of my choosing for their top-5 meaningful words. The feedback I got was that my code was deficient in \"Testing, Edge Cases, API error handling\". I get the testing part. I was told not to spend significant time on the project and felt like testing would be out of scope due to that. I now see that was a poor assumption. However, how could I have made my code more resilient against edge cases, and how should I have handled API error handling different than standard Python error handling?\n\n&amp;#x200B;\n\nEDIT: Just wanted to clarify that this wasn't an interview for Etsy. The challenge just happened to use Etsy's API. Also, thank you to all of the responses this has gotten. I will try to respond to everyone as time allows.",
      "subreddit": "cscareerquestions",
      "score": 45,
      "url": "https://reddit.com/r/cscareerquestions/comments/f656a7/first_coding_challenge_feedback/",
      "comments": [
        {
          "body": "First thing: If there are going to be requirements to run your application, you should use standard tools for this, not a readme that says to install requests (this would mean pip `requirements.txt` file in your case).\n\nRegarding error handling, the problem IMO is this sort of thing:\n\n    shop = requests.get(url, params=parameters)\n    if shop.status_code == 200:\n        shop_listings = json.loads(shop.text)['results']\n    else:\n        shop_listings = None\n\nIt would be one thing if you ignored errors and let them bubble up letting the consumer know there's an issue. However, pretending there's no error and just returning a `None` (you then, later, just ignore Nones... I don't think any errors actually bubble up to the user at all in this case).\n\nRegarding testing, it's one thing to not have tests for a coding challenge, but this code is basically untestable. Generally speaking, you should write your functions, classes, and modules such that you can pass in necessary arguments to do actions. So for example, you've got this function:\n\n    def print_analysis_to_console(shops):\n        for shop in shops:\n            words_string = \"\"\n            shop_name = shop[0]\n            for word_count in shop[1]:\n                words_string += f\"{word_count}\"\n            print(f\"Top 5 Words for {shop_name}:\")\n            print(words_string)\n            print(\" \")\n\nBut this doesn't just print strings to the console, it also formats the strings to be written. And if you wanted to test how the formatting works, you wouldn't be able to without, say, mocking the entire `system.out` pipe. Your code is fully coupled to itself, allowing for no extensibility or testing. \n\nA few years ago I actually hung out with a few Etsy engineers, my company had a relationship with theirs. What I would guess they're looking for out of this assignment is not necessarily the most polished, tested code in the world but instead code that it would be immediately obvious and easy for how to extend it. Extensibility and readability are paramount, at least it was to the engineers I hung out with. That would be good to practice and read up on.",
          "score": 45
        },
        {
          "body": "A tiny little thing that bothered me was that stop\\_words is a list, creating a set would have been more scalable.\n\nAlso, everything in a single file is a bit painful. For future projects maybe try to seperate it out over several files.\n\nAs for testing, if you find it hard its probably because your code is wrong.\n\nfor example:\n\n`def search_dir_for_files(pattern, directory):`\n\n`found = []`\n\n`for file in os.listdir(directory):`\n\n`if pattern in file:`\n\n`found.append(file)`\n\n`return found`\n\n&amp;#x200B;\n\nHow do you test it? Well, one thing you could do is to setup a test directory on the file system. And then you always test the code using that directory. I probably don't need to explain why this is terrible.  A better approach would be use mocking/Fakes.  You 'pretend' that os.listdir returns x,y,z and then test based on that.\n\nHowever the best approach is usually to seperate things out, lets change the code like this:\n\n`def search_list_of_filenames(List[str] : filenames) -&gt; List[str]:`\n\n`found = []`\n\n`for file in filenames:`\n\n`if pattern in file:`\n\n`found.append(pattern)`\n\n`return found`\n\nAnd when we want to use it we say:\n\n`f = os.listdir(directory)`\n\n`matches = search_list_of_filenames(pattern, f)`\n\n&amp;#x200B;\n\nBy writing code in this way, its much easier to test the function.",
          "score": 9
        },
        {
          "body": "Some \"nice to have things\" I noticed that could be improved:\n\n* Have the run commands in code format style, so they easily stand out and can be copied \n    \n&gt;python main.py \n\n* Don't have hard coded API key but read it from a config(not a big thing but it shows you thought about this)\n\n* Why not include the stop words from a file instead of taking up 70 lines?\n\n* Why have constant for the WELCOME_MESSAGE etc, if only used once?\n\n* The word filter methods could maybe be their own file to separate the filter logic from the \"main loop\" logic\n\nand with error handling, this part\n\n&gt; try:\n&gt;            shop_words += listing['description'].upper().split()\n\n, what happens if listing['description'] is undefined or no property of listing? But maybe this is a python thing so it's handled",
          "score": 2
        },
        {
          "body": "My one piece of advice would be to learn how to write code using test-driven development. I haven’t looked at your code, but most juniors tend to write their code without much regard for testing or exposing APIs properly and focus solely on just getting it to work, which leads to very brittle and unstable code. Test-driven development helps with this by having you write tests first, then write the minimum amount of code to pass those tests, which leads to far more stable and extensible code. [Here’s](https://stackabuse.com/test-driven-development-with-pytest/) a good tutorial for using TTD in Python.",
          "score": 2
        }
      ]
    },
    {
      "title": "Anybody hear back from Etsy after the hackerrank for internship?",
      "body": "I took the Hackerrank a couple weeks ago and think I did pretty well.  This is for the summer 2019 intern program. \n\nAnybody hear back, positive or negative?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/9mssgy/anybody_hear_back_from_etsy_after_the_hackerrank/",
      "comments": [
        {
          "body": "Yeah I have an onsite next Monday!",
          "score": 2
        },
        {
          "body": "Nothing yet!",
          "score": 1
        },
        {
          "body": "Was given onsite right after the hackerrank about 2 weeks ago. Last year I received an offer though and I have deadlines so maybe I was expedited. ",
          "score": 1
        },
        {
          "body": "I have an onsite this week for new grad position. Anyone care to share what the technical interview was like :D",
          "score": 1
        }
      ]
    },
    {
      "title": "Reputation of Etsy",
      "body": "I'm interviewing for an internship position at Etsy soon and I was wondering how its reputation holds up in the tech world. They have a cool product but I never really hear about it being talked about in the tech world.",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/9rcjqw/reputation_of_etsy/",
      "comments": [
        {
          "body": "They were one of the pioneers of the early NY tech scene. They had/have a great engineering blog and often sponsored tech meetups and stuff - so they are definitely well-respected in that circle.\n\nToday they are a relatively large company with a solid engineering team that would have a lot of infrastructure in place for helping you learn. They've got the typical tech fancy office in a cool location. They also have a big focus on well-rounded empathetic and creative employees. They had some trouble last year and had major layoffs, but seem to be on the up and up (at least according to their stock).\n\nIf the frame of reference is \"is it as good as Google\"? IDk. Maybe not, but it's a very solid company.",
          "score": 24
        },
        {
          "body": "Most tech companies don't have legitimately bad reputations nor are often talked about because it's mostly the big players that dominate the conversation. Just because you personally haven't heard of a company much, doesn't mean it's a career suicide to work there. There really only a handful of companies that most people, even those in the tech industry, will have heard of. \n\nImo, 90% of the time, you should focus on the actual role (the responsibilities), salary, people, and the financial health of the company rather than the reputation. If you hate the actual job or the people, then reputation does not matter jack shit because you will have a bad time. And the brand is not gonna make up for the fact that you have to spend 8-10 hours 5 days of the week at a place you hate. How do I know this? Because I worked at a big company that was certainly a resume boost, but I hated my manager. Completely incompetent. I hated going to work and having to deal with him. It did not make a single difference whether it was a \"good\" company or not. \n\nBut Etsy is a pretty big company (at least in the NY area) so this is not an issue in this case. Most techies in NYC will know it. But the flip side of the equation is that it's also pretty competitive company to get a job at.",
          "score": 11
        },
        {
          "body": "They rescinded a bunch (all?) intern offers last year. ",
          "score": 9
        },
        {
          "body": "It’s good. I can’t give that much in-depth but I’ve spent some time at the HQ in DUMBO and it is modern and hipstery. Seems like a cool place to work.",
          "score": 11
        },
        {
          "body": "People on this sub are a bit behind. They were having company issues two years ago and they had a giant restructure. New CEO, layoffs, etc. I interviewed there for the past two years and asked about the state of the company both years. \n\nThe whole internship shenanigans was two years ago, it occurred alongside the restructuring, and somehow the inter program got cut. The recruiters and engineers that year were extremely proactive in getting the ex-interns positions at Facebook, google, Spotify, and other great companies and every single one of them had an internship that year. I didn’t go to them last year because of that reason, I didn’t want to be the first class after that whole thing, but this is the second year afterwards. Their recruiting process has gotten way better and I might consider taking the offer this year.\n\nAll of the engineers were somber about the restructure, but everyone recognized the need for it (the company was really bloated), and the company is in a much better place (as reflected by the stock price). Lmk if you have any more questions.",
          "score": 4
        },
        {
          "body": "[removed]",
          "score": -13
        }
      ]
    },
    {
      "title": "Etsy Software Internship Process - wtf?",
      "body": "Did anyone interview with them? The technical interview is 30 minutes (odd). The interviewers introduce themselves, and then have you share your entire screen (umm?). Then they have you arrange an online IDE's size, contrast settings etc. so they could see things better (umm?x2). By then, you have like 22 minutes left. Now you are tasked with \"finding and fixing at least 3 or 4 bugs\" in a premade codebase with both frontend and backend (in Python Flask...huh?) in their desired order. My interviewers in particular would ask me to inspect a certain number line and then realize 3 minutes later that she was looking at another line in the code (woopsy) - but that's besides the point.\n\nIt would be a challenge to find and fix 3 or 4 bugs in 22 minutes in a personal project, let alone a completely new codebase. I had received my dream offer literally 30 minutes before this interview, so I politely let the interviewers know how bizarre the whole thing was. What are the signal metrics in this interview? Did anyone else experience this bizarre \"challenge\"?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/jbx728/etsy_software_internship_process_wtf/",
      "comments": [
        {
          "body": "Well, the fact that they have been doing this for a while means that there *are* candidates who can find and fix those bugs within 20 minutes.",
          "score": 5
        },
        {
          "body": "doesn't sound too bad",
          "score": 3
        },
        {
          "body": "Can you tell me when you heard back from them? I applied but haven't heard back yet",
          "score": 1
        }
      ]
    },
    {
      "title": "Here are some tech stereotypes from my own experience and from talking to others, what other ones are there?",
      "body": "I've worked at several Silicon Valley tech companies and here are some stereotypes I've noticed. I was discussing these with a friend and surprisingly, I couldn't find many posts/comments of people supporting these stereotypes. Do you agree or disagree with these stereotypes?\n\nObviously, they don't apply to everyone, or even the majority. Also, they may come from my specific experiences at specific companies. Let me know if you disagree, it'll be interesting to see other perspectives!\n\n- front-end and product engineers tend to be more social than back-end engineers, systems engineers, etc. I think this one is pretty easy to explain: you'll tend to like making products for people if you like people\n- more mature companies tend to be less \"fun\", as in less video games, less going to bars after work, and less socializing with co-workers\n- female-oriented companies tend to be more social: people tend to become friends with more co-workers at companies such as Pinterest or Etsy\n- mid-sized companies tend to have the best food: Dropbox, LinkedIn, Square, etc. Smaller companies don't have enough mouths to feed to justify hiring a chef or having a large variety of food. Larger companies can't afford to give amazing food to that many people\n- smaller companies tend to hire experts in a particular domain (e.g. Rails expert, self-driving car experience), whereas larger companies tend to hire generalists and give them work that they're not necessarily proficient at\n- team tends to be more open with each other when they're similar demographically, i.e. sharing more about themselves. This isn't to say that diverse teams are more or less productive, but just that their team members tend not to know each other as well\n\nWhat stereotypes do you think exist?",
      "subreddit": "cscareerquestions",
      "score": 11,
      "url": "https://reddit.com/r/cscareerquestions/comments/85ykjm/here_are_some_tech_stereotypes_from_my_own/",
      "comments": [
        {
          "body": "Okay since we're just talking stereotype here... I'll \"let loose.\"\n\nlumberjack white guy with beard - working at a startup / cool company.\n\nMiddle aged Indian guy - Developer at investment bank.\n\nYoung Asian American - Google. Or working under first white guy in cool company.\n\nYoung Asian from Asia - Goldman Sachs.\n\nEdit edit: guys guys this is just stereotypical. *Obviously* big tech is very well represented by all sorts of background and ethnicity. I was just having a little fun with some narrow perceptions :) \n\n\n",
          "score": 30
        },
        {
          "body": "[20 something men with shorter hair on the sides and longer up top](https://hairstyleonpoint.com/wp-content/uploads/2016/12/Short-Mens-Hairstyles-Short-Pompadour.jpg) = tech bro who is considering being an entrepreneur\n\n",
          "score": 13
        },
        {
          "body": "One stereotype which exists is that programmers tend to be less physically active than some other disciplines. At our studio people tend to be very active in general and the SEs as a group seem to be in the best shape. ",
          "score": 3
        }
      ]
    },
    {
      "title": "I’m so sick of this sh-t",
      "body": "Why is job hunting literally SO HARD. I’m embarrassed to admit this but I’m 21F and have never worked a day in my life. I really wish I’ve gotten work experience early on but I had circumstances as well as discouragement from getting so many rejection emails and ghosted after interviews. It’s tiring. Back in November, I was interviewed and hired on the spot as a seasonal part time retail associate at a store. I was so happy as I was excited to finally start working. I’ve filed paperwork and everything. I was supposed to start working during the holiday season but I’ve never got an email or call back about when I could start. I even emailed the manager and called the store to let them know but nothing and the holiday season has also already passed. The only things I have on my resume are my volunteer experience which is pretty much it. I am however doing online course to become an RBT but in the meantime. I have also tried to look for on campus jobs but I’ve only gotten a few interviews and no call/email back as well as rejection. I’m tired of it all, I’m resorting to joining the military after I finish my bachelors or opening up an Etsy shop.",
      "subreddit": "jobs",
      "score": 47,
      "url": "https://reddit.com/r/jobs/comments/1q1k6n8/im_so_sick_of_this_sht/",
      "comments": [
        {
          "body": "If you’re still going to school, volunteering might help somewhat, especially if the volunteering requires some level of skill. It shows character. And if you get to do anything technical or what have you it might demonstrate your skills as well.",
          "score": 6
        },
        {
          "body": "34 year old here with work experience since I was 16. It’s hard out there, I was laid off end of November and didn’t land anything more than an interview until this last week.\n\nTips that I genuinely believe will help. Firstly is the super obvious one, numbers, treat applying to a job as your full time job and don’t stop at things you easily qualify for, apply to everything. I personally applied to almost 1000 postings across 4 or 5 recruiting websites.\n\nSecondly, and this one I learned to practice this last month and I believe is super important, cater your resume to the job you’re applying to. Adjust your verbiage for your duties in that volunteer work to be directly applicable to the position you are looking at.\n\nNow after saying all that I recognize you’re in school and that should be your main focus if you have your parents to help you out right now, but those two tips will help whenever you’re looking for work. \n\nAnd remember rejection is inevitable in this market, you know you’ll be a valuable member to whatever team you join, so don’t worry about the ones that pass. Again my numbers from the last month is roughly, and these aren’t exact but I will round down, about 900 resumes sent out to recruiters, of those I got about 20 interviews, and of those 20 interviews I got one offer.",
          "score": 6
        },
        {
          "body": "You’re not behind, you just started in a really rough market. A lot of retail “hires” ghost after paperwork, it’s messy and not a reflection of you. One thing that helps early on is aiming for places that expect zero experience like campus offices, libraries, gyms, or temp roles, they actually train. Also, volunteer work still counts, it shows you can show up, which is half the battle at 21.",
          "score": 4
        },
        {
          "body": "Even if you had 15 year experience you'd still be struggling. We all are, the job market is in a bad place and the economy (assuming youre from America or Canada even) is basically in a quiet recession. \n\nYou're so young you have no point of reference for what normal is so you blame yourself. Dont. Just keep trying...\n\nDont compare your self to anyone or any media showing people who were your age in 2019 or before regarding work... Those days are gone unfortunately for everybody.",
          "score": 3
        },
        {
          "body": "How are you even living is my question? Like, you have bills to pay right? Presuming you haven’t gone for a degree.",
          "score": 11
        },
        {
          "body": "Eastern, don’t give up! Dig in! Determination means a lot",
          "score": 3
        }
      ]
    },
    {
      "title": "What's the competitive weight of undergrad internships? How do I see what colleges offer good programs for internships?",
      "body": "Hi all! I'm currently trying to line myself up college in fall after taking a leap year and a half to sort out some mental issues and let my familial situation temper. I'm aiming to work and walk into college with $8000 in savings, and with my family's EFC of 0, go crazy applying for grants and scolarships. I'm not 100% certain what job I want yet, but I know I want to program. I've done it since I was 10 and having recently challenged myself to try to take on more complicated applications, I know it's my calling.\n\nTwo things hold me back. One thing pushes me forward.\n\nGPA of 1.8. Honestly thought I was gonna off myself in high school putting up with so much mistreatment/borderline abuse and didn't try, but I tested exceedingly well. I've sorted all of this out, rebuilt my work ethic, and the college experience gives me a clean environment so I can prove what I'm worth! The other concern I have is living in a very rural area. I'm about two hours away from Kansas City, I'm not so certain I live in a booming tech center. I have very good friends, almost family, in Louisiana, and I'd like to get closer to that area, but I can hold off on it a while. I imagine if I intern while in college competitively, I'd have a GREAT shot at getting closer to them. Of course, they may be other places when the time comes, so, not set in stone - but looking for it! But due to all this, I worry my prospects may be limited. If I'm wrong, I'm wrong, and that's a boon, so how would I find out? How would I be able to see what internships or job fairs the colleges I'm looking at would offer? \n\nWhat pushes me forward is, hopefully, a portfolio. I'm starting work on a program for small business and e-commerce (Think Etsy, Shopify, physical mom and pop stores) that does bookeeping, inventory, workflows, resource management, tracking income, sales, profit, spread over items/item categories whilist tracking dates and amount sold (the idea is if someone wanted to grow, they could look at the margins for their various items easily and see how well they sold). This is just the *first* thing I want to build, and I can probably launch it before I enroll. If not, I'll be close. I have other projects in mind, and I really hope that all of this carries me. I also have excellent performance in game dev and programming classes I took in high school, and my be able to call back my old school and get a reference if I need it. As a side, my year plus of retail experience gave me some great people skills, and if I land an interview, I'd argue I have a leg up on my competition in that scope.\n\nBack to the main question - I'm essentially looking at two local colleges. One's a community college, and one's a traditional, four year, university. I may not get into the latter with my GPA, but I'm applying and starting a conversation anyways. The cc is a guaranteed hit. The traditional university has higher tuition, but depending on my granting and scholarshipping, my loan take-out could rapidly become minimal or even null, especially if I can intern or work while enrolled. If I can verify that the university will give me better internship opportunities by a sizable margin, or I won't get any internships as an underclassman, I'll save myself the loans - unless there's other factors I should consider.\n\n&amp;#x200B;\n\n**TL;DR:** Trying to balance tuition costs, potential scholarships and grants, with finding a college path that's useful for a career in computer science/programming!",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/evzf1e/whats_the_competitive_weight_of_undergrad/",
      "comments": [
        {
          "body": "First off, every university in the United states is going to deny you without looking past your GPA and that's not even debatable. You're going to need to go to a community college first and pick up some credits there and prove yourself. How many credits you need will be based on the school you want to transfer to for your BSc. This will also help with your hope to save money as $8000 should cover tuition for an entire associates degree plus extra, if you even want to stay that long. \n\nAs for internships, that's not really based on the school. It's more so based on your networking ability and a little on job fairs that the school puts on. It should also be noted that internships are not something you absolutely must have, but they help you out quite a bit.",
          "score": 7
        },
        {
          "body": "Just go to community college. Going to uni for 4 years is a fat waste of money. I did running start and got my AA for free at community college, graduated with a 3.0, and now I'm at uni with a big n internship lined up this summer. I genuinely don't know why people waste so much money on University when it's the same degree in the end and some colleges even prioritize transfer students.",
          "score": 1
        }
      ]
    },
    {
      "title": "Language-specific OAs?",
      "body": "Etsy's Intern coding challenge is specific to NodeJS and Express. I don't have any web dev experience, so I just can't do the assessment. Is this practice common? Do I have to learn all the top \\~10 most popular frameworks just to pad my resume and be able to use them on an OA, or am I okay with Java / Python for most intern assessments / interviews?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/dksjhf/languagespecific_oas/",
      "comments": [
        {
          "body": "I think you should be open to learning new languages. I've learned 10+ during my education/career.",
          "score": 6
        },
        {
          "body": "You could learn at least one before having a fit.",
          "score": 6
        },
        {
          "body": "Still no internship 😂😂😂😂",
          "score": 3
        },
        {
          "body": "For new grad interviews, you should typically be fine with Python/Java/C++.  Of course, it all depends on the position and the company.",
          "score": 1
        }
      ]
    },
    {
      "title": "Deteriorating Health as a Data Scientist",
      "body": "TLDR: 9 months into my data scientist job I’m battling the chronic anxiety of daily meetings as a person with ASD (not officially diagnosed with brain scan but confirmed by a psychiatrist). Not sure what to do as I have debt to pay off and I’m in the beginning stage of a small business funded fully with my data science paychecks.\n\nI graduated in 2019 and started working as an applications developer at a pension fund. From there I got a job as a Data Scientist in the growth team of a SaaS company after a lot of open courses, YouTube videos, medium articles, etc. After learning that the management has no intention in investing in the data pipeline or infrastructure, and had anger directed towards me daily when the numbers I crunched showed that the stakeholders’ marketing campaigns had continually failed while the churn stays high. \n\nTo get out of that situation, I tried REALLY hard to grab on to any data science interview opportunities and ended up with my current job after spending about 30 hours on the take home assignment over the weekend (unconventionally tight deadline because I had another offer and wanted a decision sooner). Now in the eyes of many aspiring data scientists, I’m probably a one-in-a-million lucky dog: I studied math and business but graduated with a bachelor’s degree in art after having an awakening to explore my voice and self-expression. My professional experience with data analytics and programming have been completely self-taught. I’m such a flakey person that I can’t even get the motivation to put up with completing the couple of prerequisites or taking a GRE to apply for a master’s program, yet I get to play with production level ML and have full autonomy on client projects (which is a double-edge sword when it comes to stress and mental health).\n\nI learned that I’m likely to have ASD this year after my partner brought it up and had a psychiatrist confirm some of the text-book symptoms: have a hard time reading people’s intention, get overwhelmed by sound, visual, situations and people easily and can’t process that emotion (I was conditioned to act normal since I was a kid so I internalize all the negative feelings to be the model citizen and just implode without anyone noticing). At my current job, we have daily meetings within the team with 2 business development managers and 2 other data scientists (sometimes 2-3 meetings a day to discuss different projects). In addition to that, data scientists also need to meet with current and prospective clients (the DS team sells DS consulting and custom projects for clients that use the company SaaS product). \n\nAt some point this year I realized that this corporate life might not be for me no matter how shinny the perception of it might seem in the society. So I’ve been building a rare plant collection and propagating them since March. I finally opened the Etsy shop when my collection is large enough to supply new inventory updates every week, but almost overnight over the week I discovered 4 types of pests on about 20% of my plants, and as I treated those infected plants they spread over to most of the rest and I had to throw out ~ 60% of my plants and systematically treat the rest over and over. I had 3 nights working till 3-4 am on my plants just to wake up 2 hours later to meet with other data scientists based in Budapest. I finally got the pest under control but my body has been hurting, my chronic backache from sports injury and gastritis flared up. The Etsy shop has been selling surprisingly fast (I’m only selling completely separated uninfected plants), so I had to keep up with the shipping and customer communication.\n\nI know this isn’t sustainable and it’s only going to get worse after the lead data scientist goes on maternity leave in October this year. I really dread the day when the heavy lifting in meetings would fall onto me and maybe even some managerial duties since the third data scientist isn’t very communicative.\n\nI discovered today that I might have stomach ulcer from the color of my bodily waste. Stomach ulcer is something I know would be the next step from gastritis for a while now. I’m really scared to take more PTO because I already took 3 sick days in 2 months but I don’t want to lose the momentum with the Etsy shop either (my listings have been picked up by Etsy sidebar ad algo and I have finally graduated from pest treatment university and have more healthy plant inventory ready to go). I’m really not sure what I have to give and I’m worried about my health. \n\nAny advise would be really really appreciated!",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/pdprq2/deteriorating_health_as_a_data_scientist/",
      "comments": [
        {
          "body": "Quit your job for a year and take some shrooms, focus on health!",
          "score": 0
        }
      ]
    },
    {
      "title": "Flatiron Health vs. Etsy for SWE Internship?",
      "body": "I've been fortunate enough to receive offers from both of these companies, and honestly have no idea what to pick. They are very similarly sized companies (although Etsy is larger). They are both in New York, and the compensation is approximately the same, so location/$ is not a factor. Both of their companies' work cultures sound extremely good -- I loved everyone I talked to from each company.\n\nAs for my current situation, I am a junior at a top 20 CS school. My resume/GPA isn't super strong, but I know both of these internships would look equally as good. I am primarily interested in web development, and both internships would have projects that would fit my interests (although I have not been given a specific team for either one). I intend to recruit again next year for full-time (I want to be closer to family on the West coast), but I am not opposed to accepting a return offer, if I really like the company.\n\nFor Etsy, their engineering culture seems more established (although Flatiron's is no slouch, full of ex-BigNers). They have been around for a while, so their practices and procedures are more set in stone. I love full-stack development, and all of Etsy's teams are small and consist of engineers, designers, etc. so I would get to learn a bit about everything. Also, working a platform which millions of people use is very appealing to me.\n\nFor Flatiron, their mission is most appealing to me. Cancer has taken loved ones from me and they are one of the only companies where I can contribute to cancer research. But I don't expect my impact as an intern to be really all that great so it's not the hugest factor.",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/9x37re/flatiron_health_vs_etsy_for_swe_internship/",
      "comments": [
        {
          "body": "FWIW, Etsy [rescinded all their intern offers](https://www.bloomberg.com/news/articles/2017-05-24/etsy-slashes-its-intern-program-as-wall-street-demands-cost-cuts) just two weeks before summer started a couple of years ago. Personally, I'd be reluctant to take an offer at a company where that situation can happen, but you may be more forgiving/risk-tolerant than I am.",
          "score": 14
        },
        {
          "body": "How was flatirons interview process? I’m going through it now, but couldn’t find much on what to be ready for. Thanks!",
          "score": 5
        },
        {
          "body": "i heard today that etsy decided to pay its interns 8$ more an hour, if that makes a difference to you (or you didn't know). If you're interested in web dev, etsy's probably better for you, since their product teams are pretty much all web dev. If what's more important to you is what you're working on, then flatiron is probably your choice.",
          "score": 5
        },
        {
          "body": "As someone with an offer with Etsy, I'd go Flatiron. ",
          "score": 4
        }
      ]
    },
    {
      "title": "Why don't younger companies/companies-I-want hire me?",
      "body": "Hi I am am going to be a fresh grad in May with a masters degree in applied math and bachelors in math with minor in CS(though I did more coursework than just a minor). I am currently applying to jobs and interviewing with opportunities I got through my University's career fair. However I am having a hard time being grateful and psyched about the places that are giving me interviews and really want to work for a younger company with a more fresh vibe, for a product I use on a regular basis like Spotify or Buzzfeed or Pandora or Etsy or Pinterest. I go to school in midwest and I am also really wanting to get a job in the Bay Area. I spent a summer teaching there and really liked it. Or really just want to get out of the midwest but I don't know why my resume isn't getting noticed by the companies I'd like to work for and I don't know what I can do to change that.\n\nI know I am a fresh grad and on top of the that I am international student so I am in no position to be picky. But still, I know people from my school who work at Uber, Facebook, Google, Etsy etc as their first job out of school and I was wondering if I can do something to my resume or gain skills that make myself more attractive to these jobs.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/7xjijc/why_dont_younger_companiescompaniesiwant_hire_me/",
      "comments": [
        {
          "body": "So you want to work in the most competitive area for CS jobs, and in addition to that you want to work for the most attractive/competitive companies in the CS industry?\n\nI think it goes without saying that's an uphill battle. You're not just being picky, but you're disqualifying anything that isn't essentially a Big-N / a widely-used, hip, successful product.\n\nBesides making sure your resume is good, probably some interesting side projects, and studying to ensure you can pass the technical interviews &amp; whiteboards, there's not much you can do. A lot of getting into Big-N's like that is either luck, or knowing someone. Reason being, is there's 2000 other applicants that are all top-tier developers.",
          "score": 10
        },
        {
          "body": "&gt; if I can do something to my resume\n\nWhat resume?",
          "score": 3
        },
        {
          "body": "What's the point of making this post if you aren't going to at least post your resume or share any details about your candidacy. At this point I'm going to say you're being passed over because of your communication skills. ",
          "score": 1
        }
      ]
    },
    {
      "title": "In interviews I’ve been asked why I’m applying for a job when I currently have one. Why is this even a question?",
      "body": "I am currently self-employed while I look for work. It will be a year of constantly looking when it hits April 8th. \n\nI’ve been asked why I’m looking for another job when I currently have one and I’m wondering why this is even a question. It looks bad to not have a job when looking, and I know this for sure. [Edit: the last hiring manager asked me in an annoyed and forced way, which is why I’m writing this post since I didn’t realize it was such a big deal to have two part time jobs (self-employed).]\n\nI’ve also been told last year that the interviewer said he didn’t want to take my business away from me by hiring me so he didn’t hire me. I can’t live off of less than $12,000 and I’m constantly doing freelance or selling on Etsy to keep my skills sharp and to give me something to do. \n\nMy husband works full time and I’m wondering if that is ever into consideration when someone hires a woman. \n\nI’m a college grad as of April 9th last year (turning 29 this year) and this trial is particularly hard, especially as I’ve submitted 252 job applications. I’ve received many call backs, and I’ve been a runner up many times. \n\nOne person said I didn’t sound confident enough, and another said I sounded too confident, almost to the point of bluffing. But I wasn’t bluffing — it was a job I could do 100%. \n\nWhy do hiring managers make it so difficult sometimes for interviewees? \n\nAnd why ask why I’m even looking for a job when I already have one? Am I supposed to be jobless when applying?",
      "subreddit": "jobs",
      "score": 524,
      "url": "https://reddit.com/r/jobs/comments/mje0fn/in_interviews_ive_been_asked_why_im_applying_for/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Future employers just want to know potential red flags (if there is) at your current employer. In your case, you can mention that you are currently self-employed and looking to work in a team setting.",
          "score": 316
        },
        {
          "body": "https://www.thebalancecareers.com/why-are-you-leaving-your-job-2061203\n\nThere's some good advice in this article. I know some of it doesn't apply to you, as you're self-employed, but there might be something you can adapt.\n\nAfter so many applications, it must feel hopeless, I am sure. I'm on the other end, where I lost my job and can't find employment.\n\nPerhaps telling the interviewer that while you love your self-employment, you had only ever intended it to be a hobby, and you're much more interested in working in the field of your chosen degree.\n\nYou paid for an education in your desired field because that's what you wanted to do with your life. I think that if an employer doesn't understand that, then it's probably an employer not worth working for.\n\nYou just graduated, somewhat recently, and you might have student loans to consider. In a perfect world, the carrier your education was meant to prepare you for should pay enough to cover your college debts. It's not a perfect world, but the sentiment is the same. \n\nGood luck. I hope you find an interviewer who is also a rational human being.",
          "score": 87
        },
        {
          "body": "I had an interviewer also ask me \"why I dont want to stay at my current job\", like come on! Obviously its because I dont wanna stay there anymore. Looking for new opportunities and get more money",
          "score": 135
        },
        {
          "body": "I do initial interviews as an HR Specialist. I phrase the question differently, but essentially I want to know your motivation for looking for a job. If you say you don't like the work culture, I'll probe for the culture you want to see if we would be a fit. If it's your boss, what traits don't you like. If its for growth, can we actually help you grow... and so on.\n\nBecause you're self-employed, my concern would be you taking this job short term, which for my company is less than 2 years, and then leaving because your business has picked back up. This is especially true during Covid. I would want an answer that talks about stability, or why this specific job is better than self-employment. If you went to school so you could stop being self-employed, make sure to mention that as well.",
          "score": 90
        }
      ]
    },
    {
      "title": "How do you get jobs....5 months in and no good news",
      "body": "I am a 57 yr old female, only parent, still raising two teens. I have a TON of experience in engineering, project &amp; construction management, financial analysis, working with every type of person, executives to trades, organizational skills, interpersonal, computer, even programming, everything (it feels like) but neurosurgery and in 5 months I've had 2 phone \"screens,\" one Zoom (Brady Bunch) interview, one in person. I thought the in person interview went fantastic and I was the perfect fit for a job that was a perfect fit for me but it is 2 wks later and I haven't heard anything. My teens think I am here at their beckon call &amp; my money is almost run out. I also live in a new state, so don't know many people. You can tell I am likely over 40, maybe close to 50 on my resume but WTH? i have never been unable to find a job. I have NO IDEA WHAT TO DO DIFFERENTLY. I've done all the tips, tricks and everything else but stand on my head during a Zoom interview. What are people doing who find jobs? How do I get around ageism? I had to deal with sexism my entire career and now freaking ageism? I look closer to 50 than my age (thank heavens for good genes) but.....ugh, I've got 20 more years in me for sure.\n\nPlus, I feel like I am ADD (I am not) simply because I apply for jobs, then go back to creating something to sell on Etsy, then apply for jobs, then back to creating. I just applied for a state job (it takes for freaking ever) when I got to the end and it wants me to state my last TEN projects and I just can't....hours filling out their forms and I just had to come to Reddit to see if others are this frustrated yet have pulled themselves out of the despair. If you are still reading....thanks! Big hugs!",
      "subreddit": "jobs",
      "score": 33,
      "url": "https://reddit.com/r/jobs/comments/1kj3wd0/how_do_you_get_jobs5_months_in_and_no_good_news/",
      "comments": [
        {
          "body": "I started my business, because I knew the emails would stop coming and the phone would stop ringing for interviews. Best move I ever made. \n\nGranted, I am not making as much as I was but it is not a lifestyle cut and the freedom I have vs living on pins and needles at the whim of some corporate overlord is life-changing.\n\nTake stock of your skills, because I see a management consultant based on your brief summary of experience.\n\nPrayers for a great result",
          "score": 17
        },
        {
          "body": "Can you make your resume younger without sacrificing relevant work experience? I'm 47 and I've had much more success with at least getting to the interview stage once I dropped an older job from my resume. \n\nHere are some numbers: Old resume with 21 years of experience: 109 applications, 7 interviews (6.4%)\n\nNew resume with 6 years of experience: 26 applications, 5 interviews (19.2%)\n\nNo job so far, but I feel like the ratio of interviews to applications alone is indicative that there's at least some ageism happening and I'm ten years younger than you (also female, fwiw). Unfortunately, I can't guard against ageism once they meet me in person as I do feel like I look my age.\n\nI would add that the job market is particularly brutal right now. I'm losing out on jobs where I feel like I nail the interview and my qualifications line up. The last conversations in the interview sound like I can expect an offer, and then I get an email telling me they went with another candidate. I think it's just an employer's market right now and any little thing, from age to another candidate saying their salary range is $5k less than yours, to a \"vibe\" they get, can knock you out of the running.\n\nYou just have to keep at it. I only use Indeed and LinkedIn, as I found the others offer nothing the big two don't offer. I typically go directly to the company's website to apply rather than applying through the job search sites. I do not super customize my resume for each application, though I have made sure my resume gets past ATS (this is very important) and I will switch up bullet points if a job has a hyper specific requirement that I meet but don't normally have on my resume.\n\nI would also recommend hitting up a temp agency relevant to the types of jobs you're looking for, if that exists in your area. Temp to hire, as I'm sure you know, used to be the big way to get a job and there's still a surprising number of smaller companies that outsource hiring to a temp agency. Worst case, it can get you into something to pay your bills while you continue to look for something else.\n\nTap any contacts you have and let them know you're looking. I know that's more difficult because you're in a new area so your contacts are likely out of area, but I thought I'd mention it. In this age of increased globalization, people connect in unexpected ways sometimes. I got a text message yesterday from a former coworker at an accounting firm offering to introduce me to someone he knows that's hiring an accountant at a manufacturing plant. Will it pan out? I don't know, but it's an in I didn't have when I applied for that exact same job a month ago and got auto-rejected.\n\nMost importantly, take time for your mental health. I've really struggled, in the last three months, adjusting to the reality of this job market with scammers, ghost jobs, ATS, and reading non-stop LinkedIn posts from recruiters about things applicants do wrong while contradicting each other.",
          "score": 8
        },
        {
          "body": "I am in my early 40s and having similar issues. You are not alone in this.  \nIt sucks, I feel you.",
          "score": 5
        },
        {
          "body": "The media are calling it a white collar job collapse. It's been going on for 2-3 years - much much harder to find work. I know people with PHDs in STEM who are working as delivery drivers.",
          "score": 4
        },
        {
          "body": "I’m 52 was laid off 2/28 I’ve had several interviews and two offers. I’m in sales in the supplement industry so it is more niche, and I don’t think ageism is a factor. Actually, I applied for my old position that I jumped ship for, and they actually hired a lady that had to be at least 65 years old, so there you go! If I were you, I would take older employment history off of your resume. It’s just tough out there now, which is why I took the first offer when I got it early March and worked there for a month, kept looking and then just got the second offer on Wednesday. I know it’s exhausting but keep pushing something will come through for you!",
          "score": 4
        },
        {
          "body": "I’m going to start modifying my resume for each job I apply to. I didn’t want to have to do that but I really thought I’d be hired by now. I’m also irritated with interviews that make me think I’ll be hired and then they don’t hire me. It’s not the time to be kind, it’s the time to be honest.",
          "score": 3
        },
        {
          "body": "Everything I’ve read about ageism says take the dates of education off your education and follow similar advice from /u/Moneygrowsontrees",
          "score": 3
        }
      ]
    },
    {
      "title": "Trying to stay positive",
      "body": "Paid an Etsy witch $5 for a job spell (lol). Got an email asking me to interview the next day. Interview went amazing. Was told “I have a gut feeling about you”. What’s holding me back is that I have 0 professional experience and he’s unsure if the rest of the hiring team is willing to take that chance on me. He said that he would really vouch for me.\n\nI try not to put all my eggs in one basket but it’s hard to not think about it or worry about it. It’s been so hard to find a job and this is the closest I’ve felt in a while. How do you get out of those negative feedback loops?",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/1ld9prr/trying_to_stay_positive/",
      "comments": [
        {
          "body": "Tell yourself you already got the job. Build your confidence. Believe it. If it falls through just means that it wasnt for you.",
          "score": 5
        }
      ]
    },
    {
      "title": "I’ve been applying for a steady job since January 2020. Is anyone else having the worst of luck as me?",
      "body": "I’ve had several jobs since last year but they’ve been short lived and they didn’t pay much at all. I had an unpaid internship for 3 months, a design job for 3 months (quit because it was a freelance position and they were super sketchy), worked at Subway for the the time being and I had to quit because of being poorly treated and they had the worst management. \n\nI constantly keep having interviews but I’m constantly rejected. I’m a female applying for web design positions and I’ve been told my work looks like I’m a 7-10 year veteran. I recently graduated college in April of last year - I’m almost 30 - and my career isn’t even started yet. The constant rejection is wanting me to try to open up a second business. But I dislike having to design my own brand, make my own branding guide - let’s say I like designing for myself, but I also don’t like designing for myself (since I’m a web/graphic designer). I feel like branching off my current brand to its own site after being on Etsy for almost 4 years. \n\nAre these things going against me as well? My last name is now Hispanic, I’m blonde, I look very young for my age and I have so many short jobs in my relevant experience section. On top of that, there are so many people applying for jobs and the market is over saturated. I had someone look over my resume and paid them. Should I start wearing glasses in my Linked In profile? \n\nAnyone else struggling?",
      "subreddit": "jobs",
      "score": 15,
      "url": "https://reddit.com/r/jobs/comments/liajny/ive_been_applying_for_a_steady_job_since_january/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I honestly think that more than likely you would’ve had a job if covid didn’t hit. I honestly write off anything from March 2020 until now. It’s not like it used to be competition is extremely tough and it’s definitely possible to get a job but it’s infinitely harder",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Yep you're not alone there friendo! Lots of oversaturation, 500 applicants per job listing on LinkedIn for Junior roles. Not alone there. Keep refining your portfolio (what I tell myself) and just hitting up friends and people you know if they need some help with branding or designs. I've done around 5 design tests or so, I'm verrrry close to being done. Just reminding myself to keep bashing out a few apps a day till something snags. I'm just saving aggressively into BTC and crypto and doing design for fun at this point.",
          "score": 1
        },
        {
          "body": "Hi op I saw your other post about applying 200+ jobs and found this other post, I used to be a web designer, if you want you can send me your portfolio and I might be able to give some suggestions if your portfolios need to improve.",
          "score": 1
        }
      ]
    },
    {
      "title": "I recently graduated and I don't really like my degree anymore..",
      "body": "Hi everyone! \n\nI was hoping to get some advice on my current problem. I graduated in July in Fashion Design but I've come to realize that this is not quite my thing... While I've been job searching I took an online course from a very good uni in Fashion Buying and Merchandising and I loved it. The problem is that all the job posts that I find require a business, management or marketing degree which I of course don't have. I'd like to do a postgraduate in buying and merchandising in London but if they accepted me that wouldn't start until September. At the moment I'm helping a friend with a product she's developing for her startup but that's no where near a full time job for now and I also opened an Etsy shop to keep myself working on something. \n\nNow, the thing is that I don't really know what type of jobs to apply to in the meantime. I did get two interviews with important companies for jobs that could have been a kind of stepping stone to what i'd want but they didn't call me back.. Should I try applying to some marketing internships? Should I also apply to my dream jobs even if they ask for a degree I don't have? Any advice from people that had a similar problem once they graduated? \n\nThank you!",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/ev49v4/i_recently_graduated_and_i_dont_really_like_my/",
      "comments": [
        {
          "body": "What I've found is a relevant degree only makes things easier, it doesn't make something impossible. There are definitely exceptions but this isn't one of them. What you need to get VERY good at is learning how to twist your experience and education into something relevant for the position. Also, patience and networking as much as you can. I really don't think going from design to merchandising/buying is that much of a stretch. You just need to twist your resume and interviews to show your background isn't a hindrance, it actually makes you the perfect person for the job. I'd even argue getting another degree or certification isn't necessary.\n\n\nIf you are getting interviews, you are on the right path. It means they already saw your background and liked it. No one interviews candidates and wastes their own time with the expectation that the candidate is a bad fit. Think of it this way, would a company want everyone from the exact same background to fill positions? Or would they want a team comprised of varying backgrounds to get a diverse perspective? Don't let a requirement for a business degree fool you. I've seen people with acting backgrounds get accepted into law school, computer science majors go into finance careers, and math and English majors go into marketing. Heck, even my own boyfriend was hired in marketing for a fortune 500 with a biology degree. If you ask around my own company in finance, you'd find more than half of them don't have a business degree of any sort yet are directly working in financials. A degree on it's own is worth something. You just need to get better about selling WHY it makes you a good fit to potential employers.",
          "score": 3
        },
        {
          "body": "You're using your degree in helping your friend right? You are also running your own Etsy shop. Write that resume to highlight the marketing and managing of your shop and apply. Then own the fact that it is successful and figure out what applies from that experience to your dream job.",
          "score": 1
        },
        {
          "body": "Are the jobs fashion merchandising related? Or are they more broad, general \"business\" jobs? If they are related to merchandising such as buyer, display merchandiser, etc. your skills are definitely transferable. Your knowledge in history of costume, construction of garments, draping, etc. can all be applied \\*to the principles needed in fashion merchandising roles. Merchandising typically does include more of the business side, but the degrees absolutely overlap.",
          "score": 1
        },
        {
          "body": "For what its worth. A Fashion Design degree is relevant to most entry level jobs at a fashion design company. Have you tried applying to entry-level business roles at those companies?",
          "score": 1
        }
      ]
    },
    {
      "title": "Remote Job at 70k vs Hybrid Job at 90k",
      "body": "I'm currently debating on leaving my current job. I'm an engineering manager at a small engineering firm and have 4 designers working underneath me. I'm pretty much fully remote, I'm set to make \\~70k if I work 40 hours. I'm paid hourly and our workload has been low for about a year. Which has caused me to work less hours and only actually pull in \\~55k. I can make my own schedule. Take off whenever I would like by just sending an email before I head out. I run a small etsy shop and ebay store on the side to help make some of that money back since I have a good amount of free time. The job feels a little unfulfilling and I'm becoming bored. I usually don't have much to do and end up sitting around waiting for things to come in. There's not really a way I can log hours without doing actual work since our company is so small which effects me financially. I make enough to be comfortable. Have a house and a nice car. Wife works a full time job that makes more than me. No kids.  \n\n\nI have an interview at a large company as a senior engineer that has a range of 90k-130k. It's a hybrid job, but I am unsure of that schedule. I know that my freedom of work schedule and ability to take off will be greatly effected. I'm afraid that I could be making a big mistake by leaving my current \"Cushy\" job for something much more stressful.   \n\n\nI'm really battling in my head if I should continue the route of a new job, or continue my current job and try to make the best of it.   \n\n\nTLDR; Bored at current job and not making my full salary due to workload or leave to a potentially more stressful job for more money and fulfillment.  \n\n\nFirst time posting! Thanks!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/161236d/remote_job_at_70k_vs_hybrid_job_at_90k/",
      "comments": [
        {
          "body": "Practically double the pay and it’s still hybrid? Would take it in a heartbeat",
          "score": 1
        }
      ]
    },
    {
      "title": "What am I doing wrong in looking for a job?",
      "body": "6/29/15: Got my long-awaited rejection email. Recruiter/hiring managers thought I would be an excellent fit but apparently not enough to not get passed over. Apparently my \"skills and abilities go beyond this role.\" I'm so done.\n\n6/28/15 EDIT: Thanks everyone for your advice. I feel marginally better, but I still wasted my weekend moping in bed. I filled out a few applications  but felt really down the whole time. I keep filling that until I secure something I want, I can't relax completely. Also, I AM going to finish my degree, most likely by transferring credits from a public school. I'm not sure if I can get financial aid for less that 15 credits or even a full year at my Ivy, but  I'll get in touch with fin. aid to get their verdict.  I'm not 24 for another year, so I can't declare myself an independent, can I?\n\nI still owe them $2k in past due tuition, but I'm hoping to clear that out with my next paycheck (idk where that's coming from at this point. I'm registered for 2 night classes this fall at a public college, so I'll have 6 credits left after this semester.\n\n\n\nI also posted this in /r/depression because I've been feeling really shitty over the past few weeks.\n\nI'm sitting here on a Saturday night filling out job applications instead of going out with friends. I'll be doing that tomorrow...and everyday next week too.\nI'm waiting for the rejection email to come on monday, letting me know that the media finance job I interviewed for last Thursday went to another candidate, after the recruiter informed me I would be getting a decision the same day/Friday and after confirming salary range, start date, and work authorization, and even taking me on tour of the office and where I would be sitting. Radio silence on Friday after I sent an email asking for updates; I know the recruiter opened the email but didn't respond from email-tracking software.\n\nThis is the 6th rejection after a final round interview in the past month alone. I recently stopped freelancing, and am living off my savings now. I'll be okay for another 2 months, but with all of my freelance work dropped, I don't have anything once my savings run out. I don't have parents I can rely on for help, or any relatives/friends willing to help me financially.\n\nAbout me: I dropped out of a top-10 ivy undergrad 2 years ago because I couldn't pay tuition for my last semester. I paid for my entire degree to date through freelance work/internships/workstudy and have a 3.7 GPA. My SAT scores are 2300+. I have only 12 credits left, which I plan to finish in 2015-2016 through transfer and research credits from a public school.\n\nMy parents are food service workers with no college education, and I'm estranged from them (due to me wanting to go to a school beyond what they could afford). I took up freelance work to pay for my remaining credits, and also stay in my current city(so I could land a full-time job soon). My degree is in comp sci and econ, and I have substantial internship experience in accounting,web design+dev, and account management (1.5-3 years for each field). \n\nI started freelancing full-time a year ago to make more money for school, but I hated it--I never felt that I belonged to the company culture at any particular client and was working 80 hour weeks regularly to keep up with client demands. I let go of all of my clients a month ago, letting them know I was going to transition into a full time job elsewhere (a mistake in retrospect).\n\nI've interviewed at mostly large digital agencies/media companies and the biggest tech offices on the East Coast(Google, Microsoft, NBC, Etsy,etc.) for entry-level tech, consulting, and finance roles (0-1 year experience). I send thoughtful thank you emails an hour after each interview, and check if my interviewers opened the emails. I even research the Linkedin profiles of the job I interviewed for--almost all are filled by people with less experience and lower academic credentials. I've always made it to the final round interview, being told I was the top candidate, only to be rejected a few days later. I went into this latest interview expecting the same thing, but the salary and start date chat, along with the hiring managers being OK with my soon-to-be-complete degree, got my hopes up against my better judgement.\n\nI feel really tired and I want to give up. I lost touch with a lot of my friends from school who have graduated and now have the jobs in tech and finance I thought I would have in 4-5 years ago. I've been sleeping 10-12 hours a day, only getting out of the house for interviews. I keep thinking about how much time I wasted daydreaming about working at all of the places I was rejected from. \n\nMost of all, I regret spending tens of thousands of dollars for a degree that hasn't gotten me where I wanted, when I could have gone to a public school, graduated on time, and at least be employed full-time somewhere by now. I don't have a bf, or any close friends because I've been so busy working and worrying about my near future.\n\nWhat am I doing wrong? Is it my gender (f), ethnicity(Asian), lack of complete degree? Am I too ugly for the jobs I'm applying for? Do I come across as too poor and desperate, and not a good \"cultural fit\"? Am I not interesting enough (because I spent all my time working to make ends meet so I couldn't spend time on vogue hobbies like travel)?\n\nAnd what can I do better? Take the GRE/GMAT? Take more programming/finance classes? Lose weight? Dress better?\n\nSorry for the long post, I had a lot more to vent about than I thought. Any advice appreciated.\n\nHugs, Doughyes",
      "subreddit": "jobs",
      "score": 11,
      "url": "https://reddit.com/r/jobs/comments/3bd65x/what_am_i_doing_wrong_in_looking_for_a_job/",
      "comments": [
        {
          "body": "I had a hard time believing this at first.\n\nIf you went to a ivy league why didn't you complete it? Take some loans out and get an actual degree because that'll make some difference. Not to mention if you're unable to afford it and your parents are not able to then you should be able to get a generous financial aid package. Even if you have to take a sizeable chunk out you should because the return is much higher than an average state school. You'll be netting jobs in the 70k to 100k ranges, I'm surprised you're not already...\n\nYou went to an Ivy League with a 3.7 GPA and a double major in CS and Econ + plus a bunch of experience doing freelance work and likely have a portfolio. You're a target for all the management consulting firms, Wall Street, or tech startups. You have one of the most ideal resumes for someone looking for a job.\n\nAnd you only listed the bigger company's like Google, Microsoft, NBC etc. There must be a whole bunch of companies you've missed out on or haven't even thought of. I bet a combination of this and maybe interview skills are what's holding you back.",
          "score": 8
        },
        {
          "body": "&gt; My degree is in comp sci and econ, and I have substantial internship experience in accounting,web design+dev, and account management (1.5-3 years for each field). \n\nCould it possibly be that the competition in your area is incredibly tough? \n\n&gt; I've interviewed at mostly large digital agencies/media companies and the biggest tech offices on the East Coast(Google, Microsoft, NBC, Etsy,etc.) for entry-level tech, consulting, and finance roles (0-1 year experience)\n\nIs it possible to begin looking at smaller profile companies? Are you okay with a lower salary? Looking at the companies you just named... the competition at those places extremely high. And without a degree, I'm sure that puts you at a comparative disadvantage.\n\n&gt; And what can I do better? Take the GRE/GMAT? Take more programming/finance classes? Lose weight? Dress better?\n\nI would say no to the GRE/GMAT for now. Preparing for those takes a lot of time and effort, and it already looks like you are running on borrowed time. **My advice to you is to aim a little lower if you haven't already.** Based on your qualifications, even without a degree, your work and accomplishments speak for themselves.\n\nIf you wish, we can continue this conversation per PM. Feel free to \ncontact me. \n\n\n\n\n\n",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "1) Your success rate so far in getting interviews and being a final candidate is an incredibly good sign. I know it stinks being rejected multiple times but what I'm hearing here is that plenty of employers think you're hireable.\n\n2) The job that's currently on the table is by no means off the table. This is a 1-2 day delay--it doesn't mean anything definite. \n\n3) Not to poke a wound, but you say \"almost all are filled by people with less experience and lower academic credentials.\" My guess is all or some of these people have degrees. For better or worse, having finished a degree is important to some hiring managers. I also hope this level of judgemental rhetoric is reserved for your internet rants and doesn't show through in your interviews. If I'm bringing someone onto my team, I'm more inclined to bring on talented people who don't present themselves as full of themself.\n\nJust keep doing what you're doing. Maybe apply to some slightly smaller companies in your target industries, too. Great brands like Google have tons of applicants whereas you might really stand out in a smaller org's talent pool.\n\nGood luck.\n\n",
          "score": 2
        },
        {
          "body": "I'm having similar problems in the job hunt, but I'm finally getting interviews... after 18 months of applying and random interviews.  Being a woman and interviewed many times by a woman has been challenging.  Tomorrow, I have an interview with a man and I'm hopeful.  I'm far older than you and you have so much going for you.  If you can finish your degree - even if you have to transfer elsewhere - do it.  No one can take your education away from you.  And you need it.  There's a new business model where entry level positions are unpaid or paid internships.  It's awful and making it more difficult to navigate getting a job.  That said - I have some tips if you want to PM me directly.  I don't want to bore people with my tactics.  Good luck.",
          "score": 2
        },
        {
          "body": "I'm thinking you are not dressing correctly for the job and/or your resume (CV) needs to be reworked. A shitty resume (CV) can make or break you. Also, are you researching the company’s to prepare for the interview questions?",
          "score": 1
        },
        {
          "body": "You should finish your ivy degree. ",
          "score": 1
        },
        {
          "body": "You know, I don't think this is an /r/jobs problem. You've got a great resume, the know-how to land an interview with big name companies, and are close to an Ivy League degree (which you should finish, by the way. Figure out how and just knock it out). You mentioned that you have been feeling torn up and frustrated by this. It's not that you're not a good \"cultural fit\" or any of the other nonsense. I'd be willing to bet some of that frustration and desperation has come out in your conversations with these recruiters.\n\nI'll say it straight up, because we've all been there. You need a break. Go camping. See some friends in another city. Do something to get your head right and then come back with confidence and drive.",
          "score": 1
        }
      ]
    },
    {
      "title": "I got the job! Thank you (again)!",
      "body": "Not for [the first time](https://www.reddit.com/r/jobs/comments/1kox1s/i_got_the_job_thank_you/), /r/jobs helped me get the gig! I wanted to thank you all so much for your advice and insight, and include a few tips I've picked up along the way.\n\n**Get yo' resume lookin' fancy**: So, I confess. I've always been pretty lazy with my resume. With a not-insignificant number of applications drawing from my LinkedIn profile instead of an actual resume, I didn't bother formatting it to anything particularly presentable. It was more or less a glorified list with dates. This time around, however, I stepped up my resume game. I got a resume template on Etsy (the level of design you'll want to look for will vary by industry - I got one that was professional looking, but not overly ornate). I spent a couple hours one weekend personalizing it. For &lt;$15, my resume looks amazing.\n\n**Use a spreadsheet**: This is actually something I saw recommended here and I wish I had done instead of being a bum about it. I kept track of my applications each day in a notebook, writing down the job title and the company (er, most days anyway). I wish I had a full spreadsheet with columns for job descriptions, salary quoted (if shared), dates of contact, notes from interviews, and more. It sounds tedious and like a total pain in the ass, but this is the first thing I'll set up the next time I'm looking.\n\n**Do your research**: Knowing to do your research on the company is a given, but also do your research on your interviewers. Don't shoehorn \"I internet stalked you\" into the conversation, but allow it to come up when appropriate. For instance, one interviewer started with \"So I see you went to college at [School]\" and I replied \"Yes! You also went to school in [the same city], didn't you?\" He smiled and we had a short conversation about that city and a few local places we liked. Be friendly and conversational, not creepy.\n\n**Anticipate their questions**: Sure, I've always had canned answers prepared to \"What is your greatest weakness?\" and \"Why do you think you're a great candidate?\" but (stupidly, perhaps) I never gave much thought to less generic questions. I looked at it from the company's side, and asked myself what they would want to know about me, my experience, and my career goals. During my interviews (which came in 4 stages, talking to a total of 8 people), they all asked a variety of questions and I only got caught off guard once. (The prompt that surprised me was when they asked me to choose any coworker, and describe them. After I did, they asked how they would describe me. It was a really interesting question, and I still haven't quite figured out what they were looking for from it. Any ideas?)\n\n**Figure out really good questions**: This used to be the part of interviews I hated. \"Do you have any questions for me?\" *Um, yes, will you give me the freaking job?* I could half-ass some questions about culture or whatever, but at the end of the day I just wanted them to hire me. As it turns out, potential employers get real impressed when you ask thought-provoking or interesting questions about the company or the role. There are a ton of articles with suggestions, but I like \"What do you foresee as the biggest challenge for the person in this role?\" and \"What personality traits to you consider important for someone both coming to this role and the company in general?\" I try to expand a couple questions into a genuine conversation, asking further questions based on their replies. And I always end on a positive note, asking \"On a more personal note, what is your favorite thing about working for [Company]?\" Hopefully they have fond memories of their time there and you both leave smiling.\n\n**Thank your references**: This is obviously a post-interview tip, but I sent each of my 4 references an Amazon gift card after I received word I got the job. It's a nice way to say thanks, and I'm not above bribery to incentivize their willingness to say nice things about me again in the future.\n\nThanks for the help again, /r/jobs!",
      "subreddit": "jobs",
      "score": 44,
      "url": "https://reddit.com/r/jobs/comments/4trlhz/i_got_the_job_thank_you_again/",
      "comments": [
        {
          "body": "Congrats. Which job did you get?",
          "score": 6
        },
        {
          "body": "Congrats!!! I have an interview in two hours for a career I really want. So nervous and excited.",
          "score": 3
        },
        {
          "body": "&gt;The prompt that surprised me was when they asked me to choose any coworker, and describe them. After I did, they asked how they would describe me. It was a really interesting question, and I still haven't quite figured out what they were looking for from it.\n\nInteresting. I could see them learning a variety of things from it: \n\nSusie's a lazy asshole, she'd say I'm a rockstar. (You're an obnoxious putz)\n\nSusie's my favorite co-worker because she's smoking hot. She'd say I've got awesome abs. (You're a lawsuit waiting to happen)\n\nI enjoy working with co-worker Susie because she's a very thoughtful, smart, and kind person, and I think she'd describe me as friendly, organized, and courteous. (You probably have decent social skills)\n\nMy co-worker Susie is great to work with because she's super organized and a great leader. I think she'd describe me as a quick learner and someone who's always willing to jump in and lend a hand. (You can recognize the strengths of others as well as your own)",
          "score": 3
        },
        {
          "body": "Congrats,  all good tips. especially the section about anticipating less generic questions.",
          "score": 2
        },
        {
          "body": "I can't get an interview.\n\nWhat's the standard percentage applied to to get an interview?\n\nI can't say for sure how much I've applied to....maybe 25 jobs. I've had one interview.\n\nWhere are you applying? My standard would be the company website itself,\nLinkedIn. I have since had my resume redone by a professional and drastically beefed up my\nLinkedIn. ",
          "score": 1
        },
        {
          "body": "Congrats. However, in the do your research part.\n\nIs it bad to let them know that you looked them  up? I mean if you asked, \"YOu went to the same school I did right?\" wouldn't they asked \"how did you know?\".",
          "score": 1
        },
        {
          "body": "Good tip on the resume. I've felt that my resume is also very messy and disorganized. While I don't condone paying for a resume template or advertising, I think it's an interesting resource to look at for help. ",
          "score": 1
        }
      ]
    },
    {
      "title": "My job is no job",
      "body": "Hi there!\n\nA little backstory... I am currently living in Canada. I have almost 10 years of experience in the administrative field. Since COVID-19, I had 2 full-time jobs. One was ended when COVID-19 started (I just started it), the other one was offered to me by an ex-coworker. I didn't keep that job very long because I was let go and anyway, I didn't want to continue (a lot of unpaid overtime, a toxic coworker who runs the show, the company bought another one, so the volume of orders was 10 times what it was, new buildings, new warehouse and rookies)... So much change at the same time! After 4 months, I left!\n\nSo, I am unemployed since mid-September 2020. I didn't search for a job right after as I tried to be my own boss. I tried my hands at several things (Etsy, Tupperware) but didn't find it successfully and worth it. After 2 months, I stopped.\n\nI started to search for a job a few days before Christmas 2020 and got in touch with an HR agency, networking, ads, etc. The recruiters started calling me the first week of January and so far I had 5 Zoom interviews. The rest was pre-screening on the phone, etc.\n\nI, myself, had to screen a lot of recruiters and for some of them, I didn't want to pursue to the point of getting a Zoom interview.\n\nI am also contacted via Linkedin by headhunters, so I am assuming my resume is not too crappy.\n\nOne of the recruiters I had an interview with told me that I was in the top 3, but it didn't prevent me from not getting the job.\n\nNow, it is mid-February and my unemployment is ending in mid-March. My freelancing gig was started in mid-January and I got several small little contracts (I want to start small, baby step)\n\nWhat am I doing wrong?\n\nI am fed up!\n\nThanks!",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/lngizc/my_job_is_no_job/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "&gt; What am I doing wrong?\n\nNothing from what I can see. You are applying for jobs, getting call backs, and landing interviews. What result are you expecting that you are not seeing?",
          "score": 2
        }
      ]
    },
    {
      "title": "Should I do another unpaid internship? I already had 2 but I want to get a paid job now...",
      "body": "Before I graduated back in May 2020, I did an internship for class credit. It was unpaid and while I did learn some things, I realized that experience was still not enough for me. I realized it since after May, I went through a lot of interviews while job hunting but I received no offer for a solid 5 months...Until November hit and I just went for another unpaid internship that I felt would help me grow more in my field and I definitely grew more experience with that one (plus I got a one-time commission pay, discounts, and free stuff lol) \n\nMy second internship is about to end and lately, I am in the works of making an Etsy shop with my sister! I want a paid job right now because I want to help invest in our business, help pay back my student loan, and also help my parents (who is still providing for me). \n\nI’m actively looking on Indeed for remote work but, in my field (Art/Graphic Design), entry-level design jobs will always be competitive (even more so because of covid). \nThere are job postings where I meet the qualifications and experience but I guess in that selection pool, there are much more experienced people. I’m losing my mind but I’m not giving up on applying. But while I’m still searching, there is one unpaid internship that attracted me because of the opportunities to grow. BUT, I really want to make money now :( \n\nI was thinking that if I don’t get a paid job in my field this month, I’m thinking about more side hustles other than my Etsy shop, like becoming an online English tutor or survey test taker idk \nI’m wondering how many unpaid internships have you all went through to finally get a job in your field???? Also anyone going through the same or similar situation as me, please share how you’re coping with this. Any advice is welcomed!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/l2atpq/should_i_do_another_unpaid_internship_i_already/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Alter your resume to the job posting.\n\nAlso do some graphic design gigs on fiverr to make extra money",
          "score": 3
        }
      ]
    },
    {
      "title": "I can't figure out what is wrong with me",
      "body": "So I'm between the age of 30-35. I am high functioning autistic. Before the virus hit I finished my last degree, and now I have a total of 4 degrees. (long story short, I gotten an aerospace degree but the job market collapse. During this time I tried working a number of jobs, but I kept getting fired or was so depressed from working and getting harassed at work I've became suicidal. So instead of doing nothing I went back to school for a general computer degree. This was an AS since I couldn't afford to go directly for a BS. While I was there a teacher mentioned to me that I was only a handful of classes from a networking degree. One of the 2 was a 2x2 into my last degree which is a industrial degree with a focus on cyber security.) The first degree I almost didn't get due to my grades and I was having a hard time in school. For the rest of the degrees I was taken at max 2 classes at a time since that was all I could handle. In fact, at several points I tried working while doing this and I couldn't even handle that. The most I was able to deal with is what I do now. Selling stuff on Etsy using my 3D printer, making YouTube videos once in a while, and a few small things to make some money (like $100-$200 a month total).\n\nAnyways, during my AS I notice when I was able to get something that could get me into something down the road like being an intern. I flaked out on it. Like I did things like made applications for my school and stuff like that. But those were 1 off things.\n\nAfter getting into my BS I found everything was going good and my grades were good enough. I did at one point try more than 2 classes on my technical side and my grades dropped to the point where I almost gotten kicked. But as long as I kept it down to 2 classes, my mental state seemed to be at least to the point I could keep up with the test (it should be noted even with this I had to cheat in a number of classes even when taking 2 classes at a time). The reason why I'm bringing this up is towards the end of my degree I had to take a lot of stupid classes like one on weather, another in microeconomics, and a few others. Because I spent so many years in school and I just wanted it over I did a full 4 classes back to back for 2 semesters. This 10000% burnt me out, and I literally had to beg my teachers to pass me. If it wasn't for a mixture of cheating and begging to pass, I know I wouldn't of made it.\n\nShortly after I gotten out I found out even with a degree no one still wanted me. I tried using my contacts a few times, and found many companies flaked out during meeting me or when they found out I'm autistic. Even with applying to higher end jobs than the manufacturing jobs I applied for in the past. I found in some interviews I was harassed for how I talk and think. Like flat out picking on me and laughing about it. In some jobs they kept lying about oh we are looking for x (coder, network, etc) and the people trying to help me said I can do x y z. And then they would interview me for 100% different job.\n\nAround this time I tried to enact my backup plan which was to go into the military. I found out the military literally has policies from autistic people from joining. My dad looked into it since he had connections to major generals, and more than less the policy was put in after a few autistic people were harassed to the point some offed themselves and some were hurt so badly that there is an investigation on it still today. So it's more to protect us than anything else. And it was made in such a way that even if you did get in, you have to get it OK with every commanding officer, and pretty much anyone in the unit can make a stink about it which would end up getting the person kicked out. Like it's better for that than the person getting hurt or dying.\n\nAfter this I started looking into things because it didn't make sense to me. I did everything that was asked of me. I stayed away from drugs, crime, etc. I actually went through college even when my teachers in HS said I shouldn't be able to graduate HS. I stuck out what jobs I could and only quit 1 job, but that was by force. And while I did get fired from many, I went out of my way to show I knew how to code and what not. Anyways, I came across studies saying people who are autistic and have degrees are 85% likely to be unemployed or underemployed. And I found studies on how the UK looked into how much of the homeless is autistic, and they found around some of the cities it was 65% or more. Then I found it was highly common for autistic people to be abused in work places and other places.\n\nI brought a lot of this up to my parents because it was looking like I simply am not going to get anything that will put a real dent in my life. Like beyond the fast food/retail industry. They agreed I can stay with them as long as need, but we made a plan. Where they would buy a farm and have things contracted out. That I would help them get it up and running, and keep things up. And I can be the farm manager. While this does make me happy, it should be noted that it's estimated that it will take close to 10 years before I would get a livable wage. Just harvesting the crops it will take 7 years for much of it to mature to that point.\n\nAnyways, what brings me here is I'm having a hard time figuring out what is wrong with me. The other day I found a basic help desk job on indeed that I could get if I put in for it and it wasn't already taken down (maybe, some of these they hire people with multiple years of experience because the job market in my area is so poor). My anxiety shot up to the roof and I was extremely suicidal. And this was simply for seeing there was a job I realistically could get. And this that happens isn't anything new.\n\nSo my anxiety is always up because I know if my parents get tired of me or want to just because. There isn't a single thing I could do to prevent myself from being homeless since I don't have the money/income to support myself. And then when it comes down to looking for any job and seeing there is one I could work (even part time), if I had a gun next to me I wouldn't be talking to you now.\n\n**What is wrong with me? And don't give me the crap that there isn't anything wrong with me. This isn't normal.**\n\nNote, there is a number of other things going on and a bit of info I didn't talk about since I don't think it relates. Like how even today I'm trying to work on doing independent product development and a number of other things (but none of it has made me anything). I mean something that might relate is how my entire family outside of my dad's parents, my parents, and maybe 2 or 3 others 1000% hates my parents and I. I believe it is due to my sister lying about us. And the only thing I ever wanted in my life since I was a kid is a stable family and stable life. But the details going beyond that, I doubt it relates.",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/k54s0m/i_cant_figure_out_what_is_wrong_with_me/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "It’s really good that you have made different plans, but to me it seems like you discount yourself before even starting them. I would try getting a job and sticking it out. For example, don’t think of all the things that can go wrong. Just do it and get a foundation built. You decide more than things you read on the internet.",
          "score": 2
        }
      ]
    },
    {
      "title": "finally got a job interview in a digital marketing role, any advice?",
      "body": "Long story short I live in a quiet industrial city that has very few marketing jobs supply. AND it's been months since I got such an offer.  \nWell, since I graduated in the bach. of BA I somehow been craving to work in the creative field. So I did:\n\n\\- international internship in marketing and communications   \n**gained skills:** website (WordPress) administration, social media posting, FB ads (3weeks)  \n\\- seo assistant (two months)  \n**gained skills:** only reputation management  \n\\- launched a very small online service (consultations) business in the very past  \n**gained skills:** customer service &amp; communications, managing-prioritizing, driving traffic&amp;conversions (via old fashion forum marketing - actually I had more than enough reach for target auditory &amp; FB wasn't pop)\n\nI don't feel confident enough / having the background to work in a higher than junior role.\n\nA company that called me asked me some difficult questions - I only gave positive response such as \"I'm willing to learn\" \"I'm sure I want to work in digital marketing\" \"well I hear you and I'm sure I'm the right fit with my soft skills\" and still want to meet me. Prob because of the dry market.\n\nThe role sounds more like a mid-senior Digital Marketing specialist.  \n\\- do I know how to run successful Facebook &amp; Google ads?  \n\\- do I know how to measure them?  \n\\- do I know how to set and measure the marketing budget? create and achieve goals?  \n\\- how keywords are working?\n\nthat's all I've got in 10mins, I'm not willing to find it easier during the conversation.\n\n  \nThe company is selling amber worldwide they have \\~3-4 websites and are on many platforms like etsy ect.\n\nI was thinking somehow to do: competitor analysis, give some tips on social media (right now all they say is \"hello buy amber or contact us + photo\" they are not creating any content that attracts.\n\nAny tips? Anything I can come up with a day? What can I do to be ready for the interview?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/m5pz4o/finally_got_a_job_interview_in_a_digital/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Advice: in a low paid, low hour job, and want to better myself - how?",
      "body": "I'm after a bit of advice. I work for a financial start-up, and the role is pretty low paid compared to the market rate. I took it because I wasn't getting any other offers. \nThe job is supposed to be part-time but fluctuates wildly in the hours I am expected to work. Sometimes it takes me 35hrs a week to complete the tasks I'm set, and some weeks it is more like 10hrs. \nI was wondering how I can better myself, and my resume, to open up other opportunities or bring in more money - the only problem is I have a lot of time but very little cash to spend on training. \nHas anyone got good results from MOOCs? Do employees actually pay attention to those? Or would it be better to put my time into my own small business ideas (or etsy or similar) and bring money in that way? \nBasically, what would you guys do to better yourself in this situation? All help and advice gratefully received. ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/3pgu26/advice_in_a_low_paid_low_hour_job_and_want_to/",
      "comments": [
        {
          "body": "I'd recommend the long road as you sound employable. Plenty you could do to improve your opportunities. Start by practicing to write applications to different types of jobs. Submit all of them to see what feedback you get. When you get interview offers, use the interviews as practice for interview skills. If you get some job offers, consider taking them. Go back to your resume and update it with your new job and skills learned. Repeat. At some point, when you can afford to, take a distant education course with a reputable institution. Add that to your resume and continue applying for jobs and doing training courses. Good luck.",
          "score": 1
        },
        {
          "body": "You could always use the Internet and train yourself. There are loads of sources online for free that you could use to better your skill set. For instance, if I wanted to learn photoshop, there are hundreds of tutorials right on Youtube, and that's just Youtube. Everything you need to learn is at your fingertips. ",
          "score": 1
        }
      ]
    },
    {
      "title": "How to land this job that I have no experience in.",
      "body": "I received three messages from a recruiter of a clothing company asking me to talk about an ecommerce customer service assistant position. I have basically no experience in the fashion/ecommerce field besides me owning an Etsy shop and putting it on my resume. For some reason this was good enough for them to ask me for a conversation before they schedule an interview. I'm going to try to really show off my Etsy shop owning skills however, I do not know if it is enough. I can mention assisting customers with information, develop and creating products and so on and so forth.I want to impress this recruiter as I currently am not working and my last job was at a pizza place. The only downfall that I can think of is them asking for fluent Spanish. I am a native Spanish speaker however, it is not the greatest. Any tips on acing this?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/ptq6od/how_to_land_this_job_that_i_have_no_experience_in/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm frustrated as hell. How do people get/find ridiculously well-paying under-the-table jobs that require little work? (Example inside)",
      "body": "I'm frustrated folks.\n\nI won't go into the details about who I am just to save time because I have to head off to my $10-an-hour bust-my-balls job in about 45 minutes.\n\nMy girlfriend, who has had a lot of trouble looking for jobs in the past, got a job back around... October/November.\n\nShe INITIALLY went in to apply for a Starbucks position. The manager there just HAPPENED to be a rather entrepreneurial gentleman who had a whole bunch of little businesses up his sleeves.\n\nApparently, during the interview, he just flat out offered my girlfriend a job posting his sports related stuff on eBay for like... $25-$30 an hour (estimated but not fixed). According to her, it's never very hard work either. She's in front of a computer screen at the office all night. She has a lot of computer background (not technical background) because she ran a small Etsy store for her Perler bead creations for a very short time. She's a graduate massage therapist and nothing beyond that. In her words, she doesn't really have any significant outstanding skills aside from texture design (from her days of being an IMVU developer) and just being an artist in general. She's also never had any job experience beyond her self-employment and babysitting/dogsitting.\n\nFast forward to the week before Christmas, dude offers her a job doing tours at a local retirement home in order to get clients saying she could make potentially $5,000 a day in commission alone.\n\nHaven't heard much about the offer since, but that job aside, how to hell do you find these people that just want to give you a crap ton of money to do their lazy work?\n\nI put it that way because the way she describes her boss, he's tired. He's in his 50's, runs a lot of businesses, and just hires people to do the standard work; essentially, his employees are what automates his business.\n\nThe dude is just flat-out loaded (supposedly). Aside from the suspected $25-$30 an hour, he'll randomly just pay her like... $500 a night if he feels like she and the other employees did good work.\n\n(Just for the record, I've been up and down the gambit of 'the-creepy-old-man-who-simply-wanted-a-pretty-girl-working-for-him thing'. After months of skepticism, I'm convinced he's not up to anything skeevy.)\n\nI'm an A+ certified technician, with excellent Microsoft Office skills  (particularly Excel) just to name something and has a shit ton of computer experience outside of that, who has worked for the Post Office, Edible Arrangement, a small cafe, and currently a retail store. I'm gotten standard minimum wage for back-breaking work. (Back breaking because I'm a rather heavyset guy with quite a few medical issues). Everytime she tells me about her job, I can't help but get jealous.\n\nI've told her many times that it doesn't bother me if she ends up making more than me right nor or in the future, but I've always had a goal of wanting to be a supplier.\n\nI'm in a shitty situation at home where my family is somehow expecting me to move out on $150 a month (After bills and food) while being a full time student in Network Administration WHILE I have a Mom who refuses to look for work and insists on living off of social security. I desperately want to be on my own and move out with my girlfriend but $150 a month won't cut it and because I've had no financial basis to grow upon because my Mom refuses to look for work, I'm on my own here.\n\nI'm frustrated. I'm tired. I seemingly couldn't stumble upon a job if I had a Genie's Lamp.\n\nAside from my girlfriend, how in the bloody hell do people stumble onto jobs like these?\n\nI need a freaking break. The job my girlfriend has is like... my dream entry-level job. Doing something I love (anything computer related) for excellent pay with minimum hours so I can focus on school. (My girlfriend is no longer in school, BTW. She graduated years ago.)\n\nI apologize for the 'Dear Diary' like post. I'm frustrated.",
      "subreddit": "jobs",
      "score": 9,
      "url": "https://reddit.com/r/jobs/comments/5njyki/im_frustrated_as_hell_how_do_people_getfind/",
      "comments": [
        {
          "body": "She indeed got lucky. But she got the job through networking. Meeting people and discussing career goals. You'll be very hard pressed to find postings for the positions you mentioned on LinkedIn or Indeed or any of the other job boards. Word of mouth is the best way to get a job.\n\nBefore your girlfriend was doing this current work, what was she doing and what was she making? You mentioned she graduated years ago and was recently applying at Starbucks. Sounds like it took her quite a while to find this current line of work. Just something to help put it into perspective.",
          "score": 13
        },
        {
          "body": "Your girlfriend got lucky. She was in the right place at the right time. I guarantee that the manager uses those Starbucks interviews as a way to bring people into his businesses. I mean, think about it. You're walking in for an interview with the expectation of making about $10 bucks an hour max... or whatever is slightly above minimum wage. Then you're offered a job making almost triple that amount. You're gonna take that job and be a goddamn model citizen because you're so grateful. \n\nTo answer your actual question... it's all just luck, people skills, and networking. The more people you know and the more you \"schmooze\" with them, the more likely you are to be offered something like this. ",
          "score": 7
        },
        {
          "body": "It's practically all luck, man and that's the frustrating part.\n\nI've been basically scratching for crumbs since I graduated college. I finished a contract recently in IT for 13.50 an hour and all the recruiter could dig up for me, and was pushing on me, was an awful 12- hour graveyard shift over weekends that paid 15/hr. Friend got me a job where he works, where the requirements for hiring were \"do they have a pulse?\" Now I make 22.50/hr and everyone barely works half the time. It's one big dumpster fire and we're constantly wondering how the place stays afloat but it's always been like this and they clearly make money so nobody really cares as long as those gravy-train paychecks keep coming in.\n\nI knew the right person at the right time and it just fell into my lap. Drives me nuts but it's hard to complain. I'd call it frustratingly lucky. /shrug",
          "score": 3
        },
        {
          "body": "Hm. She's a pretty girl who's skilled at massage with no other related particular experience or qualifications. She works in an office all night, makes hundreds or thousands of dollars a day, and gets paid in cash-in-hand. You sure she's being 100% honest to you about what goes on?  \n\nOr she could just be lucky. But the particulars of this story are offbeat to say the least.",
          "score": 6
        },
        {
          "body": "She's the right man at right place. Sorry buddy",
          "score": 2
        },
        {
          "body": "She's sleeping with the guy and you're getting played bro. \n\nStop saying \"shes not taht kind of person\"\n\numm every guy who gets cheated on thought his girlfriend wasnt that kind of person.\n\nThat boss is being too friendly to your attractive girlfriend and you are blind if you think nothing is going on. Open your eyes stop getting played. No one spills a bunch of money at a pretty girl for no reason not even a rich man.",
          "score": 1
        }
      ]
    },
    {
      "title": "Looking for any advice for any people working for a postal service (USPS or otherwise)",
      "body": "Hi! I'm a 23 year old and I've worked in retail for the majority of my adult life and as someone who's severely introverted it's..... complete and total trash, but after I left college anywhere I'd end up getting interviews was in a retail setting; so here I am suffering at \\[AMERICAN VIDEO GAME CHAIN\\]. I also run an etsy shop as a hobby and as a result mail out a lot of packages and I recently had the epiphany that it might be nice to work at the post office. The idea appealed to me because 1. no matter where you live there's gonna be some kind of mail service 2. my etsy revolves around illustration and textile work / embroidery  so I really do enjoy work that may be considered mundane or monotonous because it calms me 3. I imagine the primary social interaction I would have would be with co-workers which i am more than cool with.\n\nSo, for those of you who got through the prologue of my post, I was wondering about stuff like the general perspectives of people already working in the industry, process of applying, necessary requirements, or really anything else of note. I'd really really appreciate any help!! :)",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/bv302p/looking_for_any_advice_for_any_people_working_for/",
      "comments": [
        {
          "body": "This will GREATLY depend on location and job type. Not all offices have the same working conditions, same can be said for processing plants, etc.\n\n* Do you enjoy being on your feet and getting yelled at by delusional supervision? A CCA (carrier assistant) job is very easy to come by and features light training activity followed by a lot of unreasonable efficiency expectations! More seriously, the job of delivering mail is typically difficult with long hours and a high chance of customer interaction. A select few find the job rewarding. Note: RCA is fairly similar.\n* Do you like being indoors in a noisy environment and not knowing when you'll go home? If you're near a P&amp;DF you can apply to be an MHA (mailhandler assistant). You won't be expected to know how to read or communicate much beyond grunts. This type of job is usually physically demanding - moving mail around a processing plant, heaving standard letter trays around, loading and unloading trailers. Pluses are the myriad of shift options and all-you-can-eat overtime.\n* How do you feel about standing at a machine that processes 35,000 letters an hour until you hear a screaming supervisor or beeping noise? Then you get to sprint down to a pocket and sweep some mail! PSE (postal support employee clerks at a plant tend to run DPS mail or operate package sorting machinery. Same shift options as the MHA above, slightly higher pay. Interaction with co-workers not customers.\n* Would you like stamps with that? A PSE SSDA might be the job for you, if you enjoy chatting with customers while a line builds up out the door, financial transactions that you may be held accountable for, and watching out for washed checks as entertainment. That was a long sentence, I am sorry. Oh you might end up throwing parcels in back or dispatching trucks with very little training.\n* How do you feel about vacuuming machinery while listening to the music of your choice? A nice relaxing vacuum session, while being a full-time regular with full federal medical benefits? [usps.com/careers](https://usps.com/careers) search term \"mechanic\" will bring up 40+ jobs *right now* that are career from day one. This is my job and I love it. Very low stress level, paid training for weeks on end (all the various machines) and you get vacation on *top* of all that gravy.\n\n&amp;#x200B;\n\nNOTE TO READER: Some of the above is Postal humor and not intended to be taken seriously. The job descriptions are fairly accurate. I'm sure someone else will correct me if I'm mistaken.\n\nEDIT: Clarification for non-postal persons.",
          "score": 3
        },
        {
          "body": "Mail is really really really dirty. Filthy is more accurate I still have OCD box grime flash backs when I touch dust.",
          "score": 1
        },
        {
          "body": "Mail is very dirty, boring and stressful. If you're a carrier even more so because you deal with the elements and customers on top of dealing with terrible management and over burdened routes and the uniforms suck. The materials used are very uncomfortable, hold stains like you wouldn't believe and are just flat out ugly. \n\n It is  relatively enjoyable when the weather is cool and your supervisor isn't being a dick. It's also really easy to lose weight if you don't get stuck on driving or cbu routes.",
          "score": 1
        },
        {
          "body": "YOu get thrown to the wolves and don't get correct training",
          "score": 1
        }
      ]
    },
    {
      "title": "Unemployed Since August 2018 and I have no idea why?",
      "body": "I have been unemployed since August 2018 and I have no clue why I can't find a job.  I have a mortuary science degree from the U on Mn. However I took a better paying job at Target Corporation, where I spent 18 years before being let go.  I started in Merchandising then crossed over into Marketing. I was a project manager for several years before moving into Creative Production and Design working on private label packaging. In 2014, I lost my job and employment has been spotty ever since. In part, I lost my 62 yr old mother in 2013 after an 8 year ovarian cancer battle.  I can say it, I was a total Mamas boy and everything is different now.  Thru her battle, she moved in with me, and after her death, my creativity has skyrocketed and I can't contain it.  I rediscovered my passion for photography, started singing and making music, and even tried out for a musical. Things I never allowed myself to do before she died. From 2014 til present I've freelanced as a graphic designer and a project manager I've also done some freelance photography work.  I returned to Target Corp as a marketing project manager in Sept 2017 and resigned in August 2018. I resigned because the company had changed. As much as I liked the feel of being back, I didn't feel supported, probably because I was a freelancer, and once I felt the head of the area wasn't receptive to the feedback I was giving because she thought it couldn't be that bad, it really was that bad, I felt I wouldn't be there much longer.  I was wanting to stick it out, train people and establish new processes in areas that had not been supported by the team before. She could only only focus why things were missed, when I had inherited the work that way and was fixing it.\n\n&amp;#x200B;\n\nMy bad, as you can tell I'm a little passionate about the whole situation.  Since August I've applied for 250 positions and have only had 10 interviews. The  job market and how you go about getting a job has changed so much. The only way it seems to find a job is by going through placement agencies. Placement agencies are the worst.  They only call when they want to, they don't return your emails or calls. If you aren't a quick flip/placement so they can get their $$ they don't want you.  I've been working with 3 different placement agencies and it's not been a good experience.  I was contacted by a recruiter and we set up a time to talk.  She was specifically interested in my many years of packaging experience. I sent her my resume and a few questions via email, a few days prior.  The day and time of the call came and went and I never heard from her. Who does that, rude or what?\n\n&amp;#x200B;\n\nFinally someone gave me feedback on my resume. They told me it needed to be more SME (subject matter expert) and not so generalist.  My resume feels generalist because I have done so much and I can do so much... why is this now a bad thing?  I get a focus on one thing is good but I CAN focus on multiple things and do them well. I decided to version my resume by focus; Project management, Creative and Design, Photography.  I also have been running an Etsy store since 2014. My mom was a \"collector\" and had many really cool things. She collected MCM items... lamps, lighters, barware, etc.... I've made $35k selling through my store. I do the photography, propping, copywriting, listing, marketing on social media sites, etc. If I could make it just selling on Etsy I would but I'm falling behind now and REALLY need a full time job.\n\n&amp;#x200B;\n\nI've been in this fog for so long now I know I'm not seeing maybe the obvious or a way out. I apply for jobs, I email and call(when possible), follow up.  I could network more/better but the times I've tried I end up telling myself \"people suck\" and I get discouraged.  I've thought of looking for jobs in a new state to shock my system and get back onto full time employment.  If you have read this and have any suggestions or ideas please feel free to share. Either post or DM me.  I'm starting to feel defeated and I know I'm starting to wither away. THanks.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/bm6pza/unemployed_since_august_2018_and_i_have_no_idea/",
      "comments": [
        {
          "body": "You quit a job with no next job. It looks to employers like you don't have to work. That makes you an enormous flight risk. Your best bet is to temp for a while...take every menial beneath you terribly paying job that the agency gives you...it will show that you want to work and need to work.",
          "score": 3
        },
        {
          "body": "Benicebitch  I forgot to thank you for commenting. Thank you. Lol. Your user name made me laugh. Thx. Lol",
          "score": 1
        }
      ]
    },
    {
      "title": "Beautiful CV templates - are they worth it?",
      "body": "I've been career-hunting for two years now since finishing my internship (before that I took an MA and a BSc) and I'm always looking for ways to help give my CV a little boost or polish. I've seen some beautiful resume and cover letter templates on sites like Etsy, and I'm just wondering if they're worth the money? My CV is still laid out in a fairly bland Microsoft Word format. I showed them to my dad, who's an accountant, and he thought it wasn't worth it. Actually the phrase \"bloody stupid\" was mentioned. But I've seen a lot of people talk about them on here, and I'm in, or hoping to be in, a more creative sector than accountancy. \n\nObviously I'm not suggesting that a \"pretty\" CV is going to land me a job straight away, I'm thinking more of making an impact on recruiters and maybe getting my name to stick in their minds a little more when selecting for interviews and so forth. ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/377d25/beautiful_cv_templates_are_they_worth_it/",
      "comments": [
        {
          "body": "There are many things you'd be better off spending time and money on than a pretty CV if you've been unable to find a job after two years of looking. \n\nCan you tell us about your search strategy?  How are you finding the roles you are applying for?  Are you networking at all?",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "I think a resume that doesn't look like everyone else's will definitely get you noticed, but ultimately it comes down to your skills and it's relation to the job you're applying for. ",
          "score": 1
        },
        {
          "body": "It depends on the template. I've designed them for friends before - minimalistic, clean, and simple designs are best. I'd avoid anything crazy. A nice hierarchy of information, layout, and clean typography are really all you need. Once when hiring for a position, an applicant had a rainbow colored resume and I threw it out before even reading it.",
          "score": 1
        }
      ]
    },
    {
      "title": "What to expect in the Etsy Dublin software engineering internship interview process?",
      "body": "Hey,  \n\nI recently applied for the software engineering internship at Etsy in Dublin and was invited to the first step—a HackerRank take-home challenge.  \n\nIf I pass, the next step will be a virtual onsite interview with two rounds:  \n1. A technical interview with an engineer  \n2. A behavioral interview with an engineering manager  \n\nI’d love to hear from anyone who has gone through this process before or has insights into what kind of technical and behavioral questions Etsy typically asks for intern positions. Also, what should I expect in the HackerRank assessment? Will it focus on data structures, algorithms, system design, or something Etsy-specific?  \n\nAny tips or experiences would be greatly appreciated. Thanks in advance!",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1ik8091/what_to_expect_in_the_etsy_dublin_software/",
      "comments": [
        {
          "body": "For the HackerRank assessment, you can expect problems focused on data structures and algorithms, rather than Etsy-specific tasks. These might include string manipulation, array operations, or basic graph problems. The difficulty level is usually moderate, designed to test your problem-solving skills and coding proficiency.\n\nIn the technical interview, be prepared to discuss your coding solutions in depth and explain your thought process. The interviewer may ask you to optimize your code or solve similar problems on the spot. For the behavioral interview, Etsy often focuses on your past experiences, teamwork abilities, and how you handle challenges. They're looking for candidates who align with their company values, so familiarizing yourself with Etsy's culture could give you an edge. If you're looking to practice tricky interview questions, this [AI interview assistant](http://interviews.chat) can help you prepare for similar situations. Full disclosure: I'm on the team that created it, but it's been helpful for navigating both technical and behavioral interviews.",
          "score": 2
        },
        {
          "body": "How the hell is it €30-35 per hour for an intern position? 🤯",
          "score": 1
        }
      ]
    },
    {
      "title": "Hour Long Interview at Banfield Pet Hospital",
      "body": "I had an hour long interview at Banfield Pet Hospital last Friday. The interview was for a pet care assistant position which pretty much is just an extra set of hands to help with chores around the clinic the vets usually have such as restraining large dogs,  cleaning cages, laundry, etc. It is an entry level job with minimal requirements being a high school diploma, and at least 18.  The person giving the interview mainly asked about my history of caring for pets, what it's like to work at Banfield and general questions and details such as scheduling and would I be willing to work other locations. I was given a tour of the place at the end. She also took an interest that I sell on Etsy as said on my resume which I showed her my shop after the interview. I mentioned I have another interview on Monday, but said I think I'll be more interested in the job at Banfield since the other job was for front desk work. She said she has one other person to interview and would call me back on Wednesday if not sooner and she will take a look at my requested set of hours to see if she can make it work. Does it sound like it's a good chance I have the job? Has anyone else had a long interview and what was the outcome?",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/u5t3bg/hour_long_interview_at_banfield_pet_hospital/",
      "comments": [
        {
          "body": "Do not work for Banfield. Their negligence almost killed my dog.",
          "score": 1
        }
      ]
    },
    {
      "title": "A Letter to Recruiting Managers",
      "body": "About a week ago, I went to an interview for a job I felt positive about. I researched the company and made sure to research the position I was applying for. My interview went well, or so that's what I thought. I was told that I'd receive an email on either Monday or Tuesday, which I did. The email I received wasn't an offer but rather a decline. I was not happy with the message I received being that I had everything they were looking for.  So I sent this: \n\nTo Whom It May Concern:\n\nI thank you for having given me the opportunity. I understand that a simple paper, an interview, and the judgement of the interviewer is all needed to decide whether or not a person is fit for a company. However, when I applied to this company, I looked at the experiences and requirements, which are the following:\n\nCollege graduate with a four year degree preferred, but not required - (I have a four year degree)\nCustomer service and/or sales experience a plus - (I have 2 years of customer service experience)\nMust have strong verbal and written communication skills - (A simple interview will not fully show whether or not the person posses these skills)\nExceptional organizational and multitasking skills - (Having worked as a tutor, as a medical clerk, and as a sales representative allowed me to exercise these skills)\nDemonstrate integrity, dependability, responsibility, accountability, self-awareness, work ethic, and empathy - (I posses these qualities) \nPassion for entrepreneurial communities - (I'm currently working on starting my own company selling paintings on Etsy. I have a passion for new and growing business)\nPassion and understanding for Company’s mission and values - (I have researched this company and have a passion and understanding for your mission)\nProficient in basic computer skills - (I posses proficient/advanced computer skills) \n\nNow, I understand this email might sound a bit harsh or rude but I believe that I have the requirements needed for this position. Of course, this is your company and you may believe otherwise but I don't want to accept a no without an explanation beyond \"We've reviewed your background and experience and have decided to proceed with other candidates who meet our needs more closely at this time\". What about my background doesn't align with your mission and values? \n\nPlease feel free to call me at XXX-XXX-XXXX or reply to this message. \n\nOnce again, thank you for your time. \n\nSincerely, \n\nMe\n\nAnd did I get a reply? No. Of course not. I wasn't expecting anything from that company. \n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/5shjfn/a_letter_to_recruiting_managers/",
      "comments": [
        {
          "body": "Unfortunately, that's the way it is sometimes. Other applicants may have everything you have and then more beyond that, but don't let that discourage you. I recently got a job at a great company that I like in the past 3 months, but this was after I was initially rejected nearly 2 years ago. You may just need to try and try again. \n\nIf you interviewed well but someone was a bit better then just keep your chin up. If that job opens up again you may be able to get it the next time. I had to send dozens of job applications out and did more than a few interviews before I received an offer. If you got a \"no\" then that means another candidate has already gotten a \"yes.\" Regardless of what you send them after you receive that letter they've made a choice and they won't be able to backtrack and pull the offer from the other candidate(s).\n\nGood luck on the job hunt though - it's going to take a lot of work but just keep trying and you'll get it down eventually.",
          "score": 1
        },
        {
          "body": "I hope that you don't make a habit of sending these types of messages in the future if you are rejected again. Sometimes hiring managers will keep you in mind for future openings after interviewing you, but these kinds of emails will definitely dissuade them from even the chance of doing so. \n\nRejection (especially after an in-person interview) is tough, but it is part of the job search and your time would be better spent looking up more positions to apply to than by sending defensive, petty emails that make you seem like an undesirable employee and  won't even be responded to.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewing at Etsy - Senior Manager role",
      "body": "Worst Experience ever.\n\n&amp;#x200B;\n\nVery fake and bias environment, Long Exhausting Recruiting process . Completed 4 rounds of interviews in which on top of that they make you work assignments without pay as part of the recruiting process.  No feedback what so ever.  Finally received feedback after 5 or 6 weeks to say I had a great background and resume but made up some bullshit excuse to not hire me. They had the role for someone else already and just had me go through all that just to comply with HR.\n\nHad to take hours and hours from my job to go through all this for nothing  \n\n\nDo not reccomend to anyone !  Total waste of energy and time",
      "subreddit": "interviews",
      "score": 13,
      "url": "https://reddit.com/r/interviews/comments/x8cfa7/interviewing_at_etsy_senior_manager_role/",
      "comments": [
        {
          "body": "Thanks for this I almost put in an application with Etsy but i remembered some bs that they were putting their employees through and I noped from that craziness.",
          "score": 6
        },
        {
          "body": "Never do a work assignment or any “homework” as part of an interview. I respectfully tell them I have a full-time job and unfortunately I just don’t work for free in taking my already small amounts of free time away from my family life (my wife and dogs, but none of their business what your family life is - could be your roommate or time with Netflix haha). \n\nI have never had any company come back and not respect that decision and I’ve still gotten a role after declining to do the “homework assignment” lol. They tried to peddle it as a way to give me time to “prepare for the interview” with giving the assignment ahead of time. I said that’s fine and we could chat through the questions they had but I wouldn’t be preparing any reports or slides as requested. Still got the role. 🤷🏼‍♀️ \n\nDon’t give these companies your free time! Im so annoyed when I see companies doing this more and more now. You already gave them 4+ hours in interviews I’m guessing.",
          "score": 3
        }
      ]
    },
    {
      "title": "finally got a digital marketing job interview, any advice?",
      "body": "Long story short I live in a quiet industrial city that has very few marketing jobs supply. AND it's been months since I got such an offer.  \nWell, since I graduated in the bach. of BA I somehow been craving to work in the creative field. So I did:\n\n\\- international internship in marketing and communications   \n**gained skills:** website (WordPress) administration, social media posting, FB ads (3weeks)  \n\\- seo assistant (two months)  \n**gained skills:** only reputation management  \n\\- launched a very small online service (consultations) business in the very past  \n**gained skills:** customer service &amp; communications, managing-prioritizing, driving traffic&amp;conversions (via old fashion forum marketing - actually I had more than enough reach for target auditory &amp; FB wasn't pop)\n\nI don't feel confident enough / having the background to work in a higher than junior role.\n\nA company that called me asked me some difficult questions - I only gave positive response such as \"I'm willing to learn\" \"I'm sure I want to work in digital marketing\" \"well I hear you and I'm sure I'm the right fit with my soft skills\" and still want to meet me. Prob because of the dry market.\n\nThe role sounds more like a mid-senior Digital Marketing specialist.  \n\\- do I know how to run successful Facebook &amp; Google ads?  \n\\- do I know how to measure them?  \n\\- do I know how to set and measure the marketing budget? create and achieve goals?  \n\\- how keywords are working?\n\nthat's all I've got in 10mins, I'm not willing to find it easier during the conversation.\n\n  \nThe company is selling amber worldwide they have \\~3-4 websites and are on many platforms like etsy ect.\n\nI was thinking somehow to do: competitor analysis, give some tips on social media (right now all they say is \"hello buy amber or contact us + photo\" they are not creating any content that attracts.\n\nAny tips? Anything I can come up with a day? What can I do to be ready for the interview?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/m5pt1l/finally_got_a_digital_marketing_job_interview_any/",
      "comments": []
    }
  ]
}