{
  "company": "ey",
  "post_count": 63,
  "exported_at": "2026-01-18T17:44:53.276Z",
  "posts": [
    {
      "title": "First interview",
      "body": "I got my first in person interview tomorrow at mcdonalds any tips or advice? What are the chances? Any advice helps",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1km3kni/first_interview/",
      "comments": [
        {
          "body": "Dress nice, thank them for the opportunity to be interviewed and keep good eye contact when answering questions.",
          "score": 3
        }
      ]
    },
    {
      "title": "EY GDS SAP",
      "body": "I have given my interview at EY GDS and have received a onboarding link post that.\nI'm not sure how many level of interviews are there anyone who can give clarity on this ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1k2ay77/ey_gds_sap/",
      "comments": []
    },
    {
      "title": "AO Globelife and or Zach Hart Agency",
      "body": "Anyone actually work for these companies?  I see online some people making great money but I interviewed here and the details just seemed very vague.  almost bait and switch-ey.  \n\ni know Zach Hart is successful, and some of the people around him are too.  but quitting a decent job to jump in is very scary.  especially because theres no pay for training, u have to pass the life insurance test, etc",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jjptut/ao_globelife_and_or_zach_hart_agency/",
      "comments": []
    },
    {
      "title": "Need tips for interview at EY",
      "body": "I got referred to EY for a Business Analyst role (probably Analyst level) as a fresher. My interview has two rounds technical and HR.\n\nI’m not exactly sure what to expect, so I’m hoping someone here can help:\n\n* What kind of technical questions do they usually ask for freshers? Like Excel, data analysis, SQL, Power BI?\n* What about HR questions ?\n* Any tips would be very much helpful\n\nThanks!",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1nmpy3t/need_tips_for_interview_at_ey/",
      "comments": [
        {
          "body": "Expect questions about Excel functions like VLOOKUP, pivot tables, and basic formulas, along with SQL fundamentals like SELECT statements, JOINs, and basic data manipulation. They might ask you to walk through how you'd approach a business problem or analyze a dataset, so be ready to explain your thought process clearly. Power BI questions usually cover basic visualization concepts and when you'd use different chart types. Don't panic if you haven't mastered everything - they know you're a fresher and are more interested in your logical thinking and willingness to learn.\n\nThe HR round will dig into why you want to work at EY specifically, your understanding of the consulting industry, and behavioral questions using the STAR method. They love asking about times you've worked in teams, handled pressure, or solved problems creatively. Research EY's values and recent news about the company so you can speak intelligently about why you're excited to join them. The key is showing genuine enthusiasm for the role and demonstrating that you can communicate complex ideas simply. If you want extra help preparing for tricky questions that might come up, I'm actually on the team that built [AI for interviews](http://interviews.chat) \\- it's designed to help candidates practice and get real-time guidance for exactly these kinds of interview scenarios.",
          "score": 2
        },
        {
          "body": "For technical round, brush up on basics of Excel, SQL queries, and some simple data analysis concepts. For HR, be ready to talk about your projects and why you want to join EY. Practice speaking clearly and confidently!",
          "score": 2
        },
        {
          "body": "It would help a lot if you us didn't assume all of Reddit knows who or what EY is.",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "EY TTT interview (Tax Technology &amp; Transformation)",
      "body": "Hi there,\n\nAnyone did the final round for EY's TTT interview last Friday?\n\nAnyone hear back from it?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oubqt2/ey_ttt_interview_tax_technology_transformation/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "EY TTT (Tax Technology &amp; Transformation) Interview",
      "body": "Hi there,\n\nAnyone did the final round for EY's TTT interview last Friday?\n\nAnyone hear back from it?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ouboyw/ey_ttt_tax_technology_transformation_interview/",
      "comments": []
    },
    {
      "title": "Phone interview for internship help",
      "body": "Hello, \n\n\nI have a 15 minute phone interview scheduled with EY, the major accounting firm, for a technical consultant internship tomorrow. I was wondering if anyone had any tips for the interview, or things I should avoid. If it helps I am a sophomore at a non-target school.\n\nThank you in advance for all your help.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/3rdumn/phone_interview_for_internship_help/",
      "comments": [
        {
          "body": "15 minutes? It will either be a behavioral interview, in which case know your resume well and be able to talk about it. Otherwise, it will be an easy technical question, in which case know your data structures and algorithms.",
          "score": 1
        }
      ]
    },
    {
      "title": "Which of the four dsa courses would you recommend?",
      "body": "I am going to be a 2nd year student , completed cs50 , and was introduced to a few other data structures in 2nd sem.  I've narrowed it down to 4 courses:\n\nhttps://youtu.be/RBSGKlAvoiM?si=c36TH6YlqVPxuAhm - Freecodecamp - looks a bit short \n\nhttps://m.youtube.com/watch?v=ZA-tUyM_y7s&amp;list=PLUl4u3cNGP63EdVPNLG3ToM6LaEUuStEY - MIT 6.006 - Leaning towards this \n\nhttps://github.com/jwasham/coding-interview-university -the most structured - but has too much introductory stuff I already know \n\nhttps://www.youtube.com/playlist?list=PLDN4rrl48XKpZkf03iYFl-O29szjTrs_O - most recommended - seems to only have algorithms (or am I missing something ?)\n\nAny general tips to learn and practice Dsa would be highly appreciated . ",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/1kxp8yu/which_of_the_four_dsa_courses_would_you_recommend/",
      "comments": [
        {
          "body": "None of them. Get one of the many classic textbooks with thousands of reviews on Amazon. You can use those reviews to decide which one you think is best. I personally went through more than one of them.\n\nYou'll probably find better discussion at a CS learner sub. This sub is about CS careers.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Nothing to do at work right now. Any recommendations?",
      "body": "I had a pretty intense summer trying to wrap a project (some weeks were 70 hours). Finished that a couple weeks ago, and now things have slowed a lot. I've asked if there's anything I can help out with, finished all those tasks, and now there isn't anything pressing.\n\nI'm thinking of just taking it easy, working on some side projects, or doing some continued learning I've been interested in for a while. I could chip away at tech debt or make our testing more automated, etc.\n\nAny recommendations?  I work hybrid (\\~3 days remote). I",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1norm5g/nothing_to_do_at_work_right_now_any/",
      "comments": [
        {
          "body": "How about pushing your team to start the next project so you don't need to work 70 hours weeks again?",
          "score": 11
        },
        {
          "body": "Practice interviewing is always helpful for your future self in my eyes.",
          "score": 3
        },
        {
          "body": "Sounds like you have a good enough plan already. Sometimes, a little down time is what we need to fully integrate the information we learned during an intense crunch. \n\n\\&gt;  I could chip away at tech debt or make our testing more automated, etc\n\nI'd let this be the primary **work** focus, something simple that will keep you engaged with work while being low stakes and not too stressful. Also, talk to your manager and find out if there are any other expectations they're looking for you to meet as the year winds down that way you can see about getting it squared off before the year ends (if you haven't already had a review by now).",
          "score": 3
        },
        {
          "body": "If you like your job. Fix some tech debt / automate some task that's a bit manual.\n\nIf you don't like your job do leetcode \n\n\nIf you a content with your job but are kinda like me i'll do the work when it's handed to me, get some certs, do some projects or tutorials",
          "score": 1
        },
        {
          "body": "Play video games and workout ",
          "score": 1
        }
      ]
    },
    {
      "title": "FactSet is hosting a Hangout on \"How to Ace Your Technical Interview\"",
      "body": "https://plus.google.com/u/0/106680570979368987673/posts/DQVoYLVtD6J\n\nEDIT: I took some notes.\nhttps://docs.google.com/document/d/1auG6YhiXbNrCB9jBfZf0BJ7IKZnmfaPkC4vIEgEyYkw/edit?usp=sharing",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ph8q7/factset_is_hosting_a_hangout_on_how_to_ace_your/",
      "comments": []
    },
    {
      "title": "Yahoo Summer Internship – First round (1 Hour Phone Interview)",
      "body": "Hey Guys,\n\nI've gotten a lot of help from these forms, so I wanted to share my experience and help ya'll as well.\n\nI got the Interview by talking to the recruiter at the career fair (Spring Semester Fair). This is my experience and the questions that were asked.\n\n\nThe interviewer seemed nice, but not personable. The interview was very interview-ey, and formal.\n\nFirst 10 mins: Introduced himself: Name, Intro, Role, tell me about your self, etc\n\nWhich one is your favorite project (from the resume)?\n\nWhat was your part in it?\n\n\nTechnical Questions:\n**: : PLEASE NOTE THAT THE ANSWERS ARE AS I ANSWERED THEM, AND MAY BE WRONG OR A LITTLE OFF. The questions were asked in similar order**\nFormat for the questions and answers below\n\n**Question: My Answer**\n\nLinux Commands (First asked me if I code on Linux. I said yes):\n\nHow can you run process in Background: ./program &amp;\n\nHow do you print a file to the terminal: cat \n\nHow can you bring it from the background to the front: fg\n\nHow do you list all the running processes: ps\n\nHow do you print the output into a file: Using the “&gt;” symbol\n\nHow do you pass the output from a program to an other program: Using the “|” (pipe) symbol \n\n\nOther:\n\nWhat is OOP and why use it?: For code re-usability. Then gave a simple example for it (Dog is animal, so is cat. Both \nhave attribute num_legs, and shit like that)\n\nWhat are the principles of OOP? Inheritance, Polymorphism, Encapsulation &amp; Abstraction\n\nAsked more about Encapsulation: *Edit*: Encapsulation is an Object Oriented Programming concept that binds together the data and functions that manipulate the data, and that keeps both safe from outside interference and misuse. Data encapsulation led to the important OOP concept of data hiding.\nBy /u/cscareertroll: The point is to allow the class to change its internal implementation without breaking all the other classes depending on it. (Thanks)\n\nAsked more about polymorphism: There are 2 types. Runtime polymorphism, and Compile time polymorphism. I’m lazy, so google it.\n\nWhat are the primitive data types in C? int, float, etc etc. Don’t say “bool”. It’s not primitive.\n\nWhat is the diff b/w C and C++?: The ability to create classes, and use OOP principles\n\nAsked examples of it, and then follow up questions, like\n\nIs Multiple Inheritance possible?: It depends. Java doesn’t allow it, C++ does.\n\nFollow-Up: Why not use Multiple Inheritance?: To avoid conflict. I.e. both the parent classes having a function with the same name (Or at least that’s what I said).\n\nHow do you catch exceptions in Java?: By Using try{…} catch {…} finally{…}\n\nWhat is the difference between Runnable Exception and Throwable: I didn’t know this. Google it.\n\n\nAsked me this question in the last 15 mins:\n\nhttps://leetcode.com/problems/reverse-words-in-a-string/?tab=Description\n\nAsked me to write it out, and then read the code out to him.\n\n\n: : Technically can be done by using a function that can split a string by delimiter. I ran a for loop, and pushed in individual words into a vector. Then Printed them out from the end of the vector of strings. My code would miss the last word, and rather than asking me to debug it, he just told me the answer, and said it’s fine. \n",
      "subreddit": "cscareerquestions",
      "score": 300,
      "url": "https://reddit.com/r/cscareerquestions/comments/5yx5mc/yahoo_summer_internship_first_round_1_hour_phone/",
      "comments": [
        {
          "body": "I appreciate you making these posts as they are like glassdoor on steroids. Please let us know if you passed and get called in for the next round or receive an offer. \n\nIm honestly pretty surprised to see that i can actually answer most of these questions with reasonable confidence. I figured i had 0 chance of passing an interview at a top tech company because my skills kind of suck, but then again this was only the 1st interview.",
          "score": 111
        },
        {
          "body": "[removed]",
          "score": 28
        },
        {
          "body": "This one of the most helpful posts I've seen on this sub. Good shit",
          "score": 20
        },
        {
          "body": "You can do a OOP rap",
          "score": 9
        },
        {
          "body": "Thank you very much for sharing this! ",
          "score": 7
        },
        {
          "body": "More posts like this please!",
          "score": 6
        }
      ]
    },
    {
      "title": "I've got my first job and I hate it",
      "body": "Hello.\n\nI'm 21 and I started my programming adventure 5 years ago in high school (sort of, I'm not from US) where the main and only goal of IT classes was to teach us solve algorithms tasks. In the meantime I got interested in programming for Android, created a few apps. Then I went to \"just fine\" university. I'm maxing out almost every classes connected to programming and overall my grades are great.  \nMy point is. I really like programming, I really do.\n\n&amp;nbsp;\n\nThis summer was the time for my first job. I applied for company that made good impresion on me. My interview went well, Java and OOP knowledge, some SQL, one algorithm task, then 3 hours coding. I got the job. They told me to try learn basics Spring + Hibernate on my own, which I did.\nSo let me tell you... The hype was real. I coudn't wait to start it. Finally someone would review my code and tell me what can be done better. Finally I could see what it's like to work as a team with experienced colleagues, and many more that I couldn't do on my own. Right?  \n&amp;nbsp;\n\nI started in July, so I work there over 2 months and I'm so frustrated and disappointed.\nThe project I'm working on is huge business app. When I cloned it first from git I thought my eys would pop out. There are over 2000 Java packages which in my opinion easly converts to over 1 million lines of codes (was trying to count for curiosity, but Eclipse crashed). The project has been in development for like 13 years.  \n&amp;nbsp;\n\nThere were no introduction to the project. We've just got (there were 3 of us - interns) couple of old videos to watch that weren't helpful at all. Then I've got my first task and the struggle has started.  \n&amp;nbsp;\n\nTrying to shorten my story a bit. After two months I've got some basics how to use common classes, knowledge where some functionality is placed, learn a bit framework in practice and other small things, but I have two main problems with my job.  \n&amp;nbsp;\n\n\nFirstly, the business logic. Let me start that there are literally no documentation. Almost every window in the app contains so many unknown terms, shortcut, parameters. My tasks are mainly addition of some functionality, changing small things and fixing bugs. It requires to know how the surrounding functionality works. As there no documentation, my team leader rather helps with code, the specialists that understands it (but they don't code) are located in another city, I have to call them and they are always busy and they don't have time to teach me core knowledge, that is obvious for them.  \n&amp;nbsp;\n\n\nSecondly, figuring out existing code. It is connected with above. I sit so long trying to find something and trying to understand how it works. I sometimes waste hours to learn that I was looking at the wrong place. It is so frustrating. I think it is so hard because I don't know business logic.  \n&amp;nbsp;\n\nAnd there are other smaller things.  \n\n* The team. We almost don't talk with each other. It's weird.\n* The team leader that isn't as helpful as I wish he was, but I see that his knowledge is huge. I always google first, then google again, then ask someone else at the team, then him. I wish he was more involved in introducing new \"member of family\".\n* Tests are almost non existient. I write one only for first task, it was more like exercise.\n* Code review is almost non existient. My team leader scrolls my code, but I got no suggestions at all. He just marks my code for tests.\n* Weird small things like branches. I thought It would be something like git-flow. Almost every time when I complete task, it has to be commited to 2 (or even more) branches. I asked colleagues how to do that quickly, but didn't get much help. I know about cherry-pick, but sometimes there are big code differences.  \n\n&amp;nbsp;\n\nAnd one more thing. After my first bigger task I was asked to also commit that to older branch. It turned out that I can't even check if my code works (database not compatibile). 3 weeks later I got message that they are testing app on client's environment and my code crashes. Is it me or it sounds bizarre to test intern code first time on almost production?  \n&amp;nbsp;\n\nBecause of all above I started to hate going there. I'm so out of energy after 8h spent there... and I'm not even talking about coding home.  \n\nHow many things from what I described are normal? Am I to narrow-minded?  \n\nI'm seriously woried about my career as a programmer. I'm thinking about quitting and looking for job at some other company, but I'm afraid that I will jump from the frying pan into the fire.  \n&amp;nbsp;\n\n**EDIT**: Wow, guys. I seriously thought I'd be downvoted to hell for being \"cry baby\" or I'd just not interest people with my wall of text. You actually gave a lot of great advice. Last week was shit. Taking into account some things you said, changing attitude and maybe next weeks will actually be better. Thank you for every comment you posted here.",
      "subreddit": "cscareerquestions",
      "score": 119,
      "url": "https://reddit.com/r/cscareerquestions/comments/3kn8jp/ive_got_my_first_job_and_i_hate_it/",
      "comments": [
        {
          "body": "Yikes! Sounds exactly like my first job out of school (started as an intern). Worked in the IT department of a major corporation. This is NOT how all jobs in the industry are at all, however, many jobs at big companies unfortunately tend to be like this.  Although the big name looks good on a resume, you will develop bad habits, your skills might become obsolete and this could be VERY bad for your career.\n\nHere's what worked for me:\n\n\n\n* Spend a couple weeks seriously thinking about what kind of projects you want to work on\n\n* Create a dream job/project/work environment in your head... get it down to the smallest detail\n\n* Start looking for companies that you are interested in and apply... when they interview you, you are also interviewing them. Ask about all of the details you have in your 'dream' project (tests, docs, mentoring, positive environment, etc...)\n\n* keep doing this until you find the right fit, it's out there... trust me. Might take a long time... took me 4+ months to get out of my first job, but it was SOO worth it. You will learn so much, you will be surrounded by people who share similar passions and your skills will grow exponentially.",
          "score": 14
        },
        {
          "body": "[deleted]",
          "score": 59
        },
        {
          "body": "Those things are bad signs, and you should not accept them as status quo for the industry. Your instincts are correct.\n\n&gt;The team. We almost don't talk with each other. It's weird.\n\nFunctional teams communicate with each other quite a bit.\n\n&gt;The team leader that isn't as helpful as I wish he was, but I see that his knowledge is huge. I always google first, then google again, then ask someone else at the team, then him. I wish he was more involved in introducing new \"member of family\".\n\nYou have the right attitude of trying to figure things out on your own before asking, and it sounds like the people there should be much more involved as mentors.\n\n&gt;Tests are almost non existient. I write one only for first task, it was more like exercise.\n\nA codebase this large and this old should not only have extensive unit tests, but also a well-established continuous integration system with plenty of integration tests.\n\n&gt;Code review is almost non existient. My team leader scrolls my code, but I got no suggestions at all. He just marks my code for tests.\n\nA good software team is constantly reviewing each other's code.\n\n&gt;Weird small things like branches. I thought It would be something like git-flow. Almost every time when I complete task, it has to be commited to 2 (or even more) branches. I asked colleagues how to do that quickly, but didn't get much help. I know about cherry-pick, but sometimes there are big code differences.\n\nDuplicating commits like that is an anti-pattern, and if your team does that as a matter of course then I suspect their whole approach to Git and version control is dysfunctional.\n\n&gt;And one more thing. After my first bigger task I was asked to also commit that to older branch. It turned out that I can't even check if my code works (database not compatibile). 3 weeks later I got message that they are testing app on client's environment and my code crashes. Is it me or it sounds bizarre to test intern code first time on almost production?\n\nIt's not just you. They're clearly lacking in appropriate testing infrastructure, and judging by the age of the project it doesn't look like they'll ever get their shit together.\n\nThere's no need to second guess yourself on this one. I used to work at places like this and like you I wondered if the entire industry was like that. It turns out it's not. I quit working for places like that years ago and have been much happier since. Learn what you can there and then find a better place. It's not you, it's them.",
          "score": 19
        },
        {
          "body": "Your company sounds shitty (poor code reviews, strange branching requirements, no tests, etc.). Stick it out for a year and see how it goes, then find another job.\n\nThat said, in my experience, no documentation and little to no mentoring for new employees is actually pretty common even if it isn't great. These are things you might have to get used to. And in the case of no documentation, it might even be a good thing for you - it'll force you to break out the debugger and you'll get more confident with being able to understand what strange/unknown blocks of code do.",
          "score": 21
        },
        {
          "body": "&gt;Firstly, the business logic. Let me start that there are literally no documentation. Almost every window in the app contains so many unknown terms, shortcut, parameters\n\nWelcome to the industry, newbie!\n\n&gt;My tasks are mainly addition of some functionality, changing small things and fixing bugs. It requires to know how the surrounding functionality works.\n\nWelcome to the industry, newbie!\n\n&gt;Secondly, figuring out existing code. It is connected with above. I sit so long trying to find something and trying to understand how it works. I sometimes waste hours to learn that I was looking at the wrong place.\n\nWelcome to the industry, newbie!\n\n&gt;Tests are almost non existient. I write one only for first task, it was more like exercise.\n\nWelcome to the industry, newbie!\n\nI'm giving you a hard time, but hopefully the point gets across that this isn't a dire situation. **Everything you're experiencing is completely normal.** This is all run of the mill programming-in-the-industry stuff. I'd even say double down on this shit now. Get good at reading code and understanding what it's trying to do and what the code around it is doing. This is bread-and-butter business software engineering and the engineers who can do that are the ones who are valuable (and make money, and get to choose their projects, and have influence, and are respected etc).\n\nHaving said all that, it sounds like this team specifically might a little bit dysfunctional. A little bit. Unfortunately, you won't be able to judge that until you have more experience. But to ease your mind, your team sounds completely 100% average. Not exceptional, not idiotic. It actually sounds like a great starting gig - keep your eyes open and remember the things that stick with you about what works and what doesn't, what sucks and what's good. And take that with you to the next job. Remember this post, so that when you're the senior programmer, you can be the leader you wish you had.\n\nFor some perspective, every time I've joined a new job, I've felt the team was stronger technically than the last team. Every time, I've been excited to see their good practices and clean code, and every time I've looked at the code, it's been a horrific nightmare that doesn't make sense. If you're joining a company with a codebase that works and solves actual problems, it's not going to be clean, and it will have institutional scar tissue all over it.\n\nYa know, maybe this post by [Joel (when people in the industry say Joel, they're probably talking about Joel Spolsky) about re-writing code](http://www.joelonsoftware.com/articles/fog0000000069.html) might be just what you need.",
          "score": 72
        }
      ]
    },
    {
      "title": "As a CS student who will graduate in May - when do I start applying?",
      "body": "I'm a CS student who has a decent GPA (3.8) and a pretty good resume for my age, but I'm super overwhelmed applying for jobs right now, partly because I have tons of school work and partly because all the in-person interviews are 2 hours away in Chicago.\n\nIf I want to have a job after I graduate, do I need to be applying now, or can I wait? If so, how long?\n\nEDIT: I should specify, I'm not interested in FAANG type companies. I already applied to several larger companies (Epic, McMaster-Carr, EY) and have interviews with them scheduled but don't really want to work at a large place like that off the bat.\n\nEDIT 2: The amount of conflicting responses here - of both kinds from experienced people in the work force - makes me think that maybe nobody really knows the answer to this question.\n\nEDIT 3: Coming back 9 months later: The jobs I applied for Right Now Immediately as suggested did not work out at all. I now have my dream job at a health tech startup which I only applied for in March. Nobody on this sub has any idea what they're talking about.",
      "subreddit": "cscareerquestions",
      "score": 21,
      "url": "https://reddit.com/r/cscareerquestions/comments/dgfa8t/as_a_cs_student_who_will_graduate_in_may_when_do/",
      "comments": [
        {
          "body": "You should start applying now, especially if you intend to limit yourself geographically to Chicago.",
          "score": 44
        },
        {
          "body": "Feel free to start applying now, but lots of companies use the calendar year to calculate their financials, so they won't know until January what their 2020 budget looks like. They also won't probably start actively looking for new grads until February/March. But there is no harm in starting today.",
          "score": 10
        },
        {
          "body": "You should have started in August. A lot of companies are getting full. FB is backed up for weeks. A lot of people already have multiple offers in hand.\n\nI just got an email from AirBnB that they have finished hiring and will delete the online job listing soon.\n\nYour options will start decreasing the more you wait.\n\nThis is mostly true for large companies and \"new grad\" positions. Small companies hire on a need basis and you can apply for non-\"new grad\" positions any time.",
          "score": 9
        },
        {
          "body": "Yesterday.",
          "score": 5
        },
        {
          "body": "Having just gone through this in the Chicago area last year, I started around now also. That being said, I didn't start to get any responses until February/March. I'd say it never hurts to start early because you never know when you might get lucky, but realistically don't expect anything until after the new year",
          "score": 3
        },
        {
          "body": "If you're not looking at FAANG, you could honestly start applying in February/March then get a job by May. There's some places that won't hire you because they're looking for a sooner start date... but it never hurts to practice interviewing. Granted, larger companies will be more flexible with a later start date vs a smaller company.",
          "score": 2
        },
        {
          "body": "I just wanted to mention that, for everyone clamoring in this thread about how I was too late and wouldn't get a position, I got two offers at very respectable places and reasonable salaries for Chicago, and parlayed that, a year later, into a mid-six-figures position.\n\nY'all's advice is kinda bad.",
          "score": 2
        },
        {
          "body": "Large companies you can apply now and they will take you whenever you graduate.  Small companies (if your even interested in them) you probably should wait until march because they usually start hiring when they need someone.",
          "score": 1
        },
        {
          "body": "I started applying in August and have 2 offers already. Companies aren’t filling up, but you’re already somewhat behind",
          "score": 1
        }
      ]
    },
    {
      "title": "Applied Math Grad student graduating in May seeking advice to get into a cs career.",
      "body": "(Kinda rant-ish because fueled by frustration caused due to recent failure at interviews)\n\nHi, I am a masters math student graduating in may. I was a math major in undergrad and what I like to call an almost CS major as well because I took more classes than a minor but 4 less than a major. At the time math was just seeming to be more interesting and intellectually stimulating to me than CS so I applied to grad school for math but within a year of being here I realized that I don't want to get a PhD or do research or teach or do financial math careers like actuary for the long haul. I took a software engineering class and loved it. I decided to spend all of winter break and rest of the semester just doing CS-ey stuff. Suddenly after having been taking all these hard math courses like real analysis, ODE, and advanced calc, CS topics started to feel relatively easy and more interesting. I think it was also psychological since I was realizing studying CS is more lucrative career wise. Even tho the academic CS classes from undergrad felt boring, self-studying DS&amp;A/CTCI/EPI, grinding leetcode, and studying data science ebooks has become addictive and  interesting now and now math hw seems like a pain.\n\nBut I haven't had much luck in terms of job applications, So far I have gotten coding challenges/assignments and nothing after that or nothing at all. I don't know if its the fact that I have a math degree or that I don't go to a great school but I am just not getting software interviews. I have enough coursework in CS, I built a web app, a website and all of this is on my resume. \n\nI have never been formally trained in data science and everyone says being a math person I should try data science route more than software but I have been applying to data science since undergrad and never make it. For software positions I at least hear back in the form of a coding challenge but for data science I just get rejected.\n\nI don't have software internships but I did teach computer science for two summers which is my internship out of school work experience. What can I do to at least start landing interviews? I go to a big not-too-competitive state school and went to a small liberal arts school for undergrad that had good regional rankings/reputation.\n\nWhat can I do to land interviews? and succeed in them? What jobs am I qualified and eligible for? How do I keep trying and not lose hope? Should I even be grinding leetcode(~75ish done) if software jobs are not even going to interview me since I have math degrees and CS minor? How do I stay motivated? Should I apply to internships more or full time entry levels more? Any help/suggestion is appreciated. ",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/7v7sem/applied_math_grad_student_graduating_in_may/",
      "comments": [
        {
          "body": "i majored in applied math and have found some success applying for SWE positions at financial companies, especially front office type positions. Is that something you'd be interested in? ",
          "score": 2
        },
        {
          "body": "US based? Hit me up. Get into math based languages like K or Q",
          "score": 1
        }
      ]
    },
    {
      "title": "New Grad Job Offer help",
      "body": "So I currently have an offer from NCR  for a Software Engineer Job paying 80K, an offer from Intel for 90K (Arizona. relocation assistance will also be provided) and I have a verbal offer for a PSO software consultant position(written offer will be soon emailed to me in 2 days) from Manhattan Associates paying 77K + signing bonus. I also have a second-round interview scheduled with EY for a cybersecurity consultant position.  I'm not super stoked to be coding. I'm not that strong of a coder and I don't mind doing DevOps for NCR.\n\nI want to stay in Atlanta since I can stay home with my parents and save up some money. Also, I had my internship at intel and I didn't really like what I was doing (busy work mostly).\n\nI also have an avid interest in cybersecurity. I plan to obtain a CSIP certification and move into a defense company of sorts.\n\nAs of now, I do love traveling and Manh provides me that opportunity but it comes at a cost. I've heard that Manh's new grads and other consultants work about 60+ hours a week during peak turnaround periods.\n\nLooking for some advice as to which career will help me with my cybersecurity interest in the future.\n\nPS: I don't think EY is going to work since I have to reply to these offers ASAP and I don't really want to gamble with the offers I have right now.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/m0t3qx/new_grad_job_offer_help/",
      "comments": [
        {
          "body": "Intel",
          "score": 3
        }
      ]
    },
    {
      "title": "Job hunting with vision loss / how to maximize my \"diversity\"?",
      "body": "I have partial vision loss from an autoimmune disease and I've been checking the \"I have a disability form\" when applying to jobs, but should I elaborate on what the specific disability is in my cover letter? It's just patches of my peripheral vision so it doesn't affect my ability to do the job and I can still drive. Also how to handle the fact that I have to wear these douchey looking sunglasses to interviews because light hurts my eyes? The sunglasses always offend interviewers but I have to wear them to avoid eye damage.",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/8oxrv5/job_hunting_with_vision_loss_how_to_maximize_my/",
      "comments": [
        {
          "body": "Here's what I do. I have a speech impediment that is fine around my friends and family but gets kind of insane around people I don't know. Not the Elmer Fudd kind like I can't get a word out for three seconds sometimes.  The way I stutter honestly makes it look like I'm either arrogant or dumb.\n\nI don't check any of the disability forms (partly because stuttering is still seen as not being a big deal for some reason) and I don't wanna be discriminated against.\n\nInstead what I do is politely inform the interviewer that I might pause or not be able to get words out and they're always understanding. If they're not (which has NEVER happened), I would just walk out and tell them to go fuck themselves.",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "Definitely declare yourself as disabled on the form, but I wouldn't bring it up on the cover letter unless you need an interview accomodation of some sort.\n\nIt's a good idea to explain why you have the sunglasses to your interviewer at the start of the interview, to prevent misunderstandings.",
          "score": 0
        }
      ]
    },
    {
      "title": "Does this mean a rejection after interview?",
      "body": "I applied the EY national tax campus recruiting and was invited to their Chicago office for an interview on March 1. I have two 30-minute interviews, one interviewer is a partner, and the other is a principal. I think I did not bad during the process, and the whole conversation was good and friendly. And at the end of the session, I was told that I will hear them back before the end of last week. I sent the interviewers thank you note that night, the principal responded \" good meeting you, good luck\" stuff, the partner didn't reply. However, two girls I know at the interview got the call with offer three days later, and it's from the partner who interviewed me. They told me that the people who interviewed them are mangers and senior mangers. By the way, the location preference the two girls choose is San Francisco, and I choose New York but also open to anywhere. Until now, two weeks later, I did not receive any following up calls and emails, I also checked my mail box, still nothing. I sent emails to the HR, no reply either. So I am confused about my situation, is this a silent rejection? Or do I need to keep waiting? THX",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/4aey78/does_this_mean_a_rejection_after_interview/",
      "comments": [
        {
          "body": "Move on\n",
          "score": 3
        },
        {
          "body": "Please write a glassdoor review for this place. Not right away but in a couple of months once you're sure they're not getting back to you. Write the review anyway though because getting back to someone months later is just as BS as not getting back at all.\n\nI'm in a similar situation and I was even told that I would definitely hear back! I've followed up twice with HR and...nothing.\n\n",
          "score": 3
        },
        {
          "body": "Nowadays, the normal thing is to not respond at all instead of explicitly rejecting someone.  It's rude, but almost everyone does this.  Focus on other opportunities.",
          "score": 1
        }
      ]
    },
    {
      "title": "Best Day to Interview for EY?",
      "body": "",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1987ni2/best_day_to_interview_for_ey/",
      "comments": [
        {
          "body": "Would like to know!",
          "score": 1
        },
        {
          "body": "IMO: the sooner the better. I would interview on Jan 19. You won’t know if the job posting is closed come Feb or March.",
          "score": 1
        }
      ]
    },
    {
      "title": "Books to read \"just for fun\" to learn system design?",
      "body": "Books to read \"just for fun\" to learn system design?\n\nI don't have a system design interview, but I just want to learn system design principles, scalable architecture/design, distributed systems, etc.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1iyuz6f/books_to_read_just_for_fun_to_learn_system_design/",
      "comments": [
        {
          "body": "System Design Interview by Alex Xu (ByteByteGo) is really good. Lots of mini case studies and pretty easy to read in chunks. If you're looking for something more comprehensive, I really enjoyed Web Scalability for Startup Engineers by Artur Ejsmont.\n\nIf you're interested, I host a podcast called Book Overflow ([YouTube link here](https://www.youtube.com/@BookOverflowPod), but we're on all major platforms) where each week we read and discuss a new software engineering book and interview their authors when we can. We did a few episodes on Web Scalability and are recording our System Design Interview episode this Friday, haha!",
          "score": 4
        },
        {
          "body": "The classic \"Designing Data-Intensive Applications\" by Martin Kleppmann. Though \"fun\" is in the eyes of the beholder.",
          "score": 2
        }
      ]
    },
    {
      "title": "What job boards do you use?",
      "body": "I'm looking for a better alternative to the big ones like linkedin and Indeed since they have so many that aren't tagged properly.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/twvv8c/what_job_boards_do_you_use/",
      "comments": [
        {
          "body": "Based off my experience in the games industry, you have a higher chance of landing an interview if you directly apply through company websites/emails. A lot of HR reps sift through the applications on LinkedIn/Indeed because there’s so much “noise”. \nUsually what I do is that I find job postings I’m interested in on LinkedIn and indeed and then go to that company’s website to apply",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "I’ve had success with Triplebyte before my resume was really eye-catching",
          "score": 2
        },
        {
          "body": "LinkedIn\n\nJust click the button “open for work” and prepare to bombarded with recruiter messages. \n\nUsually half of them are complete garbage but that still leaves substantial leads.",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "citadel or quora or snap internship?",
      "body": "I've been really fortunate to receive offers from all three places for a software engineering internship, but I'm really unsure of which offer to go with as each has it's pros and cons. I'm really just looking for a place where I would be happy working and learn a lot, pay doesn't really matter to me in this sense. \n\n\ncitadel: \n\n-I'm really scared that I would have a horrible time working there, I would be on an infrastructure related team, but i've heard of horrible things all around and during my onsite I also did find that the office was quiet and people seemed unapproachable. I struggle with mental health so this is probably the biggest con for me \n-Housing is provided and it's apparently really nice \n-I had 8 interviews with them but only 1 leetcode style question was ever asked which makes me doubt their technical strengths? Everything else was behavioral/weird knowledge based questions\n-being in a new city in chicago which is nice! \n-may help with similar types of companies in the future? Not sure if I even want to go into trading/hedge fund kind of field in the future though.\n\n\nQuora:\n\n-interviews were the hardest, but I really enjoyed talking to everyone at the office that I encountered \n-housing is provided but it's dorm style, or a 2k housing stipend\n-I would be in the bay area again which I'm not too excited about\n-learning opportunities seem to abundant and mentorship is something they're really serious about, I think I would have a good time here \n\n\nSnap:\n\n-concerned about company culture, I've heard bad things about how bro-ey they are but from my interviewers both were really nice \n-No housing provided but 1.8k stipend\n-new city! \n-I find the team they put me on really interesting and different from everything I've done in the past\n\n\nSo right now I'm leaning towards snap/quora but if you guys have any insight that would be great to hear! ",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/7q720n/citadel_or_quora_or_snap_internship/",
      "comments": [
        {
          "body": "Hmm. This is a tough one. From seeing you got those 3 offers I suspect you'd have no trouble at all getting full time interviews/offers, so this is mostly on the merits of the companies themselves.\n\nI'd probably eliminate citadel since they're known for being one of those places that uses and abuses young talent. It seems like a stressful environment; especially not good for someone for whom mental health is a bit more precarious. Chicago also leaves a lot to be desired.\n\nI've heard great things about engineering at quora; however, mountain view isn't amazing tbh (the office is on the castro though which itself is nice, and they said they have frequent free boba days hahaha). On the other hand, it's an internship so it's only 3 months so its not like you're tied to mountain view for a long time. All the people I met there during my interviews seemed incredibly smart, interesting, and welcoming. It's probably also the one with the best engineering reputation of the 3 companies you've mentioned and i think they take their internship program VERY seriously; they're also very open with all the company details and there aren't any information silos.  \n\nThe big pro of snap is that it offers a different experience (by the beachside and in LA, though as someone from the LA area I personally believe that LA isn't that great lol). I personally didn't like the bro-ey reputation and culture at all and their reputation amongst my tech friends is probably the worst of the 3 (though still very good). I've also heard they're very secretive about information even to employees within the company. idk, leaves a bad taste in my mouth.\n\nI personally would go with quora of the 3.\n\nsrc: I got offers from s &amp; q (but for full time) and had to make a similar decision.",
          "score": 19
        },
        {
          "body": "I'll do Quora. Snap is a sinking ship and Citadel just throws a lot of money at people, not really heard much about their tech prowess.",
          "score": 17
        },
        {
          "body": "what field of cs/specialties are you interested in?\n\nif quant go citadel\nif ml/infra quora\nif mobile/computer vision snap\n\n\notherwise depending on your preference/where your past experience hs been itll depend a bit more/vary on that, so if you have more details I can maybe be more specific w advice",
          "score": 12
        },
        {
          "body": "Can’t say much about the first two but I interned at Snap this past summer. It did seem a little bro-y but the people I met were very welcoming so I fit in fine. Reasonably diverse place I would say so I don’t think you’d struggle with fitting in. I think maybe the bro-ness comes from the fact that it’s West LA you’re dealing with. (Can’t really say how the Seattle experience is but I know of people who have travelled to LA as an intern for work purposes, but Seattle’s a great city)\nI would say the engineering talent there is really up there despite Wall St. performance. \nIn terms of the actual internship experience I don’t think it’s as well structured as more established places so it’s really up to you to take charge and make the most out of it, which is good or bad depending on the way you see it. I personally enjoyed my time there. \n\nEdit: bro-ness might also just be from the fact that it’s still a fairly male dominated industry and workplace",
          "score": 5
        },
        {
          "body": "Snap in Venice, CA? That's a nice area. Mountain View is kind of boring and far from the city. ",
          "score": 3
        },
        {
          "body": "Do you want to live in LA, Bay Area, or Chicago? Since all three are good offers I would base my decision off of work and location. The work at Citadel/Quora/Snap should be fairly interesting so really depends where you see yourself working full time ",
          "score": 2
        }
      ]
    },
    {
      "title": "EY Referral",
      "body": "Hey everyone - please delete if not allowed. I recently started as a Technology Consultant at EY and really love it so far. Great people and great pay and the work is very interesting. If anyone with at least a year of professional experience outside of an internship is looking for a career change or wants to break into consulting, feel free to PM me and I’d be more than happy to refer you internally if it’s a good match up. Full transparency, Id be getting a referral bonus from my company if you receive and accept an offer - but your likelihood of getting interviewed/receiving an offer increases significantly if you apply via referral. Happy to answer any questions so feel free to reach out and PM me. This is specifically for US positions.",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/t0orrf/ey_referral/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "This just what I am looking for! I will be DMing you.",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Still giving out referrals? I am looking at a couple positions within EY",
          "score": 1
        }
      ]
    },
    {
      "title": "HELP! How to dress for a internship interview at EY (ernst young)?",
      "body": "Im having an interview whit EY (Europe) next week for an internship and i have no clue what to wear since i dont know the dresscode for the company. Was thinking of wearing jacket and a blue shirt. What do you guys think?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/31cvge/help_how_to_dress_for_a_internship_interview_at/",
      "comments": [
        {
          "body": "conservative business formal i.e. jacket/slacks or suit w/tie",
          "score": 1
        }
      ]
    },
    {
      "title": "Quitting my Civil Engineering Job for a CS job hunt?",
      "body": "I graduated from with a civil engineering degree from a big 4 cs school last spring (albeit with not great grades)  and have some back-end development experience through working part time in research during school, and a couple of the intro software classes in the cs department. I also have taken more of the math-ey classes in the department so have a good problem solving background.\n\nI have been working in a civil engineering consulting role since graduating, but am thinking of leaving as I feel like I am wasting my time because I don't want to continue in a classic civil role (consulting can make you work long hours), and I am not meshing well with the rest of my team, and am finding it hard to stay motivated. I have been recruiting since the start of the year, and have so far gotten to a final round interview for a software role with a civE related startup (though was rejected due to the startup not wanting to take a risk on an entry level cs talent). I was thinking a better use of my time would just be working on my side projects and making my portfolio while applying for part time/contract positions more related to the cs field.\n\nI am still interviewing with other companies for full time positions, but am thinking of just getting part time remote back-end gigs to pay the bills, while I pursue some side projects I have been really interested in (algorithmic trading, natural language processing, writing). I also was able to land a very short term vr prototyping gig but it will only last for a couple of weeks.\n\nHow likely is it given my background, and the current climate of the industry given the recent outbreaks, that I would be able to land some sort of remote part time gig? I know that hiring for college roles has halted, but what does the scene look like for contract positions?\n\nWhat are the downsides of quitting my current position without having another offer lined up? Would it look better to companies that I have had better-developed side projects, or that i have stayed at my current consulting role?\n\nHow long is this decline in entry level cs jobs going to last for? I have enough saved up to last me about 4 months without any additional income.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/fwc9nc/quitting_my_civil_engineering_job_for_a_cs_job/",
      "comments": [
        {
          "body": "&gt;How long is this decline in entry level cs jobs going to last for\n\nThis sub is like 80% students and you're asking them to predict the global response to an unprecedented level of economic distribution. The truth is, even industry leaders and economic experts have no fucking clue what's going to happen, let alone the the people on this sub who spend most of their time tabbing between LeetCode and gaming subreddits.",
          "score": 7
        },
        {
          "body": "There are only downsides to quitting your job. Making the switch is easier with a job, quitting and switching fields can look bad. Switching from a job that your gainfully employed at removed the question of why your last one didn't work out. Plus 4 months of full time learning (the depth of your emergency fund) does not get you that far. Looking for a job and learning for a year is a way more reliable strategy than jumping in head first and hoping you look hire-able.",
          "score": 3
        },
        {
          "body": "Stay at your job.",
          "score": 3
        },
        {
          "body": "Quitting a job without anything lined up and no experience is the perfect thing to do when there is a massive recession coming. Cause getting part time gig work that pays the bills is trivial. \n\nYou will be fine.  Go for it. Perfect time to go unemployed without eligibility for unemployment,",
          "score": 1
        }
      ]
    },
    {
      "title": "Has anyone did an SWE internship at EY ?",
      "body": "If so, when did you apply and when did you get an email/call for an interview and etc. Did you enjoy working there ? How was the pay? \n\nI really can’t find much about EY Software Engineering internships online so that’s why i’m asking",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/d6m7f2/has_anyone_did_an_swe_internship_at_ey/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 4
        }
      ]
    },
    {
      "title": "Ernst &amp; Young?",
      "body": "So I'm graduating soon and am in the process of interviewing and hearing back from interviews. I interviewed for EY (risk consulting, commercial) and wanted to know what you guys think about working for them. \n\nI love being able to work with code but am also business minded, so what I like about this opportunity is Ill have a chance to work with technologies at a high level and understand the business problems they solve. However, at the same time I recognize I will likely be doing very little coding. \n\nWith that said, I absolutely loved the culture of EY and everyone I met was just so amazing that I felt even if I wasn't coding I would still be learning so much from everyone around me.\n\nThoughts? Is this going to hurt me down to road? Should I stick to a conventional developer job?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/5a3p2q/ernst_young/",
      "comments": [
        {
          "body": "Ask what their turnover rate and the average employee tenure are. It'll probably surprise you. Often these jobs are the kind where you're in for 2-3 years, get worked hard (travel, long hours), and then burn out and move on.",
          "score": 7
        },
        {
          "body": "it'll be fine\n\nas long as they're paying you competitively, and treating you well don't worry about it",
          "score": 5
        }
      ]
    },
    {
      "title": "Feel like crap and wondering if I need to do a serious career change",
      "body": "I've been a developer for about 10 years and I did an interview just today with the interviewer being someone I've known for a few years and it went horribly, horribly bad.  My other peers did this same interview and they performed well.  Feeling pretty bad right now.  In fact, this feeling has just permeated my entire career so now I'm seriously considering a career switch.  I decided to put my whole story since maybe it'll give you some idea of what would be a good fit.  So please sit down, relax, have a cup of joe... or just scroll down to the bottom for a synopsis. :)\n\nThroughout my career (and college) I've felt pretty insecure about my abilities.  It became pretty obvious to me when I was in school that I wasn't all that 'mathy' and I just didn't learn as quickly as the rest of my peers.  I went to one of the best schools in my country for CS (my marks were shit though), I've had positive feedback about my work in my internships and full-time work, and a single instance of negative feedback that just killed me (\"the only good female developer is X\", where X was not me).  I constantly toy with the idea of being a UX designer, a UX researcher, a tester, a project manager, a product manager, a developer advocate, tech support or just someone who is involved in the tech scene and can code, but is in more of a supportive role to the developers.  I like to code (less so now) but never to the same extent as my coworkers, especially the ones who've been programming since childhood, and unlike them, I don't code at all when I get home.  I would classify myself as a developer who can quickly prototype stuff, make the UI look elegant (this is the only thing I'm actually very confident in) and I'm pretty versatile in terms of the frameworks and languages I've used (though most people are anyway).  There is a willingness I've noticed in me to try to always go above and beyond at work and I'm not one to ever turn away work because it's 'below me' or anything like that.  I am a workhorse and tend to take on too many things and burn myself out in the process.  However, when it comes to the theory and proving myself in an interview, I just suck a lot.  I'm fine when it comes to performance reviews, but I have never been considered for a management role.  I work well without much supervision (it's preferred actually) and I rarely ask for help, but there's just something about my general demeanour or lack of self-confidence that has never put me in a leadership role.  There was one guy at work who wanted to have more female stakeholders and even went to our lab head to set me up for a leadership role since he had heard wonderful things about me, but it just never panned out and I felt too weird about following up.  I feel inadequate almost daily though.  Still, I can't think of a better career for myself since I've always had an interest in computers.\n\nAs a kid, I used to watch this computer show, and would read almost every kid's computer book at the library.  I started developing later than my peers, but I felt like I always had an affinity to 'computers' throughout my childhood.\n\n\nI went to an all-girls high school that had a slight emphasis on math and sciences, but I didn't really have any other friends who got into a STEM field.  (As an aside, it's not all that necessary for me to mention it was all-girls, but maybe it is important to my story?  Lately I've been asked to be part of a few initiatives at work to help promote women in tech.  I really dislike that whole dialogue and get a little embarrassed by it honestly, since I am mediocre at best but anyways, that's just my low self-esteem talking)...  Anyway,  high school is when my interest waned a fair bit, but even so, I would still work on webpages throughout high school, was pretty ok with my math abilities and was part of the computer science club.  I didn't really want to be part of the computer science club since my friends would roast me about it (not seriously or anything), and I mostly did it because my math teacher, also the supervisor for the club, really liked me and wanted me to be a part of it.  I happened to do very well in her math classes so she thought highly of me.  However, she did ask me one logic question (I suck at logic... weird that I became a programmer, right?) and after that, she advised me to get into law instead of math/cs.  I felt weird after that, but I still ended up getting into CS.  I have regrets about not doing more CS-ey stuff in high school, but I was really boy crazy and had stupid priorities. lol\n\nCut to university and I just felt like a total idiot.  So many other people would outperform me to the point where I just stopped caring and the only reason why I didn't drop out and switch careers was because I enjoyed my internships so much.  Most of the coding I ever did in school was during my internships.  If I had a group project, I was almost always on documentation (it was a huge chunk of the grade anyway haha).  I am eternally grateful for my internships as they helped me pay off my tuition and gave me the financial stability I needed since childhood.\n\nI've been working full-time for close to 10 years now and I'm thinking maybe there is some weird hybrid role I can do so that I can feel wonderfully confident in my role.  I either need to start affirming that I am a great developer and resign myself to doing 100 interviews as practice or just freaking switch out of development altogether.  So I know I'm in the right field, but I just don't know what my role would be.  If you have any suggestions, I'm definitely open to it.  I'm not the young, impressionistic kid anymore but I'm also not terribly old either.  Feeling a little bummed right now.  I'll probably read through this again after I posted and be like, geez!  I am one depressed mofo.  But yeah, this is probably the lowest I've felt about my career and any sage advice or words of encouragement are definitely welcome!\n\nI feel that the only thing that sets me apart from the next developer is that I really, seriously care about the aesthetics of the product.  I have no portfolio, I can't draw for shit but I am sensitive to placement of stuff and how things look and my 'eye' is usually aligned with the ux designer's eye if that makes any sense.  I just feel like others may notice these things but it just bugs them less or something.  Unfortunately, there is no hybrid role for that, at least not one I've seen.  I either need to just be the UI developer or the UI designer.  I bet a startup would be fantastic with that as I'd have to wear many hats anyway.  Thoughts?\n\nThanks for listening.\n\nTLDR; I'm a developer but despite having all the qualifications, I don't feel I'm any good and have considered switching careers.  To what?  Not sure, but would prefer to have something with an artistic bend to it.  Suggestions are welcome. :)  Thank you.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/4v009s/feel_like_crap_and_wondering_if_i_need_to_do_a/",
      "comments": [
        {
          "body": "I felt pretty similarly recently (I'm only two years out of college though). I struggled in some interviews while trying to find a new job and I was pretty down on myself thinking that I had no passion for what I was doing and also didn't have the mental acuity for a career in development. Then I really committed myself to interview preparation and the phone interviews started to go better. Then I started to get onsite interviews. Eventually I'll find a new job.\n\nAnyways, what you need to figure out is if it's your failures making you want to switch careers, or if you really don't have a passion for what you're doing. If it's the former then you simply need to commit yourself to doing whatever it takes to excel in your interviews. The alternative career paths you listed are legitimate options also, but you need to key in better on what you want because it seems like you were just throwing around random ideas.",
          "score": 1
        }
      ]
    },
    {
      "title": "EY SDC USA - Java Fullstack Developer interview",
      "body": "Has anyone recently been interviewed for a Java full-stack developer role, or received an invitation for an interview?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1hb4n0g/ey_sdc_usa_java_fullstack_developer_interview/",
      "comments": []
    },
    {
      "title": "Interview with EY London - help",
      "body": "**Hello everyone, I will interview for an audit senior role - Wealth and Asset Management at EY London, my interviewer is a senior manager and the duration is 60 minutes. Can anyone advise some insights and tips regarding the interview process like what would be the question (technical wise and competency wise) to expect in the interview? Cheers!** ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/14t1f0h/interview_with_ey_london_help/",
      "comments": []
    },
    {
      "title": "Is this a common occurrence?",
      "body": "I got this email this morning after my third interview with them on Monday. This has been a month long process from filling out my application, to a phone call interview, then a zoom interview, and lastly an in person interview. Is this just a nice way to reject me or does this actually happen where companies don’t end up hiring anyone? What would be some reasons as to why they would not hire someone all of a sudden?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1gft2wt/is_this_a_common_occurrence/",
      "comments": [
        {
          "body": "Positions do get cancelled in this way.  In my experience, it happens when either a project, product, or service was unexpectedly scrapped such that your role is no longer needed, or someone in leadership gets cold feet about bringing in someone new if it's maybe possible to make due with existing staff.",
          "score": 1
        },
        {
          "body": "Shoot, these days, we should be happy that they even bothered to inform you.",
          "score": 1
        }
      ]
    },
    {
      "title": "Turned down an interview, can I tell them I'm available again?",
      "body": "\nSo, I applied for a job elsewhere and was basically told I'd get an offer in 2 weeks. Well, I didn't get a job because I make too much.\n\nNot sure what else to say. I aced the interview and I was the most capable, experienced, and competent person they interviewed. \n\nI was told they could make an offer in 2 weeks. That basically turned into, dear God this guy makes way more than we are open to.\n\nHowever, i wrote down my minimium salary requirement (which is on the high end of their listed range but still there). \n\nI guess, with everything being in the open prior to the interview.... Why waste my time with an interview?\n\nRegardless, of that. I told another interview i had an offer and turned their interview down the day of..\n\nPrimary reasons are: They require a certificate within 6 months I'm not sure I can obtain in that time-frame. I'm still working on my application as it was found deficient (i sent transcripts but they want it direct from my school...) \n\nAfterwards test dates are at least 5 weeks out. If I mess up and don't pass the first time, I have to wait 6 months for attempt 2.\n\nSo, I'm thinking i call the employer and explain my situation and see if they'll have mercy on me?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1i72yuo/turned_down_an_interview_can_i_tell_them_im/",
      "comments": [
        {
          "body": "I worked at a company and was in charge of hiring for a lot of years and booked/ ran thousands of interviews. If the interview was booked and a time slot was held for you and the you canceled we definitely wouldn’t give them another shot if they reached out. If there was extenuating circumstances then we would take that back to evaluate but 99% of the time it was already proof we couldn’t count on you and would move along. Also something to consider is if they give you a chance, I would suspect they lowball as it gives a “you need us now…” feel to the hiring group.",
          "score": 1
        },
        {
          "body": "Just curious what certification",
          "score": 1
        }
      ]
    },
    {
      "title": "Advice Needed: Audit Offer vs Pursuing Corporate Finance (International Student)",
      "body": "Hi everyone,\n\nI’m currently an international student studying accounting graduating in May 2025 and could really use some advice on my career path.\n\nHere’s my situation:\n\n* I’ve received an offer from a mid-tier firm for audit, but I’m not entirely satisfied with it.  \n* I’ve applied to several Big 4 audit roles, but they seem out of reach. EY, for example, rejected me almost immediately for 4-5 applications, and other Big 4 applications haven’t moved forward.  \n* I’ve also had two interviews for Big 4 tax roles, but both ended in ghosting.\n\nCurrently, my ultimate career goal is to work in corporate finance or FP&amp;A. I’m considering looking into FA (financial analyst) roles at large companies next semester, but I’m unsure if that’s realistic.\n\nHere’s where I need help:\n\n* If my long-term goal is FP&amp;A, should I start in audit or try to directly pursue corporate finance?  \n* If I choose audit, should I:  \n   * Work hard to transfer to a Big 4 tax role and eventually pivot to Big 4 audit, OR  \n   * Spend a year in mid-tier audit and then jump to Big 4 or a corporate role?\n\nAs an international student needing sponsorship, I know my options might be limited, but I’d really appreciate any guidance or shared experiences.\n\nThank you so much in advance!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1hb9lez/advice_needed_audit_offer_vs_pursuing_corporate/",
      "comments": [
        {
          "body": "You should post in r/financialcareers",
          "score": 1
        },
        {
          "body": "Start in audit not tax if you want to be in FP&amp;A. You can also try asking this question in r/accounting and r/fpanda",
          "score": 1
        }
      ]
    },
    {
      "title": "EY consulting or Dell Sales? Advice on which one to choose please!",
      "body": "Hi I’m about to graduate college and I just got an offer from EY for consulting and I have my last interview for Dell sales later this month. Hypothetically if I also get the Dell sales job I’m going to have trouble deciding between both. EY is a great company to start out for because the name itself gets you in doors and Dell does too and it’s known for its sales program. To give you some info on myself I don’t like a desk job but enjoy going to places and talking to people. I know consulting is more stable than sales but does anyone have an advice they can give either from experience or what you have heard.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1gpeik3/ey_consulting_or_dell_sales_advice_on_which_one/",
      "comments": []
    },
    {
      "title": "Business Insider posted about fake jobs - why companies are doing it and what it means for employees.",
      "body": "||\n||\n|**Now (not really) hiring**|\n\n||\n||\n|**Corporate America has gotten so bad that companies are posting jobs they don’t intend to fill.**    A recent survey of hiring managers by Resume Builder found three in 10 companies have active [fake job listings](https://l.businessinsider.com/a/click?_t=c8e10479a20f45bba5aad6c5f6fbb009&amp;_m=a0aab6b8d2014328877e539313f63aec&amp;_e=ZDztU0Kf0kVtlpmByFpq64TeJFKkFoVz_WL0-TTw_Dj10idBtyG6vhroHE95tCxnfJv-bftwlJW1acm69bKLA4VuKFAHVdVWU1PCA-Gh4qo_7hapiapi7nPG1dXZPQYSWUJO3URBNEsOjGILYApzGHH3AB9AMN6RYKfkVefz3h6oIajB7rke9zbwUKxH6E7KbpjGiU6qcp9ggH1UogtPs5NALXorUgVBn3IfSqwjo5xrtZQOJXk1csx2EN0wYsw5-koBURae3UogLQ5C3Ukf8cueONkCVeUtfQQyEbqXxSIfK1xmeDqLO6raV-4PVlT14eHO1RDn0TnLuPxWnZ_927d58nXJTik_TilgNYDmD73yWdyz2lQ5-YmokjGqhK-wQ8Wmt4Dq6Tw-NRhwaKhNES5cenvouYNu4EozCz7w1uy0cSsa9NxLcz88MkQAHP9J), writes Business Insider’s Tim Paradis. And there is zero shame in their game, as nearly 70% of hiring managers said fake job posts were “morally acceptable.”   In fact, some companies justify the move as a way to help their employees. Posting jobs can give workers the impression the company is growing and signal to burnt-out employees that help is on the way.    Except, you know, it’s not.    It’s another knock for people navigating an incredibly frustrating labor market. While employment is still relatively low, [sitting at only 4%](https://l.businessinsider.com/a/click?_t=c8e10479a20f45bba5aad6c5f6fbb009&amp;_m=a0aab6b8d2014328877e539313f63aec&amp;_e=ZDztU0Kf0kVtlpmByFpq64TeJFKkFoVz_WL0-TTw_Diuk2FmymZTj2sg8Snl6dwpOd43HeBO5F2jZdSJ444Oh8h1oZwH6J0VWzeenGSE949ltZ-6yNkczoUV1ZKIpY5oJApu1H03JqfG0gWIPP_zGYEfeUSZXUt7XlV44_Y4F4gY_lrqulBTj_2Vcb_WMs8ESERtGjj-wv8EdrJKqh1e5OMkNqCgkNRZLx04C5NTQWyu7e4HyYXjLLnvp-jBofsQ31NasZLiFqu3pAnux44rGUUs_CbQ-_9UP8D73B6BqTn_IJGF0GzDpa6HKF4l9EJr-Lb8JXI6wCK9Hp32CpoEEm6kmsLMvpiZ5h0y7dqyaNWZMeNMdbc6twTA0pwznIvsMSYfoOt_96uNpnybkZRkvQDD7watTnEmnVOip7JfUNytlxXeI-HtwQPmLt9SZdTP), the job market is also pretty stagnant.      [High-paying white-collar roles](https://l.businessinsider.com/a/click?_t=c8e10479a20f45bba5aad6c5f6fbb009&amp;_m=a0aab6b8d2014328877e539313f63aec&amp;_e=ZDztU0Kf0kVtlpmByFpq64TeJFKkFoVz_WL0-TTw_DhlugDHXeafwEYiPRXVaVAKlFFJO5lb--xcYxu9Ilrex4nWpZ4TXCVfo6tZQ2MoWtYdKOgmGM-67iK9GEM5OV9ciU4zYLv0m9kt3A_mQepvj-oIVsuusMe3oqy2lEgK6TXlIqGOzxtjPsgPb37KV90ngtZ_GPAMky7og1X6MLokIgLypGvWxEy6iVvokXs-kA36sm0EfOi6EcFLzSezTP7yYIh1rRAdhJK4q1jBXlQhNLaNzixn-jYFTL-jGAXS9oofcYNglXTs89LGdFEByY79URwl7XDNvp6Zwy-34Hsw1nQtCZUbBtgl7zE7YXbPMsYbKwdWp6QkD8zNbR30BXVg7tpqNfeyX6xZW2DX-Y3e28JDLptfw83aJZrN1lKkYs1ah34HRNZc5k9z5omQj37leeW_46oDQci1suhpXkEYyw%3D%3D) aren’t readily available, and people aren’t quitting as much as they once were. (Goodbye, Great Resignation; hello, [Big Stay](https://l.businessinsider.com/a/click?_t=c8e10479a20f45bba5aad6c5f6fbb009&amp;_m=a0aab6b8d2014328877e539313f63aec&amp;_e=ZDztU0Kf0kVtlpmByFpq64TeJFKkFoVz_WL0-TTw_DhJg3RZ6qhKPrcM3J7YEAp0Gwafsg3pbE6PZ84l5aTGmMjryU4zSEz1SkazpMw9qwtFHkvnBw97_joWELbZv00P5aK03i_6P2cOGmWjGXGr1ELGzP6lUE08jMIJlUTqmf9pjtoPZ4MvClDBHJ_oOIbN9LYuzlXmHw9oWfvubZBTMIS0cq6IbDez6wU84N88jgmtUqSt8r13szkau5gg9sVOV7dhnQMl39vaxTdVbJpl1I7xvZOh9SbCqZB8DZAGvt4cQVoYFCWBGgFGu4BBiUfNJStwjpF6I5200gJ8xF38keF1eYD6GhL1lEx0lc1P8rSkfoAsocNGyqP_RJbnbkqKwYoEtAwrKz8HA3f_kGA6el1VTwEJVEjC16kcMaK0rBw3kqeYrLnoW_2fHtGHXkXeybjsjJWBOBGPgx5Te5LxVA%3D%3D).)|\n\n||\n||\n|**Even if you find a legitimate job posting, it doesn’t get much easier.**   With the power firmly back in employers’ hands, [the hiring process has become a marathon](https://l.businessinsider.com/a/click?_t=c8e10479a20f45bba5aad6c5f6fbb009&amp;_m=a0aab6b8d2014328877e539313f63aec&amp;_e=ZDztU0Kf0kVtlpmByFpq64TeJFKkFoVz_WL0-TTw_DheTlo4uCMxMy0flTXMSfTEEANW0DFNzjKBRBWHf4nP3BzopaSh_c3qSEwBgGuxpGBXHnU-ulfJPjkkgMk_yUfDcFmGyQgdLKl_jcrBFeFNhDbktolNrHBnZOHoQmNTrtn8bGite5VPsjb1amqRYgM8o7tfiG34cpnKjkRubSSup84iwXSj-nHawfOWUNJoETr5x79Ut43_dvSb7AW7NUqRtrb78BzLFTaY8PB_sz9QzIIdjK7vh96HQVruzfvpgMKdJnzfop-xI2MQFdNCDc_ZOc8p6FK7VZWYFwDvU75aeYKWSXIMpi8FUJ-E0ay5VT46i0P4Nd7d2G17san0H0gaiuqu22NpMxp4gFgqlmYQ6jfSp08NOCUcKLeV0qNSkQrS-VdSuFPBWAWltC3Hr5Mb), writes BI’s Alexandra Bacon. Multiple interview rounds, personality tests, and on-site assessment days drawn out across several months have become the norm.    And even then, you might still get ghosted!   It’s an issue that’s particularly relevant for entry-level roles, which are also under threat of being automated away by AI.   Maybe that’s why so many young people are feeling depressed and disconnected from their peers. Beaten down by the process, some are opting to wait things out. Last year, roughly 20% of people aged 15 to 24 were NEETs, [not in education, employment, or training](https://l.businessinsider.com/a/click?_t=c8e10479a20f45bba5aad6c5f6fbb009&amp;_m=a0aab6b8d2014328877e539313f63aec&amp;_e=ZDztU0Kf0kVtlpmByFpq64TeJFKkFoVz_WL0-TTw_Dhe2u07nQ01xsXlA_RwySfCYDzj4YkOKnZSEYcZwqIuKQ0G9hRJgcfqBJjC5LK0BfIiDuz3tMhiy2aWUWbP1RL7czkLkogc4K54UkdeahHVOm5BXSmxVIM8p8cXPAKTUrb3OqyHG-0GU5G2u3FtN5VrlLX5W7jtAHSWz2D2tQOLckG5D0yb-sqD7txzm4CxNmpafCcI2qz8bU4yIOZ0qbMQH7VseqPzboW_1_T9EJsVaP1DmMAg3uB97kWXD7qHCA-aHyMCCUKH7CYPWifGdHvcAJ-asW0MHw0Z6-8bP06g0JnDTqn00tni_3PoIVaxsZtNdZRUvbHhMz1yIqWVNlzADOxsoELH7Q_OGILD_5gOMNErDMsxW6eEaaFJUsqwoHs1tgtrryN7MamXReRmP0Se).    Some might argue companies taking their time to hire is a good thing in the long run. Better to make sure they get the right candidate than rush to fill positions that don’t ultimately work out, which could lead to layoffs. Workers were also spoiled with the 2021 job market, where candidates [named their prices](https://l.businessinsider.com/a/click?_t=c8e10479a20f45bba5aad6c5f6fbb009&amp;_m=a0aab6b8d2014328877e539313f63aec&amp;_e=ZDztU0Kf0kVtlpmByFpq64TeJFKkFoVz_WL0-TTw_DigGpWQoS4L3MlCM53-7__LkrNQ0bt3-TJeVT60S3sCWLIuN_PYB-kk7GhUtJyt_WH85I1p7wvSaThCMmpnslRhAEe3LNKEc0RGMgT_E1OeS8GfBqld-jyslfqEZg2mvv6MdhBBiMXqAEwluvtKUACZT6UEd3DxCUBoF_dMzGcPHk6JP8xn2JxwojN8qnayF96Yw93U8dj_m8cv9v-xoG0M4dRBUH9pOmZhMsGQOAhcDqM2Jv8TmgobrktLu3v3Fj1kiGPFothYQm-QTVXZwQOehtGGtho7l0FB5eImWfMA2ZEYl3WCp4h9MBFkhfEveu1nu6uGCVQ4HYXhQCBDY0usjmCBtI1GaxAdgXPM1JsPWFfLXF5eK-Ka22vwQz7rjzSMPKx5BJq4-F6ckzOUKt19).    Workers can claim back some power even in the current environment. Thanks to some states’ pay transparency laws, job postings (even if they aren’t real) give current employees an idea of how their salary compares to what their company is advertising for other roles.    And a fake job posting might be a blessing in disguise. After all, do you really want to work for a company willing to do that in the first place?|",
      "subreddit": "jobs",
      "score": 11,
      "url": "https://reddit.com/r/jobs/comments/1dp9kzn/business_insider_posted_about_fake_jobs_why/",
      "comments": [
        {
          "body": "I have been curious about the accuracy of unemployment statistics for quite some time. Are they counting every unemployed individual or just those who have filed for unemployment? How many full-time and part-time jobs are there in the workforce? What sectors are most affected? How do underemployment and discouraged workers impact these numbers? Are they including retired and underage who don't work yet? I plan to do some research to get a more detailed breakdown of the employment situation.  (I could also be absolutely wrong im open to information)",
          "score": 7
        },
        {
          "body": "Read full story on their (paywall-protected) website: [https://www.businessinsider.com/american-employees-disengaged-work-meaningless-fake-email-jobs-2024-6](https://www.businessinsider.com/american-employees-disengaged-work-meaningless-fake-email-jobs-2024-6)",
          "score": 1
        }
      ]
    },
    {
      "title": "very tired eyes during interviews for a job",
      "body": "I don't understand this, no matter the time of day i have the interview i always have this problem.\n\nIt's when my eyes become very tired and the urge to close them for a few seconds or blink A LOT is huge, it makes me a bit insecure because they do notice all the blinking.\n\nWhy does this only happen during interviews? it doesn't start right away tho, mostly about 15 or 30 min into the interview.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1eaa4pt/very_tired_eyes_during_interviews_for_a_job/",
      "comments": []
    },
    {
      "title": "Have not received offer letter yet. What shall I do?",
      "body": "I got my job in EY India in September via on campus placement. The interviewer said I would receive my OL soon and have to join from January. Its December and I still have not received any further updates. And my college is not letting me sit in any other exams.\nWhat shall I do? Should I wait more?",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/zdz2yq/have_not_received_offer_letter_yet_what_shall_i_do/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "When did they say soon? In September or recently? And have you followed up at all? If they said you’d receive a letter in September and you haven’t heard from them since that’s not a great sign.",
          "score": 1
        },
        {
          "body": "Check your spam or junk folder.  Contact EY India HR to see if there is a mixup.  Is it through school or a recruiter?",
          "score": 1
        }
      ]
    },
    {
      "title": "pray for me yall",
      "body": "i have a job interview tomorrow at a go kart track. this is my first job. im so nervous. anyone have any tips?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/166ejrj/pray_for_me_yall/",
      "comments": [
        {
          "body": "Try and get the email of the hiring manager and send a thank you email after the interview",
          "score": 1
        },
        {
          "body": "Firm handshake, look em straight in the eye and don’t be high .",
          "score": 1
        }
      ]
    },
    {
      "title": "Job search success",
      "body": "I spent the most of 2024 job searching. On January 2nd, a friend who just landed their new job shared a book written by a recruiter with me. This book was short enough to not get bored but covered insider details from writing winning resumes all the way to negotiating salaries. By the time I got to chapter 3, I realized how badly I had been messing up my search and an interview flunky LOL! Long story short, I am starting my new job next week and thought to share.\n\n[Job Search Secrets: A Recruiter’s Guide to Landing Your Dream Job: Morgan, Betty: 9798337526546: Amazon.com: Books](https://www.amazon.com/Job-Search-Secrets-Recruiters-Landing/dp/B0DFNF57DM/ref=tmm_pap_swatch_0?_encoding=UTF8&amp;dib_tag=se&amp;dib=eyJ2IjoiMSJ9.OvGPcCVL0-m91Vl1Lq4DlxEuF59v3mDkbnGt-Yf1abcUHN-tJb34i3ckLWjkRPwZf8oT5iIlUCTgaTzmQj_kImGBj6dwmCNBZCYYPeW9tRAKCBj0x0t5QZJ_5zRD5JX-I0G-bUyA9JlAKLDzQF5mZdF5bvnjRze10bd7yu3sIS-AV05qROxIoPgBP9xD1DjQnZ1IdYXWwZFrwRUhYRNTPi9Z9eI_jbqcrZQuaa-gzoY.5UdrbWN9shoYer3Nk9bnK094UQiGagaBdVGZOs-ETF4&amp;qid=1738161844&amp;sr=8-1)",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1icvhgl/job_search_success/",
      "comments": []
    },
    {
      "title": "Big 4 Interview Follow-Up – What Does This Mean?",
      "body": "Hi everyone,\n\nI interviewed for a position at EY on **November 15**, and I recently followed up with HR to check on the status. I got a reply on the day before Thanksgiving that said:\n\n*\"We are still evaluating candidates for the position, but no decision has been made yet. I will keep you posted as soon as I know more. Thanks!\"*\n\nI’m wondering what this response might mean. Does it sound like a generic reply? Or does it imply that I’m not the top candidate but still in consideration?\n\nAlso, for those who have gone through Big 4 interviews, how long does it usually take for them to respond with an offer or rejection? Does EY always send rejection emails, or could it just be silence if you’re not selected?\n\nI’d really appreciate any insights or advice—thank you!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1h5pkdm/big_4_interview_followup_what_does_this_mean/",
      "comments": [
        {
          "body": "&gt;I’m wondering what this response might mean. \n\nIt means exactly what it says:\n\n* They are still conducting interviews\n* They have not selected a candidate\n* They promise to update you when more info becomes available\n\nAdditionally:\n\n* There is no indication about the status your own candidacy.\n* There's no guarantee that HR will follow up with you.\n* You may or may not eventually receive an update by email.",
          "score": 2
        }
      ]
    },
    {
      "title": "Seeking advice on entering EY for future career in private equity, venture capital, entrepreneurship? ",
      "body": "Hello Reddit community,\n\nI recently completed an interview at EY where I was presented with two potential paths: Corporate Finance and EY Parthenon (EYP), which focuses on Strategy and Transactions. My long-term career goal is to enter private equity, specifically in portfolio investment and venture capital or start something of my own.\n\nAlthough my experience and qualifications are stronger in strategy, I have some concerns about which path would better facilitate a transition into private equity. Here are my thoughts and questions:\n\n1. Strategy and Transactions at EYP: My background aligns well with this side of EY, where I can leverage my experience in strategy. Given my qualifications, entering through EYP might be more straightforward and provide a solid foundation in the strategic aspects essential for private equity.\n\n2. Corporate Finance: This area is crucial for understanding detailed financial modeling and transactions, skills that are directly applicable to private equity. However, my exposure to corporate finance is limited to a few university courses.\n\n3. Ease of Transition Within EY: I’m also considering which path would be easier to enter through the interview process, I would need to study heavily for the lengthy interview process if it involved finance but it would be easier to enter strategy? Or maybe not because it has more candidates? I have no clue.\n\nGiven these considerations, which path would be more advantageous for someone aiming to move into private equity in the future? Is it better to start where I'm strongest, or should I focus on building skills in areas where I'm less experienced but that are crucial for my career goals?\n\nAny insights or advice on this would be greatly appreciated!\n",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1crnhln/seeking_advice_on_entering_ey_for_future_career/",
      "comments": [
        {
          "body": "try r/consulting",
          "score": 1
        },
        {
          "body": "As someone at EYP, it may be your best bet at getting into PE. This is mainly due to our high number of diligence projects. Yes Corporate Finance will make you highly skilled in financial modeling, but doing diligence through EYP will likely give you more quick and constant exposure to PE clients if you take the diligence route eventually, especially since PE pods may work with the same PE’s throughout the year(s)",
          "score": 1
        }
      ]
    },
    {
      "title": "Rejected in Round 2 - Should I Try Again?",
      "body": "Quick Edit: I just remembered the rejection happened at round 3 part 1.\n\n&amp;#x200B;\n\nI applied for a role ( same position I am currently in but different company) and I was rejected on the first technical interview because I wasn't proactive enough in my approach. I asked if they could clarify and they just wanted me to add one more sentence to the document that was essentially a rewrite of another sentence I did include in my presentation. I was shocked and showed what I presented to two of my previous bosses and a VP of Sales I used to work with who were very confused as to why I was rejected and assumed it was just the hiring manager being overly picky because there was nothing wrong with what I presented based on the brief they provided me.\n\nIn the first interview I really impressed the VP who interviewed me. I had high hopes for this job and it was in all honesty my dream role in a dream company with amazing culture.\n\nI noticed today that they have relisted the role this morning. So I assume their hiring hasn't been going well. I was wondering if there is any point at all to emailing the hiring manager to see if I could potentially get another interview. I have never done that before but this job was really something I was truly excited about. Is this a bad idea? Is there a specific approach I should take?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/18girxs/rejected_in_round_2_should_i_try_again/",
      "comments": [
        {
          "body": "It will just cost you time. But usually rejection that late in the game and a repost right after means it will go nowhere.",
          "score": 1
        },
        {
          "body": "You can try but remember you were rejected for a reason (in their eyes at least)",
          "score": 1
        }
      ]
    },
    {
      "title": "How long should I wait between calling to inquire about my application?",
      "body": "For context, I have applied twice for the same position. Both applications are active, since, if my research is correct, the company takes up to 6 months to get through the application process, and my first application was submitted in June. My second application was submitted a couple of weeks ago, after the job description added additional mandatory training, and I have since done a one-sided interview. Firstly, I don't know which application that the interview was for, and both are still saying \"To be Reviewed\" whenever I check up on them. I have just recently called to inquire about which application the interview was for, and if there was anything more needed from my end, only to leave a voicemail. And I have yet to get a response from my other attempts to contact them. When would be the best time to try to call them back again? Is multiple times a week too much? Should I try once a week? Or should I call at a different interval? Any advice will be much appreciated.",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/16mfajc/how_long_should_i_wait_between_calling_to_inquire/",
      "comments": [
        {
          "body": "Calling too much is not a good idea unfortunately. If you're anxious about job hunting like me, I keep wanting to call all the time and keep checking my e-mails.\n\nYou've already applied twice. You had a one-sided interview. You already called once to get an update and left a voicemail. You've done everything you can do at this point to be honest.\n\nSince you said it can take up to 6 months to get hired, wait one month. If you hear something sooner, congrats! I had two companies call me back for an interview one month after submitting an application and the other company, about 6 weeks out. But I already found another job!\n\nI know it may seem like a long time, but remember this, if a job really wants you, you WILL hear back. Calling them multiple times, calling each week, or sending a lot of follow-up e-mails aren't really going to do anything.\n\nI hope you get this job though! You sound like you're a go-getter and have this strong mindset. Just be patient and relax, be disciplined :)\n\nBest wishes!",
          "score": 1
        }
      ]
    },
    {
      "title": "Career Growth/Mobility in NielsenIQ",
      "body": "Hello! I just signed an offer as Project Admin/Coordinator in NielsenIQ but want to shift to HR because it is in line with my career path. Though, I still plan on staying as project admin for a while to get to know the ops side. Does Nielsen support this (since I'll be transferring from Ops to Admin) and are there usually openings for HR?\n\nI recently got an interview invitation for Change Management (under Advisory) in EY GDS and want to also know if this is a better option? I think they have more trainings than Nielsen\n\n&amp;#x200B;\n\nThank you!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/t823gf/career_growthmobility_in_nielseniq/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I’ve personally never heard of an NielsenIQ so maybe I’m wrong, but it seems to be not a very large company after looking it up. I extremely doubt you’ll find someone on Reddit who can answer that question about them.\n\nAs for EY, I can answer that and it’s easy to find opinions since EY is massive. GDS is basically a second-rate arm of EY. It’s where client-facing teams send off their grunt work and boring stuff that they don’t want to do. You get all of the crap work, none of the client-facing opportunities, and everyone knows it’s not equivalent to being at EY proper.\n\nThat being said, for many, it’s very hard to break into a big4 firm. Entering big4 through these service delivery centers is not the worst choice if you find that you have rather underwhelming job choices. \n\nIn this scenario, I would 100% pick EY GDS.",
          "score": 1
        },
        {
          "body": "Im an incoming intern for Nielsen and when discussing mobility within the company with my manager they mentioned it being an easy process. Then again, just an incoming intern and I don’t know how true it is. Would like to know your experience if you choose Nielsen though! Goodluck.",
          "score": 1
        },
        {
          "body": "Hello! I just had the assessment for the Project Coordinator/Admin as well. How was the offer? Been looking forward to this since I specialize in Admin works.",
          "score": 1
        }
      ]
    },
    {
      "title": "EY tech consulting interview — is it really as “technical” as people say or just buzzwords?",
      "body": "Hi all, I’ve got a technical interview coming up for a Technology Consulting Intern role at EY and I’m trying to figure out what to actually expect. I got this interview through a coffee chat with an EY partner, so it may be more unconventional compared to applying on their portal. I’ve already passed a behavioural one-on-one that was very open ended and conversational. \n\nI’ve heard wildly different things from students I’ve talked to — some people say it’s super technical (SQL, Python, case studies, system design), while others say it’s more like, “Tell me about a time you worked in a team” + buzzword bingo about cloud or AI 😂.\n\nFor anyone who’s actually been through it recently — what kind of questions did you get? Was it legit technical or more behavioral / consulting-style problem-solving?",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1o8tvhc/ey_tech_consulting_interview_is_it_really_as/",
      "comments": [
        {
          "body": "Honestly it's more buzzword bingo than actual technical stuff. They'll ask you to walk through a basic tech problem or talk about cloud migration but it's not like they're gonna make you code on the spot.\n\nI prepped with some mock interview tools just to get comfortable talking through tech concepts out loud. I tried Final Round AI's mock interview and it helped me practice explaining stuff without sounding like I memorized Wikipedia.\n\nMost of it was \"how would you approach helping a client move to AWS\" type questions. Know the basics but don't stress about deep technical knowledge.",
          "score": 2
        }
      ]
    },
    {
      "title": "Tax Technology and Transformation Senior Interview at EY",
      "body": "I am interviewing for a TTT Senior position at EY soon but don't really know what to expect. Does anyone have any input?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1niof18/tax_technology_and_transformation_senior/",
      "comments": [
        {
          "body": "The interviews typically focus heavily on your technical skills, problem-solving abilities, and understanding of how technology can streamline tax processes. You'll likely face questions about tax software implementations, data analytics, process automation, and your experience with tools like Alteryx, Tableau, or various ERP systems. They'll also dig into behavioral questions about managing client relationships, leading project teams, and handling tight deadlines since TTT roles involve a lot of client-facing work and complex implementations.\n\nThe tricky part is that they'll expect you to demonstrate both deep tax knowledge and strong technical acumen, which can be challenging to balance in your responses. They might throw scenarios at you about system migrations, compliance automation, or helping clients adopt new tax technologies. Since you're going for a senior role, they'll want to see leadership examples and your ability to translate complex technical concepts to non-technical stakeholders. I'm on the team that built [AI assistant for interviews](http://interviews.chat), and it's designed specifically to help with these kinds of multi-faceted interview questions where you need to showcase different skill sets simultaneously.",
          "score": 1
        }
      ]
    },
    {
      "title": "EY technical interview",
      "body": "First time applying at EY and got a Technical Interview\n\nHi guys! So I applied for this position at EY for a **IT Advisor - Tech Con - SCT - Supply Chain - Energy Opt - Manager** and I got the **hirevue assessment** 3 weeks ago and then today I got an email for a video interview and on the career portal it says I am in the technical interview phase of the interview process.\n\nSo I am wondering how does this go if anyone can give any feedback or input or how it works? I am so nervous and I have never interviewed at any Big 4 or any company like this before. \n\nI would appreciate any and all help! Thanks everyone in advance for the help/assistance!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1dnl40g/ey_technical_interview/",
      "comments": [
        {
          "body": "Congrats on getting the interview at EY! It's understandable to be nervous, especially for your first Big 4 interview. From what I've heard, technical interviews at EY for IT Advisory roles typically involve a combination of behavioral questions, technical knowledge assessments, and potentially even case studies related to your specific area (Supply Chain tech in your case). They want to gauge your experience, problem-solving skills, and how well you'd fit within the team.\n\nMy advice? Research EY's work in the Energy Optimization space and brush up on relevant tech concepts. Also, prepare some examples from your past experience that highlight your skills and achievements.\n\nBy the way, I build a tool called Interviews Chat (https://www.interviews.chat) that can help you practice answering common interview questions and get AI-powered feedback. It might be helpful in your preparation. Good luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "EY Executive Director Interview Advice/Help?",
      "body": "Hi guys,\n\nso I am looking for some advice and/or assistance for my upcoming EY USA interview with an executive director.\n\nSome background, so I applied for this role - **IT Adv - Tech Cons Manager** and this was back in end of May, then in mid June I got the hirevue assessment and answered all the questions and then it was radio silent till last week (sep 10) that I got the interview and then I sent my schedule and they came back to me with a time and date and the person interviewing me.\n\nNow usually I know there are between 1-3 rounds for the process starting usually with a manager and then senior manager and then partner/executive director as the final round before an offer is made. I have applied for and reached the first and second interview phases for other roles but then been rejected after the senior manager interview but for this role in particular, like I said I have not had any other interview besides the recruiter interview and hirevue assessment and now my first actual interview for this role is with an executive director so I do not know if this is a good thing or a a bad thing?\n\nFrom what I have heard and read online and on reddit, usually the Executive Director interview is more of a culture fit and conversational interview for 30 minutes and not really technical or background or anything but as this is my first interview for this role in particular, I am confused and do not know what will happen or if this is the only round for an interview before an offer is made or what?\n\nAny help or insight or advice would be much appreciated and I thank you for reading my post and offering any help or support if possible!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1fk2q0r/ey_executive_director_interview_advicehelp/",
      "comments": [
        {
          "body": " The fact that you're jumping straight to an Executive Director interview could be a positive sign - they might be fast-tracking your application based on your HireVue responses and resume. However, don't assume this is the final round. Be prepared for a mix of technical questions, behavioral scenarios, and cultural fit discussions.\n\nGiven that this is your first interview for this specific role, expect a comprehensive conversation covering various aspects of your experience and skills. The Executive Director will likely want to gauge your overall fit for the position, including your technical knowledge, leadership potential, and alignment with EY's values. Be ready to discuss your relevant experience in IT Advisory and Tech Consulting, and have some thoughtful questions prepared about the role and EY's strategic direction. If you're feeling nervous about navigating this interview, you might want to check out [interviews.chat](http://interviews.chat) I'm on the team that created it, and it's designed to help job seekers prepare for tricky interview questions and boost their confidence in high-stakes situations like this.",
          "score": 1
        }
      ]
    },
    {
      "title": "EY case study interview advice needed",
      "body": "I have an EY senior consultant case study interview(valuations team) soon and have no idea what to expect. Any advice on the process would be much appreciated!",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/ybbjef/ey_case_study_interview_advice_needed/",
      "comments": []
    },
    {
      "title": "EY-Parthenon DMA (Decision Modeling &amp; Analytics) 2026 Internship Final Round Interview Tips Please!",
      "body": "Hi all! I have a final round interview for EY-P's Decision Modeling and Analytics team (DMA) on Friday (10/24) and am wondering if anyone has gone through this process or knows anything about what the final round might look like. The second round was a take-home excel case with a DCF model and powerpoint presentation. I am wondering if there is anything I can be preparing for before then as I really want to work in this team! Any thoughts would be so helpful thank you!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ob1wj4/eyparthenon_dma_decision_modeling_analytics_2026/",
      "comments": [
        {
          "body": "I also got it. Do you have any info yet?",
          "score": 1
        }
      ]
    },
    {
      "title": "EY Analyst Role (Business Consulting Risk) – AI Interview Coming Up, Need Help!",
      "body": "Got shortlisted for the Analyst - Business Consulting Risk role at EY (Gurgaon). The next round is a virtual AI interview with their bot “Pihu.” It’s my first time doing an AI-led interview — anyone here done it before? Would appreciate any tips or insights!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1l9r3y9/ey_analyst_role_business_consulting_risk_ai/",
      "comments": [
        {
          "body": "I have seen some people do legit AI interviews and most what I am seeing is you need to ignore the repetitive responses the AI bot can do. I do hope their AI is better streamlined or better not give you any comments back. Some people complained where they stated they kept getting \"Is that so?\" \"Is that so?\" etc. So be ready for those repetitive responses.\n\nI rather see an AI that actually listens to you and not respond back.",
          "score": 2
        },
        {
          "body": "EY's Pihu will likely ask you standard behavioral questions about teamwork, problem-solving, and why you want the role, plus some technical questions about risk management and business consulting. The key difference is that you won't get the usual conversational flow or follow-up questions, so make sure your answers are complete and structured from the start. Practice speaking clearly and at a steady pace since the AI needs to process your speech accurately.\n\nThe biggest advantage of AI interviews is that you can take a moment to think before responding without it feeling awkward like it might with a human interviewer. Focus on giving specific examples that showcase your analytical skills and understanding of business risk, and don't worry if you need to pause to collect your thoughts. Since this is for a consulting role, they'll want to see your problem-solving approach and communication skills, so structure your responses with clear reasoning and outcomes. I'm actually part of the team that built [interview prep AI](http://interviews.chat), which helps people practice exactly these kinds of tricky interview scenarios and get real-time guidance on how to handle unexpected questions.",
          "score": 2
        }
      ]
    },
    {
      "title": "Interviewer asked if I was reading from somewhere 😳 – anyone else faced this?",
      "body": "Hey folks,\n\nI just had one of the weirdest EY interview experiences today and I’m still processing it. Would love to hear if anyone else has gone through something similar and how you handled it.\n\nSo here’s what happened: I was giving an interview for a TPRM role, and everything seemed to be going okay until towards the end, the interviewer suddenly paused and asked me, “Are you reading your answers from somewhere?” I was totally stunned. I said, “No,” because I genuinely wasn’t. But the interviewer repeated the question like they didn’t believe me: “It sounds like your answers are from the internet.”\n\nAt this point, I honestly froze a bit. Throughout the interview, I had this gut feeling that the interviewer wasn’t really vibing with me, and this just felt like the final nail in the coffin. I tried to explain that I recently did a cybersecurity certification and have been studying really hard, like doing 2-3 mock tests daily for the past 3 months, so yeah, maybe my answers sounded very “theoretical,” but they came from genuine prep, not a script. But I don’t think I explained it clearly. I was nervous and caught off-guard, so I might’ve sounded unsure. The interviewer followed up with: “So you only have theoretical knowledge?” and I said, “Yes, I haven’t had the chance to use it practically yet.” That was the last question.\n\nIt honestly felt like they just threw that at me to rattle me. And maybe it worked, because I left feeling super deflated.\n\nHas anyone else ever been asked if you're reading or copying from somewhere in an interview?\n\nHow do you even respond to that without sounding defensive?\n\nAnd what should I have said to turn it around?\n\nWould really appreciate any insight, especially from people who’ve broken into cybersecurity or other technical roles without much hands-on experience. 🙏",
      "subreddit": "interviews",
      "score": 286,
      "url": "https://reddit.com/r/interviews/comments/1lprtlv/interviewer_asked_if_i_was_reading_from_somewhere/",
      "comments": [
        {
          "body": "You sounded too rehearsed, that’s the issue. You need to sound more natural. \n\nWhat you could potentially say, from my resume it is clear I don’t have working experience which is why I applied to this role to obtain the experience.",
          "score": 104
        },
        {
          "body": "I would have been totally thrown off as well. \nIf you ever come across the scenario again, perhaps if you turn it around and say ‘thank you, all the practice must be paying off’ or something. But yeah definitely demoralising. ",
          "score": 49
        },
        {
          "body": "It’s very weird that only your camera is on, not saying that I don’t believe you, but what is their justification? I find that so rude.",
          "score": 11
        },
        {
          "body": "You say, “Well, I’m intelligent and articulate, so I suppose it shows. Thank you for the compliment.”",
          "score": 8
        },
        {
          "body": "Next time say, would you like me to answer your questions while closing my eyes? 😂\n\nBut really, I think it probably sounded too rehearsed. So try to make it sound more natural and try not to use too many big words (if that is happening) so that it sounds more like a conversation.",
          "score": 14
        }
      ]
    },
    {
      "title": "EY INTERVIEW HELP",
      "body": "I got a request for an interview at the EY (Accounting firm) and need some advice on how to really ace it. Can someone who have gotten an interview with them or works for them PLEASE PLEASE please give me advice on what questions they will ask or just any advice. I stutter and go completely blank during interviews so I’m trying my best to really practice. PLEASE I’m begging",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/16gj669/ey_interview_help/",
      "comments": [
        {
          "body": "I don’t work for EY but I do work in HR for a similar firm, and here’s what I can advice you to nail *any* initial interview:\n\n- Why do you want to work for EY? Research the company, the core values, the recent news and mention it when asked. Make sure that it resonates with you and it will come off as genuine. It can be something as small as I have seen this company’s engagement towards diversity and it is something that I respect as it improves learning from different backgrounds and perspectives. \n\n- Study the job posting for the role you applied to. When asked about your career history, repeat them the responsibilities of the job posting (obviously in different/your words). If you have never worked in the same job title you are interviewing for, specify exactly what you did at your previous jobs and how are they related to this role. Be precise in your career history but please read the room. Your answer should not be more than 2 min. They will ask prompt questions, so it will feel more like a conversation. \n\n- Make sure you know what EY core values are. Companies sometimes like to ask candidates what do they know about the company, what interested them towards this role (for the love of God, please don’t say I saw this posting on LinkedIn and decided to apply as it looked interesting”) \n\n- Be clear on your salary expectations when asked. I advice researching on Glassdoor- pretty accurate salaries that you can research based on company, position and location. It will give you an amount in mind, but let them specify a salary range first. \n\n- Smile and be polite. Saying thank you and really meaning it is underrated. Let them know you appreciate being interviewed here and look forward in hearing back. \n\n- If something doesn’t make sense, ask questions DURING the interview. This comes off as actively listening, and being attentive/interested.\n\n- Review your own resume. Know your shit. What did you exactly do at X company? For how long? What tools did you use? Which team did you collaborate with? Why did you leave? Be honest yet never bash your past employers. If you hated them, say something along the lines of “I am looking for a better work/life balance (ie if you’re overworked at the moment), EY culture seems like a great fit with my personal values (ie if you don’t like your company culture). \n\nI know that you were looking for someone from EY to answer, but I conduct interviews on the daily and really hope I helped a bit. \n\nJust be excited!!! It’s awkward, we get it. We’re all human! You’ll do great if you practice and come prepared.",
          "score": 2
        },
        {
          "body": "What should i prepare for EY interview in risk managemnt",
          "score": 1
        },
        {
          "body": "I know it's a little late for me to give you any advice but how did your interview go?",
          "score": 1
        }
      ]
    },
    {
      "title": "EY interview process within CBS Service Line. Any leads?",
      "body": "I have a 45 min interview coming up for a position in CBS. How does their interview process work? Is it more technical or behavioral in nature?  Please let me know!  Thanks!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/10unfpd/ey_interview_process_within_cbs_service_line_any/",
      "comments": []
    },
    {
      "title": "EY UK - Interview Help",
      "body": "Hi All,\n\n\nExtremely new to this sub and I need some help. I have an interview with EY UK - FAAS. Can I know what to expect? I have not been interviewed by a big 4 firm or by a company overseas.\nAny sort of help would be greatly appreciated.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/qua7fl/ey_uk_interview_help/",
      "comments": [
        {
          "body": "I’ve been interviewed by a big 4 firm before. Didn’t get the job mind you lol. Key lessons I learnt are: Professionalism. Be extremely communicative - engage your audience by breaking down difficult concepts into easy explanations. Stay calm. They probably heard every answer and seen every nervous candidate. \n\nJust go over the job descriptions and requirements. They vaguely believe you are suitable. This step is for you to convince them in person you will excel.",
          "score": 2
        }
      ]
    },
    {
      "title": "Super cold EY interviewers??",
      "body": "Just got rejected after the AC round which I was expecting due to my poor individual interview \n\nBasically, last week I had my AC/assessment centre virtually.\nThe introductory session with the HR reps and partner was really nice, fun and welcoming. The first round that followed was the group interview which went well.\n\nThe second round/ individual interview with two directors really threw me off. Both of them seemed super cold and disinterested from the start. I’ve had various interviews before and they were all super bubbly and nice so that’s what I was expecting coming into this. \nLiterally none of them cracked a single smile or joke throughout the whole process. This really threw me off as if felt like they had decided they didn’t like me from the beginning. Because of this, my answers were really poor, I was stumbling and in shock really. Admittedly I should have been able to answer their generic questions that I had prepared for beforehand. \n\nMy interview feedback was to be more passionate and energetic next time. That they’re not looking for experience but rather personality. This makes sense if the interviewers were actually friendly. But at the time I felt like I was just trying to mirror their more serious energy and mood \n\nSo basically my question is \n- should I expect this type of cold reaction/behaviour in the future? \n- would my response then just be ignore them and be all bubbly and perform for them like a circus monkey? \n\nSorry for the long rambling post lol any insight is appreciated!!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/u7lzgh/super_cold_ey_interviewers/",
      "comments": []
    },
    {
      "title": "scheduled call after final interview? good or bad?",
      "body": "hi everyone, i recently interviewed at EY last friday and heard back yesterday through a call from my recruiter that he will be contacting me soon about updates and all. (he also asked location preference, if im still interested). \n\ntoday, he emailed and scheduled a call with me for tomorrow at 9:30am. how should interpret this scheduled call? i can’t imagine someone to schedule a call just to reject me, but also after researching on reddit, it’s happened to others so now im just worried. what do you guys think?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1ocxzjr/scheduled_call_after_final_interview_good_or_bad/",
      "comments": [
        {
          "body": "There’s only one way to find out.",
          "score": 3
        },
        {
          "body": "I think it’s good news, especially if they called you Monday to ask about location preference",
          "score": 1
        },
        {
          "body": "Hoping for the best for you! I’m in the camp of that followup call being a rejection and letting me know I was still in their system. But, I think it’s more common for either an offer or intermediate update if there’s a delay. For me, I now go in expecting the worst and hoping for good news just so I don’t get crushed again by getting my hopes up. \n\nWishing you the best of news and hopefully they offer everything you’re asking for!",
          "score": 1
        },
        {
          "body": "Did they scheduled a beginning and ending time?  The longer it is, the more likely it’s good news",
          "score": 1
        },
        {
          "body": "How did it go?",
          "score": 1
        }
      ]
    },
    {
      "title": "Is there anyone who still struggle with these questions, “Tell me about yourself?” or \"Tell us about your work experience for this job?\"",
      "body": "Not asking because I struggle but because I used to and yeah have found a simple framework that I just find easier to put my words together. I think it might just help someone out there as well.... That pain of hustling and draining your energy I find it unnecessary when you can replicate someone thing or how they did it. \n\nThe common question for many is \"Tell me about yourself?\"…and ever since I was introduced to the SSS framework, I've found it to be the easiest way one can use to introduce themselves. \n\nI've also come to a point where I understood sometimes we struggle because every time we do something, we have a new approach to something making it difficult to master. \n\nEy, I know you're not here for a lecture so to cut the story short, here's how you can use SSS framework to help you too:\n\nSo, let's break down a response using the 3S formula:\n\n1. Success: This is just telling what you do, yet focusing on most impactful moments of it. I would either start my very first line as, \"I have been...\" or, \"My background in has...\"\n\n2. Strength: I would tell one or two strengths relevant to the role and catch my interviewer's attention by starting my sentences like: 'My real strength lies in...\" \n\n3. Situation: I would explain what I'm looking for in a company. \n\nThus I start my sentence as, 'What I'm looking for is...\"\n\nThat should be able to give you a clear roadmap of coming up with yours.\n\n**Disclaimer:** Like I said earlier, this is not the only way to answer this question. But I found it the simplest and easiest. Because let's face it, everyone attending the interview is highly qualified as you for the job, hence they will not go for average ones when there are best ones. Thus best answers will stand out.\n\n\\---\n\nBest of luck to everyone – I know exactly what you're going through. Stay strong, and keep pushing forward!\n\nF\\*ck it, I need a glass of wine.\n\n*Cheers!*",
      "subreddit": "interviews",
      "score": 9,
      "url": "https://reddit.com/r/interviews/comments/1jbc9jd/is_there_anyone_who_still_struggle_with_these/",
      "comments": [
        {
          "body": "The SSS framework is a solid approach, but it's not the only way to tackle those tricky \"Tell me about yourself\" questions. The key is to be authentic and showcase your unique value proposition. Instead of rigidly sticking to a formula, focus on crafting a compelling narrative that highlights your most relevant experiences and skills. This way, you'll come across as genuine and memorable, rather than sounding rehearsed or robotic.\n\nThat being said, don't overthink it. Interviewers are looking for someone who can do the job and fit into their team culture. Be yourself, share your passion for the role, and demonstrate how your background aligns with their needs. If you're struggling to find the right words or structure your response, you might want to check out [interview helper AI](http://interviews.chat). I'm on the team that created it, and it's designed to help you navigate tricky interview questions and ace job interviews with real-time AI-powered suggestions.",
          "score": 1
        }
      ]
    },
    {
      "title": "Video Interview Tips",
      "body": "I am interested to hear what tips and tricks everyone has to be successful in a video interview.  For example, do you hang notes around your computer monitor for points to bring up so that you are not looking down at your papers?    *There are 3 or 4 points I want to bring up in my next round interview and I am thinking of hanging them on my second monitor so that I have them at eye level to address without looking through my papers.* \n\n**How do you prepare for the video interview** in order to put your best foot forward.  Please share!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1gb40c2/video_interview_tips/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Just be sure to keep the notes concise and easy to read at a glance, so you're not visibly scanning or squinting during the interview. This approach can help you come across as more prepared and confident, without the awkwardness of shuffling through papers.\n\nBeyond note placement, ensure your background is clean and professional, your lighting is flattering (natural light from a window works well), and your audio is clear. Test your tech setup beforehand to avoid any last-minute glitches. Dress professionally from head to toe - you never know when you might need to stand up. And don't forget to engage with your interviewer through body language, even on video. Smile, nod, and use hand gestures naturally to convey enthusiasm and build rapport. By the way, I'm on the team that made [interview copilot](http://interviews.chat), a tool designed to help with tricky interview questions during video interviews.",
          "score": 1
        }
      ]
    },
    {
      "title": "Do you guys keep interviewing at other places even after immediately securing a decent job?",
      "body": "After several rounds of brutal interviews over a few months, I managed to finally secure a job offer as an Associate Platform support specialist which was a **huge** sigh of relief considering that my current role (internal help desk) requires me to relocate 3 hours away to a higher COL area by early August. Relocation is thankfully out of the picture for now since this new company is fully remote.\n\nBut then just today, I get an email from EY (Ernst &amp; Young - never heard of them until now, but apparently they're a consulting company?) for a Cyber Operations Engineer role that I applied to nearly a month ago asking to provide availability for an interview. I'm almost certain that if by some miracle I clear another round of 5-6 interviews, given their posted salary range of $73,000 to $132,000, they'll probably lowball me with a salary of around $72,000 to $75,000 which is what I'm set to make anyway at the new company that is fully remote. The Cyber position at the very worst would be 5 days in-office with a 40 minute roundtrip commute (which isn't too bad) and at the very best, probably hybrid (3 days in office and 2 days remote).\n\nConsidering the data, I'm leaning towards just passing up this interview, but part of me has hope to secure a higher salary (shooting for $85,000 to $100,000) with the Cyber role. At one point, I really really wanted to get into Cybersecurity, but right now, I'm not too sure. And well, a 40 minute roundtrip commute isn't too bad either. On the other hand, I'm really tired of the whole interview process - not looking forward to 2-3 months of investing in this stuff all to get ghosted in the end.\n\nI'll also have to explain why I'm leaving my role as my job history is not looking the best. I got let go (RTO mandate) from my previous company and got my current internal help desk role just a month ago that I'm already set to leave by next week. Then, I'd have to explain why I'm leaving the new job that I'm set to start at the end of the month. They'll flag me as a job hopper for sure.\n\nWhat would you guys do in my situation? Would you still try to attend the cyber interview in hopes of getting a higher salary? I'm about tapped out on interviews and I'm done trying to explain why I'm leaving my current position(s).\n\nDo you guys keep interviewing despite having secured a decent job?",
      "subreddit": "interviews",
      "score": 25,
      "url": "https://reddit.com/r/interviews/comments/1lgmxb2/do_you_guys_keep_interviewing_at_other_places/",
      "comments": [
        {
          "body": "You never know what’s going to happen so I’d take the interview. I understand you’re tired, but given that you already have a solid offer, you can go into this interview a bit more relaxed. \n\nRemember, the interview works both ways: YOU are also interviewing THEM.",
          "score": 21
        },
        {
          "body": "Irrespective of the job market : I’d always continue to interview till after 1st week at the new job. I know anything can happen at any time",
          "score": 12
        },
        {
          "body": "Yes you can interview to learn more about the position since they might not post the whole truth unless you are busy with the current job. Burning the bridge is a process elimination for me. It shows the worse side of the managers. They know that things are subjected to change in a business.",
          "score": 7
        },
        {
          "body": "Most people do continue interviewing after accepting offers, but your situation is different because you're coming off months of brutal interviews. The smart move here is to start your new remote role, get settled, perform well for at least 6-12 months, and then reassess the market when you're in a stronger position both mentally and on paper. If cybersecurity is truly calling to you, those opportunities will still exist next year when you can approach them from a position of stability rather than desperation.\n\nI'm on the team that made [AI interview helper](http://interviews.chat), and we built it specifically to help people navigate tough questions about job history when they do decide to interview.",
          "score": 4
        },
        {
          "body": "Take my advice continue to interview and even field offers until you’ve passed the companies probation period. I’ve read dozens of post in these subs about folks being released under 90 days with no explanation other than failed probation",
          "score": 4
        },
        {
          "body": "Always keep interviewing. Your work teammates are not your family and there is a saying that \"we are always 2 emails away from getting fired\", even as the most hardworking employee.",
          "score": 3
        },
        {
          "body": "Depending on how important the money is and how interested you are in the Ernst job, I’d recommend doing the interview. You don’t NEED that job so you’re in a much better position to ask for more money. Ask for whatever amount would lead you to take the job. If they say no, no loss. If they say yes, you’ve just got yourself a higher salary than you would have otherwise.\n\nI’m not clear on why you’re concerned about having to explain things about your job history. Didn’t you just get a job based on the same information?\nBtw, E &amp; Y is a large, well-known company. They will probably expect you to be familiar them, so best to prepare for that. Good luck whatever you decide!",
          "score": 2
        },
        {
          "body": "I would agree that you should keep interviewing just in case. There have been multiple stories of people starting at a company then get cut within a day or month of starting. Protect yourself any way you can.\n\nBUT  also investigate companies you are interviewing. EY is a consulting company and, depending on your role, has a history of hiring and firing quickly. Might not be the best choice if you don't like to take risks....",
          "score": 2
        },
        {
          "body": "I secured two offers but now I am shifting gears to look for a part-time offer considering the financial setbacks I have had. I am going to need two jobs!",
          "score": 2
        },
        {
          "body": "Always keep your interviews until you have the signed offer. It would make more sense to then focus your energy on your new role. I’d say no need to continue interviewing after because this can be distracting. However if you have some doubts about your new role it may not hurt to take this last interview. I wouldn’t recommend dragging this on though once you’ve actually started the new job. \n\nGood luck :)",
          "score": 2
        }
      ]
    },
    {
      "title": "Need Advice: EY-Parthenon Super Day (Group Case) in 4 Days – New to Casing",
      "body": "Hey everyone,\n\nI just got invited to a super day with EY-Parthenon for a strategy consulting role, and I could use some advice. I’m extremely new to casing and I’ve only recently started practicing, and this super day will include a group case interview.\n\nI have about **4 days to prepare**, so I want to make the most of my time and was wondering how I should I focus my prep to be ready for a group case?\n\nAny advice, recommended resources, or even examples of what interviewers are really looking for in group cases and individual case would be hugely appreciated.\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1nn9cg6/need_advice_eyparthenon_super_day_group_case_in_4/",
      "comments": [
        {
          "body": "Congrats on the super day invite! For group cases, focus on clear communication, active listening, and collaborative problem-solving—interviewers look for these. Practice structuring your thoughts (use frameworks like Porter's or SWOT) and verbalizing your reasoning as this will help both individually and in a group. Grab some practice materials from Victor Cheng or Case in Point if you haven't already. And remember, your ability to work well in a team is key, so show leadership without dominating. Good luck!",
          "score": 1
        },
        {
          "body": "Tbh in 4 days, just practice group skills over fancy frameworks: be the person who sets a goal, proposes a simple structure, keeps time, invites quiet voices, and synthesizes every 8–10 minutes into “what this means.” Do mocks with friends as well, even use AI to simulate a potential conversation (it's surprisingly good): [voice.neuraprep.com](https://voice.neuraprep.com) , there are other paid services like this but for only 4 days, just use the free version.",
          "score": 1
        },
        {
          "body": "How did it go?! I have an individual case interview for strategy at EY-P London in 2 days so looking for some input",
          "score": 1
        }
      ]
    },
    {
      "title": "EY FSO - Data and AI",
      "body": "Hi everyone,\n\nI recently interviewed with EY for an **Analyst** role in the FSO (Financial Services Organization) service line on **July 11**, and I felt the conversation went well and the interviewer seemed genuinely engaged and positive.\n\nIt's now been 4 business days, and I haven’t received any updates from the recruiter. I know it’s still early, but the wait is making me anxious, and I keep refreshing my inbox more than I’d like to admit.\n\nI wanted to ask those who’ve interviewed with **EY**. How long did it take for you to hear back post-interview?\n\nAlso, based on your experience, is it normal not to hear anything for a few days, or should I start mentally preparing for a rejection?\n\nI’d really appreciate any genuine and straightforward opinions. Thanks in advance for your time and insights!\n\n**#EY #Big4 #FSO #DataAndAI #Careers**",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1m2mabc/ey_fso_data_and_ai/",
      "comments": []
    },
    {
      "title": "i have an interview and i’m nervous",
      "body": "i have an interview tomorrow at taco bell, this is my second interview and i struggle with face to face communication. ",
      "subreddit": "interviews",
      "score": 10,
      "url": "https://reddit.com/r/interviews/comments/1j939aw/i_have_an_interview_and_im_nervous/",
      "comments": [
        {
          "body": "If this is your second interview, congratulations, they already like you! \n\nWhat exactly do you struggle with?\n\n* Eye contact?\n* Stuttering?\n* Rambling?\n* Sweating?\n* Awkwardness?",
          "score": 2
        },
        {
          "body": "Practice with a friend, family member, anyone.  \nIf you cant find anyone, keep practicing with yourself in front of computer with anything like chatgpt.   \nEven better if you record yourself, then look back at it, see which parts you tense up or fumble.  \nTheres no other way around practicing",
          "score": 1
        }
      ]
    },
    {
      "title": "Got this email from my recruiter at EY, is it good thing?",
      "body": "For context I interviewed on 10/11 for an entry level staff role at EY for once I graduate. I was recommended to this role by my recruiter through campus recruiting. On 11/7 I got this email from my recruiter, is it a good thing?\n\n\n“Hello!\nI am writing to provide you with an update regarding your application with EY GPS and want to assure you that your candidacy is under active consideration, and we are diligently working through the final review process.\n \nOur GPS leaders are closely involved in the decision-making process, and we are committed to a thorough and fair evaluation of each application, which includes holistically reviewing all candidates that have interviewed for a role to gain a comprehensive understanding of each candidate's qualifications and potential.\n \nWe recognize that the waiting period can be a time of anticipation, and we appreciate your patience during this time. Please be aware that we have a strong and competitive pool of candidates, which speaks to the high caliber of professionals attracted to opportunities at EY. This also means that we are taking the necessary time to make informed decisions. We expect to finalize our decisions soon and will communicate with you at the earliest opportunity. In the meantime, if you have any questions or require further information, please do not hesitate in reaching out.”",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1gsd88b/got_this_email_from_my_recruiter_at_ey_is_it_good/",
      "comments": [
        {
          "body": "Prob means the decision and review process is taking longer than usual. I would give it 2 weeks before you follow up again. Could also mean you’re on the waitlist.",
          "score": 3
        },
        {
          "body": "waitlisted",
          "score": 2
        }
      ]
    }
  ]
}