{
  "company": "figma",
  "post_count": 30,
  "exported_at": "2026-01-18T17:44:53.278Z",
  "posts": [
    {
      "title": "5 months unemployed and counting...",
      "body": "I'm a frontend dev with about 4-5 YoE with an art degree (effectively a bootcamp code monkey grad...) I've been interviewing about 1-2 times a week since being laid off toward the end of November from my last contract role and so far have been rejected from every single company after going thru the technical rounds (either verbal, project based, or assessment). These have all been either contracting positions or small start ups for front end or full stack roles (primarily front end) that have reached out directly to me which is beginning to concern me considering these types of positions are generally much easier to land due to the shorter, less intense interview circuit. I don't even get considered for an introductory interview for any full time positions that I apply to on Linkedin and Indeed and have pretty much given up sending applications to full time positions all together (maybe most of those job postings were fake? No way for me to know... [https://www.wsj.com/articles/that-plum-job-listing-may-just-be-a-ghost-3aafc794](https://www.wsj.com/articles/that-plum-job-listing-may-just-be-a-ghost-3aafc794))   \n\n\nI'm beginning to think this career just ain't cut out for me and I should start considering another career path. I'm clearly not a 10X developer and after 4-5 years of working its clear that I can more or less learn at an ok pace, recognize coding patterns, read documentation, apply and slap things together, but beyond that developing my own patterns is definitely hard and trying to architect at the enterprise scale is also quite challenging. The amount of skills that is demanded for frontend dev just feels astronomical and seems to grow and change faster than I can reasonably keep up with and not only keep up with but be absolutely proficient/masterful which is what's demanded at the 4-5 year mark.  \n   \nI'm taking expected proficiency with all of the below + more:  \n\\- front end libraries such as React, Vue, Angular, and knowledge of others (svelte, solid, inferno, jquery, etc...)  \n\\- how to architect/design reusable components  \n\\- State mangement solutions like Redux, Signals, others,  \n\\- complex compiling/bundling solutions (vite (thank god for that) 🔥, webpack, rollup, WASM, etc)  \n\\- experience with SQL, NoSQL, APIs, REST, web sockets  \n\\- at least some backend language experience (node, python, java, go)  \n\\- Understanding how to implement Auth, how/when to use cookies   \n\\- Accessibility,  \n\\- software knowledge: slack/sonar qube/git/aws/storybook/figma/sketch/docker/bash/+whatever other SaaS ur company bought into  \n\\- CMS/wordpress knowledge,  \n\\- testing (unit testing, e2e, etc + ability to work with frameworks like jest, playwrite, RTL, cypress  \n\\- all general software engineering fundamentals (big O) for understanding performance / architecture  \n\\- regex  \n\\- security (XSS, CORS, etc)  \n\\- CSS / ability to create reusable themes that consider all device sizes  \n\\- optimization (bundle sizing, resources, image size, etc)  \n\\- debuging solutions / complete understanding of dev tools  \n\\-  nginx/apache/dns  \n\\- serverless/cloud solutions  \n\\- deployment, CI/CD, jenkins  \n\\- SCRUM/AGILE/JIRA methodologies  \n\\- ability to communicate/coordinate with all clients/stakeholders  \n\\- technical documentation/writing skills  \n\\- mentor/teach/peer program  \n\\- Routing, browser history  \n\n\nNot only do you need to have the ability to generally work with all of these plus the millions of other things I failed to mention, but also be able to communicate deeply, knowledgably, detailed about ALL of them as if you are some sort of oracle. The crazy thing is this list probably seems incredibly basic and probably even boring to all the giga brain comp sci chads who have probably mastered all of these trivial skills by the age of 12 and i'm sure there are many that chuckle at this meager list.  \n\n\nI seem to have hit a ceiling...  having seen staff engineers work, I'm honestly astonished at the level of raw giga brain genius IQ power they wield, especially the full stack ones that somehow have managed to cram all the collective front end + backend + comp sci knowledge in their brain at such a mind boggling rapid and intelligent pace and then simply and effortlessly magically conjure solutions and tools at their fingertips as if their wetware brain computers were perfectly optimized for it all. Not only are they 10X devs but now with AGI on the horizon they essentially could become 100x or 1000x  devs without any need for the lowly code monkey. hats off to all 🎩.   \n\n\nHaving had time to think about my own potential career trajectory, its becoming less obvious that i'll be able to climb the ranks in the field. This industry is definitely highly selective. I know people complain about IQ and G factor - but there are clearly inherit differences in people's wetware capabilities... I don't think it should be normal for one to fail 20+ interviews before landing a job in an industry. It definitely feels like I'm playing this game on hard mode more often than not.  \n\n\nFinally, I guess I'll end of on a question: are there others out there who have managed to or considering career change due to the obscene barrier to entry/learning curve faced in this field? Am I potentially suffering from imposter syndrome or am I suffering from sunk cost fallacy and should drop the thousands of hours I've already invested in this industry to pursue an easier/less challenging career? Do I keep chugging along, taking courses, working on side projects, hackerrank/leet code, etc and hope to land that elusive job?  5 months unemployed 😥",
      "subreddit": "cscareerquestions",
      "score": 263,
      "url": "https://reddit.com/r/cscareerquestions/comments/12mljq6/5_months_unemployed_and_counting/",
      "comments": [
        {
          "body": "I think the stress of the situation is causing you to overthink and intensify your imposter syndrome. I can def tell you right now nobody’s going around mastering every single thing you listed all together. That’s not really realistic and not fair to put that expectation on yourself. There’s experts yes but that’s usually a small scope and most just learn what they need for the job. \n\nI’d recommend going by this philosophy “Jack of all trades, master of none\". Job market is tough enough right now stop glorifying others and tearing yourself down in the process, selling yourself is probably the strongest skill you could build right now for someone in your position and it’s not going to happen if your being consumed by self criticism. Keep applying.",
          "score": 285
        },
        {
          "body": "Apply to a focused set of positions.\n\nOtherwise you end up like this...\n\n.NET interview.. damn I wish this interview was 5 years ago(I primarily use Go and Node these days)!\n\nReact interview... Crap I've been doing mostly Angular, vanilla JS, data engineering, and sys-admin type work recently!\n\nIt's a weird dichotomy, most people say they don't care about stack, but when they go to hire, they say \"we want somebody who can hit the ground running...\" which I find kinda odd b/c it's like ok, give me a week to brush up on it and then I'll start. \n\nThe patterns are pretty much always the same, the only thing that I'd consider \"new\" is the reactive declarative approach of tools like rxjs (which is literally just the observer pattern.)\n\n-----\n\nSo I kinda agree with you, but I would just recommend that you focus on something, and also get involved in the communities that you focus on. I'm not sure if Angular is your thing, but if it is, feel free to DM me if you are headed to ng-Conf and want to meetup.\n\nGood luck!",
          "score": 40
        },
        {
          "body": "I feel the same way. Have 1 year of DevOps experience at a faang, and can berky get interviews. I hate my situation so much. I wish I went to a different career field.",
          "score": 27
        },
        {
          "body": "Yea, my job is in infra. I’m quickly becoming the go to DNS guy, and I’m expected to just understand things by reading code and begging people for time all over our SaaS.\n\nHere’s how I see where we are at:\n\nIf you’re in it for the money, start looking at other options. Your technical, you solve problems, people will hire you and eventually you’ll lead.\n\nIf you are in it for the love of the game, just keep playing ball and learning more. I have a copy of Jim Gray “Transaction” book at my bedside, fuck no is anyone going to hire me to build a database engine, but I love knowing how it works and building my little toy DB. The day I get laid off, I’d be glad Id finally have time to implement a real transaction system.\n\nI’ve had less experience than you (under a year) when I decided I’d be in CS after dropping out of a PhD in bioinformatics, and it took me over a year after my first job was a disaster. Ive felt your suffering, and it’s pain like no other. Eventually, I took a part time job to make ends meet, got on a start up job that has brought me where I am. Just remember: all that’s out of your control anyway.\n\nWhat helped me, looking back: have a plan, like apply to so many places per week, pick a side project (write a “how to build a” compiler blog series then present at a meetup), get connected locally, and take one online class at a time. Positive Mental Attitude. It’s hard when things look so bleak, but you have the tools right in front of you to get something out of every day.\n\nGood luck",
          "score": 64
        },
        {
          "body": "Market hasn’t been this tough for 13-14 years. I’m pretty talented and have 7 years exp and it took me 5 months. \n \nYou’re up against more senior engineers, also fang grade, than ever in human history.\n\nWhat helped me was just the numbers game, improving how I interviewed, therapy, going outside, and spending each day out of work like I was a student again. Worked on a side project, read a Python book, and created a study guide as I learned. \n\nhttps://github.com/ErikThorsson/full-stack-study-guide",
          "score": 95
        },
        {
          "body": "I believe that all the points you mentioned, a SWE should know what it is and should have implemented something along those lines before. But I highly doubt anyone truly knows very deeply in all the points mentioned. With that said, being a SWE is mostly about solving issues for business needs. Since you have 4-5 YOE, I'm sure you have skills, but times are tough right now. Just be patient and take it 1 interview at a time. I'm sure you'll get something.",
          "score": 15
        },
        {
          "body": "i hate that software engineering is so different in terms of a career compared to others. you have to prove your worth every time you jump ship, which is realistically not feasible for so many people",
          "score": 53
        }
      ]
    },
    {
      "title": "Architect turned software engineer, feel stuck",
      "body": "I’ve been working for 10 years as a software engineer and I feel stuck. \n\nI have a degree in architecture (but never worked as an architect) and I did 3d art professionally for almost 15 years prior to making the switch.\n\nI was basically aiming to become a technical artist by adding some coding skills, but overshot it, first becoming a “creative technologist” and then landing a software engineering role. \nSince then, I worked exclusively for startups, most of which folded. By the time I realized I should have been applying for big companies, the layoffs started happening. \n\nMost of my roles revolved around WebGL which feels like a really weird niche. I don’t really consider myself a graphics engineer, but I do work a lot with shaders, GPGPU stuff, can read some whitepapers and such. I have some vague understanding of how GPUs work, but not enough to understand cache coherence, never worked with geometry shaders etc. WebGL felt like a path of least resistance - there’s no need to understand compute shaders when they don’t exist. Also, what these “cloud viewers” need, usually isn’t that advanced, one can get a lot of mileage by just knowing how to write shaders and understanding what draw calls are. \n\nSo instead of growing in that direction and trying to become a bonafide graphics engineer, I thought that it would be easier and better to become a front end engineer that has some graphics chops.\n\nI’m not entirely sure if I succeed at this. I’ve had a job where I was mentoring people on react and typescript in addition to doing graphics, was making architecture decisions and such. I’ve had one where I made a Final Cut Pro clone with react. But ive also had some where I’d get laid off once the graphics need was gone, and there were other dedicated FE engineers. \n\nI think because 3D meshes may feel alien to a backend/full stack engineer, i ended up doing some computational geometry as well. But again like WebGL, what I did felt amateurish - it did the job, but was typescript, not c++ or rust. Sometimes it would run in the browser, sometimes in node, but far from using something like open cascade. As in, I wasn’t able to combine mature systems in a serious language. But I was able to implement my own half edges, quadtree and such, surgically, to solve a problem. \n\nI’d grind leetcode and do well in interviews, which is how I landed my best jobs, but this seems like it’s over now. I did poorly at an AI interview earlier this year. \n\nObviously this is all IC type of stuff, which I do like, but I’ve been exposed to different management styles. Some times it was a free for all, no code reviews, anyone can nuke the master branch, no standup, no retro, just me and my CEO sitting side by side, while our CTO is missing in action. Other times it was really anal agile for the sake of being agile. My favorite situation was when a place that lacked structure got a very good technical program manager. She introduced processes gradually, each time outlining what we were struggling with and then offering a solution. This got me interested in management in general, but I wasn’t able to really pick up much. I worked with some engineers who transitioned to managers, and they were just way more on top of these things. Worked with some that remained ICs but were still super organized. \n\n\n\nI am lucky to be employed atm and I actually really like my job. If all goes well I may just get unstuck on my own. But having been through the grinder, and since this is another startup, I may be back to where I started. \n\n\nSo, what can I do to be employable in the next ten years, even better, to thrive?\n\n\nIf I were to leverage my architectural background, how could I do that? By far the two shittiest jobs that I had were in two construction tech startups. I’m still not sure what happened there, I thought I’d bring some domain knowledge to the table, in addition to useful coding skills, it didn’t happen. \n\nIs there anything that the 3d art is good for? I feel like the ship for this has sailed 10 years ago. I had a massive imposter syndrome after my first creative technologist job. I did not reach out to my bosses friend who worked at META, and instead bent over backwards to land a job as a FE engineer. I recently saw a talk by this lady who was a UX designer there, where she says how she has no idea how she got hired there in the first place as a graphics designer. 10 years ago I met a person at a hackathon in SF, same profile - a 3d artist looking to break into tech. I don’t think they ever became a software engineer, but maybe even better - a VR evangelist for Mozilla.\n\nHow could I utilize this if at all? Go “by the way, I have an eye for color and composition”? “I can speak the same language as both your 3d artists and your engineers”? Who am I even trying to convince here, a 20yo CEO probably doesn’t care about some 3d renderings from 20 years ago no matter how good they were for the time?\n\nMaybe just pick up figma and say “look I do UX/UI too”?\n\n\nIf I were to put all my money on the IC path, what should I focus on? More graphics? More web (full stack)? Try to become an expert on rust?\n\n\nWhat about going back to school, what field would even make sense?\n\n\nSorry about the stream of consciousness.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
      "subreddit": "cscareerquestions",
      "score": 15,
      "url": "https://reddit.com/r/cscareerquestions/comments/1nmllw2/architect_turned_software_engineer_feel_stuck/",
      "comments": [
        {
          "body": "You can market yourself as a \"creative developer\".  Focus on frontend, make a nice portfolio with 3d graphics / animations and say you're expert in React.",
          "score": 13
        },
        {
          "body": "I think the main issue is you are asking others for what you want to do. That needs to come from within, there is no point doing what someone else tells you to do, if you want to feel fulfilled.",
          "score": 5
        },
        {
          "body": "Haha, I am in the same boat, but a structural engineer.",
          "score": 2
        },
        {
          "body": "Its insane people were able to get software engineer jobs without degrees in the past and now new graduate soft eng. cant find jobs.",
          "score": 2
        },
        {
          "body": "Just learn React.",
          "score": 2
        },
        {
          "body": "Get a job as an architect? Like a simple one for like a few years while this CS slump rides out. By the time it’s done you’d become into a domain expert and you’d have a unique pain point for architects. Right now there’s AI so you can just be your own customer. I know I am making it sound simple it’s nothing but that’s why no one else is gonna do it. So you should do it.",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Similar background. I’ve been a creative technologist that has worked in film, automotive, animation , advertising, start up, FAANG, museum exhibition and immersive installations.\n\nI feel like now is a better time than ever to apply your skills to new technology. XR/AR, virtual production, generative ai, experimental marketing, automotive all require someone with those skills.\n\nThe issue isn’t whether or not your skills are still applicable it’s more of a leap into hands off management. That’s a whole different skill set than creative problem solving through technology.",
          "score": 1
        }
      ]
    },
    {
      "title": "How do I move forward after landing my first full-stack role?",
      "body": "Trying to be super short:\n\nI’m 33 from Argentina, been on computers since the early 2000s. First OS I installed was Windows 98 SE. Some Linux experience too I still have those old Ubuntu CDs. Always been the kind of person who explored everything without becoming a deep expert in one thing.\n\nThis February a friend introduced me to AI tools. Started with Gemini + Cline, then Roo Code, Kilo Code, later Trae, Copilot, Claude Code, and even Gemini/Qwen CLI, MCP, local LLMs, etc.\n\nBy posting my progress online and constantly asking for help, I somehow landed my first full-stack job as a contractor. I started off pretty rough, doing small styling tasks and pushing everything to main.  \nNow I’m handling daily meetings, Friday demos, full feature flows, unit tests, and Figma migrations. Stack: React Native, MongoDB, Fastify, Prisma. My PRs used to be terrible; now they barely need corrections.\n\nAll the social features of the app are my own ideas and implementation, and they work well with testing + security.\n\nOutside work, I keep building my own projects because I genuinely enjoy it. Tried Kotlin, Flutter, React, Tailwind. Made things like an APM counter for Age of Empires, a music player with online multi-radio, and a budget generator for my dad’s auto body shop (web version + markdown reader for desktop and mobile). Honestly, I’ve built a lot of small tools I don’t even remember anymore.\n\nMy issue: I have no idea how long my current contract will last. I want new challenges and obviously need to survive financially. LinkedIn and Reddit are full of bots; I barely get interviews. Everything I build for work is private, so I don’t know how to showcase progress or get noticed.\n\n**TL;DR: I landed my first full-stack role. What’s the smartest next step to grow my career and find new opportunities?**\n\nI’m strong on UX/product sense after using so many tools over the years, but I’m weak on marketing myself, networking, and turning bigger ideas into actual products. For now I depend on a team and senior reviews.\n\nThanks for reading.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ozja08/how_do_i_move_forward_after_landing_my_first/",
      "comments": [
        {
          "body": "Now that you've done this, you need to update your LinkedIn and Resume to show that you have professional experience. And describe the projects you've worked/are working on on your LinkedIn and Resume",
          "score": 1
        }
      ]
    },
    {
      "title": "Can't Figure Out Where to Go Next Career Wise",
      "body": "Hello,\n\nA Little Background About Me:\n\nI'm a software developer from Iraq, after getting my BSc in CS, I started looking for local jobs, but failed to find any developer jobs in my current city. I applied to openings in other cities, but the the number of openings were so little compared to the number of applicants so the competition was crazy, I couldn't get a job for about a year.\n\nAfterwards, I found a role as a teacher, so, I started teaching programming fundamentals and web development, I kept this job for 2 years, during which I tried applying to as much software development jobs as possible on LinkedIn and everywhere else, mainly looking for fully remote roles in the US or elsewhere.\n\nThen, I found a role at a startup as a paid intern, gotten through the interview and started work as a contractor.\n\nMy initial contract was for 6 months, after that was over I signed a different contract for another 6 months, this time as a Jr. Software Developer. After this contract ended, they renewed it again as a Jr. Software Developer, but this time for 4 months, because the startup was failing. So, in total I worked as fully remote contractor for 1 year and 4 months.\n\nThen, I was jobless, I started looking for jobs again for about 6 months, then out of nowhere, the same employer from before got in touch with me and recommended me to a different startup looking for contractors. I happily accepted the offer and started work, the problem is, I wasn't even assigned a title in this new startup, I was a software developer, but I didn't know whether Jr, Mid? However, based on my own evaluation I still considered myself Jr.\n\nI was the only developer on the frontend team for this new startup, I was responsible of taking a full Figma design from scratch and implement it with React, I have to be honest I had to use a component library to get the job done, because the deadline was very close and everything was fast paced, there was no room for code refactoring, code quality, TBF I didn't even write tests! But, I ended up delivering in time, and after a couple of rounds of bug fixing, the client was happy.\n\nHowever, after about 8 months, I lost this job because the startup failed to secure funding again.\n\nNow, I feel a bit lost on where to move on from here. Getting a job for a US-based employer is very difficult, especially once they learn that I am based in Iraq.\n\nI have a couple of questions:\n\n1. Am I a dead cause? Is there still hope? I mean I am still a Jr.\n\n2. How should I structure my resume? I have no past projects other than the work I've put for my past 2 employers?",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ls4bud/cant_figure_out_where_to_go_next_career_wise/",
      "comments": [
        {
          "body": "Of course theres still hope, why do you frame yourself as a junior? You have almost 3 YOE and you had full ownership over development in your last job, thats not a junior position by any means. Regarding projects, its not a big deal once you have experience, its mostly a way to fill you resume when you dont have experience.\nJust create a resume that shows all of your experience, avoid framing yourself as a junior, and dont put down your location in there if you feel like its holding you back. i don’t mean lie about your location, but theres no need to bring it up yourself.",
          "score": 4
        },
        {
          "body": "You’re a contractor. That means you’re the business selling services to another business, you can call yourself whatever you want. It’s your business, your title.\n\nYou’re looking for US based companies to hire your services. They’re not going to hire you as a W2 if you’re from iraq, there’s a zero percent chance any startup is going to setup business operations in iraq. They’re just going to hire you as a contractor. Lean into that. Structure your resume listing your success as a contractor, looks contract roles etc.",
          "score": 4
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "//  Getting a job for a US-based employer is very difficult, especially once they learn that I am based in Iraq. //   \nwhy is that?",
          "score": -5
        }
      ]
    },
    {
      "title": "I get what I need to do so I can make it in the current environment, I understand the effort required. I was just not prepared for this and wish I knew this massive dip in demand for junior devs was coming.",
      "body": "I don't know what got everyone into programming or I guess in my case Web Development, but for me specifically it was a lot if different things. A big one being the skill of programming itself and the things that comes with this asset of a skill. Another huge factor was financial stability + work life balance, which was offered because crucially Web Dev is perceived as boring. Therefore less competitive.\n\nI mention Web Dev being looked as 'boring'/less competitive because I have limited options and had to be very thoughtful with my career choice. As I thankfully learned early on that 'boring' jobs pay more and enough programmers simply think web dev is unappealing.\n\nWas Web Dev not the optimal choice? Maybe, but Web Dev was the sensible choice to gain crucial skills and have a good work life balance. Not to mention that as long as I could show I was legit, they would hire juniors. I spoke with so many devs and hiring managers, so to me junior Web Dev felt safe from gate keeping, is one way to put it.\n\nObviously that is no longer the case and I can't express how left field that was for me. I felt safe knowing that if I put in the time + research then I would be good. So I did just that, ended up with PERN being my stack because Postgres/SQL is very in demand and so is full stack knowledge. I then make an original project that is custom design with Figma (and not shit), full stack, no tutorials, solves a need, not simple and over all a good junior project. Which I then host on AWS, because I really wanted to show that even though I am applying for a Junior Frontend position, that I have done Full Stack.\n\n* Now was the project perfect? No.\n* Is there more that can be done? Yes\n*  Can anything ever really be finished? No.\n* Was there small issues that needed to be addressed? Yes\n\nBut damn I was for once happy with myself, that despite everything going on I still did something I fucking felt proud of. And of course, like fate.... The junior market hiring phase became nothing like before, right as I am ready to apply.\n\n* Now could I have applied faster, harder and just simply better? Probably\n* Did I plan on companies not hiring people and especially juniors by who knows how much? Nope\n* Did I plan on having to mid max my resume to have invisible text? Where because of interviewers using AI to automate vetting resumes and I can trick the fucking AI into reading a prompt that I provide? God fucking no! I was not prepared to do that, just so MAYBE I can be noticed? Like holy shit.\n\nSo I was like got it! I know things turned bad, but you know for the future! But unbeknownst to me there is an ultimate game. A game where if you don't know exists is going to make it that much harder to be hired. That game of course being corporate.\n\nSo because of reasons, companies evaluate applicants heavily based on their Data Structure &amp; Algorithm (DSA) skills. They value these skills so much in fact! That even if your projects/experience are weak or honestly straight up bad. It doesn't fucking matter, because companies are willing to pay you to learn how to do the job. Even though the whole fucking reason to hire is to get someone who can do the job? Interesting.\n\nSo I guess I didn't know the secret sauce that makes your chances better, my bad. I guess I should have figured that companies don't want you to learn practical, day to day job skills. Instead they wanted me to learn skills that don't relate with day to day work?!?!?\n\nI get this is venting at this point, but I would try to share this and it's always the same thing, \"get a degree\". I am just trying to be real, like I said at the start.... I have limited options. Another core reason I choose web dev as a career was because I am poor and had 0 family in America (my parents are immigrants). So having free networks through family and affording college wasn't really an option for. I simply can't afford the money or the time at this point.\n\nTL;DR: I guess what I am trying to say is there are a lot of requirements, knowledge and skills that I believed I met for a Frontend junior developer at the time of applying. Could I have done things better if I had known everything I do now, sure. But I tried the best I could at the time and I am proud of what I did, because I met my goals. Goals that I thought and was told by hiring managers, developers and so on. I basically interviewed a bunch of people and did research on top when deciding on my goals. And from what it seemed I met the goals, which was then validated by me speaking with the same people I spoke with before and saw my at the time resume. I really thought I was doing things right, but there were things I simply wasn't prepared for.\n\nNow it's been around 5 months since I last really coded/worked on project and I just learned I fell for the good old trap of: \"now I am ready to work, but doesn't put time into studying/working on projects because I am applying\". I guess I thought I could get a job fast enough?\n\nEither case I guess I posted this because I feel overwhelmed and I know I can get back to where I was/where I need to be. I feel uneasy about everything, it seems like everyone is saying you can push through and it's not as bad as it seems. I was hoping I wasn't alone and that there are other who feel similar? Maybe even people who were in similar situations as mine and made it through?",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/1azz1mz/i_get_what_i_need_to_do_so_i_can_make_it_in_the/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 18
        },
        {
          "body": "Disclaimer: I don't make hiring decisions. That is probably better for everybody.\n\n&gt; Instead they wanted me to learn skills that don't relate with day to day work?!?!?\n\nDSA skills are relevant, and I will die on that hill.\n\nMore importantly, anyone who whines about them being useless shouldn't be hired as a developer. Too risky.\n\nNever mind that you're displaying that you neither know, nor care about, the fundamentals of your job - the lack of knowledge here makes it difficult, if not impossible, for you to even recognize the situations where you're out of your depths.\n\nIt matters: How fast your web requests receive a response matters, and a really good way of reducing things like that are good fundamentals. By the time you notice that your website loads to slow, it is too late, and your code base will be riddled with small inefficiencies.\n\nAnd, no, \"using the correct algorithm\" somewhere is not \"premature optimization\". It's simply knowing how t do your job well. It doesn't cost you any extra time.\n\n&gt;. I feel uneasy about everything, it seems like everyone is saying you can push through and it's not as bad as it seems.\n\nI don't think holding hands and singing kumbaya is going to help you. Things are objectively more difficult than they used to. There are fewer jobs to go around, so - no - not everybody can push through.\n\nThat doesn't mean you should give up - but looking at this is only a numbers game is not going to do you any favors.",
          "score": 15
        },
        {
          "body": "Tl;dr?",
          "score": 5
        },
        {
          "body": "If you're really serious about tech career, get a CS degree.\n\nWhatever your circumstances, it's a requirement at this point.\n\n4 years is going to go by, whether you get a CS degree or not.\n\nDo you want to be complaining about tech job market 4 years from now?\n\nDo you want to have higher probabilities of tech career with CS degree?",
          "score": 2
        }
      ]
    },
    {
      "title": "7 days take home test. Is it absurd?",
      "body": "I am self taught dev for some time. Today is the day i was waiting for. I had an interview. It have gone quite good. They seems happy with me. I also seem to happy with them.\n\nUntil they drop the final take home test at the end of interview. They gives me 7 days or sooner. And after reading the brief. This one is no simple task. I applied as a junior frontend. But this involve a full working dummy clone of their database display with pagination. Using any framework. (they said it must include some drag and drop feature, to change the sorting of of how it will display) by their figma wireframe.\n\nand i find this quite bs… i feel like this is beyond me. Sure I can dig into it and finish it but to using my week long span. And now i’m currently argue with myself that should i do it or find other job. I was kinda desperate to have a job too.\n\nIs this bs ? Is it usually this heavy task for junior these day. This was my first interview. How was you guys opinion also.",
      "subreddit": "cscareerquestions",
      "score": 19,
      "url": "https://reddit.com/r/cscareerquestions/comments/z1vpjz/7_days_take_home_test_is_it_absurd/",
      "comments": [
        {
          "body": "Is this a single paginated list with drag and drop? It's hard to tell from your description what you actually mean. Generally \"Sort a list\" is pretty standard, and while it's a bit lazy to drag and drop a backend coding challenge to a frontend dev task it's not necessarily unreasonable, especially when they're giving you the choice to use whatever framework you're most comfortable with. \n\nI really don't have enough information to judge. Does the drag and drop have to persist? If so are they providing the API to save the persistence? What about the data access for the pagination, are they providing an API that already takes in the page and per page parameters?\n\nIf it's just \"Convert this figma to a webpage with pagination and use these three or four API endpoints\" that doesn't sound unreasonable for a junior level take home. \n\nIf you'll be managing the backend and frontend, including writing the data access layer and setting up the persistence of sort orders into a database, that would seem excessive.",
          "score": 27
        },
        {
          "body": "You have 7 days to complete a task. Do it. You're self taught so you have no proof of knowledge or work experience.  This is far better than leet code questions.",
          "score": 61
        },
        {
          "body": "I prefer take projects tests over live coding haha.",
          "score": 16
        },
        {
          "body": "Is this your first job?\n\nBeggars can't be choosers, especially in this economy as a junior. Better than some BS leetcode. If you do the task well, you can probably secure the job. What other choice do you have anyway, besides totally risking it and potentially not getting more interviews for a while?",
          "score": 18
        },
        {
          "body": "This is easier than Leetcode BS",
          "score": 8
        },
        {
          "body": "Okay at first I misunderstood it as a project that will take 7 days.  \n\nI would first check glassdoor and what the experience of other devs are (if they were ghosted). But I feel like this can be a great experience if you are self taught junior to prove yourself and get feedback (if they don't ghost you).   \n\n\nJust because you are a FE engineer.. I wouldn't assume that means no knowledge of DB whatsoever.  Not like they are asking you on DB normalization or indexing or query optimization..?   You said it's just a dummy clone data\n\nI don't think it's unfair for them to ask you. Drag and drop feature and pagination.. can probably be achieved quicker if you use a library.  Normally when they ask you about pagination.. you wanna be able to explain the pro or con of front loading (FE takes care of pagination) or lazy loading (BE takes care of pagination).  \n\nSince they did not ask you to setup DB (it seems), API endpoints or live server using docker..  I think it's still reasonable..  But you would have to make a choice. If you prefer doing LC or on-site design problems rather than take home.. then you can feel free to walkaway.",
          "score": 5
        },
        {
          "body": "Im a junior and can do it. But during the interview process I probably couldn’t of.\n\n7 days is a long time for this task and if I were hiring it would be a great measuring stick for a junior. It basically shows how much hand holding they would need for each candidate.",
          "score": 8
        },
        {
          "body": "That's standard, if you're self taught and looking to get your first job this is it.. use some cloud solution for back end, hit an API or two and display using library or two.. what more do you want.. I guarantee you those leet code questions are harder to do live or even on your own time",
          "score": 3
        }
      ]
    },
    {
      "title": "My Spouse got a job !!",
      "body": "I'm really excited and proud!! I just wanted to briefly share her story because I think it's pretty inspiring but also a bit of a warning because imo it was alot of effort, work and persistence.\n\nShe is coming from a nanny background with a bachelors in political science from a college in Thailand. So no computer science degree, just lots of hardwork and support from me \\^\\_\\^. I'll keep it short and just share the basic bullet points.\n\n* The timeline was a little less than 2 years of almost fulltime studying.\n* She used freecodecamp and  a bit of the oden project for guiding her studies\n* Freecode camp was useful because it resulted in her having a beautiful portfolio website featuring her resume and a few small apps - calculator and travel form to name 2.\n* The Odin project in the beginning is especially a good read because it goes over the expected journey of learning and teaches you how to do research.\n* She joined a Thai coding club that met a few times a week to do leetcode, and they took turns giving presentations on different JS topics for each other which forced her to research topics deeply.\n* I'm also a Sr. engineer and started a fullstack project which I had her help me on for the frontend. She was able to interact with my API's via Swagger and Postman, learn about staging environments, dealing with secrets.\n* I was able to guide her in some areas of study here and help on what to expect in real world apps like cicd deployments, testing, introducing to Heroku etc. We even used Jira and I created different tickets for her to work on.\n* I helped fine tune her resume since English isn't her first language and she was able to use mine as a template.\n* She also setup a Node.js app on Heroku using express to handle sending emails to users when they 'subscribed' to my news letter. She made the landing page and a subscription button where people could enter their email and hit her node service which would send the email via Sendgrid.\n* She treated her studies like a fulltime job, and I made sure she was setup with the tools for success (monitor, good mouse, laptop)\n* Her offer came in around 55k TC at a consulting company - fully remote gig. BTW consulting companies are great places to look for a first job imo. I also got my foot in the door at one as well having a major only in Business Information Systems after actually failing out of CS\n* She even did some Figma UI/UX for the frontend of our group app.\n\nFrankly it was a long journey and clearly alot of effort, even after this she wasn't getting too many interviews, yet finally was able to get an offer with a frontend dev position using a react based framework. Excited ! My only advice is to not give up, know that you don't need a degree and if you have a well rounded portfolio, can talk the talk and walk the walk, you'll get in eventually ! You can't be a good developer and not get a job, just have the portfolio and projects to prove it !",
      "subreddit": "cscareerquestions",
      "score": 268,
      "url": "https://reddit.com/r/cscareerquestions/comments/t6z7v2/my_spouse_got_a_job/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 24
        },
        {
          "body": "That's fantastic, congratulations! \n\nMy wife did similar and has been away her first job for 6mo\n I LOVE having both of us work as remote software engineers. It's amazing.  A I have someone to complain about managers to now! \n\nReally happy for you.  That's awesome.",
          "score": 34
        },
        {
          "body": "I don’t have gold, but if I did would give that rockin crab! 🦀 Congratulation’s! 🎊 🎉",
          "score": 16
        },
        {
          "body": "Congrats to her!!",
          "score": 4
        },
        {
          "body": "Congratulations to both of tou 👏🎉",
          "score": 5
        },
        {
          "body": "Wow. Props to the husband! Amazing job mentoring her and replicating real world scenarios.",
          "score": 4
        }
      ]
    },
    {
      "title": "Feel like I’m in way over my head at new job (not imposter syndrome)",
      "body": "Last week I landed my first job out of college as a full-stack web developer for a small business on a 3-month contract. Prior to this, I only had 8 months of work experience at internships doing front-end development. \n\nTo prove my technical skills, they had me build out a component in React based on a mock-up given to me on Figma. I did a good job on this and they basically hired me because of this - the interview was essentially non-existent. I found this a little odd and it had me wondering why they had me only demonstrate my front-end skills for a full-stack position.\n\nFast-forward to this week, after having the project explained to me, I feel like the work I’m being given is far beyond my skill level and I feel like I’m in way over my head. The application they are having me work on is very complex and I’m not confident that I’ll be able to contribute to it meaningfully if at all. Maybe if I had some mentorship but I haven’t had any yet and don’t expect to get any as this is a contract position.\n\nIt’s got me wondering why they hired me in the first place. Aren’t contractors hired on the expectation that they can complete the work? Why would they hire someone fresh out of college with little to no experience for this position? Should I be honest and tell them that I don’t think I will be able to do the work for them? Should I fake it and hope I make it? It doesn’t seem fair to them or myself if I’m just spinning my wheels. I think I might be better off in a full-time position as an employee where I can learn on the job and from my peers. \n\nWhat do you guys think? Any advice is appreciated.\n\nEdit: The job is remote and pays $35 an hour if it matters.\n\nEdit 2: How should I go about charging if it took me longer to do something than it should have? For example if it took me 6 hours to do a task that should only take 4 hours?",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/muplhp/feel_like_im_in_way_over_my_head_at_new_job_not/",
      "comments": [
        {
          "body": "&gt; Why would they hire someone fresh out of college with little to no experience for this position?\n\n&gt; The job is remote and pays $35 an hour if it matters\n\nI think I figured out why they hired a college kid for this...that's cheap as hell. They are trying to cut corners without just straight up hiring a dev from India or something.",
          "score": 20
        },
        {
          "body": "&gt;  Aren’t contractors hired on the expectation that they can complete the work?\n\nIdeally, yes, but often times the employer is unable to gauge whether you can do it or not\n\n&gt; Why would they hire someone fresh out of college with little to no experience for this position?\n\nIt sounds like they thought the component design was enough of a test\n\n&gt; Should I fake it and hope I make it?\n\nYes, there's no downside to trying and maybe failing.\n\nIf it's any consolation, I felt exactly the same in my first job. But, after a few weeks, I started doing better. If you've only been there a week, that's really not enough time to gauge how you'll do. And, spending 40 hours a week studying the same project is a lot of time, you'll learn a lot more quickly then you would expect\n\nAlso, try to reach out to the people assigning you work and explaining it to you and try to get help.\n\nIf no one helps you, and you don't make much progress and they end up firing you, it's okay. Not your fault, you got paid, you got a tiny bit of experience, just try again",
          "score": 12
        },
        {
          "body": "\\+1 for not being another idiot who simply labels their own insecurities as impostor syndrome.\n\n&gt;I feel like the work I’m being given is far beyond my skill level and I feel like I’m in way over my head.\n\nThis is how people grow...\n\n&gt;Should I fake it and hope I make it?\n\nProbably.  You haven't given us any important details, but what's so difficult that you can't even begin this stuff??",
          "score": 10
        },
        {
          "body": "dir.eng. chiming in\n\n&gt; Aren’t contractors hired on the expectation that they can complete the work? \n\nW2 employees are extremely expensive.  They're long-term investments in people.  They are hard to fire.  Easy to get a contractor position opened.  Really hard to get a full time employee opened.\n\n&gt; Why would they hire someone fresh out of college with little to no experience for this position? \n\nBecause they can only afford your salary and not a penny more.",
          "score": 5
        },
        {
          "body": "Looks like you're thrown into the deep end of the pool.\n\nThe expectation is sink or swim.  Which is typical for this type of contract work.\n\nIt's not you, but the contract company that placed you into this role.  They didn't have anyone else available at that rate, so they got someone that can pass the minimum tech screen.\n\nIt's really up to you how you wan to proceed.  Since this is 3 month contract, there's only so much that can be done.\n\nYou can spend lots of time ramping up on the stack and work hard to deliver features.  That is what the contract company is hoping, that somehow you'll overcome any hurdles and work to deliver.\n\nOr, if you don't, then they can assess quickly and end contract soon or just wait out 3 months, which is very short time for any type of contract.  \n\nIt's simply assessment contract, to see how you work out.  Think of it as extended paid interview. \n\nGood Luck.",
          "score": 5
        }
      ]
    },
    {
      "title": "Start-up taking advantage of me",
      "body": "Hi Everyone, I'm looking for advice on what to do about my current annoying situation as an intern. During the holiday season, I accepted an offer to work as an intern this summer at a very small start-up. It looked great. Their two full-stack developers seemed super helpful and I was super excited to work with them. I had very few skills back then and was over the moon that I had an internship offer at all.\n\nThe first red flag: I wasn't going to get paid. I was going to back out, but because of good money coming from another project, getting rejected elsewhere, and the opportunity to work with a real team(albeit small), I stayed. When I started I quickly found out that one of the developers had quit, and a few weeks after that, the other quit as well. This left me as the only \"full-stack\" developer there. *Nice.* There's a Mobile developer who is an amazing guy but knows surprisingly little about anything outside of Swift/IOS dev, and there are two developers who are entirely AI-focused.\n\nSo we were left with this code base and I was the only one who knew how to read it/update it/etc. The Mobile developer does all the code reviews, and he really tries to help, but since he doesn't know what is going on, it's really up to me to not make errors/fix them when I always do. At first, it was a lot of stress, but I also was getting exponentially better as a developer because of it. I rose to the challenge, and I enjoyed that for a bit. However, the joy has now worn off. *Sigh.*\n\nAs a result of my new position and responsibilities, they keep telling me they are working to get me paid. They have apparently applied to some grants for the money, and if that falls through, they say they will pay me *\"out of their own pockets\"* (sigh).  However, I honestly not sure if I believe them. I see the way that they talk about people in the past and the way they conduct their business, and they take advantage of everyone and everything their can. Interviewing people for free consults (no intention of hiring), making rude jokes about people right after they left a meeting, etc. I just have this rotten feeling that they are secretly getting me to work for free, and stringing me along with the idea of getting paid just until summer is up.\n\nThey are also not easy to work for, and in hindsight, I should've clued in when the others left. We'll have meetings and talk about what moves to make going forward, but it's all work I'm going to have to do. Super weird having the room talk about things they don't know how to do, and then turn to me, and be like \"go\". Then, their wanna-be UX/UI designer (it's not their official position) will constantly ask me to develop new features and then get disappointed when it's not exactly their \"vision\".\n\nFor example, and I'm going to be general with this example for identity reasons and such, but there was this flow they wanted this huge form on our front end to go through. It has a million dependencies of what shows up when, and how many things can be clicked, etc, etc. I built it, and it was one of the harder projects I have ever done. It works quite well, and I am very proud of my work. However, I organized it such that it acts like nodes in a graph with each child node watching its parents tell it when to show up. I'm sure this is getting vague, but the point was that this person, an adult, practically threw a fit that the dependencies didn't flow from parent to child. I tried to explain how I thought this solution was more elegant but I gave up eventually. They also got mad about inconsistent names across platforms when I was simply following their Figma and documents that THEY made. I was gonna make it consistent but I didn't want them to freak out about me using different labels, backfired eh.\n\nI asked them to bring on more people but we had interviews with them, and I saw some of their work, and so far I feel like working with any of them would be more of a headache than a help. I'm not a great developer but damn I saw some bad stuff. They don't seem to have money to pay for any good developers outside of their AI projects.\n\nSo, my questions to all you lovely people who decided to read all of this. What is my best next move? How do I bring up their current treatment of me? I would quit, but I'm getting good experience working on big projects. But I am teaching myself everything, not getting paid yet (despite constant promises), and getting treated by this one person like a bit of their developer bitch. I rather not stir up some bad blood because I feel like that would make my job harder too. I'm not a confrontation person either, but I feel like they know that too. I just have some tunnel vision about the whole thing, and I would love the opinions from technical people. Thank you.\n\n&amp;#x200B;\n\nEdit 1: Before anyone asks, during the interview process I forgot a bit about asking about payment. And I was just excited for my first internship offer. Plus, unpaid internships are incredibly rare where I am, and I'm fairly sure illegal. So I never really considered that I wouldn't get paid. I was informed about this about two/three months after accepting to join the team. Right as places stopped accepted applications and most places had their internships filled.\n\nEdit 2:\n\nTd;lr: I got myself into a shitty situation. I'm an unpaid intern working as the only full-stack dev at this tiny tiny start-up. I'm getting a lot of good experience working on big projects. But other than that, this position sucks, and I'm being treated poorly by one particular member. I'm also being told that I will get paid, but I'm sus if that is actually going to happen. Need help trying to find the next steps. Although, it's pretty clear that the next step is run. I just don't want to not have an internship for the last two months of summer. I have become such a better developer because of this, but Im sick of feeling like I am being taken advantage of.",
      "subreddit": "cscareerquestions",
      "score": 13,
      "url": "https://reddit.com/r/cscareerquestions/comments/o8oipp/startup_taking_advantage_of_me/",
      "comments": [
        {
          "body": "You are not getting paid.  You are not an employee. You are not getting taken advantage of, because YOU ARE NOT AN EMPLOYEE.\n\nYou have no rights as an employee, because YOU ARE NOT GETTING PAID, AND YOU ARE NOT AN EMPLOYEE.\n\nSimply gather your belongings, thank them for the coffee and walk out the office door.  There's no need for notice, because YOU ARE NOT GETTING PAID AND YOU ARE NOT AN EMPLOYEE.\n\nYou can't quit, because you don't work there.  You just leave.",
          "score": 45
        },
        {
          "body": "If you have not been paid, there is no need to do work for them.\nEmployment contract and compensation agreement is a two-way street. I don't think there is any way they can enforce any penalty and you can probably approach your university law professor for a discussion on this.",
          "score": 8
        },
        {
          "body": "I commend your ability to stay there. Serious respect. Do the exit strategy mentioned by /u/nnd-nnguyen and hopefully you get the best",
          "score": 5
        },
        {
          "body": "You have literally nothing to lose and you hold all the cards. If you want to work there, simply tell them the salary/benefits you want and if they don’t match it, leave.",
          "score": 5
        },
        {
          "body": "You’re not a slave. Either you need to get paid or go",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "I would make an exit strategy.  Start looking for another position and give 2 weeks when you find it. Don't accept a counter offer if they suddenly find the money to pay you.   There are too many red flags.  If they really cared about paying you they would unless every other developer is working for free. Even then that would be worse in other ways.  \n\nIf it were my company and I valued you I would pay you out of my pocket and reimburse myself when said grants arrived.  \n\nThe world is a big place and at least in the states almost all of the development internships I've dealt with have been paid.",
          "score": 7
        }
      ]
    },
    {
      "title": "As a counterweight to all the celebration posts I see here. I received fewer responses than I did last year, and the offers I got were all worse.",
      "body": "I ended up taking a job with a 10% pay decrease, despite having done one more year of my CS undergrad and having done one more internship. I applied to more places and got way fewer responses. And all the offers I received were worse. I got ghosted after submitting both of the take-homes I got, each of which took 10+ hours. I got to the last round of Amazon, and failed the in-person after being asked a question that would only be relevant to senior employees, and got a technical question that was super weird and essentially unrelated to anything leetcode or data structures.\n\nI spent a ton of time improving my resume, have a 3.5/4 GPA at a top university. \n\nWhat's even more infuriating is that there is a person I worked with last year basically ended up being a nuisance to the company, and went from what was supposed to be a software role to essentially just joining the design team to do figma mockups and basic CSS tweaks (way easier stuff then the rest of the interns were assigned) because they were dead weight. That person got hired at Microsoft as a Software Intern 😑",
      "subreddit": "cscareerquestions",
      "score": 27,
      "url": "https://reddit.com/r/cscareerquestions/comments/nkdy8t/as_a_counterweight_to_all_the_celebration_posts_i/",
      "comments": [
        {
          "body": "I can see you're disappointed, but I think this experience needs to be put in context. These were internship positions: you're not exactly reporting from the vanguard of the next dot com bust. 10% less for three months is going to have effectively zero impact on your lifetime earnings. I believe interns should be paid, but it is mainly about experience.",
          "score": 21
        },
        {
          "body": "So half a work week spend doing take homes?  Jesus Christ.",
          "score": 13
        },
        {
          "body": "[deleted]",
          "score": 8
        },
        {
          "body": "what were the questions you got in the Amazon interview that were weird/irrelevant?",
          "score": 6
        },
        {
          "body": "Congratulations!\n\nNo...wait...I don't know how to respond...",
          "score": 10
        },
        {
          "body": "The one thing I will say is that pay isn't at all important for an internship.  You're talking about a really small amount of money in the long term when it comes to a job you'll only have for a couple months.  \n\nThe goal is to learn as much as possible and get the best job you can after graduating.  Hopefully this internship can be a really valuable learning experience for you even with lower pay.",
          "score": 3
        }
      ]
    },
    {
      "title": "Not-so-relevant internship in a good company or relevant internship in a bad company?",
      "body": "Hi guys! I moved to a new country and as part of this move I need to do an unpaid internship for 4 months. I have a choice between 2 companies.\n\n1) Huge multimillion top cyber security organization. I have a very nice impression after the interview. 900 people in the local office, mentors, interested in my services. Those services being working with QA automation software (Python Robot framework). \n\n2) Small (12 people overall, just 4 in the local office, 8 remote in different countries) website agency. They have just 1 programmer (not sure about his skill level, but I suspect not great) and he is remote. They want to give me one of their commercial projects which is currently at the stage \"we have a figma prototype, you do everything from there (as in full stack web development)\".\n\nNow the caveat is that I've been working with HTML/CSS for a few years (as in basic blog markup, some minor fixes on company sites) and studied JavaScript for 4 months. So option #2 is way more relevant to my career that I wanted to start in this new country. Although I think I'm like 20% ready to tackle a project like that. Not having a proper mentor could be both a good and a bad thing. On one hand even with my 0 knowledge of React I think 4 months should be enough to learn it and do this site and learning in the thick of it is the best way to learn. But a mentor would not let me stew in my own mistakes so to speak. What if in 4 months they decide to audit the code and turns out I wrote complete crap?\n\nHowever the first company will be a way better opportunity to get new professional relationships in a new country, it's way more impressive for the CV but it's not webdev... So not knowing what future holds I will be both studying this QA testing job and slowly studying webdev at nights.\n\nWhat do you guys think? Even moving to a new country was an easier decision than this lol",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/zl5o1v/notsorelevant_internship_in_a_good_company_or/",
      "comments": [
        {
          "body": "If option 1 was a software developer internship but just not in web development, I would say choose that for the name on the CV. Programming skills are transferrable.\n\nBut it sounds like it doesn't involve real coding at all. In which case, when you eventually apply for full-time developer roles, \"software developer intern at no-name company\" is IMO more of an asset to your CV than \"QA tester at famous company\".\n\nAnd obviously, option 2 will benefit you a lot more in terms of actual learning.",
          "score": 1
        }
      ]
    },
    {
      "title": "The Curse of Leetcoding",
      "body": "If you’re someone who got into programming via building websites or anything that does not have you to ramp up Leetcode then this might not be relevant. I am writing my journey of how I got into programming and how wrong I was about the trade of writing software. I apologise for writing a long post like this but I feel my story has to be heard. So here we go.\n\nAfter getting into college my primary focus has been always to complete my undergrad and go grab an MBA degree and get into Investment Banking or Consulting or more of a traditional MBA career path. For this reason, I always saw Programming with a perspective of giving and take relationships. Hence in all of my first year, I wrote code which just helped me pass all of my computer science courses. Did I tell you that I was about to major in computer science? If no then I am telling you to know, My grades were on the average side of the line in my first year and I got a D grade in my programming course. I kinda felt bad getting a low grade and realised that I gotta get serious about programming because these types of grades don't make a good MBA profile.\n\nNow enter into my second year when all the core computer science curriculum kicks in. There was a famous professor in my college who taught us data structures and algorithms which are the holy grail of Software engineering interviews. This is where things get interesting. He was the kind of guy who would make you work till 2 a.m in the morning with great assignments and also induce some competition and collaborative culture in your classroom. And boy did he provide a great vibe by telling stories like how our seniors who did well in his course got into reputed companies (FAAMG). I was always that guy who needs someone to fire up his ass, So I got going in this course and secured the top grade he could give. Until now programming was a side gig for me that could help me secure decent grades. Now, this course changed the whole MBA equation.  I got serious into competitive programming and started hitting Codeforces and Leetcode for interview practice. I religiously followed the ritual of solving problems so that I could crack a good internship and put it in my resume which increased the odds of getting into a top b-school.\n\nRemember that all the while till this point there were many workshops and events which could give me exposure to the real world of writing useful software but I never cared because they counted little to my internship selection. So I went ahead with knocking down Leetcode problems as they need little googling (like you would never need stack overflow seriously) and you could solve them using predetermined methods. When I tried learning web development by doing some projects like pursuing some of my ideas, I gave up because I became too lazy to google the errors or even understand them.\n\nEnter the internship season. As it started I got into a company that yearned from my first year of college. So I was pretty happy and chilled for the rest of the time until the start of the summer. In the meanwhile, I passed all of my courses with decent grades and learned some important stuff like operating systems and computer networks. I was always curious about how things worked in general but I am sort of that guy who never really cared for anything that didn't matter for cracking the job. As you've read this far you can understand where I went wrong really. Yes, I only did things that got me the job and not do that job. This is where shit hits the fan for the first time.\n\nI started interning at this company and during my stint there I was asked to write some code in java which was a massive codebase. I kid you not I even could not figure out how to set environment variables for setting up JDK, Maven and IntelliJ. Now anyone in my position would try to google those things and learn them on the go and I did the same except I resented and despised doing that. I thought that this sort of work should be done by some lesser mortals whose time is not valuable and be used for doing this grunt work, not by some elite strategist like me who likes to whip my IDE and write some fancy algorithms which can make a huge impact on the business side.  I did the job but hated every bit of it. In all this mayhem that was going in my brain, they did give me a return offer. Yes, I hid every bit of resentment and wrote code, attended meetings, gave daily updates, collaborated with great peers. I had 1 year of free time until I join the same company as an employee. If you'd expect me to change my approach of writing software like building some real shit, nope I did not change even a little bit. It became even a lot worse when l learned that I can land up jobs if jacked Leetcode day and night. And why would through a painful path if presented with a straighter one?\n\nHence for the next year, I pretty much-Leetcoded every day just to stay interview ready. I did bother to write some code for building a front-end application but it was too much of a hassle. My elitist brain did not come to terms with the real world yet. It took only an error to just abandon my side project. I interviewed with a couple of companies but never took them seriously to join them. All this while for the last year I stalked Github/LinkedIn profiles of good programmers who built real shit. I wanted to become like them so that I can bring my ideas to life but the software interviewing process are all against them. Even worse I saw people making FAAMG just with DSA and some low-level system design shit.\n\nIt has been 2 months since I joined the same company where I interned. For the first part of the month, I really struggled because my frustration grew when I was not able to build the code successfully. The dependencies were deprecated and some of them were conflicting with each other and it was absolute mayhem when the codebase was handed over to me. It took me 1 month and 2 weeks to realize that to build and ship real shit you need to learn and figure everything on the go and not cramming up Leetcoding problems that test you on the preset conditions and environment. I even forgot how to take inputs because you would have just fill up these functions. Look I am not saying that Leetcode makes you dumber but if you do only Leetcode then that is shooting yourself in the foot.\n\nNow I am much better. I am learning rails to write some code related to my startup idea. I designing my mockups on Figma. I am not gonna Leetcode in the near future and I even put the site's address in my blocklist. And I have given up on my MBA dreams when I figured that Suits aren't for me and I really like how software organizations are run.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/pdffgw/the_curse_of_leetcoding/",
      "comments": [
        {
          "body": "For me, the biggest curse is on interviews with non-leetcode processes.\n\nYou know, all these weird 'custom problems' or 'debugging'. There's too much variations. It's not standardized. And even worse is if the company you are interviewing forces you to debug on a language you are not familiar with (basically, if your current work isn't Javascript, Java, Python, then you are at a huge disadvantage). Plus, not everyone debugs the same. I get used to codebase first then understand. I don't dive right in and rarely (if ever) do I use a debugger on a project I am very familiar with. That's just not how real world programming works. The project you are familiar with you kind of figure out the ins and outs and know directly 'where' to look. Everyone has a different approach to coding. Some use debuggers. Some don't. What should matter for the team is the output and quality of the codebase long term.\n\n&amp;#x200B;\n\nThe entire interviewing process is a mess in this field. Some companies ask System Design stressing scale. Other companies want you to data model. Other companies want you to write in SQL. Some others want you talk about lower level of stuffs like rate limiters despite not having to touch any of them at work.\n\nAs much as I hate Leetcode, I do think it is the most 'fair' process out of them all. Imagine randomly getting asked multithreading/concurrency questions on the fly in the job process. How can you study all that for a job when you have finite time (and you want to apply to more than 1 company).\n\nI have been asked in the past (outside system design): Basic statistics, Math puzzles, Concurrency, Machine Learning, Probability, OOD, Data modeling, Debugging, Trivia on different systems like Kafka, Meaning/Philosophy of one's life, etc. There's just too many fields and the candidate cannot prepare ahead of time as there's no consistency throughout the industry.\n\nLeetcode process at least solves that. Now, I do agree the extreme approach nowadays with more and more companies getting infatuated with LC Hards is something else. That I have issues with.\n\n&amp;#x200B;\n\nI wouldn't completely avoid Leetcode. And yes, real job programming != interview programming. But do understand, it's a necessary evil and many other 'alternative' interview styles are just as bad if not worse for many candidates.\n\nThe good part is, you only need to Leetcode a month or two before applying elsewhere. The bad part is, by the time you get proficient at Leetcode, most of your interviews are more oriented towards System Design and all. And that's a whole another headache in itself.",
          "score": 6
        }
      ]
    },
    {
      "title": "An humble rookie here (20M). I don't have the bucks for an expensive IT consultant, if anyone would open for a conversation to shed light on simple questions, I'd be truly grateful.",
      "body": "I just finished learning HTML, CSS, JS, and ReactJS. I've started applying for interviews now. I was simply hoping if anyone experienced and wiser than a fresher would be open to answer me some questions about Frontend devs. They're simply about what should my future steps be.\r  \n\r  \nWhat should I be learning next to advance towards good pay and job security in my future years. Figma? UI/UX? Should I dive into backend as well? Or specialize in some less-used languages like ruby or PHP? or go for a masters degree? I'm not asking for a full mentor, not at all. I simply hope someone better and more knowledgeable than me would be open to give me some time of their day to advise me.\r  \nThank you! :)\r",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/15vexqa/an_humble_rookie_here_20m_i_dont_have_the_bucks/",
      "comments": [
        {
          "body": "I have 25+ YOE as a SWE.  I’ve worked in FE about 8 years.  Before that, I did Java for 15 years (and, before that, C++ for 6 years?).  DM me and I’ll answer any questions that you have for free.\n\nIn general, job security is illusive.  Learning “hot skills” and networking can help but, at the end of the day, you are still vulnerable to the job market and the vagaries/fortunes of your specific employer.  (Financial security may be what you really want: you get a job when they are easy and high-paying and you have the means to be “on vacation” when jobs are hard and low-paying.)\n\nLots of people become jack-of-all-trades, master-of-none.  Generally, you really want to dominate, not just be mediocre, at something before you start building a new skill.\n\nEDIT: The DM offer is open to anybody who wants it.",
          "score": 14
        },
        {
          "body": "From what I've seen, backend topics are a good area of learning to invest in for career advancement if you're coming from frontend. Generally you want to understand the entire stack or be the go-to person for a major sub-area of it (e.g. frontend, backend, infra), ideally both.\n\nFigma is trivial enough to learn if needed. UX is largely just common sense. Most mainstream languages are similar enough that you can pick them up quickly.\n\nPast a certain point, traditional education will no longer help you. You'll need on the trenches experience to get better at architecture and team leading.",
          "score": 5
        },
        {
          "body": "Pure front-end development has been dropping precipitously in demand. Most jobs are now requiring FEDs to be either competent in the back-end development or competent in design. I would pursue whichever interests you the most, back-end development or UI/UX design. I do get the feeling that there are more entry level opportunities at the moment with the design path, though they are still likely to be ludicrously competitive.\n\nIf I were in your shoes, I would try to get really comfortable as a full-stack developer and wait for the market to recover before pouring a ton of time and energy into the job search. Learning NET/C# might be a good option. You'd still need your HTML,CSS,JS skills and theres a lot of stable NET jobs in industries that aren't as closely tied to the vagaries of the software market.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 0
        }
      ]
    },
    {
      "title": "Frustrated Junior Web Dev",
      "body": "Hi all! I was hired as a junior web developer early last year for a small creative agency. My role was to assist the senior dev with building wiki pages for one of our major clients (one of the FAANG / MANGA companies) primarily using HTML and CSS. I'm in my early 30s and have been transitioning into the tech/CS field (my previous roles were in project management and primarily with non-profits), so this seemed like a great first role, especially since I was promised mentorship from the senior dev and opportunities to grow and work on other projects.\n\nFour months into the role and the senior dev leaves, which left me as the only dev at the company, handling all the dev projects from ideation to implementation (i.e. - designing wireframes and prototypes in Figma/XD, hard coding all pages, pushing those changes to the live site, communicating with clients, etc.). \n\nAbout 6 months into my role, the company laid off a good number of folks. Fortunately (or maybe not) I wasn't laid off, but they reduced my hours, so I am no longer a full-time employee. This was supposed to be a temporary change, with the prospect of being full-time again once we brought in more clients. It's been 9 months since I've had my hours reduced, and we've brought in several new enterprise clients while maintaining our business with the FAANG / MANGA company, but I am still not back to my full-time status, despite having a full work load and still meeting our clients' expectations with reduced hours.\n\nDespite all of this, I've spent the last year upskilling myself: learning JavaScript, Python, Bootstrap, and React JS via Udemy. I also started to pursue a BS in Comp Sci via WGU (currently have a BS in Psychology) which led me to take classes in C++, Python and SQL. From these courses, I've learned that I really don't like web development (or at least not front-end development) and would like to pursue something else (maybe Machine Learning or AI). \n\nHowever, I've had to stop taking courses because I am running out of funds. I've applied for other junior web dev and front-end developer roles, but I haven't had any luck at the moment. Although I'm grateful to still have a job (and one that is in the field), I don't feel like I'm growing as I had hoped, and I'm starting to feel stuck and a bit scatterbrained on how I should approach my next opportunity. On one hand, I would like to earn my BS in Comp Sci, which I believe would help me get around the degree requirement on job applications. I've completed about 40% of the degree program, so it will take some time for me to get through the remaining requirements. Because of my reduced hours, I have time to focus on completing the courses, and a part of me thinks I should find a second source of income, regardless of what it is, to help pay for the courses, so I can complete the degree program sooner than later. On the other hand, money has started to get tight, so another part of me thinks I should focus on getting a new web development job. Although I'm pretty certain I don't want to continue doing web development work, I believe it will be easier to get a web development (front-end, react dev, etc.) role since I'm still working as a web developer. Once I get a new role, I can go back to saving for my courses and begin to take them, even though it will take me longer to complete since I would have less time each day to work on them. The biggest hurdle, it seems, is just getting a new job. I haven't had any luck with getting any interviews, but to be fair, I also haven't applied to too many places (less than 15) and I don't have a portfolio (I've had to sign NDAs for most of my client work, so I'm not able to include almost all of my work in my portfolio). \n\nI'm looking for any input or advice on what I should do. Like I said, I feel a bit scatterbrained and I need help focusing on a goal to pursue. Thanks for taking the time to read my post, and I would appreciate any input.",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/1bjfzm1/frustrated_junior_web_dev/",
      "comments": []
    },
    {
      "title": "Bay Area Employers only doing LC/HRR",
      "body": "Bay Area Employers LC Algo based on-site \n\nSo I recently went through my interviews and curious if anything was in common with all of them and I noticed that all of them that were LC/Hackerrank algorithms based interviews were from Bay Area employers.\n\nTo name a few, KeepTruckin, Yelp, Figma, Square, AWS and a few others.\n\nIs it a standard for all employers in the Bay Area? \n\nI ultimately went with a Canadian startup just because I hate doing LC and paid about the same minus equity.",
      "subreddit": "cscareerquestions",
      "score": 22,
      "url": "https://reddit.com/r/cscareerquestions/comments/n3a5c4/bay_area_employers_only_doing_lchrr/",
      "comments": [
        {
          "body": "my rule of thumb is to expect LC for Bay Area **regardless** of company",
          "score": 20
        },
        {
          "body": "[deleted]",
          "score": 12
        },
        {
          "body": "&gt; paid about the same minus equity\n\nEquity is basically the difference between a decent comp and an amazing one. \n\nIf you hate LC, then sure, diminish your lifelong career earnings potential by 50% to avoid it.",
          "score": 17
        },
        {
          "body": "LC is an easy way to test your general reasoning skills and ds/algo skills. Sure you weed out good developers with it, but most people who pass leetcode exams at least have basic programming skills and demonstrate they can learn on the job. \n\nI can't blame anyone for asking LC tests. They probably have metrics in the background showing these tests correlate positively with employee performance.",
          "score": 4
        },
        {
          "body": "What’s your TC",
          "score": 2
        }
      ]
    },
    {
      "title": "Regretting jumping from a busy startup to a well-established retail company. Advice?",
      "body": "Tldr; Just started a job. Feels like a demotion from a tech manager to a UI dev.\n\nI started my career at a growing startup which had a lot happening. A couple of years and people moving out made me (and another front end guy) the person who looked after tech. I basically handled everything from planning to architecture designing to deployments. There was zero free-time and I had no life. I rarely went out and had to take my laptop with me whenever I did. My management refused to hire someone with more experience and kept hiring a shit ton of entry-level front-end engineers(whom again, we had to mentor) no matter how many times we raised concerns. Soon, my manager started taking credit for what I did and I felt like it was time to leave. I have social anxiety. Like voice-squeaky, hands-shaking anxiety. My interviews never went well. I can code and I managed a team, but in interviews, I just couldn't speak properly and let them know the kind of responsibilities I handled. When I did, for some reason, I made it sound too simple. So after around 15 rejections, one of friends who knew I could work got me a job at this new place with not much of a change in my compensation.\n\nThe WLB is great. I'm actually doing things on weekends. The issue is I was never a front-end engineer, I never enjoyed doing it. I tolerated it. I seem to have become the UI person at this new place even after voicing my concerns(did not complain) with my direct manager. He says there's going to be some backend stuff as well soon. Maybe it's a temporary thing, but it's been about 3 months and I keep getting UI fixes and design-update tasks. There's been a couple of more backend hires as well in the team. This feels like a demotion from a lot of responsibilities and tech to changing font sizes and colors and I'm kinda hating my work. Any advice on what would be the best thing to do in this case? Stick around here for another year or look for new jobs? The job hunt with rejections specially was a tough time for me and thinking of going through it again now is a little hard. I was thinking of learning something new or contributing to open source or even freelancing. Sorry for all the complaining, I had to vent, just got a whole Figma doc for a complete UI revamp :(",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/rl9z7c/regretting_jumping_from_a_busy_startup_to_a/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 17
        },
        {
          "body": "Just job hunt dude. Get it while the getting good. Try to get something you’ll think you’ll stick with for a couple years at least but I know so many devs who have job hopped in  by less than a year and it really doesn’t seem to have affected their careers",
          "score": 6
        },
        {
          "body": "What I recommend is working on your communication skills while you stay at your new UI centric job. Look into an organization called Toastmasters. It's a public speaking club and they give constructive feedback whenever you present. It's one of the best things I've done in my life regarding personal development. You'll eventually be interviewing like a boss.\n\nOnce your communication skills are sharp, or even decent, you'll be acing interviews. Then you'll get that way better job doing backend engineering.\n\nYou could also just keep interviewing but you won't get any feedback. There is also a website called interview IO but doesn't compare to facing your communication challenge head on.",
          "score": 5
        },
        {
          "body": "Startups and larger companies are a completely different world. In a startup, it's normal to do multiple roles at the same time, whereas in large companies, the scope of tasks is usually smaller. It's not really a step down. \r  \n\r  \nHonestly, if you earned the same as a tech manager as you did as a simple UI developer (based on the tasks you describe) a lot went wrong in your old job. Be glad you're out of there.\r  \n\r  \nThe biggest problem with your new job seems to be that the job is not what you want to do. I wouldn't count on your job at your current job changing much and therefore focus on the job search.\r  \n\r  \nI would invest time in myself and my skills beforehand though. In my experience, in non-IT companies you often find a WLB that rarely exists in IT companies.",
          "score": 3
        }
      ]
    },
    {
      "title": "Feeling stuck and unsure of how to move forward",
      "body": "Hi all! I'm using a throwaway for obvious reasons.  \n\n\nI'm currently almost 2 years into working (first job after graduating college in 2019) and I feel really stuck. I currently spend most of my day not really doing any work and my manager and teammates aren't too concerned cause I'm able to get most of my work done within an hour or two, and they're happy with what I've done (**spend 6 - 7 hours/day doing nothing** \\- browsing Reddit, reading news articles, random forums, and listening to music).  \n\n\nHowever, I feel like I've been wasting my time during these 2 years. I was happy to start working initially, but once the pandemic hit (I was 3 months into my job), I really lost motivation to do my best. I haven't truly learned anything or grown too much other than learning a little more JavaScript/frontend frameworks.  \n\n\nI've been applying to places and doing interviews, but have been failing all of them, since I haven't done too much preparation. I've basically been looking at LC problems and just copying solutions verbatim, not truly understanding the problems hoping it turns into muscle memory at some point (terrible plan, but I thought trying to get a job quickly would help).  \n\n\nI'm just confused and not sure how to move forward. I enjoy doing some UX design (making prototypes in Figma) and development work (primarily use Angular, but trying to learn Vue now), but I can't force myself to do so until I have an impending deadline coming in the next hour or so, or just randomly feel like working on it.  \n\n\n**If anyone has any suggestions on how to properly change my life around, I would greatly appreciate it.**",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/qi3vdq/feeling_stuck_and_unsure_of_how_to_move_forward/",
      "comments": [
        {
          "body": "Oh man I feel you for real. I did this on my first company. Automated everything the first year, did nothing next 2 years. Then could not hop due to skill gap.\n\nI say just skill up. Look at peers that are doing similar things to your target role. Fake it as if it was you. When asked in the interview, just tell them the story as if you're describing that peer.\n\nAs for your skills, you have to learn it yourself. Surely it's all learnable.",
          "score": 2
        }
      ]
    },
    {
      "title": "Got a $30k raise by switching jobs",
      "body": "Just wanted to post this on here in case anyone else feels stuck at a job that doesn’t pay enough.\n\nI’ve been at my current job for a little over a year. Starting salary was $50k, I originally asked for more but at the time I had to take what I could get. Rent was due, we were just coming out of the pandemic and I didn’t have much choice. My job offers no benefits, long hours, and I’m the only one in my department so everything falls on me (I even work from home on my sick days to keep up).\n\nAnyway, on a whim last month I updated my LinkedIn, applied a few places and went on with my life. 2 weeks ago I got contacted by a company that wanted to set up and interview, and then another and then another and last week I got a job offer with an $80k base salary, fully remote, unlimited PTO, company paid benefits, continued education reimbursement, plus 10% yearly bonuses.\n\nI almost cried, this is life changing for me.\n\nI hope that anyone in the same boat gets the same type of opportunity and don’t be afraid to do what’s best for you and ask for what you’re worth!\n\n‼️‼️‼️‼️‼️\n\n!— UPDATE: —!\nThanks for your kind words everyone! I appreciate any advice about navigating PTO &amp; remote work as well.\n\nA few people asked so I’m going to post here:\nI’m a Graphic Designer, been doing it for about 10 years now. I started out working at sign companies and eventually moved into branding since I found that companies paid more for that. I use all of Adobe Creative Suite but mostly Illustrator, InDesign, Photoshop &amp; Premiere Pro.\n\nI got a Coursera account in January and started taking a UX/UI course so now I’m using Figma (which is FREE btw!) &amp; Adobe XD . I haven’t finished, still in progress but it seemed like the natural move for me career wise and when I interviewed for this company I think that they liked that I was taking the initiative to learn on my own. \n\nFor my LinkedIn update: I made sure my website/portfolio was up to date and showed my best work even if it was just passion projects. Made sure my headshot &amp; banner looked professional &amp; I updated my job descriptions to sound more professional. I also gave my resume a facelift. I looked up examples of other people that do what I do or are doing what I want to be doing and took notes on what I liked about their profiles and applied it to my own.\n\nThe job title I got for this new position is Senior Graphic Designer, so it’s brand focused however I will also be doing some entry level UX/UI work which works out perfectly for me because I get to use my skills while learning and getting paid for it.\n\nI hope this helped!",
      "subreddit": "jobs",
      "score": 991,
      "url": "https://reddit.com/r/jobs/comments/v2o7el/got_a_30k_raise_by_switching_jobs/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Yay good for you! \n\nMy advice about unlimited PTO is to use it! Companies love unlimited because they don’t have to cash you out when you leave, and employees often end up using less than when it’s a set amount. \n\nDo some math and make sure you use as many hours as you probably would have been given in a year, then an extra week for good measure :). Especially since you’ll be working at home full time, it’s easy to let home and work meld together if you don’t take enough vacation time.",
          "score": 241
        },
        {
          "body": "Dude congrats! I just got essentially (after bonuses factored in) a pay raise that doubled my salary, from $74k to $147k!! Not to mention incredible other benefits like 40 PTO days, every Friday off for an entire month, blue cross blue shield, etc etc.\n\nI’m a grown ass red blooded American male but I balled my eyes out the moment I got off the phone with the recruiter. Just had my first child 8 months ago too.\n\nGoing from:\n64K base with $2.5K quarterly bonuses = 74K.\n\nTo:\n$105K base with $10.5K quarterly bonuses = $147K. Plus $5K signing bonus.\n\nLife changing and really goes to show how little my ex company valued me and how little I knew about my worth.\n\nI’ll still freelance for them though, but on my own terms.\n\nI start in a few weeks and I still open my offer letter up daily. Still doesn’t feel real.",
          "score": 35
        },
        {
          "body": "Wow awesome! If you don’t mind sharing, what industry?",
          "score": 32
        }
      ]
    },
    {
      "title": "700+ applications, 20 interviews, 0 offers — what am I doing wrong?",
      "body": "Hi everyone,\n\nI’ve been job hunting for about 4 months now and I’m starting to feel really discouraged. I have a Bachelor’s in Design (just graduated at 22), and since then I’ve applied to over 700 jobs. Out of those, I’ve had around 20 interviews, but no offers.\n\nSome context:\n\n* My degree is in graphic design / studio arts\n* I’ve been applying to roles that range from design, marketing, gallery, lots and lots of retail (with 3 different tailored resumes)\n* I have 4 strong references and write cover letters for \\~1/6 job apps\n* I’ve gotten to final-round interviews a few times, but always get rejected at the end. I just had a third-round interview for a retail store with the CEO where I was essentially told I was too young although the hr and hiring manager loved me.\n\nAt this point I don’t know if I’m doing something fundamentally wrong, or if it’s just the market. Is it my resume? Is it my age? Is it the career? Is it me? Is this normal for new grads in design, or is there something I should be changing. My resume, my portfolio, my interview approach, or my strategy overall?\n\nAny advice would mean a lot.\n\nmy website: [https://gabbyzimmerman.neocities.org/](https://gabbyzimmerman.neocities.org/)\n\nWhat I've applied to: [https://docs.google.com/spreadsheets/d/1XHyY-cx9pERbGVZ5cAioqDAeXXtx5Hu6WUqbMLOo5S0/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1XHyY-cx9pERbGVZ5cAioqDAeXXtx5Hu6WUqbMLOo5S0/edit?usp=sharing)\n\nmy resume:\n\nhttps://preview.redd.it/zeapznco01mf1.png?width=7650&amp;format=png&amp;auto=webp&amp;s=07294c7a7052fc6980bf52a44746806221ce8345",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1n3juab/700_applications_20_interviews_0_offers_what_am_i/",
      "comments": [
        {
          "body": "Are those all 1st round interviews?  Do you ever have more than 1 interview with any employer?  If so, how many?",
          "score": 3
        },
        {
          "body": "[removed]",
          "score": 2
        }
      ]
    },
    {
      "title": "Did I make the right decision accepting this job?",
      "body": "Hello everyone,   \nso I recently graduated with my BFA in graphic design in December, and I've been really trying to look for a graphic design related job, mostly in web design. I finally got a job offer to be a design assistant for this software company, however I don't know if this was the right choice. You see I don't really do any designing at this job. I just put in the content clients give us into a CMS platform so it can be viewed on the website the company makes for them. I also test the custom website on different browsers and devices and report back any errors to the actual web designers. I do other things but that is mostly what I do. \n\nI don't hate this job. The people are super nice, there are great benefits, and its a small company that has been growing, but I really wanted a more design focused job. They told me during the interview that this is an entry level position and that I can be promoted to a web designer or another position down the line ( I have a friend that works for the company she told me that they are really good about promoting people internally), however the thing is that the web design position rarely opens. Most of the designers they have have been there for 5 or 10 plus years. The company is growing and they are trying the get a variety of clients in different sectors, and if the company continues to grow then they will need another designer at some point and they would most likely hire me, but I don't know how long that would take. \n\nAlso it is important to note that I don't know how to code. I just do stuff in figma and framer, however with my current position they are teaching me how to code which is really nice, and I have exposure to the front end and back end of website building since my position allows me to communicate with both web designers and developers. \n\nWhat do you think did I make the right choice?\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1myge7a/did_i_make_the_right_decision_accepting_this_job/",
      "comments": [
        {
          "body": "In my experience, it’s better to collect as much experience as you can so if you’re learning other skills at your current job, I think that’s great. Maybe one day you’ll be able to learn a lot of skills that would be helpful to be a web designer and you can move to a company that would let you do that and pay you more. I won’t stress too much about it as long as you’re learning.",
          "score": 3
        }
      ]
    },
    {
      "title": "i got a job! but i'll never get back the six months of my life it took to snag it",
      "body": "long time lurker, first time poster. for context: i'm a professional graphic designer. i have a decade of in-house design experience under my belt as well as multiple niche specializations such as vector illustration and branding. for these reasons, i'm usually in high demand\n\n90% of the marketing team at my previous workplace was laid off in may of 2024, but i was fortunately given a nice severance so i took three-ish months to sort through some personal shit that had been on that back burner and also rebuild my portfolio website. until recently, i had only gone a few weeks between full time roles, and often had multiple offers to choose from. those were the good ol days\n\ni began searching in earnest the following september and was immediately slapped across the face by the state of the current market. i've genuinely never seen anything like it. while i was able to get the phones to ring on my own, the game changer for me was teaming up with a headhunter who specialized in placing creative professionals. she landed me a few interviews, and one of them stuck. i just wrapped up my first day as a senior designer for a large ad agency and i can't stop pinching myself bc i can't believe i finally netted the title change. i've wanted nothing more than to finally step into a senior role and i finally got there! \n\nduring the last nine months i've been constantly upskilling. i've rebuilt my portfolio site three separate times, honed the projects and case studies displayed on the landing page, and taught myself adobe premiere, after effects and figma. (figma is a walk in the park if you know xd btw.) instead of cringe posting to linkedIn with the rest of the lunatics, i focused on buffing my stats, and i think it paid off\n\nto keep myself afloat i worked a few contract roles and did some small-scale freelance for local clientele. i've also had this side gig as a trail guide for a local equine ranch for the last 14 years and i doubled up on my time there to help me pay my bills. to everyone who was generous enough to tip me after our rides during the last nine months: i love you\n\nthis market has the capacity to break anyone but i implore y'all to stay strong. remember that nothing lasts forever: the good, as well as the bad. happy hunting 🙏",
      "subreddit": "jobs",
      "score": 36,
      "url": "https://reddit.com/r/jobs/comments/1j3489y/i_got_a_job_but_ill_never_get_back_the_six_months/",
      "comments": [
        {
          "body": "Design Assignments…lol…yeah I would decline too.  I love it when they don’t bother reading the resume prior to the interview which is the biggest tell they aren’t worth the effort.\n\nGood job finding something!  👍🏻",
          "score": 5
        }
      ]
    },
    {
      "title": "Seeking Advice (job hunting)",
      "body": "Hey I’m currently seeking advice as I’ve been job hunting for the past 5 months with no success and only receiving one interview. I’ve applied endlessly and used job placement agencies and now I’m relying on asking for help, resume reviews, pointers or anything tbh. Originally my search was focused on UX design jobs but based on the industry I’ve widened it to different design/media positions. I’ll put a picture of my resume (cropped out the personal info at the top), if anyone could give it a look over that would be greatly appreciated. \n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1eemqtv/seeking_advice_job_hunting/",
      "comments": [
        {
          "body": "One thing I noticed was that you don’t have the dates you were employed? Your professional summer is okay, but a bit too long. Skills could be shorten to relevant skills. Also, you don’t have too much metrics or how you are creating value. Also, probably could get rid of the education bullet points. You also could squeeze everything to one page. The dates of experience is probably a big thing since how would a reader know how much years of experience you have? Good luck.",
          "score": 1
        }
      ]
    },
    {
      "title": "Capture the hiring manager's attention with a strong, tailored Summary. Here's a step-by-step guide. ",
      "body": "A well-crafted Summary that nails the key highlights on your resume most relevant to your prospective job opportunity gives the recruiter a reason to keep reading after their initial 6-second scan.  Think of it like a movie preview. When it captures your attention you are excited to watch the full-length feature.\n\nYour Summary is the best opportunity to quickly show what about you, your skills, and your experience will translate to success in the role to which you are applying. Not everyone uses a Summary and it's not right or wrong to have one - it's purely about personal preference.   \n  \nIf you do craft one for your resume, here are a couple of things to keep in mind:\n\n**1) You won't always use the same Summary.** True, you can't change the experience you have and you won't want to fabricate anything, but you will want to pick and choose what to highlight depending on the prospective opportunity. Why? Because each role is a little different and each employer has varied requirements.\n\n**Here's a Tip:** Employers tell you exactly what they are looking for within the job posting, on their company career site, or LinkedIn profiles. If the requirements are 3+ years as a Nurse in an intensive care setting, you won't be focusing on your teaching career before you transitioned into Nursing unless teaching experience is also one of the keys they mention. Like the rest of your resume, it needs to be tailored.\n\n**2) It needs to be brief.** If you want to expand to more than 3 sentences, the cover letter is a better opportunity. Boil it down until it's as concise and impactful as possible. Each sentence, each word has a specific purpose. More on that below.\n\n**3) It's strengthened by containing a value proposition for the employer.**  Organizations hire to fill a specific need. They are growing, they are hurting, they need to improve, there are any number of reasons they hire - but they are all looking to solve something specific. Your goal in an application is to understand what that particular need is and address it.  \n\nYou shouldn't decide what to include in your Summary until you understand the needs of the employer. Then, show what about you and your experience makes you qualified to help them solve that 'thing'. By showing the employer you understand their need, and articulating your value proposition clearly, you dramatically increase your chances of standing out from the crowd.\n\n**Ok, so how do I write a good Summary?**\n\nI like to use a 3-part process, one part per sentence.\n\n**1) The first sentence** describes you (by your role) and your competencies. Your 'role' can be your current or desired job title (within reason), mention of the key terms from your prospective job with a couple of examples of what you are great at that also match your prospective role.  \n\nIf I'm a Marketing Manager applying for a Digital Marketing Director role, I would call myself 'Digital Marketing Director' or 'Leader', and lead with something like *Digital Marketing leader with expert knowledge of SEO, social marketing, PPC advertising, and team building.*  If I'm applying for a Talent Acquisition role but my related job titles have used the term 'recruitment' instead of 'talent acquisition', I would still lead with something like *Talent Acquisition Director with 4+ years in building recruiting lifecycle programs in the medical device industry.*  \n\nWait, isn't that fabricating details? Nope. I'm not telling you to change the job titles in your Work Experience section, this is simply how you describe yourself, and you have a [300% greater chance of landing an interview](https://www.reddit.com/r/jobsearchhacks/comments/1dq1vsp/i_got_some_data_on_what_actually_increases_a/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) (according to research by Jobscan) if you use the exact job title in your resume. The key is your prospective employer sees right away that you are already doing the job they are hiring for, or at the very least you have the capacity to do it because you've done something very similar recently. After all, it's all about landing an interview where you can discuss the details.\n\n**Tip 1:** Pick one term to describe yourself. Maybe you are an expert in Business Development, Customer Success, and Digital Media. You likely won't want to lead with all of those unless the job description mentions you should be great in all those areas. More often than not, a recruiter is hiring for one of those roles and your resume needs to be laser-focused on that.\n\n**Tip 2:** If you are changing careers, describe yourself using your desired job title. If you are transitioning from Business Analytics to Project Management, describe yourself as a Project Manager. You can add “with background in Business Analytics” to acknowledge that part of your career. And you'll have the opportunity to explain this in an interview, which is the goal.\n\n**2) The second sentence** connects your expertise to your value proposition. This is where you define how your unique skills will make you a valuable asset to your prospective employer. Begin the sentence with a term like 'Expert', 'Excels in', 'Skilled at', 'Proficient in', or another synonym followed by a few of the most valuable skills or key accountabilities required in your prospective job.\n\nExamples: *Expert in creating graphics and illustrations using Figma and Adobe suite for web marketing programs that drive conversions.*\n\nOr, *Excels at developing full-cycle recruitment and hiring processes to improve time-to-hire and decrease cost-per-hire metrics.*\n\n**Tip:**  Carefully examine your prospective job opportunity for the keys they are looking for in a new hire. It might be included in the summary of responsibilities, the description of the role, or the essential functions. Don't lie about experiences or skills you don't have. But if you are qualified for the role, spell it out for the hiring manager using their language. If they are looking for a Senior Accountant to lead a team, audit their work, and be responsible for the month-end close - and you've done that - why not say you are *Senior Accountant who excels at leading teams, audit, and reconciliation, and accurate month-end closing*?\n\n**3) The third sentence** concludes your Summary with a *'known for'* differentiator or a *'driven to'* value proposition that is employer-specific. You face stiff competition for the hiring manager's time and attention with many others who have a very similar skill set and experience. It's important to provide a clear reason why the employer should call you for an interview above others. Again, don't make them guess if you have what it takes to succeed in their role.  Do the math for them.\n\nConclude your summary with what you are known for, what you are most proud of accomplishing in your career, or what specific point you would love the opportunity to discuss in an interview that will resonate in the new role.  \n\nHere are examples of 'known for' statements:\n\n*Known for crafting and delivering compelling client presentations...*\n\n*Known for exceeding QoQ and YoY sales quotas with 92% customer retention...*\n\n*Consistently noted in performance reviews as...*\n\n*Received 3 awards for customer service excellence...*\n\nHere are examples of 'driven to' conclusions that are specific to the employer:\n\n...driven to advance 123 Inc.'s mission to end world hunger.\n\n...motivated to contribute my acute-care experience to ABC Healthcare's world-class team.\n\n...excited to help ACME become the global leader in widget production.\n\n**Tip:** You don't need to keep it strictly to 3 sentences, 4 is perfectly fine if you have enough value to highlight that's relevant to the employer and you are keeping it concise.\n\nNow, let's put it all together. Describe yourself using your role or desired title. Elaborate on your expertise and connect it to your value proposition. Conclude with the differentiator that sets you apart from other candidates, possibly with what you will contribute to the specific employer.\n\nHere's how it might read for Jobflow to hire a Marketing Manager to grow social media, drive subscription conversions, and take ideas from both Sales and Tech teams and turn them into actionable marketing programs:\n\n***Dynamic, tech-savvy Marketing Manager with 8 years of experience gaining 500k+ social media followers, collaborating cross-functionally with Sales and Tech teams to achieve business goals, and developing innovative marketing collateral to drive conversions. Known for building and leading a team of specialists towards a common goal.  Motivated to utilize my experience and skill set to advance Jobflow’s mission to help every job seeker land a better job in a fraction of the time.***\n\nHere is how it might for a CPA applying to an Accounting Director role to manage financial systems migrations, manage teams across global environments, and provide sound strategic financial leadership:\n\n***Accomplished CPA and Accounting leader with 10+ years of experience with Sage Intacct system migrations and financial transformation initiatives. Proven record of implementing robust internal controls, driving operational excellence, and strategic financial leadership. Adept at managing multiple priorities and leading teams across complex, multinational environments, with focus on innovation and process optimization.***\n\nThis leads right into your Work Experience section where you can detail more about how you exemplified or accomplished what you touch on in your Summary.\n\nYour Summary is the perfect opportunity to share a quick narrative that touches on all the highlights of what about you will set you up for success in the new role, depending on exactly what the hiring manager for the new role is looking for. Follow the step-by-step guide to nail your opening and hook the reader.\n\n\\_\\_\\_\n\nIf you are looking for help with your Summary, particularly how to summarize the highlights and tailor it for every opportunity, [we do this work for you at Jobflow](https://www.myjobflow.com/)! (It's free, no subscription is required). Simply:\n\n1. upload your resume\n2. show us the job you want to apply to\n\nIn under 2 minutes we'll:\n\n* show you exactly what the employer is looking for in prospective hires for the role\n* craft a new Summary that highlights your skills and experience to match the job opportunity\n* add it to the top of your updated resume we optimize and tailor for your application\n* craft a cover letter that tells a compelling narrative about your career and the strengths you'll bring to the new role\n* and provide all documents in formatted, ATS-friendly versions\n\nLet me know any feedback or how I can help craft your compelling Summary.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1dsbq2l/capture_the_hiring_managers_attention_with_a/",
      "comments": []
    },
    {
      "title": "Is this design challenge as part of an recruitment process legit?",
      "body": "I got a message from the company Appsketiers after I applied for a UI/UX job a few days ago on Indeed. It said thanks for your interest and gave me a design challenge \"as part of the recruitment process.\" They're giving me 4 days to email the assignment to them. \n\nTo summarize their long message:\n\n\"We are developing a mobile app that allows users to discover nearby restaurants and explore detailed information about each establishment. Your challenge is to design a UI/UX concept for this app.\"\n\nThey listed specific, detailed requirements for features, like \"map view, list view, swipe-through view\", and wanted 5-8 screens. Also said to consider technical feasibility as well as ease of implementation from a business perspective. \n\nTheir mentioned client base seems a little weird to me too; it \"consists of everyday people looking to start a company in the form of a mobile application and have limited resources for business execution.\" \n\nThen they said they will review the submissions but never said anything about an interview. \n\nIsn't the brief too much especially for work they never said was paid? And the problem they want me to solve is for an actual real app they are currently developing, no hypothetical. They also want me to send them native design files like Figma etc, which they'd be able to edit themselves after. \n\nThoughts? \nThanks.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/19d6n7c/is_this_design_challenge_as_part_of_an/",
      "comments": [
        {
          "body": "That certainly seems suspicious to me.",
          "score": 2
        }
      ]
    },
    {
      "title": "Capital One Power Day Interview Round - UX/Product Design",
      "body": "Hi all! I have an upcoming final round(power day) with Capital One. One of the interviews will be a technical interview and they haven’t given me much insight into what will be discussed. Do i need to be prepared to be tested on my figma skills? What should i expect? Any advice would be so appreciated. Feel free to dm me as well. Ty in advance!!",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1lhzca5/capital_one_power_day_interview_round_uxproduct/",
      "comments": [
        {
          "body": "The technical interview typically focuses more on your design thinking process and problem-solving approach rather than hands-on tool proficiency like Figma skills. You'll likely face scenario-based questions where they present a design challenge and want to see how you break down the problem, consider user needs, think through constraints, and articulate your design decisions. They might ask you to walk through a case study from your portfolio in detail, explaining your research methods, how you handled stakeholder feedback, or how you measured success.\n\nExpect questions that test your understanding of design principles, accessibility considerations, and how you collaborate with cross-functional teams. They may also present hypothetical situations specific to financial services or ask how you'd approach designing for Capital One's customer base. The key is demonstrating your strategic thinking and ability to justify your design choices with solid reasoning. Since navigating these complex design interview questions can be tricky, I actually work on a tool called [interviews.chat](http://interviews.chat) that helps candidates practice and get real-time guidance for exactly these types of challenging interview scenarios.",
          "score": 1
        },
        {
          "body": "Congrats on making it to Power Day! For UX/Product Design, “technical” usually means walking through your process, maybe a design challenge or critique — not a deep dive into Figma tools unless they say so.\n\nI used **Sensei Copilot AI** to practice explaining my projects and thinking clearly. Super helpful for getting your talking points straight. Just focus on how you solve problems and communicate your design choices.",
          "score": 1
        }
      ]
    },
    {
      "title": "Which of these resume formats would parse better through an ATS screener? (First one is custom-made, second is a Word ATS template)",
      "body": "At this point I don't know if it's the resumes themselves or my work experience, but I am getting zero callbacks even for screening rounds. I don't know what else I can do at this point. I have tailored these resumes to multiple openings, I have created countless cover letters, I have cold emailed and DM'd so many hiring recruiters. Still nothing.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1l07znn/which_of_these_resume_formats_would_parse_better/",
      "comments": [
        {
          "body": "The second one is simpler, cleaner, and therefore more likely for AI to read cleanly. \nThe simpler the format and easy to read the better\nI took a friends resume he made got rid of the extra line dividers and stuff he had and brought it down to a simple plain word doc style and he had a much easier time landing a job",
          "score": 1
        },
        {
          "body": "Just run through an ATS screener yourself and see the score?\n\n  \nOr look-up Jake's Resume on Overleaf or r/EngineeringResumes  resume for good ATS-friendly resumes.",
          "score": 1
        }
      ]
    },
    {
      "title": "Getting a job in the creative field is ruining my drive.",
      "body": "I've been looking for work and just feel like quitting. I don't know what employers look for in graphic designers and illustrators and it's embarrassing to have to explain to friends and family, why finding work out of college has been a slog.\n\nThe only people that ever wanted me were unpaying and volunteer/ internships and this makes me feel like my work isn't even worth a dime. \n\nI ruined these opportunities after getting my hopes up for a job scam and sending in letters that I changed my mind to these volunteer/intern positions.\n\nThen I advertise commissions but seems like everyone is either on the fence or can't afford it right now and this RUINS my drive to even make anything new anymore. \n\nI'm told my prices are fair yet I also know everyone is struggling to get by and purchasing a non physical art piece can be off putting.\n\nNot only this but a week ago I was interviewed for another unpaid internship just for him to say that I seem more Illustratively strong than what they were looking for. \n\nEveryone I've talked to only want social media interns that can use photoshop, not anyone that can draw?? I just don't want to do this anymore. My art is suffering behind this. I don't know where my art fits and I can't narrow down what Graphic Design is even about.\n\nAll I'm good at is drawing characters and being a \"colorist.\" Graphic design I can only do basic stuff..not all this UI and Figma or Adobe XD nonsense everyone wants.",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/1ft9qc6/getting_a_job_in_the_creative_field_is_ruining_my/",
      "comments": [
        {
          "body": "The market is tough for graphic design. As a recruiter/career coach I have seen a ton of resumes and typically marketers and graphic designers have the worst ones. They try and get all fancy with it, but you really want a boring and basic black and white Ariel font resume. \n\nWhat recruiters are looking for are the keywords in the qualifications section of the jobs. Unfortunately Figma and 3D animation seems to be the biggest trend in what they are looking for. If you don't know any of that, you might have to pivot to another industry.\n\nI am not trying to be cruel with this but pencil drawing and colorist type jobs have been decreasing rapidly, it's mostly all digital now.",
          "score": 3
        },
        {
          "body": "I dated a graphic designer years ago. It's a tough field to get into, many people I know who were in it got out. In an economic downturn they tend to be some of the first jettisoned to cut corners.\n\nI don't want to go into the details at present, but it wrecked our relationship after 4 years.\n\nI hope you find what makes you happy, but be aware I know at least 3 people from the graphic design world (2 graduates from the UNT program, Texas) who didn't do well there.\n\n-EDIT- Have you considered submitting a portfolio to fantasy game companies? Might not be a lot of money or steady work, but they tend to like creative hand drawn art.",
          "score": 1
        },
        {
          "body": "The job search within the creative fields, say graphic design and illustration, is at best complicated. Being unique as a character artist-colorist may be something to nurture rather than spend trying to forcibly fit into a box.\n\nYou could also consider finding specialized internships that match your skillset. Websites that update listings in real-time, such as the Top 2025 U.S. Internships, can expedite your search by narrowing down to specific listings that match your skillset. Engaging with other creatives through online communities may also bring you collaboration or freelance opportunities. Your art is worth viewing and appreciating.",
          "score": 1
        },
        {
          "body": "Your last two paragraphs say a lot. \n\nYou are offering a service that the market does not value. It’s hard getting into design jobs right now even if you ARE amazing at what is in demand. \n\nW2 roles for character design are few and far between. You can move to a creative hub like NY or LA if you are not already there to increase your chances, or lean into making a name for yourself selling your own art, which is a long and risky road. \n\nI can’t blame you for feeling discouraged! ",
          "score": 1
        }
      ]
    },
    {
      "title": "Seeking advice: 1000+ applications for Software Engineer roles -&gt; 2 interview and no offer yet",
      "body": "&amp;#x200B;\n\nhttps://preview.redd.it/q6rk3lrhxdgc1.png?width=1164&amp;format=png&amp;auto=webp&amp;s=c22e40abdf0221d34968c0398110e31a0fecf20e\n\n&amp;#x200B;\n\nHello Reddit Community!\n\n&amp;#x200B;\n\nI'm in some serious trouble right now and figuring out what is going wrong here. I'm attaching my resume's picture with this post.\n\nI've applied to more than 1000 positions as you read this but having trouble getting any OAs or interviews. I've been to career counseling and used all kinds of online tools to optimize my resume getting good score but with no luck.\n\nI would love to hear anything about my resume for why it's not being picked up.\n\n&amp;#x200B;\n\nP.S.: I'm in US and on OPT Visa.\n\nAny suggestions are welcome!",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1ahxzwd/seeking_advice_1000_applications_for_software/",
      "comments": [
        {
          "body": "I think being on a Visa would be the biggest reason why.\n\nI would search for jobs in your home country as well to avoid any gaps in your career if I were in your shoes.",
          "score": 3
        },
        {
          "body": "You and a ton of other software devs. Problem is the market right now is really bad and will all the big corpo layoffs it will get even worse. \n\nEvery job application has hundreds of applicants and I believe companies find someone to hire amongst the first few and don’t bother going through the rest of them. Just look at this example https://imgur.com/a/LFOdAOD in 12h it got 50 applicants and they closed the job (probably found someone to hire). \n\nI’m actually trying to solve this problem of making it amongst the first applicants with https://first2apply.com/ I have an MVP ready, waiting to get approval from Apple and MS to publish it to the stores",
          "score": 2
        },
        {
          "body": "Two things:\n\n1. You should use a more professional template for your resume. It's honestly stupid because it shouldn't matter but ultimately it does.\n2. I got my current data science role from [JobHelper](https://www.jobhelper.cc). While it's not going to get you a position overnight or fully replace actively applying, it can help give you a boost by doing some of the work for you.\n\nThe current application system is so fuckin stupid. I hope you find something soon and good luck ;)",
          "score": 2
        },
        {
          "body": "Currently the market is not good. \n\nBut you should work to improve your cv to make it aesthetically good, like adding a picture, by using spaces correctly, having a proper font, and using proper headings. This format is very old, and does not look professional. \n\nYou have added the proper keywords. That's awesome. But you should format it to make it look better.",
          "score": 2
        }
      ]
    },
    {
      "title": "Seeking advice: 1000+ applications for Software Engineer roles -&gt; single digit interview and no offer yet",
      "body": "Hello Reddit Community!\n\n&amp;#x200B;\n\nI'm in some serious trouble right now and figuring out what is going wrong here. I'm attaching my resume's picture with this post.\n\nI've applied to more than 1000 positions as you read this but having trouble getting any OAs or interviews. I've been to career counseling and used all kinds of online tools to optimize my resume getting good score but with no luck.\n\nI would love to hear anything about my resume for why it's not being picked up.\n\n&amp;#x200B;\n\nP.S.: I'm in US and on OPT Visa.\n\nAny suggestions are welcome!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/mfns3hv0sdgc1.png?width=1164&amp;format=png&amp;auto=webp&amp;s=0ac8dd5f8fb823ab6b1c5c886fbae6f84a887aaf",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1ahxda5/seeking_advice_1000_applications_for_software/",
      "comments": [
        {
          "body": "Fix the dates on the first line make it June-2023 to present , get rid of the intern job , and above your work experience. State the role you are applying to by saying I’m looking for a job in this role. Proven skills to organize and multitask. I work well in groups or individually and I am very reliable. Excellent verbal and communication skills. Good luck hope it works out for you",
          "score": 1
        }
      ]
    },
    {
      "title": "I just failed my first React technical Interview and here are the lessons I learned from it.",
      "body": "Hello friends, a week ago I asked here on reddit this: \n[https://www.reddit.com/r/learnprogramming/comments/kvrk05/how_to_answer_tell_me_about_yourself_in_an/]()\nIt was a question that I had no idea how to answer and I am so thankful for the huge amount of awesome responses I got from the Reddit community - you peeps are amazing! And today I got a chance to have a face-to-face interview with the company that has asked me this question through a phone interview. But the thing is, I honestly did not perform well at all, and by the half end of the interview, my confidence level dropped down by 90%. But here are some of the lessons that I learned today:  \n\n1. When you enter the room, **always smile, be pleasant and greet them Goodmorning or GoodAfternoon**. This just ensures that you have the basic courtesy of greeting a human being. Period.     \n2. Always be prepared with the question: \"**Tell me about yourself\"**. WHY ? Because if you can nail this question without any sweat, I feel like you have a kind of head start already. So refer to the above link on how to answer it in a cool way.  \n3. If they give you a take-home project with a figma link or any design that they want you to build **ALWAYS STICK TO THE DAMN DESIGN.I REPEAT - STICK WITH IT**.I think this is where I felt like \"oh goddamn it, I really messed up here\".So I was given a basic design and was told to design that basic app with that UI plus add some other features following the same design. But guess what I did ? I didn't follow almost 95% of the design.I added shadows,I added border-radius and all that crap just to boast my CSS skills and when they asked me why I deviated from the design, I had to say that I thought my design was better than theirs which was a very foolish answer to say.  \n4. **If the interviewer is asking a question, make sure you give some time to think and then answer**. Process the question being asked.What I did was just abruptly jump in and answered it and then when they counter-questioned me whether I was 100% sure of the answer - I went into this state of self-doubt I cannot even explain.    \n5.If they ask a question and you have zero idea what the hell that thing is, you can say I dont know. OR if you know what it is by at least 10% of it, but don't know how to say it due to lack of accurate knowledge never say I dont know, instead you could say - \"I am still learning on X topic\", OR \"It is something that I am considering to learn\" OR \"I have not figured out what it is **YET**\". These just shows that you are willing to learn and shows some form of positive attitude.But on the other hand if you are comfortable telling honestly that \"You dont know X something\" that's is also fine. But I personally prefer the former.  \n6. At the end of the interview, they might ask you \"Do you have any questions for us ?\". Here are some questions that you can ask:    \n - \"How is it like working at X company?\"  \n - \"What will be some of the tech stacks which I will working on in the coming years\".  \n - \"What all learning opportunities will I receive\".  \n - \"What is the process like to go from an intern to being your  permanent developer?\" (this only applies if you are applying for an internship\".  \n - \"What would be some of the expectations from a junior developer like me?\"\n7. Last but not the least, end interview with this golden question. This is one of the questions which I really love to ask, because I believe that every human brain works well with a feedback system.Ask the interviewer: \"**Could you please give me any valuable feedback on how I performed. If so, could you also specify which areas I did not perform well. Also I would really appreciate if you recommend some resources or books that you think would help me increase my knowledge of X subject?**\"  \nIf I was the interviewer, I would 100% appreciate the effort that the person is putting to know more about a subject matter even though the person did not do well in an interview. I might also remember this purticular person well - because I had given him some form of advice.  \n\nWell, these are some of the pointers. At the end of the day, even if you didn't perform well - you will feel like you don't know anything or you'd feel like you are a dissapointment especially if you are a beginner like me. But the truth is, we all have a potential to learn and succeed in life. If not this interview, your lucky one will be your 5th interview, or your 20th interview. Never give up and keep learning and building projects!  \n\nI'm sure this list is not exhaustive,so if any one of you have any other lessons that you have gained after your first technical interview, please leave it in the comments as damn sure its gonna help other beginner programmers a lot. :)",
      "subreddit": "interviews",
      "score": 9,
      "url": "https://reddit.com/r/interviews/comments/l2pww7/i_just_failed_my_first_react_technical_interview/",
      "comments": [
        {
          "body": "Nice post. I had one interview when I was doing my “tell me about yourself” and the chief people office said “you’re inspiring me now” with a touched look lol and I was moved to to the next round on the spot.",
          "score": 3
        }
      ]
    }
  ]
}