{
  "company": "genentech",
  "post_count": 1,
  "exported_at": "2026-01-18T17:44:53.279Z",
  "posts": [
    {
      "title": "Take offer or wait?",
      "body": "Hi please help. \n3rd Year CS major at a good school for the major. Top 10-20 ish for CS?\n3.0 GPA with a few clubs/projects but nothing crazy. \nPrevious internship in a software role in a biotech lab\n\nI applied for around 30 or so internships, had a few interviews (Microsoft, HP, etc). Flat denied for about half of them, haven't heard from most of the rest, but I'm pretty sure I'm in the 'good candidate' pile for 3-4 good ones still.\n\nI just received a software eng. internship offer from a big biotech company (think Genentech or similar) that they said I have to accept in about two weeks. Pay is equivalent to about $32/hr with the housing stipends and everything.\nIf you're biotech or chem eng, it's supposed to be really hard to get an internship at this company, but I don't know how it ranks as a CS major. I'm also worried that I'll get a locked into biotech stuff if I do another internship in this field.\nI think I'd rather work somewhere more well known for software. I'm 90% sure IBM will request an interview soon, and I talked to an apple rep at a career event who liked me. I feel ok about 2-3 others.\nIf I don't get another offer before the biotech offer expires, should I just take it? I need to have something this summer, but I'd be annoyed if I get an offer at IBM or whatever in a month and can't accept it.\n\nCan anyone speak on how well regarded a biotech software internship like this is? Or just advice on whether I should take it or not? Have most positions at tech companies been filled already? Can I try to extend the deadline to accept the biotech offer or is that unprofessional?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/fg4q1i/take_offer_or_wait/",
      "comments": [
        {
          "body": "Having a few internships in a certain field isn't going to lock you into that field.",
          "score": 3
        },
        {
          "body": "I and probably 80% of this sub has never heard of Genentech and it's competitors so it more than likely ranks low in CS but an internship is an internship man, rank is irrelevant especially at the intern level",
          "score": 2
        },
        {
          "body": "Take the offer and if you get a better offer take that one instead.",
          "score": 2
        },
        {
          "body": "Email all of the recruiters and tell them you have a job offer. I would imagine most internships have been filled at this point but there are still a lot available. If you have to reneg then reneg but understand the consequences",
          "score": 1
        }
      ]
    }
  ]
}