{
  "company": "google",
  "post_count": 75,
  "exported_at": "2026-01-18T17:44:53.280Z",
  "posts": [
    {
      "title": "Recruiter mocked my unemployment and financial situation. How would you have handled this?",
      "body": "A few months ago I went through final round interviews and received a written offer with a deadline. But before that, the recruiter called me unexpectedly and pushed hard for a comp number.\n\nThe call included:\n* “You’re unemployed? What do you even do with your day?”\n* “You live in ____? I know it’s expensive there, and you’ve been unemployed for a while. You must be financially struggling.”\n* “Most companies wouldn’t even consider someone who’s been unemployed this long. You’re lucky we took a chance on you.”\n* “What, you won’t give a number first? Do you not know how to read a job description?” (The JD did not specify equity or bonus)\n\nI stayed calm and didn’t give a number. After the call, I requested to move communication to email.\nHe sent the offer. I responded with a standard counter (not aggressive). No reply for several days. I followed up and he gave dodgy non-answers, and pressed for more phone calls.\n\n**A few days later, the offer was silently rescinded.** No warning, no explanation. Still within the confirmed signing window.\n\nI’ve worked with assertive recruiters before. This wasn’t that. This was coercion followed by silent retaliation.\n\nJust sharing in case someone else runs into the same tactics.\n\nP.S. I googled my recruiter. Despite his “25 years of experience” he doesn’t have much of an online presence, but I found a Reddit thread complaining about him in /r/RecruitingHell…same MO.",
      "subreddit": "cscareerquestions",
      "score": 1916,
      "url": "https://reddit.com/r/cscareerquestions/comments/1mqzjgz/recruiter_mocked_my_unemployment_and_financial/",
      "comments": [
        {
          "body": "Name and shame",
          "score": 1435
        },
        {
          "body": "Name and shame",
          "score": 369
        },
        {
          "body": "Sounds like you dodged a bullet there. \n\n\nKeep searching for a good employer, your mental health is worth more than whatever that recruiter was offering. ",
          "score": 158
        }
      ]
    },
    {
      "title": "Am I only one who finds the Google interview process stupid?",
      "body": "There I said it.\n\nIf I can scream this from mountaintops, I will do that because I don't think anybody should go through this much of a waste of time for the sake of name recognition.\n\nI interviewed at Google three times for the same type of job (solution architect). They sourced me and reached out to me all three times, and I have not applied a single time on my own. And every time I got rejected. I wrote about my two previous experiences here:[ https://www.reddit.com/r/ITCareerQuestions/comments/9t291r/Google\\_recruiters\\_teasing\\_me/](https://www.reddit.com/r/ITCareerQuestions/comments/9t291r/google_recruiters_teasing_me/)\n\nThe third and last time, a recruiter reached out to me at the end of December, asking if I'd like to interview for the role of a solution architect (again). I said yes because I thought, why not. I love my current company, work, colleagues, and have a significant amount of options about to vest, but I thought I should take this opportunity and see where it would go. After speaking to the recruiter, I got an impromptu phone screening asking questions on compliance (the area I wanted to work on) and DB management. The questions I got were insanely trivial and can easily be looked up online if needed. Questions such as, do SQL DBs scale horizontally or vertically?, Does HIPPA allow you to store data outside of the US?, What are the types of NoSQL DBs?, What is the SQL command for editing data?, GDPR data storage requirements? Etc.\n\nFirst, I found this questionnaire incredibly condescending. It felt like I was taking a quiz in a high school or a college class. Second, I have no idea how this questionnaire measures the worth of any candidates. Regardless, I asked the questions, got most of them wrong, decided I probably won't move forward, and moved on with my life. Less than 30 minutes later, I got an email notification from the recruiter saying that I did great on the quiz, and I am moving on to the next step, which was onsite. As confused as was, I agreed, and we set up a date for the onsite.\n\nNow, the solution architect is a customer-facing role. Role related knowledge is necessary, but an understanding of how to work with customers is equally as important. Because at the end of the day, prospective customers do not just evaluate the product they want to buy but also the people they wish to partner with. And the people are any customer-facing role of the company. IAAS (Google Cloud Platform) is a significant commitment for a customer. If the customer-facing employees are unable to gain the trust and confidence of the customer to justify the investment they are making, it would not matter how in-depth the employee knowledge is on GCP.\n\nThe onsite interview experience I had was something out of a different decade. After working at multiple startup/growing companies going through different stages throughout my career, I was completely unaware that this type of interview process still exists, especially in a company that touts to be as modernized as Google.\n\nAgain, the interview was condescending and pointless. I was not able to measure a technical fit and culture fit for myself within my potential team, and I am assuming my interviewers felt the same way.\n\nGoogle cannot use the same Googleyness, cognitive ability, and role-related knowledge interview for every role, for every candidate coming from every background. By this point, they have to realize that using the same interview techniques/questions on someone who is just out of college and on someone with a decade of experience is not going to work.\n\n**Googleyness Interview**\n\nThis interview was the only one I found somewhat reasonable and enjoyable. I still don't think reading from a set of predefined questions, and writing down the answers is the best way to judge a candidate's culture fit. What happened to having a genuine conversation? Most of the questions that the interviewer asked me could have been incorporated into a structured discussion, which would have felt a lot more natural for myself and the interviewer. Instead, the interviewer read from a list of questions, and it felt frigid, calculated, and, most importantly, unnatural. In the end, Google should realize that the interviewers and candidates are both humans (as far as I know), and humans do not go around with a predefined list of questions to ask another human regularly (maybe they do at Google). If you are evaluating the so-called \"Googleyness,\" why are you doing that in the most unnatural way possible? Does \"Googleyness\" mean artificial and frigid?\n\nYou can train your interviewers on how to have a conversation with a candidate without hiding behind a question list. A conversation that is pleasant yet allows the interviewer to measure the culture fit.\n\n**Cognitive Ability Interview**\n\nThis type of interview should not be used for any candidate with more than five years of experience. You have our resumes, you know our professional experiences, you know companies we worked at, and the roles and responsibilities we held. After a certain point, you have to realize that our brains are functioning properly, and we have the necessary cognitive abilities.\n\nThe interview consisted of three very vague questions. When I asked for more info, the interviewer said the questions are obscure on purpose, so he doesn't have more info. Then commenced a 45 minute waste of time where I came up with solutions, and the interviewer hiding behind his computer jot down the answers. Again, no conversation. This interview kind of felt like sitting in the witness booth at a court trial.\n\nI find this type of interview very inauthentic as candidates will practice the answer criteria before the interview and create an answer to fit those criteria perfectly. The interviewer will write down the responses and see if they meet the criteria that were given to them before the interview. But in real life, problem-solving situations do not always fit into a perfect mold. We don't run to our list criteria and follow it step by step when a problem occurs (unless maybe for some technical problems). Depending on a lot of other factors, such as the type of situation, external dependencies, what is at stake, we would design a solution and iterate on it until it fixes the problem. Again, Google seems to forget that they are hiring humans, and humans are not programmable.\n\n**Role Related Knowledge**\n\nThis is the interview I had the biggest issue with. Not only did I find this interview insulting, but I was also concerned about how the solutions team interacts with customers if this is how they evaluate candidates for a customer-facing role.\n\nThis interview also showed the scrutiny and lack of confidence Google has towards its interview candidates. I understand that hiring a bad hire is more expensive than rejecting a good hire. But to hire a perfect candidate, it also requires a have a certain amount of trust in the candidate's ability to ramp up and onboard on the technical aspects of the product. And, if hiring bad candidates is so common, maybe you should rethink your interview process. I don't thee current process is even remotely qualified to vet out bad candidates.\n\nRole related knowledge tests for what you know about the Google product that you are working on. This means knowing every single thing about it enough to do deeper dives and build architectures using GCP. With this, you only hire candidates who know everything about the products that they will be working on, and you are going to have an insanely homogeneous group of people with no variety. Also, when seeking a new job, many people are not just looking for a new workplace with new pay; they are also looking to learn new technologies and concepts. Thirst for knowledge is one of the most significant factors for millennials to seek new employment. I assume Google is not the place for those.\n\n**Lastly, The Post-Interview Process**\n\nAfter waiting for a week, I got an email from a recruiter saying that they have an update on my candidacy and if I have some dates/times to chat. After giving her a few dates/times on the day of and the day after, she responded, saying she has no availability at those times and then scheduled a call for two days later. On the day of the call, we had a 5-minute conversation in which she informed me of the rejection.\n\nThis, to me, is unnecessarily cruel and a waste of time. I blocked off full 30minutes on my busy calendar to chat about something that the recruiter could have emailed me or left a voice mail if she wanted to be extra courteous.\n\nIn my opinion, many people go through negative experiences with Google, but the number of hopeful candidates in the workforce excitedly waiting to join Google suppresses those negative experiences. Google is a large company, but does it deserve the prestige and wroth we allocate to it, I don't think so. Do we deserve to go through ridiculous interview experiences, I don't think so. Are there other companies with lesser name recognition, not as big, but are absolutely amazing to work at, a hundred percent!\n\nTo me, the Google interview process is deluded. It thinks it is a trailblazer setting standards for all the other tech companies, but in reality, it is stuck in the previous decade. Let's not waste anymore of our time with this nonsense until they make a substantial change.\n\nI hope this does not come off as sour grapes.",
      "subreddit": "cscareerquestions",
      "score": 260,
      "url": "https://reddit.com/r/cscareerquestions/comments/ezxfp8/am_i_only_one_who_finds_the_google_interview/",
      "comments": [
        {
          "body": "If half the company outside silicon valley pay as good as google, then we wouldn't have this problem.\n\nGetting into google is a straight ticket to upper middle  class, so competition is high which allow them to justify this interview process.",
          "score": 114
        },
        {
          "body": "[deleted]",
          "score": 111
        },
        {
          "body": "&gt; Cognitive Ability Interview\n\n&gt; This type of interview should not be used for any candidate with more than five years of experience. You have our resumes, you know our professional experiences, you know companies we worked at, and the roles and responsibilities we held. After a certain point, you have to realize that our brains are functioning properly, and we have the necessary cognitive abilities.  \n  \nI strongly disagree with this assessment.   I wish every company had some level of cognitive assessment.   \n  \nI have worked with some people who have superstar resumes, and are complete morons.   Just lucky enough to get into right schools, which then lead to lots of work opportunities on paper they clearly would have failed at.  \n  \nI have worked with people who have terrible documented experience who are hard working geniuses.",
          "score": 57
        },
        {
          "body": "Same, but I interviewed 6 or 7 times, I've lost count.",
          "score": 12
        },
        {
          "body": "[deleted]",
          "score": 12
        },
        {
          "body": "&gt; Also, when seeking a new job, many people are not just looking for a new workplace with new pay; they are also looking to learn new technologies and concepts. Thirst for knowledge is one of the most significant factors for millennials to seek new employment. I assume Google is not the place for those.\n\nI think you made a really good point here, and its something I've been feeling myself recently going through interviews with companies in the bay area. So many companies tout that their core values include \"continuous learning\", \"learn from each other\" etc etc but those same companies are the first to reject you when you indicate that you might not know something or don't propose a perfect solution to their problem the first time. It *is* frustrating especially given that learning new things is one of the main things I and many others look for when considering a new role, but I guess these companies get so many applicants they have no choice but to reject candidates in this way.",
          "score": 33
        },
        {
          "body": "When this sub talks about the \"Google interview process\", they are talking about a recruiter screen, one or two phone interviews, then 4-5 DS&amp;A questions onsite, plus or minus a Googleyness and/or system design interview.\n\nYou are critiquing something entirely different and, while it is technically a Google interview process, it is an extremely misleading title to give to this topic on /r/cscareerquestions. As far as I can tell, non-SWE interviews are basically pot luck. So, unlucky you ¯\\\\\\_(ツ)_/¯",
          "score": 19
        },
        {
          "body": "lmao this thread is full of google bootlickers",
          "score": 129
        }
      ]
    },
    {
      "title": "The DEFINITIVE way on how to LeetCode properly. (Hint: You are most likely doing it wrong!)",
      "body": "Will keep it short and simple.\n\nI'm a new grad, and I received several offers from top companies and well known unicorns / startups.\n\nHow did I do it? Leetcode.\n\nThat's the name of the game currently. If you can do Leetcode, you WILL get a top offer from a top company. Thats all there is to it.\n\n**Here is how to properly leetcode:**\n\nDO NOT attempt to solve any questions on your own (YET!). Yes, you heard me right. I know I sound crazy. But solving ANYTHING on your own is a complete and utter waste of time. Don't even spend 5 minutes on a problem. You do not have the base knowledge yet. You will simply be getting frustrated, and spinning your wheels.\n\nSo, what do you do? simple.\n\n1. Go to grokking the coding interview (no DONT buy it. Waste of money) and look at their list of patterns.\n2. Pick one pattern, and go to leetcode. Search for problems with that pattern.\n3. Go through each problem for the pattern, and go STRAIGHT to the solution. Do not even spend 1 second trying to solve the problem. WASTE OF TIME.\n4. Understand the solution DEEPLY. Make notes. Google things you don't understand. Watch videos on youtube about the solution. Go to the discussion section on leetcode and see what others came up with. Play around with the solution, modify variables, etc. Basically... UNDERSTAND THE SOLUTION AS DEEPLY AS YOU CAN\n5. Move on to the next problem, and repeat.\n6. After you have done this for enough problems, you will feel a lightbulb going off in your head. Congrats, now you know how to solve this pattern!\n7. Go back and pick a new pattern, and do the same thing.\n\nBecause you aren't wasting time spending hours on a problem, in just 1-3 weeks, you will have a deep understanding of all the major patterns and common solutions to these patterns. You will be able to recognize how to break down a problem into specific patterns, etc.\n\nOnce you have done 300-400 problems like this (it sounds like a lot, but remember.. you are NOT wasting hours per problem trying to solve it.. so you will go through A LOT of problems in a short amount of time.. the key is NOT to memorize, but to UNDERSTAND THE PATTERNS), you can start going through company specific questions on leetcode by buying premium. You will notice you can solve them now on your own!\n\nCongrats, you just saved yourself months and months of headache and frustration.",
      "subreddit": "cscareerquestions",
      "score": 7456,
      "url": "https://reddit.com/r/cscareerquestions/comments/sgktuv/the_definitive_way_on_how_to_leetcode_properly/",
      "comments": [
        {
          "body": "&gt; You will notice you can solve them now on your own!\n\nThere is not a single step anywhere above this line that actually suggests writing code. Implementing solutions.\n\nNo matter how well you recognize patterns, you will most certainly not write elegant and correct solutions unless you practice just doing that. At best, you'll have a bunch of off-by-one errors, at worst your code won't even flow correctly at all. This sub is full of people who swear \"I understand algorithms, I just can't write them well\"... and your advice is only going to create more of those.\n\nI agree at a high level that trying to solve problems on your own can be a waste of time. But after reading the solution to a specific problem, you should revisit that same problem in a few weeks and see if you can then solve it (and ***implement*** that solution with code) on your own.",
          "score": 691
        },
        {
          "body": "A lot of leetcode advice and not a lot of interview advice.\n\nMost of the guys coming out of a CS degree can do the work. Just have fun, relax, and be a decent person.",
          "score": 136
        },
        {
          "body": "I definitely second this approach. I really only started LeetCoding seriously around November 2021 because up to that point I didn't think I wanted to do SWE, so I only had a few months to practice before I started getting online assessments and interviews. I failed plenty of them but managed to snag an internship at a FAANG company pretty much purely by watching Neetcode on YouTube go through all of the Blind 75 questions! Literally just reading a problem, thinking about how hard it was and how I had no clue how to do it, and then following along with what Neetcode did. \n\nMost of these algorithm/data structure questions have a specific trick behind them that a beginner LeetCoder is very unlikely to discern on their own. If you had all the time in the world, then I suppose you could spend your time trying to come up with your own solutions and developing the intuition naturally, but it was much faster for me to have the problems explained in an easy way so that I could eventually start to recognize some of the patterns across questions. I think the key part is taking the time to pause the video and actually understand the solution, especially before they even go into the code.\n\nOf course, different people have different learning styles/preferences so I'll include the obligatory caveat that this is only what worked for me, but I really do feel like it saved me a lot of time and frustration.",
          "score": 128
        },
        {
          "body": "[deleted]",
          "score": 800
        },
        {
          "body": "I work in Europe and never had to do leetcode. Sometimes companies ask me to do some coding stuff in some colab environment, and its always some stupid algorithmic problem from university. Its a hilariously stupid proxy for measuring a developers quality.  You get a bunch of people who solves hundreds of algorithmic problems but cant fucking properly encapsulate or write nice clean code. I don't know if you have any other options but personally I don't want to work in a company that thinks this is how you recruit good people. You're running the risk of just working with mediocre people because they have been selected through that dumb process.",
          "score": 56
        }
      ]
    },
    {
      "title": "My experience with interviews at Microsoft, Google and AT&amp;T this past week.",
      "body": "Last week I made a [post](http://www.reddit.com/r/cscareerquestions/comments/2lqlo9/6_hours_till_the_flight_starting_a_week_full_of/) saying that I had three interviews in one week with Microsoft, Google and AT&amp;T.  I wanted to post an update with what happened and my experiences with each one.  All interviews except google were for internships.\n\n**Microsoft**\n\nThis was the first interview of the week.  I flew in Sunday morning and got to the hotel later on at night.  Microsoft paid for the rental car up front so I didn't have to pay anything.  At the hotel food was already paid for by them also so I just ordered from the hotel.  The next morning I had to be in the main recruiting office by 8AM (there was probably 50 people there).  From there you can grab some free snacks and drinks and was able to play some video games while we waited for our recruiters.  The recruiter I talked to was really awesome and for only knowing about me for a day he did quite a bit of research and knew quite a bit about me.  He spent about 10 minutes talking about what happens during the interview process and how lunch is going to work out.  Then for the next 10-15 minutes we kind of talked about Seattle and what he thought about living here then moved onto talking sports.  This time was really to make sure you were calm and confident prior to the interviews.\n\nFor the interviews, there were 5 interviews (2 before lunch, 2 after lunch and the lunch interview).  On a side note, if you get walked out after lunch, it's over.  This was about the time that you heard which team you're interviewing for; I interviewed for the Bing Maps team.  Each of these were about an hour apiece, although some went longer when the interviewers really got interested in my work.  Each interview had about 2 problems which, if you know the cracking the coding interview, you shouldn't have many problems answering.  Talking through the problems and asking questions to keep your interviewer involved was the big thing.  When you started asking questions they seemed to be more interested.  For the lunch interview, you talk to the recruiter for a while and ask questions that you want answered.  We went over my thesis work and why I picked what I did.  After you're both done eating then you'll officially start the 3rd interview.\n\nAfter the interviews were done, my recruiter and I met back in the recruiting building and discussed what I thought about Microsoft and if I had any other companies I'm interviewing for (I was honest here).  After that they ask you to fill out a survey and give you free taxi vouchers and vouchers for shows and free food.  You're also able to shop at the Microsoft employee store before you leave.  The next morning I flew out from Seattle into San Jose Airport for the Google interviews.  When I landed, less than 12 hours from my last interview, I had about 3 missed calls from my recruiter.  When I was able to call him back he said congratulations and gave me an offer for the summer internship.  After that we discussed the compensation and how the summer internship was going to work.  This interview gave me a whole different view of how Microsoft worked and surprised me a little bit.\n\n**Google**\n\nGoogle was similar to Microsoft when it came to car rentals and the hotel.  Since I got my ticket so late I had to stay in San Francisco instead of near Mountain View.  The food wasn't actually pre-paid this time so I had to buy dinner out of my own pocket but they're refunding me for it.  The next morning the interviews actually started at 10:30 vs 8 at Microsoft.  On the exit to Mountain View, I saw a best buy and thought that it must be the least technical thing for the next 5 miles.  I still got in around 8 to meet up with a friend of mine and have breakfast at Google.  I found it amazing that there was free food and coffee, but also a bowling alley in the building.  At 10:30, I met with my recruiter talked about the processes.  This was pretty similar to Microsoft.  The exception was that lunch was not an official interview.  So I only had 4 45 min - 1 hour interviews, and talked to a software engineer during lunch about their experience at Google.  She also explained that I wouldn't be interviewing for a team but that would be picked later if I were to get an offer.\n\nDuring the first interview I realized that this was going to be very difficult.  All of Microsofts interviews combined didn't equal the difficulty of this one interview.  Only the 2nd interview was I able to finish 2 problems.  Everyone else I only got through 1 question.  For lunch we actually just walked around campus till we found a place that looked good.  All of this was free (as opposed to the Microsoft food), and the engineer I was talking to complained about how much weight he put on having free food :).  When it was over with I kind of figured that it was over, I didn't feel the same like I did after the Microsoft interviews.  So I emailed my recruiters and thanked them for their time and the opportunity to interview for Google, then I figured it was over...  or so I thought.  It wasn't till Friday that I got an email from the recruiter saying that all the feedback was great and that she was submitting a package for the hiring committee and asked if I wanted a couple of professors to submit a LOR on my behalf.  So Tuesday I should get a response back from the hiring committee on if I'll move forward or not and will update this when it happens.  (On a side note, Google couldn't offer any internships and interviewed me full time).\n\nP.S. When I filled up the gas tank on the rental car, prior to returning it, somehow the pump stopped at exactly 2.2222 gallons for $7.77.\n\n**AT&amp;T**\n\nI flew home from Google on Wednesday Night and got back around 1AM.  I drove home took a quick shower and drove to the nearest regional airport and got on another plane to fly down to Dallas for AT&amp;T experience weekend/interviews.  In all I was only home for about an hour (at this point I'm very tired in the week).  AT&amp;T really made this weekend a fun experience but official at the same time.  This was the first time I dressed up all week (jeans and a t-shirt for other interviews).  After getting into the airport a limo company met all the people at the airport and drove us back to the hotel individually (all 100 of us).  That night we had a presentation from one of the higher up execs and was served a full 3 course meal while talking with some execs about working at AT&amp;T.  This meal is going to make the next month or two of food in my apartment taste really bad :(... \n\nThe next morning we were up at 6:30AM after breakfast toured the main AT&amp;T HQ and visited places like their Social Networking room where they were able to see problems occur in real time.  i.e. when they mentioned not installing fiber in 100's of cities across the country, they were able to see the whole country hate them in real time.  From here we did a tour of Perot Museum and American Airlines Stadium to show how they managed to installed all of their antenna's without anyone every seeing that the antennas were ever there.  It was kind of neat to see the custom antenna's built for hard to reach places.  We finished the tours with the Foundry tour and saw all the cool neat devices that were coming out of that place.  After that we went back to the hotel and had a mini-hackathon (without coding).  The idea was to come up with the next best thing based on specific things.  There was extra credit for doing an \"It Can Wait\" project.  Everyone based their idea around the smart car except for us.  I basically confused everyone by bringing up the idea to use torrenting and seeding to speed up data transfer to create the new 5G service.  (This was an idea I read a while back from a journal article published out of California).  Needless to say everyone was confused and we didn't win :).  That night they had a dinner again (with food that makes me cry thinking about how I have to go back to my apartments fridge) and thanked us for coming out.  They finished the dinner giving everyone free beats HD headphones.  (Thanks for the Christmas Gift AT&amp;T, it's going to make someone in my family pretty happy)  We finished that night with free ice cream and a sober style college party with video games we could play.  This gave us the opportunity to network with some of the AT&amp;T staff.\n\nThe next day we had a thank you breakfast prior to the interviews and everyone had the chance to get a professional photo taken for linkedin.  The interviews were weird, we had everything in the hotel and the internship interview was only 25 minutes long.  They asked 3 behavioral question (actually this was the first behavioral question I saw all week) and 1 technical question (very very easy).  After that you got an answer within 10 minutes of leaving the room.  I heard the full time position was the same except for 2 interviews.  Surprisingly I got a no from this interview.  As we finished our interviews they gave us togo lunches and shuttled us back to the airport.  This was a cool little trip down to Dallas.  They want to do it again, if you see the chance to do it I recommend taking it.\n\nAll in all I had a great week and have a lot of stuff to catch up on.\n\nTL;DR: Had a deadline, Microsoft and Google scheduled within the same week (AT&amp;T was already scheduled months ago).  Microsoft said yes, Google is submitting a package to the hiring committee and AT&amp;T said no.\n\n**Edit**\n\nSeveral people asked for my [resume](https://drive.google.com/file/d/0Bw5xOYir6RdnTnV5b2ZGR0lHa2s/view).\n\nI completely agree with this guys [recent post](http://www.reddit.com/r/cscareerquestions/comments/2mj2uy/amazon_and_microsoft_how_i_studied/) for interview prep.\n\n**Edit 2**\n\nI just got an offer from Google.",
      "subreddit": "cscareerquestions",
      "score": 275,
      "url": "https://reddit.com/r/cscareerquestions/comments/2mide2/my_experience_with_interviews_at_microsoft_google/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 83
        },
        {
          "body": "Great job man! Could you please expand on Microsoft knowing \"quite a bit\" about you? Did the recruiters go through your online footprint? Should I be watching what I post online/on social networks when I apply for CS jobs? Thank you! ",
          "score": 16
        },
        {
          "body": "Very interesting and insightful write-up, I appreciate the update. \n\nI can't help myself trying to \"read between the lines\" so to speak, do you have any more insight into the 'feel' of each place? Like any interesting observations or 'non-interview process' things you noticed? or even just about each city/location? or compensation if you feel like it.\n\nI'd be particularly interested in Microsoft, I dunno, you just hear so many tales of these offices it makes you wonder whether its all sparkles and sunshine. You seem to have an honest 'matter of fact' air about your write-up. Anyway, no worries if you don't feel like taking any more time!",
          "score": 22
        }
      ]
    },
    {
      "title": "You study for 12-16 hours a day for 6-12 months and finally land a job, only for you to get placed on a PIP, laid off, or fired in about a year. This career is so broken beyond belief.",
      "body": "*\"Any job that requires you to study for 6 months just to have a chance of getting through the interview is not worth it.\"*\n\nI heard the above quote a while back, but I cannot find the source. The \"you\" in it refers to an individual who has the credentials and experience, and can demonstrate that they can code. The absurd thing is that these type of individuals still need to study for months to crack an interview.\n\nDuring the course of my unemployment, one thing that I keep hearing from those around me is that I should keep applying, but I should also enjoy my newfound free time. Most of the people telling me this are in the health care field, mainly nurses, and that's when it hit me, the difference between this career and virtually all other careers. I have no free time, none at all. I'm not making any money currently, but all my time is occupied, I am working more than I would be even if I was in a job. What am I doing? I'm studying or \"grinding\" as those in this career refer to it as. However, when virtually any other career-possessing individual is on the job hunt, they are able to just apply and go on with their life in the meantime. I keep getting asked \"what and why are you studying?\"\n\nYes, I can always pick up a low-wage job, fast food or the like, and none of that is beneath me, I have a mortgage and I will do whatever I can to ensure that my home is not seized, and people in other careers often can do that as well, but in the software engineering job hunt, doing that is a detriment to finding another software engineering position, because it severely limits the amount of hours you can put into studying algorithms, leetcode, system design, frameworks, or the like. All of my friends and family are in the health care field, and with overtime and holiday pay they made far more than I ever did, and they never had to open any nursing book again after graduating from their respective nursing programs, and their interviews were all one a done, a couple minutes just to see your personality. And if they ever want to switch jobs, they can do so or even pick up a second one in a matter of days, no preparation needed.\n\nWhen I think about how the average Google employee quits in about a year, the idea of spending 6 months studying full-time just to have a chance of passing the interview (which you still might fail) seems all the more insane.\n\nAlthough I do not regret studying computer science, I admit that becoming a software engineer was the wrong choice, but hindsight is 2020.",
      "subreddit": "cscareerquestions",
      "score": 1078,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ggp3hy/you_study_for_1216_hours_a_day_for_612_months_and/",
      "comments": [
        {
          "body": "Nursing sounds great until you're expected to clean up body fluids.",
          "score": 833
        },
        {
          "body": "Complaining about long hours and then comparing cs to nursing is hilarious",
          "score": 609
        },
        {
          "body": "This sub is a cesspit. The vast majority of people do not spend 6 months grinding for a single interview. ",
          "score": 1034
        },
        {
          "body": "In fairness, if someone has only been coding for a year, regardless of how much they've studied, they're probably going to suck at it. It takes years of writing terrible code before it becomes intuitive to usually not keep doing that for projects of any significant size. And many people with even several years of experience are still mediocre at best. \n\n\nMeanwhile, while it's easy to tell if you are a terrible coder, it's not easy to tell if you are a solid one without hiring you and giving you a trial run. That's expensive and pulls down the productivity of the whole team as they get you up to speed, mentor you, and work around your mistakes. So, these tests are deliberately very hard in order to filter out the hordes of incompetent applicants, missing out on some good ones in the process but reducing the number that waste everyone's time and the company's money.\n\n\nAnd there are so many bad applicants. Being on the hiring side, it can feel like it's a 100:1, especially if you're not looking to offer a FAANG salary. FAANG overpaid people while the economy was hot, so that other companies mostly got poor applicants. Now they're all laid off and looking to be hired, but meanwhile their salary expectations are far higher than the value they actually deliver.",
          "score": 84
        }
      ]
    },
    {
      "title": "I interviewed at Google, Facebook, Amazon, Microsoft, LinkedIn, Salesforce, Uber the past 3 months.",
      "body": "Made it to final rounds for almost all of them except Uber and LinkedIn. \n\nI didnt get any offer.\n\nI am broken and bitter.\n\nI'm immigrant with accent and suspect managers being racist to disqualify me...using team fit as reason.(I don't have any evidence of this..it's my gut feeling.) (I'm not from the common tech immigrant country)\n\nNow, dealing with stress, stress induced gastritis/boarder line ulcer.\n\nI thought I would share to let my anger out.\nI will delete if it's not the place.",
      "subreddit": "jobs",
      "score": 429,
      "url": "https://reddit.com/r/jobs/comments/qgq5yq/i_interviewed_at_google_facebook_amazon_microsoft/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "While not impossible that it’s racial bias…. I’d be very surprised bc those tech giants are filled with immigrants and H1B workers. That said you mentioned you’re not from a “common” country so it could be bias against that group. \n\nHonestly though, and this is coming from a POC, if you got that many interviews at top companies and NO offers at all you probably need to look at your interview skills tbh.",
          "score": 342
        },
        {
          "body": "Everyone wants to work for those companies and the competition is fierce. Just because you didn‘t get a job offer it doesn‘t mean that it was due to racism. More like that they found someone better qualified. I doubt it‘s racism because those companies are full of foreigners from India, China, Japan, Latin America, etc.. Don‘t get discouraged and keep trying. Millions of people would kill to have the opportunities you are getting. Also, try applying to other great companies that are not FAANG like Shopify, Nvidia, HubSpot, DocuSign, Adobe, Red Hat, Atlassian, Splunk, Citrix, Twilio, SAP, Zoom, VMWare, PayPal, Stripe, Zscaler, Intuit, IBM, etc.. With your skillset the tech world is your oyster my friend!",
          "score": 151
        },
        {
          "body": "Even Google engineers will say they didn’t get accepted till the 7th, 8th, 10th time they applied (https://twitter.com/ericjiang97/status/1316574495449116672?s=20)\n\nTech hiring is broken, and the hiring process is more theatre than evaluation. But those large companies you listed especially have their own head so far up their butt their interview processes are the weirdest in the industry and they won’t change them anytime soon. Treat it as a game to master more than what you think an interview should be. And “play” it at least 10 times per company.",
          "score": 39
        },
        {
          "body": "OP, not to jump the gun and attribute your suffering to racism or accent. But by any chance can you request for feedback from recruiter/hiring manager? Friend had similar experience....basically by the end of day long interview he was drained and seem to have shown up as snarky. But afaik none of these companies share feedback. But never lose hope",
          "score": 150
        },
        {
          "body": "All of these are international companies with staff that speak multiple languages. Why are you feeling that was racism? You are naming some of the top companies in the world where thousands of people are applying to each position. The fact that you made it to the final round means you are qualified. Team fit isn’t code for racism, it could be code for that the person they picked has literally already worked here or may has worked with that team from another company, or thousands of other things. You should train on your interview skills.",
          "score": 20
        },
        {
          "body": "So the problem isn't your resume, it's your interviewing skills. Take some interview training courses to improve your interviewing abilities.",
          "score": 102
        },
        {
          "body": "If it was racism you would not been able to get to the final round they would have discarded you at the very beginning",
          "score": 124
        }
      ]
    },
    {
      "title": "I'm an ex-recruiter for some of the top companies in the world. I've screened tens of thousands of resumes, and today I published my preferred resume format, free to download as a Word doc, along with some general resume advice.",
      "body": "**August 2025 edit:** As always, for those searching for resume help, you can download my famous [**free resume template**](https://sheetsresume.com/resume-template) used by millions, or hit the easy button with my [AI resume builder](https://sheetsresume.com).\n\nAfter over 7 years (wow!), new comments on this post are finally locked, so please ask me any further resume / job hunt questions as a new post on my personal [resume help subreddit](https://reddit.com/r/SheetsResume), on the official [/r/jobs discord](https://discord.gg/4nJztvj), via PM, or on [LinkedIn](https://linkedin.com/in/colindmcintosh) (mention Reddit!). I know it's a bloodbath out there in the job market right now, so if I can do anything to help, please let me know. Good luck and take care!\n\n\\---\n\n**August 2024 edit:** every 2 years like clockwork! OP here, checking in once again for my \"I have something new and useful for readers of this thread\" 2-year update. I am proud to share that I have just released an [AI resume builder](https://sheetsresume.com) (trained by yours truly), a passion project I've been putting together on nights and weekends to complement my classic and continually mega popular [free resume template](https://sheetsresume.com/resume-template) used by millions of people around the world.\n\nMy AI Builder doesn't require you to format your resume yourself (saves a ton of time and extra helpful for people without MS Word), and you can start from scratch, upload an existing resume, or pull from your LinkedIn. The AI will also edit your content in live time for you based on my advice and training (and *not* based on that awful overly formal AI writing style everyone hates), and give you multiple suggestions to choose from for better phrasing for each bullet point. It'll also automatically fix a ton of common problems: trimming long bullet points to one line, fitting 2+ page resumes onto one page (and suggesting which less-relevant content to cut), and small stuff like autocorrecting typos. I'm really happy with how this came out. Good luck to everyone currently on a job hunt, and I hope my new [resume builder](https://sheetsresume.com/builder) helps you!\n\n\\---\n\n**December 2022 edit:** OP (Colin) here. By popular demand, I made a [Google Doc version of my resume template](https://docs.google.com/document/d/1g9MENC2JddIErJgjtEf0M8fbC-C2jDfN) for people without MS Word. As layoffs mount (yet again), I also wanted to highlight [Part 2 of this post](https://www.reddit.com/r/jobs/comments/8hs6xc/part_deux_of_the_top_post_of_all_time_on_rjobs_im/) (my 10 best job hunting FAQs / advice), which I've further built out into dozens of [Resume Advice](https://sheetsresume.com/advice) and [FAQ](https://sheetsresume.com/faq) articles in my spare time.\n\nI can't believe it's been almost *5 years* since I wrote this! My free [resume template](https://sheetsresume.com/resume-template) has now been downloaded millions of times, and tens of thousands of people have messaged me to let me know it helped them find jobs and change career trajectories, which I'm just so so happy about. I've somehow found the spare time (usually before bed!) to answer thousands of resume questions, and I'm so glad I can continue to utilize my past experience as a recruiter like this. If you have questions, I still try to answer PMs and new comments as often as I can, and feel free to connect with me on [LinkedIn](https://www.linkedin.com/in/colindmcintosh) (mention Reddit!). Happy holidays, and see you again in 2 years when I inevitably make another edit! Much love to you all.\n\n\\---\n\n**April 5, 2020 edit:** I've been getting more PMs and messages about this post lately, possibly due to the historic layoffs in the US due to COVID–19. Whether or not that's the case for you, I sincerely hope this resume format helps you find a better job than you had going into this mess. I'm going to do my best to answer all the PMs that come in re: job hunting during April as people face this crisis. (Please at least reformat your resume into my tried-and-true [resume template](https://sheetsresume.com/resume-template) before asking me for a critique.) All my best to you and yours, and I hope you're all staying safe out there.\n\n\\---\n\n# Original Post, Feb. 2018:\n\nThere was a recent post on Reddit where someone was lamenting that they had sent out dozens of applications, but hadn't heard back from anyone. I commented and told them they probably had a bad resume format and to PM me with it so I could review it for them, and about 50 other redditors ended up sending me their resumes to review. I don't have time to do all of them, so I decided to write this post and share a downloadable [resume template (available in both Google Docs and MS Word)](https://sheetsresume.com/resume-template) in the hope that it fulfills my personal obligations.\n\nI'll keep it short and sweet, and hopefully many of you find this useful.\n\n*Note: I'm a former Fortune 100 recruiter, which is why I know so much about hiring.*\n\n**General resume advice:**\n\n* Use a professional-looking gmail, outlook, or personal domain email address. Delete your hotmail with extreme prejudice.\n* Don't put an objective section or summary. It'll be skipped, and it's space that can be used better.\n* Unless you have 20+ years' experience, make it 1 page. You can do it.\n* Don't put your full address. \"City, State\" is enough.\n* Name your resume \"FirstName LastName Resume\" and that's it. Never submit it with \"(Project Management)\" or \"Final\" or \"2018\" or literally anything else in the file name.\n* If emailing your resume, always submit it as a PDF, never as a Word doc. You never know how wonky a Word doc will look on someone else's machine. If uploading to an online application that uses resume parsing software, you can upload the Word doc as well or if it's required to do so.\n* Try to read it in 10 seconds or less and see what you take away from it. That's about the initial screen time before someone makes an initial up/down decision, so you'll want to examine it from that perspective.\n* Interests are important because it gives the interviewer something to connect with you on, and it makes you more than just a faceless resume. If you put *Seinfeld*, I promise someone will ask you what your favorite episode of *Seinfeld* is (mine's the Puffy Shirt).\n\nThat's the most important stuff. [Here's that resume template download link again](https://sheetsresume.com/resume-template). If you have more questions about job hunting, resumes, or career advice in general, just PM me and I'll try to get back to you before long.\n\n**Edit:** damn, thanks for the gold! Super glad this advice is helping so many people; the comments have totally made my day.\n\n**Edit 2:** out and about so trying to respond to everyone on mobile, but it's slow going. I'll get back to all questions in comments asap.\n\n**Edit 3:** my inbox is ruined, but having a blast helping everyone with their specific questions. Keep firing away.\n\n**Sunday edit:** coming on 24 hours and the questions are still rolling in! I'm slammed today, I'll jump back in when I can later. Lots of PMs to sort through too!\n\n**Monday night edit:** still answering PMs and comments :)! Hit me up anytime with your job hunting questions.\n\n**Wednesday edit:** over the last few days, I've responded to probably 500+ combined questions in the comments and PMs. PMs still rolling in. I think I'm going to make a \"resume and job hunting FAQ\" post based on these questions!\n\n**02/27/2018 edit:** PMs and comments still coming in, and I'm not even kidding when I say that I've had at least 10 people message me telling me they've gotten a slew of interviews since they switched their format, and two people have now told me they found jobs after switching to this format in the week and a half since I posted this. Unbelievable, makes me so happy.\n\n**03/28/18 edit:** Still owe a couple dozen more PM responses, bear with me. Also just got a few more messages from people describing how they found a job after switching to this template! Makes my day every time I get that message.\n\n**04/30/2018 edit:** I'll be posting something soon that answers all the resume and job hunting FAQs I've gotten from about 1,000 PMs! Have tried to help everyone, but my apologies if I haven't had time to get back to your particular message / question. Will link it here in one last edit when it's live on this sub!\n\n**05.07.2018 edit:** [Part Deux is live! Click here for resume FAQs and job hunting advice.](https://www.reddit.com/r/jobs/comments/8hs6xc/part_deux_of_the_top_post_of_all_time_on_rjobs_im/)\n\n**05/19/2018 edit:** ~~About 10~~ ~~20~~ ~~dozens~~ ~~hundreds~~ thousands of people have now messaged me saying they've gotten a job thanks to this post after previously spending months looking to no avail. Can't describe how happy that makes me.\n\n**07/03/2018 edit:** I'm sorry if I don't respond to your PM; it's just too much volume to handle. I've tried to help as many people as I can, and I'll respond to PMs as often as I can!\n\n\\---\n\nIf you have more questions, please see [this follow-up thread with FAQs](https://www.reddit.com/r/jobs/comments/8hs6xc/part_deux_of_the_top_post_of_all_time_on_rjobs_im/) I did, or my huge off-Reddit repository of [resume templates, builder, advice, FAQs, guides, and other tools](https://sheetsresume.com) I maintain as a passion project. Good luck everyone!\n\n\\- Colin",
      "subreddit": "jobs",
      "score": 17580,
      "url": "https://reddit.com/r/jobs/comments/7y8k6p/im_an_exrecruiter_for_some_of_the_top_companies/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "This is the first time I’ve seen a professional recommend putting personal interests on a resume. Seeing as how I’m going on a couple years with no offers, I suppose I have nothing to lose by trying it out.",
          "score": 910
        },
        {
          "body": "You are a saint. I've been feeling very down lately about job hunting and didn't really know how to go about improving my resume. Thank you so much!",
          "score": 164
        },
        {
          "body": "How big are cover letters?\n\nI always thought it was funny how people say that managers will look at a resume for like you said ten seconds but get I'm supposed to think they will read a few paragraphs?  Maybe cover letters are more a second stage document after you've passes the resume test?  Thoughts?",
          "score": 288
        },
        {
          "body": "This is almost my exact resume format, down to the black lines, font, bolding of the name, “work experience” in small caps, dates on the right, and email address in the top right corner. I’m slightly weirded out. ",
          "score": 83
        },
        {
          "body": "this is absolutely fantastic advice.  most of these tips i already use, but the others are some i hadn't thought of.  old dog, new tricks, and all that rot.  (particularly the bit about ditch the summary. i ditched the objective about 15 years ago, but have until now included a 'professional summary' in its place.  i'm not convinced it's not necessary, particularly in my field, but i'm guessing you know more about this than i do and am as such content to rely on your judgment.)\n\none question - how far back should one go in their employment history?  in my case, my first grownup job was one in which i developed extremely powerful skills, and it's THAT job that has impressed all interviewers (literally, they all mention it), so i'm loathe to leave it off (especially since some of the skills developed there i never used again, at least in the daily grind that would be included on a resume), but at this point, it's... old.  like, 95-98 old.  i know i should leave it off, since it's ancient (and indicates me as likewise ancient), but those skills tho.\n\nand even though i could gratefully get rid of the one after (1998-2004), that's the one that though my duties there are useless to my current profession, shows the longest stick-to-itiveness.  \n\nso i can't remove one without removing the other (unless i want to explain a seven year gap), but the older one remains relevant to my current field.\n\nthoughts?",
          "score": 60
        }
      ]
    },
    {
      "title": "I FREAKING DID IT!!",
      "body": "I'm so excited guys. After over 200 applications , 20+ interviews, and a lot of almost giving up, I GOT A OFFER WITH MY DREAM AEROSPACE COMPANY. Crazy thing is... I didn't even have to do a dumb \"code this\" technical interview. I get 60K starting off! with a bonus!! That's amazing starting off in the South. Crazy thing is someone who works there , while I was doing a internship, told me they wouldn't hire a black man straight out of college. I'm glad I kept trying. Shoutout to r/cscareerquestions for all the help in this process.\n\nEdit: Thank you all for the kind support! It means a lot to me. Just to clear up a few things. I graduate with a Bachelors in CS in a few weeks so I'm not self taught. To address the lack of diversity in STEM, do your research. The data is out there, the accounts of what people go through are out there. Educate yourselves and fix the problem. Most of our jobs is googling so you can do it haha.\n\nEdit 2 : Since people are asking, I'll go into a little bit of my background. I am graduating with a Bachelors in Computer Science W/ a minor in Mathematics in a few weeks. I have had a internship every summer of my undergrad which includes two summers at a really famous science institute and 1 at a REALLY famous space company. During my time at both companies and in undergrad, I built up a crazy professional network of people I could rely on for information and some for a recommendation. A awesome woman at said space company, recommended me to her friend on another team and I got the interview then the job. So what else did I do in terms of the crazy amount of interviews and applications? I did some Hackerrank, Leetcode, and messaging recruiters on LinkedIn which helped me get interviews. Polishing my LinkedIn helped me get way more traffic and I got a Google interview doing so. I also used organizations like NSBE &amp; ACM to help me get interviews at conferences or find resources. My resume also went through numerous changes over the span of my applying to jobs (August - Now). In terms of job sites, I used everything. LinkedIn, USAJobs, Handshake, Hired.com, Indeed, Seen, etc.",
      "subreddit": "cscareerquestions",
      "score": 3566,
      "url": "https://reddit.com/r/cscareerquestions/comments/g7z78b/i_freaking_did_it/",
      "comments": [
        {
          "body": "\"told me they wouldn't hire a black man straight out of college\" who tf just says that?",
          "score": 1103
        },
        {
          "body": "Padawan, your journey just started. congrats on the first step of a thousand more successful ones!",
          "score": 423
        },
        {
          "body": "Congrats and savor the victory. \n\nAlso don’t be like that guy who deletes a production database on his first day.",
          "score": 181
        },
        {
          "body": "Congrats man! Be careful about lifestyle inflation though. Save that money!",
          "score": 67
        }
      ]
    },
    {
      "title": "Where are all the jobs that pay enough to live.",
      "body": "I legitimately don’t get it. Even just looking for any jobs. A bunch of jobs want a masters degree and 10 years of experience then offer $55,000 max. That is not even half what it takes to live in an average city in the US. In order to buy a regular basic home you need $90,000 a year, please explain where these jobs are. Ive done coding and they aren’t paying $75,000 unless you are a top dog going to google who is laying people off not hiring. You’ll even hear Bullshit like “do HVAC” but when you actually talk to companies who SAAAAAY 90k then only offer you 55k. Also what’s with the jobs posting salaries then in interviews going “that’s what you could eventually make” THAT WAS A LOW BALL AMOUNT TO START!!! Hell you can’t even be an owner operator trucker today, they don’t pay enough per mile to make a profit! And that capitalism 101 OWNING AN ASSET. I also can’t wait for all the bs comments of people who live in a parents basement claiming they make $250,000 a year doing something that doesn’t exist. I have friends who would be considered famous on social media, THEY STILL NEED A REGULAR JOB just to pay bills. Is anyone making money anymore? The only people I know doing OK have rich family helping them in so many ways, and they legitimately do t even realize how much help the family gives them. For someone with no family where is all the money?",
      "subreddit": "jobs",
      "score": 374,
      "url": "https://reddit.com/r/jobs/comments/1puulvy/where_are_all_the_jobs_that_pay_enough_to_live/",
      "comments": [
        {
          "body": "The market has gotten much worse than it was just 2 years ago when I moved to my current role making $67K. I am getting indeed/linkedin messages from recruiters offering 40-55K a year. That would be great...like 8-10 years ago. These are for skilled HR roles. These companies are a joke.",
          "score": 102
        },
        {
          "body": "You ain't wrong. \n\nI've seen CDL employers offer .10 cents a mile. \n\nThat's one dime per mile. If I were to be reimbursed for gas in my personal car, the federal minimum is .70 cents.\n\nHVAC is a good industry because it's in demand. Climate change and all. But I get it. Not everyone wants to replace air conditioning units.\n\nOverall, what you are seeing is what everyone else sees: Industries that used to pay top dollar for any role are now testing the floor, and seeing how low they can get. The worst part is that people are desperate, so of course they'll accept low-ball offers. In turn, that validates the employer's low-ball offers.\n\nAnd the bait and switch game you named? That's just a normal Tuesday. It's a carrot on a stick. \n\nYou ain't wrong.",
          "score": 177
        },
        {
          "body": "Bruh I hear you I been the HVAC guy making $56k base literally lol.  My personal experience is now I have to more specialized and find per diem. The answer was 6 months on an oil  rig out in the Pacific Northwest Ocean hooray !!!",
          "score": 37
        },
        {
          "body": "I make 70k a year in MA. Pays the bills....barely. A grease don't fry in de kitchen....a beans don't burn da da grill...took a whole lot....blah blah im poor.",
          "score": 33
        },
        {
          "body": "We need to organize.",
          "score": 80
        },
        {
          "body": "What industry are you in? HVAC or something else?\n\n\nIf you happen to be in an industry with tons of applicants, like software development, then that's why you're seeing bad offers.\n\n\nWord of mouth is not always the best authority on what career to seek, so you may have to research online for a while.",
          "score": 10
        }
      ]
    },
    {
      "title": "Son from UC Berkeley can't get a job, but they still say that there is a “shortage” of American IT talent. Show them this.",
      "body": "",
      "subreddit": "jobs",
      "score": 1043,
      "url": "https://reddit.com/r/jobs/comments/1hw0k2d/son_from_uc_berkeley_cant_get_a_job_but_they/",
      "comments": [
        {
          "body": "there is a shortage of cheap labor. corporations want cheaper labor to feed the billionaires more money in their pockets",
          "score": 709
        },
        {
          "body": "The ones complaining about a shortage of talent are being disingenuous. There's no shortage of talent in America, there's simply a shortage of people willing to work for pennies on the dollar in poor conditions.\n\nThe billionaires complaining about this have an insatiable thirst for money and power and it is coming at our expense and at the expense of the people imported and abused for their labor. \n\nIt has to stop.",
          "score": 405
        },
        {
          "body": "Do both software engineering is terrible market right now. Have him do some 1099 contract work part time for coding while he explores any other paths he wishes. Just let opportunity paint its own path in time. Software engineering is not a guarantee it is fair for him to explore.",
          "score": 111
        }
      ]
    },
    {
      "title": "Feeling really low after my final Google interview – is there still hope?",
      "body": "Hi everyone,\nI’m feeling pretty dejected today and needed to share this somewhere people might understand.\n\nI recently interviewed for a Sales Specialist role at Google. My first two rounds went really well and I even got positive feedback through the recruiter, so I went into the final round feeling cautiously optimistic.\n\nBut the last interview completely threw me off. The expectation was that this round would be focused on leadership and “Googliness,” but the interviewer ended up asking five problem-solving questions on top of the situational/behavioral ones — all squeezed into 45 minutes. It felt rushed, and I definitely didn’t get enough time to structure my thoughts the way I normally would. I walked out feeling like I gave very average answers and didn’t do justice to my abilities.\n\nNow I’m stuck in that awful post-interview spiral… I don’t know if I should hold onto hope or mentally move on. Has anyone had a similar experience with Google final rounds feeling misaligned, rushed, or unexpectedly heavy on problem-solving? And did it still work out?\n\nAny insights, reassurance, or real talk would help.\nThanks in advance.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1phcbww/feeling_really_low_after_my_final_google/",
      "comments": [
        {
          "body": "That sounds really frustrating, especially with the pressure of a final interview. I've heard stories where candidates felt similar after their final rounds, only to get good news later on. It’s tough to shake the feeling of not performing your best, but don’t count yourself out just yet. Just remember, it’s not always about nailing every question perfectly.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewer asked me to ‘teach him something in 5 minutes’... so I showed him how to Google.",
      "body": "I swear, some interview prompts are just… wild.  \nSo the interviewer leans back and goes: “Pretend I’m a 5-year-old. Teach me something in 5 minutes.”\n\nAnd I’m sitting there like… ok 😅 so I just pulled up Google and said: “Here’s how you find answers to literally anything.”  \nHe laughed… but yeah, didn’t get the job.\n\nI get super nervous in interviews and had basically practiced *every* question I could think of on AMA Interview… but nothing prepared me for this one.  \nDo people actually expect you to give some deep teaching demo here? Or was I doomed from the start lol",
      "subreddit": "interviews",
      "score": 2185,
      "url": "https://reddit.com/r/interviews/comments/1ouy8e3/interviewer_asked_me_to_teach_him_something_in_5/",
      "comments": [
        {
          "body": "No, that’s a fucking stupid way to interview. Especially the dual constraints of “5-year-old” and “5 minutes.”",
          "score": 554
        },
        {
          "body": "U should have taught him about dinosaurs. 5 years old love dinosaurs",
          "score": 129
        },
        {
          "body": "Were you interviewing for a role as a childhood educator? Garbage question.",
          "score": 68
        },
        {
          "body": "I had an asswipe interviewer light a cigar and put his feet on the desk and he said, \"Kid, give me your schtick.\"  I said this might not be right for me and left.  Seriously.  J. Jonah Jamison vibe.",
          "score": 145
        },
        {
          "body": "\"How would you calculate the weight of a plane in the sky?",
          "score": 27
        },
        {
          "body": "Some people get high af on a tiny bit of power, or any opportunity to humiliate another person; I keep seeing those posts as proof of that.",
          "score": 17
        }
      ]
    },
    {
      "title": "Did I screw up by saying I’d choose Google over the company I was interviewing at?",
      "body": "I had an onsite in person interview loop recently for a Software Engineer position at a mid-size tech company. Most of the day went pretty well — I did fine in the technical rounds, had good conversations with the team, and even the hiring manager said I “ticked all the boxes.”\n\nBut in the final round with a senior director, he asked me a question that caught me off guard:\n\n“If you had offers from us and Google, which would you choose?”\n\nI thought for a moment and I just said what came first to my mind and I wanted to be honest:\n\n“To be honest, I’d choose Google — it’s always been a dream company.”\n\nThe moment I said it, I felt like I might’ve blown it. I was just being honest, but now I’m wondering if I came off as disinterested or not serious about the role. He didn’t react negatively — we moved on to a system design problem afterward — but I can’t help feeling that I might’ve unintentionally damaged my chances.\n\nAnyone else been in this situation? Would love to hear how others handled this kind of thing.\n",
      "subreddit": "interviews",
      "score": 300,
      "url": "https://reddit.com/r/interviews/comments/1lkl9yc/did_i_screw_up_by_saying_id_choose_google_over/",
      "comments": [
        {
          "body": "\\#1 thing in an interview is to convince them that you want to work for their company.  The last thing they want to do is hire you, train you, and watch you go somewhere else.\n\nA better answer would be something like “If it were 20-25 years ago in the early days of Google, and knowing what I know now, I’d pick Google.  But in 2025, I think your company is a better fit for me because…”",
          "score": 296
        },
        {
          "body": "Unfortunately being honest in this case is definitely the wrong move",
          "score": 64
        },
        {
          "body": "I made the same mistake when interviewed by Microsoft. Needless to say, I didn't make it through that round.\n\nBeing honest is being stupid. You want to tell them what they want to hear not what your heart says/believes in. Remember this thumb rule and you'll get through such questions easily in the future.",
          "score": 27
        },
        {
          "body": "As an interviewer I wouldn’t worry about it that much. Not saying you suck but the odds of anyone getting a job at Google it’s statistically not going to happen. You’d still be a safe bet to hire. Now, I can’t tell you about the interviewers ego or thought process.",
          "score": 11
        },
        {
          "body": "Meh, I’m a hiring manager at a tech company and some questions are just dumb filler questions. Most people would choose Google if they were being honest. This could go a bunch of ways. They may appreciate the honesty rather than the “right” answer. They may just ignore it completely because the rest of the interview was great and they don’t really care how you answered that one. The likelihood that one question alone cost you the role is unlikely. If you reached that level of interview, you’re likely fine.",
          "score": 7
        },
        {
          "body": "It's like your girlfriend asked if her friend is prettier than her. And you reply, \"Yeah, obviously, look at her b#@$s\"\n\nWe all know the truth, but you don't said that out loud",
          "score": 6
        }
      ]
    },
    {
      "title": "Walked out of an Interview after Two Questions",
      "body": "I had an interview yesterday that I walked out of after just two questions. To be honest, I was sceptical about the role from the start. The company’s reputation is abysmal with the highest Google rating for any of their offices being a mere 1.8. They’ve been fined millions on multiple occasions for failing to comply with various legal requirements. On paper, the salary and location were tempting, and a part of me thought I might be able to drive change in the office. I figured that best case, I’d improve operations within the branch; worst case, they would continue not to care and the role would be an easy ride. Either way, I was still concerned that even having their name on my CV could damage my future career prospects.\n \nBelow is a rough transcript of how things went:\n \n**Interviewer:** Can you tell me about a time when you disobeyed an order from a manager for the good of the company?\n \n**Me:** Sure. For example, a manager once asked me to complete a task directly through Outlook. I knew from experience that using RPS would allow us to have a more accessible log that would be useful if other colleagues...\n \n**Interviewer:** No, no, no. That’s not what we’re looking for. We want you to tell us about a time when your manager told you to do something and you flat-out refused.\n \n**Me:** I’m not in the habit of disobeying management. If I were ever instructed to do something thatwasn't the right thing to do, I’d raise my concerns with my manager privately, but I’ve never been in a situation where I have been instructed to do anything like that.\n \n**Interviewer:** OK, but we want you to tell us about a time when you actually disobeyed an order. If you want, we can come back to this question later?\n \n**Me:** OK, thanks. That’s fine.\n \n**Interviewer:** Can you tell us about a time when you did something illegal, but felt it was the right thing to do?\n \n**Me:** I’ve never done anything illegal and, no matter the circumstances, I would never do anything that was.\n \n**Interviewer:** Everybody’s done something illegal. We want you to share your story.\n \n**Me:** OK, that's it. I'm withdrawing my application. These questions are ridiculous and are not remotely suitable for an interview. I'm ending it here.\n\n______\nMy manager, who knows I am leaving as I am on a fixed term contract, agreed with me that the questions were ridiculous and inappropriate. My colleagues had mixed opinions with some agreeing, and others thinking that maybe they were trying to test me to see how easily I would be encouraged to break the law if my manager asked me to, with the correct response being to continue to refuse to answer. Others felt that I should have continued the interview regardless of how they were conducting it and it was unprofessional of me to walk out.\n\nWhat would others have done in this situation?",
      "subreddit": "interviews",
      "score": 9519,
      "url": "https://reddit.com/r/interviews/comments/1mxgbxi/walked_out_of_an_interview_after_two_questions/",
      "comments": [
        {
          "body": "Maybe I'm being paranoid here but do they want to have blackmail material on their new hires?",
          "score": 465
        },
        {
          "body": "[deleted]",
          "score": 327
        },
        {
          "body": "I have walked out of interviews. Once, I was interviewing for an HR DIRECTOR position and the interviewer was asking blatantly illegal questions. First, I thought it was a test. I called them on it. The second time, I said \"This question, like the first, is illegal to ask\". Their answer was \"I know, but if you want to answer...\". I said thanks, but no thanks and noped out of there. \n\nIf you have a bad feeling, no reason to waste your time.",
          "score": 274
        },
        {
          "body": "Those were the first 2 questions? Wow.\n\nI would have had fun with the illegal question. \"I once drove 1 mph over the posted speed limit. I don't regret that decision at all.\" Just to see their reaction.",
          "score": 148
        },
        {
          "body": "Leaving a bad interview is a great thing.  Remember - the interview goes both ways.  It’s easy to fall into the trap of feeling like you don’t have any power and you’d be lucky to work there.  Lots of other fish in the sea",
          "score": 89
        },
        {
          "body": "Not to date myself, but I once didn’t rewind the movie I rented from Blockbusters",
          "score": 132
        }
      ]
    },
    {
      "title": "Google TPM interview",
      "body": "I have a technical program manager interview at Google in a few days and I would love some tips please and any same pls questions \n\nThank you",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1ni4v4p/google_tpm_interview/",
      "comments": [
        {
          "body": "For which role?",
          "score": 1
        }
      ]
    },
    {
      "title": "\"I don't shake hands with women.\"",
      "body": "EDIT: Some of you think I had a problem with him not shaking my hand, which is not the case.\nPlease refer to [u/Puzzleheaded-Ebb-403 's comment](https://www.reddit.com/r/interviews/comments/1pq5gaz/comment/nursyes/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) if there is any confusion. \nThanks, u/Puzzleheaded-Ebb-403 ! Appreciate it! \n\nI had a final interview today for a receptionist position. This place has run a successful business for 55 years, they had great perks, ok pay, not too far from my house, nice area, tons of days off for Jewish holidays (since the business is owned by a Jewish family), and the first two interviews were great. Both of those interviews were with women and both were a little kooky, but harmless - nothing that would seriously impact my decision. They were not Jewish women, just to note. \n\nToday, the final interview was held by a man, who I think is part of the family that owns the business since he was wearing a yamaka. Anyway, I walked in and offered a hand to him, and without looking at me, he said \"I don't shake hands with women\" and sat down. I was very taken back by this, because he didn't say it kindly, he didn't offer any explanation as to why, he just sat down. From the moment I was in the room with this man, he acted so unimpressed with my existence. He didn't smile at all, he asked me for a copy of my resume, asked a little about my current role and my last role, then turned to the lady I had my last interview with and started asking her \"Did you tell her about _______?\", and \"Is she okay with _________?\" and \"Does she understand _________?\". Then he tries to tell me this would be much different from anything I've done before, which just wasn't true. I'd been a receptionist at a law office for 6 years, which I let him know. It started to feel like he was trying to talk me out of the job. \n\nWhen it came time to negotiate, he started by saying that my asking price was too high so we negotiated a bit, and I went lower than I really wanted in the end. He told me he'd send an offer letter on Monday, but he was not excited or congratulatory, he was just cold and serious. I did not feel good talking to him. I left there with such a WTF feeling. I really had every intention of taking this job... Until I met this guy, who would have been my direct supervisor. I immediately Googled \"Jewish person won't shake hands\" and learned about 'Shomer Negiah', the Jewish practice of abstaining from all physical contact with members of the opposite sex, outside of immediate family. I knew about this from the Netflix show Unorthodox, but I had never experienced it first-hand. All my Jewish friends are quite progressive, so this was new to me. \n\nI just really wish that that interviewer had said something like, \"I don't shake hands for religious purposes, but it's nice to meet you\", but even if he had, his whole attitude and demeanor basically read as \"you are beneath me\" - I felt like I was called to the principals office, no exaggeration. And the interview was roughly 7 minutes long! What a waste of time to go all the way out there to meet this cold lump. He ended sending the offer letter today, but I think I'm going to have to turn them down at this point. Just a wild experience. ",
      "subreddit": "interviews",
      "score": 2638,
      "url": "https://reddit.com/r/interviews/comments/1pq5gaz/i_dont_shake_hands_with_women/",
      "comments": [
        {
          "body": "“I did not feel good talking to him.” \n\nListen to your gut. That’s all you need to know. You don’t want to feel like this every day.",
          "score": 799
        },
        {
          "body": "He chose his phrasing for a reason. I'd run.",
          "score": 625
        },
        {
          "body": "Remember that during an interview, you are also interviewing and assessing them. Is this someone you really want as your employer?",
          "score": 289
        },
        {
          "body": "All that, AND he negotiated you lower than you wanted to go?  Nah.",
          "score": 101
        },
        {
          "body": "I'm Jewish and have known plenty of observant Jews who practice shomer negiah. They are perfectly nice people. This guy seems like he was an ass. \n\nI interviewed at a company a number of years ago and my final meeting was with the CFO. Every aspect of the conversation made me feel unwanted and looked down on. There was nothing outwardly hostile, but he maintained an air of superiority and skepticism about me that pervaded everything. I ended up turning down an offer from them because I didn't want to work with someone like that.",
          "score": 136
        }
      ]
    },
    {
      "title": "Just had the worst interview experience at Google",
      "body": "UPDATE: SHE CALLED ME BACK AND I WAS HIRED 6 WEEKS LATER FOR AN OCT 6 START DATE? \nHad applied many times before, but never got called to interviews. This time, I was. I started interviewing in April for a role scheduled to begin on May 12th. Their interviewers kept rescheduling.  I had a change of recruiter as well. New recruiter was high all the time or something. Finished interviewing mid June. Updated every week since with “no update” updates, and received a call one Tuesday from the recruiter saying they won’t be moving forward, but she has another opportunity. I was devastated but still kept holding hope due to the way she delivered that. A week of silence. Then, she emails me asking if I’ll be accepting the current offer?????? (Which offer ma’am??? I’m confused). Shortly after, she says the other opportunity she was going to connect me with has also closed. \n\nWhat the hell has just happened to me\n\n",
      "subreddit": "interviews",
      "score": 453,
      "url": "https://reddit.com/r/interviews/comments/1lwbsqw/just_had_the_worst_interview_experience_at_google/",
      "comments": [
        {
          "body": "“Yes, thanks for reaching out. I am happy to accept and eagerly wait future details”",
          "score": 108
        },
        {
          "body": "My response: I like the offer. Can you send it to my email + other information needed!!\nBoom I got a job",
          "score": 55
        },
        {
          "body": "I’m going through the same cycle with another Big Tech company. Didn’t move forward with one opportunity and now getting pulled back in for another. Communication has been chaos, you’re not alone",
          "score": 47
        },
        {
          "body": "Their interview process is gross, so I’m not surprised you had this experience, but I am sorry. It’s really rough out there now. I interviewed with them years ago. They put candidates through the ringer to test their “Googliness”. Like r u f’in kidding me? Felt cult-ish. Interviewed with one person who sat in a dark room, def high AF, reminded me of a sinister version of J.P. From Grandmas Boy, and his big question was “What operating system is your favorite?” Sir, this interview is for a content role…",
          "score": 15
        },
        {
          "body": "[deleted]",
          "score": 21
        },
        {
          "body": "Google ain’t what it used to be.",
          "score": 13
        },
        {
          "body": "That's rough. I had interviewed with Google a few years back, my understanding of how it worked is that after your interview loop there is a hiring committee that reviews the results and approves/rejects you. There is a separate team matching process that matches approved candidates with specific teams. There may be a time limit for approved candidates to get team matched, but I would expect that to be at least a few months. Did the HC approve you and you are mainly waiting to get matched to a team?",
          "score": 3
        },
        {
          "body": "I interviewed for a recruiting job with them precovid or at the start.  I wasn't impressed with the team.  And I believe they laid off like 75% of their recruiters in the last few years",
          "score": 3
        }
      ]
    },
    {
      "title": "My Google Tech Interviewing Decoded Experience",
      "body": "## Introduction\n\nLast Friday (2016-04-07), I was invited to Google's new Sunnyvale campus for a new Google campus outreach program currently titled Tech Interviewing Decoded. Over the course of approximately five hours, Google hosted a number of talks, panels, and demos to \"demystify the [Google] interview process and give you the opportunity to have your questions answered about launching your career in tech\". Approximately 100-150 computer science/engineering students from four invited Bay Area universities attended the program. I suspect that many readers here would have liked the opportunity to attend such an event so I've written up a quick summary of the day. I suspect that nothing here will be new to some readers on this sub but hopefully it helps some people!\n\n## Mock Interview 'Demo' with Googlers\n\nIn my favorite segment, two Google interviewers demonstrated what the technical portion of a Google interview looks like along with tips on what interviewers are looking for. Both the interviewer and interviewee were named Jonathan so I'll refer to them as the interviewer and interviewee. I think it will be more useful if I describe some notable points rather than regurgitating the interviewer's code so the code/solution is left as an exercise to the reader (hah). \n\nProblem: Write a program that returns the length of the longest chain of consecutive numbers in a grid of natural numbers.\n\nThe interviewee began by asking clarifying questions about the problem. An interviewer may give you an intentionally ambiguous or vague problem to assess your attention to detail. Some questions asked in this demo included:\n\n* Q: Can we assume that the grid is square (NxN rather than NxM)? A: Yes, let's say it's square for now.\n* Q: Do we have to worry about the grid being so large that it can't fit in memory or anything like that? A: No, let's assume the grid is reasonably sized and will be given as a 2-D array (e.g. int Grid[n][n])\n* Q: Do we have to consider diagonal elements? A: Nope. An element is adjacent to another element if it is positioned immediately to its left/right xor top/bottom.\n\nThe interviewee then solved an example by hand on the whiteboard to ensure that he was on the same page as the interviewer. Working out a problem by hand is also a good way to gain some intuition on how to design an algorithm for the given problem.\n\n    [0, 1, 4]\n    [2, 3, 5]\n    [8, 7, 6]\n    Longest chain is [4, 5, 6, 7, 8] with length 5.\n    \n    [0, 2]\n    [3, 1]\n    Longest chain is [1, 2] with length 2.\n\n\nIt was only after asking questions and solving an example by hand that the interviewee began to actually write code. He began by writing a suboptimal but straightforward brute force solution: iterate through every element in the matrix and see what the longest chain of increasing, consecutive neighbors you can form from each starting point. Keep track of the maximum length encountered and return it after checking all starting points. While writing his solution, the interviewer called a function for finding the longest chain given a starting cell rather than writing the entire solution in one block. Writing modular code in an interview is not only neater but also opens the door to the possibility that the interviewer lets you skip fully implementing some functions. In this case, the interviewer only asked the interviewee to describe how he would implement his getLongestPath function. \n\nThe interviewee then noted that this solution is inefficient and repeats work. Iterating through the grid takes O(n^2) time and finding the longest path takes O(n) so his solution is O(n^3). If I'm not wrong, there seemed to be some inconsistency on whether n referred to the dimension of the matrix (e.g. n = 3 for a 3x3 matrix) or the total number of elements in the matrix (e.g. n = 9 for a 3x3 matrix). He then came up with an O(n) by creating a custom data structure that maps the value of a cell to its index in the matrix.\n\n\n    [0, 1, 4]\n    [2, 3, 5]\n    [8, 7, 6]\n    -&gt; {0: (0, 0), 1: (0, 1), 2: (1, 0), 3: (1, 1), 4: (0, 2), 5: (1, 2), 6: (2, 2), 7: (2, 1), 8: (2, 0)\n    \n    [0, 2]\n    [3, 1]\n    -&gt; {0: (0, 0), 1: (1, 1), 2: (0, 1), 3: (1, 0)}\n\nThen he ran through his new data structure sequentially and checked if the current index is adjacent (e.g. x1 == x2 and y1 == y2+-1 and vice versa) to the next index. Since you only need to iterate through the grid once to fill in your data structure and iterate through the data structure once to find the longest chain, the new solution ran in O(n) time (where n is the total number of elements in the matrix). \n\nI don't have the interviewees exact Java solution but I whipped up a quick Python implementation of his algorithm (removed so I don't dox myself) as I understood it.\n\nTip: if you see the opportunity to write a class or use some design pattern, you might as well take it to demonstrate your knowledge of the OOP paradigm. \n\nIt's important to note that throughout the entire interview, the interviewee and interviewee were talking to each other almost continuously. Instead of standing silently while thinking to himself, the interviewee thought out loud so the interviewer could follow his thought process. The interviewee also described what he was attempting to do while writing each line of code. Communicating your thoughts in an interview has the added benefit of allowing your interviewer to give you feedback and hints if you're going in the wrong direction. Multiple Googlers emphasized that your interviewer will want to see you ace your interview and solve the problem so if they give you a hint, take it. They aren't trying to trick or mislead you. Remember that interviewers are also assessing if they would like to work with you and ignoring their hints could make you seem like a stubborn developer who has to do things his or her way.\n\nTip: identify possible errors or bugs as you work. For example, while writing code to get a cell's neighbors, the interviewee noted that there may be an off by one error when the cell is on the edge of the matrix and said he'd go back to fix it after getting the general algorithm down. This prevents the interviewer from asking you 'gotcha' type questions when you finish. It can also be useful for the interviewer to know that you recognize a problem area so he or she doesn't focus on an error he or she thinks you missed.\n\n## Follow up Demo Q&amp;A with Googlers\n\nFollowing the interview, the two demonstrators answered questions and gave more tips on how to have a successful interview.\n\n* Q: Will your interviewer run your code? A: Maybe. Some people take notes and run your code later while some don't. If you see your interviewer typing during your interview, it is highly unlikely that he or she is transcribing your code into an IDE however. They're most likely just taking notes.\n* Q: How important is syntax? A: You want to show that you know the programming language you're using but it's not like missing a semi-colon is going to ruin your chances.\n* Q: What language do you have to code in? A: Your recruiter should talk to you about what language you would like to code in beforehand and you'll be matched with an interviewer who is familiar with that language. We don't recommend trying to do an interview in some obscure language. You're definitely safe if you code in C++, Java, or Python.\n* Q: Is it always a good idea to work on the obvious brute-force approach before giving a better or optimal solution? A: Not really. It's impressive if you can briefly describe the obvious solution and its time complexity before going right into a better solution. In this context, the interview from the demo wasn't actually the strongest interview a candidate could have given.\n* Q: What if you get a problem that you have no idea how to approach? A: Try to stay calm. Panicking is going to hurt you even more. It's especially important to ask questions, do an example or two, and communicate your thought process to your interviewer.\n* Q: I failed an interview in the past. Why didn't I get any feedback on what I did wrong? A: Legal reasons. If you're interviewing again, try to show noticeable improvement. It looks really bad if you fail to solve a problem that you failed to solve in a previous attempt.\n\n## Googler Panel\n\nFollowing the mock interview, four Googlers took the stage and opened the floor to questions.\n\n* Q: What are some tips that you have for current students? A: Show your passion for CS by participating in organizations and events outside of classes. Work on your own projects or contribute to open source. Study hard and practice for interviews. Try to get as many internships and experience under your belt as possible.\n* Q: What are some tips for people trying to get a job at Google? A: Persevere - I waited 5 years before I first applied to Google and when they finally hired me. Make your life easier by letting your know interviewer know if you're having any problems that they could accommodate. Practice interviewing on a whiteboard and do as many interviews as you can; the general tech interview form is pretty similar across companies so there's a lot of skill transfer.\n* Q: How is the work-life balance at Google? Do you ever feel burned out? A: Google is so large that the atmosphere/pressure varies from team to team. All the panelists agreed that they had good work-life balance and a lot of stress they feel is self-induced.\n* Q: I'm interested in CS education. Are there opportunities for this at Google? A: Again, Google is large. A better question would be what field isn't Google interested in? To your specific example, I know that Google often sends people to teach at historically black colleges and universities. \n\n## Spotlight Talks\n\nTwo Googlers gave slightly longer talks specifically about what they do at Google. The first speech was by someone who entered Google through the Engineering Residency program. The Engineering Residency program is a yearlong training where residents are attached to 2 different teams for training and hands on experience. Apparently it has a ~90% conversion rate and many residents like their first team enough that they choose to stick with it and convert to a full time role. This was the case for our first speaker and she ended up on the Chrome for Android UI team where she worked on implementing features such as the close all tabs button for Android on tablets. She is currently working on features such as split screen support on the upcoming Google N. \n\nThe second speech was largely about the importance of data health, the process of building systems to monitor Google's data systems, and how Google deals with system failures. Rather than naively recording all system logs and informing everybody about the failure, Google has systems in place to identify the root cause of problems and only notifies teams that will be negatively impacted. He also talked about some of the techniques (e.g. power capping) that Google uses to reduce costs in their data centers. \n\n## Ask a Recruiter! Q&amp;A\n\nThe final panel consisted of four recruiters who took questions about the whole recruitment process.\n\n* Q: How long do you spend on each resume? A: Resumes are actually sent to a dedicated resume screening team in Houston who take 10-15 minutes per resume. If your resume makes it past that stage, it gets into our (a recruiter) hands. Since there is such a high volume of applicants, it isn't feasible for recruiters to spend too much time on every resume.\n* Q: If I'm rejected, how long should I wait before reapplying? A: Officially it's a year but it doesn't have to be exactly one year to the date.\n* Q: How important is it to include links to your portfolio/GitHub on your resume? A: It's definitely helpful. Many interviewers will take the time to look at a candidate's GitHub before interviews.\n* Q: What are some resumes do's and don'ts? A: Definitely include your GPA. Unless you have industry experience, keep it to a single page. Be truthful about your knowledge or experience.\n* Q: What is the minimum GPA needed to be competitive at Google? A: Google takes a holistic look at each candidate.\n* Q: When is the best time to apply for an internship? A: As early as possible after the application opens. It's tempting to wait to give yourself more time to improve your resume but recruiters will have more time to spend on each applicant early in the application period and there are finite number of spots that get filled up over time.\n* Q: I dropped out of a PhD program. Does this reflect badly on me or hurt my chances? A: Google is filled with people from non-traditional paths. I wouldn't worry about that at all.\n\n## Closing\n\nIn addition to the scheduled talks, a few lucky people were selected for their own practice interviews. Sadly, I wasn't one of those ~20 people. Of course, no Silicon Valley event would be complete some company swag. All attendees received a bag full of Google swag that included a subtly branded Google notebook, plastic sunglasses, socks, and a 2200mAh external battery pack. Some lucky winners also won a free copy of Cracking the Coding Interview.\n\nI thought the event was very well run. All the speakers and panels were good about keeping to the schedule and there was no dead or wasted time. One issue was that other Googlers kept accidentally connecting to the projector in our room. I suspect they have some sort of campus wide conference call/meeting network setup but it was pretty funny to see the projector switch from the presentation slides to some random person every now and then though. Thanks again for hosting this event, Google!\n\nLet me know if you have any questions!\n\nThis should be obvious but I'm not associated with Google in any way. The opinions and views expressed are solely my own and do not reflect the view of Google. \n\nEdit: Clarified some details in mock interview section",
      "subreddit": "cscareerquestions",
      "score": 480,
      "url": "https://reddit.com/r/cscareerquestions/comments/4evk44/my_google_tech_interviewing_decoded_experience/",
      "comments": [
        {
          "body": "&gt;socks\n\nWell shit, at least they made it worth your while.",
          "score": 25
        },
        {
          "body": "Ooof, these modern interviews sound awful.  No doubt I'd be sent packing.\n\nWhen I interview people, I'm much more interested in (a)tons of details about products they've actually shipped (there's a lot of BS overreaching in resumes out there) and (b) how they'd structure bigger systems.  All of that tactical coding stuff just makes me tired.  I just assume that if people need to bake some sort of custom data structure to handle a problem, they'd just look up different approaches.",
          "score": 22
        },
        {
          "body": "I was selected to do a mock interview. It was about 20 minutes long. I talked to 2 other people and they got the same question I did. It started out with \"So tell me about yourself\" for a few minutes then went onto the question. \"Write a function that takes a string as input and returns the character that occurs most often in the string\".\n\nI started with a basic for loop then realized I couldn't use an array to store the values once I asked if it was ASCII characters or Unicode and they said let's assume Unicode. Obviously I'm not going to create an array of length 16000, so then I went with hashmap. I got tied up on the basic function names 'put' vs 'add', 'containsKey' vs 'contains', I forgot about the keyset so when iterating I just went with map.iterator, stuff like that. \n\nOnce I solved it she then expanded on it and asked how I'd make it faster. I went with spawning threads and dividing the problem into chunks and pass each one to a thread and return a hashmap once complete and write it to a file Synchronously because asyncronous wouldn't work because only one thread can access a file at a time or you start losing data. She then said \"what if I have 18000 threads returning a hashmap, that's a lot of memory and wasted cpu time just sitting around waiting to write to the one file\" I had no idea how to solve that problem so then was asked what if I had an entire library I wanted to do this with and had lots of computers. I knew that was distributed computing but then she asked how I'd use that to my advantage. I just changed the threads to computers and didn't know how to go further. She then asked if I knew what MapReduce was, I've heard of it for 'big data' but didn't know exactly what it did. She explained how it worked and that was about the end of the mock interview.\n\nShe liked that I talked through each part of the problem as I was writing it down and communicated the whole time while solving it. The advice she gave me was to learn the common functions of data structures built into the language you're using, stl, java framework, etc. so I spend more time writing the code and less time trying to get the syntax correct for the data structure. And to get more comfortable writing on paper/whiteboard without being able to use tab-enter autofill. And to make sure I closed all my braces, I guess I only closed 2 of my curly braces.\n\nSo the interview started out with a simple problem then as I solved each part got more abstract and theoretical not writing code.",
          "score": 23
        },
        {
          "body": "This is a good post and you're a good guy for writing it up.\n\n&gt; Q: I failed an interview in the past. Why didn't I get any feedback on what I did wrong? A: Legal reasons.\n\nI recently started doing interviews at Google and during the training they give a big ol' list of \"things not to ask/talk about\", like gender, sexuality, age, ethnicity, nationality, disabilities, marital status, whether they have kids, etc. Feels weird not to be able to ask \"where you from\" in a lunch interview.",
          "score": 66
        },
        {
          "body": "&gt;dedicated resume screening team in Houston who take 10-15 minutes per resume. \n\nYou sure it's not 10-15 seconds?",
          "score": 9
        },
        {
          "body": "I did an onsite with them a couple of weeks ago. Here is my experience:\n\n3 interviews before lunch, 2 after lunch.\n\n1st interview: Easy tree question + easy bit manipulation question. Solved both of them. I did some small mistakes while coding but fixed them right after I am done.\n\n\n2nd interview: Hard DP question. Spend ~15 to come up with the DP formulation. Couldn't do it. Interviewer asked me to write code for brute-force solution. I did that and spend another ~15 to finally verbally explain the DP solution. No time to code.\n\n3rd interview: Medium BFS/DFS question. Did some mistakes during coding but fixed it afterwards.\n\n4th interview: Easy string question. Solved it. Probably took too much time and we didn't have time for 2nd question (I wasn't in a rush but should've solved it faster)\n\n5th interview: Easy tree question. Same as above, solved it but took too much time.\n\n\nDidn't get an offer. My biggest mistake: being too slow. I spent a lot of time to explain my thought process, different ways of solving the problem, discussing different data structures and their advantages, my knowledge in CPP and STL... Also, not practicing on a whiteboard thus having to change previous lines which makes the solution look messy.",
          "score": 8
        }
      ]
    },
    {
      "title": "Is Anyone Else Weirded Out by LinkedIn Culture?",
      "body": "Might be a silly question, but I've recently started using the site more to see what I've been missing. \n\nIt seems like all I see is random \"inspiration posts\" with hashtag spam\n\nego circlejerking of \"I am ex google ex Facebook ex NASA you should listen to me\"\n\n\"I just hit 10,000 followers, thanks!\"\n\n\"2 years ago I was a janitor at my local 7-Eleven, now I'm a software engineer at Google\"\n\nDo I have to partake in this shit to move up? Am I the one missing out?",
      "subreddit": "cscareerquestions",
      "score": 4645,
      "url": "https://reddit.com/r/cscareerquestions/comments/on60qg/is_anyone_else_weirded_out_by_linkedin_culture/",
      "comments": [
        {
          "body": "[removed]",
          "score": 2610
        },
        {
          "body": "[deleted]",
          "score": 261
        },
        {
          "body": "I'm sick of it also. \nI hate every single one of those things you listed.\nI also hate this one\n\"Don't just look for a company.\nLook for a blah blah.\nDon't just look for a job\nLook for a blah blah.\"\nSuch garbage.",
          "score": 436
        },
        {
          "body": "I love the posts with some obviously made up story that ultimately ends with some sort of lesson to be learned..\n\n&gt; My daughter came into my bedroom late one night\n\n&gt; \"Daddy\", she said. \"I can't sleep, theres a monster in my closet!\"\n\n&gt; I work 12 hour days, always on my grind, but I would do anything for my baby girl. I tell her monsters are just a figment of her imagination and she needs to overcome her fears if she wants to succeed in life. \n\n&gt; After some thought, she goes back to room and I can hear her say \"go away monster, I'm not scared of you!\"\n\n&gt; I'm so proud of my baby girl. Goes to show you life is more than just being on the hustle, you gotta support those around you if you want to see any change in the world.\n\n&gt; My daughter just turned 20 this month. Love you, sweetheart.",
          "score": 146
        },
        {
          "body": "Do you want to be a CEO like me? Then do these things every day\n\n&amp;#x200B;\n\n1. Wake up at 3:30am. \n2. Meditate \n3. Answer emails for 90 minutes\n4. Go for a 3 mile run\n5. Meditate some more\n6. Be the first in the office at 5:45am\n7. Be the last one out of the office at 10:45pm\n8. Fall asleep meditating",
          "score": 131
        },
        {
          "body": "It’s turning into Facebook. \n\nCheck out /r/LinkedInLunatics if you’re feeling masochistic.",
          "score": 253
        },
        {
          "body": "There seems to be a lot of passive aggressive behavior and humble bragging on LinkedIn. I don't like how anyone can look you up either - it feels like a weird intrusion of privacy",
          "score": 88
        }
      ]
    },
    {
      "title": "Google Interview University",
      "body": "https://github.com/jwasham/google-interview-university\n\nJust saw this on hacker news and thought it would fit well here. I'm ~~abusing my powers~~ posting this since, while it's ostensibly aimed at people going from self-taught developer to a Google software engineer, really it looks like a great listing of resources for learning CS fundamentals for anyone, regardless of target company/industry. Although of course it looks particularly useful for getting into a company that does whiteboarding interviews.\n\nedit: here's the HN comment thread, which people here may also find interesting/useful: https://news.ycombinator.com/item?id=12649740",
      "subreddit": "cscareerquestions",
      "score": 365,
      "url": "https://reddit.com/r/cscareerquestions/comments/565ors/google_interview_university/",
      "comments": [
        {
          "body": "Does anybody find it unnerving how much the author (not you LLJKCicero, the Github author) seems to fetishize Google?",
          "score": 166
        },
        {
          "body": "One of the top threads on the HN discussion comes from an author (pjlegato) who speaks confidently and has no idea what he's talking about. Please take that entire thread with a huge grain of salt. He is not qualified to speak about the relevance of computer science skills at Google (nor how its interview process supports that).\n\n",
          "score": 29
        },
        {
          "body": "&gt; Print out a \"future Googler\" sign (or two) and keep your eyes on the prize.\n\nNah, I'm good. ",
          "score": 22
        },
        {
          "body": "There are 273 instances of youtube links and 4 links to leetcode, that is not how you learn.\n\nThat said, the breadth of material is at the least admirable and useful for others to review. There are significant pedagogical (and possibly psychological) issues at play here but he should still be commended and thanked.",
          "score": 28
        },
        {
          "body": "Looks like overkill to me.",
          "score": 13
        }
      ]
    },
    {
      "title": "Remove CS and replace with Leetcode Engineering",
      "body": "Listen to my brilliant idea: We should create a new college major: Leetcode Engineering\n\nYear 1: cover basic Python\n\nYear 2: leetcode easy\n\nYear 3: leetcode medium\n\nYear 4: leetcode hard\n\nResult? PROFIT?: Tech job at GoOglE\n\n\nAfter a long and worthy prior post battle, I have decided it is best to create a new college major focused on Leetcoding 24/7 to guarantee entry into a top tech company since CS is just so useless right.\n\nYou have research experience? Scrap it\n\nYou have 30 side-projects? Scrap them\n\nYou are fluent in 4-5+ coding languages? Focus on Python\n\nYou are top rank of your CS university? Scrap it, drop out now.\n\nYour key to success is to leetcode, leetcode.\n\n\nThoughts or questions are welcomed.",
      "subreddit": "cscareerquestions",
      "score": 4137,
      "url": "https://reddit.com/r/cscareerquestions/comments/jsrmtw/remove_cs_and_replace_with_leetcode_engineering/",
      "comments": [
        {
          "body": "Keeping this because there's actual discussion happening in the comments.",
          "score": 1
        },
        {
          "body": "In fact just get rid of all the software dev and engineering jobs and just pay employees to solve leetcode problems",
          "score": 339
        },
        {
          "body": "There's a vibrant FAANG interview industry serving this niche market as we speak, and it's profitable. I see more orgs adopting peer code reviews and pair programming of real code as an assessment. I know this format is not scalable for orgs receiving tens of thousands of applications per day. BUT should the FAANG fraternity decide to outsource tech hiring to a company that re-thinks recruitment you could have a challenge. I'm sure there are souls out there distilling data and methodology through ML looking for an opportunity to get VC funding.",
          "score": 491
        },
        {
          "body": "Result: Google will start asking LC hard questions of sophomores looking for internships, and people will still have to grind problems they don't cover in classes in order to prove themselves.",
          "score": 565
        },
        {
          "body": "~~yes~~\n\nedit: delete this pls",
          "score": 1406
        },
        {
          "body": "This man guarantees a tech job in 5 simple steps, Computer Scientists hate him!",
          "score": 683
        },
        {
          "body": "I interviewed with a company with a very unique interview format, instead of leetcode type questions they put some project with documentation in a GitHub repository and asked to debug the code and develop a small feature. Felt that was a unique coding interview.",
          "score": 278
        }
      ]
    },
    {
      "title": "WSJ - Tech jobs are gone and not coming back. ",
      "body": "[https://www.wsj.com/tech/tech-jobs-artificial-intelligence-cce22393](https://www.wsj.com/tech/tech-jobs-artificial-intelligence-cce22393)\n\nFinding a job in tech by applying online was fruitless, so Glenn Kugelman resorted to another tactic: It involved paper and duct tape.\n\nKugelman, let go from an online-marketing role at [eBay](https://www.wsj.com/market-data/quotes/EBAY), blanketed Manhattan streetlight poles with 150 fliers over nearly three months this spring. “RECENTLY LAID OFF,” they blared. “LOOKING FOR A NEW JOB.” The 30-year-old posted them outside the offices of Google, [Facebook](https://www.wsj.com/market-data/quotes/META) and other tech companies, hoping hiring managers would spot them among the “lost cat” signs. A QR code on the flier sent people to his LinkedIn profile.\n\n“I thought that would make me stand out,” he says. “The job market now is definitely harder than it was a few years ago.” \n\nOnce heavily wooed and fought over by companies, tech talent is now wrestling for scarcer positions. The stark reversal of fortunes for a group long in the driver’s seat signals more than temporary discomfort. It’s a reset in an industry that is fundamentally readjusting its labor needs and pushing some workers out.\n\nPostings for software development jobs are down more than 30% since February 2020, according to Indeed.com. Industry layoffs have continued this year with tech companies shedding around 137,000 jobs since January, according to Layoffs.fyi. Many tech workers, too young to have endured the dot-com bubble burst in the early 2000s, now face for the first time what it’s like to hustle to find work. \n\nCompany [strategies are also shifting](https://www.wsj.com/tech/techs-new-normal-microcuts-over-growth-at-all-costs-b80bb18b?mod=article_inline). Instead of growth at all costs and investment in moonshot projects, tech firms have become laser focused on revenue-generating products and services. They have pulled back on entry-level hires, cut recruiting teams and jettisoned projects and [jobs in areas](https://www.wsj.com/articles/tech-industry-reversal-intensifies-with-new-rounds-of-layoffs-11673134201?mod=article_inline&amp;mod=article_inline) that weren’t huge moneymakers, including virtual reality and devices. \n\nAt the same time, they started putting [enormous resources into AI](https://www.wsj.com/finance/stocks/breaking-down-the-tech-giants-ai-spending-surge-e282ca24?mod=article_inline). The release of ChatGPT in late 2022 offered [a glimpse into](https://www.wsj.com/articles/chatgpt-ai-chatbot-app-explained-11675865177?mod=article_inline&amp;mod=article_inline) generative AI’s ability to create humanlike content and potentially transform industries. It ignited a frenzy of investment and a race to build the most advanced AI systems. Workers with expertise in the field are among the few strong categories. \n\n“I’ve been doing this for a while. I kind of know the boom-bust cycle,” says Chris Volz, 47, an engineering manager living in Oakland, Calif., who has been working in tech since the late 1990s and was laid off in August 2023 from a real-estate technology company. “This time felt very, very different.” \n\nFor most of his prior jobs, Volz was either contacted by a recruiter or landed a role through a referral. This time, he discovered that virtually everyone in his network had also been laid off, and he had to blast his résumé out for the first time in his career. “Contacts dried up,” he says. “I applied to, I want to say, about 120 different positions, and I got three call backs.”\n\nHe worried about his mortgage payments. He finally landed a job in the spring, but it required him to take a 5% pay cut.\n\n# No more red carpet\n\nDuring the pandemic, as consumers shifted much of [their lives](https://www.wsj.com/articles/amazon-sales-surge-amid-pandemic-driven-online-shopping-11604003107?mod=article_inline) and spending online, tech companies went on hiring sprees and took on far too many workers. Recruiters enticed prospective employees with generous compensation packages, promises of perpetual flexibility, [lavish off sites](https://www.wsj.com/articles/tech-startups-ditch-the-office-for-far-flung-bonding-trips-11623854510?mod=article_inline) and even a [wellness ranch](https://www.wsj.com/articles/forget-the-officesalesforce-is-making-a-wellness-retreat-for-workers-11644510615?mod=article_inline). The fight for talent was so fierce that companies hoarded workers to keep them from their competitors, and some employees say they were effectively [hired to do nothing](https://www.wsj.com/articles/these-tech-workers-say-they-were-hired-to-do-nothing-762ff158?mod=article_inline).\n\nA downturn quickly followed, as higher inflation and interest rates cooled the economy. Some of the largest tech employers, some of which had never done large-scale layoffs, started cutting tens of thousands of jobs. \n\nThe payroll services company ADP started tracking employment for software developers among its customers in January 2018, observing a steady climb until it hit a peak in October 2019. \n\nThe surge of hiring during the pandemic slowed the overall downward trend but didn’t reverse it, according to Nela Richardson, head of ADP Research. One of the causes is the natural trajectory of an industry grounded in innovation. “You’re not breaking as much new ground in terms of the digital space as earlier time periods,” she says, adding that increasingly, “There’s a tech solution instead of just always a person solution.” \n\nSome job seekers say they no longer feel wined-and-dined. One former product manager in San Francisco, who was laid off from Meta Platforms, was driving this spring to an interview about an hour away when he received an email from the company telling him he would be expected to complete a three-part writing test upon his arrival. When he got to the office, no one was there except a person working the front desk. His interviewers showed up about three hours later but just told him to finish up the writing test and didn’t actually interview him. \n\nThe trend of ballooning salaries and advanced titles that don’t match experience has reversed, according to Kaitlyn Knopp, CEO of the compensation-planning startup Pequity. “We see that the levels are getting reset,” she says. “People are more appropriately matching their experience and scope.”\n\nWage growth has been mostly stagnant in 2024, according to data from Pequity, which companies use to develop pay ranges and run compensation cycles. Wages have increased by an average of just 0.95% compared with last year. Equity grants for entry-level roles with midcap software as a service companies have declined by 55% on average since 2019, Pequity found.\n\nCompanies now seek a far broader set of skills in their engineers. To do more with less, they need team members who possess soft skills, collaboration abilities and a working knowledge of where the company needs to go with its AI strategy, says Ryan Sutton, executive director of the technology practice group with staffing firm Robert Half. “They want to see people that are more versatile.”\n\nSome tech workers have started trying to [broaden their skills](https://www.wsj.com/tech/ai/ai-skills-tech-workers-job-market-1d58b2dd?mod=article_inline), signing up for AI boot camps or other classes. \n\nMichael Moore, a software engineer in Atlanta who was laid off in January from a web-and-app development company, decided to enroll in an online college after his seven-month job hunt went nowhere. Moore, who learned how to code by taking online classes, says not having a college degree didn’t stop him from finding work six years ago. \n\nNow, with more competition from workers who were laid off as well as those who are entering the workforce for the first time, he says he is hoping to show potential employers that he is working toward a degree. He also might take an AI class if the school offers it. \n\nThe 40-year-old says he gets about two to three interviews for every 100 jobs he applies for, adding, “It’s not a good ratio.”\n\n# Struggling at entry level\n\nTech internships once paid salaries that would be equivalent to six figures a year and often led to full-time jobs, says Jason Greenberg, an associate professor of management at Cornell University. More recently, companies have scaled back the number of internships they offer and are posting [fewer entry-level jobs](https://www.wsj.com/lifestyle/careers/computer-science-majors-job-market-7ad443bf?mod=article_inline). “This is not 2012 anymore. It’s not the bull market for college graduates,” says Greenberg.\n\nMyron Lucan, a 31-year-old in Dallas, recently went to coding school to transition from his Air Force career to a job in the tech industry. Since graduating in May, all the entry-level job listings he sees require a couple of years of experience. He thinks if he lands an interview, he can explain how his skills working with the computer systems of planes can be transferred to a job building databases for companies. But after applying for nearly two months, he hasn’t landed even one interview. \n\n“I am hopeful of getting a job, I know that I can,” he says. “It just really sucks waiting for someone to see me.” \n\nSome nontechnical workers in the industry, including marketing, human resources and recruiters, have been laid off multiple times.\n\nJames Arnold spent the past 18 years working as a recruiter in tech and has been laid off twice in less than two years. During the pandemic, he was working as a talent sourcer for Meta, bringing on new hires at a rapid clip. He was laid off in November 2022 and then spent almost a year job hunting before taking a role outside the industry. \n\nWhen a new opportunity came up with an electric-vehicle company at the start of this year, he felt so nervous about it not panning out that he hung on to his other job for several months and [secretly worked for both companies](https://www.wsj.com/articles/these-people-who-work-from-home-have-a-secret-they-have-two-jobs-11628866529?mod=article_inline) at the same time. He finally gave notice at the first job, only to be laid off by the EV startup a month later.  \n\n“I had two jobs and now I’ve got no jobs and I probably could have at least had one job,” he says.\n\nArnold says most of the jobs he’s applying for are paying a third less than what they used to. What irks him is that tech companies have rebounded financially but some of them are relying [on more consultants](https://www.wsj.com/articles/consultants-emerge-as-early-winners-in-generative-ai-boom-8df71d38?mod=article_inline) and are [outsourcing roles](https://www.wsj.com/articles/next-wave-of-remote-work-is-about-outsourcing-jobs-overseas-54af39ba?mod=article_inline). “Covid proved remote works, and now it’s opened up the job market for globalization in that sense,” he says. \n\nOne industry bright spot: People who have worked on the large language models that power products such as ChatGPT can easily find jobs and [make well over $1 million](https://www.wsj.com/tech/ai/the-fight-for-ai-talent-pay-million-dollar-packages-and-buy-whole-teams-c370de2b?mod=article_inline) a year. \n\nKnopp, the CEO of Pequity, says AI engineers are being offered two- to four-times the salary of a regular engineer. “That’s an extreme investment of an unknown technology,” she says. “They cannot afford to invest in other talent because of that.”\n\nCompanies outside the tech industry are also adding AI talent. “Five years ago we did not have a board saying to a CEO where’s our AI strategy? What are we doing for AI?” says Martha Heller, who has worked in executive search for decades. If the CIO only has superficial knowledge, she added, “that board will not have a great experience.” \n\nKugelman, meanwhile, hung his last flier in May. He ended up taking a six-month merchandising contract gig with a tech company—after a recruiter found him on LinkedIn. He hopes the work turns into a full-time job.\n\n  \n",
      "subreddit": "cscareerquestions",
      "score": 856,
      "url": "https://reddit.com/r/cscareerquestions/comments/1fkk27g/wsj_tech_jobs_are_gone_and_not_coming_back/",
      "comments": [
        {
          "body": "wait they aren't paying big money for moonshot projects\n\n  \nbut they are also putting enormous resources into AI",
          "score": 790
        },
        {
          "body": "&gt;Some tech workers have started ... signing up for AI boot camps  \n...  \nOne industry bright spot: People who have worked on the large language models ... can easily find jobs and [make well over $1 million](https://www.wsj.com/tech/ai/the-fight-for-ai-talent-pay-million-dollar-packages-and-buy-whole-teams-c370de2b?mod=article_inline) a year\n\nGood article to push naive / prospective / dumb tech workers into AI lol\n\nThese people are not going break into AI without a top PhD + publications + relevant experience. I might be proven totally wrong, but today's AI R&amp;D is arguably cannibalizing itself, e.g., SearchGPT and Perplexity, o1 / multi-modality and YC funded GPT wrappers, AI training on AI, etc",
          "score": 477
        },
        {
          "body": "There is a single sentence out of all that word vomit which matters.\n\nCompanies are paying the equivalent of several engineers to random AI \"talent\".  I've seen this play out where devs we had, who have exactly zero AI skill, would claim to have it, and get hired for triple the going rate for senior devs.\n\nIt's a bubble.  All the hallmarks are there.  Nobody other than Nvidia is making meaningful progress towards ROI, per their quarterly calls.  It's going to violently pop the way it always does.  Give it a few months after that and then we see investment in customer value again instead of the AI ego race.",
          "score": 1031
        },
        {
          "body": "I scanned the article. The evidence that jobs are gone forever is:\n\n1. A marketing guy who hasn’t found a new job (not a software dev).\n2. Am experienced professional who had to look for a job instead of getting hooked up by one of his friends - he did find a job for a 5% pay cut.\n3. A coding boot camp graduate who couldn’t find a job in 7 months.\n4. AI hype.\n5. Less internships posted (no info cited).\n6. A guy complaining that entry level jobs ask for prior experience.\n7. A statement about non-technical tech workers having a harder time.\n\nIn others words, this article is making very strong claims based on flimsy anecdotes.",
          "score": 429
        }
      ]
    },
    {
      "title": "Fired on my 5th day because I asked a \"basic question\" on my 4th day.",
      "body": "About me: 21F, I have roughly a little less than a year worth of experience as a dev. Bootcamp graduate. Based in the UK.\n\n**How the interview process went:**\n\n* CEO: \\*is impressed by resume, thinks I'll be a great fit\n* Lead dev: \\*Asks me some React questions - I answer them. Asks me if I know Redux and I said no.\n* Lead dev: \\*Gives me a React challenge which is apparently one of the features of their product. I finish it and add some extra features I think will make the app have a better user experience.\n* CEO a few days later \\*says lead dev was really impressed by my work\n\nI get an offer. I am very happy. **The lead dev seems extremely nice and tells me to ask him any question whenever I might need help or get stuck.**\n\nDay 1 - Day - 3: I see that the codebase is really messy. Some parts use JavaScript, some use TypeScript. Some use class components, some use functional components. Some files are extremely massive which can be broken down into smaller components/chunks. I was already told that they hired lousy devs in the past and that the codebase is trash now. I am given to implement some design changes for the login, sign up and a forgot password page. It's my first day and I dunno where is what, I make some simple changes on my own branch. Second and third day, I am almost done. Just some design tweaks here and there.\n\nThese 3 days I asked the lead dev lots of questions, most were on git as I was struggling to rebase my branch off of development and merging with development instead of master. He happily helped me and in some cases he told me to problem solve it on my own, which I successfully did.\n\nDay 4: I have to make two components interact with each other and from the codebase it wasn't obvious to me that they are parent-child. Even though I dunno Redux, I thought that is possibly the only way to implement the interaction. I ask the lead dev about it (previously he told me before my first day that he will give me a crash course on it) and he said **we'll jump on a call soon** (we work remotely) - so ***he*** **offered to help**.\n\nHe sees the problem and lets me realize that they are parent child, and so I can just pass props (no prop drilling required). I had to pass the prop from child (written as function) to parent (written in class) and I got a bit confused and asked him what will be the best way to tackle it - he says \\`${myName} that's very basic\\`. I realize its probably a dumb question and asked him not to worry about it and that I'll figure it out.\n\n**NOTE**: I know I'm expected to know React, which I do and would have solved this on my own - just got slightly confused and since we were already on a call and I have been told before that I can ask for help whenever I need, I went ahead and asked it. As you know I was initially expecting some Redux topics to get knowledge on and how it has been used on the codebase.\n\nDay 5: Starts with a meeting, where the CEO says that the lead dev said that I ask a lot of questions that I can just \"google\". The lead dev said I asked a very basic question and that I don't know how to pass props. Funny thing? - the feature I worked, I literally made an extra component myself to keep my files cleaner. The component is of course reusable and can be used throughout the codebase. So I respectfully told him that if I didn't know how to pass props I couldn't have created the component and used it.\n\nHe didn't reply to that and just closed of saying I wouldn't be a good fit. He further added something like, \"Ik I said, you can ask for help/ask questions. Well that isn't quite true\". I was shocked.\n\nP.S: Worst thing about this experience? The first 3 days of my work, I had 3 interviews (one with a *very* big company). When I got the job, I cancelled interviews with all 3.",
      "subreddit": "cscareerquestions",
      "score": 2750,
      "url": "https://reddit.com/r/cscareerquestions/comments/r67an5/fired_on_my_5th_day_because_i_asked_a_basic/",
      "comments": [
        {
          "body": "Make sure to reach out to the recruiters to un-cancel those interviews. 90% chance they'll do it",
          "score": 1953
        },
        {
          "body": "A 21 year old who done a bootcamp and has very little experience. What are they expecting? I don't expect someone with a bachelors degree and years of experience to contribute much the first few weeks.\n\nAnd if they are switching frameworks or only have beginner knowledge of the frameworks we use, I expect them to ask \"stupid\" questions. Even if they Google it, some things are done in multiple ways by others and the company/team might prefer a specific way so it's good to ask.\n\nSounds like a toxic environment, good riddance.",
          "score": 1663
        },
        {
          "body": "You dodged a big bullet. Sounds like a terrible company with terrible employees. You are better off elsewhere. It is important to ask questions. I ask questions every single day at work and if I was at your workplace I probably would have been fired the first  hour. Good luck on your job hunt!",
          "score": 1450
        },
        {
          "body": "\nThis comment has been purged in protest to reddit's decision to bully 3rd party apps into closure.\n\nI am sure it once said something useful, but now you'll never know.",
          "score": 752
        },
        {
          "body": "Also the code base isn't bad because they \"hired lousy devs\"... its because they obviously have terrible leadership",
          "score": 231
        }
      ]
    },
    {
      "title": "My horrible google interview experience.",
      "body": "A few days ago, I literally had the worst phone interview of my life. So far I had thought that working at google would be one of my primary choices career-wise... but boy will I NEVER interview with them again.\n\nJust a small background on me (relevant to the below). I am pretty smart, contributed to open-source projects, have done plenty of side-work, practiced doing interviews and so far NEVER got rejected on the phone stage. Said that, I by no means think \"I am entitled to anything\" and have had my fair share of on-site rejections, which I take in a constructive manner.\n\nSo the phone rings and I am expecting a call from google. Guy talks on the other end. Doesn't even introduce himself or does any small talk. We get to coding immediately. He asks me to write a DoubleLinkedList API so that he can have a way to keep inserting in sorted order. I do it in 5 mins.\n\nGive him some 'ready to run' test-cases, so he literally copy pastes my code and runs it. Tells me my code is useless -.-'\n\nI find the only bug in a few mins (I had forgotten to update the head pointer). He tells me it works now, but by now even a donkey could have programmed it -.-' I keep my calm and let him know that it has been only 10 mins and I am in an interview, nerves kick in, etc.\n\nHe proceeds to go on with asking about my resume. At this point I politely ask him if this means I failed the interview which is implied by [this thread](http://www.reddit.com/r/cscareerquestions/comments/1z97rx/from_a_googler_the_google_interview_process) on reddit.\n\nHe abruptly tells me he doesn't have time for stupid questions -.-' and keeps asking about my resume. At this point I almost had had enough, but I kept my cool and told him about my resume.\n\nAt the end he tells me it's my turn to ask him questions now if I have anything 'smart' to ask -.-'\n\nI ask him how long he has been at google. He says 7 years. I tell him he must be very well integrated in the company. He asks me what this 'integrated' awkward thing is -.-'\n\nHe keeps telling me about how they only hire smart people... and they wanna keep it that way -.-'.\n\nSurely, some days after the HR sends me an email, saying they are not going to move forward. I was really tempted to give her some constructive feedback on how the interviewer was rude, but instead I kept calm and just went on with my day.\n\nDISCLAIMER: In case you didn't understand by now. -.-' denotes me facepalming and hitting my head against the monitor.",
      "subreddit": "cscareerquestions",
      "score": 177,
      "url": "https://reddit.com/r/cscareerquestions/comments/2ll864/my_horrible_google_interview_experience/",
      "comments": [
        {
          "body": "If the interviewer explicitly used phrases including \"by now even a donkey could have done it\", \"do you have any smart questions\", \"i don't have time for stupid questions\", and so on, and this is not just an exaggeration on your part, let your recruiter know. That is not a good interviewer and you should ask for another one.",
          "score": 218
        },
        {
          "body": "I personally would have taken this up with HR. Not because I would still want to work here but because I absolutely detest unprofessional people. It's sad that people like that are allowed to work there, let alone interview people.",
          "score": 57
        },
        {
          "body": "The guy on the other side was having a bad day/year/life (or he's just got Asperger's, but is a star coder). Anyway, if you can code a working DoubleLinkedList API in 10 minutes, you are amazing in my eyes. fwiw.\n\nYou'll read over and over again that if you don't pass the interview with one person at Google (or other big company), try again and you'll get someone completely different and you may pass with them. Google is a massive company with many, many different teams and team leads.",
          "score": 78
        },
        {
          "body": "You should absolutely send this feedback to the HR person.  That guy shouldn't be doing interviews at all.",
          "score": 14
        },
        {
          "body": "I actually had a phone interview yesterday, I had a really good experience with it.  I was worried though after reading some threads like this.",
          "score": 13
        },
        {
          "body": "Some people have ultra-confrontarional interview styles. I graduated with a b. Eng and went to an interview where the guy proceeded to tell me the world-reknown professor was shit and that I didn't know anything useful. I don't really understand it, it's either a bad day or a brainless attempt to see how you handle yourself under pressure. \n\nI do think you blew it when you challenged him on if the interview was over because you are stepping out of line email on the interview -interviewee dynamic.",
          "score": 11
        },
        {
          "body": " -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-' -.-'",
          "score": 53
        }
      ]
    },
    {
      "title": "GOOGLE interview feedback. how long did it take (if you went through agency)",
      "body": "",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ooc7g0/google_interview_feedback_how_long_did_it_take_if/",
      "comments": [
        {
          "body": "Feedback timing varies, but usually, it's around 1-2 weeks after the final interview. If you're not receiving an offer, feedback might be less detailed compared to successful candidates, focusing on areas to improve like coding skills or problem-solving approach. Keep practicing common interview patterns and consider mock interviews with AI tools for better prep.",
          "score": 1
        }
      ]
    },
    {
      "title": "Software Engineer 3 Years of Experience - My Path to from 77k TC to 300k+ (70 LC)",
      "body": "Hey all - just accepted an amazing offer with a great company and I wanted to share my interviewing experience over the course of the last two months! This post is to serve as a recap for me, and a source of information for you all who are in similar spots. And as always...a little bit of a humblebrag. I'm happy to answer any questions for anybody who has them.  \n\nMy first job out of school was for 77k, my second job was 140k -&gt; 165k after a promotion, and my third job is over 300k now.\n\nHere are my interview stats from this interview run. Each step marks where the process ended for me, either by being denied or by ending the process myself.\n\n**Offers:** \n\n1. Microsoft\n2. Bay Area Tech Startup \n3. Capital One\n\n**On-sites:** \n\n1. Amazon (cancelled due to offer)\n2. Google (cancelled due to offer)\n3. Spotify (cancelled due to offer)\n4. Attentive (denied)\n\n**Tech Phone Round/Take-home Round:** \n\n1. Hudson River Trading\n2. Robinhood\n3. Oscar Health\n4. Capsule\n5. Audible\n6. Datadog\n7. LinkedIn\n8. Peloton \n\n**Recruiter Phone Screen Round:** \n\n1. Roblox\n2. Blend\n3. Palantir\n4. Candid\n\n**No Interview After Cold Apply/Referral:** 34 companies including Uber/Lyft/FB/Twitter  \n\nAnd of the above, below are the companies I got referrals to versus the companies I got in through a recruiter (they reached out to me/I reached out to them)\n\n**Referrals:** Facebook, Microsoft, Linkedin, Twitter, Peloton, Spotify\n\n**In Through Recruiter:** Google, Amazon, Palantir, Candid, Capital One, Attentive, Instacart, Audible, Datadog\n\n***Offer Details:***\n\nI accepted an offer from one of the companies I got an offer from. My base is 170k, stock is 150k yearly. \n\n***Key Things Learned***:\n\n1. No matter who you are, it's a numbers game at the end of the day. Don't take things personally, and do as many interviews as you possibly can \n2. Network, network, network. I kept a list of former teammates and companies they left for, people I've met online through various forums who work at big companies, IRL friends who work at big companies, etc etc. And when I went to interview, I hit all of them up and asked for a referral. It was a crucial part of the process\n3. Time your process well. I interviewed with a bunch of \"sub-tier\" companies to get real world practice after I was done with Leetcode/mock interviews/other practice. I had my Capital One and Attentive onsites before any important ones, and they were crucial in my later onsites. Case in point, I failed my first onsite (Attentive) but passed my next 3 \n4. For practicing Leetcode, quality &gt; quantity. I did about 70 Leetcodes spread across graphs, trees, dynamic programming, string puzzles, array puzzles, linked lists, LRU cache/binary search/hash map from arrays type questions, etc. If you can't pick up on the general patterns by then, you should work on your approach and question quality\n5. Work on your resume. Go on resume review sites and pay for reviews. Post every week in this subreddit. It's important\n6. Know your language. Practice/document all syntax things you will need to do all types of questions. Don't let this be the thing that fails you \n6. Document all of your Leetcode studying/DS Algo studying/behavorial answer prep in Google drive or something.  Here are my documents:\n\nLeetcode: https://filebin.net/nm5uujkzm98nnnia/Leetcode_Question_Categories_and_Approaches_2020.pdf?t=58w84x0r\n\nMy General Interviewing Notes:\nhttps://filebin.net/riz9aw0wpk7xfv7j/2021_All_In_One.pdf?t=fmlz26uh\n\nAll My DS Notes/Algo Notes:\nhttps://filebin.net/ev3xloctvaimslq4/Algos_and_DS___Other_Notes.pdf?t=hosd02ma\n\nI highly recommend making stuff like this yourself. It is super helpful in staying organized, keeping stuff fresh and committed to your mind, and it will always be there next time you interview :) \n\nLet me know if anybody has career questions, I'd love to help out",
      "subreddit": "cscareerquestions",
      "score": 2358,
      "url": "https://reddit.com/r/cscareerquestions/comments/l6evby/software_engineer_3_years_of_experience_my_path/",
      "comments": [
        {
          "body": "Just chiming in to say multiple mods have had their fingies on this thread due to excessive reports. All of the reports have been reviewed. If there are specific things you feel warrant further review, [drop us a modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fcscareerquestions).\n\nAs always, smash that report button if you feel like a post or comment violates [the sub's rules](https://www.reddit.com/r/cscareerquestions/wiki/posting_rules) -- we recently added some mods and have additional capacity to work the queue.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 557
        },
        {
          "body": "Location is really important with these posts",
          "score": 76
        },
        {
          "body": "[deleted]",
          "score": 72
        },
        {
          "body": "Has to be Instacart; no way the other 2 pay that much (and not like I knew Instacart pays that much).",
          "score": 38
        },
        {
          "body": "&gt; On-sites:   \n&gt;   Amazon (cancelled due to offer)  \n&gt;   Google (cancelled due to offer)  \n\nI don't really understand why, but canceling is almost as sweet as getting an offer.  I have cancelled on-sites at Google and Amazon, and I like to consider it a big \"fuck off\" to the way they treat candidates as cattle.  \n\nYes, I know it doesn't affect them at all, but it's just the little victories that make life sweet.",
          "score": 326
        },
        {
          "body": "[https://www.reddit.com/r/cscareerquestions/comments/eo7n49/fyi\\_dont\\_trust\\_any\\_post\\_that\\_says\\_i\\_used\\_rooftop/](https://www.reddit.com/r/cscareerquestions/comments/eo7n49/fyi_dont_trust_any_post_that_says_i_used_rooftop/)\n\nDeja vu",
          "score": 185
        }
      ]
    },
    {
      "title": "Don't give up!! How I landed a job in 1 month.",
      "body": "I am writing this for the people who are feeling discouraged about the job market as I know I felt. I am a new grad with a B.S. in Software Engineering who was lucky enough to be able to find a job after only a month of searching.\n\nHow did I do this?\n\n1. I searched for jobs **locally**. I feel like people get stuck looking for exclusively remote jobs. I applied to remote jobs too, but with very little success. The ones that responded the most were the ones that I found locally. I live an hour from a major city in the northeast, so I made sure to look for companies near and around the city as well as near me.\n2. I searched for jobs **directly on company websites**. Oftentimes, I found that companies near me - especially smaller ones - did not post their jobs on major websites like LinkedIn or Glassdoor. I highly recommend searching company websites in your area. I googled “tech companies near me”, “largest employers near me”, “healthcare companies near me”, etc., went down lists of companies and and went to their company website career page. It was tedious, but worked great to find those “hidden” roles.\n3. I submitted a **cover letter for every application**. I used the same cover letter template for nearly all the jobs I applied to and changed a few sentences based on the company's mission statement/position. Thanks to ChatGPT. (Edit: Please do not ask me for a copy of my cover letter or resume. I have removed it for privacy)\n4. I searched for **new job postings daily**. On LinkedIn, Glassdoor, Otta, Google jobs, and the company websites of companies that I was most interested in around my area I searched for the keywords \"new grad, associate, junior, intern, internship, entry-level\". Be careful of scams! \n5. I included **keywords** from job postings in my **resume**. I made sure to only include keywords of areas that I could show that I had experience in and bolded them. I also made sure to add them to my LinkedIn skills. (Edit: Please do not ask me for a copy of my cover letter or resume. I have removed it for privacy)\n6. I searched for jobs in tech **outside of my area of expertise**. Instead of applying to just \"software engineer, developer, full-stack, front-end, back-end\" positions I also searched for positions adjacent to software but still in tech. \"Data analyst, Business analyst, IT, Programmer Analyst, Computer Engineer, etc.\" Beggars can’t be choosers!\n7. I **cold-called** companies and recruiters in my area. If there was a company I was particularly interested in I would ask to connect on LinkedIn with a note saying \"Hi there \\[name\\], I am extremely interested in working at \\[company\\]. It would be great to connect for a 10-minute chat to see if I might be a good fit. I am looking for a role in \\[tech area\\]. Please let me know if there is someone else on your team I should reach out to instead!\"\n8. I **connected with recruiters** from companies that I **already applied to**. I went on LinkedIn, searched the company, went to the company page, went to “people” and searched the keywords “recruiter, recruiting, talent, acquisition, early career, career, people”. Then I changed the location to my area. If I found someone, I sent a connection request with a note stating that I applied to a role and was looking to learn more about the company/role. If no recruiters were in my area, I would message a recruiter from a relatively close area and ask if they could connect me to someone in my area.\n\nOverall, I applied to 93 jobs over 1 month and had 17 rejections. I tried to apply to 5-10 a day, some days with less success than others but I made sure to keep track in an Excel document. This past week I had 3 successful interviews with two offers and landed a remote Data Analyst job at 70k. I realize I am very lucky, but I hope this might help someone else or encourage them to keep going! Don't give up!\n\nEdit: Here is a link to a template I based my Excel job tracking spreadsheet on: https://docs.google.com/spreadsheets/d/1b4_lpHeLb9NldVWgWKq14nMxHEvlF3qMpEd3QdOc7Ck/edit\n\nEdit: Added to #8 and #2\n\nEdit: Thank you all for the positive comments and awards! I’m glad I could help some people on their journey. \n\nEdit: To the people that are saying to #6 “*THiS iS BAd AdVICe FOr pEoPLe wHO WAnT a SWE JoB*”, I’m sorry, but you are *totally* misguided. **Any experience is better than no experience.** You can always leverage skills from similar jobs, personal projects, and certifications towards the job you want in the future. Getting your foot in the door when you’re fresh out of college is *far more important* than waiting months and months for the “right” job, leaving you with large gaps in your resume - **especially in this job market.** There are *many many* jobs without the title SWE that require programming. Experience comes with time. Don’t listen to people who tell you otherwise and don’t listen to people who put down non-SWE jobs/careers. This is attested by my professional mentors. 😊 Rant over, thanks!\n\nEdit: I’ve removed access to my resume and cover letter for privacy. Please do not DM me for access, but feel free to DM with questions related to the post. This post is far more about the process than the resume/cover letter. There are many other wonderful posts on this subreddit about resume/cover letter building! Thank you for understanding. ",
      "subreddit": "cscareerquestions",
      "score": 1121,
      "url": "https://reddit.com/r/cscareerquestions/comments/1dqoaa9/dont_give_up_how_i_landed_a_job_in_1_month/",
      "comments": [
        {
          "body": "Thank you and congrats! For #8 how often did you actually get responses, especially positive ones? I would feel so obnoxious doing that but if it works maybe I'll try it out.",
          "score": 83
        },
        {
          "body": "Cold-calling is so underrated. My wife and I both got our current jobs in our respective areas of expertise by cold applying to companies not actively hiring.\n\nSomething to consider is that a need can exist in an organization for quite a while before any active recruitment occurs. Any time you find yourself saying \"this place seems awesome, it's a shame they aren't hiring\" try reaching out! Gumption is back, baby!",
          "score": 49
        },
        {
          "body": "Heyooooo, i got a data analyst position too.\n\nHowever it did take me 8 months.",
          "score": 132
        },
        {
          "body": "Congrats! Like others have mentioned, you’re not lucky - you worked harder and put in more effort than others. You deserve it!",
          "score": 30
        },
        {
          "body": "I think applying on company websites might actually super useful advice. I heard back from ibm and Accenture both within a week of applying to positions directly from their website. I think maybe some of those listings don’t make it to the job boards or they don’t go viral on the job boards atleast. Like when you just go on LinkedIn everyone sees the same stack of jobs so the first hundred jobs you see, everyone has also seen them and applied to them.",
          "score": 24
        },
        {
          "body": "This may be a dumb question, but how did you search for jobs locally?",
          "score": 12
        }
      ]
    },
    {
      "title": "Why companies say there is shortage of talent and then do 5 hour leetcode?",
      "body": "I just don't get it, do you have a doctor do on spot surgery before being hired. Should exp count for something?\n\nEDIT: Some are making argument that it works for Google, their engineers are really high quality. But that's a dumb argument because unless you are paying $400k and getting 1 million resumes you can't afford high false negatives. Google can pass on 300k good candidates who are little rusty on algo and still end up hiring 100 good devs. You will only get 500 resumes. \n\nNum of Bad SWE &gt; Num of Good SWE &gt; Num of (Good candidates + Good leetcoders)",
      "subreddit": "cscareerquestions",
      "score": 1206,
      "url": "https://reddit.com/r/cscareerquestions/comments/q9fzh3/why_companies_say_there_is_shortage_of_talent_and/",
      "comments": [
        {
          "body": "The disconnect is real. I recently had an acquaintance join Microsoft. This guy is a LeetCode God, has solved 700 problems and quite literally can give you solutions in 10 minutes or less for mediums. Cleared Amazon, Microsoft and Goldman Sachs interviews. 3 months into the job he was given Insufficient Results rating and now is actively trying to get back to the old company.",
          "score": 466
        },
        {
          "body": "I really dont understand why people treat programming so different than other jobs.\n\nMost programming jobs are *not* that serious and don't require you to work *that* urgently, despite what our managers would have us believe.\n\nYou don't need top-notch talent for all, or even most, programming jobs. More often than not, you just need someone that can learn on the fly and get done what they need to get done.\n\nLeetcode is a BS, lazy, unnecessary screening method for the vast majority of programming jobs.\n\nIt doesn't actually test programming ability in a work environment:\n\nIt doesn't test your ability to acquire and understand requirements. It doesn't test your ability to research methods to find the most efficient solution to a given problem. It doesn't test troubleshooting ability. It doesn't test your ability to document. It doesn't test your ability to communicate with colleagues and clients. It doesn't test your ability to collaborate with others.\n\nWhat it tests for is extremely narrow and only reflects *part* of what it takes to be a good programmer. While it has its place, it shouldn't be used nearly as ubiquitously as it is",
          "score": 26
        },
        {
          "body": "First - there’s a shortage of *quality* talent. There’s a surplus of applicants. Most applicants are pretty terrible. \n\nSecond - you’re failing to view things from the perspective of the company. Given that there tons of applicants, but only a small percentage are any good, companies need an efficient and scalable way to filter out the poor candidates. And it works. The quality of engineers at these big tech companies generally is much better than the average. There’s also a remarkable lack of *bad* engineers, even at places not known for PIP and firing.",
          "score": 686
        },
        {
          "body": "&gt; do you have a doctor do on spot surgery before being hired\n\nThe medical field has tons of regulations. When was the last time you saw 5+ certifications framed behind a SWEs desk?\n\nIn many other fields, there are tons of regulations behind legally practicing anywhere. So if I see so-and-so worked 5 years at any law firm, I can assume they are competent enough to have legally practiced.\n\nThis is not true with SWE, which is why at every level we have to re-verify their experience to make sure they aren't in some insane parallel universe.\n\nImagine if being a lawyer for 5 years could also mean \"your firm had a website since then but hasn't taken on any cases.\"\n\nImagine if being an architect for 5 years meant \"tried to learn on the job but since then has just pulled no weight on every team.\" This architect still includes the entire company portfolio in his resume.\n\nMedical interviews would definitely include pair surgeries in this scenario.\n\nSo yeah, interviews are broken. However, if we had base certifications, people would complain about the cost of that like we see everywhere else. So it's a catch 22.\n\nI'm mixed on it, because on the one hand I'm grateful for the mobility I've had because as long as I know what an SWE should know, I can get a job anywhere. But as someone more senior the thought of putting in extra work exhausts me.",
          "score": 24
        }
      ]
    },
    {
      "title": "Blind leading the blind",
      "body": "I regularly browse this subreddit, as well as a few other sources of info (slack channels, youtube, forums, etc), and have noticed a disturbing trend among most of them. \n\nYou have people who have never worked in the industry giving resume advice. People who have never had a SWE job giving SWE career advice, and generally people who have no idea what they're taking about giving pointers to newbies who may not know that they are also newbies, and are at best spitballing.\n\nAdd to this the unlikely but lucky ones (I just did this bootcamp/ course and got hired at Google! You can do it too!) And you get a very distorted community of people that think that they'll all be working 200k+ FAANG jobs remotely in a LCOL area, but are largely moving in the wrong direction to actually getting there.\n\nAs a whole, this community and others online need to tamp down their exaggerated expectations, and check who they are taking advice from. Don't take career advice from that random youtuber who did a bootcamp, somehow nailed the leetcode interview and stumbled into a FAANG job. Don't take resume advice from the guy who just finished chapter 2 of his intro to Python book. \n\nBe more critical of who you take your information from.",
      "subreddit": "cscareerquestions",
      "score": 1416,
      "url": "https://reddit.com/r/cscareerquestions/comments/10q61ix/blind_leading_the_blind/",
      "comments": [
        {
          "body": "\\*New Grad flair intensifies\\*",
          "score": 195
        },
        {
          "body": "Same problem in fitness, sports discussion &amp; other hobby subreddits. People really enjoy exaggerating their own credentials/knowledge anonymously online. I mean look at what’s been happening with WSB/SS and other meme investing subs, it’s a bunch of college students cosplaying as financial analysts.",
          "score": 553
        },
        {
          "body": "I come here for a good laugh tbh",
          "score": 468
        },
        {
          "body": "95 percent of this subreddit revolves around the same topics:\n\nTrying to get into FAANG and can’t, my life is over.\n\nPeople having a bad day at work and everyone telling them to quit immediately.\n\nLayoffs/ChatGPT/outsourcing has killed the future of software development, my life is over.\n\nI’ve put out 100 applications and no job, my life is over.\n\nHow do I get past a PIP.",
          "score": 149
        },
        {
          "body": "First day on the internet?",
          "score": 301
        }
      ]
    },
    {
      "title": "Anyone want office hours with a 25 year SWE?",
      "body": "Hey everyone!\n\nI was thinking of just putting up a google meet link every now and then that anyone could join (first come, first serve) and ask questions about getting jobs, how to structure software, interview prep or just design questions on software you might be working on.\n\nWho I am: 25 year SWE, veteran of Fortune 500s, startups and everything in between. I've worked heavily on backend and infrastructure as well as robotics. Lots of different projects and I've been hiring and running interviews for more than half of my career.\n\nIf there is interest I can post a link and set something up for this evening.\n\nCheers!\n\nUPDATE: Wow, lots of interest! Here is the meeting link: Office Hours\n\nFriday, October 17 · 6:30 – 7:30pm\n\nTime zone: America/New\\_York\n\nGoogle Meet joining info\n\nVideo call link: [https://meet.google.com/bvq-meph-sfq](https://meet.google.com/bvq-meph-sfq)\n\nSee you guys this evening!",
      "subreddit": "cscareerquestions",
      "score": 415,
      "url": "https://reddit.com/r/cscareerquestions/comments/1o91zl7/anyone_want_office_hours_with_a_25_year_swe/",
      "comments": [
        {
          "body": "I have 25+ YOE and can’t imagine being able to give anyone any kind of useful advice in this job market.",
          "score": 104
        },
        {
          "body": "At first, I thought you were a 25 year-old software engineer haha! But 25 years of experience? I’m in!",
          "score": 179
        },
        {
          "body": "I have a general question... how do you stay sane after 25 years of programming? Or did you?",
          "score": 122
        },
        {
          "body": "Interested. How to join?",
          "score": 12
        },
        {
          "body": "There’s only one question and you can answer it here, what’s your net worth and why aren’t you retired already?",
          "score": 12
        }
      ]
    },
    {
      "title": "This market is brutal. I'm on my last bit of emergency funds",
      "body": "I was searching for a better job last year and my response rate was not great but not terrible. Probably 1/20 responses for an initial phone screen which usually moved to some online assessment and into some online coding interview. This time around is crazy. I've sent out \\~300 applications and none decided to move on. The difference between my resume is only my last job which lasted 9 months due to lay off.\n\nI've got \\~6 years of experience, which is kind of all over the place with software development, test automation, devops. So I think a little bit of everything is kind of hurting. I've been leetcoding and applying, but I'm not sure what to do anymore. Maybe pick up some additional skills like SQL or AWS knowledge or something. I will have to take a job at Mcdonald's soon (if I can even get that) or start an onlyfans.\n\n&amp;#x200B;\n\n[Resume](https://drive.google.com/file/d/1fPBPPVKx-9rGdyBSIeVSXsx4zQUUp_mz/view?usp=sharing)\n\n[Reworked\\_rev1](https://imgur.com/a/XwxT5Wb)\n\nEdit: I've included my resume for all critiques\n\nEdit2: Work on my resume with the following in mind (BTW, thank you all for your suggestions):\n\n\\- Change bullet points to highlight how I've impacted the company\n\n\\- Be more specific and provide details without using so many buzzwords\n\n\\- Improve skills section. It is too sparse and weirdly categorized\n\n\\- After resume rework is done, pick up some knowledge on some commonly used tools\n\nEdit3:\n\n\\- Added revision 1 of reworked resume. Not sure if I can make a whole separate resume to highlight SWE work since most of my experience is in testing and developing software for testing. Should I leave out the last company and just say I was on a 1 year break?",
      "subreddit": "cscareerquestions",
      "score": 931,
      "url": "https://reddit.com/r/cscareerquestions/comments/12xp3ku/this_market_is_brutal_im_on_my_last_bit_of/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 822
        },
        {
          "body": "That resume truly fails to communicate any value added by you. \"Fixed bugs and implemented feature requests\" tells us nothing.",
          "score": 101
        },
        {
          "body": "He's like 'If I can get a McDonald's job' LOL. Hang in there buddy. Apply to everything, even things outside your scope if you need money (product management etc.)",
          "score": 91
        }
      ]
    },
    {
      "title": "Need Help with Google interview",
      "body": "I got a reply from a Google recruiter for an internship and they are scheduling a phone interview with me. This is my first interview and I want to do extremely well. What are some of the questions they ask on these interviews? How can I practice and prepare for them?",
      "subreddit": "cscareerquestions",
      "score": 85,
      "url": "https://reddit.com/r/cscareerquestions/comments/3mhuuk/need_help_with_google_interview/",
      "comments": [
        {
          "body": "Google interviewer here :).  Here is some advice:\n\n- Relax.  Have fun.  If you aren't having fun, something is wrong.\n- Go through your algorithms book and work on solving the problems.  You should be able to easily solve the end-of-chapter problems iteratively, recursively, using brute force, and using a more efficient strategy.  Practice writing the implementing code down on paper and THEN check it for correctness.  In an interview, you don't get a compiler and hand-writing out code can be awkward.  Practice now.\n- Remember, in a phonescreen, we can only ask \"easy/moderate\" questions.  We know how awkward this is because we've all been through the process.  We aren't going to hit you up with something difficult on the first date.\n- For an engineering internship, the questions will be scaled to topics that any undergraduate student having taken an algorithms course should be well prepared to answer.  For a SRE internship, there will be some systems topics as well.  I'm sorry, I don't know much about the other job areas.\n- Come interview day, remember, your job is to solve the problem.  Brute force the damn thing if you have to, but make sure you've solved the problem.  If you haven't at least solved the problem, you've likely failed the interview.  It is a mistake to spin your wheels talking about what is inefficient without actually solving the problem first.  Get something working, and then refine it.  Contrary to what you might think, you really don't want to try to impress your interviewer by blasting out the optimally efficient solution from the start.  You will very likely fail and would have been much better off building up a solution from something slower but easier to comprehend.  This is a common mistake I see **all the time**.  It's really easy to avoid this trap ;P\n- For any Google interview (internship, fte, phonescreen, onsite), it is a mistake to start blasting out code before demonstrating a clear understanding of how to solve the problem.  Demonstrate to your interviewer that you actually have a strategy to solve the problem.  Don't derive that strategy while also implementing it.  In a phonescreen, the problem will be of sufficient difficulty such that this strategy can probably be described in a sentence or two (eg. \"recursively walk the graph, breadth first, and...\").  It's really easy to avoid this trap ;P\n- Ask questions and engage your interviewer.  We are looking to engage in a technical discussion, not throw something at you and silently wait for you to regurgitate the solution we are looking for.\n- Relax, and have fun ;P\n\nBest of luck :)",
          "score": 126
        },
        {
          "body": "There are tons of threads in this subreddit that will give you the information that you need. I interviewed with Google for a new grad position half a year ago and I found the posts dated back a few years are still incredibly relevant.\n\nStudy your data structures, algorithms, and OOP. Cracking the code interview will help a ton.",
          "score": 15
        },
        {
          "body": "I had an interview with them about a year ago for an entry-level position right after college.  \n\nFor the most part, what everyone else has said on this thread is true (in regards to how to prepare, what to expect, etc.) so this comment will be only about my personal experience with the Google interview process and how your experience with them will _wildly_ vary.  \n\nI got contacted by one of their recruiters about the position, and everything went well up until the first phone interview. The interviewer seemed very uninterested in giving the interview (you could tell by the way he was talking, he seemed very bored and like this interview was taking precious time away from his actual job duties). But that was nothing compared to the interview question they gave me, which was to implement the [Java BigDecimal](http://docs.oracle.com/javase/7/docs/api/java/math/BigDecimal.html) class.  \n\nWhat. The. Fuck.  \n\nThat was the only question of the 1-hour interview. For an entry level mobile dev position. For someone who literally just graduated (and it wasn't from a school known for their CS program).  \n\nI was expecting some sorting algorithm problem, or maybe, god forbid, something involving Android or iOS. But nope. Recreate BigDecimal. The problem also had restrictions in implementing it, which made the task harder (I can't remember what they were, but it eliminated any simple ways of solving the problem.)  \n\nSo yeah, horrible interview experience. Would I do it again with Google? Doubt it. The next week I interviewed with the same job somewhere else where they asked me iOS/Android-related questions, you know, actual questions directly related to the job at hand, as well as some basic general programming questions. Got a job offer before I even left the building.  \n\nSo if this interview you have turns out to be a complete fuck up, don't feel discouraged. Google's interviewing process is far from perfect, and despite all your preparation, you can still get blindsided with a random problem like I did, even at your level. But I think a majority of people never get past the 1st phone interview with Google anyway, they always do better the 2nd or 3rd time they try. So again, hope for the best, prepare for the worst.",
          "score": 13
        },
        {
          "body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.4604 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/91923)",
          "score": 4
        }
      ]
    },
    {
      "title": "Google Data Center Electrical Engineer Interview Process",
      "body": "",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1pa1j6q/google_data_center_electrical_engineer_interview/",
      "comments": []
    },
    {
      "title": "Google interview",
      "body": "I have been applying for full time roles for a month now and I applied for this role at Google. I got the assessment and then on September 19(original role) I received and email from Google which said that I cleared the assessment. This was not an OA but one of those work style match assessments. After this I haven’t heard back from them at all. Yesterday I applied for another role(second role) at Google and now their career page shows that they were not proceeding with my application for the original role but the second role says assessment passed. What should I do now. Do I need to wait or reach out to someone. Is this normal?",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1oibpsv/google_interview/",
      "comments": [
        {
          "body": "Of course it's normal. Just wait.",
          "score": 1
        }
      ]
    },
    {
      "title": "My Job Hunt as a Software Engineer with 5 YOE, 100k to 290k TC.",
      "body": "# TL;DR\nCS Bachelors with 5 YOE looking to switch jobs. Prepped for 5 months, passed 5/6 onsites and improved TC from 100k to 290k.\n\n#Background\nI have a CS Bachelors and 5 YOE, all at a large financial services company. I'd previously solved around ~100 LC problems on on a different account back when I was looking for my first SE job (The site probably had ~300 problems total back then, oh how times have changed...)\n\nNovember of last year I started casually doing problems, about a few per month. I didn't start seriously studying until April, when I started studying System Design and did ~400 problems over the course of 5 months. I started applying to jobs in July and interviewed in August.\n \n# Methodology\n## LeetCode\n[My LC stats](https://imgur.com/a/JUrA6vo).\nI solved an average of three new problems a day. One or two of these would be from NeetCode 150, until I finished. Instead of topic by topic, I did a different topic every day and cycled through them. I would also redo/look over past problems a day, a week and a month after solving them.\n\nFor non-NeetCode problems, I just sorted by interview frequency. In August when I was interviewing/had interviews scheduled, I did company tagged problems, also sorted by frequency.\n\nFor each problem, I'd spend anywhere from 10-30 minutes trying to solve it myself, depending on if I thought I was getting anywhere. After that I'd go straight to the answer. NeetCode's are usually the best, there were only a few problems where I preferred other solutions to his. For non-NeetCode problems I would first check if the official LC solution was any good. (it really depends on the Author, you usually can tell right away from the comments) If not, I'd go digging around in the discussion.\n\nA few times a week, I would also try solving a problem exactly how I would during an interview. (Asking questions, annotating what I was doing out loud, using well thought out variable names, commenting everything, going through Big-O out loud).\n\n## System Design\nBecause my old company is pretty dated tech-wise, I didn't have much experience with System Design despite my 5 YOE. I started off reading [DDIA](https://dataintensive.net/), but decided after a few chapters it was too dense and not great ROI from an interviewing perspective. However, it was a great read and I will go back to it at some point. \n\nI ended up reading the intro in [Alex Xu's System Design book](https://www.amazon.com/System-Design-Interview-insiders-Second/dp/B08CMF2CQF), as well as the topics in [System Design Primer](https://github.com/donnemartin/system-design-primer) to gain some basic knowledge.\n\nI then went through the examples in the Alex Xu book, as well as the ones in [Grokking](https://www.educative.io/courses/grokking-the-system-design-interview), for each example I took notes and practiced writing out the APIs, diagram and schemas.\n\nFinally, I went through and watched some mock interviews on the [Exponent youtube channel](https://www.youtube.com/c/exponentTV). These are pretty scripted but I thought they were still a decent representation of what an actual interview is like.\n\nThis prep brought from zero to pretty comfortably giving SE2 system design interviews, and I was even up-leveled at one of the companies I interviewed at.\n\n## Behavorial\nI made sure I had 2 stories for each of the common Rainforest Leadership Principles, about 15 total with overlap. For all other companies I just adapted my Rainforest stories on the fly.\n\n# Job Hunt\nIn total I submitted ~50 applications at ~25 companies. They were all through either recruiters, or applying directly on the Company site. Some notable ones below:\n\nCompany|Result\n:--|--:\nRainforest | Offer (L5)\nAudible|Offer (L5)\nBloomberg | Offer (SSE)\nCapital One | Offer (SSE)\nDropbox | Rejected (Resume Screen)\nGoogle| Ghosted by Recruiter\nLyft | Rejected (Onsite)\nMicrosoft|Rejected (Resume Screen)\nSpotify | Canceled Onsite\nToast|Offer (SSE)\nTwitter|Rejected (Resume Screen)\nUber|Canceled Phone Screen\n\nI ended up passing 5 of the 6 onsite loops I attended. After negotiating with the competing offers I had, I accepted one at 290k TC, Boston HCOL.\n\n# Thoughts and Takeaways\nThese are all just my opinions, please take them with a grain of salt!\n\n* LC premium is worth it. While not all the solutions will be like this, there were some that alone justified the entire cost, as they solidified my understanding of certain concepts.\n\n* Over-studied Dynamic Programming.\n * DP never really clicked for me, despite dedicating a large amount of time and trying various resources.\n * Out of all the problems I encountered between OAs, Phone Screens and On-sites, I only received a single DP problem, which was really an optimally greedy problem with a DP solution.\n * I could have just gotten lucky, it could also be a different story if you are interviewing with Google.\n\n* Under-studied Arrays and Strings.\n * I feel like these are sometimes glossed over since they are more \"basic\" data structures and I was guilty of this myself.\n * At least a third of the problems (with probably another third being DFS/BFS problems) I received were Array/String related, with no special data structure/algorithm beyond that.\n\n* Overall I was overprepped for algos. Case in point, for graphs I made sure I was comfortable with Union-Find, Djiktra's, Bellman-Ford, Kruskal's, Prim's, and was seriously considering some of the more obscure ones as well. I used these algorithms a grand total of 0 times during my interviews.\n\n * If your interviewer is having a really bad day could they give you a problem that needs some obscure algorithm to solve? Sure, but I feel like the overall ROI from knowing these is quite low, and the time would be better spent making sure you're really confident in the two granddaddy algorithms DFS and BFS, especially if you don't have as long as I did to prepare.\n\n* Communication is extremely important! Coming from a consulting background I feel like the bar on this for SEs isn't all that high, so being a strong communicator will definitely allow you to stand out. If you aren't comfortable in this, I suggest doing mocks with friends/coworkers, or looking for people in NeetCode's discord. \n\n* One upside to Rainforest's ridiculous emphasis on LPs is that it overprepares you for other behavorial interviews, I definitely felt like my behavorial interviews gave me a leg up. If you're not interviewing with Rainforest but are just looking for a structured way to prep for Behavorial, it honestly wouldn't be a bad idea to create stories for the common ones.\n\n* Following the advice in [this post](https://www.reddit.com/r/cscareerquestions/comments/ujjhpi/not_all_can_make_top_5_salaries_by_definition_but/) was great for negotiating.\n\n* Finally, for those on the grind for their first position, I promise it gets better! The difference between my first job and second job was truly night and day. \n\nThis subreddit has helped alot in terms of retaining my sanity this past year, so if you're interested in any of the specific interview experiences or are looking for advice, feel free to reach out, I'd love to help out.",
      "subreddit": "cscareerquestions",
      "score": 2001,
      "url": "https://reddit.com/r/cscareerquestions/comments/xpnxy2/my_job_hunt_as_a_software_engineer_with_5_yoe/",
      "comments": [
        {
          "body": "[removed]",
          "score": 411
        },
        {
          "body": "As someone with ~4 YOE at one company, also making $100k, and who has been grinding LC for the last 6 weeks… this was a very encouraging read. \n\nWell done dude.",
          "score": 303
        },
        {
          "body": "It’s a testament to how stupid the moderators are that OP had to resort to saying “Rainforest” instead of “Amazon” because the automod removes any post that contains the word Amazon. Imagine being on one of the most popular forums for discussing tech companies and you can’t even say the name of a FAANG company without censoring yourself in ridiculous ways",
          "score": 417
        },
        {
          "body": "[deleted]",
          "score": 102
        },
        {
          "body": "5/6 is a killer success rate, nice work",
          "score": 178
        },
        {
          "body": "Curious what your other offers were",
          "score": 65
        },
        {
          "body": "Were all the technical interviews coding challenge based and design? I am switching from Europe to US and from this it seems that I should be grinding leetcode and books. I am only on 4y experience but here technical interviews are not that common. You might get a home coding assignment or pair program on site. Would you mind sharing your CV layout.",
          "score": 31
        }
      ]
    },
    {
      "title": "A startup wanted me to work 10 am to 10 pm, 6 days a week",
      "body": "So some time ago [I was laid off from a startup](https://www.reddit.com/r/cscareerquestions/comments/171l6nv/just_got_laid_off_fired_from_a_startup_after_6/) and I started looking for work. In my emails was this recruiter from an NYC company called Fiber.ai, they do some AI bullshit, same as every other YC company that came out in the last couple of years. After talking to their recruiter for a sad moment, I wanted to share the company's (now deleted, or sadly, filled) [job post](https://web.archive.org/web/20230930112831/https://www.ycombinator.com/companies/fiber-ai/jobs/EqV3p4a-full-stack-engineer), and it has some incredible gems:\n\n&gt; $80K - $160K / 0.10% - 0.50%\n\n- Ah, starting off strong, who wouldn't want to make $80k in NYC? I won't even bother mentioning the pitiful equity.\n\n&gt; We raised &gt;$4M, generate &gt;$25k MRR, and signed 3 paid pilots with mid-market enterprises that will cumulatively convert at $470,000. We achieved all of this in just 6 weeks and are looking for someone who's *self-driven and autonomous* to build product that customers will be using every day as a core part of their workflows.\n\n- Translation: you will be doing all of the work.\n\n&gt; This job will require you to be a Swiss army knife of an engineer\n\n- Translation: *you will be doing all of the work*. Better than a rockstar, I suppose. Their list of tasks is also hilarious, they're looking for 5 different engineers, not one.\n\n&gt; We’re looking for a talented full-stack engineer to help us build out our automated prospecting, enrichment, and email personalization pipeline alongside our CTO, Neel, who was formerly at Google and did CS at Harvard (top 5%). You’ll be wrangling tens of gigabytes of data a day, using GPT4 and genAI tools to create hyper-personalized messaging at scale\n\n- Hear that? *Tens* of gigabytes! Nevermind the authority-building through working at *Google* and going to *Harvard*, what prestige!\n\n&gt; We will be working 3 days in person in NYC 10am to 10pm in a private office with flexibility to work 2 days remote. We are looking for someone self-driven who can work 55-60 hours a week, and we will compensate you well to make it worth your while.\n\n- And here's the best part, work 10 am to 10 pm daily (the recruiter specifically said it's a 6 day workweek from Monday through Saturday), and they'll make it \"worth my while\" with $80k. Classic.\n\nLooking at their bios below:\n\n&gt; Adi Agashe (CEO) and Neel Mehta (CTO) are the 3-time global bestselling authors of \"Swipe to Unlock,\" \"Bubble or Revolution?\", and \"PM's Sacred Seven\" which have been translated into 11 languages. They have worked together for the last 6.5 years and built a profitable 7-figure online business, where they manually hacked together marketing automations across several point solutions to scale.\n\n&gt; Adi spent 5 years as a growth Product Manager at Microsoft, scaling Azure hybrid revenue (using Marketo and similar tools). He graduated from Cornell University, where he studied computer science and was a Rawlings scholar (top 1.5%).\n\n&gt; Neel was an APM (later PM) at Google, working on Google Search. He graduated in the top 5% of his class at Harvard University, where he studied computer science and was a John Harvard Scholar. \n\nSo that's what's going on. These people *aren't even software engineers,* they just wrote some bullshit product management books, calling themselves \"bestsellers.\" I don't think they've ever worked as actual full time coders in their lives, and it looks like their LinkedIn confirms it.\n\n---\n\nThis is not even to talk about their interview process which was just abysmal. The recruiter calls me and tells me about the work schedule, and I just couldn't believe it at first. Do they really expect people to work 12 hour days? He said, yeah, but only for 18 months until the product is off the ground, as if that's any better. Just out of sheer curiosity, I asked what the next step was.\n\nHe said you'll have to do a take-home project. Here we go again, I thought, another take home, another rejection. I had previously done one a week prior which they explicitly told us was to be done in no more than 2 hours. It was a basic React/Node/TypeScript task, creating an API and creating a frontend to display it. So I thought it'd be in the same line, but I should have known from the 60 hours a week part that they'd want something completely insane.\n\nIt was a *20 hour* take-home project. That is literally half of a normal working week. I was so flabbergasted that it was literally *10x* the length of my previous take-home that I asked the recruiter, exactly how many people have actually gone through the take-home? Sheepishly, he said none, and I said, wow, what a surprise, who'd have thought? After that, I told the recruiter to tell the founders that I'm pretty sure only people with no life would want to join their company (which is likely exactly the kind of person they're looking for), and then I hung up the phone.\n\nGood riddance, and may God have mercy on the soul of whomever they filled that position with. And that layoff I was a part of? I'm doing a lot better now at a larger company, getting paid more and doing less work. Startups are something else, man.",
      "subreddit": "cscareerquestions",
      "score": 1138,
      "url": "https://reddit.com/r/cscareerquestions/comments/199cjdi/a_startup_wanted_me_to_work_10_am_to_10_pm_6_days/",
      "comments": [
        {
          "body": "0.5% equity for 80k compensation and 60 hour workweeks for the next year and half? 💀",
          "score": 420
        },
        {
          "body": "That's rich...too funny.\n\nMy favorite job postings by far are the ones where they name drop a person like:\n\n\"You'll be working with our CTO, Blah McBlarney and our Head of Engineering Blah Blahman\"\n\nLike I have any clue or care who these people are at all. There should be a reddit for horrible job postings.",
          "score": 602
        },
        {
          "body": "But but you can say you worked for ex-FAANG employees!!11",
          "score": 78
        },
        {
          "body": "The CTO wasn’t even a software engineer, he was a product manager. Last time I checked they don’t code. Yet you’re supposed to impress him, lmao.",
          "score": 56
        },
        {
          "body": "“ CTO, Neel, who was formerly at Google and did CS at Harvard (top 5%)”\n\nI would have stopped reading right there because Neel sounds like a stuck up piece of shit.  I don’t give a fuck where you worked and what school you went to.",
          "score": 347
        }
      ]
    },
    {
      "title": "Is Google worth ditching my new employer only 6 months in?",
      "body": "I passed the Google interview almost half a year ago but it took until today to have a team match. I am obviously very happy but having a lot of 2nd thoughts.\n\nThe issue is that I have recently started at another big tech (whose name based of a forest in South America) because the Google team matching was hopeless. I am considering the pros and cons and would appreciate everyone's input\n\nAdditional context:I am running out of my open work visa soon (non-US based). I have to rely on my employer to sponsor my closed work visa (binding) after it ends until I finalize my permanent status. Since switching jobs on the binding visa is much harder, it would effective make my choice a commitment at least 3-4 years long\n\nCurrent team:  \nPros:  \n\\- reasonably chill  \n\\- teammates are genuinely nice and helpful  \n\\- most people got promoted within 2 years or so\n\nCons:  \n\\- The work is very boring and tiring\n\\- The team future is unclear as its scope gets smaller every week. The org is known for layoffs\n\\- The new manager is not really helpful in roadmapping and getting scope for promotions. \n\\- 5 days RTO\n\nNew team (Google):  \nPros:  \n\\- 3 days RTO  \n\\- Work sounds very interesting to me and it is exactly the area I want to learn  \n\\- The Google culture is known to be good  \n\\- Somewhat better brand name?\n\nCons:  \n\\- unclear actual state of the team  \n\\- promotions is longer on average (around 3 years?) \n\\- in addition, I will forgo my 6 months work, so the total extra time to promotion would be 1.5-2 years\n\\- bad reputation of jop hopping\n",
      "subreddit": "cscareerquestions",
      "score": 688,
      "url": "https://reddit.com/r/cscareerquestions/comments/1jj1n50/is_google_worth_ditching_my_new_employer_only_6/",
      "comments": [
        {
          "body": "Yes.\n\n\"Here's my 2 weeks. I got a job at Google. I'm sure you understand and if not, I'm sure you should understand. Peace.\"",
          "score": 1625
        },
        {
          "body": "I would go with Google every time.",
          "score": 538
        },
        {
          "body": "All it takes is your team getting a new manager who loves putting people on PIP. I have seen this happen before.\n\nI would take Google 100% but make sure the team you’re on is somewhat core to the business. Google isn’t layoff-proof unfortunately but not PIP city like your current company.",
          "score": 348
        },
        {
          "body": "Google would 100% be worth just to have on your resume at your YOE. As long as your sponsorship situation is good and you are past the team matching phase I would support the switch.",
          "score": 444
        },
        {
          "body": "[removed]",
          "score": 140
        },
        {
          "body": "If your employer thought they could ditch you with no consequences, they would. Do whatever is right for you. You can do it politely and apologetically, but still do what you have to.",
          "score": 39
        }
      ]
    },
    {
      "title": "Small software companies have gone insane with their hiring practices",
      "body": "This is the job application process for a small API company posting.  They do not advertise the salary, and they have multiple technical rounds.  The HR team believes they are Google, and this role expects a C.S. degree or equivalent, paired with extensive experience. This market is an absolute shit show.\n\n# Application process\n\n* We can’t wait to read your resume and (hopefully personality-filled) cover letter! Let us know what excites you about full-stack engineering, and help us get to know you better!\n* If we think we might be a good fit for you, we’ll set up a 1-hour phone chat with Moses, a Back End Engineer on the team! He’ll tell you more about the role, and get a chance to hear about your experiences\n* Next will be a second 30-minute phone interview with Greg, our CEO &amp; Founder, where we’ll dive a bit more into your background\n* We’ll then do a technical assessment with a couple of ReadMe engineers\n* Finally, we’ll invite you to an \"onsite\" interview conducted over Zoom! These usually take 3.5 to 5 hours including an hour break in between. We are able to be flexible with the schedule and split it up over two days if that works best for you! We start with a 15-minute get-to-know-you with the people you’ll be interviewing with, and then have you talk with people one-on-one later on\n* We’ll let you know how things went within a week! If it still seems like a good fit all around, we’ll extend you an offer! If not, we will update you to let you know so you aren’t left hanging",
      "subreddit": "cscareerquestions",
      "score": 779,
      "url": "https://reddit.com/r/cscareerquestions/comments/1gfwzlx/small_software_companies_have_gone_insane_with/",
      "comments": [
        {
          "body": "I’m sorry, 3.5-5 hours? How does a small company even have the personnel/time to dedicate to that?",
          "score": 674
        },
        {
          "body": "You already know they pay 70k.",
          "score": 280
        },
        {
          "body": "Welcome to the new job market, where employers can demand ridiculous interview rounds and they'll still have people who are willing to go through all the loops",
          "score": 253
        },
        {
          "body": "What's a Readme engineer?",
          "score": 44
        },
        {
          "body": "90% chance they actually do leave you hanging ",
          "score": 78
        },
        {
          "body": "Same here. Private equity owned startup. No salary indication (we offer below market rate) and several interview rounds.\n\nThe salary is not disclosed until the job offer.\n\nOur CEO acts like we're FAANG.\n\nHe pitches ideas like pizza parties and cooperating with a software department abroad (outsourcing). Recently he put me on a PIP.\n\nIt sucks. I would've bailed if I had a job offer elsewhere. I've been applying for a while but it's either instant rejection or ghosting.\n\nI'm suspecting some of my fellow developers are applying as well, but none of us found anything yet.\n\nOh this is in Europe btw, it's getting rough here as well.",
          "score": 36
        }
      ]
    },
    {
      "title": "I’ve been unemployed for 6 months and I’m scared I ruined my career",
      "body": "I’m 22 and have about 3 years of experience as a data analyst. I started with a software dev program, got an internship, then kept growing my skills with Excel, Google Data Analytics, SQL certifications, etc.\n\nMy issue is that every job I’ve had has been short contracts for 3 to 6 months. I moved from Boston to NYC last year (personal situation) and since then nothing has stuck. My last role was a remote Data Analyst I job doing data migration, and ever since that ended, I haven’t been able to land anything.\n\nI’m applying to every data/business-related role I can find. I’ve even applied to retail and random jobs outside my field. I’ve only had about 5-6 interviews in 6 months, and twice a company basically “used” me just to end up hiring someone internal. TWICE.\n\nRight now I’m drowning financially. My credit cards are maxed, I’m getting evicted, and I’m honestly depressed. I love the data field and was even working toward a bachelor’s, but I’m at the point where I’m wondering what I should do next.\n\nIf you’ve gone through long-term unemployment or struggled breaking out of contract roles, how did you get through it? Any advice is appreciated. I feel really lost and scared.\n",
      "subreddit": "jobs",
      "score": 300,
      "url": "https://reddit.com/r/jobs/comments/1p0zplv/ive_been_unemployed_for_6_months_and_im_scared_i/",
      "comments": [
        {
          "body": "Try hospitals. Surprisingly they look for data analysts and programmers to work their computer systems. They pay pretty good too.",
          "score": 44
        },
        {
          "body": "[deleted]",
          "score": 89
        },
        {
          "body": "It might be easy to become a substitute teacher in your state if you're looking for some emergency income.",
          "score": 28
        },
        {
          "body": "Is not you. The market is really hard these days.\nAs winston churchill said 'if you're going through hell, keep going'\n\nSending you the best vibes. You have this!",
          "score": 12
        },
        {
          "body": "We’re hiring a data analyst right now. Check them out. PMI.org - and feel free to connect with me on LinkedIn if you end up applying.",
          "score": 35
        },
        {
          "body": "I’m sorry you’re dealing with this it’s scary but at 22 you haven’t ruined anything. \nThe job market is terrible now &amp; a lot of people going through it. I would focus completely on getting a job any job so you can keep a roof over head. Lots of places hiring holiday help look into that. Also get your resume to job placement/ temp work agencies in your area. \nThen spend time on looking at all the skills you have &amp; what would transfer well into x type job &amp; stay open minded. many libraries have free career counseling &amp; may be able to help you. You got this!",
          "score": 9
        },
        {
          "body": "I have been a stay at home mom for 25 years. I cared for my grandparents, and parents until they passed away. Two months ago I dusted off my resume with work experience that’s 25 years old. \nI worked in administration and accounting field previously.\nI made a detailed cover letter explaining the past 25 years and previous work history.\nI applied to just under 80 jobs, had 8 interviews, turned down 2 job offers and then last week accepted a fantastic job offer for full time work with benefits doing what I was previously doing.\nThe job market is tough for everyone right now. But keep fighting for what you want. Tweet your cover letter, resume, send thank letters and do not give up on yourself.\nI have hit bottom in life so many damn times. The good news is, it can only get better.\nIf u can’t get your ideal career job right now, just go out and get any job you can to keep a roof over your head. Keep applying while you work whatever Jo. U can get.\nSeriously, if I can land a job after 25 years than anyone can do it!\nWatch you tube videos on how to pass an interview. I learned so much from those videos and believe the times helped me get my job.\nI’m here to help, if u have questions or want to talk.",
          "score": 94
        }
      ]
    },
    {
      "title": "Not going to lie, the greatest thing about being Experienced is being able to say no to Leetcode questions.",
      "body": "Nothing really else to add.  It just feels pretty good to say that while the job sounds interesting, it's not worth it if I have to interview like that.  Just told two pretty prominent unicorns that I wasn't interesting in the interview process after their recruiters/hiring managers found jobs that I was pretty perfect for.\n\nFunny thing is, I think they hear that a lot from other experienced folks.  There is no surprise on their part and they fully understood.\n\nI'm gainfully employed in a good job with decent pay.  I'm too old and bitter for interview games right now.\n\nEDIT:\n\nI didn't realize that this would gain this much traction.  So, some clarifying points to deal with the questions/assumptions.\n\nMy current TC is around $330K - but my refreshers are really good - so it will soon be $370K and $410K the year after.   The company has the ideal culture, great WLB, and I have an absolutely awesome manager.  It's good, but I keep an ear open because I know I can do slightly better.  I have 20 years of experience, 13-15 years as dev (depends on what you call my startup experience), but I have no specialized skills - so no, I won't make $700K that some people are saying that is possible.  Possible for some, not me.  $500K-$550K is my max potential, which is still unbelievably awesome.\n\nThe companies I said no to were willing to get up to $500K, but these are non-public companies.  So, there's a risk that lowers the TC in my opinion to something not worth much more than my current job, and my WLB would be much worse.  And I'm not going to cram for LeetCode for a week to work for them.  Too much stress for too much randomness in the interview process.\n\nAnd no, I don't have a blanket refusal on all LeetCode. I'm not stupid.  But if a company wants me to do LeetCode, I do expect a huge premium.  Most companies don't offer that premium, so I gleefully refuse.\n\nAn example of where I didn't refuse - I recently interviewed for the E6 track at Facebook, but failed (long story short, they asked for a 3rd round, got a bad System Design interviewer, and failed - I actually did well on the LeetCode surprisingly).  Anyway, that job would have $500K+ of non-paper money.  So, I will do LeetCode for that.  I also talked with Google.  Did the first round, and they only wanted me at an L5, which is not a huge raise.  That is not worth it to continue, so I refused.",
      "subreddit": "cscareerquestions",
      "score": 1824,
      "url": "https://reddit.com/r/cscareerquestions/comments/im25q8/not_going_to_lie_the_greatest_thing_about_being/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1112
        },
        {
          "body": "I also say \"no\" to coding tests early in the interview process.  I hate that companies expect developers to spend several hours doing coding tests prior to having a single discussion.\n\nIt doesn't scale.  If I submit 20 résumés per week, and they all want me to spend 2-4 hours doing tests, that's more than a full-time job just doing tests every week.",
          "score": 453
        },
        {
          "body": "Its best thing about interviewing while employed. You can say no.",
          "score": 113
        },
        {
          "body": "I came into this thread thinking having experience will let you bypass leetcode.  Am I missing something, it sounds like the experience didn't do anything?",
          "score": 226
        }
      ]
    },
    {
      "title": "I couldn’t find a job. Now I know why.",
      "body": "I have a VERY unique first, middle, last name combo. I didn’t know that searching up my name lead to 2 very prominent missing posters of me when I was 14, detailing my “substance” use, unreliability, and mentioning my abuser. All over the google page. I contacted Facebook, google, and everywhere else. My name is ruined forever and my at my job interview they pulled it up. ",
      "subreddit": "jobs",
      "score": 953,
      "url": "https://reddit.com/r/jobs/comments/1nvtczq/i_couldnt_find_a_job_now_i_know_why/",
      "comments": [
        {
          "body": "There's a guy with my name and same date of birth, lived about 6 hrs from me growing up. \n\nHow did i find this out? I volunteered at my high school, but then got a message: \"Because of your murky multiple drug convictions, we cannot show you onto any school premises.\"\n\nTurns out, homeslice did years in juvi and several years for various drug related crimes (harder than pot, for the record). \n\nForgot all about it for 20+ years, until I was up for promotion. They checked my background again for some reason, and summarily fired me. I had to call the bloody background check company they used, and then got to hear the HR person that fired me hire me back at my new rate.",
          "score": 806
        },
        {
          "body": "Use a nickname - many do and it’s NBD. I certainly do. This is a non-issue and easily solvable.",
          "score": 467
        },
        {
          "body": "Enroll with one of those companies like deleteme, incogni, or optery. My name is unique too.",
          "score": 127
        },
        {
          "body": "I use to have the same name as a female serial killer. She lived not far from me at one point in time. When I met new people, they would gasp when I introduced myself. Fun times.\n\nWhen the opportunity arose, I changed my name.",
          "score": 68
        },
        {
          "body": "This is really sad. I’m sorry you’re held to your past like that.",
          "score": 33
        }
      ]
    },
    {
      "title": "Resume got me interviews with Google, Duolingo, and 8 startups (2 YC)",
      "body": "I’m so tired of hearing how every CS major is cooked. Like yeah, a lot of people are, but it doesn’t mean you gotta be. Reddit and CS circles lately feel so negative like everyone gave up already. But bro it’s never gonna work if you stop applying.\n\nI sent around 60 apps before landing 2 offers and still got some interviews going.   \n  \nHere’s what actually helped me stand out, it's a combination of many things:\n\n1. You need projects. Everyone says this but they miss the point. Don’t just make another LLM RAG app, that’s the new note-taking app now. Everything can be made with GPT. Be different. If you’re into AI, go deep, fine tune something, mess around with new models on Hugging Face, or build stuff people actually use. I built a startup with real users and that honestly helped a lot\n2. Fix your resume. Copy keywords, quantify your impact. Check out resumes from people who actually got into your dream company and learn from them. I was lucky enough to get mine reviewed by a friend who got in last year. But don’t go overboard with feedback, too many opinions will just confuse you. Be smart about who you ask. The best people to review your resume are alumni who landed that job or former technical recruiters. Skip school career services or random resume reviews, it sucks.\n3. LinkedIn method. I know it’s cringe but it works. Set your profile up, add a bunch of keywords on your profile to increase visibility so tech recruiters can find you. Post about your journey, interact with founder/hiring manager that you are interested to. This is not a good method for FAANG but work really well for startups. I got poached by like 5 startups from just posting. It’s low key the best cheat code for startup recruiting.\n4. If the app has an “additional message” box, use it. Say something about why you’re into the role so they know you didn’t mass apply. You can use GPT to draft it but make sure it still sounds like you.\n\nMost people are cooked cause they gave up too early with a terrible strategy. Don’t be one of them. You got this\n\nhttps://preview.redd.it/nb4f8169q7zf1.png?width=856&amp;format=png&amp;auto=webp&amp;s=025e5108759925a5ff8f608ac673b5bb4abeaa24\n\n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1oo3et8/resume_got_me_interviews_with_google_duolingo_and/",
      "comments": [
        {
          "body": "You just posted this a week or two ago. What service are you trying to sell or are you just ego farming again?",
          "score": 3
        }
      ]
    },
    {
      "title": "Interviews at google",
      "body": "Hi guys. I had two of the three technical interviews at google. one was mid and the other one was pretty bad\n\nI feel like I have no chance in being picked right? So I m not sure if I should continue with the other one and the behavior one",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1nf62kp/interviews_at_google/",
      "comments": [
        {
          "body": "They might think it went better than you think. Why not complete it to get the experience and hopefully get some feedback.",
          "score": 2
        }
      ]
    },
    {
      "title": "Fashion Question! What do I wear to my Google interview?",
      "body": "I am prepping for an initial screening later in the week with a Google recruiter for a Senior Account Strategist Role Mid-Market in the Advertising department. I really want to land this role. \n\nWhat should I wear? It is an online call.   \nI was thinking a white oxford shirt with a front pocket, which I would say style-wise is very \"me\". Clean, sober, collected, and practical. \n\nI was going to wear another shirt, a striped beige shirt with a front pocket, but it risks to veer on the \"too summery\" side, and I did indeed buy it for vacation earlier this summer. So what do you think? The summery striped shirt, or the white Oxford dress shirt, upon collar button, business casual? \n\n  \nIf you have any experience in interviewing for these types of role at a FAANG, or more specifically at Google, I would love to hear your insight. Any interview tips to go well in a Google screening would be highly appreciated. I have 4 days left to go! ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1mo5lzh/fashion_question_what_do_i_wear_to_my_google/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Google DCT interview",
      "body": "",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1l91vha/google_dct_interview/",
      "comments": []
    },
    {
      "title": "Data scientist research Google interview",
      "body": "Hey there. Data scientist here preparing for a first round of interviews at Google for a researcher position.\n\nI was wondering if anyone here have been interviewed for this position before. The contents are\n\n1st: Statistics + communication.   \n  \n2nd: Data analysis + communication.\n\nI am reviewing topics such as expectation, variance, probability, bayes theorem, hypothesis testing, confidence interval and A/B tests.\n\nAny tips, leaked questions, material for study? I appreciate a lot.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1jdhpjg/data_scientist_research_google_interview/",
      "comments": []
    },
    {
      "title": "Sharing work experience details in a Google Doc during interviews?",
      "body": "Hi everyone,\n\nSo, I passed the HR interview for a marketing role. Tomorrow, I have an interview with the head of client strategy. I have around 6+ years of experience. I am considering creating a Google Doc and add some information about my experience in that document in the form of short form answers.\n\nFor example,\n\nExperience with tools: Google Analytics, etc,  \nClients: Google, Amazon, etc  \nTypes of industries worked in: Manufacturing, fintech, etc\n\nI might also add my processes for different marketing tasks, so they can have an idea about how I do things.\n\nI think sharing this document during the interview would help the interviewer know me better and they might like something. What do you think. Is it a good idea or it might backfire in some way?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jjwwc2/sharing_work_experience_details_in_a_google_doc/",
      "comments": [
        {
          "body": "I think it's a worthwhile exercise to put together such a document for your own notes on what points to hit during the interview, but I'd lean towards sharing the details through conversation and storytelling.  Much of what you're describing is what I would have expected to find in your resume in the first place, so it's kind of redundant in that regard anyway.",
          "score": 1
        }
      ]
    },
    {
      "title": "[Update] Waiting for 4 hours",
      "body": "For those who attacked me for doing nothing, here's what happened so far:\n\n- I receive a couple emails which I assume are from this company asking me to show up for an interview\n\n- The first email was from a domain which I automatically assumed was this company\n\n- This company was my third interview of the day\n\n- I didn't think the first two went well and thought this company would've been easier to get based on my experience\n\n- This company was 1 hour 50 mins away from home, so I didn't want to go back home without an interview and was afraid to leave and have to drive almost 2 hours there and back again to reschedule\n\n- Criticize me all you want but desperation breeds actions that might not sound so sensible, and I really need to move to a bigger company, I'm tired of being the only MBA I know with experience only in smaller companies that pay much below everyone else\n\n- The email told me to wait in that exact building while someone would come take me inside\n\n- This happened last Friday\n\n- The interview was for the afternoon\n\n- I was surprised this time because I didn't get the previous phone interview, as they saw my resume, asked a few questions about mh availability, and gave me a time to show up right after\n\n- I go in that office barely 10 minutes before the time of my interview\n\n- Everything looks normal, parking lot is full of cars\n\n- There was nobody at the reception desk\n\n- I thought she might be in the bathroom\n\n- 20 minutes later I thought it was odd nobody came to see me\n\n- I waited another 10 minutes for good measure, and then sent an email back to my \"point of contact\"\n\n- After another 15 minutes of no response I got on Google and called the office\n\n- The office phone in the lobby rang; there was nobody there to pick it up\n\n- I became livid and went to my car to get my laptop and continue some applications I've been working on (some for construction companies since I was able to recently shadow a couple construction managers who just didn't have openings for me)\n\n- I have a thing where I usually get really involved in tasks I'm doing and forget the time\n\n- By the time I took a break from playing around with resumes and applications 3 hours had passed since I first got into the building\n\n- I started to get really upset and went inside, even though it was clearly employees only\n\n- I was extremely surprised that not only the front door of the building was open, but the door that should've been locked for employees (I know there should be a button on the front desk that unlocks it) was just open as well\n\n- As I walked inside, it seemed like the first floor was quite empty except for a couple rooms with their doors closed\n\n- I kinda started getting scared of being in a place where I don't belong\n\n- The front office was fine because it was quiet and I belonged there; I knew I didn't belong inside\n\n- I went back to the office and started wrapping up\n\n- I figured wait another few minutes for people to start clocking out at the end of the work day\n\n- The first couple employees I saw I asked for info, and the name of the person who sent me those emails\n\n- Nobody seemed to have heard of him\n\n- Also nobody could tell me why there was no receptionist\n\n- I went home extremely angry\n\n- This morning I called the office\n\n- Someone actually picked up\n\n- I try to figure out info on the email I\nreceived\n\n- She said that email wasn't in the system and the domain name was a little different than their email domains\n\n- Before people on here attack me, I usually do my own research on every individual I receive an email from, but this wasn't my first job choice and it was the last email of the day, so I showed up to the interview with only enough research to know what the company does and what I would do there in that position\n\n- I try to email that person back with fury, but I receive an email back:\n\n\"Your message wasn't delivered to *************************** because the address couldn't be found, or is unable to receive mail.\"\n\nSo I fell victim to a scam? Like wtf?\n\nWhat's the point people do this, and what do they have to gain from wasting my time and frustrating me?",
      "subreddit": "jobs",
      "score": 652,
      "url": "https://reddit.com/r/jobs/comments/1jp1ia6/update_waiting_for_4_hours/",
      "comments": [
        {
          "body": "Was your home robbed when you were gone? At least then this would all make sense.",
          "score": 586
        },
        {
          "body": "OP I want to give you some very blunt criticism in the you analyze your interview skills.\n\nI read your posts, and it seems like you have no problem getting to the interview, so you clearly have a good resume. 59 interviews in this year shows that. So, the interview is where it is breaking down.\n\nReading your posts, you come across as extremely arrogant, and i bet this is coming through in your interviews. The way you talk about your MBA sounds like you think it's a magic job wand. In previous posts, you have stated hope to get hired with no experience and get it on the job. People then recommended you network. And apparently you know many small businesses owners  but they don't have jobs you want. The way you write about these jobs is you seem to think they are below you. These jobs are where you get the experience you want yes the pay is not what you want, and they are not glamorous, but they build your resume \nWhat business administration experience do you actually have?\nYour job history shows no direction. You have been in education then Healthcare. You are applying for desk jobs in an office and construction management. What job field are you looking for?\n\nWhy are you shadowing these construction managers when they already told you they have no positions. What are you getting from this recommendation? Or are you just shadowing these people in the hopes they suddenly decide to hire you for the nonexistant position. \n\nIt sounds like you are applying for high-level positions with no experience, thinking that your MBA is a shortcut. It's not, you need to show how your MBA is relevant.\n\nIf you are so desperate for a job to sit around for 4 hours, then call up your contacts and take the low-level positions so you can get a paycheck and experience.\n\nEdit for grammar",
          "score": 118
        },
        {
          "body": "did you send your personal information to the original email address? hope you didn't send them anything too serious",
          "score": 69
        },
        {
          "body": "SUMMARY\n\nI received an email for an interview\n\nI emailed and called but nobody replied or answered\n\nI used my time to do more applications and study\n\nI asked people as they were leaving and nobody knew who sent me the email\n\nI only had stayed because this place is 1 hour 50 mins away and didn't want to go back, so chose to do my same work for the day there\n\nThis morning I talk to the front office and they told me that wasn't their domain\n\nI email again and it looks like the email doesn't exist anymore\n\nI might look silly but I usually do my research, this time I was focused on other companies so I just looked up the role and the conpany beforehand",
          "score": 134
        },
        {
          "body": "Did you apply for this job or did you literally respond to an unsolicited email or text? Because that's red flat number one.",
          "score": 40
        }
      ]
    },
    {
      "title": "I filled out this Google Forms interview and received an offer letter from the employer. Is this legit?",
      "body": "",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1k35u1k/i_filled_out_this_google_forms_interview_and/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 21
        },
        {
          "body": "You really want to work for “SCAMOGEN”?!?",
          "score": 22
        },
        {
          "body": "I've known of no legit company that uses google forms for applications/interviews lol",
          "score": 15
        },
        {
          "body": "You need to get in touch with a flesh and blood being.",
          "score": 9
        },
        {
          "body": "“Kindly” is a dead giveaway. Also a lot of other red flags. Sorry man.",
          "score": 7
        },
        {
          "body": "I mean, it's definitely a real company, but a quick scan of Indeed shows what the offer say they're paying for \"data entry\" is higher than their research associates, which just *screams* scam - along with a boatload of other red flags.",
          "score": 5
        },
        {
          "body": "The names of their employees on LinkedIn don't match their pictures.",
          "score": 5
        },
        {
          "body": "Remote data entry jobs are a 99.9% chance of being a scam.\n\nIt's a pretty popular job title for scammers because people.see it as as an easy job.\n\nData entry is a nearly obsolete role due to technology. The few remaining roles are typically going to be on site and data entry usually requires a test of speed. And the pay is closer to $17 to $18 at best. Basic data entry is not a $70k per year job.",
          "score": 3
        },
        {
          "body": "You didn’t talk to an actual human being? Then 99% this is a scam.",
          "score": 3
        },
        {
          "body": "no sorry",
          "score": 2
        }
      ]
    },
    {
      "title": "Data engineer interview process at Google",
      "body": "I completed 3 rounds with Google (2 technical and 1 behavioral-likely Googliness).\n\nThe role was for Fleet Decision Intelligence team, and we discussed about the team's work in during last round - Will there still be a team matching in this case or I can expect directly managerial round?\n\nAlso, it's been nearly 2 weeks since the last interview and the portal still shows \"Interview Scheduled.\" Should I follow up now or wait?\n\nThanks! :D",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1lf5cjx/data_engineer_interview_process_at_google/",
      "comments": [
        {
          "body": "it’s been nearly two weeks without an update so it’s completely reasonable to follow up. a quick check-in shows you’re invested in the opportunity and proactive about your [career,](https://www.startdoingwell.com/resource/career-tips-how-to-do-well-work) and it can help clarify what the next steps are.",
          "score": 2
        }
      ]
    },
    {
      "title": "Hello all, what is a virtual panel interview? I am trying to google but am getting different answers",
      "body": "Kind of confused on what it is",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1j8rnpb/hello_all_what_is_a_virtual_panel_interview_i_am/",
      "comments": [
        {
          "body": "You're going to get a link to join an online call (think of teams or zoom). There will be several people on the other lines, and they will take turns asking you questions. It's like an in-person panel but maybe not everyone can make it to one spot at the same time.",
          "score": 1
        },
        {
          "body": "Panel = Multiple interviewers",
          "score": 1
        }
      ]
    },
    {
      "title": "How to answer \"what would I see if I googled you\" interview question?",
      "body": "Ima preface this by saying that I'm autistic, so social nuance can be lost on me, and this might be one of those times.\n\nI have an arrest record, it's just a misdemeanor but it made national news due to being a high-profile event, and it's been the bane of my existence. I filed a petition to seal the record, and I've gotten all but one local news article and one social media post down (a 'celebrity' got arrested at the same thing and frankly did most of the heavy lifting on that, and he's a twat but bless him for taking on Fox News because I would have lost that battle) but those are still things you can google.\n\nI'm graduating college soon, it's a pretty up-itself profession with an emphasis on maintaining public image, and apparently that is an interview question you can get? I panicked when I heard that and I still don't know how to answer. \n\nI'm leaning toward saying nothing, because I've also had my legal name changed since then (both middle and last) but like... what if they actually try, AND they use my old name? Is that just me being autistic, or is it a relevant fear? Like, even if the criminal record gets sealed, there are a few things they could still see. Not that clients could unless they really seriously dig, which is usually what matters, but even having a misdemeanor on my record has been a barrier to entry level positions in the organization I'm shooting for a post-graduation career in. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jwi3ce/how_to_answer_what_would_i_see_if_i_googled_you/",
      "comments": [
        {
          "body": "Mostly sealed AND name change? HR are not the brighest crayons. I think you will be fine. Just say they'll maybe see you listed at your last job and you're not really sure what else. I think most people don't Google themselves (?) so it's not unreasonable to have no full answer.\n\nAnd now of course I'm going to go google myself.",
          "score": 4
        }
      ]
    },
    {
      "title": "Google recruiter submitted my application again after interviews — still a shot?",
      "body": "Hey all,  \nI recently wrapped up my interviews for a role at Google. It’s been a few weeks now with no final decision, and naturally the anxiety is building. I followed up, and the recruiter told me they’re still waiting on updates.\n\nBut here’s the twist: when I checked my application portal, I saw a **second, related application** had been submitted — this one says *“submitted by recruiter.”* I didn’t apply to it myself, so clearly it was created internally.\n\nHas anyone seen this before? Is this a sign I’m still being considered seriously, or is this just a soft letdown where they’re stalling for time?\n\nI’m at a bit of a crossroads — really hoping for a break here, but also trying to be realistic. Would love to hear from folks who’ve been through something similar.\n\nThanks in advance 🙏",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1kk2lmp/google_recruiter_submitted_my_application_again/",
      "comments": []
    },
    {
      "title": "I got a job offer at a big company, googled my team lead who interviewed me and found her email password on the internet.",
      "body": "I interviewed for a job recently and today I got an offer from the company. I thought one of the hiring managers liked me and indeed I was offered a job in her team. I googled her name to find out more about her background and on the first page of results I got a forum page with an email dump. I found her company email and password there and I thought that couldn't really be it. I tried her name at gmail instead with the same password and I got in. I haven't read anything from her email but I think I should tell her that her password is on the internet and she should change it immediately. I'm not worried that her knowing that I googled her is going to be anything negative or that they would withdraw the offer but maybe you can share your opinion. \n\nEDIT: Resolution is at https://www.reddit.com/r/jobs/comments/573qwu/i_got_a_job_offer_at_a_big_company_googled_my/d8p720t",
      "subreddit": "jobs",
      "score": 96,
      "url": "https://reddit.com/r/jobs/comments/573qwu/i_got_a_job_offer_at_a_big_company_googled_my/",
      "comments": [
        {
          "body": "Googling a future employer/co-worker is not an issue. Many people do it. I agree with /u/sueca, though: tell her that you were seeking out more info about the company online and found someone had posted private information about her.",
          "score": 82
        },
        {
          "body": "Just simply say \"By the way, when I googled your name, it looks like your email and password somewhere might have been leaked. Just thought I'd let you know, if you haven't done so already you should change your passwords.\"\n\nObviously don't say you tried and entered her private email. Even if you didn't read anything it would not help you in any way. That is what I would do as my moral conscience wouldn't stop nagging me until I did. ",
          "score": 71
        },
        {
          "body": "[deleted]",
          "score": 24
        },
        {
          "body": "Google recorded your IP in \"the computers logged in on that account.\" Sometimes it leaves an email for me later after an hour or so \"logged in from ipaddress, near city, state was this you?\"",
          "score": 12
        },
        {
          "body": "If I'm not mistaken, gmail sends you an email when you log into your account from a different computer/phone than normal.  I believe it came about after the whole ordeal with JLaw and Kate Upton's iphone being hacked.  If this is true, I wouldn't say anything. ",
          "score": 10
        },
        {
          "body": "I hope you are accepting the job of Director of Information Security.",
          "score": 7
        }
      ]
    },
    {
      "title": "Help get me tips for Google's \"Problem Space Understanding + Product Vision\" interview round.",
      "body": "I have an upcoming interview with Google for the role of product manager. Could you help me with the probable questions that may be asked? \n\nOne of my key doubts is whether questions will be based on the product for which I am being interviewed to understand if I know the product? Or standard hypothetical product sense questions? \n\nIf someone who has attended Google interview can give tips, that would be great. ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1nyhx7a/help_get_me_tips_for_googles_problem_space/",
      "comments": [
        {
          "body": "For my Google PM loop, that round mixed both. I got one hypothetical to test structure and one tied to a Google surface area, but they didn’t expect deep product trivia. What helped was opening with clarifying questions, defining a target user, stating success metrics, then laying out a short term v1 and a 3 year north star. I practiced timed mocks with Beyz interview assistant using prompts from the IQB interview question bank, and kept each step to about 90 seconds so I didn’t ramble. Also jot a quick CIRCLES outline before you talk so you don’t skip risks and tradeoffs.\n\nYou’ve got this, just be explicit about assumptions and keep it crisp.",
          "score": 2
        },
        {
          "body": "It's mostly hypothetical product sense questions, not deep dives into the specific product you're interviewing for. \n\nGoogle wants to see how you systematically break down ambiguous problem spaces and articulate compelling product visions.\n\nThey're testing your thinking framework, not your ability to memorize their product roadmap. The unconventional insight most candidates miss: don't try to impress them by showing you've studied their product obsessively; instead, demonstrate you can deconstruct any complex problem space using first principles (understand users deeply, identify unmet needs, size opportunities, articulate trade-offs).\n\n You should find Product Alliance's Google-specific content incredibly valuable. They break down the actual rubrics Google interviewers use, provide real example questions from recent loops, and most importantly, teach you the structured thinking patterns that Google specifically rewards. That said, do spend 30 minutes understanding the product area so you can ask intelligent questions at the end, but don't let that overshadow practicing the core skill: taking messy, ambiguous problems and building a coherent, user-centric vision.",
          "score": 2
        },
        {
          "body": "What happened in the interview bro ??",
          "score": 1
        },
        {
          "body": "What was the actual questions that were asked to you in the product vision round? @[jinxxx6-6](https://www.reddit.com/user/jinxxx6-6/) @[rencie11](https://www.reddit.com/user/rencie11/) @[crossMERC](https://www.reddit.com/user/crossMERC/)",
          "score": 1
        },
        {
          "body": "Hey! I have my product interview next week and the recruiter confirmed it’s for Problem Space Understanding + Product vision with Hiring Manager. What were your questions like?",
          "score": 1
        }
      ]
    },
    {
      "title": "Google admits brainteaser questions are worthless for hiring. “They don’t predict anything. They serve primarily to make the interviewer feel smart.”",
      "body": "",
      "subreddit": "jobs",
      "score": 213,
      "url": "https://reddit.com/r/jobs/comments/1gq819/google_admits_brainteaser_questions_are_worthless/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 40
        },
        {
          "body": "I find this kind of surprising, I never really thought the questions were relevant to the problem, more your way of explaining how to solve them was and your rational of why you chose those parameters for solving them. \n\nBut I suppose it rather depends on the job you are hiring for, if they are going have to show and explain their methodology on a whim, or think up ideas it seems like it could be useful, but for your average job most likely not. ",
          "score": 12
        },
        {
          "body": "[removed]",
          "score": 9
        },
        {
          "body": "At least this means Google is paying attention to what leads to a successful hire.",
          "score": 8
        },
        {
          "body": "Now that those are out of the way, we can start asking applicants if they'd rather fight 100 duck-sized horses or one horse-sized duck",
          "score": 6
        },
        {
          "body": "I like how Google is evolving with the times. They saw that the questions were useless so they changed the interview process. I always like that they are putting less weight on GPA and SAT scores because I knew guys who could code better than the so called professor that taught the programming class but had difficulty on testings.  ",
          "score": 10
        }
      ]
    },
    {
      "title": "Interviewing with Google Dublin?",
      "body": "Google interviews - Dublin HQ\n\nHi all,\n\nI had my G&amp;L interview a few days back. I feel it went relatively well. I definitely stumbled a little as I thought out my responses once or twice and had to get myself back on track but largely did. \n\nI've my RRK interview later this week. I'm interviewing for an Account Strategist role. \n\nHas anyone interviewed for this role in the past and had success? How long did it take you to get hired? I'm particularly interested in hearing from people who interviewed for Google Dublin/EU HQ's. \n\nAny idea what the chances are of me being selected and how many candidates roughly are interviewed? Is it always just one hire or multiple. \n\nThanks guys!\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1hhmr5k/interviewing_with_google_dublin/",
      "comments": [
        {
          "body": "Hey did you get any feedback? I have the same interviews this week. How was the process overall?",
          "score": 1
        }
      ]
    },
    {
      "title": "I didn't get the job because I was profiled as a 'Video Gamer'",
      "body": "I was interviewed for a Afterschool Drama Teacher program at the local museum here. This was a virtual interview so I get the Google Meet email. When I joined, I notice that there was another in the room with us but it was an AI that was going to transcribe the meeting called Otter.AI. I didn't think much of it, I figure that this was protocol, whatever.\n\nInterview goes on, I feel good despite the little red flags I saw come up. But I need work and being lucky enough to get an interview in my field of choice, I hoped for the best. About 30 minutes after the interview concluded I get another email from Otter AI that shares what was transcribed. I felt like I wasn't suppose to see this but I decided hey, if anything I can go over the interview for myself and just take it as a healthy moment to critique myself.\n\nLittle did I realize, the transcription continues after I left.\n\nI've attached what was said but, I was profiled as a \"video gamer\" and that was why I was not qualified for the job.\n\nAt first I was pissed but then I had to laugh at the absurdity of it all. If that's their thought process, perhaps I dodged one big ol bullet!\n\nFor transparency, yes I do play video games. But I have a professional resume filled with Teaching experience, industry and professional work under my belt. Granted sure I don't have a bachelors in theater work but I wanted to shoot my shot, knowing theres SOME overlap but I was willing to get my feet wet. And its for a kindergarten-program, not exactly putting on 'Kidz Bop Presents: Hamilton'.\n\nThis is definitely the craziest rejection I've ever received. This is truly hell!\n\nhttps://preview.redd.it/2fyarxd0rskf1.jpg?width=871&amp;format=pjpg&amp;auto=webp&amp;s=81e2f7f74b658aa880bb3b100bdfcae04491e477\n\n",
      "subreddit": "interviews",
      "score": 4519,
      "url": "https://reddit.com/r/interviews/comments/1my63u8/i_didnt_get_the_job_because_i_was_profiled_as_a/",
      "comments": [
        {
          "body": "Why did they brand you as a \"video gamer\"?  And why does that mean you couldn't work with children?!\n\nThat's the most ridiculous stereotype. I don't understand.\n\nImagine if you had a film poster up in the background and they were like, \"urgh, he watches movies, we can't let him near children\".\n\n\"He seems like someone who goes skiing. That won't work for us.\"\n\n\"Looks like a person who knits. And I'll tell you what he knits...RED FLAGS.\"",
          "score": 359
        },
        {
          "body": "“…but just like…”\n\nI wonder how that would have gone over in an interview to teach kids. \n\nRecruiting has become an industry of shooting themselves in the foot.",
          "score": 122
        },
        {
          "body": "Wait I’m so confused, did video games come up at all during the interview or is this just some weird stereotype one of the interviewers came up with? \n\n\nTbh just to spite them, I’d send them a copy of the transcript let them know about their unprofessionalism for future interviews. Also, you said in another comment you did film theory, acting, and set design! That would have been awesome for this role. You totally dodged a bullet!",
          "score": 84
        },
        {
          "body": "Because children are widely know to not relate to video games....",
          "score": 52
        }
      ]
    },
    {
      "title": "Google Hiring Assessment &amp; Interview process",
      "body": "Heya! Recently applied for position at Google and they reached out asking that I complete their Hiring Assessment. Apparently this is a relatively new thing in their hiring process. I’ve done some research on people who have passed the Hiring Assessment and almost all have said they never made it to the next steps for an interview or ultimately received an offer.\n\nMy question is do ALL candidates (successful/unsuccessful) complete the Hiring Assessment or does Google only provide this assessment for candidates who could possibly have strong potential to join the company but not for the role in question? I find it bizarre that I’ve seen so many people who passed the assessment but were not ultimately offered the role; something seems fishy. Could anyone drop some success stories below?",
      "subreddit": "interviews",
      "score": 8,
      "url": "https://reddit.com/r/interviews/comments/1lx8c46/google_hiring_assessment_interview_process/",
      "comments": [
        {
          "body": "I had plenty of applications going straight to not proceeding before I even got an assessment. I think you’ll only get the assessment if they see potential. And btw they only reached out a month after for a phone screening.",
          "score": 5
        },
        {
          "body": "Hiring assessment is much like a personality test. It is run automatically, and you should consider this as a pre-filter before the recruiter screening round.",
          "score": 2
        },
        {
          "body": "Its standard.",
          "score": 1
        },
        {
          "body": "Any update after appearing for assessment?",
          "score": 1
        },
        {
          "body": "I just took the GHA and am worried.  Most posts I've seen on Reddit said they had 100+ questions, but mine stopped at around 62 or so.  I wonder if it assessed in real-time and I made too many answers it did not like so it just decided to cut it short :-(  This is for a SWE position, so not sure if it's different depending on the role.   How many questions did you get?",
          "score": 1
        },
        {
          "body": "Have to complete this… I’ve never gotten to this stage before.",
          "score": 1
        },
        {
          "body": "I actually did not get any pass/fail email after I completed the assessment yesterday but I saw 'not proceeding' on the candidate portal and beat myself up for not passing an easy ass assessment, then I emailed the assessment help email and they said I passed the assessment but my application for that particular role was rejected?! make it make sense.",
          "score": 1
        },
        {
          "body": "Just chiming in with a data point. I cold-applied the day the job opened (Day 0) Got a request for the hiring assessment the next day (Day 1). Took the assessment the next day (Day 2). Learned I passed the next day (Day 3). Waited and waited. Assumed I was cold-rejected. Got an email 3 weeks later from the recruiter (Day 25) with an invitation for a 30 min call with the hiring manager. Who knows what will come of it, but process is taking way longer than I anticipated.",
          "score": 1
        }
      ]
    },
    {
      "title": "Google SWE III AI/Ml, GenAI, Search Interview Advice",
      "body": "Hi I have upcoming interviews at Google for SWE III ML role in few weeks. I have 2 rounds of interviews: Round 1: Ml domain interview and Googlyness interview (virtual) Round 2: Coding interviews 2 (onsite) Im preparing for ML domain round, can anybody share their interview experience and what sort of questions/topics I need to focus on and resources that could help? Is it more Ml fundamentals or Ml system design or both? During my call with recruiter I mentioned Im interested in recommendation, ranking, search.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1pg48oh/google_swe_iii_aiml_genai_search_interview_advice/",
      "comments": [
        {
          "body": "For Google ML interviews they definitely hit you with both fundamentals and system design - expect stuff like recommendation system architecture, ranking algorithms, and how you'd handle search relevance at scale. Since you mentioned rec/ranking/search they'll probably throw scenarios around those domains at you",
          "score": 2
        },
        {
          "body": "1point3acres has many experiences. did you have an online coding assessment/ phone screen or did you get the 4 rounds directly scheduled? \n\nLC discuss (india): [https://leetcode.com/discuss/post/7370210/google-l4-amml-interview-experience-by-a-l685](https://leetcode.com/discuss/post/7370210/google-l4-amml-interview-experience-by-a-l685)",
          "score": 2
        },
        {
          "body": "ML domain interview is usually a mix of fundamentals and sys design, but for SWE III they lean heavier on the fundamentals side. They'll probably ask you about gradient descent variations, regularization techniques, and basic neural net architectures. Since you mentioned ranking/search, expect questions on learning to rank algorithms, maybe some NDCG metrics stuff. The syst design part might be something like \"design a recommendation system for YouTube\" but they won't go super deep into distributed training infrastructure.\n\nI work at Prepfully and we've got a bunch of Google ML engineers who do mock interviews - they usually say the domain round is where candidates struggle most because it's hard to know what depth they expect. For resources, Andrew Ng's courses are still solid for fundamentals review. The Googlyness round is pretty standard behavioral stuff but they really care about collaboration examples, especially cross-functional work with product/design teams. If you're down may be try mock or two - you'd get A LOT to learn.",
          "score": 2
        },
        {
          "body": "Based on what I've seen it typically sits somewhere between fundamentals and system design but leans more toward practical application since you're coming in at a mid level. Given your interest in recommendation/ranking/search, expect questions around recommendation systems architecture, ranking algorithms, and how you'd handle large scale ML pipelines.\n\nI'd focus on understanding the end to end ML lifecycle, distributed training, model serving, and be ready to discuss tradeoffs between different approaches. Since you mentioned specific domains to your recruiter, it suggests they'll likely tailor questions around those areas rather than going super broad.",
          "score": 2
        }
      ]
    },
    {
      "title": "Silence after Google interviews",
      "body": "Hi! Completed 3 rounds and 1 coffee chat with executive. The recruiter said he will get back this week but silence. I’m nervous; whats going on? Is this rejection or anything positive? Thanks!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1pf5sro/silence_after_google_interviews/",
      "comments": [
        {
          "body": "It’s all fine. I really enjoyed that coffee with you. They’ll reach out latest end of next week.",
          "score": 4
        },
        {
          "body": "I feel your pain. \nIt wasn't Google that I interviewed for, but I was told that I would hear something by the end of this week and I hadn't heard anything by the end of the day Friday so I'm pretty sure I got my answer...\n\nI hope good news comes for you!",
          "score": 1
        },
        {
          "body": "Any update?",
          "score": 1
        }
      ]
    },
    {
      "title": "Google Frontend interview in 2 weeks — how would you prepare?",
      "body": "Hey folks,\n\nJust got the email — I’ve got a **Google frontend interview in 2 weeks**. Excited, nervous, and a little overwhelmed 😅.\n\nIf you were in my shoes, how would *you* prep smartly?\n\n* DSA grind or focus more on **JS/React/browser internals**?\n* Any **LeetCode must-do problems**?\n* Go-to **blogs, courses, or YouTube channels**?\n* Tips for staying calm + structured during the interview?\n\nWould love to hear real experiences, what worked for you, and even what *not* to waste time on. Let’s make this a thread future candidates can also use 🙌",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1nneve2/google_frontend_interview_in_2_weeks_how_would/",
      "comments": [
        {
          "body": "Congrats! For Google frontend, balance your prep with JS/React and essential DSA. LeetCode questions from \"Arrays\", \"Strings\", \"Trees\" are crucial. YouTube channels like \"Traversy Media\" are gold for JS/React. To stay calm, structure answers using STAR (Situation, Task, Action, Result) - it keeps responses clear. Good luck!",
          "score": 2
        },
        {
          "body": "Hey, check your DMs I think I can help.",
          "score": 2
        },
        {
          "body": "What helped me was splitting prep: mornings on LeetCode arrays/strings and a couple trees, afternoons on JS/browser fundamentals. I practiced writing debounce/throttle and explaining the event loop, rendering, and accessibility out loud. I pulled prompts from the IQB interview question bank and ran short mocks with Beyz coding assistant to simulate pressure.\n\nIn the interview I used a simple flow: restate, define examples, brute force, optimize, test. For behavioral, keep answers ~90 seconds using STAR and keep 5–6 stories handy you can remix for different questions.",
          "score": 1
        },
        {
          "body": "Hit the classic LeetCode mediums focusing on arrays, strings, trees, and graphs since those show up most frequently. For frontend depth, make sure you can explain closures, prototypes, event delegation, the event loop, and React lifecycle methods inside and out. Practice coding these concepts from scratch rather than just talking about them.\n\nThe key to staying structured during the interview is practicing your thought process out loud beforehand. Walk through problems step by step, explain your reasoning, and don't jump straight into coding. Google values clear communication as much as technical skills. For resources, [javascript.info](http://javascript.info) is gold for JS fundamentals, and practicing frontend system design questions will set you apart from other candidates. The reality is that most people over-prepare on algorithms and under-prepare on explaining their frontend knowledge clearly.\n\nI'm on the team that built [interview prep AI](http://interviews.chat), and it's been really helpful for candidates practicing these kinds of technical explanations and getting comfortable with the back-and-forth nature of coding interviews.",
          "score": 1
        },
        {
          "body": "Do a balanced split: daily LeetCode mediums (arrays/strings, two-pointers, stack, BFS/DFS, sliding window) + FE essentials (JS event loop, closures, prototypes, async, DOM, CSS/layout, accessibility, performance, React hooks/state/effects). Do mocks with friends, even with AI (cuz it's non judgemental) if you don't have anyone helping out, there are some services that simulate a phone interview, this is a free one: [voice.neuraprep.com](https://voice.neuraprep.com)",
          "score": 1
        },
        {
          "body": "How did it go? Can you share the questions please?",
          "score": 1
        }
      ]
    },
    {
      "title": "How come I never see or hear of bad reviews for businesses on Google Reviews or Yelp left by those who failed the interviews / job application process?",
      "body": "How come I never hear of anyone leaving bad ratings due to not being chosen for a job? Something like this?:\n\n&gt; (2 stars out of 5)\n\n&gt; \"I dressed my best, updated my resume, and gave the best answers I could give at the interview for this location's (position name) opening. Despite my best efforts, 2 days after the interview, they gave me an email saying they've pursued other candidates who have also interviewed. I'm weeks away from an eviction, so I really needed this job. It's 2 stars instead of 1 because everyone was polite and the reception desk had free snacks on a tray for all guests to have. But regardless, this company can go to hell for not realizing how badly I needed this job.\"\n\nSame for those who didn't even get offered an interview; who got rejected after only submitting the application?:\n\n&gt; (1 star out of 5)\n\n&gt; \"I spent 30 minutes filling out the application and questionnaire assessment and thought I did my best, and that turned out to be quite a waste of time because just 24 hours later, an email told me they weren't choosing me for even an interview at this time. I really need a job and an income soon so I can't have employers keep rejecting me when I need a new job the most.\"\n\nSo how come I only typically see Google and Yelp reviews for customer experiences and not job applicant experiences of how the application and interview process went?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1q30d2x/how_come_i_never_see_or_hear_of_bad_reviews_for/",
      "comments": [
        {
          "body": "They’ll usually do it on Glassdoor or Indeed. That’s where I find all the juicy reviews.",
          "score": 16
        },
        {
          "body": "Because reviews for businesses are for customers of those businesses, not people who didn't get hired, didn't like the interview process, or old employees with an ace to grind. If it's posted it will get removed as they aren't customers, more like personal grudges. If you want to see reviews of being an employee somewhere or how bad their interview process is you find that on glassdoor",
          "score": 14
        },
        {
          "body": "I tried to post an \"unusual\" interview experience on indeed, and they denied publishing it. So it might be because they don't allow such reviews.",
          "score": 7
        },
        {
          "body": "[deleted]",
          "score": 7
        },
        {
          "body": "Leaving a 1 star review for not getting a job would be ridiculous. ",
          "score": 6
        },
        {
          "body": "Yelp is for food not interviews. \nGoogle is food and service. \nLeave reviews on glassdoor",
          "score": 6
        },
        {
          "body": "Both of your examples ended with how much you need a job.  They're not in the business of giving a job to everyone that needs one.  They're in the business of hiring the best person for the job.  Sounds like they did that.\n\nNext time, you might be that person.  Good luck.",
          "score": 4
        },
        {
          "body": "I used to do it before I started my own business.\n\nI still leave reviews for a lot of things though.",
          "score": 5
        }
      ]
    },
    {
      "title": "Google recruitment interviews",
      "body": "I have a 30 mins informal chat with the google recruiter over a phone call. In mail its written  \"As a first step I'd like to invite you for a 30 minutes informal chat with me during which I'd like to learn more about your experience. Apart from that I'd love to tell you more about Google as well as some details regarding the recruitment process\".\n\nWhat should I expect and anyone has similar experience to share?",
      "subreddit": "interviews",
      "score": 11,
      "url": "https://reddit.com/r/interviews/comments/1o1g3sr/google_recruitment_interviews/",
      "comments": [
        {
          "body": "my Google interview experience is from years ago, so take it for what it's worth.\n\ni had an initial screen that led to an onsite interview with 4 people. Google setup the travel arrangements and took care of everything.\n\ni met with 4 people of the team i would be joining/working with and then got a tour of the Mountain View location along with lunch at the onsite cafeteria.\n\nonce i returned home, my recruiter contacted me to let me know we would be building my candidate profile that would be presented to a final hiring panel.\n\nunfortunately for me, once the candidate profile was completed, Google froze the position and decided not to hire anyone.",
          "score": 6
        },
        {
          "body": "Reading the Google recruitment interview stories, HR people see a familiar pattern of rushed screeners and unclear feedback. Some teams rely on their ATS plus ZipRecruiter to shortlist based on basic criteria and handle interview reminders, but meaningful improvement usually comes from tightening the scoring rubric and debrief notes.",
          "score": 3
        },
        {
          "body": "Be prepared to address your experience (+ any gaps on your resume) and expectations around comp/location. Also be prepared for a google style question (behavioral or hypothetical) - they will test your ability to answer concisely and thoughtfully to see if you will do well in the interviews. I just wrapped up my final interview with G and am waiting to hear back. Best of luck!",
          "score": 2
        },
        {
          "body": "I just finished a full loop of Google interviews. Feel free to message me if you have any questions.\n\nMy advice is feed ChatGPT the resume you sent the recruiter, feed it a link to the job posting and enjoy the back and forth conversational prep. In my recent experience it gave me high levels of confidence and covered a lot of the questions they asked in the interviews and will also help you fine tune your interviewing style, problem solving and critical thinking breakdowns in the later interviews. Good luck!",
          "score": 2
        },
        {
          "body": "I would expect a broader discussion, and a quick one. They saw something in your background that got you to this point. My strategy would be to look at the position description, and think of your work history and how it relates to the role. Have specific examples. Also, think about questions like \"where do you see yourself in 5 years?\" Maybe compensation expectations. The questions will most likely be broad in nature, given it is the recruiter. Good luck!",
          "score": 1
        },
        {
          "body": "Just had my call:\n\n1. Overview of the role/location/comp\n2. Walk me through your resume(said that I answered a few of his questions already) \n3. How do I build relationships with customers.\n4. Hypothetical question related to my role(hate those)\n5. Said that he thinks i’ll get to the next round:)",
          "score": 1
        },
        {
          "body": "So it's mostly your experience, resume details from your side. From the recruiter, it will be sharing the role details with you, like checking whether you are all aligned with comp, required experience level, and others. But always prepare for why you're a good fit for the role, why G and other common behavioral questions.",
          "score": 1
        }
      ]
    },
    {
      "title": "Google Account Strategist Interview",
      "body": "I applied to a Senior Account Strategist interview a couple of weeks ago. I got the email to take the Google Hiring Assessment, took that and got the results that I passed the next day.\n\nI also had an xwf recruiter reach out and let me know that she was passing my resume on to the recruiter who is managing the role that I applied for. A couple of days later, I had another xwf recruiter reach out to me and say, “ I’m ___ supporting the Google recruiting team. I wanted to connect with you about an exciting opportunity here at Google for our Account Strategist Role!\n\nThis role is a full- cycle consultative sales role supporting the growth of our key advertising clients through Google Ads solutions. If work/life balance, competitive compensation, an inclusive team culture, and great benefits are important to you; can we chat about the role, your career goals, and see if you can envision yourself here at Google?” And then proceeded to send me the link to her calendar to book a meeting.\n\nI have the interview scheduled for 2 weeks from now but there’s no update to my application in the careers portal. It still just shows that I passed the assessment.\n\nIs this normal? Could she be reaching out for a different position than the one I applied for? Any insights are welcomed along with any tips! Thanks everyone.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1o24dly/google_account_strategist_interview/",
      "comments": [
        {
          "body": "that’s normal. I just finished interviewing for an AS position and my application still says availability submitted (even though i have completed all rounds + an extra interview). As long as it’s still active on the portal, you’re fine",
          "score": 1
        },
        {
          "body": "Hi! \n\nCan you please let me know if you had to take the Account Strategist Assessment, after taking the Google Hiring Assessment (GHA)? I am currently in the second stage of the application process as I passed the GHA, and want to know if you had to take the Account Strategist Assessment after you completed the GHA. I have not had any luck finding anything on the internet to help with prep, so I am thinking this may be a new pre-req. I really want to move forward in the application process, but worried this additional assessment might derail me. Any insight would be greatly appreciated.   \nThank you!!",
          "score": 1
        },
        {
          "body": "Hey there! I just got an invite for a second assessment focused on the Account Strategist. Still not contacted by a human I’d say. But just curious  to know if you received the same kind of assessment initially",
          "score": 1
        }
      ]
    },
    {
      "title": "Google hiring assessment, odds of getting an interview?",
      "body": "I applied to a role at Google, the next day I received an invite to do the assessment, passed the assessment, haven't received an interview invite since then. It's been about 2 weeks. What are the odds of actually scoring a recruiter first round interview? ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ntm9d2/google_hiring_assessment_odds_of_getting_an/",
      "comments": [
        {
          "body": "First off, congratulations on passing the Google hiring assessment! That's a significant milestone and a huge validation that your resume and initial qualifications are strong enough for them to take a closer look.\n\nIt's completely normal to be in a holding pattern right now. Google's hiring process is known for being thorough and can take a long time, often a month or more from application to offer. Passing the assessment doesn't guarantee a recruiter interview, but it does mean your profile has been flagged as a strong candidate and will now be reviewed by a recruiter and/or hiring manager. The delay often has to do with the sheer volume of applicants they receive and the internal processes of matching candidates to specific hiring teams with active openings. You're in a pool of pre-vetted candidates, and the next step is for a human to review your resume against current team needs.\n\nWhile the waiting can be stressful, it's not a bad sign. It just means the process is moving at its own pace. Continue to be patient, but also keep your job search active and apply for other roles. This is a great position to be in, and your chances of a recruiter interview are much higher now than they were before the assessment. [https://www.pihrate.com/category/careers/google-careers/](https://www.pihrate.com/category/careers/google-careers/)",
          "score": 2
        },
        {
          "body": "My input…. I took and passed the assessment and was denied an interview.",
          "score": 1
        },
        {
          "body": "Did you get a return?, and if yes after how many weeks in total?",
          "score": 1
        },
        {
          "body": "Totally get why you’re stressed, this stage feels like Schrödinger’s interview 🙃\n\nPassing GHA basically means: “ok, this person isn’t a total mismatch”, not “we’re 100% interviewing them”. After that it’s a mix of your resume vs other candidates, whether the team still has headcount, and how overloaded the recruiter is. Two weeks of silence is normal, even though it sucks. I’ve seen people get a call at 3–4 weeks and others just… never hear back.\n\nIf you haven’t already, I’d send one short follow-up after \\~2 weeks, then mentally move on and keep interviewing elsewhere. Treat any Google reply as upside, not something you’re owed.\n\nIf you expect more GHAs in your pipeline, I have some structured prep notes I used (how to think about consistency, how I approached the scenario questions, etc.). Happy to share if you DM me.",
          "score": 1
        },
        {
          "body": "Did you hear anythin back?",
          "score": 1
        }
      ]
    },
    {
      "title": "I GOT AN OFFER!!!!!",
      "body": "OH MY GOD. After 1 year and 2 months in the job market I got an offer TODAY!! \n\nI am SO relieved to be typing this, I am in actual disbelief. I did it you guys! This job market has been horrible, but I have to say I found the most PERFECT job. It’s with a small team, with an amazing culture. \n\nI started my career in aviation (completed my pilots license at 17), however decided to go down an alternate path. I was originally going to college for aviation but then COVID hit and I paused school and flying for a little bit. I ended up opening a dog training company and owned it for 3 years, it was great! During that time I went back to school online and finished a degree in marketing. \n\nI am currently 26 and had no internship experience. About 8 months into my job search, I started to realize that I needed more experience, so I started volunteering for a non-profit doing their Google Ad Grant account. \n\nAs of today, I have been offered the job as a Marketing Specialist!! This is my first “real” role in marketing and I am so thankful. \n\nJob Search Metrics -\n\nOver 1500 jobs applied to\n\n43 interviews\n\n6 final interviews\n\n1 offer\n\nBonus - \n\n3 of the final interview companies offered the job to candidates with more experience, but also upgraded the job title. \n\nIf I had any advice, just take care of yourself. It is so important. Also, the job search is a numbers game. Just because you are interviewing with 1 company, do NOT stop applying to others. The more people you get in front of, the higher chance you’ll get an offer. I’m rooting for all of you! 🥳🎉",
      "subreddit": "interviews",
      "score": 2260,
      "url": "https://reddit.com/r/interviews/comments/1ht573n/i_got_an_offer/",
      "comments": [
        {
          "body": "4TH POST I’VE SEEN WITH A JOB OFFER TODAY",
          "score": 77
        },
        {
          "body": "Congratulations!!! That is fantastic news :)",
          "score": 24
        },
        {
          "body": "Yes, and you’ll be amazed at the changes and the location. For every one that falls through, it’s preparing you for the one that works, even if surprise location. I’m proof of that. Worked at the same location for 22 years. Then 3.5 with no interviews. Then 2 offers almost at the same time in a different state and different work type. The 3.5 years made me better for these 2",
          "score": 8
        },
        {
          "body": "Congratulations!!! This is inspirational!! \n\n1500 applications. Wow. Persistence won out!! Great job. \n\nI am encouraged to keep going!\n\n#150appsrequestingbytheendof\nthenyearforme. \n\nThis post is gold. I'm going to keep it as one of my bookmarks\n\nThank you and congratulations again!! 😄😄😄😄😄😄😄😄😄😄😄😄😄😄😄😄",
          "score": 8
        },
        {
          "body": "[deleted]",
          "score": 7
        },
        {
          "body": "🥳🥳🥳🥳🥳",
          "score": 4
        },
        {
          "body": "Congratulations! \n\nGreat advice as I got a new job this month as well! If anyone is still looking, keep at it, don’t give up!",
          "score": 5
        },
        {
          "body": "[removed]",
          "score": 4
        }
      ]
    },
    {
      "title": "PM Interview Prep Plan: How I got PM offers from Meta, Google, and Netflix",
      "body": "Six months ago, I decided to get serious about switching roles. My previous company was fine — but I wanted to work somewhere where product decisions actually moved the needle. I started preparing methodically for PM interviews at top tech firms, and after about three months of structured prep, I ended up with offers from Meta (L5 PM), Google (APM-II), and Netflix (Product Manager, Growth).  \n  \nProfile:  \nTech undergrad + MBA  \n6 YOE in product (mid-size SaaS + startup)  \nGoal: Land at Google, Netflix, or Meta  \nOutcome: 3 offers  \n  \n\\------------------------------------------\n\n  \nWeeks 1–2: Technical Refresh  \n  \nEven though PMs aren’t expected to code daily, the technical round can kill your confidence if you’re rusty.  \n\t•\tRevisited basics of APIs, databases, load balancers, caching, queues, and cloud concepts.  \n\t•\tFollowed System Design Primer (GitHub) — gold standard.  \n\t•\tWatched Gaurav Sen’s system design playlist on YouTube.  \n  \n\\------------------------------------------\n\n  \nWeeks 3–5: Product Design &amp; Sense  \n  \nI spent three solid weeks on this because this is the differentiator at Meta and Google.  \n\t1.\tRead Decode and Conquer and Cracking the PM Interview.  \n\t2.\tUsed Exponent’s question bank + Lewis Lin’s frameworks (CIRCLES, AARM, etc).  \n\t3.\tWatched Shreyas Doshi’s talks on product thinking — insanely helpful for framing product sense answers.  \n\t4.\tPracticed with Nora AI’s mock interviewer, which gave personalized feedback. That helped me tighten my responses.  \n  \n💡 Tip: Don’t memorize frameworks. Internalize the flow of thinking (problem → goal → constraints → trade-offs → metrics).  \n  \n\\------------------------------------------\n\n  \nWeek 6–7: Behavioral &amp; Leadership  \n  \nNetflix and Meta both grill you hard on culture fit.  \n\t•\tFor Meta, I studied their “Move fast, focus on impact” values and practiced behavioral questions using STAR+reflection format.  \n\t•\tFor Netflix, re-read the Culture Memo and crafted answers that reflected autonomy, accountability, and candor.  \n\t•\tUsed Nora AI Mock Interviewer to simulate behavioral rounds — it even gave me tone and structure feedback like “You skipped reflection—how did the team feel about your decision?”  \n  \nAlso prepared stories for:  \n\t•\tFailure / disagreement  \n\t•\tLeading without authority  \n\t•\tPrioritization under pressure  \n\t•\tProduct failure post-launch  \n  \n\\------------------------------------------\n\n  \nWeek 8: Product Metrics &amp; Estimation  \n  \nThis part trips a lot of people up. I used:  \n\t•\tInterview Math by Lewis Lin  \n\t•\tExponent’s Estimation Q Bank  \n\t•\tWrote down a list of metrics for common products (YouTube, Instagram, Airbnb, Uber Eats).  \n  \nPro tip: Always break down estimates with clear assumptions — don’t jump to numbers.  \n  \n\\------------------------------------------\n\n  \nWeek 9–10: Revise + Realistic Practice  \n  \nBy this point, I knew the content — the issue was delivery. I scheduled one mock every 2–3 days.  \nI alternated between human mocks (Exponent) and AI mocks (Nora AI).  \n  \n  \n\\------------------------------------------\n\n  \nThis isn’t a “perfect plan,” just what worked for me.  \n  \nIf you’re preparing for PM interviews this season, I’d genuinely recommend practicing structured interview rounds early  \n  \n\\------------------------------------------  \nAlso, Nora’s free interview guides are ridiculously good starting points for top-company prep:  \n  \n\t•\tGoogle APM Interview Guide 2025: [https://interview.norahq.com/interview-guides/google-associate-pm-interview-guide-2025](https://interview.norahq.com/interview-guides/google-associate-pm-interview-guide-2025)  \n  \n\t•\tMeta PM Interview Guide 2025: [https://interview.norahq.com/interview-guides/meta-product-manager-interview-guide-2025](https://interview.norahq.com/interview-guides/meta-product-manager-interview-guide-2025)  \n  \n\t•\tNetflix PM Interview Guide 2025: [https://interview.norahq.com/interview-guides/netflix-product-manager-interview-guide-2025](https://interview.norahq.com/interview-guides/netflix-product-manager-interview-guide-2025)\n\n[](https://interview.norahq.com/interview-guides/google-associate-pm-interview-guide-2025)",
      "subreddit": "interviews",
      "score": 8,
      "url": "https://reddit.com/r/interviews/comments/1oqpgd8/pm_interview_prep_plan_how_i_got_pm_offers_from/",
      "comments": [
        {
          "body": "Solid strategy there! I'd say your emphasis on feedback loops and deliberate practice is spot on. Keep iterating your approach, incorporating tech refresh and managing mock pace can really refine delivery. The framework strategy for product thinking is genius—internalizing it rather than rote learning makes a huge difference during stressful interviews. Props on recognizing the impact of good behavioral story prep for culture fit—key for Meta &amp; Netflix. Seems like those who invest in both personal reflection and tactical skill-building tend to succeed. 👏",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "Hi! \nFor someone who’s pivoting from SWE to PM. How do I start preparing for interviews?",
          "score": 1
        }
      ]
    },
    {
      "title": "Specified Role at Google - how do things work after interview?",
      "body": "I just finished my final round of onsites for a specified role at google (non-tech, Europe). I assume things are run a little differently than for evergreens r.e. team matching and HC, but does anyone here have some insight into the exact steps that happen? Is the top candidate selected before HC or are multiple strong candidates sent and the top selected after? Typically how many people are in the running at this point.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p68zpy/specified_role_at_google_how_do_things_work_after/",
      "comments": [
        {
          "body": "From what I've heard the specified roles usually have a smaller pool of candidates making it to HC compared to the evergreen positions. They typically pick 2-3 strong candidates max to send through, then HC decides if any of them clear the bar rather than ranking them\n\n  \nThe team matching part is basically already done since you interviewed specifically for that role, so it's more straightforward than the regular SWE process where you're floating around trying to find a team after getting the thumbs up",
          "score": 1
        }
      ]
    },
    {
      "title": "Been over a week since my Google interview. Should I be worried?",
      "body": "Had my first interview with Google a little over a week ago. Recruiter said she’d get back within a week but haven’t heard anything yet. Does a delay usually mean rejection, or is this normal? Anyone been through the same?\n",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1o5xazn/been_over_a_week_since_my_google_interview_should/",
      "comments": [
        {
          "body": "You should wait an extra 24h before sending an update request email \nSo that you don't sound impatient\n But i unfortunately have to break it off for you as a delay from their end usually means they have decided to pursue  with another candidate",
          "score": 3
        },
        {
          "body": "Hey did you hear back? If yes, are your next rounds gonna be in-person or virtual?",
          "score": 2
        },
        {
          "body": "is this for internship?",
          "score": 1
        },
        {
          "body": "Delay from Google or don't hear from them is good news. They don't waste time rejecting candidates.",
          "score": 1
        },
        {
          "body": "Do you need h1b visa transfer?",
          "score": 1
        }
      ]
    },
    {
      "title": "Update: Got an email from the recruiter at Google to schedule Phone Screening Interview.",
      "body": "Applied for a Digital Strategy Lead role and have a phone screening next week. Wonder what kind of questions should I be ready for?\n\nThanks for the help in advance! ",
      "subreddit": "interviews",
      "score": 14,
      "url": "https://reddit.com/r/interviews/comments/1nyc12l/update_got_an_email_from_the_recruiter_at_google/",
      "comments": [
        {
          "body": "I recommend uploading the job description, your resume, and a brief profile of the hiring manager (including their title, background, and LinkedIn summary if available) into ChatGPT. Ask it to generate a list of potential interview questions the manager might ask. Once you review those, request additional ones. Specifically ask for questions that go beyond the basics.\n\nThen, practice answering each question using examples from your experience. Structure your responses with the star method (Situation, Task, Action, Result) to keep them clear and impactful. Make sure to have a list of your own questions to ask them as well.\n\nGood luck!",
          "score": 9
        },
        {
          "body": "Google interviews are no joke. The phone screen is usually just with the recruiter, so make sure you understand the role and responsibilities inside out. The second interview is where it gets technical — expect scenario-based questions with limited details designed to test your problem-solving skills and “Googleyness.” The third interview focuses more on culture fit; it’s usually a casual conversation to see who you are as a person and how you’d mesh with the team.",
          "score": 4
        },
        {
          "body": "If I may ask, how many days after application did you get the update?",
          "score": 1
        },
        {
          "body": "I had a similar screen for a strategy lead role and the recruiter mostly probed on fit and scope. What helped me was building a tight 60 second pitch on my background, then 5 to 6 STAR stories mapped to the JD themes like cross functional influence, ambiguous problem solving, and impact with numbers. I kept each answer under 90 seconds and practiced out loud.\n\nI also did two quick role plays where a teammate “was the recruiter” and I timeboxed answers using Beyz interview assistant. Finish with 2 or 3 thoughtful questions about success metrics and stakeholders. You’ve got this, congrats on the screen!",
          "score": 1
        },
        {
          "body": "Whats your background? If you dont mind sharing? MBB?",
          "score": 0
        }
      ]
    },
    {
      "title": "Anyone taken Google Product Solutions Engineer interview recently?",
      "body": "I’m in the loop for the technical interviews and I’d like to know exactly how these interviews go as it’s a bit different from the regular SWE roles.\n\n",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1oxfc4o/anyone_taken_google_product_solutions_engineer/",
      "comments": [
        {
          "body": "omg i'm in the pse loop too and stressing so much about the case interview part!! the leetcode is one thing but the whole \"explain technical concepts\" part has me nervous.",
          "score": 2
        }
      ]
    },
    {
      "title": "Seeking advice: Google interview cloud/ infrastructure interview.",
      "body": "Hi guys, \n\nI need some help and advice if anyone has already given interview for this role. How many rounds will be there and what the difficulty? If you have any advice for the interview. \nHow to approach the ans etc.\nPlease comment if you have experience. Thank you.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nnn2m3/seeking_advice_google_interview_cloud/",
      "comments": [
        {
          "body": "I work in ops at Prepfully and we see a lot of Google cloud/infra interviews come through. For these roles you're typically looking at 4-5 rounds total - usually 2-3 technical coding rounds, 1 system design (even for L3/L4), and 1 behavioral/HM round. The technical difficulty is definitely leetcode medium to hard level, but they really care about how you communicate your thought process and ask clarifying questions upfront before jumping into code. For the system design portion, make sure you have solid fundamentals around distributed systems, load balancing, databases, caching, and basic networking concepts. Don't try to memorize solutions but focus on understanding tradeoffs and being able to explain why you'd choose one approach over another. The behavioral round will dig deep into past projects where you've dealt with complex technical challenges, so prepare specific examples that show your problem-solving process and impact. Practice talking through your code out loud since that's where a lot of people stumble even if they know the material well.",
          "score": 1
        },
        {
          "body": "Google's infrastructure interviews have usually 4-5 rounds with heavy system design and coding. They'll grill you on scalability, distributed systems, and expect you to design something like YouTube from scratch.\n\nFor live interviews, honestly I'd used Final Round AI copilot tool if you're not confident enough. It's not detectable and really increases your chances of getting hired. I've tried it myself and it worked, simple as that.\n\nPractice explaining your thought process out loud since they care more about how you think than the perfect answer.",
          "score": 1
        },
        {
          "body": "Preparing for a Google interview, especially in a cloud or infrastructure role, can be daunting because of the high bar they set. It's smart to focus on the structure of your answers because Google evaluates candidates not just on their technical knowledge, but also on their \"Googliness,\" leadership, and general cognitive ability. The interviews will likely cover foundational knowledge in Linux, networking, and system design, as well as specific Google Cloud services. They are looking to see how you approach and solve problems, how you handle ambiguity, and how you communicate your thought process. I've found that a great way to prepare is to practice breaking down complex scenarios and walking through your solution step-by-step. To get a better sense of the types of questions and the best way to structure your answers. You can find it right here: [pihrate.com/category/careers/google-careers/](http://pihrate.com/category/careers/google-careers/)",
          "score": 1
        },
        {
          "body": "Google's cloud/infrastructure interviews typically involve 4-5 rounds including phone screens, technical deep-dives, and behavioral assessments. The difficulty is genuinely high - they'll test your system design skills with questions about scaling distributed systems, your coding ability with infrastructure-related problems, and your understanding of cloud architecture patterns. Expect questions about load balancing, database sharding, microservices, and how you'd handle massive scale scenarios. They want to see how you think through complex problems step by step, not just whether you know the right answer.\n\nWhen approaching answers, start with clarifying questions to understand the scope and requirements, then work through your solution methodically while explaining your reasoning out loud. They care more about your thought process than getting everything perfect, so talk through trade-offs between different approaches and be ready to defend your design choices. The behavioral rounds will focus on leadership principles and how you've handled challenging technical situations in the past, so prepare concrete examples that show impact and learning.\n\nI'm on the team that built [interview AI helper](http://interviews.chat) to practice these types of complex technical questions and get real-time feedback on how to structure your responses for maximum impact.",
          "score": 1
        },
        {
          "body": "Went through a Google cloud/infra loop last year. For me it was 5 rounds with 2 coding, 1 system design, 1 troubleshooting-ish, 1 behavioral. What helped: I did daily 45 min mocks where I forced myself to clarify requirements first, outline tradeoffs, then code while narrating. I used Beyz coding assistant to run timed practice and pulled prompts from the IQB interview question bank. For design, practice back-of-the-envelope latency/bandwidth math and failure domains.",
          "score": 1
        }
      ]
    },
    {
      "title": "How can I prepare for Application Design interview round at Google?",
      "body": "There are many topics many people are suggesting to go through for Application Design interview round. Some are saying simple questions from internet will not be asked. Difficulty level would be a bit more than that. Advice is to have in-depth knowledge in topics like Caching servers, LB, Authentication, DB. What is the right platform to help me with the prep?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oz9rrz/how_can_i_prepare_for_application_design/",
      "comments": []
    },
    {
      "title": "What should I expect in the Google Account Strategist recruiter screening interview?",
      "body": "Hello everyone,\n\nI have a 30-minute screening call with a recruiter for the Account Strategist position in Dublin (English is not my first language).\n\nCould anyone share what kind of questions to expect - ideally from people who have already gone through this interview?\n\nAlso, what usually happens after this first interview?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oibnn3/what_should_i_expect_in_the_google_account/",
      "comments": [
        {
          "body": "the recruiter screening is pretty basic stuff - why Google, why this role, walk through your resume. They'll probably ask about your experience with client management or sales if you have any.\n\nSince English isn't your first language, I'd recommend doing some mock interviews to practice. I've done the same and it really helps with nerves. Final Round AI's mock interview feature is solid for this kind of prep.\n\nAfter the screening you'll likely get a case study or technical round focused on Google Ads scenarios. Good luck!",
          "score": 1
        }
      ]
    }
  ]
}