{
  "company": "home-depot",
  "post_count": 59,
  "exported_at": "2026-01-18T17:44:53.281Z",
  "posts": [
    {
      "title": "I got a Job at Home Depot ",
      "body": "I need some help with my Interview and i know what to say, but i'm afraid that i won't get the Job, i have ADHD + Autism which makes it hard for me, and this is my first job, doing Merchandising, i worked at my local Habitat for Humanity doing volunteering with Stocking",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1gyjals/i_got_a_job_at_home_depot/",
      "comments": [
        {
          "body": "Do not worry! And congratulations you got a job at a great company. Stay calm, don’t focus on the result, just focus on doing your best thats it, rest will take care of itself. Good luck",
          "score": 1
        },
        {
          "body": "Use ChatGPT to practice interview preparation",
          "score": 1
        }
      ]
    },
    {
      "title": "I need help applying for jobs please ",
      "body": "Hello, I have been applying for jobs since April and I had no chance yet. It's nothing crazy, just entry level jobs for places like McDonald's, Dunkin, Barnes &amp; noble, home depot, walmart, etc. Recently I had someone revisit my resume and he corrected a few relevant mistakes so and I'm really motivated to scrap everything and start back with better and stronger applications.\nSo I will try to list everything I usually do when looking for jobs and please let me know if there is anything I could improve, l also attached my current resume and an example of a cover letter I sent.\nSo mainly what I do is go to businesses and ask if they're hiring, they either tell me “no”, \"idk but I can take down your name and give it to my manager\", \"you can go to our website\" or give me a form to fill(sometimes I use my phone to check the information I'm entering let me know if it is bad). I only heard back from a job once where I filled my application, but I always push to leave my information. Since this isn't working I'm thinking of walking into businesses and immediately ask if I could speak to the manager(please let me know if it is a good or bad idea). I often try to comeback a few times and I let them know I've been here before. When I apply online I just follow the instructions and try to complete everything at once(assessments etc). For cover letters or short essay questions I usually ask chatgpt to write it for me and I edit it to make it more personal.\nI had an interview at a bobba shop and when I came it was basically a training from an employee (manager wasn't even there), I did everything right and she even told me they were so short staffed that she had to work everyday. I gave my availability (which was free everyday) and I had to email them two times for them to tell me l was not selected and yet they're still looking for employees. I also had an interview at target and was selected but I told them I will not be available EXCLUSIVELY (made sure to be very clear) next week as I had a school trip but I was available everyday normally. I wasn't picked but I reapplied when I got back from my trip, told them I was fully available(didn't even mention my past application) and I wasn't selected.\nI would also like to precise I am 20 year. When I go to interviews I dress formal, without a tie. I usually prepare for interviews by looking for job interviews in that area on tiktok, and I watch videos from indeed on YouTube and more. I’m always told the way I carry myself if impressive during interviews but I’m never selected so I’m guessing its a generic comment. I would also like to add, I cannot provide the contact of the manager of the Christmas tree sales shop as I didn't have it :/. For my references I use my brother, the manager of the museum and my math professor(who also works at the museum, I just put her down as the assistant manager).\nSorry I hid my information too for my privacy, I hope that doesn't provide any problem to help me. Please let me know if you note something I'm doing wrong. I desperately need a job :/\n",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1f9rwj9/i_need_help_applying_for_jobs_please/",
      "comments": [
        {
          "body": "That's because it's a difficult market and all they're going to be looking at is why you haven't stayed anywhere for that long",
          "score": 2
        }
      ]
    },
    {
      "title": "Totally frustrated of ending up in the second place! ",
      "body": "I was in consulting (Tier 2 firm) and decided to accept the “Garden Leave” for 2 months and have been on the market since May as the firm lost a major chunk of business due to the economic slowdown. \n\nI have had interviews with 9 companies since May 15. I had final rounds for 3 of those companies over the past couple of weeks and literally each one of them came back to me with “It was down to you and one more candidate. They had a particular experience that gave them the edge and we decided to go with them.” The experiences they mention isn’t something that can be developed. For example, one of the roles was for an Analyst role within Customer Experience team and the person who accepted the offer had worked for 2 years at Home Depot or some similar retail job. \n\nThe recruiters have had the decency to call me or send me detailed emails, with minor points of improvement for me, but not critical enough to rule the decision against me. Basically, I’ve been the second best candidate in every interview and it’s starting to feel tired and frustrated! \n\nAny advice would be appreciated! ",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1f3w1en/totally_frustrated_of_ending_up_in_the_second/",
      "comments": [
        {
          "body": "The good news is that you're clearly doing a lot of things right to make it to the final rounds. The key now is to find that extra edge that will push you over the finish line. Maybe it's about highlighting different aspects of your experience or finding ways to better align your skills with the specific needs of the role.\n\nOne thing that might help is using a tool like [interviews.chat](http://interviews.chat) It can generate questions tailored to the job description and let you practice answering them, which might help you refine your responses and stand out even more. Plus, it offers real-time suggestions during online interviews, which could be the boost you need to finally land that job. I’m on the team that made it, and we designed it to help people navigate tricky interview questions and ease the pain of the job search process. Keep pushing forward; you're almost there!",
          "score": 2
        }
      ]
    },
    {
      "title": "My Junior Is Finally Starting To Get Stuff So Here’s Some Tips For Other Juniors",
      "body": "So about a 3 or 4 months ago we had a new hire and it became mine and the teams job to train her. Just to note I’m in no way a senior developer, I’m a junior myself, however I pretty much know the ins and outs of what I work on (I’m a devops engineer), so this girl was straight out of college/university and she needed lots of hand holding. Time seniors did not have, so as being trained I was tasked with giving training. \n\nNow I had made some fantastic notes and a training plan and I was so excited. I thought that it would be a breeze, but I was wrong. She was struggling to understand things and didn’t ask any questions, never made any documentation on anything I taught her. She would just watch the training and then forget and complain to her friend (who was also one of the people I was training) that she was learning too much, how can she keep up with the pace. Now don’t get me wrong, I’ve automated most of the processes. There’s hardly any manual things to do, I was simply trying to ensure she understood how we’ve set up our environments, cloud infrastructure, Jenkins etc. \n\nI realised this was going to be a very long and hard task and so I decided to set her some training activities make a very simple pipeline which uses the cat command and then emails the output to the user. She struggled so much with this one task I think it took her total 1 month to complete - and even that I had to go in and hold her hand and show her how to do it.\n\nUnfortunately at that point I was lost, I had no idea what to do. She was deleting important Jenkins jobs, she was destroying environments which were being used for testing (after she decided to use it and I asked her why are you using that environment? Who asked you to etc?) then when the team asked her why she simply blamed me, they obviously knew it was not me, and that I didn’t tell her to.\n\nEven as I’m typing this I gave her one ticket this sprint in which she simply has to ask another team to complete their task. It’s small steps and she asked me how can she get in contact with that team, but at least she’s taking initiative to start her ticket! This to me is progress and not even in a condescending way. Genuinely, the fact she is starting to take her own initiative makes me proud. \n\nHaving to give micro level instructions is very tiring. Thursday evening I had a long talk with the girl and said look if you don’t care about the work then ask to move teams. You aren’t making notes or documentation, and I have to give you micro level instructions for you to complete any task. You’re not understanding anything and you keep telling me you’re doing stuff (such as learning Linux or git - no cap she literally claimed to be learning the cat and find command for 3 weeks and l asked her to use it and she said she didn’t know it). We work remotely. So I asked her again what she does when she doesn’t have any active tickets to do and she simply said she does nothing. I honestly didn’t know how to react I was shocked, anyways it seems she pulled her socks up she sent me some documentation this morning about a few of the basic processes we have. It’s not much but it is some progress.\n\nAnyways I’m leaving the company in like a few days so at least I am done with that. But I have some advice for new joiners/juniors.\n\nPlease record training sessions. This will help you review and understand in the future. You need to want to learn, be proactive, read the emails that come to your team debug them in your own time, understand what solutions your team have given. Make draft solutions to automation tasks and ask your seniors what they would’ve done differently. How could you improve it etc. talk during scrum calls highlight what you’re struggling with, what you’re doing.\n\nOverall just have fun, otherwise you’ll just resent the work you’re doing.",
      "subreddit": "cscareerquestions",
      "score": 1352,
      "url": "https://reddit.com/r/cscareerquestions/comments/z0vyny/my_junior_is_finally_starting_to_get_stuff_so/",
      "comments": [
        {
          "body": " im not gonna lie, sometimes i feel completely incompetent as a junior but this made me feel a lot better hahaha. im glad things are possibly turning around for her.",
          "score": 1136
        },
        {
          "body": "&gt; My Junior Is Finally Starting To Get Stuff\n\nThat's uh...not the impression I came away with from this story.",
          "score": 492
        },
        {
          "body": "How's her friend then, since they're in the same training? If her friend can't understand as well, then I think the onboarding might not have been clear enough. It might also have been the infra/internal procedures as well. Otherwise, I can't see how she can take weeks to learn unix commands and git when it's a bread and butter skill and can be picked up in days/on the go while doing tasks.",
          "score": 84
        },
        {
          "body": "One thing I found really challenging as a junior was managing expectations. Many places will expect you to have significant output from the beginning. Seniors and leads often don't have time or energy for training and become frustrated that you effectively have to be paid to study for a few months.\n\nWhile some places, like OP's, understand the need for patience (and small, deliverable tasks for accountability), many don't. So to people who are starting out as juniors right now:\n\n* Stay humble and own your mistakes\n* Know early if you have a mentor, or if you have to do stuff alone. If you don't have an assigned/voluntary mentor, ask questions if you're stuck for a day or two, but don't ask more than one or two each workday\n* Focus on small deliverables and get feedback after you finish them; listen to it\n* Don't take it personally if your first role is not the right one. Many places will have expectations and timelines that far exceed the capabilities even for relatively knowledgeable juniors. You will learn in all your roles",
          "score": 54
        }
      ]
    },
    {
      "title": "Name and Shame: Home Depot",
      "body": "This was for data analytics/business analytics in the corporate office. Was contacted by a recruiter after applying that they wanted a phone interview. Had the interview (purely behavioral) and it went great. They told me they wanted to fly me to Atlanta. Awesome! \n\nIn the coming days they set up a flight hotel room etc. Everything went great. Had two interviews (both 45 minutes) with two people. First went pretty well (7/10) second one went really well (9/10). I was told they would get back to me within a few weeks. \n\nA few days later I receive an email from the head recruiter saying that my recruiter will send feedback next week. Great- this is it. I then open my email one morning- for her to tell me to wait a few more weeks. Great. \n\nAt this point I have a final round interview with a telecom company. I let Home Depot know and they told me to notify them if I get an offer. They ended up giving me an offer and I let Home Depot know. My recruiter said we would be in contact soon. \n\n7 days later and I still haven’t heard from them and I told my recruiter I might have to sign my current offer. She said she wanted to call me. We talked and she recommended I sign my current offer and if I get Home Depot to renege. I was admittedly surprised she said this. I never want to renege on an offer and at this points it’s been quite a while.  (2+ weeks) \n\nAbout 10 days later I was contacted and she wanted to speak with me- finally. She then calls me to tell me to wait until Mid January. Keep in mind this was mid December when she told me this. I was floored. But I decided to wait. \n\nFinally, I emailed my recruiter yesterday. She wanted to call me. She called me today to tell me that I did great in the interview and the hiring managers liked me but a returning intern accepted a returning offer- and thus they couldn’t offer me a position. After almost nearly two months of waiting and being strung along I was declined. \n\nI’m not upset- I’m actually really excited about my current offer. But I was shocked a Fortune 500 company could be so disorganized. Furthermore, it shouldn’t take nearly two months- for a rejection. \n\nJust my two cents",
      "subreddit": "cscareerquestions",
      "score": 1454,
      "url": "https://reddit.com/r/cscareerquestions/comments/ejkd01/name_and_shame_home_depot/",
      "comments": [
        {
          "body": "I live in Atlanta. I've interviewed with HD 3 times for 3 positions over the years. Literally each one has gone similar to this.\n\nTheir interview process takes forever, and they are never forthcoming with information. And if you hint that you might have another offer, they'll start playing games.\n\nHD is a great company to work for (worked there ten years ago), but some of their processes are pure garbage and disrespectful of applicants time.",
          "score": 651
        },
        {
          "body": "This isn’t disorganization, this is called, “keeping the candidates warm.” They we’re waiting for something better to come along. I feel for you, what a pain in the butt.",
          "score": 47
        },
        {
          "body": "A bird in the hand is worth two in the bush. Never settle for anyone or company where you're not the first pick and learn to walk away. Next time give the company a two to three day waiting period, no extension.",
          "score": 104
        },
        {
          "body": "You are describing my exact interview process with them 3 years ago. I took a different offer and stayed where I’m currently located.  \n\nI started interviewing with them in September 2016. I used to be in consulting and decided I wanted out so I was very upfront with HD and told them I was leaving consulting at the end of that year had already given my notice I was just finishing off a project.  \n\nRecruiter was like no problem we are very interested in your background.  They flew me on for an interview the Thursday after Labor Day.  \n\nMy interviews went well and they had me do a technical assessment while I was there.  The recruiter told me she’d follow up next week for next steps.  The whole week is radio silence. I follow up a week after my interview via email and I hear nothing.   Another week goes by....nothing. I decide to seriously start interviewing other places.   Almost a month after my interview I get a call from another recruiter from HD.  About 2 minutes into the conversation I realize he doesn’t know I’ve already been in for an interview. I explain to him what has been going on.  He tells me recruiter I was working with left the company and he’s sorry but she didn’t keep notes so he wasn’t sure where everything was in the process.  \n\nBased on this and the fact I have 2 other solid offers I tell him that I’m no longer interested.  He’s begging me to reconsider because I’m the hiring manager’s # 1 choice.  I’m thinking to myself if you spoke to the hiring manager wouldn’t you know they I came in for an interview?\n\nThey want me to have a follow up call with the hiring manager and their manager. The call went well and I became interested in the role again.  \n\nNonsense like this went on for another month.  Finally an offer was sent that was almost laughable. It was ~40k less than what I spoke to them about re: salary.  When I contacted the recruiter thinking maybe there was a mistake he told me that I was asking for way too much money and what they are offering me is at the top of the range for that position.  I declined offer and stopped responding to them.",
          "score": 43
        },
        {
          "body": "&gt;she recommended I sign my current offer and if I get Home Depot to renege\n\nThis is certainly a name &amp; shame worthy thing for Home Depot to have done. Reneging is extremely unprofessional. I'm shocked they did that, I've heard good things about Home Depot's SWE jobs.\n\nThat being said, the rest of your story is pretty average. They weren't disorganized. They were waiting to hear back from their #1 pick (the intern) before they were allowed to extend you an offer. That #1 pick could have still been in the pipeline, so more interviews were happening, or had X amount of time to give an answer. Then, as we always see on this sub as good advice, that #1 pick probably asked for an extension on their offer deadline, which Home Depot almost surely gave them... because they're the #1 pick.\n\nIt's also plausible that there was more than 1 person ahead of you in the pipeline, which than grows the time they have to wait before they can give you an offer as well. By X weeks + the Y week extension the candidate probably asks for.\n\nIf that #1 pick declined, you would see an offer coming your way immediately. That's how recruiting works. Now you underestand why companies don't like giving candidates a long time to decide, and sometimes only give 1 week or a few days. It's because whatever time they give their first pick, means their second pick has to wait at minimum that amount of time. And their third pick has to wait that long + the same amount of time for pick 2. And so on and so on.\n\nIf they did something like extend you the offer, and then renege suddenly when pick #1 accepted that would totally be disorganized that they had conflicting offers out at the same time, but that's not what happened here. They did what recruiting does, lined up offers.",
          "score": 194
        }
      ]
    },
    {
      "title": "Home Depot Internship Final Interview?",
      "body": "Hey guys.\n\nI've recently been informed that I'm moving on to an on campus interview for Home Depot's summer internship program. It's supposedly for them to interview all the candidates that passed both the technical phone screen and the HackerRank test (although I didn't really do that well on it).\n\nDoes anyone have any information on what I can expect? Is it something they do for a lot of people? If it helps, they're sending reps to travel to my campus and interview people in one day instead of sending them to HQ. The email says it should take 30 minutes... that doesn't seem like very long for an in person interview. Is it rude to ask if this will be technical in nature, and if so, by how much?\n\nThanks.\n",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/4ait1m/home_depot_internship_final_interview/",
      "comments": [
        {
          "body": "You're perfectly welcome to email whoever contacted you and ask what you can do to best prepare for the interview. You should then know what the interview will be about based on their answer.\n\nI will typically ask what every phone call or interview will entail so I'm fully prepared. A lot of times, the recruiter will tell me even before I have to ask.",
          "score": 1
        }
      ]
    },
    {
      "title": "SWE Intern at Macy's or Home Depot and Offer Timing",
      "body": "I just got an offer from Macy's for their 2026 Technology Internship, but the deadline to accept is this Monday. I'm also in early stage interviewing with Home Depot for their 2026 SWE Internship, but I probably won't know if I get that offer for the next few weeks. Is it reasonable to ask Macy's for an extension, or should I just accept it now? The difference in pay is negligible, but is the difference in company worth it? ",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ox9lhv/swe_intern_at_macys_or_home_depot_and_offer_timing/",
      "comments": [
        {
          "body": "Accept and reneg later on if you’re interested in doing so. Just be aware if you landed Macy’s through a career fair or something its not common but there might be consequences.",
          "score": 8
        },
        {
          "body": "If they're both equal for you then go with Macy's. I don't think company prestige is a huge differentiator here. \n\n\nThe goal of an internship is to get the most experience you can doing actual dev work, so assuming both companies have that, you'll be setting yourself up well for the future regardless. ",
          "score": 4
        },
        {
          "body": "Accept and shoot for Home Depot. Macys is much smaller and has been struggling lately with much less tech then Home Depot.  5B vs 350B market cap.",
          "score": 3
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Wells Fargo vs. Home Depot New Grad",
      "body": "Hi! I already posted this on r/csMajors but didn't really get anything insightful. I'm super grateful to have any offers at all, but I'm not 100% satisfied either. I think the plan is to jump after a year or two, but I definitely want to grow + improve during my that time. Would love to hear any thoughts!\n\n**Wells Fargo:** Charlotte, NC | $48.08 / hr, \\~100k base + 10k sign-on\n\nPROS\n\n* New Grad program, so I'd come in with a cohort and they have special programming set up, too. Everyone I've talked to about it seems to really enjoy it and have no real complaints.\n* Decent benefits! 401k matching, 18 days PTO, etc.\n* Good WLB\n* You get promoted after a year, which comes with a pay raise and title change. You start out as a 'Technology Analyst' and then switch to 'Software Engineer'.\n\nCONS\n\n* I don't know anyone in Charlotte :/// I also don't plan on staying there long term, so I essentially would have to establish my life there and then eventually move (which I know is part of life LOL so this isn't really the biggest con and I'm excited to explore a city I otherwise never would have, but still kind of a bummer)\n* Old tech stack, red tape, and team dependent. Team matching (if you can call it that... basically just them looking at your resume and putting you somewhere) is done suuuuuper late in the process so I basically have no idea where I'll be put.\n\n**Home Depot:** 100% Remote | 85k base + 5k sign-on\n\nPROS\n\n* I interviewed directly with the team, and they seem really chill and supportive. The project they're bringing me on for is FRESH, as in they don't even know what tech stack they're going to use. It seems like a good opportunity to learn a lot and push myself, but also comes with a looooot of uncertainty. \n   * In general, HD's tech stack is pretty modern. GCP, Spring, React, etc.\n* Good WLB\n* I'll be coming in with the title \"Software Engineer I.\" After a year, I think they do a review of performance, and if that goes well, the pay increases to 100k and the title changes to \"Software Engineer II.\"\n\nCONS\n\n* I WOULD HAVE TO RENEGE WF. I already signed the offer letter, so there's that.\n* Worse pay, worse benefits\n* I know remote is like the gold standard, but I'm just not sure if it's the best thing for me / my work ethic? \n\nWF is def the safe option whereas HD seems like it's high risk, but high reward. I'm genuinely conflicted on which one is the best place to start my career so would love to hear what everyone else thinks!\n\nEDIT:\nI ended up reneging on WF and going with The Home Depot. I was able to leverage my WF offer to get a higher base w THD (not comparable, but still decently higher than 85k). Ultimately, I really did not want to move to Charlotte, and THD being remote let’s me go back home. I also think THD gives me the time to LC + grind for interviews while also improving as an engineer. Thanks everyone for ur insight !!",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/183czyp/wells_fargo_vs_home_depot_new_grad/",
      "comments": [
        {
          "body": "Hmm, idk charlotte COL so comp wise it's hard to say. If you full remote at LCOL, the comp might be similar.\n\nI wouldn't worry too much about reneging, title, or tech stack\n\nPersonally, I would take WF just because you can meet other people your age in person which is a huge pro.\n\nUp to you, though",
          "score": 31
        },
        {
          "body": "Just my 2c. I was at THD a few years ago and hated it. So much ass kissing, yet so little accomplished (admittedly team dependent). The benefits were terrible, not sure if they've improved since (2 weeks of PTO lol).\n\n&gt;I know remote is like the gold standard, but I'm just not sure if it's the best thing for me / my work ethic? \n\nI'm remote now and it was definitely easier to collaborate in office when someone is just a computer over. I personally wouldn't want to juggle this additional challenge if I was super invested in advancing my skills as a new grad, especially given the other cons of THD.",
          "score": 16
        },
        {
          "body": "Currently living back and forth between Charlotte and Raleigh and having either worked or interviewed for most places in Charlotte, it's hard for me to recommend taking a wf job, much less moving here for a wf job. Depending on where you're coming from, you're certainly not going to be wow'd by being here. If this were Raleigh, I'd say take it despite being a smaller city. \n\nWith that, I'd hands down would take the remote HD job. I've had good expirences with them.",
          "score": 7
        },
        {
          "body": "I would take the Home Depot job for the following reasons, in order of importance:\n\n1. *The job is REMOTE*. You can live where you choose instead of being tethered to a particular city and having to commute to work. There are no benefits better than being able to work remotely.\n2. *Modern tech stack*. This will make you more competitive and give you more flexibility for future opportunities.\n3. *Directly hired as a software engineer in a software engineering team* instead of a new grad program. This will allow you to immediately start working on real software engineering work and will cause you to develop your skills much faster.\n\nBanking is a not a good industry to work in for software engineers (anecdotal based on my time working for Bank of America). Tech employees are not valued and there is an enormous amount of red tape and outdated technology. There is hardly any innovation.",
          "score": 4
        },
        {
          "body": "Everything i’ve heard and seen about wells fargo is bad.",
          "score": 3
        },
        {
          "body": "After spending too long at WF, I will say that working there will bring you backwards in both skills and experience.  WF operates in their own world where Software Development goes. There are tons of great opportunities in the CLT area for work.  Based on Cost of Living of basically everywhere nearby, excluding CLT, I would say, reneg on the WF offer, and take the HD job, while working remote, use the downtime you have to sharpen the skills you do not get at work via Pluralsight or something comparable, leverage the benefits you get from HD, and after 2 years or so, slip into one of the dozens of other companies with higher pay.  Build your resume now, while getting paid slightly less and the long term payoffs in your skills and salary will pay of 10x. I live outside of CLT proper, and actually relocated here about 8 years ago for a better cost of living than the Northeast.  I have been in the industry for 20+ years with the last 15 being in Software. Id be happy to mentor a bit if you reach out via DM.",
          "score": 4
        },
        {
          "body": "You got a very good Base salary for WF.  3 years ago you would have gotten 75k, with a manager telling themselves this rate is unbelievably good.  \n\nNeedless to say, WF is bad for SWE, but as a new grad you'll probably do pretty good, and it sounds like they will give you good projects.  There are many good people at WF but the IT processes are really bad.  They have changed a lot over the 8 years I worked there, but new processes are still garbage.  \n\nIn the current market, I would take the WF job, and just switch jobs in 2-3 years.  You can have a long career as banking is very stable, as long as you're helpful to the business, and people like you, you can have a very nice career at WF (I would encourage it, despite my own bad experiences). \n\nCharlotte is MCOL so you will have a very comfortable life here.  I would recommend getting a room mate and living somewhere near Freedom park, South end, NODA/Plaza Midwood, or somewhere in Uptown.  \n\nThe town is full of young professionals, so you should be able to network easily, and make friends.  Charlotte's outlook looks really good.  There is plenty to do.  People are nice.  I came from Southern California, so it was very different, but I like it here.  \n\nI've heard HD is also a good company, a friend works in merchandising for corporate in Atlanta.  Can't say much about their IT department, but in store tech and website look alright.  With the current tariff environment, I think it would be more risky working for HD.",
          "score": 2
        }
      ]
    },
    {
      "title": "Am I toast? Recently finished a contract role with OpenAI and my application success rate did not really improve. ",
      "body": "Hey, so first off, I’m not really a pure SWE/CS type. I majored in computational linguistics for my undergrad and graduate studies. I specialized in NLP (sentiment analysis) and speech recognition. My graduate thesis was on transformer models/BERT (about two or three months before ChatGPT hit the scene). I’ve been looking for my first full-time job for some time now.\n\nI recently finished a two-month contract role as an AI Expert Trainer for OpenAI’s Human Data team through their contracting firm called Greenlight. It definitely was not the most technical role. I’d call it prompt engineering (maybe even technical writing)? It was essentially a group of about 350 people from various domains (chemistry, CS, law, medicine) trying to replicate something like the GPQA paper if you are familiar with it. I was chosen for linguistics/NLP. The pay rate was $100/hr, but there was also a cap on the amount of work we could contribute per week, so it was part-time as well. While not super crazy TC like I see on Blind (when I tried to ask for referrals on there, some posters laughed and said the pay was a joke), I was thrilled to be making money, especially as I’ve been on food stamps/CalFresh during my now 23-month search for a job.\n\nMy plan was to apply far more aggressively than I have in recent months and try to leverage the name (even if it was just a contract role). During these past 2 months, I’ve had just 2 interviews. The first seemed to come from my contract role announcement post on LinkedIn. I had a TikTok recruiter reach out about a role as an LLM Operation Specialist. The recruiter seemed highly interested in the work with OpenAI and knew all about the Human Data team. They seemed to change tone when asking salary expectations. I told them I thought the hourly rate offered by OpenAI was a bit crazy for my experience level, so I’d be happy to work for $50/hr since the TikTok role was FTE and had benefits. I never heard from the recruiter again. My only other interview was for a QA Model Expert at Character AI, but I was also ghosted for that as well. I really hoped my job hunt would gain some traction and that I’d have a role lined up by my contract’s end, but I failed to manage this goal.\n\nThe contract role also came with membership to OpenAI’s Community Forum. They had a couple of mixers for AI Trainers and other forum members. One was on-site at their headquarters. I would have loved to attend that one, but I’m currently the full-time caretaker for my disabled mother, so it’s not often (ever really), that I’m able to leave the home for very long, so the day trip to San Francisco did not seem feasible/possible. I did attend the virtual mixer as they mentioned networking opportunities. At the end of the mixer, they played a little game where people were randomly matched and given the opportunity to network. After 4 people failed to accept the invitation to have a video chat, I just gave up. Most of these people were professors, researchers, doctors, lawyers, etc. and my only real experience prior to the OpenAI gig was some freelance work with Outlier/Remotasks. I’m not that surprised they refused to chat with me. Later, I found out that the three OpenAI employees hosting the mixer (the forum manager, a customer success employee, and a technical program manager) were also participating in the networking game. I somewhat regret giving up on the game as I guess it would have been possible to match with them after enough video chat rejections (it would have been so cool to chat with the TPM).\n\ntldr; but yeah, am I toast? I really felt like I caught a huge break with the role and was hoping it would lead to something pretty much anywhere. I’ve applied to tech roles at “non-tech” companies like The Home Depot, tried for apprenticeships to see if it could be a point of entry, even randomly tried Grindr and The Trevor Project since I’m LGBT. I’m not all FAANG or nothing, but my application success rate with even smaller companies/startups is quite low.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1eigw81/am_i_toast_recently_finished_a_contract_role_with/",
      "comments": [
        {
          "body": "Never tell a recruiter that your previous rate was more than you think you deserved. This signals a lack of confidence, which can make recruiters hesitant to recommend you. Given your valuable background in a high-demand field like AI, you \\*should\\* aim for $100 per hour, even without extensive job experience. Quoting $50 per hour might actually raise doubts about your suitability.\n\nSometimes it takes longer than we'd like to find the right opportunity. Keep honing your skills, keep networking (and don't give up on those mixers so quickly!), and keep applying.",
          "score": 7
        },
        {
          "body": "What kind of roles are you applying to? Prompt engineering is a very new field so it's kind of a toss up if it counts as relevant experience for SWE. \n\nIt sounds like you have a non-cs STEM degree, experience that might or might not be related, and you're only going to be able to WFH to take care of your mother. \n\nHow many job postings did you apply to that got your 2 interviews? \n\nWhat does your resume look like? \n\nDo you need visa sponsorship?",
          "score": 7
        },
        {
          "body": "That was not a real technical “job” with OpenAI (replicating GPQA). Your role was basically an annotator to generate data for them.",
          "score": 3
        },
        {
          "body": "Well, if it is tough for you with OpenAI in the CV, imagine for the rest of us?",
          "score": -5
        }
      ]
    },
    {
      "title": "Need Advice Because I Cannot Find a Job ",
      "body": "I recently graduated with an associates degree in May. Alongside the degree, I have 4 years of internship experience and a few Testout certifications. I have been applying to software development positions in Columbus and Dayton Ohio as well as Davenport IA, every day since March. In this time I have gotten 1 interview with home Depot and got sent packing because I didn't have enough backend experience I guess. I feel really desperate and really don't know what I should do.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1dm288f/need_advice_because_i_cannot_find_a_job/",
      "comments": [
        {
          "body": "&gt;I recently graduated with an associates degree in May\n\nAn associates will not get you very far at all in the current job market.\n\nGet a BS in CS if you hope to compete with the thousands and thousands of other candidates with full CS degrees.",
          "score": 9
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Job hunting as a mid level in Atlanta.",
      "body": "Hello everyone. We've recently purchased a home near-ish Atlanta, Georgia and I will be looking for a mid level developer job in the next month. Other than the normal universal job boards are there any specific companies or places I should check as I begin my search?  Depending on the subject in question I'm sitting between 3-6 years of experience and really looking for something \\~85k - which from my research is above entry level for the area but below what the local senior levels make.\n\n&amp;#x200B;\n\nI would love any advice from the locals for specific companies or places I should check out. I understand the area is pretty decent as a tech hub and I'm sure I'll be spamming indeed, glassdoor, and linkin job boards soon as well.",
      "subreddit": "cscareerquestions",
      "score": 34,
      "url": "https://reddit.com/r/cscareerquestions/comments/b2jqgj/job_hunting_as_a_mid_level_in_atlanta/",
      "comments": [
        {
          "body": "Leetcode style high paying: Opendoor, Square, Pandora, Fullstory, Kabbage, few more that I can't think of right now. If you can land one of these, I wouldn't be surprised if they're willing to pay someone with your YOE 170k+ TC easily.\n\nChill interview High Pay: Home Depot, Delta, Cisco, NCR. Easily 110k+ for these.\n\n\nAim higher I know new grads making over 85k, I'm over 100k with 1 YOE, apply everywhere. Ton of companies offering within 85-95k so if that's your goal, spamming LinkedIn/indeed boards should be enough. Good luck!\n",
          "score": 40
        },
        {
          "body": "Hey I would say aim for the 100-120 range with your level of experience. ",
          "score": 8
        }
      ]
    },
    {
      "title": "Asc. In CS, 1 Year Software Engineering Experience, job hunting for two years. Any Advice?",
      "body": "Hi everyone, I'm hoping you may be able to point me in the right direction. I've been looking for a new CS related job for 2 years now, and I've had absolutely 0 luck. I know the job market is hot garbage right now, but I would really appreciate some advice.\n\nI've got an associates in Computer Science with a concentration in Software Engineering, from SNHU. I managed to get a SE job for an insurance company, after a pretty random encounter with the head of the whole department at a home depot.\n\nThey started me JUST when covid lock downs happened. When I interviewed I said \"I don't know if I have the knowledge to be capable for this role\" and they still took me on, saying they'd train me. They never really did, so I taught myself, with some advice from some team members.\n\nThe main issue is they NEVER gave me work. I didn't get my first assignment until 4 months in, and it was to fix a button that didn't work on their site. It took me like, an hour? Then nothing again for months. I would ask for work, or to shadow people, or to be invited to team meetings, or just be involved in any way so I could LEARN and be seen, and I was always told no.\n\nEventually, management got mad at me for not doing any tasks, despite me not having any to do. It finally turned into them saying I could quit, or they would fire me. I now know I should have let them fire me, but I was younger and angry, so I quit. I thankfully had a family business that I could fall back on, and I've been doing that.\n\nI have not found another CS job since.\n\nI've applied for SE, Data Analyst, Programmer, even IT related jobs, and just nothing. I really hate working with family, and want to go back to what I went to school for, but I feel like I can't get back in without being besties with a manager or something.\n\nI can't afford to go back to school, and I don't really have much free time. I'm married, own a house, and work keeps me from home 12+ hours a day.\n\nTo keep my skills sharp and as a hobby I took up game design with Unity, but we all know how that's going lately with their changes.\n\nWhat could and should I do?\n\nWhat will help make me stand out?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/16qciz6/asc_in_cs_1_year_software_engineering_experience/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 13
        },
        {
          "body": "What field of CS have you been focused on?  Some are more lenient to non-degree holder than others.  Web development, is an easier one to get into but you will have to take very low paying positions until you get a few years of experience.\n\nWhat did you do during that time with Home Depot?  Did you study and expand your skillset?",
          "score": 3
        },
        {
          "body": "Keep in mind even getting a bachelors degree is no guarantee of a job",
          "score": 3
        },
        {
          "body": "Finish the degree.  Then start the new grad job process.  Most likely, you'll have to start from the bottom, climb the engineering ladder.  There are no shortcuts.\n\nThe past 2 years is the tech industry telling you that you need to finish the degree.",
          "score": 2
        }
      ]
    },
    {
      "title": "Asperger's: Not even jobs DESPERATE for workers want me",
      "body": "I graduated in May 2018 and I've been unemployed since then (well, self-employed, but nothing *good*).\n\nI have severe social handicaps that seem to be limiting my ability to find any job at all. I'm a 4.0 grad, but I never had any internships while in college because the on-campus job I had paid really well and I couldn't afford to leave. Plus I had some massive panic disorder problems that made it physically impossible to work a job for a while, but that's besides the point. That's points off my applications right there. I'm guessing because I had a 4.0 that people never really saw me having trouble landing a job.\n\nWell, numerous times I've made it to on-sites for professional-type jobs and unfortunately I just seem to blow it no matter what I do. I have tons of difficulty making eye contact; it's physically painful to do so. I have trouble concentrating/paying attention to what the interviewers are saying/asking. I speak in a monotone because that's just how I talk. For example, I interviewed at some laboratory who did an all-expenses paid trip for their on-site. I tried using the bullshitty HR soft-questions I studied to make it seem like I'm genuinely interested in the job, and asked one of the hiring managers towards the end of my interviews, \"How would you describe the candidate you're looking for to fill this role?\" to which she responded, \"Well, we're looking for someone who has no trouble talking to people. If you can't talk to people properly, then you're screwed!\"\n\nMy parents are fucking pissed I can't get a job, and told me I need to be working at places like McDonald's or Home Depot for a few months to get some experience before I try again in a few months. Well, I've interviewed at no-education, no-skill jobs lately in a town where businesses are desperate for employees; so much so that McDonald's here is paying $25/hr starting.\n\n.........AAAAAAAAAAAnd I'm just so socially inept that I get rejected for these jobs as well. How do I get help for something like this? I've been trying so much on my own to make a difference in my life and I can't seem to fix it. I rarely go out because I have no reason to, so I'm at home 90% of the time. Currently my income is literally from tutoring high school students in math, but I need more stable work. There are some personal projects that I've been working on, but I just never have the attention span or motivation to work on them for more than like 1-2 weeks at a time. I don't know what to do.\n\n**EDIT**: and yes, I'm applying all over the US, not just in my current city.",
      "subreddit": "cscareerquestions",
      "score": 36,
      "url": "https://reddit.com/r/cscareerquestions/comments/asglj5/aspergers_not_even_jobs_desperate_for_workers/",
      "comments": [
        {
          "body": "Have you applied to Microsoft? They have a tremendous inclusive hiring program, including [specifically for autism with their Autism Hiring Program](https://www.microsoft.com/en-us/diversity/inside-microsoft/cross-disability/hiring.aspx#coreui-heading-sp7tqqo).  I'd highly recommend that you check it out.",
          "score": 31
        },
        {
          "body": "Where the hell is McDonald's paying $25 an hour!?\n\nI do know of somewhere you could work because I have  2 coworkers like you but it isn't anything computer science related at all",
          "score": 19
        },
        {
          "body": "Hey there.  Let me preface this with my background. I currently am in HR and payroll. I have been involved in hiring personnel, but it's been years. That being said, I'd like to give you some advise from someone that has a kiddo that is high functioning, and on the spectrum. His OT person has already started vocational topics because this is really tough for people with ASD. He's 12 and it's already on the radar.  I want to acknowledge that you are in a challenging situation. But you know that, and you want to get past that. You can, that's why you are asking the questions. \n\n\n   I would recommend  real practice interviews  with people you trust to blunt and honest.  Person to person practice will help you feel more comfortable. You can read about tips and tricks, but if your awkward and ill at ease, it will come through and the interviewer will feel ill at ease. I'll bet the high school you tutor with, has someone that you can help this this. If you have a local job counsel or unemployment office they may have people that help with that, and interview practice, resumes, maybe workshops, and  placement.  \n\n   Own your awkwardness. I don't mean laying out your psych history, but acknowledge that interviews make you nervous. You seem great on paper, hence the interview. If an opening presents itself, point out that while you're not so great interviews,  you *are* a hard worker and amazing at \"fill in what value you offer to them\".   Maybe you're not super social, but that's because you're stay on task, or whatever fits.  Don't pick a good answer from \"tips site\". Really think about your,\"I may not be social, but I am \"fill in what personalized business strength you bring\". You believe and speak truth, they will hear the truth and not the made up answer you've been told they want to hear.  Phrase everything as positive and optimistic as you can. You are good at conveying information. You have proof, you take math knowledge, and turn it into information that is teachable to a student that then turns that lesson into a working application, as in test taking.  While you may not be great at chatting someone up at the water cooler, you can internalize knowledge, process it, and train others.  That is a huge value. \n\n\nLook for places to volunteer. Sometimes, this turns into a paying position.  It also gives you experience and a chance practice social skills. It also looks good on a resume. Can you volunteer at the high school you do tutoring with? Network with teachers and the admin staff.  If someone has a bad interview, but a great recommendation from an colleague, I'm more likely to give the benefit of the doubt and give that person a chance. \n\n\n\n\nOn a personal level, maybe look for an autism support group, or services.  Some places work on a sliding income scale. Some have free events.  They may be able to direct you to autism, disability friendly businesses, or volunteer opportunities.   \n   \n\n\nI wish you the best. ",
          "score": 20
        },
        {
          "body": "I'm not autistic, but I also have trouble talking to people. All we can do is practice. I had a panic attack in my very first interview. To minimize anxiety, anticipate questions, prepare responses, and practice. There are also some little tricks to reduce anxiety, such as deep breathing and meditation (I don't meditate, but I hear it helps). I used to speak nearly monotone, but I've practiced by listening to speakers I admire and copying their speaking styles. My only income is also math tutoring - that's a good time to practice talking.",
          "score": 7
        },
        {
          "body": "If you’re in the US, the Department of Labor and Employment &gt; Division of Vocational Rehabilitation might be of some help. My neighbor is dead and works for the state. His entire job is helping people with a range of issues find work (including things like paying for college/housing etc). They have access to a lot of listings and networks to help place people with specific needs. It sounds like you have an official diagnosis so you should qualify. \n\nAlso, no idea if this would help or hurt your odds, but are you disclosing your ASD in the interviews? \n\nMaybe it wouldn’t help...but part of me wonders if mentioning this up front or during the interview process would explain the awkwardness in a way that people could understand so they’d leave the interview with a better impression (this guy is not naturally great at social things but he’s trying and there’s a reason VS that guy was weird and I’m not sure why but I don’t feel great about him let’s move on). \n\n\n\n",
          "score": 4
        },
        {
          "body": "Ever thought about telecommute jobs?\n\nI have trouble working with people myself. One job I had was just over email and phone. I was able to pull myself together enough to sound normal a few minutes a day when in meetings.\n\nI think I lasted longer as an employee because of that.",
          "score": 3
        }
      ]
    },
    {
      "title": "30 Y.O. IT feeling lost in the sauce and trying to find some direction to fork my career into something more fulfilling. Looking for suggestions from other professionals in IT-forks. [LONG - My full IT Story - Venting]",
      "body": "**THREE DISCLAIMERS**\n\n1. I feel extremely embarrassed to make this post because I feel like a failure. There are environmental causes for this, so I don't want anyone else thinking that if they're in a similar position to mine; they're somehow a failure themselves. I probably need therapy.\n\n2. Just like my job; context is insanely relevant, and I have a tendency to make long-winded posts anyway, so... here's your warning.\n\n3. I'm exceedingly transparent - perhaps to a fault. If you feel like you need context on something, feel free to ask. There is hidden context to just about everything I'll be typing here, but I'm really bad at making 'consumable' posts, so I'm trying to cut the fat.\n\n**CURRENT JOB DETAILS**\n\n* **POSITION:** IT Support \"3\". Every company does the whole Tier 1, 2, and 3 thing in either rising or descending order. All I know is that \"3\" is considered the step below 'Sys Admin', so I'm going to assume I'm the highest tier.\n\n* **WAGE:**  About $67,000\n\n* **BENEFITS:** Pension, 401a (currently unable to contribute)\n\n**HISTORY**\n\n* **EDUCATION:** A+ Cert, Highschool Diploma. No degrees.\n\n* **GAP IT SUPPORT (23 Months) :** Yes. That GAP. Horrendous call center, but arguably the arbiter for my tech tenacity as we were THE tech support, so we had access to ALL tools used in that organization at an admin level - new and old. No bureaucracy stopping us from getting shit done. I'd argue that my time at GAP has given me 90% of the knowledge I actively use, with my A+ cert making up the remaining 10%.\n\n* **HOSPITAL IT SUPPORT (3yr/5mo):** Current job. Considered critical hospital support. We're basically the traffic cops for issues, but we solve most issues Tier 2 and below. Think standard IT, but with functional knowledge in health related technology to support our nurses and doctors and stuff. Pretty corporate. Bureaucracy prevents us from meaningfully implementing fixes that we, at ground zero, face every day. We generally just scream into the Ether that our 'superiors' inhabit, and hope things get done.\n\n~=======================================================================~\n\nThe above serves as a TL;DR. Scroll down to \"THE PLATEAU\" to read why you clicked on this post.\n\n~=======================================================================~\n\n**THE BACKDROP**\n\n~========~\n\nI've been working in IT positions for a little over 5 years, but I've functionally been an IT for about 8-10. Started with gaming about 15 years ago, then into making my own computers, and then becoming the family IT. Same shit. You've heard this story a thousand times, I'm sure.\n\nI mainly got into IT because, growing up in a household with an (/r/LivingWithNarcissists) unemployed Mom, I kinda gave up on my content creation dreams of the early 06' and 08' era outside of gaming to develop skills in IT to have a career.\n\nI hate IT with a passion, but I've often been told that I hate IT through the lens through customer support, and that's probably true. However, I still cringe at my own personal IT issues or even cracking open my own computer anymore to tinker with stuff. IT as a career has infected my personal love of computers that much.\n\n**THE DEVELOPMENT**\n\n~===========~\n\nAs a fresh A+ certificate holder, I thought I was hot shit working at Office Depot in the tech department selling people shitty protection plans that would probably rob them of their children if they didn't read it closely enough. I didn't care. I had my stupid little badge and ID I'd flash to people so they knew I knew my shit. It was cringe AF, but I'll own that.\n\nIt wasn't until I got into GAP 2 years later that I learned what real IT was about. I learned all of my hard skills and a majority of my soft skills in this environment, but I had always been empathetic to the end-user experience due to my many years serving all three corners of customer service triangle - food service, retail, and now tech support.\n\nGAP was unique because our IT desk was it. We supported the entire world's brand: GAP, Banana Republic, Athleta, etc. Being the end-all-be-all for troubleshooting, we had Admin access to all of our tools. Things like the Meraki Switch dashboard, DUO MFA, etc. As bad as this place was, this access spoiled me. Nothing was out of reach. If I saw a solution that could be implemented for a repeat problem, I could scoot over 10 feet to my left to my supervisor, tell her my idea, she'd go in the hardware/software room to test it, the documentation would be updated, and the fix published in a matter of hours.\n\nI didn't care for the management outside of a select few, but I loved just about every co-worker there, even the ones I hated. Kek. The place was full of creative and extremely talented and aspiring people. One guy would literally paint 40K figurines on his desk during break, I was sat across from a rap music producer, one guy was printing labels for and packing shipments for his garage-saling side-hustle, one guy's desk was filled with Charmander things, and one guy had a collection of his twice-daily Monster cans that he'd stack up.\n\nThe introduction to the environment was difficult, and the environment itself never improved (insane turnover rate, back-to-back calls for 15 hours out of the day, etc) during my stay. This place damn near drove one of my friends there to an early grave before he got out and moved on. WITH THAT SAID, I comfortably and casually became one of the best problem solvers there, and I took a lot of pride in developing an image I didn't think I was cut out for.\n\nI arguably took the fewest calls out of anyone in that entire desk, I routinely ran my after-call-ticketing timer into 10+ minutes before jumping back into queue, and I was very lazy when it came to brain-death inducing repetitive calls like password resets. However, I was an absolute bloodhound for issues and would go the umpteenth mile for a customer.\n\nMyself and my little group of over-achievers at that desk ended up developing private chat language for what we referred to as autistic tendencies: 'Pattern Recognition'. Me and this group of about 5 other high performers (out of a help desk of 80+ people) were THE cracksquad when a big issue would come up. Supervisor would roll over to me, or call 2 or 3 of us out of our group over to their desk, lay down the details, and we'd get to work.\n\nWith fully weaponized autism, I'd watch for patterns, sniff out the issue, and work with these guys to develop a fix, or atleast discover the root problem that would need to be addressed by our equally-sized cracksquad of engineers in the cubicle section adjacent to us. This. Felt. Amazing. We were 100% the shit, and we all knew it.\n\nOver the 2 years we were all there, not a single one of us ever received a legitimate DESAT survey (after QA analysis) or were ever 'talked to' by management about anything - performance or otherwise. I very much took advantage of this in my developed skillset. I still had the lowest call count. I was still lazy. I was still slow. However, I was consistent, thorough, and aggressively accountable in that I could often be quoted saying that 'I sign my work in blood'. It felt good when one of my supes would come over to me because they knew I'd have good notes on an issue, or that I'd chase an issue to it's bloody end.\n\nTo be clear, the above never had anything to do with recognition, but finally feeling like my work meant something, unlike my jobs before. This job at GAP, for the first time, felt like all my empathy that I had for the end-user experience was finally being used. I still hated the job. It's probably the worst place I've ever worked, but about a year after leaving it, I don't regret it, and I'm very much appreciative of the valuable experience I gained there.\n\nTo end this section: once COVID hit, we were progressively moved to WFH. The week I got sent home to prepare my WFH setup with a company laptop and everything, the company announced furlough, and I had to move on because I didn't have any idea when it would come back. This was my first time in my, at that point, 8 years of work history that I ever had more than 3 days off in a single stint. For 2 weeks, I looked for jobs and fortunately landed my next (and current) position.\n\n**THE CLIMB**\n\n~======~\n\nMy arrival to this organization still remains an enigma in my head, even 3 years and 5 months later, for a number of reasons. I was hired on a whim. While the organization was struggling as it was a Health organization adapting to the COVID crisis, I expected more roadblocks onboarding. My interview lasted LITERALLY... 3 minutes, and not because the interviewer ran out of questions, but because he had an important call interrupt the interview. The two questions that I was asked, and apparently the two questions that got me the job, were:\n\n1. \"Do you know what Active Directory is?\"\n2. \"Your resume states you had experience using the ServiceNow ticketing platform at your previous job. Is that true?\"\n\nAside from 30 seconds of 'Hows The Weather'; that was it. A few days after this interrupted interview, I was onboarded and set loose. This was the first time I had dabbled with the thought and realization that my CompTIA A+ cert didn't mean jack, but work experience did. It was bitter sweet, but I was down to clown. Aside from the standard growing pains of new proprietary technologies and processes to learn, it didn't take long for me to get into the swing of things... It also didn't take long to come to the realization that this post is all about.\n\nOne of the first things I realized getting into this organization is that there is a more stringent COC. As a result, I wasn't able to solve issues like I used to be able to. My diligence and bloodhound nature still applied in my calls - the very few I get that are challenging, anyway - but I'm often left holding the fruits of my labor in my hand and throwing them into the garbage. My bosses are incredible people, but their corporate overlords run it all and are, for all intents and purposes, unicorns.\n\nThis job is rarely challenging, but in a different way from GAP. GAP was challenging because the hardware and software implementation was an abomination, and we were all LARP'ing as Dr. Frankenstein to make things work. The only 'challenge' I get in my current job is probably the worst and most embarrassing kind: not having any information on the issue the user is having, having to admit that on the call and sound like an idiot, and then escalate it to the team that handles it. We use over 400 technologies across our entire organization so we realistically can't know everything about them, but we're still the first call people make, so I take it personally (even though I know I shouldn't) when I can't help someone.\n\nOverall, I reached what everyone in Tech Support kinda knows as the 'Fuck It' point about 2 years into the job, and having been coasting since. I was brought on fulltime in October of 2022 and passed probe in April of this year. This is my first ever fulltime position. This has brought a lot of relief because I now have a pension, healthcare I'm paying for, and I'm even unioned! However...\n\n**THE PLATEAU**\n\n~=======~\n\nI don't feel comfortable at all, and I'm scared.  For a variety of reasons, I feel trapped in my career.\n\nI haven't enjoyed IT for a number of years. Like I previously mentioned, there's likely merit to me having only experienced the customer service side of IT, but its deep enough to even be affecting my own love of IT in my life outside of my career.\n\nSo, what started all of this? Why am I feeling the burn now if I haven't enjoyed IT for a while?\n\nI've recently gotten into personal finances. I've always been good with numbers - great, in fact - but never knew a way to effectively apply it. Well, I do now, and its led me to a realization that I'm not as well off as I thought I was. I'll try not to wax on about 'Millennial Struggles', but I was basically always told that the kind of position I'm in now is where I should have aspired to reached by 30. Well, here I am. I'm 30, making $67,000 a year, have VERY manageable debt, budget like a madman, but still have almost nothing to live on and save/invest with because of my living situation here in California.\n\n**FINANCE BLURB:** &gt;!I will happily have a private conversation with anyone here about finances as not to detract from the point of the post, so in the meantime: please take my word for it when I say I have pretty damned responsible finances. My circumstances just suck. Here's a tidbit: I recently did the math: 95-fucking-% of my post-tax income goes towards my needs. Removing my car payment (the only debt that I have) and the $150 I give myself a month as play money/soft-needs (like a haircut), it still comes out to 79% of my post-tax income towards needs. I'm currently looking to sell the car, and find a place with a roommate to give me some wiggle room, however I've even projected those numbers. Based on market rates for places around me, were I to split rent with a roommate and not have a car payment like I do now, my needs still take up 60% of my post tax income. Wage is the only other thing I can reasonably increase right now. !&lt;\n\nIn essence, I'm looking to fork away from tech support specifically to find something more fulfilling, and to make more money. There's a good chance I'll never like IT as a whole again, but I do kinda understand what people in the past have told me that customer service IT is kind of the worst of it. In saying that, I'm okay with staying in the IT field if it means I can have professional fulfilment later down the line.\n\nAs I've recently discovered my love for finances, I was wondering if anyone had any input about any kind of tech I could do with a financial organization or fintech. I'm not solely focused on that, but it was just a thought. Whatever the case; a frustrating part about my experience is that not a lot of it is tangible unless I were to have my current boss write a thesis-grade letter of recommendation for me. Some of what I believe to be my most marketable qualities are as follows:\n\n* I like fixing problems. Not just fixing other people's problems, but fixing real problems. I have a knack for seeking out patterns, developing theories, and tackling them to their end.\n* I, surprisingly, enjoy and am very good at teaching or showing someone the ropes of something. More often than not, a lot of the IT world is alphabet soup and knowing how to bump the jukebox is a certain way, so to speak. I've received countless SAT surveys that I'm exceptionally good at helping people understand complex things. When I was at GAP, I often begged to show the new ITs on the floor the ropes and get used to processes.\n* I have an uncanny ability to understand fundamental concepts of just about anything without having any training. This has made me very flexible in terms of focus. For example, I don't really know squat about managing a server (like Azure), but I have countless encounters where I've talked shop with our server team when I brought server related issues to them, and through non-trained verbiage, I was able to communicate fixes for some issues. Coding is another example. I don't know how to code. Couldn't tell you how to write a single line, but I fully understand when someone is referencing if/ands, calls, and other similar coding technology.\n* In my bosses own words, I have very strong 'corporate chops' (I'd like to think that's good). I exhume great leadership (I even went to a leadership camp at Stanford when I was younger), I write VERY well (he has commended me about my e-mail write-ups to multiple bigwigs), and I have very good understanding of human connection (in terms of gentle management).\n\nI don't know. Whenever I look up IT jobs in the upper echelon, it's always the same things: Programmer or Engineer or the like. Those careers absolutely deserve the accolades they receive, they're just not within my scope. Were I to put it into words, I feel like I belong in some kind of advisory role, or a kind of... bridge to help people solve the bigger problems they have. More micro, less macro. More narrow, less broad. More Visio, less Powerpoint.\n\nLook, even writing all this stuff out feels really circle-jerky. Like I said at the beginning, I'm embarrassed to talk about this at all because I feel like I should know at this point, but I don't when others seem to. For the first time in my professional career, I'm trying really hard to hear the things other people are telling me and take better care of myself. I just don't know what that looks like. I've pigeon-holed myself into the role that I am, and it feels inescapable. I don't like the thought of having reached the wage capstone of Tech Support. I thought I would been onto something else and figured it out by now. I'm floundering. At the same time, it's paralyzing to think about changing lanes after I've just now reached a career milestone of a fulltime job, and I'd likely be throwing myself back into the contracting world if I were to make a change now.\n\nPlease help. Any and all advice is helpful. Criticism even.\n\nYoung. Old. Don't care. I'm ready to listen.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/152mse2/30_yo_it_feeling_lost_in_the_sauce_and_trying_to/",
      "comments": [
        {
          "body": "A recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface .\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n&amp;#x200B;\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of r/reddit.com, who are the admins of the site: message [/u/reddit](https://www.reddit.com/u/reddit/): submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on [r/reddit](https://www.reddit.com/r/reddit/), such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at [r/ModCoord](https://www.reddit.com/r/ModCoord/) \\- but please don't pester mods you *don't* know by simply spamming their modmail.\n3. **Boycott** ***and*** **spread the word...to Reddit's competition!** Stay off Reddit as much as you can, instead, take to your favorite *non*\\-Reddit platform of choice and make some noise in support! \n\nhttps://discord.gg/cscareerhub\n\nhttps://programming.dev\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "\"I like fixing problems. Not just fixing other people's problems, but fixing real problems. I have a knack for seeking out patterns, developing theories, and tackling them to their end.\"\n\n\"I have an uncanny ability to understand fundamental concepts of just about anything without having any training. This has made me very flexible in terms of focus. For example, I don't really know squat about managing a server (like Azure), but I have countless encounters where I've talked shop with our server team when I brought server related issues to them, and through non-trained verbiage, I was able to communicate fixes for some issues. Coding is another example. I don't know how to code. Couldn't tell you how to write a single line, but I fully understand when someone is referencing if/ands, calls, and other similar coding technology.\"\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI am focusing on those two parts.\n\n&amp;#x200B;\n\nHave you thought of doing QA (Quality Assurance) - its similar to support - it sounds like you have worked with developers and server admins before. It can be good money, its generally an enjoyable role, and can use your current skills.",
          "score": 3
        },
        {
          "body": "You should ask in /r/ITCareerQuestions",
          "score": 2
        },
        {
          "body": "I switched to financial planning a couple years ago and haven’t been happier. Flexibility. Remote work. No quotas or capped growth. And we are hiring if you are open to discussing",
          "score": 1
        },
        {
          "body": "damn that was a long novel.  I didn't read it all, but why don't you look into customer facing cloud related IT roles\n\n&amp;#x200B;\n\nSolutions Engineer or Solutions Architect type jobs can pay well into the six figures.  Being personable and working with people is a big part, but so is being a problem solver and understanding complexity and explaining it.    \n\n\nI can't say how to best navigate that path since it's different than my own, but I do know people who are happy and successful in that career, and I believe there are good stepping stones to those types of jobs from IT and support jobs.",
          "score": 1
        },
        {
          "body": "Go to night classes and upgrade your skills while maintaining full time employment, work towards a college degree. It will take a few years to pay off but you wont be stuck with a glass ceiling. \n\nIt sounds like youre a bright guy, dont limit your potential through laziness. Aside from yesterday, the best time to start is today.",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Please advise the direction I should continue to move forward to land first WebDev job!",
      "body": "Hello,\n\ntldr at the bottom, but links just below here,\n\nI live in the USA and am looking to land a webdev job remote with no college nor prior experience. I understand it's an uphill battle, I've been at it for a good while now. My preferred stack that my projects are largely based around is React frontend, Python/FastAPI backend served with NGINX, using AWS EC2 instances for hosting, and Let'sencrypt for ssl certification.\n\nCurrently, I have completed a few portfolio projects.\n\n[Popularnews.org](https://Popularnews.org)  demonstrating full-stack and user authentication, AWS / nginx hosting.\n\n[SimCompaniesCalculator.com](https://SimCompaniesCalculator.com)  demonstrates full-stack again with no authentication, has real world value helping players determine the most profitable decision to make based on their gamestate.\n\n[LoganPederson.dev](https://LoganPederson.dev) Portfolio site showcasing the above projects and another smaller project.\n\n[github.com/LoganPederson](https://github.com/LoganPederson)  My github\n\nI have done a good bit of leetcode, mainly in python following the Blind75 however I did not complete it, I completed the first section before getting tied up in projects. I plan to continue this, however have not yet gotten a single interview request in many hundreds of applications between now and last September roughly. I have not applied completely consistently, often doing a hundred or so and then taking a break to work on another project, most recently completing the portfolio site. I've begun doing some low hanging fruits like tiktaktoe -&gt; [https://loganpederson.github.io/TikTakToe/](https://loganpederson.github.io/TikTakToe/) and a todo [https://loganpederson.github.io/todo/](https://loganpederson.github.io/todo/) both made in roughly 1 day just to see if I could do it, I kind of avoided them as everyone does those but then recently wanted to find out if I could slap it together with minimal help, and did so decent enough I think.\n\n**My question is** what do you suggest I spend my time on moving forward to most effectively increase my chance of getting an interview and eventually hired? I apply through linkedIn and Indeed mostly but also on company websites too. I don't followup with the places I apply as I apply to so many and many big names like HomeDepot don't have a clear way to contact the people who could make a difference that I've found. Should I hammer leetcode for interview prep? Redo my projects now that I have more experience? I know my perhaps biggest weakness is ui/ux design, my websites look pretty ugly. I think that is improving with repetition and practice but it's painful for me lol. Any advise appreciated!!\n\n**tldr:** I have a portfolio site, projects, github, and leetcode experience. What do you suggest I do to increase my odds of getting hired and called back when applying with no degree nor professional experience? More projects? Better projects? Refactor existing projects? Apply more often (around 500 sent so far between now and last september)? Thanks for taking the time",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/13l85xj/please_advise_the_direction_i_should_continue_to/",
      "comments": [
        {
          "body": "Getting an interview as a self taught is all just luck. You could be the best developer in the world and it would still come down to luck. I got lucky.\n\nIf I could do it again I would try to network and meet people IRL, wasn't really feasible with lockdowns though. I would also build projects that people **will actually use**.\n\nYour projects look basic and ugly to be blunt. Make real software people will use daily. Find some niche online community or something and create something of use. There are tons of opportunities out there.\n\nYou can also contribute to open source projects. Don't be a drive by contributor. Find software you care about and work on it for months.",
          "score": 1
        },
        {
          "body": "Not having seen your resume, I suspect that your resume is simply not matching by being too specific and perhaps too much of a buffet.\n\nHiring managers are often just looking to fill easily defined jobs, e.g. Java backend engineer, and then look for resumes that clearly match, e.g.  “I am a Java backend engineer”.  If your resume has a lot of skills and a lot of portfolio projects using a variety of skills, they have to study your resume rather than simply saying, “Yes, this resume is a Java backend engineer.”  They might find Java on your resume several times but they’ll still be uncertain if the resume is crowded with other technologies and odd portfolio projects that aren’t clearly Java backend engineer projects.\n\nSo, try to look at your resume with a critical eye from the hiring manager’s perspective.  Are you easily matched to simple jobs?  Can you make your resume simpler so the resume reader can decide that you are a match faster and easier?",
          "score": 1
        },
        {
          "body": "Not having seen your resume, I suspect that your resume is simply not matching by being too specific and perhaps too much of a buffet.\n\nHiring managers are often just looking to fill easily defined jobs, e.g. Java backend engineer, and then look for resumes that clearly match, e.g.  “I am a Java backend engineer”.  If your resume has a lot of skills and a lot of portfolio projects using a variety of skills, they have to study your resume rather than simply saying, “Yes, this resume is a Java backend engineer.”  They might find Java on your resume several times but they’ll still be uncertain if the resume is crowded with other technologies and odd portfolio projects that aren’t clearly Java backend engineer projects.\n\nSo, try to look at your resume with a critical eye from the hiring manager’s perspective.  Are you easily matched to simple jobs?  Can you make your resume simpler so the resume reader can decide that you are a match faster and easier?",
          "score": 1
        }
      ]
    },
    {
      "title": "Advice: How I Became a Software Developer",
      "body": "Around four years ago I quit my well-paying job as a data analyst to begin my career as a software developer. I've shared a lot of advice with junior developers and college students about navigating through the industry and finally decided to condense the information into one post (and [video](https://youtu.be/u6Egm0bIP7k)).\n\nFirst, some background about me:\n\n* BS in Management Information Systems, University of Alabama\n* First job out of college was **not** in tech\n* No previous experience in software development\n\nConsidering my background - I don't have a CS degree from a university like Georgia Tech, Stanford, etc. - I thought my perspective on getting into the industry would be valuable to those who are in the process of breaking into the industry. I'll be as transparent as possible and I'm open to any further clarifying questions.\n\n**Foot in the door**\n\nI admittedly had an easy entrance into the industry although it didn't last for long. When I was in college doing internship interviews, I had one interview at The Home Depot as a software developer intern which I ended up turning down. It wasn't until about two years later after my senior year of college and a year into my first job out of college that I decided I wanted to do software development.\n\nThankfully I was on good terms with the people who interviewed me at the time. I reached out to them on LinkedIn and asked if they were still interested. They were receptive, flew me in for an interview, and not long after I accepted an offer switching industries less than a year into my first job post-college.\n\nIt didn't take long for me to realize I hated it there. A lot. After just a few months I walked in one day and told my manager I quit. I'll admit, I was a bit cocky at the time thinking my degree and my resume with one job of a few months at this company would be an easy ticket into my next job. Given the labor market, I expected to be unemployed for 2-3 weeks at most. Wrong. I spent the next **three months** unemployed.\n\n**Lesson: It's easier to find a job when you're already employed and this is even more true earlier on in your career. After your first job out of college, your degree loses a lot of its value. Think of it like a new car the second you drive it off the lot.**\n\n**Learning how to sell**\n\nAfter three months of unemployment, I was starting to freak out. Life was stressful as hell at the time and I was starting to get desperate. I got turned down for a few jobs I knew I could do so something had to change.\n\nI had an interview at Autotrader as a UI developer. My technical interview wasn't going as well as I wanted it to and not long into the interview, they decided to wrap it up early. At least I think they did. They had five sheets of questions and we barely got through two.\n\nIn a move of desperation, I went into full selling mode. I said, \"Look, I realize I don't know everything right now but you're not going to find someone as hardworking as me. Call any of my references, call past employers, call teachers from high school and college who worked closely with me and tell them you're in a room with me and you're not sure whether or not to hire me. I *guarantee* you, they will tell you not to let me out of the room without signing. They'll tell you I'm someone who works their ass off and gets results.\" I was as honest as I could possibly be with them. They listened, didn't say much afterwards, and we wrapped up the interview as usual.\n\nA few hours later, I got a call saying I got the job offer.\n\n**Lesson: Selling yourself in interviews is uncomfortable as hell but you have to get used to it if you want results.**\n\n**Knowing your worth**\n\nA few jobs later I was working at a digital agency that hired me on to do AngularJS work. They sold the job as very laid back, low stress, with a sole focus on AngularJS work - exactly what I was looking for at the time.\n\nMy first day on the job they tell me I have a meeting that night from 7-9pm. This continued week after week and not longer after I was working 70-80 hour weeks. I was the sole UI developer at this company responsible for delivering multiple projects to big name clients. They had no other resource at the time to fill this need other than me.\n\nFed up with this lie during my interview process, I showed up to work one day and called the recruiter who coordinated the role. I said, \"I want a raise of $X by the end of the day today or I'm walking.\" After some questioning to ensure I wasn't joking and that I was serious about leaving that day if I didn't get my raise, she scrambled to make some phone calls.\n\nA few hours later, it was confirmed I got my raise.\n\n**Lesson: Know your worth and stand up for yourself. If you've been lied to, do something about it with whatever leverage you have.**\n\n**Analyze employment from the employer's POV**\n\nWhile I was at this digital agency, I was contacted about a job opportunity with a dev shop who had an immediate need for someone with my skillset to be the team lead for a big project they were working on.\n\nI went in for an interview which was straightforward and more conversational than anything. During the interview they continued to address that they wanted me to lead the team and they'd need an answer very soon because of how quickly they needed to fill the position. A meeting was days away and the project was huge for them.\n\nI quickly realized my negotiating power in the relationship:\n\n* Urgent need with a meeting days away\n* They wanted me to lead the team meaning my skills were better than the existing team\n* The magnitude of the project - both from their POV and the client's\n\nLater that day when the recruiter called me to discuss money, I decided to shoot high. *Really high*. Like, double my current income high. I told him my price and immediately he told me it was impossible. For a nice round number let's say I asked for $20/hr to double what I was currently making: $10/hr. He responded saying $10/hr was the most they could do. I thanked him for his time and said I wasn't interested at that price and I had work to do.\n\nA while later, he calls back saying they can do $12/hr. I reply that my target is $20 and I'm not budging. He continues to tell me $20 is completely unrealistic, well above what anyone is making in town and that I need to meet in the middle. I decline again.\n\nHe calls again saying he can do $15/hr. Again, I tell him it's short of my target.\n\nHe calls a third time saying $18/hr but that's the most they can do and at this point they're losing money. I decline again. This is easily the most negotiating I've ever done and it was *extremely* uncomfortable.\n\nAt this point I figure they've moved on. 10 minutes later I get another call saying they'll do $20/hr, meeting me at my initial price which meant that in **one day I doubled my income**.\n\n**Lesson: Negotiation is tough and there's a reason people don't like to do it. Learn to live with that discomfort or accept that you'll never get paid what you believe you're worth.**\n\n***\n\nI realize this post was long but I've vlogged the [story of my career on YouTube](https://youtu.be/u6Egm0bIP7k) in even greater detail (literally walking you through my LinkedIn profile including some job transitions I didn't cover here) also sharing some coding resources I used along the way. I've had positive feedback so far and thought some highlights might be worth sharing here.\n\nAgain, if you have any additional questions feel free to ask me here or through PM.",
      "subreddit": "cscareerquestions",
      "score": 55,
      "url": "https://reddit.com/r/cscareerquestions/comments/7i1l7t/advice_how_i_became_a_software_developer/",
      "comments": [
        {
          "body": "From your video, your LinkedIn shows something like: 3 months, 5 months, 3 months, 6 months, 6 months, 5 months, 3 months, etc. If I saw your resume, then I'd classify you as an *extreme* job-hopper. Personally, whenever I get a new job, it takes me months to even on-board and become productive. If I were looking at your resume, then I'd instantly think that you wouldn't have even finished on-boarding yet before looking for a new job.\n\nHow do you answer the question, \"Why have you changed jobs so many times?\"",
          "score": 32
        },
        {
          "body": "Awesome read. As someone looking to enter this industry and the job search in general soon, I feel like I've learned something valuable. Thank you!",
          "score": 6
        },
        {
          "body": "How did you get the first offer from Home Depot as a SWE intern without knowing anything about software engineering?",
          "score": 3
        },
        {
          "body": "Great stuff! As someone who spent months looking for a job feeling like \"I'll take anything\" out of desperation, I'm finally getting to the stage of multiple offers so the negotiating part is a great tip! Hats off to you for the last part of not budging, balls of steel my man. ",
          "score": 3
        },
        {
          "body": "I know you said $20/hr and $10/hr as examples, but it was probably double or triple that right?",
          "score": 3
        },
        {
          "body": "I'll check your videos out but holy shit this is amazing. Nice work dude",
          "score": 2
        },
        {
          "body": "Thanks for sharing! It's always so interesting to hear about how people made it from place to place like you describe.\n\nI know the hourly rates you use are dummy numbers, but are the salaries actually set at hourly rates? (As opposed to annual). If yes, does that imply actually getting paid different amounts if you work 50 hours one week and 70 hours the next?",
          "score": 2
        },
        {
          "body": "Awesome video!\n\nOn a side note, nice pile of cash you got there on your screen :)",
          "score": 2
        }
      ]
    },
    {
      "title": "Software engineering internship at Home Depot?",
      "body": "I was just offered an interview today for a software engineering internship at Home Depot (Atlanta). Has anyone worked for Home Depot before? How was your experience? What is the housing situation like in Atlanta?",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/7b8v09/software_engineering_internship_at_home_depot/",
      "comments": [
        {
          "body": "you can rent my room in ATL; heard Home Depot has surprisingly good stack/tech practices",
          "score": 5
        },
        {
          "body": "Home Depot is surprisingly technical for retail - they've been making a major push towards modern cloud based tools so it's a valuable experience, it's not \"code a retail site with PHP\".",
          "score": 5
        },
        {
          "body": "A friend of mine did a HD internship and now works there full time, and he seems to enjoy it, and it appears they've actually been putting in a lot of work to build a strong tech org and pay reasonably well. I think he said they also optionally provide housing, which is good because you definitely don't want to be stuck in Atlanta traffic trying to commute.\n\nUnfortunately I don't have much insight on the interview process, other than the fact that the first is a behavioral interview ",
          "score": 5
        },
        {
          "body": "I interned there this past summer. Very good tech practices for a retail company. You'll learn a lot! I would try to find another intern to sublease nearby, it's a pain to drive from downtown to Smyrna. ",
          "score": 3
        },
        {
          "body": "can you share what date you applied? I applied to HP and they ghosted me.. Not sure if they haven't started the process yet or if they rejected me",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 2
        }
      ]
    },
    {
      "title": "Can you get an internship as a freshman in college: A Guide",
      "body": "**Introduction:**  \n\nHi, I’m Locke. I’ve seen this question posted ~20 times, including once by myself, to /r/cscareerquestions over the last 6 months or so. As I have just gone through the entire process, I’m here to guide you along the way and answer questions about your wonderful exciting summer of sitting inside for 40 hours a week.  \n\n**The answer (If you just want to know):**  \n\nPossibly, but probably not. In a nut shell, this is just the truth of the matter. Read the actual guide if you want to know why.  \n\n**The Story (My journey towards a summer internship):**  \nIf you don’t actually want to read about me, I’ll try to parse out the relevant bits into a summary at the bottom, but I find this kind of thing much easier to explain in context.  \n\nI am a freshman at the University of Georgia, which unless you follow SEC football, you’ve probably never heard of. It’s a large research University located in Athens, GA. Our primary research is in binge drinking, but we’re also known for our biology and medical research, and occasionally something fun in our very small CS department (~200 students). I’m in the Honors program, pursuing a Bachelor’s\\Master’s crossover, to get both degrees in four years. (Hooray for 37 hours of AP credit!)  \n\n I started my search early, in early October, looking everywhere I possibly could for internships. I crawled through all of my favorite big tech companies (Microsoft, Google, Apple, etc. etc.) and found a few promising gems. First, is the [Google Freshman Engineering Practicum]( http://www.google.com/jobs/engpracticum/fep/), which is exactly what it sounds like. A 10 week internship out in Mountain View, CA. Next was  the [Explore Microsoft](http://careers.microsoft.com/careers/en/us/internships-explore-microsoft.aspx) program, which similarly was a 12 week internship in Redmond, WA. Well now I was all excited, between these two tech giants, and the fact that I’m very smart, there’s gotta be something cool there right? Well, we’ll see.  \n\nFrom there, I looked for whatever resources I could. I leaned on my parents, aunts, and uncles to possibly find me internships at their companies, or with the companies of friends. I sat down and crawled through hundreds of job postings on sites like [Dice](http://www.dice.com) and [Monster](http://www.monster.com) looking for internship postings in my area. Don’t look outside your area, unless they’re a big tech company (See above), they won’t pay for you to relocate for the summer.  \n\nI found some decent success through these sites, and sent out [resumes](https://www.dropbox.com/s/l2n3kbjbicxabe2/collin_watts_resume.pdf?dl=0) to everyone. Note, the translation to a .jpg in that got a little weird. Please give employers your resume in pdf format. Also, complete props to a post a few months ago that I shamelessly stole this resume format from.  \n\nFrom there, I turned to my last two avenues of discovery. These are the ones that I’m going to have the least to tell you about, as they’re specific to your university. Your University’s career fair, and your University’s job website. I checked my career fair, and looked for CS companies. Well, we don’t have any. Shit. What about large companies that have big IT departments? Well, there are a fair number of those. So I got in my suit (You MUST wear a suit to a career fair) and went and talked to one or two of them.  \n\nAnd finally, my University’s job site.  This was a gold mine for me. You could narrow it down to major, type of job (Internship versus full time) and then just mass email resumes.  \n\nSo first thing, fellow programmer, to do is to do everything I just listed above. This will take you a while. And then once you do it, you’ll have to do it again. As a general rule, I checked the University job site once every few days, from October until now. That’s important, because new jobs get submitted as time goes on. I had personally thought the recruiting process started in the fall, but from what I’ve seen it actually picks up in the spring.  \n\nOh! I just remembered. Here’s something unscrupulous I’ve done. If around where you live has a big tech school that you don’t go to, piggy back on their recruiting process. It’s probably open to anyone online. For example, I used Georgia Tech’s website to look as well as my own.  \n\nOkay, so. After I did all that, I had the following list of companies that I had submitted some kind of literature to:  \n\n- Google  \n- Microsoft  \n- IBM  \n- AT&amp;T  \n- HP  \n- Chick-Fil-A  \n- Home Depot  \n- Lockheed Martin  \n- ThyssenKrupp IT Services, North America  \n- Verizon Wireless  \n- McKesson Provider Technologies  \n- ADP (Automatic Data Processing)  \n- Sybase  \n- Windham Brannon  \n- Macy’s  \n- MedAssets  \n\nDon’t be surprised if you don’t recognize every name on the list, I submitted a resume to literally every company within driving distance of my house. Here’s the response I got back from them all.  \n\n- Google: No  \n- Microsoft: No  \n- IBM: No  \n- AT&amp;T: Originally no, and then I got a call from a random HR manager in March  \n- *HP: Phone interview*  \n- Chick-Fil-A: No  \n- *Home Depot: Phone interview*  \n- Lockheed Martin: No  \n- *ThyssenKrupp IT Services: Phone interview, in person interview*  \n- Verizon Wireless: No  \n- McKesson: No  \n- ADP: No  \n- *Sybase: Phone interview*  \n- Windham Brannon: No  \n- Macy’s: No  \n- *MedAssets: Phone interview, in person interview*  \n\nSo, yeah. Lesson here is learn to accept rejection, you’ll get it a lot. Of the companies who responded to me (Which was only about half of the “no”s, the rest didn’t even bother), most said that they weren’t interested in a freshman intern. Doesn’t matter my skill set or programming ability, they simply aren’t interested.  \n\nThe reason the companies gave me for this is that most companies use their internships as recruitment programs. Nobody is thinking four years down the road as far as hiring new recruits. They want new developers after the summer you work for them. This fucking sucks, but is the truth of the matter.  \n\nNow, as for the interview process itself. I won’t say I’m an expert on interviews. But I did go through 6 interviews of one sort or another for an internship, so I’ll fill you in on my experiences.  \n\nAs a general note of things that were covered in every interview so I don’t repeat myself:  \n\n*General questions:*  \n\n- Tell me about yourself. – This question sucks. I’m sorry, it just does. I would generally respond “That’s a rather broad question, do you mean academically, programmatically, personally…? I’m not really sure what you’re looking for.” Until I realized that they always meant programmatically. Tell them about your programming background. Mine went something like this:  \n\n“Okay, I’m a 1st year at UGA in the Honors program, doing an accelerated Bachelor’s Master’s program to get both degrees in four years. I began programming when I was 12 doing basic scripting stuff relating to IRC chat rooms (Editor’s Note: Yes, I know that the C stands for “chat”. They generally don’t.), and then from there branched out into basic JavaScript and began being interested in computer security. From there beginning just before high school I branched out into Java and C++ to learn more object oriented programming, and began working on larger projects. Since then I’ve been working on becoming familiar with Python, C#, and Ruby.\"  \n \nInvariably, this leads to the next question which I know all of you don’t like:  \n\n- Tell me about a project you’ve worked on in the past that you were particularly excited about doing.  \n\nI’ll be honest right here. I have past projects to draw on. If you don’t, make it up. That is probably unethical, but if you can talk about a project like you have worked on it, even if it never got out of the design stages, it still shows the level of interest they’re looking for.  \n\nAnyway, my answer would either be “Oh well I’m excited about the Android app I’m working on right now” or “Well I made this bot to sit in chat rooms in middle school that ended up being by number of lines by far my biggest project” and then I would elaborate.  \n\nThis is an important question. Not only will they gauge your programming ability by the depth of the project you worked on, but they’ll gauge your interest in programming in general and the work they do. If you can figure out what they do ahead of time and tailor your story to make it seem like you really like their work, all the better.  \n\nTechnical Questions:  \n\n- The definition of inheritance - Every, single, interview. Both phone and in person. I found this easiest to elaborate by saying the definition, and then giving an example.  \n- The definition of polymorphism – See above  \n- Some keyword question (For HP it was C#’s “protected”, for MedAssets it was C++'s “struct”, etc). Know your terminology.   \n- Some kind of database question (How do you sanitize SQL inputs, what are the advantages\\disadvantages of using this kind of database, etc.)  \n- Some kind of data structure question. Not the same as above. This would be like, tell me why you would use an array over a linked list, and vica versa.   \n\nIn interviews in general, you need to be relaxed. I know this can be hard, especially if you’ve never interviewed before. My general advice here would be to talk to other people about programming. Talk to people who know more than you. Talk to a professor, a grad student, a senior who's about to work at Google or whatever. Find someone, and just talk to them about code. The interview will more or less be no different.  \n\nSurprisingly, in all of the interviews I only got asked a few actual programming questions where I had to write code. They didn’t want syntax perfect, but they wanted it to be more refined than pseudo code. I know everyone hates this, but I have to do it for tests too. It’s best to just memorize your basic syntax. The questions I had to do by hand were the following:  \n\n- Here is a 12X12 multiplication table. Write a program to output this table.  \n- Modify the program above to work with any size table.  \n- Modify the problem above so that if the number is divisible by three, output “fizz” instead of the number, and if the number is divisible by five, output “buzz”. (This is the classic fizzbuzz problem).  \n- Write a program to take in a string and reverse it.  \n- Let’s say I have an arbitrarily large linked list. What would you do to check if someone had looped the list back on itself (Pointed one of the pointers to an earlier node).    \n\nAll of these except the last one shouldn’t be particularly challenging to a second semester CS student. I was honestly very surprised with how easy the programming challenges were.  \n\nFrom there, you’ll either get a call saying we would like you to come on or we wouldn’t. To conclude my story, I did get an internship! I won’t say with who in case one of you wants to stalk me, but I’m very pleased with it.  \n\n**Miscellaneous information you might want to know:**\n\n- In my research into internships, I got a decent grasp of what interns get paid. In New York and California the internships I looked at were at $30/hour. Around here in Atlanta, I’m getting paid $15/hour, and another one I tried to get was $18/hour. So, definitely good money, and scales based on where you live.  \n\n- The big tech companies are the only ones who pay for relocation, so look for something in your area. Nevertheless, it’s awesome they do that.  \n\n- Internships are generally between eight and twelve weeks, depending on where they are, and not particularly accommodating to your schedule. I’ll end up only working about 3/4ths of my summer right now, due to when their internship block of the summer is. Oh well.  \n\nAnd that’s all I got! If you have any other questions or if I’ve left out something big from this guide, please either post here or PM me! I’m happy to share whatever knowledge I have. \n",
      "subreddit": "cscareerquestions",
      "score": 103,
      "url": "https://reddit.com/r/cscareerquestions/comments/rghrs/can_you_get_an_internship_as_a_freshman_in/",
      "comments": [
        {
          "body": "I got an internship freshman year with Amazon, know a few people who did so as well.  It's not impossible - you just have to know your shit and go out of your way to find and talk to recruiters.  Convince them that you're worth interviewing, then nail the fuck out of the interview.\n\nDon't let anyone tell you you can't do something.",
          "score": 17
        },
        {
          "body": "FYI, the \"tell me about yourself\" question is a fairly standard opener (usually it's phrased to be clear that it's in regards to your professional experience.) I often use ask that first when I interview folks, because it gives them a chance to highlight / expand on their resume. Plus, it gets people talking and tends to ease the stress out of an interview a bit. You should definitely have a canned answer ready to that question, and be ready to answer follow-up questions based on what you say.\n\nI tell you what, though - this is a great guide, but you leave out the question of whether or not you WANT an internship as a freshman. My advice: unless you honestly positively cannot wait to experience the joys of working a corporate job all summer, or you need the money; wait a year or two. Internships the summers before your junior and senior year should be more than enough to secure the experience you need to be an attractive candidate at graduation, and you'll never get the chance to be lazy and do nothing all summer ever again after that.\n\nBut that's just me, stuck inside writing code with memories of Spring Break flashing before my eyes..... :)",
          "score": 8
        },
        {
          "body": "Thank you so much for this.  It's very well organized and covers EVERYTHING.  As a senior in college who didn't even think to apply for an internship until sophomore year, I am thankful to hear that I didn't miss out on much.",
          "score": 3
        },
        {
          "body": "Ever heard of an [REU](http://www.nsf.gov/funding/pgm_summ.jsp?pims_id=5517&amp;org=NSF)? It's a paid research internship over the summer aimed at getting Undergrads into Grad programs mostly in the USA. I'm currently a second year college student (also in the South) and did one last summer, and have another lined up for this one. \n\nIf you want my opinion, it's a research position which means it's really best for students looking into grad school as opposed to going straight into industry. So, it won't look quite as impressive, but I got my name on a paper before I turned nineteen, and a conference invite in D.C. Other benefits include housing, travel stipend, and a pretty sweet salary to go with it. \n\nBut this was a good guide.",
          "score": 4
        },
        {
          "body": "Your best bet is to show up at GA tech's career fair, I bet you can walk in. I have heard of people doing that.",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 3
        }
      ]
    },
    {
      "title": "Fake References Services. What the actual eff is this?",
      "body": "I recently discovered that you can pay for fake work experience and references.\n\nI'm absolutely amazed at the audacity of this. My friend interviewed a guy with what turned out to be the most padded resume I've ever seen. All of the references were fake, and so were the companies he allegedly work for. What did he think he was walking into, if not a machine learning and robotics startup?\n\nMy favorite part of my friend's story: Interviewee had \"advanced windows networking\" on his list of skills. My friend asked, \"How would you flush a machine's DNS cache?\" The guy said, \"I'd probably just LDAP it.\" **wat.** \n\nNow I'm paranoid. I'm looking at a few people on my team and rethinking how they got here... one of them has a *work experience pattern** on LinkedIn that matches the ones I found while researching this interviewee and his former \"coworkers\".\n\n- Have you guys had any experience with these services, like interviewing/working with people that you suspect have used them? \n- Have you used them yourself? Were you successful?\n- What can I tell my staffing team to look for to filter them out?\n- Is using a service like this fraud? It's definitely grounds for termination.\n\n_________________________\n\n*FYI - the pattern is a degree from DeVry or some similar racket, and then a long (4+ years) stint at a non-degree-related job, followed by about a half dozen jobs that lasted less than one year. One of them had an EE degree from a major state university, and then worked at Home Depot as a project manager for 15 years. Amazing.\n\n\nEdit: Link to shady site removed \n",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/6u4fat/fake_references_services_what_the_actual_eff_is/",
      "comments": [
        {
          "body": "I'd remove the link so that they don't get more traffic. Don't need to make their job easier for them.",
          "score": 13
        },
        {
          "body": "[deleted]",
          "score": 12
        },
        {
          "body": "Do you work with any small/medium sized contracting companies? There's a good chance they do this too, they're just slightly better at not getting caught.\n\nI'm not sure trivia questions, especially for what sounds like an IT position, are a good test of people like this. The contract companies have specific study guides for these positions and are banking on you asking the correct subset such that their candidates know all the answers from studying those guides. If you don't ask the right trivia, you won't find out they're not knowledgeable.\n\nSource: Friends on the employee side of this hiring dynamic",
          "score": 8
        },
        {
          "body": "&gt; followed by about a half dozen jobs that lasted less than one year.  \n  \nIf this is not a flag, then you are not serious about finding reasonable candidates.   I consult, and bounce from project to project in different firms.  On each project, the pattern is the same;  \n  \n* Client needs to start bringing in consultants, and hires most that apply.  \n* After 3-6 months, realization hits that some have on clue what they are doing, and they are let go.  \n   \nNow sometimes a project unexpectedly ends early, and the assignment is short.  This can happen to anyone.   The worst IT employees I have ever seen, all have a string of 6 month engagements.   \n   \nIt is a massive red flag, and really easy to avoid these hires.",
          "score": 7
        },
        {
          "body": "ipconfig /flushdns?",
          "score": 7
        },
        {
          "body": "LOL. I just happened to read today that if you are opening a new restaurant, you can pay hipsters to stand out in front, line up, and act happy. \n\nWe live in the great age of fakeness. Fake news, fake reviews, fake crowds, fake references, fake commitment to free speech, fake everything. \n",
          "score": 10
        }
      ]
    },
    {
      "title": "Boeing or Home Depot for Internship?",
      "body": "**TL/DR: Go with Boeing for a better location but potentially worse work or Home Depot in a location I don't like but potentially better projects?**\n\n&amp;nbsp;\n\nHi guys, I'm curious to get your opinions on which of these to go with. I haven't been able to find too much yet on this subreddit or any other forums.\n\nBoeing:\n\n* Pay: ~$28/hr; Good benefits (401k, health insurance, etc.); No housing assistance\n* Job Details: Their Defense, Space &amp; Security division. I'm not sure what exactly I would be working on but the contact that I talked to said their focus now is on the flight and application software for these product areas. They work mainly with C++ and Python.\n* Location: Huntsville, AL\n\nHome Depot:\n\n* Pay: $20/hr; No benefits; They said they aren't able to confirm details on housing yet. In the past they have offered housing assistance though (~$800/mo according to comments I've seen on both glassdoor and reddit.)\n* Job Details: Wouldn't know the area or project until spring. I think they are a Java shop though which is what most of my experience is with.\n* Location: Their Store Support Center or Technology center (which is brand new and seems pretty neat) which are both in/near Marietta, GA.\n\n&amp;nbsp;\n\nIt does seem like I could work on more interesting stuff at Home Depot and I have heard they have been modernizing their tech stack recently. They would definitely be the more tech focused company I think (for example their interview was a technical group interview with coding and design whereas Boeing asked me only behavioral questions) but I don't know for sure.  \n\n&amp;nbsp;\n\nI think net pay will probably be very similar between the two. $800 seems plenty for a place in Marietta and after factoring in Huntsville's LCOL, Boeing's pay is probably comparable to $20/hr.\n\n&amp;nbsp;\n\nMy biggest issue with Home Depot is probably location. I worked in Atlanta last summer and I thoroughly did not enjoy it. This one is in Marietta rather than downtown though but to be honest that doesn't make me feel any better about it. In contrast, I know some people in Huntsville and its seems like a neat, outdoorsy place in the summer (I'm pretty into running and cycling).\n\n&amp;nbsp;\n\nMy biggest concern with Boeing is the likelihood that they use outdated practices or that I might not get much meaningful work at such a large, bureaucratic company. I'm not really interested in embedded software and would really like to improve my front-end/full-stack skills because that's the area I would like to work in after I graduate next year. \n\n&amp;nbsp;\n\nI don't think I would want to work for either of these companies full time and I'm just looking to have experience and projects to talk about when I'm interviewing for full time next year. I wasn't given much work at my previous internship which made interviewing particularly difficult this fall. My responses to questions about my past experience were weak and difficult to come up with.\n\n&amp;nbsp;\n\nIf you guys have any experience with the intern programs at these companies or any advice in general about which to go with I appreciate it. \n\nThanks",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/9wgeom/boeing_or_home_depot_for_internship/",
      "comments": [
        {
          "body": "Forgetting the short term benefits from the roles, I would go with Boeing just from cache and being in Aerospace/manufacturing space which is a more difficult desireable industry.\n\nThat will likely open more doors and catch eyes looking at your resume afterwards than Home Depot.",
          "score": 11
        },
        {
          "body": "I got the home depot offer too. I emailed the recruiter and he said they will definitely provide housing assistance. They’re in the process of getting legal information before informing interns. \n",
          "score": 5
        },
        {
          "body": "I interned at home depot last summer, we had free housing at Georgia Tech, you'll probably have similar accommodations this summer.\n\nI absolutely loved my team and met some very knowledgeable people and skilled developers, also some decent ones. I personally got lucky and my entire team was super knowledgeable, but I occasionally had to talk to other teams and really felt for their interns. Also, the stack is very modern, and absolutely not a \"Java shop,\" the Home Depot is huge and the stack varies largely per team. I personally worked on pure Go (and I loved it).\n\nHowever, the area really killed it for me. Atlanta sucks, and the office was okay at best (I was in the Marietta Technology Center). Food is crazy good though which almost made it bearable.\n\nAlso, the interns were pretty apathetic about the work in general, which didn't really motivate me to keep learning much, especially because practically everyone gets return offers.\n\nOverall, though, it's really what you make of it. Very easy to coast by, not learn or produce much, and have a pretty decent job offer lined up. You can also push yourself, learn all you can, surround yourself with the right people, and get a lot out of it.",
          "score": 5
        },
        {
          "body": "I’ll keep your info in case we both accept the home depot offer",
          "score": 2
        },
        {
          "body": "I interned at Home Depot and thought their internship was pretty cool for a non-software company. Lots of events, great learning opportunities, and I loved the interactions and accessibility to talk to their C level execs. It was a great change of pace and a lot of fun insight from people you wouldn't usually get the chance to talk to.",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 2
        }
      ]
    },
    {
      "title": "\"People who get jobs don't come here to complain\" seems to be the mindset of people here but isn't it just as fair to say not everybody comes here to complain about the lack of CS jobs?",
      "body": "Everyday there are threads about the flooded CS market thanks to the many CS grads, boot camp grads and all those self-study sites (Codecademy, Udacity, Udemy, Teamtreehouse, etc) and usually the experienced devs seem to express their annoyance with the following:\n\n* \"CS isn't flooded, there are tons of jobs for good engineers.  If you're a good engineer, you'll get a job\"\n\n* \"CSCQ is a small subset of people, there are tons of jobs out there.  You don't hear about them getting jobs because they don't come here to talk about it\"\n\nBut isn't it just as fair to say there are tons of people, who aren't part of this community, that aren't getting jobs AND not coming here to complain about it?\n\nI really feel bad for anyone getting into this industry, buying into the \"learn to code, get a high paying job\" scam that has been going on since about 2013.  To this day, self-study tutorial sites are still popping up, encouraging people to enroll in their monthly subscriptions.  Every year, more CS grads enter the market with debt to pay off but end up working at Home Depot.  Coding boot camps are still around enrolling students for $10,000-$20,000 for a three to six month cram course.\n\nWith all these \"graduates\" from various sources, even if you are a good engineer, you'll never get noticed mixed in with all the shit applicants.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/8mrion/people_who_get_jobs_dont_come_here_to_complain/",
      "comments": [
        {
          "body": "&gt; With all these \"graduates\" from various sources, even if you are a good engineer, you'll never get noticed mixed in with all the shit applicants.\n\nProblem isn't that good engineers don't get noticed. They do. Actual problem is that there are a lot of people who think they are good engineers, but really are not. \"Best among people I know\" doesn't mean anything if you don't know anyone. Or you are too focused on your strength while ignoring your fatal weaknesses (e.g. acing leetcode is useless if you present yourself as an asshole to your interviewers).\n\nI'm nowadays at the other end of the interview table, and the quality of the on-site candidate pool is surprisingly low even for Big-N and tech unicorns. It doesn't take much to blow other candidates out of the water.",
          "score": 11
        },
        {
          "body": "[deleted]",
          "score": 5
        },
        {
          "body": "I agree that the boot camps are garbage, and yet I still struggle to find people when hiring. That’s why I’m working on my blog - to create a path to the candidate I want to see show up for an interview with me. \n\nYou need to learn to deliver projects, not “code”, and be presentable and alert during an interview. It’s not rocket science. \n\nAlso most people won’t go straight to high paying work. That’s a function of job hopping for most people in software. ",
          "score": 5
        },
        {
          "body": "There are plenty of jobs because CS is much easier to get into than every other high paying, competitive field. Try getting into big law, or medical school, or investment banking, after failing one class, or not going to the right school, or deciding on a career change at 30. \n\nEvery major has a ton of unqualified graduates who either 1) didn't try particularly hard or only barely made the cut, or 2) are in a bubble of mediocrity, maybe due to the friends they know or the college /bootcamp /community they find themselves in. It's not the industry's fault they don't meet the bar -- tons of \"shit applicants\" aren't from third world countries, they might be your dorm mates or friends, and a lot of them definitely ask questions here. The people from the first group don't succeed right away, and they might come and ask questions, but they aren't complaining about it. It tends to be the folks in group 2 that think \"good engineers\" are being lost in the noise.",
          "score": 5
        },
        {
          "body": "What’s wrong with working at Home Depot ",
          "score": 1
        }
      ]
    },
    {
      "title": "How are individuals with severe social awkwardness expected to maintain employment?",
      "body": "Quite often, computer science (or the like) [is suggested as a good career](https://www.iidc.indiana.edu/irca/articles/choosing-the-right-job-for-people-with-autism-or-aspergers-syndrome.html) for people who are on the spectrum. (also, [here](https://www.autismparentingmagazine.com/best-autism-jobs-and-careers/), and [here](https://www.psychologytoday.com/us/blog/spectrum-solutions/201007/how-find-your-career-the-autism-spectrum))\n\nIf you meet me in-person, you can **absolutely** tell there's something **very** wrong with me within five seconds of our initial conversation. I'm VERY socially awkward, and it's an incredibly pervasive issue when it comes to finding employment. I have a master's degree, but I had the worst time trying to find employment post-graduation. I didn't have any internships, which certainly didn't help. I tried applying all over the US and each \"sure-thing\" interview I got (especially with government jobs) ended in rejection.\n\nI spent a year looking for employment, went to career and interview coaching sessions, and I even got rejected from jobs at McDonald's, Best Buy, Wendy's, and Home Depot--places that were absolutely desperately advertising on the local news stations that they **needed** people, and they didn't take me. I was living with my parents, who were incredibly condescending that I could get a master's degree and not find a job, and it just discouraged me that I'm destined for a life of unemployment.\n\nEventually, I got a job at a FAANG (not as an SDE, but in a technical role) near the start of the pandemic. Let me say that this pandemic has been a literal **GODSEND** when it comes to interacting with coworkers. My coworkers aren't subjected to the sandpaper friction of dealing with me, because I can hide behind text and a computer screen and *carefully* think about what I'm saying. When I *was* going into the office, my coworkers were all pissed off with me because of the severe social awkwardness.\n\nBut I'm not feeling inclined to stay here at this FAANG anymore just because of the cutthroat competition to get promoted (that is, if you're not working towards getting promoted, you're getting fired). I want to transition away from corporate America into roles that aren't so high stress (such as government work), but I'm still no better at socializing than I was before getting this job. Once the pandemic ends, we're going to be expected to go back into offices, and it's guaranteed I'm going to be discovered and quickly terminated. Even if I don't stay at this FAANG, I will still have trouble obtaining and maintaining employment. For people who are socially awkward, how difficult is it for you to procure and keep employment?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/jayc8g/how_are_individuals_with_severe_social/",
      "comments": [
        {
          "body": "Software engineering in general is teamwork, and anyone who can't 'do' teamwork will struggle. IT jobs where you are not working in a team and don't have to interact with people are *very* niche. What for example Microsoft is referring to is for example manual testing. \n\nUnfortunately the articles you are linking are mostly setting people up for a big disappointment.",
          "score": 7
        },
        {
          "body": "If you have an official diagnosis of Autism, you're protected by the Americans w/ Disabilities Act.  This can affect how you're interviewed and employed, in an extremely positive way.  When applying, you can notify the contact of your diagnosis and all reasonable accommodations _must_ be made to ensure equal footing with other applicants.  If this does not occur, you can file suit against the company for active discrimination which will likely result in a job offer and/or cash settlement.\n\nLikewise, you cannot be terminated or denied promotion for symptomatic expression of your diagnosed Disorder.  If you are, you can file suit against your former employer and you will likely be paid back wages plus an extravagant settlement.",
          "score": 5
        },
        {
          "body": "Can you be more specific about the “friction” you experience? What puts people off you? Like what did you say, or what did you do, that led people to be pissed at you? I was diagnosed with Aspergers and people definitely think I’m weird but not to the extent they’re super pissed at me. People would describe me as “open, can be charismatic but does not read social cues and can be kind of cold”, I think. Hard to get to know. Foot in mouth sometimes. But not to the extent that people get super pissed at me.\n\nHere’s my one tip though. When in doubt, keep your mouth shut. If you must say something, take 5 extra seconds to think if it’s a good idea. If what I’m saying can be construed as a commentary on somebody’s intelligence, character, work ethic, etc, I immediately rethink if I want to say it the way it was, on the tip of my tongue.",
          "score": 2
        }
      ]
    },
    {
      "title": "What should I be doing since I'm struggling so much with the job search?",
      "body": "Graduated in 2015.\n\nAfter over 1 year of unemployment, I managed to get a contractor job in NYC for $4k/month. The SVP of Engineering had lunch with me and said I was going to get converted to full time. One week later, their budget changed and I was laid off.\n\nOne more year of unemployment passed, I got a contracting position at Dell Technologies in Texas. I was promised full time after 2 months. I completed an entire project by myself. On the second month, my team lost funding and 30+ people were laid off (one co-worker was laid off after 1 week). I worked together with my staff/architect and got a great recommendation. Everyone was sorry for what happened.\n\nWhile working at Dell, I only managed to get interviews with small companies due to my lead's referrals. These turned out to be \"interviewing for the sake of looking nice\".\n\nCompany #1: internal transfer, had a pair-programming session implementing a data structure, rejected me with the feedback they had no more junior spots left.\n\nCompany #2:  consulting company, on-site, never received a rejection even after sending a thank you, and my referrer has been ignored when he asked for feedback.\n\nCompany #3: consulting company, lunch, didn't seem to be satisfied with a Github, my recommendation by referrer, and work experience. He asked me to give him internal company code, which I declined.\n\nAnyway, I wasn't happy with any of those, especially because two of them turned out to be contracting roles. Currently, I'm not getting any interviews. I tried to connect to LinkedIn recruiters; no one has replied. I was already connected to a Home Depot recruiter; he looked at my profile then he ignored me.\n\nI had 5 mock interviews with senior principal engineers at Dell. They told me I was \"middle of the pack\" in terms of performance. No one complained about my resume.\n\nOther than referrals at crap companies, I'm not getting a single interview through Indeed or similar.",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/83q5n6/what_should_i_be_doing_since_im_struggling_so/",
      "comments": [
        {
          "body": "The basic principles still apply.\n\n* If you can't get interviews then your resume isn't good.\n* If you can't get jobs you need better interviewing skills.\n\n&gt; I had 5 mock interviews with senior principal engineers at Dell. They told me I was \"middle of the pack\" in terms of performance. No one complained about my resume.\n\nHopefully you didn't have to pay them if that's all the feedback they gave you.  \n\nMock interviews are for people to be brutally honest on why they would not hire you.  They should be going in to specifics and citing what you did in the mock interview as examples.  Even better if they guide you on how to rectify the technical and behavioral issues.",
          "score": 11
        },
        {
          "body": "[removed]",
          "score": 2
        }
      ]
    },
    {
      "title": "Home Depot Internship",
      "body": "Has Anyone ever had an internship HomeDepot? Im looking to apply for summer 2021 when the time comes.\n\nWhat was the interview process like? When do they usually start the recruiting process?\n\nI would be trying for the Atlanta  Location",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/gj0td4/home_depot_internship/",
      "comments": [
        {
          "body": "Not familiar with Home Depot  but applied for and got an internship for a somewhat similar company and also went through the interview process for a new grad role at a B2B place that offered services to large home improvement warehouse style stores like Home Depot. Didn't end up accepting either one of the offers, but since it's not a given you'll get a direct answer back from someone who actually went through their specific process, I can contribute my 2 cents at least as far as the interview  for the internship. Interview process was pretty 'basic' relative to some of my other internships, especially since the company was considering even Freshman candidates. The position was a very vague, generalist-type role and the technical portion of the interview was largely focused on relational databases and scripting. Web was mentioned as a minor aspect of the role but wasn't really assessed during the actual interview beyond me describing what I did in my previous internship which was more or less 100% web dev. The biggest takeaway I had at the time was that the technical portion of the interview was very SQL and 'data' focused but not very intense or comprehensive overall.\n\nIt's worth noting that this process was carried out almost entirely on-site at my University after a large career fair where the company had two different reps meet with me in the days after I visited their booth, so its probably not typical for interns applying through other means. Another key difference is that I had the fortune of being the relatively rare unicorn that had an internship after my Freshman year, so there's a good chance the process was somewhat streamlined (for example, not asking any technical webdev questions after asking in detail about what I did at that last internship).  I know this isn't directly relevant to your question, but I figured I'd add something in case you aren't able to get a response from a former HD applicant/intern.",
          "score": 4
        },
        {
          "body": "I just picture a large corporate office where you sit in the parking lot, and when someone needs some quick coding, you and a bunch of immigrants get into the back of a pickup truck and do some day labor programming.  I'm at 70% sure that's not the case, but the mental image is too good for me to correct myself.",
          "score": 12
        }
      ]
    },
    {
      "title": "How do I explain why I left my family business on a interview?",
      "body": "I used to work at my dad's hardware store, were I'd sell used and new water heaters. Some of those people would come back because thier heater didn't work. Causing the customers to lash out at me and I could only offer a different water heater. He didn't allow me refund their money (I disliked this policy).  \n\nThis affected my confidence in selling merchandise  and I got tired of getting screamed at, so I left. \n\n\nI'm thinking of applying to Lowe's, Home Depot or Harbor Freight. How do I go onto explaining why I left my family business or should I just not state that it's a family business?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/ts0jxt/how_do_i_explain_why_i_left_my_family_business_on/",
      "comments": [
        {
          "body": "Give whatever 'reason' you want. LOL.",
          "score": 1
        }
      ]
    },
    {
      "title": "A job interview with a recruiter is the grand prize of this Home Depot contest. What a sad commentary on the state of the economy.",
      "body": "",
      "subreddit": "jobs",
      "score": 476,
      "url": "https://reddit.com/r/jobs/comments/1qgux3/a_job_interview_with_a_recruiter_is_the_grand/",
      "comments": [
        {
          "body": "I find it laughable that the contest is \"Tell us what you're thankful for *in your career*\" when if you actually want the prize for this contest, there is a 99% chance you don't have a career or are unemployed.",
          "score": 63
        },
        {
          "body": "[deleted]",
          "score": 86
        },
        {
          "body": "Are we in a unemployed workforce so plentiful that we have a lottery not for a job, but for getting a chance to talk with a recruiter? Why would anyone happy/satisfied with their career want to speak with a Home Depot recruiter anyways? This is disgusting.",
          "score": 71
        },
        {
          "body": "Is there a promise of a \"job interview\" or is it just a learning session with a recruiter? That's pathetic.",
          "score": 26
        },
        {
          "body": "Recruiter here, and that is incredibly sad.  Sadder that it is a Home Depot recruiter, who is only going to recruit the person anyway.  It's almost like a job interview is a prize.",
          "score": 44
        },
        {
          "body": "husky late slim familiar airport hateful enter murky caption engine\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 14
        },
        {
          "body": "Tell us what you're thankful for? Wow. That sounds so degrading. ",
          "score": 39
        },
        {
          "body": "I know a lot of people who have worked for Home Depot, they all said it was hell. They work their employees to the bone and do no compensate well financially or in benefits.",
          "score": 12
        }
      ]
    },
    {
      "title": "I'm beginning to believe I'm unemployable and nobody knows why.",
      "body": "I've been looking for my very first job since I was 18. I'm 20 now. it's been two in a half years and absolutely nothing. \n\nUsually when people suggest I apply somewhere or try something I've already applied to dozens of those locations/positions or tried that strategy multiple times and still no job offers.\n\nTwo place I'm commonly told to apply to is McDonald's and home depot. \n\nMultiple people have told me that mcdonalds is no requirements and hires anyone. So when I say that I've applied to dozens of mcdonalds locations, only ever heard back from six, only got interviews at five, and didn't get the job at any of them, everyone suddenly loses all hope for me getting a job, they tell me if i can't even get a job at mcdonalds they don't see how I'll get a job anywhere and they tell me how they've never known anyone to not be able to get a job at mcdonalds like me. \n\nSomeone even said they even know people who didn't have the best interviews for a mcdonalds position and still got hired. But I've had mcdonalds interviews go phenomenaly well where the hiring manager really liked me and still remembers me today but she still won't hire me and won't tell me why not.\n\nI also have very open availability, i can work literally any shift on any day, but I once lost a mcdonalds job opening at a 24 hour location to a high schooler who can only legally work a maximum of 3 hours a day on weekdays and 7 hours a day on weekends and can't work past 10pm\n\nas for home depot, well I've never even gotten an interview from them, so idk.\n\nAm I really that unemployable? I have truly done everything right and have tried absolutely everything in my power to increase my chances of getting a job and two in a half years later I've still gotten absolutely 0 job offers. I've even sought help from 2 different organizations who help young people get jobs and I still didn't get any job offers so even they couldn't help me get employed :/\n\nI have no idea why i can't get a job, but everyone else has lost hope in me after seeing me get rejected from multiple mcdonalds.",
      "subreddit": "jobs",
      "score": 51,
      "url": "https://reddit.com/r/jobs/comments/1pcvj65/im_beginning_to_believe_im_unemployable_and/",
      "comments": [
        {
          "body": "As a 19 year old I'm in a very similar spot. Had one interview at Domino's that went seemingly very well, they were acting like they wanted to hire me, I told them that I had open availability and that I was very willing to learn and be trained for the job. Its been a month and a half.\n\nBeen applying to countless retail, fast food places, and supermarkets. And I'm usually either ghosted or rejected. One supermarket got back to me and essentially told me that there were so many applications that they couldn't even read mine. Honestly it's not just you, nearly everyone I know who's my age is in the same boat of searching and searching for work and nothing is falling through.",
          "score": 26
        },
        {
          "body": "Are you just super weird but completely self unaware? Have an offputting laugh or mannerism? Unbearable body odor? Appearing desperate because you’ve been looking for two years and mention that? I’m at a loss.\n\nAside from those, if any mention of not graduating high school could be a reason.",
          "score": 22
        },
        {
          "body": "Ive been in retail my whole life, I know the walgreens down the road is super understaffed, I applied and was told I was over qualified. It ain't just you buddy.",
          "score": 17
        },
        {
          "body": "&gt;I've had mcdonalds interviews go phenomenaly well where the hiring manager really liked me and still remembers me today but she still won't hire me and won't tell me why not.\n\nSo this is.... a really weird statement. Why are you in touch with this person? You say they 'still remember you to this day', which means they must have told you that, so if they're your friend outside of the world of work then yes of course, that's why, but if they're not then how on earth would you know that they have any idea who you are, never mind remember you? And then they won't tell you why they won't hire you, but apparently are on good enough terms that they're talking to you and telling you this.\n\nIf your problem isn't just a function of an overvivid imagination/mental health issue, then it's probably too unique for anyone outside your situation to have any ideas.\n\nRealistically, you're probably just coming across super weird in interviews, you say in comments that you refuse to complete even a high school education, and so if it's fake then you have a weird fantasy world, if it's real then you need to pull your socks up and stop being so weird if you want to work.\n\nFunctionally, nobody who wanted a job was unemployed in the labour shortage when you're saying you started.\n\nThis is at best creative writing, possibly creative existence.",
          "score": 19
        },
        {
          "body": "\" But I've had mcdonalds interviews go phenomenaly well where the hiring manager really liked me and still remembers me today but she still won't hire me and won't tell me why not.\" Are you SURE they remember you because they LIKE you and not because you gave off some kind of HUGE RED FLAG aura during your interview?\n\n  \nIf you interviewed FIVE TIMES and got rejected all five times.... you are doing something very very very wrong in those interviews. You need interview practice face to face with another human who will be honest with you.",
          "score": 18
        }
      ]
    },
    {
      "title": "Why is no one actually hiring?",
      "body": "UPDATE: I only applied to about 10 more jobs and got a manager position in fast food not even a month after this post. \n\nSo i’ve been looking for a steady job since January. I’ve sent in about 40 applications this past month, and i’ve gotten literally 5 responses back. 3 to reject me and 2 to schedule an interview. Do people not even send out rejection messages anymore these days?? Like literally just no reply back and a lot of the time no indication that my application is even being looked at. Why do you have postings up if you’re not keeping up with your applicants?\n\nI’m 21F, don’t have a degree but I graduated HS with honors, took college classes, and studied graphic design while in HS. I have a couple years of service management experience with references. I’d say I have pretty good resume compared to other people my age. I’ve never not gotten a job i’ve applied for up until this point, and i’ve never worked a job where I wasn’t getting promoted, or at least getting a raise within a couple months. \n\nI’ve applied to all sorts of jobs. Listings from second hand websites, listings directly on their respective websites, bottom of the barrel service jobs, management, assistant management, shift lead, nanny/babysitting, office, warehouse, remote, part time, full time. I always put open availability including overnight. \n\nThe first interview I mentioned getting I didn’t end up attending, because I didn’t do enough research beforehand and it turned out to be an MLM scheme. The second was a full time caregiving job. Did an over the phone interview which lasted over an hour, then an in person to meet the family. We discussed pay, responsibilities, all the intricacies, I was under the impression I had gotten the position. They had told me to contact them to discuss a start date and when I sent a follow up message they had just completely ghosted me. I would understand if they found someone that was a better fit, but they could’ve communicated that with me.\n\n❗️This is the end of my relevant information, I just start yapping from here on out❗️\n\nThe whole reason for my unemployment is such a long story I might make another post in more detail. Basically I got laid off in December  from a warehouse job I had been at for over a year. I was doing really well there and it was such an easy job for the pay. Long story short I got sexually assaulted and harassed along with my friend group by this individual for weeks after. We reported this to HR a total of at least 10+ times all together. When they continued to do nothing I had enough of her BS and they fired me for tapping her on the shoulder to get her attention and asking her “wtf is your problem.” The actual written down reason for my termination was because I tapped her on the shoulder. I then started a very long process with EEOC where I got a small ass settlement that didn’t even cover my backpay, and a large percentage of it went to my attorney. I settled in the interest of not dealing with it for another 9 months, plus courts typically rule in favor of the employer, at least in my county. \n\nThe jobs i’ve had since then were home depot, which I quit on my 5th day. They scheduled me for extremely inconsistent hours and told me I wouldn’t be allowed to request a schedule change, have any time off, or have any of the benefits they were advertising to my onboarding group, including insurance, for at least A YEAR. And most recently I went back to the service industry and bartended for a pizza spot. My GM, who clearly had a lot of issues, deleted a bunch of my open checks right in front of my face, then proceeded to fire me for it. This was over a month ago and I only worked there for 2 months, made good tips in the time I did work there though.\n\nMy bf 22M also got laid off in relation to the miscarriage of the sexual assault case, and has been having the same struggles with getting a job. He refuses to seek out his own settlement because he saw how mentally taxing it was for me. We have basically been living off my shitty settlement, but it’s going to run out within a few months and I’m starting to seriously get worried. I’ve never had issues with landing a job before. I get we’re somewhat in a recession but this seems so extreme. If anyone knows places that are ACTUALLY fucking hiring please help a girl out. I’m thinking of just going into strips of places and handing my resume out like candy. If anyone has tried this lmk your experience.",
      "subreddit": "jobs",
      "score": 97,
      "url": "https://reddit.com/r/jobs/comments/1lybbkq/why_is_no_one_actually_hiring/",
      "comments": [
        {
          "body": "I’m putting In Minimum 15 a day, masters degree, no call backs. So yea idk what’s going on but it sucks. ",
          "score": 39
        },
        {
          "body": "Some of them aren't even open anymore.\n\nGo to Snagajob and look up \"Ad Astra wine\"; it says they're hiring as of a day or two ago.\n\nThey closed down in MARCH after a sexual assault scandal drove them out of business..",
          "score": 32
        },
        {
          "body": "You might just want to look at a temp agency if you have warehouse experience and if you have forklift experience, that's probably going to be an easy placement. If you're looking at other types of roles, you can mention it when applying at the temp agency and get a job that way. It might take long but if nothing else is biting, you might as well try for work that way.\n\nCan you drive and have a car? That will probably get you more opportunities although they might not reply back to you. Honestly I did a basic phone interview for a place and then they replied to me a month later for a followup, but I was unavailable by then. Also got callbacks for an underwriting role but it took them a while to reply too.",
          "score": 7
        },
        {
          "body": "You gotta up those numbers. Try 40 a day. You actually have good ratio with the amount you did.",
          "score": 38
        }
      ]
    },
    {
      "title": "Getting interviewed by Home Depot and Lowe’s or stay at Kohl’s?",
      "body": "I just got hired by Kohl’s, pretty good so far. The only con that I can think of is that it’s far across town.\nI just got called to do interviews with both Lowe’s(tomorrow) and Home Depot(Thurs). I am going to hear them out. Both are within walking distance(5 min) so I don’t have to rely on my friend for a ride.\nKohl’s, on foot, is about 3 hours away. In a vehicle, using the highway, 30 minutes.\nJust curious on what I should do?\nI love Kohl’s working environment but if something happens to my ride, I’m screwed. \nI’m just wondering if you guys have any advice?\nAnd if you’ve worked for these companies, please share some insight with me.\nMin wage is $7.25\nKohl’s is paying me $9.50\nHome Depot is offering $11.00\nNo idea at Lowe’s.",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/jmv0wc/getting_interviewed_by_home_depot_and_lowes_or/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Personally I would never rely on another person to get to work if I had another choice. My choice would be to jump ship to something closer since they are all the same job basically",
          "score": 5
        },
        {
          "body": "Definitely go with home depot or Lowe's if they are closer. Not only is it closer which means the possibility of picking up more hours.But you can also save money by walking to work. \n\nThe other upside is in a lot of areas Home Depot and lowes were seen as an essential business. They never shut down during this pandemic in a lot of places. Where as kohls had too shutdown in a lot of areas. \n\nTo summarize if i were in your shoes id go with Home Depot or Lowe's. Better pay, more money in your pocket if you walk to work, possibly better job security during the pandemic. \n\nAnd i spent a little time working at kohls. It’s not a bad place to work if you get into a good store. but its definitely not worth going 30 minutes out of town for unless its your only option. Honestly it’s no different then any other retail store.",
          "score": 6
        }
      ]
    },
    {
      "title": "Job interview on Monday at Home Depot!  Any suggestions?",
      "body": "Man I am thrilled, this job hunt has been brutal.  I really want to nail this interview, and I am gonna go tomorrow and get the lay of the aisles and take notes so I can really seem like I know the store well.  Any home depot employees out there that have some real good advice?  Or anyone else for that matter?  Wish me luck!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/qqrp8/job_interview_on_monday_at_home_depot_any/",
      "comments": [
        {
          "body": "Wear orange?",
          "score": 5
        },
        {
          "body": "I've worked at Home Depot for three years now. You will most likely be asked questions about what you would say/do when put in a certain situation with a customer.\n \"A customer approaches you about a problem they had last time they were here. What do you say to them?\" Something like that. \nThey will also ask you about previous jobs you had, what type of responsibilities you had, what you did when presented with certain situations. \nHonestly you don't need to know anything about whatever area you end up working in. It will certainly help with the interview if you can tell them what you know about the area you're interviewing for, but they care more about how you interact with customers than what you know. \nI've worked as a cashier, sales associate and a loader. I hate my job, but that has more to do with the fact that I graduated with a B.A. In Public Relations last May and haven't found a job in that field. Its not a terrible place to work, but the starting pay even for a sales associate is about 9.30 where I work. Cashiers start around minimum wage. \nI'll be happy to answer any other questions if you have any. \nGood luck!",
          "score": 5
        },
        {
          "body": "I don't know about Home Depot per se, but  it may help others give you advice if you explain what sort of position you are going for--are you an expert in a particular field like carpentry or are you gong for a more general position like cashier or maybe you're looking at a management position? Different jobs may call for different advice. Just a thought. \n\nNo matter what, good luck!",
          "score": 2
        },
        {
          "body": "If they ask you why you want to work there make sure to talk about how awesome of a company HD is. They pride themselves on the family atmosphere and all being part of a team. Great place to work. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Autistic and been out of work for awhile. Can't get a job",
      "body": "37/M with autism. I live in the US, Florida specifically. Been out of work for 9 years (bad i know) for personal reasons. Before that I have had about 10 years of experience in Retail (Home Depot) so I thought I'd apply for retail jobs just so I can get some recent work experience on my resume. Been applying for 9 months so far and no dice. I have heard now is a good time to apply for retail because of the summer season coming up yet I still have had no luck. I have got interviews and have tried to mask to the best of my ability. I'm not good at masking and I have a monotone voice but I am very polite and answer all questions to the best of my ability. I have been practicing and got help from people but it hasn't really seemed to make a difference in interviews. I still cannot seem confident or not nervous. I can read from a memorized script for some questions but sometimes they have a question I am not prepared for.\n\nRegardless I usually get ghosted and do not get interviews for the most part. I have only had a handful of them for retail postions.\n\nWhat else can I possibly do? I'm not really qualified for anything. I only have a 2 year associates degree. I can't see what I'm qualified for besides retail. And if retail won't hire me what choice do I have? I got a forklift license to apply for warehouse jobs. People tell me warehouses are always hiring and that may be true but it hasn't helped me get a job with one. I did get one warehouse position temporarily thru a work agency but they let me go after one day - they said I wasn't quick enough despite me letting them know beforehand I am new with forklifts.\n\nOthers have said that there is state help. I have looked into that but they still cannot guarantee me a job. Is there anything else I can do?",
      "subreddit": "jobs",
      "score": 102,
      "url": "https://reddit.com/r/jobs/comments/1dbzl3q/autistic_and_been_out_of_work_for_awhile_cant_get/",
      "comments": [
        {
          "body": "Not sure what part of Florida you're in, but near me is an organization called the Key Training Center (a quick Google search will tell you what they're about). If they don't have locations near you, they might be able to help you find some resources in your area. 🙂",
          "score": 50
        },
        {
          "body": "Have you tried movie theaters? They usually hire a lot as the summer begins. You can be apart of the floor staff (theater clean up crew) if you aren’t too keen on talking to the public. \n\nSame with restaurants! Especially chain restaurants. They hire a ton around this time. You can be a busboy and not have to interact with the public too much. No experience needed too.",
          "score": 43
        },
        {
          "body": "Aren’t there companies that have hiring programs specifically for people with disabilities?   That would be path of least resistance for you.  Then during the interview you can explain what your disability is and/ or how it affects your abilies/behavior - but not mentally.",
          "score": 20
        },
        {
          "body": "[deleted]",
          "score": 38
        },
        {
          "body": "Places like Amazon and Walmart, ups and others will hire without an interview. Just say you’ll do any position and have fully open availability. Keep fresh applications in because sometimes they hire a bunch of people all at once.",
          "score": 15
        },
        {
          "body": "I would personally recommend removing your degree from your resume if you’re applying to retail. They might think you’re overqualified/ or will leave as soon as you get something better. Have you considered food service?",
          "score": 3
        },
        {
          "body": "Is there a mail sorting centre close to where you are? I have had many, many jobs in my lifetime but can say that sorting mail at the local mail center is, all things considered, the best job I have ever had. Not the most challenging but I really enjoyed the people I worked with and the fact that when you leave work, you don't have to think about it.",
          "score": 3
        }
      ]
    },
    {
      "title": "I got 2 job interviews next week!!",
      "body": "I’m on a roll!\n\nI finally got a job interview with Home Depot!!\nI got McDonalds on Monday, Home Depot on Tuesday!!\n\nI worked at Home Depot twice before so I’m hoping to get it on Tuesday. I really need this job. I’d be working in sales this time unless they give me Garden again. I’ll be making $19!! My highest yet. My last two were $15-16. \n\nWish me luck!\n\nEdit: For those wondering, I had to change it to tomorrow due to a snowstorm that wasn’t even bad lol, I find out tomorrow!",
      "subreddit": "jobs",
      "score": 256,
      "url": "https://reddit.com/r/jobs/comments/1ao7sgr/i_got_2_job_interviews_next_week/",
      "comments": [
        {
          "body": "Good luck my dude, you got it already",
          "score": 16
        },
        {
          "body": "Home Depot is super chill. I could imagine working there, learning where all the products are and whatnot. McDonald's is great, as long as you try to bring your own lunch more often than you eat the free food you'll get working there.",
          "score": 13
        },
        {
          "body": "Good luck !",
          "score": 3
        },
        {
          "body": "Home Depot and McDonalds?? FUCK YEA!",
          "score": 3
        },
        {
          "body": "Good luck OP.",
          "score": 2
        },
        {
          "body": "You can do it.\nAll the best… 🙂",
          "score": 2
        },
        {
          "body": "You got this!! Update us.",
          "score": 1
        },
        {
          "body": "I really feel like this is a troll post",
          "score": -3
        }
      ]
    },
    {
      "title": "What no interview jobs do you know?",
      "body": "Does anyone know any no interview jobs that basically just call you and tell you your start date?\n\nFor reference, I’m 21 and have crippling Anxiety. I was recently fired from Amazon as one of their 30,000 lay offs and the only jobs I ever had were Walmart, Amazon, field work &amp; The Home Depot, all jobs that don’t hold traditional interviews. I’ve been to over 100 interviews since I’ve legally been allowed to work (16) and have not once been hired on. It’s like some type of curse I just can’t get past no matter now much I practice or what anxiety medication I’m on. It’s to the point where I’ve had panics attacks during interviews and I need a job asap as bills are due and the holidays are at eve. My initial plan/last resort is to go straight to the fields again but I don’t want to have to resort to that. If anyone has any recommendations please let me know. \n\n\nUpdate: thank you everyone for the advice. I finally broke the curse and got a job! I feel more confident now tyasm",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1on7vgz/what_no_interview_jobs_do_you_know/",
      "comments": [
        {
          "body": "Amazon always has pretty rigorous interview process. How did you handle that.",
          "score": 2
        },
        {
          "body": "If you’re getting that many interviews, you clearly look good on paper. Have you tried any medication to help ease your anxiety? I used to be similar. Getting rid of it is often practice but when it’s too severe, medication really helped me. \n\nAs far as jobs go, there are not many jobs you would want these days that lack interviews entirely. \n\nI work in utilities (telecom) and rarely interact with anyone. I’ve had two jobs in this field and both were one interview of less than 20 minutes. Very casual chat. Osmose is a company that may be hiring. \n\nAlso, one thing that helped me a lot is realizing an interview is two sided. You are interviewing the company to see if it’s somewhere you want to work. Think of it as just an introduction, rather than a test.",
          "score": 2
        },
        {
          "body": "Look for warehouse, cleaning, delivery, or temp agency jobs. most of them hire fast with no real interview. Apply in person if you can.",
          "score": 2
        },
        {
          "body": "Warehouses, but that requires biometrics, and you may be stuck waiting a long time for a biometrics appointment.",
          "score": 1
        },
        {
          "body": "You need to stand out on you application. Put any awards you 've received, any clubs you be long to. Anything to let them know your motivated.",
          "score": 1
        },
        {
          "body": "I've always had good luck with restaurant kitchen jobs NGL. Saying I go to an interview is a stretch. They literally ask me if I got experience (yes or no) and what's my availability and I get hired on the spot.",
          "score": 1
        },
        {
          "body": "temp agencies are usually desperate, they'll hire anyone lol",
          "score": 1
        },
        {
          "body": "Hey, I’m really glad to see your update. Breaking that streak takes more strength than people realize.\n\nAnd for anyone still in the same spot: there *are* jobs that skip interviews. Warehousing, delivery helpers, seasonal retail, cleaning crews, landscaping, and food service often hire fast if you walk in with ID and availability.\n\nYou did something brave by trying again after panic attacks. That’s the kind of courage that builds real confidence over time. One step at a time is still forward. 🌿",
          "score": 1
        }
      ]
    },
    {
      "title": "How to get an entry-level retail job as an older applicant with mostly office experience?",
      "body": "As the title says, I've applied to all sorts of entry-level retail jobs from Starbucks to Home Depot and never get a call back. Should I just fabricate a resume with relevant experience and remove my own?\n\nI secured an interview for a pizza place because I actually did work doing that as a teen, so I just embellished that, but received some leading questions about why I'd return... My background is in PR and last two roles were as a manager, and while I'm still attempting to get back into that field, its been months and I've never been less confident. ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1qert3l/how_to_get_an_entrylevel_retail_job_as_an_older/",
      "comments": [
        {
          "body": "You should have multiple resumes if you are applying for different types of jobs because the jobs you are applying for want slaves with as little qualifications as possible that have no options and won’t leave.",
          "score": 2
        }
      ]
    },
    {
      "title": "Supply Chain Analyst @THD",
      "body": "Pretty much just want to get some insight on the interview process for this position at the Home Depot if anyone has anything they could share! I have to take an SQL assessment and then was told by my recruiter that I could get pop quizzed on SQL in person lol ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1nuh8c8/supply_chain_analyst_thd/",
      "comments": []
    },
    {
      "title": "Vent - “can’t even get a job at ____!”",
      "body": "I have to post a rant after reading some comments in a recent post, but honestly it comes up ALL THE TIME. The issue is people who are coming from a white collar, office, “career” background, that view a job in a retail (or restaurant, or grocery) as something that they should easily be able to obtain, and are shocked/disgusted/scared when they aren’t offered said job. “I can’t even get a job at Home Depot!” \n\nHere’s the thing: those companies are looking for specific things that you, as a laid-off office worker, are NOT likely to have.  \n\n1. They’re looking for people who will stay for at least 6 months to a year.  These hiring managers are judged on turnover, and have no interest hiring a person who’s going to jump ship as soon as they land their “real” job. They want to hire someone who sees Home Depot as the real job!  It’s usually pretty obvious when applicants view the position as a temporary, stop-gap measure.\n\n2. Relevant experience. If you haven’t worked this kind of job, then you aren’t experienced in it. For some reason office workers think that their years in finance or whatever should translate over to slicing deli meats. But you’re likely up against people who have done this work before and can speak to it in the interview. \n\n3. Attitude. Like point number 1, when former career professionals DO get hired, they have a tendency to have a superiority complex that is not rooted in their current performance but in their past career. One example that stands out to me is a guy who filled online shopping orders and every time that he was coached on a mistake would rant about having a Masters degree. Who cares, dude? Your masters wasn’t in packing groceries. Just do a good job at what you’re actually doing, please.  But there’s this constant need to inform coworkers, customers, etc about who they REALLY are. Sometimes it’s giggly and facetious, like “gosh this is all so new to me, haha! I was head of marketing and sales at my last job!” But it’s rare that someone can make the transition from their “real” career to what they see as a huge step down, and leave their ego behind. Meanwhile, everyone else there is at THEIR real job. \n\nTo work these kinds of jobs, you have to be really physically strong and tough. I can’t tell you how much I’ve softened up in the year and a half that I’ve gone from grocery to office! You’ve got to have customer service skills, teamwork ability, the willingness to work all kinds of hours and shifts, I could go on and on. \n\nBut so many people seem to think they should just be able to land one of these jobs just because they don’t pay as much, because they’re nominally ‘entry level’.  But if my choice is between someone who’s been working retail for years and someone who hadn’t, guess who gets the job? Or between a new entrant to the labor market, who’s fresh and ready to learn,versus someone who has a chip on their shoulder and hadn’t ever worked a late Sunday night shift? ",
      "subreddit": "jobs",
      "score": 98,
      "url": "https://reddit.com/r/jobs/comments/1eqppxl/vent_cant_even_get_a_job_at/",
      "comments": [
        {
          "body": "When you lose your job and can't find a new one, the first thing people say is \"Try retail, try food service. What, you're too good for entry level? No one wants to work anymore!\"\n\n\nThe world treats these jobs like anyone can get one at any time, not just office workers. ",
          "score": 74
        },
        {
          "body": "Gosh... So I've worked these low entry level type jobs almost my whole life. For 4 years though I was at a bank. Got let go from the bank and went back to Walmart. It took my body 2 months to stop feeling like it was falling apart every day 😂 I forgot how hard it is to just be on my feet and walk that much even though 4 years is nothing compared to the 15ish or so I've done on my feet jobs already. Like holy cow my body forgot fast!",
          "score": 7
        },
        {
          "body": "As someone who once got a retail job relatively quick and willingly worked there for over a year, I also thought they would be easy to get. But you make a good point about retailers being more interested in hiring those who take that kind of job seriously. That said, others on this thread are also right about how the retail companies themselves don't treat those jobs seriously.",
          "score": 8
        },
        {
          "body": "So, I understand what you mean. People do want someone who will stick around, but to be fair, who would want to?\n\nEven if you are 'a new entrant to the labor market', very few people see a physically demanding, low paying job with long or strange hours and thinks 'now THIS is a career!'. Its a job, there's a difference, you even mentioned how the people you rant about come from a 'career background', implying that retail/grocery/restaurant is not a career itself. \n\nIt seems to me its more about who can ***act*** like home depot \\[for example\\] is the real job/career than those who actually believe it.\n\n'They are looking for people who will stay at least 6 months to a year', that's not that long, and that along with the fact that management is judged based on turnaround proves that even they think it is a job and not a career.\n\nI **absolutely** agree that you should not have an attitude if you have to work a job that you ***perceive*** to be lesser than the one you worked before, especially when it comes to criticism, but I disagree with not hiring people who don't show up and act like it is their destiny to stock shelves, operate a cash register, etc.\n\nIf they want people to treat those jobs like careers, then they need to improve the pay, or make it possible for those who DO work hard to advance and go into better paid positions. Until then, they will likely continue to get treated as stop-gap jobs.",
          "score": 27
        },
        {
          "body": "I recently had an interview with some marketing scam operation. I never turn down a chance to interview and it wasn't obvious at first, but once I realized it was a scam, I decided to show up for the video interview to see what would happen. It's free entertainment.\n\nSure enough, it was a cattle call with multiple perspective victims listening to a marketing pitch. I did my best to come across as an eager beaver, ready to take on new opportunities. At the end of the call, they promised to call back everyone they thought had the strengths they were looking for to move onto the next step.\n\nThey didn't call me! 🤣\n\nEven a boiler room outbound call center selling questionable investments by telephone is passing on me. I laughed my ass off.",
          "score": 4
        },
        {
          "body": "Ha not just office workers.  I have always worked physically demanding jobs, worked my way into a very rewarding career in analyzer technician, walked out of a toxic workplace and now can’t find anything.\nSo it’s not just office workers these entry level jobs won’t hire it’s anyone who has had a better job.",
          "score": 5
        },
        {
          "body": "So people who are “overqualified” are just suppose to drop dead and starve if their circumstances have changed.",
          "score": 4
        },
        {
          "body": "You’re right.\n\nI have worked in both and that’s pretty much it. The only way to get a job in this case is to build a physical relationship as in go in person, make your case, and show them you want the job.\n\nSitting back to apply and complaining they aren’t hiring you won’t work for non-wc jobs.  ",
          "score": 2
        }
      ]
    },
    {
      "title": "How do you leverage your chances of getting an interview and getting hired for entry level jobs?",
      "body": "Jobs such as McDonald's, Walmart, Staples, Home Depot, Target. This is what I mean by entry level, no high income skills needed. How do you leverage chances of getting hired? These jobs typically have store managers who don't seem like they care for the job themselves, so how can I leverage? Are they required to hire a certain amount of people a year? Do I use a false resume for experience? Do I leverage using availability? Are these things that a minimum wage manager would be interested in? I don't know if I'm making sense, I'm typing this fast.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1lexk5k/how_do_you_leverage_your_chances_of_getting_an/",
      "comments": [
        {
          "body": "i say i have open availability then request a non-openly available schedule about 2 weeks in because of \"personal Issues\". with those jobs they wanna be able to use you as much as possible.",
          "score": 2
        }
      ]
    },
    {
      "title": "I got a JOB!!!!!!!!!!!!!!! 93 days ",
      "body": "Okay so I got a JOB!!!! I am so very $#$#ing excited!!!! \n\nThis is really for everyone out there that is so beat down, discourage, frustrated, feel like you're losing hope. I know how damn tough it is out there. The job I got is something, contract, good potential and it sure beats not working. It's not perfect. Some of you have been looking much longer than I have. I am sharing this, and hopeful it will give you some hope.\n\nTook me 3 months, and it's just gotten DARK these last few weeks. \n\nWhat I did:\n\nI don't even know about the several hundred applications I applied to. I heard nothing back from them, except a few rejection emails. I applied through LinkedIn, Monster, Glassdoor, friends recommendations anything and everything else I could get my hands on. I even applied to Home Depot and Lowes and nothing. I feel like I got real lucky, this was my 3rd interview, and thankfully I got it. Out of the hundreds (don't think I hit 1000) of applications, I had 3 interviews. I have 9 years experience in this field, 33 years working total. This is without a doubt the toughest market I can remember. This was a recruiter that works specifically with this company, job is not listed anywhere else. So that's how I got in. \n\nI know it's easy for me to say keep your chin up, keep moving forward, and I know how hollow those words sound. FWIW, my heart goes out to each of you that have been desperately looking for work. It has been SO frustrating talking with people who are working, and are just clueless. This whole experience has really changed me, and I am just so thrilled I can't even put it into words, how thankful I am to have work i.e. a paycheck again. I hope I NEVER EVER take for granted work again.\n\nFist bump to all my soldiers out there, for real you all are my heroes. ",
      "subreddit": "jobs",
      "score": 96,
      "url": "https://reddit.com/r/jobs/comments/1gc2ntk/i_got_a_job_93_days/",
      "comments": [
        {
          "body": "Congratulations 🎉",
          "score": 3
        },
        {
          "body": "Congrats I’m on month 4",
          "score": 2
        },
        {
          "body": "Congratulations",
          "score": 1
        },
        {
          "body": "Congrats!!",
          "score": 1
        },
        {
          "body": "I wish I could be that excited about my job...what will you be doing? Good pay?",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": -15
        }
      ]
    },
    {
      "title": "Is the hiring market really this bad",
      "body": "Hi everyone,\n\nBackground: I graduated with a bachelor of cybersecurity in May of 2024. Have 2+ years in manager positions in retail environments, and 3+ years in customer relations and sales. I've done a lot of self Led learning in VS professional, github, and other application building platforms, and I have a firm grasp and understanding of object-oriented coding languages (C#, Java mostly). And this I'd mostly well displayed on my resume. I'm currently working as a substitute teacher and have been since January 2024. I am now also a soccer coach at the school I work for. I also worked as a permanent substitute for an English class (basically a teacher, except I would get my lesson plans from other teachers in the department)\n\nExperience &amp; Questions: Since about 2 months  before my graduation date, I've been applying to jobs. I started with entry level and intermediate jobs in Cybersecurity, and software development,  after about 4-5 months of applications with no responses I revamped my resume and kept applying, repeated this a few times during the 4-5 month stint. After this, feeling pretty bummed out, I took a break and enjoyed myself a bit and did some research onto the market, talked with professionals, etc. I didn't stop applying. I just slowed down (from 100+ applications a month, to maybe 50 a month). After 2-3 months of that, I again viciously began applying to a diverse range of jobs, from sales to finance to tech to mechanic work, etc. I've even applied to jobs at Wal-Mart and  home-depot. After all of this I have in total received 1 interview, 1 job offer (home depot), and like 3 interest  messages (letting me know they'd like to schedule an interview, then ghosting). I'm not in an ideal location by any means, rural southeast USA, but the market can not be this bad? I'm Hispanic and White (father born in cuba, but migrated here when he was 2) . I mostly put Hispanic on my resume. I have a resume set with keywords for markets in project management (A heavy reach), Cybersecurity (slight reach without certifications), Software Development (dying market), Sales Management (pretty large market, and decent experience), and Finance (in the process of getting  my SIE independently). Has anyone had similar issues? Am I doing something wrong, or is the market just looking like this for a lot of recent college grads??\n\nUpdate:\n\nThings holding me back:\n\nI'm married, and my wife is a full-time teacher and coach, so I'm attempting to start my career in a way so as not to uproot our family.\n\nI'm willing to commute up to 1.5 hours if the job is good enough (60k+ with options to grow), which would allow me to commute to some larger cities in the area, but unwilling to relocate.\n\nI tend to get nervous on phone calls and feel like I'm always out of breath. I also tend to lose track of thoughts because I'm nervous.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1i8mlwc/is_the_hiring_market_really_this_bad/",
      "comments": [
        {
          "body": "The problem with a cyber degree is that security isn't an entry-level field. Even with certs you need IT or SWE experience before you have a shot, and SWE is pretty much a no-go without a CS degree. Your best bet is to set your sights a little lower and start out with an entry-level IT job and work your way up from there.",
          "score": 3
        },
        {
          "body": "Honestly your resume may be the problem. It sounds like you’re casting a wide net with a single resume. Instead try to make a fine tuned resume for each industry you’re applying for. I’ve worked in Project management, data analytics, and now financial security and there’s very specific skills each industry is looking that won’t be included unless your resume is catered towards it. \n\nIf you include too many unrelated skills, they may look over you too. When I was looking into PM jobs, I got type casted as someone too data heavy and got more interest when I rewrote my data analysis experience to focus on how I managed the data projects with a PMP framework. I started talking their language and got more interest. People are intimidated by what they don’t know.\n\nEntry level jobs are hard to come by but they’re going to look over a candidate whose resume is all over the place compared to the candidate whose experience directly aligns with the job posting.\n\nTLDR: make you’re resume more specific to each job/industry and remove anything unrelated",
          "score": 2
        },
        {
          "body": "Terrible",
          "score": 0
        },
        {
          "body": "healthcare is hiring like crazy",
          "score": -1
        }
      ]
    },
    {
      "title": "Anyone have any idea if this is a scam?",
      "body": "",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1iurypk/anyone_have_any_idea_if_this_is_a_scam/",
      "comments": [
        {
          "body": "It’s a scam.",
          "score": 4
        },
        {
          "body": "Yeah, that email is spammy. Also, I've never heard of any recruiting agencies that confer with each other to recommend candidates to employers.",
          "score": 2
        },
        {
          "body": "Definitely a scam. I received this text message every other week. The only difference is my is Walmart and Amazon.",
          "score": 1
        },
        {
          "body": "It obviously is",
          "score": 1
        },
        {
          "body": "It's pretty obvious",
          "score": 1
        },
        {
          "body": "If it sounds too good to be true, it probably is",
          "score": 1
        },
        {
          "body": "The email address gives it away OP.",
          "score": 1
        },
        {
          "body": "I think the bigger issue here is the 191 unread!!!",
          "score": 1
        }
      ]
    },
    {
      "title": "The black hole of unemployment",
      "body": "Left my 14 year strategic account manager role in the pallet management industry for a director role at a smaller expanding company, three months in and my old job found out about my new position and threatened legal action for violating a non-compete i signed in 2011.  My new company assured me they werent a competitor.  My old job never backed off, it turned into a he said she said and my new company let me go in order to protect their reputation.  \n\nNow, I swear I'm at the event horizon here with searching for a job. I mean, at what point do you give up slightly and go bag groceries or home depot it? I see so many demoralizing posts that make it seem mathematically impossible to even get a company to respond, much less offer an interview. I'm 0-75 right now, still have a bit of positivity left in the tank, but damn its hard.  I've been blacklisted from the only industry i have experience in.  in any new industry, It seems like if you dont match the requirements 100%, no one will give you a call.  Looking at reverse recruiting now but wondering if its worth it.  Is there any hope in getting a sales/am job in a new market category?\n\n",
      "subreddit": "jobs",
      "score": 8,
      "url": "https://reddit.com/r/jobs/comments/1i85brb/the_black_hole_of_unemployment/",
      "comments": [
        {
          "body": "Have you talked to a lawyer? I’m sorry this happened. F your old company. Enforcing noncompetes is pretty illegal.",
          "score": 5
        },
        {
          "body": "Sadly i feel your pain ,im 55 and i may never work again i have applied for hundreds of jobs and 2 interviews .I want any job just to get back into the rat race .I look at hardware stores as i was i construction for 30 years and while  have a lot of experience they seem to just hire under 25 year old's .I live in the southern hemisphere .Life is starting to become uncomfortable .",
          "score": 2
        },
        {
          "body": "why were you blacklisted?",
          "score": 1
        },
        {
          "body": "Sorry for what happened with you, this is hard, but if you would consider a reverse recruiter, I provide job searching and reverse recruiting services not only by writing resumes or searching and applying for jobs but also by providing many services such as:\n\n* Career Research for Job Seekers in Their Industries, Sectors, Companies, Career Roadmap, Roles, and Skills Assessments.\n* Resume Reviewing, Writing, &amp; Rewriting.\n* Cover Letter Writing.\n* LinkedIn Profile Optimization &amp; Continues Improvement.\n* Job Boards, Portals &amp; Websites Accounts Creation &amp; Profiles Optimization.\n* Job Searching &amp; Applying.\n* Professional Networking \"building a high-quality Professional Network within related Industry and Sector(s) and connect you with Industry Leaders, Decision Makers, Recruiters, and Hiring Managers\".\n* Landing Interviews.\n* Interview Preparation.\n* Salary Negotiation.\n* Hidden Job Market &amp; others.\n\nPlease look at my Reddit profile shared URLs, especially my LinkedIn profile featured section for the service general explanation and 3 case studies.\n\nYou also do your research to find out all the information you need to be fully aware of what it is. Please, don't hesitate to DM me, reach out, and ask any questions or concerns you may have.\n\nI wish all the best for you.",
          "score": 1
        }
      ]
    },
    {
      "title": "How do part time jobs work?",
      "body": "I’m searching for a part time job as I’m starting college but I’m a little confused. I’ve never applied for a part time job before. \n\nI’m looking at places like the Home Depot and Lowe’s and supply stores to be a stocker or something simple like that that I feel most people would be working part time doing.\n\nUpon looking I see job listings for things like cashier and shelf stocker but they are being listed as full time and there’s no way in the application to specify otherwise. \nWould I apply and then if I landed an interview that’s when I would mention part time or is it not worth the time if it’s being listed that way or idkkk. I’m just a little lost, I thought finding a part time job would be like, super easy and I’d find them everywhere but that doesn’t seem to be the case. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jn8yye/how_do_part_time_jobs_work/",
      "comments": []
    },
    {
      "title": "Why do jobs make it hard to get an interview?",
      "body": "I applied to home depot about a 2 weeks ago. I started to call to follow up on my application a week ago and everytime I call they send the call to the HR office and no one answers.  Today a member told me that they don’t have HR right now and that the only way to reach out to follow up is nobody lol. They said that i would get an email. No emails, No updates from anyone. This has happened with Costco too. it’s kind of annoying how jobs act like this, they make it difficult just to talk to someone in charge of hiring. I guess no one wants someone that is very interested in a job.  ",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1dsxypk/why_do_jobs_make_it_hard_to_get_an_interview/",
      "comments": [
        {
          "body": "If there’s one slot available there will be 500+ applications for it.",
          "score": 5
        },
        {
          "body": "You're the one making it hard. The extra work of calling people is not only slowing it down for you, it slows it down for everyone, because instead of devoting resources to assessing applications and calling people for interview, they're having to spend time taking your calls and telling you they'll get back to you.\n\nJust apply and wait. If they're interested, they'll get back to you.",
          "score": 4
        },
        {
          "body": "They don't want to field app status calls.\n\nI have worked a couple.of retailers and when answering phones we were road not  to contact a manager about application  statuses. People called all day for them.",
          "score": 2
        },
        {
          "body": "Definitely just keep applying. Amongst my hundreds and hundreds of currently pending applications I’ll find one here and there that really excites me and then a month or two ends up passing. But if you constantly apply you’ll come across another one that’s even better that will fill that void. Just keep going. It’ll devour your soul but something will eventually land lol. Good luck.",
          "score": 2
        }
      ]
    },
    {
      "title": "21 years old college dropout, haven’t found a job since.",
      "body": "So I have been on the job hunt for 4 months now. I realized my degree has no value and that I should just start working instead of wasting my time in college. I was a business major. I’ve lost count of how many jobs I’ve applied to, probably over 100 atp. I’ve applied to Academy, Home Depot, and other entry level jobs. I get interviews but 0 callbacks. I come into the interview, prepared, presentable, yk the drill. And still I lose the job to some guy who shows up to an interview in crocs. Wtf is going on 😭😭😭",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1g2hmt7/21_years_old_college_dropout_havent_found_a_job/",
      "comments": [
        {
          "body": "Maybe that degree isn’t the waste of time you think it is.",
          "score": 1
        },
        {
          "body": "Maybe you should start showing up in crocs and a golf shirt and acting like I COULD GIVE A FUCK ABOUT YOUR STUPID JOB; sadly in the modern day you’ll probably be general manager of that home depot in like 9 months lol",
          "score": 1
        },
        {
          "body": "Well your post here has a negative and cynical tone. Is that the vibe you’re giving off at the interview? Most of retail and unskilled labor is just attitude, so if you sound defeated before you’re even hired, it’d be a huge no from me, too.",
          "score": 1
        },
        {
          "body": "That guy is related to someone at the store. \n\nIf you can, go to a2 year tech school for welding, plumbing, HVAC, phlebotomy, radiography, basically anything that takes human hands to do.",
          "score": 1
        }
      ]
    },
    {
      "title": "I can’t find a job anywhere. Is it me, or something else?",
      "body": "I graduated from college with a bachelor’s in biology in May. My aim is to go into graduate school, but right now I need something that can pay rent. Unfortunately, there’s pretty much no research jobs hiring where I live, so I’ve had to expand to everything else—retail, customer service, food service, whatever—which is no big deal, I have retail experience and everything… except I still can’t find anything. We thought it might be that they think I’m overqualified, but taking out the part of my resume focused on my lab experience and whatnot hasn’t helped at all. Of all the jobs I’ve applied for, I’ve had three interviews, no offers. A lot of jobs immediately reject me—most just ghost me entirely. I WAS offered a job at Home Depot, and I went in to finalize the offer, they said the manager would call me back… they never did, even after repeatedly calling and the store saying they’d leave a note for the manager with my contact info and everything.\nMoney is getting tight and I’m getting desperate. Having nothing to do during the day is driving me insane. I look online to see if anyone else is struggling with the job market, but posts like that seemed to stop showing up around June and July, which makes me worried that the reason I’m not getting a job is because of me—but I have no idea what I’m doing wrong.\nI don’t know what I’m looking for—reassurance that it’s not just me having a hard time, or suggestions on how to change my approach. The best I can think of is that I should be sending a cover letter with every single application—I haven’t really been doing that, admittedly, but I wonder if I should—would it make a difference? I don’t know if the kinds of jobs I’m applying for really require something like that, or if they’d even look at them. I’m literally willing to grovel at the feet of any place that would hire me, I’m getting that desperate.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1ex2m51/i_cant_find_a_job_anywhere_is_it_me_or_something/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "yeah bro it fuckinf sucks",
          "score": 1
        },
        {
          "body": "It's hard to tell from a reddit post if it's you or something else.  I tend to blame the job seeker but that's because of my personal experience and I'm possibly an outlier. Reddit  isn't a snapshot of reality in general on this sub it's a collection of younger people without a clue how jobs work,people stuck with a worthless degree and people who apply to 1000s of jobs without being qualified or researching those jobs. \n\nMyself I haven't been unemployed for more than 2 months.\n\n\nLayoffs #1 in December 2006, I had a part time job for 3 months,  and then landed something full time. \n\nJob Elimination in 2017 in early August, by mid August I had another Job.\n\nTerminated June 2024 - 4 applications later and Mid August I started a new job.\n\nThis is a similar trend in my friend and social group.  We for whatever reason are able to find jobs when we need them. I guess that's what happens after 20+ years doing something. \n\nBut I will tell you that IMO quantity of applications doesn't mean quality.  I'll look at 30 jobs and filter it down to 3 or 4 that I'm confident in I won't just throw 1000 blunt tip darts hoping it sticks I'll throw 5 sharp darts and know one will stick.",
          "score": 1
        },
        {
          "body": "yeah it sucks just know you're not the only one",
          "score": 1
        }
      ]
    },
    {
      "title": "Is it normal for them to call you later when you finish final interview?",
      "body": "      I just finished a final One-one interview in person at a Verizon store. They gave me a lot of positive feedbacks and just some minor feedbacks (my first real job moving from Home Depot and working at a small restaurant) from my answers but i guess it a courtesy right? Doesn't mean they like my answers.\n\n\n     l asked them a lot of questions in the end showcasing that I want to have a career with them not just a get by job (it is true because I love Verizon and I'm a tech nerd so working there and getting discounts is a no brain for me) and they really amazed abt my questions.\n\n\n     They said they will call back as they are still doing interviews for the rest of the week and they even mention they need this retail position to fill fast. As my experience from a year long of not able to secure a real job and multiple fails, does that mean I won't make it? * I dont have any hope left in me and now I doubt my abilities to even get a job at this point. I even have BA in Marketing\nUsually you will have an offer right after if they decided to move on with you so l'm just curious if this is like a thing for big corporate or I'm just a sucker.\n\n\n    Through out the interviews, I feel like they really interested in my answers but it could be because its their job to not show they \"not interested\"\n\n\n\nAnyone ever interviews at Verizon??\n\nSry for long rambling but I’m just so desperate right now with no jobs 😥😥 need so let out some steam 😣",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1eup7xs/is_it_normal_for_them_to_call_you_later_when_you/",
      "comments": [
        {
          "body": "I don’t get a call for a week or two. Especially if they have more interviews",
          "score": 2
        }
      ]
    },
    {
      "title": "I don’t understand where I’m going wrong.",
      "body": "Hi everybody. I genuinely apologize in advance for this, but I have no idea who else to turn to. I don’t know what to do. I lost my job in March and have been desperately applying to anything I can. I keep getting to third round interviews, and I never get the job. I have 3 years of luxury real estate marketing experience and have been applying for similar positions. I’ve even applied at McDonalds, Home Depot, Grocery Stores, mom and pop shops, janitorial positions… everything. McDonalds told me the other day that I wasn’t qualified to work there. I’ve been depressed because of that. I feel like such a loser. Not only can I not get the job I spent $60,000+ to get, along with legit certifications and proven knowledge of what I do, I can’t even get a job at McDonald’s. I want to give up. I have been working every day to learn new skills to make myself marketable and nothing. I just keep getting rejected. My credit score is trash. I lost my home. I can’t even put an address on my applications because I’m homeless. I just hate my life and I hate myself for allowing it to get here. I keep waking up at 5:00am and fill out applications until 8:00 pm. All day every day. The constant rejection is getting to me, I’m desperate for any sort of income, and idk what else to do to make myself more marketable. I don’t know how much more I can take. Any suggestions for a job, whether it’s a retail place I missed, being a waitress, idc at all. Please give me ideas on any sort of employment I could do. I’ve given up applying for marketing positions. I think I’m just meant to be a dishwasher or something. I’m homeless, broke, and lost everything. I have nothing to lose. Thank you for taking the time to read this.",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/14xommj/i_dont_understand_where_im_going_wrong/",
      "comments": [
        {
          "body": "What McDonald's meant is you are overqualified. Don't let that get you down.\n\nYou don't need an address for apps - just use a hotel address. Noone is looking up your address to see where you live.\n\nHonestly my suggestion is you take a day off from applying... I don't know where you are/what you can do, but just taking a day for yourself to stop &amp; breathe would do you some good. You WILL find something in time but allowing yourself to be consumed by stress is only going to make doing interviews harder. Moreover, applying to too many jobs a day means you aren't able to apply with thoughtfulness &amp; care.\n\nIt sucks so hard having no support, I struggle with that a lot myself. I heard someone say that we look for capable hands to catch us when we fall, but the only capable hands can come from above. People are just flawed and stuck in their own miserable realities. What I guess I'm trying to say is. Don't give up, I don't think God will let you down :)",
          "score": 9
        },
        {
          "body": "Do not give up. That is not an option. Call your local state representative, tell them what's going on and ask if they can help. I was in a similar situation as you and in desperation called my rep. They were actually excited to help me, and they did.",
          "score": 4
        },
        {
          "body": "I am so sorry. See if there is a local employment aid agency near you- we have ones in my city that work with low and no income individuals to prepare for interviews, transportation, etc. Unfortunately the lack of address may be giving a red flag- is there a relative of friend’s address you can use?",
          "score": 1
        },
        {
          "body": "Why did you lose your job in March?  What is your job/industry you are seeking?",
          "score": 1
        },
        {
          "body": "McDonalds is not going to hire someone with your skill set, knowing you are going to leave the second you get a \"real\" job.\n\nTHEY are telling you your value. You need to start listening.\n\nGo look up the \"Knockem Dead\" books by Martin Yate. They are THE bible for job searchers. He will help you find the job of your dreams. He has done it for me, a number of times.",
          "score": 1
        },
        {
          "body": "I am an IT manager who hires people. If you want me to look over your stuff feel free to shoot me a message. I'm not in the luxury real estate business but I can probably give you some tips/pointers.",
          "score": 1
        }
      ]
    },
    {
      "title": "Data Analyst Interview Case Study, Home Depot",
      "body": "Has anyone interviewed at Home Depot lately for data analyst or data scientist position?\n\nWhat does the case study part of the interview entail? What are the expectations? \n\nAnd what should one expect in the in person interview? including interviews with hiring manager and higher ups.\n\n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1n8ruag/data_analyst_interview_case_study_home_depot/",
      "comments": [
        {
          "body": "Home Depot's data analyst case studies typically focus on retail analytics scenarios like customer segmentation, inventory optimization, or sales forecasting. You'll likely get a dataset related to store performance, seasonal trends, or customer purchasing patterns and need to extract insights, identify problems, and propose data-driven solutions. They want to see your technical skills in SQL, Python, or R, but more importantly, how you translate numbers into business recommendations that make sense for a retail environment. The case study usually takes 2-3 hours and you'll present your findings to the panel.\n\nThe in-person interviews are pretty standard but expect questions about handling large datasets, working with cross-functional teams, and understanding retail metrics like same-store sales growth or inventory turnover. The hiring manager will focus on your analytical approach and communication skills, since you'll need to explain complex findings to non-technical stakeholders. Higher-ups typically ask about your long-term career goals and how you'd contribute to Home Depot's digital transformation initiatives. The whole process can feel intense because they're serious about finding someone who can handle both the technical demands and the fast-paced retail environment. I'm on the team that built [interview AI helper](http://interviews.chat) to practice articulating your analytical thinking process and nail those tricky technical questions that come up in data roles.",
          "score": 2
        }
      ]
    },
    {
      "title": "Home Depot interview help",
      "body": "I finally got a interview at Home Depot, but I’m scared of not getting it bc I suck at interviews idk what to expect. my last job just hired me on the spot no questions asked that’s why I even got the job lol does someone know what questions they might ask (got the role of customer service) and also do you guys now the starting pay they told me 16 but I don’t want to get underpaid :/ and idk how to bring it up plz give me tips help me out (have it in 3 days) thanks guys!\n\nUPDATE GOT THE JOB😜 thanks guys !",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1lymmmh/home_depot_interview_help/",
      "comments": [
        {
          "body": "How many times have you thoroughly reviewed potential interview questions? How many times have you meticulously crafted a response when they ask, “So, tell me about yourself?”\n\nThe answer to all of these questions should be numerous. Practice and rehearsal are essential. Through these practices, you can transform from feeling unsure to confidently answering all their questions on the spot.",
          "score": 1
        },
        {
          "body": "Home Depot interviews for customer service roles are pretty straightforward - they'll ask about your availability, why you want to work there, how you'd handle difficult customers, and give you scenarios like \"what would you do if a customer couldn't find something.\" They're looking for people who can stay calm under pressure and genuinely want to help customers, so focus on examples where you've solved problems or dealt with frustrating situations. The fact that you're worried about doing well actually shows you care, which is half the battle.\n\nAs for the $16 starting pay, that's actually competitive for retail customer service in most areas, but you can absolutely ask about growth opportunities and when pay reviews happen during the interview. Don't negotiate the starting wage unless you have specific retail experience that justifies it - instead, ask about advancement paths and how quickly people typically move up. The key is showing enthusiasm for the role and demonstrating that you can handle the chaos of retail customers asking where the bathroom is for the hundredth time that day.",
          "score": 1
        },
        {
          "body": "What type of questions did they ask you? I have an interview tmr at 9am I’m freshly 18 leaving my other retail job I’ve had since I was 16, and homedepot seems like the big leagues 😂",
          "score": 1
        }
      ]
    },
    {
      "title": "A interview at Pizza Hut(but wanting 2 jobs)",
      "body": "So I recently quit my job at a fast food place due to very poor management and being burnt out. I have an interview at Pizza hut for a driver position but how would I tell them that I need to be strictly either days or night due to hopefully having a second job at home depot? Would they still hire me ?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/iol3e3/a_interview_at_pizza_hutbut_wanting_2_jobs/",
      "comments": [
        {
          "body": "They just need someone with a car. Just say you have online school during those times.",
          "score": 6
        }
      ]
    },
    {
      "title": "So I just did a virtual interview for the Overnight Freight Team (part-time) position at Home Depot.",
      "body": "Backstory: I had another virtual interview on Aug 29th for the same position but at a different location. That recruiter said he liked me and scheduled me for an in-store interview right away. The in-store interview went well—the supervisor also said he liked me and even mentioned that as far as he was concerned, I was the only candidate being interviewed. He told me I had great experience and basically said if anyone was getting hired, it would be me. He also mentioned he had only found out 20 minutes before that he had to interview me.\n\nAfter the interview, I asked when I’d hear back and he said by the following Monday (Sept 8th) since HR was on vacation until then. But Sept 8th came and went with no follow-up. The next day I got an email saying I wasn’t selected. I called HR to see if I could get some feedback but never got through, so I left a voicemail—no response.\n\nFast forward to today’s interview: it was another virtual one. This time, unlike the first recruiter who immediately scheduled me for the in-store interview, the recruiter today just said she’d forward my info to the store and I’d hear back in 2 business days. Honestly, I don’t believe that because the first recruiter moved me forward right away. I kind of felt like she just wasn’t interested in me.\n\nHas anyone else experienced this with Home Depot interviews? Do recruiters actually differ in how they handle scheduling, or is this a bad sign?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nkk2r7/so_i_just_did_a_virtual_interview_for_the/",
      "comments": []
    },
    {
      "title": "DH interview  Home Depot",
      "body": "Just got done with my interview for DH position at Home Depot. How long is the wait for ASM get back to you?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1kn12fu/dh_interview_home_depot/",
      "comments": []
    },
    {
      "title": "Home depot store manage interview tips",
      "body": "I’m terrible at interviews. Is there anyone that can give me any hints tips or questions that might ask or focus on ?",
      "subreddit": "interviews",
      "score": 34,
      "url": "https://reddit.com/r/interviews/comments/1gnk9r2/home_depot_store_manage_interview_tips/",
      "comments": [
        {
          "body": "The key to a successful interview (any interview) is being relaxed and personable. Here is some HD specific interview info:\n\nhttps://www.glassdoor.com/Interview/The-Home-Depot-Store-Manager-Interview-Questions-EI_IE655.0,14_KO15,28.htm",
          "score": 1
        },
        {
          "body": "Man interviews are tough, I always get super nervous too. One thing that really helped me was practicing answering common questions out loud, you can find lists of them online. Oh and there's this cool AI tool called Acedit that gives you tailored responses based on the job description, could be worth checking out if you want some extra practice. But yeah just try to stay calm and be yourself, they're just trying to get to know you.",
          "score": 1
        },
        {
          "body": "Use chat gpt. It's incredible for interview prep. Tell it what the job is, and ask it for interview questions and then feedback on your answers. Turned me into an incredible interviewee",
          "score": 1
        },
        {
          "body": "Interviewing into a manager position at a place like Home Depot is super difficult. Most managers at places like Home Depot started from the bottom and worked their way up into a managing position.",
          "score": 1
        },
        {
          "body": "I mean this in the nicest way possible, but are you sure you are qualified for the position youre applying for? If you are interviewing for a store manager position with easily 40+ employees, I would hope you’ve been in a similar position before? Even when I was just an Assistant Manager at two different companies, I was in charge of applications and first interviews. If you’ve been in similar positions youre applying for, I would hope you’d know what to expect.",
          "score": 1
        },
        {
          "body": "Focus on these key areas:\n\t1.\tKnow Home Depot’s Core Values: Emphasize customer service, teamwork, and leadership in your answers.\n\t2.\tBe Ready for Behavioral Questions: Use the STAR method (Situation, Task, Action, Result) to answer questions like:\n\t•\t“Describe a time you motivated a team to achieve a goal.”\n\t•\t“How have you handled conflict within a team?”\n\t3.\tHighlight Leadership and Operational Skills: Share examples of:\n\t•\tDeveloping team members for promotions.\n\t•\tManaging inventory and reducing shrink.\n\t•\tImproving sales or customer satisfaction.\n\t4.\tPractice Clear Communication: Rehearse your responses to build confidence.\n\t5.\tAsk Thoughtful Questions: Show interest by asking about challenges or success metrics for the role.\n\n\nHope this helps some.",
          "score": 1
        }
      ]
    },
    {
      "title": "Home Depot SQL interview",
      "body": "I know this is a bit late but I have a SQL interview tomorrow. Would love to know the type of questions they cover and the difficulty level.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1eqvpn9/home_depot_sql_interview/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Hello! I actually have a SQL aptitude test with them tomorrow and curious how it went and how difficult it was? I've been stressing hard since Friday and spent all my available time studying and prepping lol",
          "score": 1
        },
        {
          "body": "I have one. Also how did yours go?",
          "score": 1
        }
      ]
    },
    {
      "title": "Home depot interview tips",
      "body": "I got an interview with 2 Senior managers for 45 mins for the Sr.analyst role at home depot. I am told to prepare for behavioral in STAR format. I would like to learn more about the process from anyone who gave an interview for this role. I would like to know the next steps in this process. How hard is this going to be?",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/ncuurx/home_depot_interview_tips/",
      "comments": [
        {
          "body": "Not hard at all. Pretend like you’re telling a friend about a situation that came up at work and how you solved it / attempted to solve it. \n\nThey’ll be evaluating you on things like: your critical thinking during the crisis, your ability to work with others to solve the problem, and your demeanor / behavior throughout the process.",
          "score": 3
        },
        {
          "body": "I would recommend the STAR method on how to format your answers to make them clear and concise but also relevant to the role. You could ask your recruiter as well if they have any recommendations on what to expect/how to prepare.",
          "score": 2
        }
      ]
    },
    {
      "title": "Strangest interview ever",
      "body": "So, I had an interview today. Not a biggie.\n\nMost of the interviews I’ve had with big companies like Lowe’s, Home Depot, Walmart, and a slew of others offering entry level roles just end up with either no feedback or the rejection email(used to be they would send an actual rejection letter to your residence, costing anywhere from $0.10 to $1.50).\n\nToday’s was with the onsite supervisor, and didn’t know where it was headed. Within about five minutes we were talking about places we lived my background and what our motivations were, stuff like that. It’s usually how I try to steer the interview. I thought it was actually going good.\n\nThen he tells me the two previous people that filled the position were older than he and couldn’t do the physical labor. They ultimately, wound up quitting. I kind of see his point.\n\nHe then explains that the next two questions are kind of important to him. Did you research this position and when was the last manual labor job I had. This position involved recapping tires. Not passenger car tires. So then he asks me if I would be able to do the job with the amount of physical activity.\n\nWell I don’t lie and try to be as honest as possible in everything. So from what little he told me of the job, I told him no. There are several reasons for what I answered. I’m having a small twinge in my back. Used to be I would have it and a week later it would sort itself out. I’m 63. He asked me. Yes I know. He was the kind of guy that would know BS when he heard it and act on it. So we were being honest and I probably didn’t get the job, and shouldn’t take it if I were offered it. I realized that as we were talking halfway through the interview. I’m not getting any younger, and I am not afraid of actual work. I realized I wouldn’t be there very long. However, this interview style, was he right in light of my age and shape? I had many physical jobs, unloading racks of 14400 panels each, about eight racks per shift, which took 15-20 minutes each. I sanitized clean rooms, in a production facility. Daily, weekly, monthly, annually. This was mostly ceilings, walls, and floors. No one wanted to do them, so I volunteered most of the time. So that was that.",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1noxtpu/strangest_interview_ever/",
      "comments": [
        {
          "body": "Wrong if he asked you your age directly or disqualified you based on your age. But if they didn't and just asking about recent experience and knowledge of role then he should be fine. \n\nIs there anything concerning to you about the style of interview or do you feel discriminated against due to age?",
          "score": 1
        },
        {
          "body": "You dodged a bullet. Good for you.",
          "score": 1
        },
        {
          "body": "Help us understand this - he asked if you could physically do the job and you said no, you could not.   If that is not the case, what advice can we try to provide?",
          "score": 1
        }
      ]
    },
    {
      "title": "Why would one recruiter fast-track me, but another just say they’ll ‘forward my info’?",
      "body": "Backstory: I had another virtual interview on Aug 29th for the same position but at a different location. That recruiter said he liked me and scheduled me for an in-store interview right away. The in-store interview went well—the supervisor also said he liked me and even mentioned that as far as he was concerned, I was the only candidate being interviewed. He told me I had great experience and basically said if anyone was getting hired, it would be me. He also mentioned he had only found out 20 minutes before that he had to interview me.\n\nAfter the interview, I asked when I’d hear back and he said by the following Monday (Sept 8th) since HR was on vacation until then. But Sept 8th came and went with no follow-up. The next day I got an email saying I wasn’t selected. I called HR to see if I could get some feedback but never got through, so I left a voicemail—no response.\n\nFast forward to today’s interview: it was another virtual one. This time, unlike the first recruiter who immediately scheduled me for the in-store interview, the recruiter today just said she’d forward my info to the store and I’d hear back in 2 business days. Honestly, I don’t believe that because the first recruiter moved me forward right away. I kind of felt like she just wasn’t interested in me.\n\nHas anyone else experienced this with Home Depot interviews? Do recruiters actually differ in how they handle scheduling, or is this a bad sign?",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1nkk5tf/why_would_one_recruiter_fasttrack_me_but_another/",
      "comments": [
        {
          "body": "Even if the recruiter said you're the number one candidate, there are so many variables that you can't take them at their word. You have to keep moving forward until everything falls into place. It just happened for me. When you're the chosen one, the process is blazing fast and smooth. All the best.",
          "score": 3
        },
        {
          "body": "I mean, is it a different recruiter with different processes?\n\nOr could it be that they know the first one wasn't successful so they're not promoting you as much as other fresh candidates?",
          "score": 2
        },
        {
          "body": "They're two different people\n\nHope that helps",
          "score": 1
        }
      ]
    },
    {
      "title": "What to wear?",
      "body": "What do you wear to an interview? Im talking like a waitress or like home depot? Im finding it near impossible to find something in my field and I'm willing to work just about anywhere but do I still dress up? Like do I need slacks and a button down blouse to be a cashier at home depot? Can I wear sneakers? Is that too informal? Help! ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1lq8a8v/what_to_wear/",
      "comments": [
        {
          "body": "If you have something more formal in your closet (I.e blouse and slacks) I would wear this! I think it’s better to be overdressed than underdressed and it shows that you take the job/interview seriously.",
          "score": 6
        },
        {
          "body": "you’re not dressing for the job  \nyou’re dressing to show you *give a damn*\n\nno need to go corporate  \nbut clean jeans or plain pants, simple top, no logos, closed shoes  \nsneakers? fine—if they’re not beat up  \nbutton-down? sure—but only if it’s comfy and fits\n\ngoal = look like someone they can trust with customers on day one  \nneat, sharp, no fuss  \nthat’s it",
          "score": 2
        },
        {
          "body": "No sneakers!\nWear nice slacks , and nice blouse, and if you have a matching jacket to pants !\n\nLook nice\n\nNot casual",
          "score": 1
        },
        {
          "body": "Always dress up",
          "score": 1
        },
        {
          "body": "You are judged alone by your appearance \nYou need to appear clean\nClothes clean \nEtc",
          "score": 1
        },
        {
          "body": "Can I wear a dress or is that too much? Crap! I dont even own an interview outfit. Im used to wearing scrubs lol. Its been a loooong time since I've had to do an interview.",
          "score": 1
        },
        {
          "body": "[https://albertandace.com/cdn/shop/articles/suit-up.jpg?v=1675092300](https://albertandace.com/cdn/shop/articles/suit-up.jpg?v=1675092300)",
          "score": 1
        },
        {
          "body": "Can't go wrong with business casual or business !!",
          "score": 1
        },
        {
          "body": "It really depends where you interview and where you live. But I will say the dress / suit from your last  wedding 15 pounds ago is bad. \nCamouflage  bad, ypu get the idea",
          "score": 1
        }
      ]
    },
    {
      "title": "interview help",
      "body": "I'll soon be having an interview at Home depot and would like to know some of the questions that I'll be asked. The position is for sales associate (although I don't know what department). Any and all advice is appreciated. Thank you",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/bcynfz/interview_help/",
      "comments": [
        {
          "body": "For that type of position, you might be asked how you might handle different customer service type situations. Think about times in the past you've solved problems or dealt with customers, even as a volunteer or student.",
          "score": 2
        },
        {
          "body": "Check on Glassdoor.com",
          "score": 1
        }
      ]
    }
  ]
}