{
  "company": "illumina",
  "post_count": 1,
  "exported_at": "2026-01-18T17:44:53.283Z",
  "posts": [
    {
      "title": "Out of work for 8 months. I am very discouraged and demotivated.",
      "body": "Hi not sure if this is the right subreddit.  I need advice or encouragement.\nBackground: I, 22 have 1st Class in Biochemistry. I graduated in 2021. Afterwards I worked in a mega lab processing COVID-19 samples for 6 months before I was made redundant in March. From then I have actively pursuing interviews, using the careers service from my university, refining my CV and cover letter. And to be completely honest I'm at my wits end. I sent so many applications that I've honestly lost tracked But it's definitely easily in the 60 range.\n\nI've been getting roughly of 1-2 interview per month at very good companies (Oxford Nanopore, Evotec, Illumina, University of Cambridge, Avator, GSK, Immunocore, Oxford Immunotec, Thames Water etc) And I get passed with the first interview stage, and during the second/third stage interview I usually prepare very well. As I've studied the job description along with the associated techniques and soft skills that are required in that job description. But not getting an answer or being rejected without explaining why I have not gotten the position is slowly making me lose iy and made me feel slightly depressed at times. Each application proceeds in the same way. I do a phone/video screen, they tell me there are still 2-3 rounds of interviews, I move on to the next round, I speak to someone, seems to be going well for me. I can't figure out exactly what I'm doing wrong. I'm not sure it's because of the way I speak (As I speak formally. And if I explain a idea Although it may take a bit of time to explain it I.e a maximum of two-three minutes the panel understood the concept/ I might stumble across my words. But this is something them actively trying to address). So I don't know what more can change.  I understand that I don't have an extensive employment history, which makes it harder to compete against the competition. I was considering going back to university or do volunteering but the problem of volunteering, for example, is that puts me in the worser financial position  And I cannot afford to work for free. I've also considered going back to university, but it also has its own issues in regards to do my Masters degree regarding my financial situation I am in and delaying the Inevitable.\n \nCurrently right now I'm living with my parents. And the ominous aspect of going through all of this during my early 20s is that. If I was suddenly unemployed in the future I'm not sure how I'm going to cope.\n\nAny advice or encouragement is appreciated.",
      "subreddit": "jobs",
      "score": 10,
      "url": "https://reddit.com/r/jobs/comments/xwo5b9/out_of_work_for_8_months_i_am_very_discouraged/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Hey there mate, I am in the same position that you are in, just in a different degree :)). \n\nI finished my studies this year and went on a holiday before graduation as a celebration with some mates of mine. Then I wanted to relax for a bit in August \"before I go into work\" (how naive I was lmao). It is now 3 months later and I am in the same room as you are, it is a pain applying for jobs, being rejected or being close to getting a job or rejecting it as you feel it isn't right for you. This hurts, even more, when you have some friends that did not go to uni (nothing wrong with that) and have been working since we left college back in 2019 so they do things that are quite expensive or get to a point that it is. So it is a pain when they want to do a million things (I would too) but you don't have money to do those things and either create excuses or ask for some help from parents (I hate it). I am super lucky that I have great parents that are there for me and not pressuring me to get into a job as soon as possible.\n\nHowever, I still hope that one day and HOPEFULLY SOON! that we can start our careers. Throughout this time, I realised why this is such a depressive period in our lives and that is because we are so used to going into the next step that is planned for us i.e going to school and uni for 20 years and then we are left to fend for ourselves. Just know that you are not alone in this and that millions of people are either going through this now like us or have gone through this period before. It is a pain in the ass, but soon enough we will get what we want, unfortunately, not everything can be straightforward for us, some people are able to start their careers straight after uni and some (like us) take time to get started on one. \n\nYou've got this bro!",
          "score": 3
        },
        {
          "body": "I don’t have any advice, but I really hope you get a job and I hope life gets better for you VERY SOON 🥰",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "Hi, I was also in the same position with you for months. Graduated August last year (MSc Data Science, did it part time) and I quit my previous job in November to change field and wanna start my career as a data science/analyst (I was working as multimedia designer since 2017 after graduated from my Bachelor's Degree in Computer Science). \n\nI managed to secure three big freelancing gigs since December last year so I wasn't so rushed to apply for a new job. Not until July after I finished with all the gigs. I thought it's easy to start my career as analyst/data scientist with my master's degree but I was wrong. \n\nSince July, I've applied to more than 50 jobs and went to numbers of interviews, most of it I passed the first stage (usually they give you task to complete) and then got another 2-3 stages of interviews. I ended up not getting any offer although all the interviews session went well and the interviewers seemed to like me. Btw with my experience handling a lot of clients in five years working as multimedia designer for my previous company, I can say that I am a naturally good speaker and can connect well with people. So it's weird to not even get any offer and I become so frustrated, same like you right now. \n\nBut then two weeks ago I managed to land a job. Funnily, the hiring manager just interviewed me once, it was a short 20 minutes session and then I got the offer letter a week later. They even agreed to meet my salary demand without negotiating. \n\nI hope you can keep searching. I believe there will be a company that can see your value soon. Dont give up!",
          "score": 2
        },
        {
          "body": "You are not alone. I graduated last year and have been searching for 10 months now. I just recently got a rejection email for a job that I really wanted. It sucks. It really does. I like to remind myself that every rejection means a new direction to a new opportunity. Thinking like that is the only way I don’t fall into a hole of sadness. The job market has so much competition right now. Don’t sell yourself short during interviews! Be confident in yourself.",
          "score": 2
        }
      ]
    }
  ]
}