{
  "company": "jnj",
  "post_count": 3,
  "exported_at": "2026-01-18T17:44:53.285Z",
  "posts": [
    {
      "title": "Johnson and Johnson GOLD program ",
      "body": "Anyone did the JnJ GOLD program video interview? What was the questions and how was it? \nDo you recommend the program or is it not worth it",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1gm5mg4/johnson_and_johnson_gold_program/",
      "comments": []
    },
    {
      "title": "Johnson &amp; Johnson Technology co-op interview",
      "body": "Hi, has anyone done the JnJ technology co-op program? I was told by the recruiter that it will be a software engineering co-op, so what kind of questions should I expect during the technical interview? Would it be algorithms based?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/rdqqdj/johnson_johnson_technology_coop_interview/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Not sure if this is super helpful, but I did a JnJ industrial engineering co-op and other than some critical problem solving questions there was nothing super advanced. Obviously it’s for a different position then I was in so I can’t tell you what to expect",
          "score": 2
        },
        {
          "body": "I know this is a really old post but I finished a behavioral interview for this co-op almost two ago and haven’t heard back yet (wednesday will officially be 2 weeks). how long did it take for you to hear back from them? I wanna know if I just need to move on to applying for other jobs.",
          "score": 1
        },
        {
          "body": "hey, I know this is old but what was the interview like? I have one coming up",
          "score": 1
        }
      ]
    },
    {
      "title": "Stressed over a job I just started and getting offer from dream job (Johnson n Johnson)",
      "body": "Long story: I was in medical sales with a company. I worked nearly a year with them and wanted a new job. I put my application for a job with JnJ. During that interview process I got an offer with a different company and I took it. The jnj interview process was a total of two months long. 3 weeks into my new job jnj offered me the job but had no idea I just took a job. Jnj is my dream offer but they didn’t know I just took a job. I explained to my future boss at jnj that I just took a job because I wasn’t sure if they would extent an offer  and he said it’s fine. I’m scared it’ll look bad on a background check since it wasn’t listed on my resume that I just took this job couple weeks ago. Any advice would be beneficial I’m super stressed about the situation. The hiring process for the job I’m in now was 3 weeks. Jnj was 2 months long and my current job wouldn’t of allowed me to not make a decision for that long.",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/platah/stressed_over_a_job_i_just_started_and_getting/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Accept the jnj job but don’t give notice at your current place until you clear the background check at jnj",
          "score": 7
        },
        {
          "body": "A resume isn’t an accounting of every job you’ve ever done, and a standard background check doesn’t hunt down jobs you don’t list. \n\nAlso, you disclosed to JNJ and they don’t care. \n\nSo for multiple reasons, you’re fine to move forward with the JNJ job.",
          "score": 6
        },
        {
          "body": "I really appreciate this. I have never been put in a position like this. The salary was amazing and same with the benefits. Just hated I was in this situation",
          "score": 1
        },
        {
          "body": "Did the company you accept the offer from know you just took a job recently? If not what did you tell them/what did you do in that situation?",
          "score": 1
        },
        {
          "body": "Exact thing happened to me. I left a new job after 11 days and I start the job I really wanted on Monday. Sucked telling them, but I just told the truth - they weren't the only company I applied to and another offer with better benefits arrived. I didn't tell them it was a much more stable global company, I didn't want to hurt their feelings.",
          "score": 1
        },
        {
          "body": "The same thing just happened to me. I accepted a job about three weeks ago and was supposed to begin on Monday. Jnj verbally offered me a position this morning so I let the other job know immediately and obviously they’re bummed and wanting to counter, but jnj is my dream career.",
          "score": 1
        }
      ]
    }
  ]
}