{
  "company": "linkedin",
  "post_count": 52,
  "exported_at": "2026-01-18T17:44:53.286Z",
  "posts": [
    {
      "title": "Direct manager added me on LinkedIn after my interview...",
      "body": "So I've been going through interviews for a couple weeks for a new job. Started 2 weeks ago with the initial recruiter call. The next day I got an email saying they were moving me forward to the next round. This next interview was with the high up director for my field. Had that call and it went great and he did mention I was the last one they were interviewing for this role. That they had a good amount of candidates now they didn't need to do interviews anymore. He mentioned that the recruiter would reach out with next steps and mentioned the names and titles of who I would speak to next. About 20 min. after hanging up with him via Zoom the recruiter emailed me and said I'm moving forward and set me up with two different interviews on the same day. First was with two members of the current team I would work on (which went great) and then the next with my direct manager (who also manages the two I met with earlier that day, but this manager reports to the director I interviewed with second). All interviews went really well and my last one with the direct manager of my role mentioned they are all going to meet up the next late afternoon (yesterday) to talk through things. She also mentioned that the final step would 'most likely' be to speak with the chief in this field (highest up), but it sounded like this was maybe something they might bypass. It's now been two days since that interview and the director (who I met with second, the big boss) added me on LinkedIn yesterday, but nothing else. No email from recruiter or anything. Am I overthinking this or does this potentially mean I may get an offer? Or still in the running?",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1khb1vr/direct_manager_added_me_on_linkedin_after_my/",
      "comments": [
        {
          "body": "That’s a very good sign",
          "score": 13
        },
        {
          "body": "After a final stage interview last week someone from the company I'd be managing an account for added me on LinkedIn.\n\nI've never spoken to them, and they were not part of the interview process but they obviously have been told something about me.\n\nI'm not sure what to think of it, I'm trying not to be too paranoid about it and whilst I'm waiting to find out if I actually got the job I'm still applying to other companies. \n\nLinkedIn is just another way to get info on us I guess . \n\nHope we both hear some good news soon.",
          "score": 7
        },
        {
          "body": "Great opportunity to reach out using a LinkedIn message to thank them for connecting and tell them it was a pleasure to speak with them and learn more about the job opportunity. ",
          "score": 6
        },
        {
          "body": "Great sign! A LinkedIn add from a direct manager post-interview can mean they're leaning towards you. Perfect chance to shoot a LinkedIn thank-you message for connecting and express your enthusiasm for the opportunity. Cross fingers for good news soon!",
          "score": 3
        },
        {
          "body": "Definitely a good sign but I do want to throw my hat in and say that on 2 occasions I had the HM add me on LinkedIn after interviews just to receive an auto rejection a few days after. Reached out to both. 1 ghosted and the other helped me with black hole referrals. I felt terrible. I hope this isn’t the case for you but bullshit happens. Try not to overthink it.",
          "score": 3
        },
        {
          "body": "Happened to me too. It’s a good sign. It’d be awkward if you weren’t their top choice. In my case I did get the job and I start Monday. \n\nLike you I was a little taken aback by it. It felt very forward. But also honest in a very refreshing way. The rest of the process was just as honest.",
          "score": 1
        },
        {
          "body": "Could be a good sign. However, do you have any privacy settings on your profile? Sometimes people will connect with someone just so they can see their full profile.",
          "score": 1
        }
      ]
    },
    {
      "title": "We don’t reach out through LinkedIn after an interview right?",
      "body": "I wanted to send the person who interviewed me on Friday a short thank you message Monday just to be polite and keep myself more “in the running” for the second interview and I also had a follow up question about what taking call as an mri tech would look like in hospital… but I realized the emails with links to the zoom are from the general recruiter/HR of the hospital. They said the persons name I would be interviewing with but as far and contact info I have none… this person was easy to find on linkdin. I should probably just send my thank you message to HR right? Or say nothing and trust the process, sit tight, keep my ringer on for the next week?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1on5iqw/we_dont_reach_out_through_linkedin_after_an/",
      "comments": [
        {
          "body": "these thank you notes are a relic of the past. don't overthink it and get on with the rest of your day.",
          "score": 1
        }
      ]
    },
    {
      "title": "Those who got laid off within the last 2 years and haven't been able to go back into a SWE/programming career, what field/industry did you pivot into?",
      "body": "For some context, I graduated with a bachelor in Computer Science and after working for 3 years, I was laid off back in late 2024. I took some months off anything programming/SWE related due to a feeling of burnout and got back into the grind (i.e., applications, leetcode, leveraging any referrals I could get, cold messaging people on Linkedin) around March 2025. After hundred of applications and a few failed interactions with recruiters, I was still unable to get an interview. I wouldn't call it an industry pivot (at least, not a desirable one comparatively speaking) but I was recently hired as a part-time sales/floor advisor for a retail store. \n\nI know this sub's population isn't representative of the larger population (employed engineers aren't likely to be hanging around here) but I'm interested to know how others are doing. Were you able to find a job in tech? If not, what are you doing? ",
      "subreddit": "cscareerquestions",
      "score": 536,
      "url": "https://reddit.com/r/cscareerquestions/comments/1p1sxmw/those_who_got_laid_off_within_the_last_2_years/",
      "comments": [
        {
          "body": "I broke into CS without a degree and did 5 years, laid off late 2024 and now I’m going back to school to go into aerospace engineering! It was actually a great opportunity for me to realize that my heart wasn’t in it anymore.",
          "score": 142
        },
        {
          "body": "10+ yoe, 3 years unemployed.\n\n\nHaven't found another job.  Not even sure what I'd pivot to.",
          "score": 313
        },
        {
          "body": "[deleted]",
          "score": 303
        },
        {
          "body": "Im working front desk at a condo while trying to get into grad school. Im pivoting to accounting.\n\n\nBachelor's in CS and Applied Math. 4 yoe",
          "score": 112
        },
        {
          "body": "[deleted]",
          "score": 117
        },
        {
          "body": "I’ve been unemployed for a year. People tell me it’s because my resume sucks and that’s probably a part of it. I have my degree and 2 YOE but I didn’t do much during those years.\n\nI have 7 YOE in customer service so I’m trying to get a customer service job to bring in some money.",
          "score": 145
        }
      ]
    },
    {
      "title": "I feel for all you guys struggling. If this was 2021/2022, 99% of you would've found a job in less than 3 months tops. 2021/2022 was wild.",
      "body": "The 2021/2022 job market absolutely crazy, you would apply for a job and immediately know which jobs you would get a call back for. Almost expected. Interviews were easy and LinkedIn inboxes were getting flooded with actual, real jobs. Not BS scam/spam jobs. When you started applying in 2021, you would have like 5 or 6 offers in hand to choose from. You didn't even need to have experience with a relevant tech stack vs now that you need to be a 1:1 match to the job description. \n\nPeople were genuinely learning how to code on freecodecamp from zero to hero and getting full-on SWE jobs in 6-10 months (this was actually kinda common in the 2010s). In 2021, it was almost seen as a waste of time and overkill to even bother getting a CS degree. Guys were getting jobs with generic boilerplate tier React portfolios and a 2 or 3 boilerplate projects. It was crazy. Then those same guys would job hop in 6-12 months and go from making $70k to $105k or some shit. I myself job hopped 3 times in that time frame and tripled my comp.\n\nIt makes me feel bad because so many of you are struggling with pretty solid level of credentials and dedication. Most of you guys even with no experience could probably actually do the jobs too. Just bad timing for when you came into this field.",
      "subreddit": "cscareerquestions",
      "score": 1351,
      "url": "https://reddit.com/r/cscareerquestions/comments/1lyf853/i_feel_for_all_you_guys_struggling_if_this_was/",
      "comments": [
        {
          "body": "You shoulda seen it back in the 90's.  In the bay area, you could open a window, shout random acronyms, and get hired.  I worked next to English majors that tought themselves a bit of HTML.  I changed jobs every couple of years as routine.  I had a guy sat at the same table in a Beni Hana's, got into a conversation, mentioned I was a software engineer, and ended up working for him for a short time.\n\nMoney rained from the sky.  Almost literally.  Investors would BEG to invest in a startup.\n\nI almost feel as though this is payback for the working class having it good for a time.  Having power.  Back then we had power in salary negotiations.  Recruiters calling for real jobs.\n\nThat's what I miss.  The belief that workers were valuable and you had to work to get the good ones.",
          "score": 306
        },
        {
          "body": "Best not to dwell on the past.",
          "score": 711
        },
        {
          "body": "The Blind app was wild during those years lmao",
          "score": 66
        },
        {
          "body": "And that was the problem. Idiot tech companies assumed Covid would go on forever and we’d all be sitting in PJs.\n\nMeanwhile even Zoom is demanding workers go back to the office.",
          "score": 224
        },
        {
          "body": "My only regret in life is that I didn’t buy a house when I was a fetus.",
          "score": 29
        }
      ]
    },
    {
      "title": "The best advice on how to get a job in this market",
      "body": "95% of this subreddit is people complaining about the job market or AI.  The remaining 5% of actual advice is straight up garbage and completely outdated.  Thought I would help out by making a list of things that will greatly improve your job search\n\nAs a background, I have 6 years of Software Engineering experience and have worked with people of many backgrounds.  I have never worked at FAANG, went to a mediocre school with mediocre grades, never had an internships or anything like that.  But I have also never been unemployed.  This isn't for the .1% of people, this is for the common CS man (or woman).  And if you were asking, I'm a U.S. citizen in the U.S. market.  If you are neither of those this probably won't apply to you.\n\nWith that out of the way here's what I have gathered from my experience:\n\n**1. Apply to local/hybrid jobs in non-tech hubs.**  \nYour goal is to reduce competition as much as possible.  When I first started I would literally filter jobs on linkedIn to states nobody wanted to live in, like Ohio.  You will be given jobs in locations that people don't even know exist.  A lot of them have barely any applicants.  If they are desperate enough they will hire you.  Another tip would be to update your resume to have your location be within the same area, since companies might filter you if you are located too far away\n\n**2. Make sure your resume is concise.**  \nWhen I review resumes I hate ones that have tons of wordy bullet points that basically say nothing.  Don't dilute your resume with crap.  Most people have 1-2 important projects they have worked on at a company and a bunch of filler work.  Just focus on the important stuff and make sure it is clear what you actually did.  Also PLEASE do not use arbitrary percentages in your bullet points.  I hate this advice so much just put what you actually worked on.  It doesn't matter how the business benefitted we all know that is the point of work.\n\n**3. Similar to 2, make sure your technical skills are concise**  \nIf you put every tool or technology it looks like you have very little experience in lots of things.  Focus on putting skills that are needed for the job you are applying to.  Another easy approach is to take the skills you are best at (say React), and filter only for jobs with React.  Then do the same thing with Angular etc.\n\n**4. If you don't have any experience (or limited) YOU NEED TO DO PROJECTS**  \nYou need some way to show that you have some sort of technical knowledge or drive.  You don't need a github, but you should have projects that you can explain how they work.  This is especially crucial for internships.  My company just hired an intern that was the CEO/Cofounder of a startup.  Her startup? Building websites with other students for various people.  Sounds stupid, but it got her an internship.\n\n**5. Just straight up fucking lie**  \nI don't want to endorse this, but I just want people to know who they are competing with when they send out 500 applications without a response.  We hired someone who had experience as a software engineer.  But they accidentally told me they were a QA at their last role.  I checked their linked in and they were listed as a software engineer.  So yeah, if you work in tech support, QA, product.  Doesn't matter, you were a software engineer\n\n**6.  Same as number 5**  \nThis is more reasonable in my opinion because recruiters are stupid.  If you have React experience and applying to a job with Angular, congrats - you actually have Angular experience.  Same with Java and C# etc.  The important thing is you are able to actually pass an interview for this stuff.  It is worth it to review core concepts and maybe do a few leetcode problems in that language.  At the end of the day you need a job\n\n**7. Interview advice: be honest but not too honest**  \nWhen I was interviewing for a job I wanted they asked me a common interview question about a time I failed.  So I told them a real story about how I messed up getting requirements and caused a delay in the release.  I didn't get this job.  The next job I applied to asked the same question, so I told the same story but rephrased it where product threw a bunch of requirements at me last minute and I had to work overtime to get things across the finish line.  I did get this job.  You get the idea\n\n**8. Do not negotiate**  \nThere's a lot of people on this sub that will scold you for not negotiating.  But I have seen first hand peoples' offers get rescinded for negotiating, especially in this market.  Just accept the damn offer once you get to this stage.  Every job I've gotten when I negotiate I got $5k more on top of the initial offer which is not worth risking losing an offer over.  I simply asked if there was any wiggle room and they gave me basically the same offer\n\n**9: For students: do not waste your time**  \nSeriously, start applying/working on projects as early as you can.  Grades hardly matter.  I knew a dumb kid that had a 4.0.  It didn't make a difference when it came to getting a job.  He could have spent some of his time studying instead building a react app or something and gotten a 3.7 and been better off.  Take as many easy classes as possible and focus on learning on your own time.  Most CS classes I've taken taught be .01% of my current CS knowledge\n\n**10: Make sure everything is up to date, even when employed**  \nKeep your resume up to date with your latest experience.  Try to check LinkedIn/Indeed once a week or so.  I've seens job boards get flooded with really good jobs one week, which all get removed the next.  You never know when that next opportunity is going to be available so it's good to always be looking.",
      "subreddit": "cscareerquestions",
      "score": 900,
      "url": "https://reddit.com/r/cscareerquestions/comments/1l91bzv/the_best_advice_on_how_to_get_a_job_in_this_market/",
      "comments": [
        {
          "body": "&gt;  Do not negotiate\n\nI literally got called a 'scab' on reddit for accepting my salary without asking for an increase in the offer. As it happens I had a week left of the contract I was on and zero other offers.",
          "score": 66
        },
        {
          "body": "Thanks. I wouldn't call these the \"best\" advice. They are somewhat controversial but can be helpful.",
          "score": 234
        },
        {
          "body": "&gt; #5. Just straight up fucking lie\n\n&gt; ...\n\n&gt; If you have React experience and applying to a job with Angular, congrats - you actually have Angular experience. Same with Java and C# etc.\n\nYou better know your stuff if you try this. Enough to be comfortable getting asked technical questions and writing code in that language.\n\nYour interviewers will know the depth of your knowledge. And they'll compare it to people with actual experience.",
          "score": 70
        },
        {
          "body": "6 YOE. Almost 3 years unemployed. Just signed an offer that I am very happy with.\n\n&gt; Just straight up fucking lie\n\nLying on my resume is what got me interviews. Lying in the interview is what got me two offers.\n\nI think lying in interviews just does both of us a disservice. I think it's important that we both know what we're getting into. I want to be able to actually do my job after getting it. Nobody would even give me a second interview if I didn't talk up my senior/lead experience. I was being honest. I have some experience leading projects. I'm very comfortable with it. I am not a person with *years* of lead/senior level work, though, and that's what they wanted to hear.\n\nSo I spent a few days running through the stories I had of my experience, and I rewrote them under the guise of *being* my tech lead. Same story, different angle. I know all the decisions we made on those projects, because I was a part of them. I didn't *make* the decisions, but now, in my stories, I did.\n\nI went from getting past recruiter screens 1/10 times to 10/10 times. It felt a lot more like interviewing 5 years ago. I still failed a lot of the later stages, but I don't care about having a 100% success rate. I only needed one job.\n\nIf the rest of the market is lying, then you have to lie as well. It's the same escalating race to the bottom as the leetcode grind.",
          "score": 170
        },
        {
          "body": "Lol I did half of this 2 years ago after a year of unemployment and it worked. at some point you just dgaf bc the worst they can do is say no. You get really good at BSing your way through and realizing what the hiring manager wants to hear and embellish everything ",
          "score": 43
        }
      ]
    },
    {
      "title": "Internships: how do you deal with students who lie?",
      "body": "I’ve seen multiple students lie on their resumes. Just this week, a 2nd year student told me he claimed to be 3rd year during his first year, got and passed the interview, and got an internship restricted to 3rd years.\n\nThe company never checked his transcript and never found out. He said this was minor compared to classmates who completely fabricated experience or projects.\n\nAnother person I know listed a 7mo swe internship that was actually about 15 hours of simple work over one month, and it’s still listed on his Linkedin.\n\nIt troubles me that honest candidates are disadvantaged due to poor resume and background checks. Especially in the most competitive part of one's career: their first job(s).\n\nI’m sure others have seen similar cases, curious to know what happened and how did those people fare?",
      "subreddit": "cscareerquestions",
      "score": 297,
      "url": "https://reddit.com/r/cscareerquestions/comments/1q35zag/internships_how_do_you_deal_with_students_who_lie/",
      "comments": [
        {
          "body": "It sounds like your company does a poor job of checking candidates. Internships are iffy because the company might not have so many applicants to work with, and there's a short period of time to hire people. If this is affecting what work gets done during the internship time, or it's also this bad on the full-time hire level, then it's worth revisiting how you do interviews and background checks.",
          "score": 252
        },
        {
          "body": "Honestly, the worst students from my school were often the most successful, failing their way up.  They’d lie their way into a startup internship, not get a return offer, use that experience for a bigger company, fail there, leverage that experience to big tech, then a unicorn.\n\nFunny thing is, they eventually get good because they are exposed to all these high-level work environments and learning on the job, so they got experience hardworking honest students didn’t.\n\nFake it till you make it I guess.\n\nDamn people really liked this comment I guess",
          "score": 138
        },
        {
          "body": "From a tech team perspective (not a hiring manager, not HR) - we have interviews, 2 devs and a manager are always present for an interview - if they pass the interview and are the best candidate I really don't care.\n\nIn order to get to the interview one of two things have happened if they're lying. Either HR/Hiring manager aren't doing their job correctly (absolutely shocking) or higher ups have an unspoken rule that it's not that important (happens).  \n  \nI will point out that during the interview we *do see* the CV, and ask some questions based on it so you can't go wild with the lies.",
          "score": 84
        },
        {
          "body": "My old boss said “only lie if you’re ready to be caught” which I think is great advice. \n\nI lied for my first job. Said I was great at JavaScript and had done multiple hackathons with it. The second part is true, I was on multiple teams that won hackathons. But that’s cause my friends were exceptional engineers and I was the presentation/front man. \n\nThe first part is a lie. Never done JavaScript before my first job. But by the time they found out I was already productive because you should be able to learn enough of a language to effective in a couple days. \n\nIn general, if you’re going to lie, you need to have the skills to make the lie the truth soon. ",
          "score": 34
        },
        {
          "body": "&gt;It troubles me that honest candidates are disadvantaged due to poor resume and background checks. Especially in the most competitive part of one's career: for their first job(s).\n\nWelcome to real life. Being honest isn't a good selling point and you're trying to sell yourself. The dishonest people figured out how to game the system and were confident enough to execute on it, that's why they got hired. It's not their job to sniff out all the bs when they literally have thousands of applicants, they care more about whether you can convince them to believe the things you're saying, be likeable as a person and are able to tell a good story.",
          "score": 189
        },
        {
          "body": "Because interviewing and background checking on software engineers is always done lazily. That's why they put so much effort into the coding interviews. We have to reverse sort lists &amp; invert b-trees on the spot so hr doesn't have to do its job so no your actual experience or education level doesn't matter.",
          "score": 20
        }
      ]
    },
    {
      "title": "Name and shame: CIBC",
      "body": "A year ago as a fresh grad applying for junior developer positions, I chanced upon an interview for cibc, a bank in Canada. Since the experience lives rent free in my mind to this day, I’ll detail it.\n\nHad applied for a junior Java developer position, by this point in time I had a total of 1 yoe via coops. Got an invite for a 2 hour interview with a manager and 2 senior devs.\n\nThey started off with some basic java related questions, stuff you’d expect someone in their last year of uni to know, simple. They started going into somewhat more complicated questions, asking about patterns I’d heard of but never seen in practise - got a comment from one of the devs by this point along the lines of “wow they teach nothing to you people nowadays” for not knowing how to explain decorator pattern properly (and this after explaining factory, flyweight and observer with examples). Alright maybe that guy is just grumpy, it’s ok.\n\nThen I get asked about multithreading, said I knew about deadlocks in theory but never saw it in practise besides database tx locks… another dev says they knew this stuff perfectly by their 2nd year back in India lol okay.\n\nThen I get asked a problem on cloning a graph, goes well… solved it relatively quick since I had seen it before, get negged and gaslit to oblivion by one of the devs saying my code was good but I took too long compared to other candidates, “we will give you a chance on this next question” he says… then he pastes in an lc hard dp problem lmfao, understandably did not get it, “come on man algorithm class should be enough to teach you this forever”.\n\nManager then say that’s enough and asks the two devs to get off, says he likes me and asks me what salary I’m expecting… I said 75k cad (downtown Toronto btw) and he looks flabbergasted and says I’d need senior level knowledge for this.\n\nGot rejected, it was my first interview as well so my confidence took a brutal hit. A few weeks later I land something for 90k. \n\nWaiting for a hopeful acceptance to faang so I can add this gaslighting trio on LinkedIn as a flex.\n\nThat’s my story.",
      "subreddit": "cscareerquestions",
      "score": 2803,
      "url": "https://reddit.com/r/cscareerquestions/comments/ugveah/name_and_shame_cibc/",
      "comments": [
        {
          "body": "CIBC leetcode hard lmfao. OP please crosspost this to r/cscareerquestionsCAD",
          "score": 555
        },
        {
          "body": "Wow, I’m impressed you even completed the interview! I would’ve noped my way out asap once they got too snippy. *Why choose to work with assholes* lol",
          "score": 983
        },
        {
          "body": "&gt;Manager then say that’s enough and asks the two devs to get off, says he likes me and asks me what salary I’m expecting\n\nIt's very telling that they asked you your desired salary *immediately* *after* they beat you down",
          "score": 587
        },
        {
          "body": "Fuck those interviewers",
          "score": 404
        },
        {
          "body": "&gt; another dev says they knew this stuff perfectly by their 2nd year back in India\n\nThere's your answer.  It's very hard for environments like this to keep good devs when they can get a job at a fun small company/startup with a modern tech stack, or a big tech company, both for more money.\n\nSo the ones that stay tend to be crappier devs.\n\nThere are lots of great Indian devs.  But there are just as many average or below average ones whose only skill is rote learning.\n\nThose guys can probably recite the entire Java standard backwards and forwards, but good luck getting them to write any remotely usable code.\n\nThey're trying to flex the only thing they know, which is trivia they memorized while in school.\n\nIf they were any good (and as confident as they tried to come across), they wouldn't be working a job where 75k qualifies as requiring \"senior level knowledge.\"\n\n&gt; so I can add this gaslighting trio on LinkedIn as a flex\n\nBit of advice, but IMO don't do it.  Name and shame here, or post a bad review on Glassdoor, but don't make it your brand on social media that you're a complainer.",
          "score": 210
        },
        {
          "body": "All the CIBC customer facing interfaces are abysmal. I had to cancel my Costco master card after it was transferred under CIBC. I was actually just joking with my friends the other day that all the engineers working for them need to be fired. Now I know why.",
          "score": 104
        }
      ]
    },
    {
      "title": "Once you have experience, don't let employers treat you like shit",
      "body": "I have a few years experience now as a SWE and I just want to remind everyone not to take shit from employers/prospective employers.\n\n&amp;#x200B;\n\nI'll give you an example:\n\n&amp;#x200B;\n\nI got a linkedin message from a recruiter, and as I am always open to new opportunities, I went ahead and applied to the job. I had a phone screen the next day and at the end I asked about salary. They told me the most they could do was about $30k under market. They then told me I would need to come in for 5 more interviews spread across 3 days. I thanked them and hung up the phone. It's actually pretty fucking absurd what some companies think they can get away with. Everything from making you jump through a million hoops to get a job, to shitty salaries and benefits, to incompetent managers.\n\n&amp;#x200B;\n\nGood SWEs are in demand, so remember that and value yourself and fuck employers, they don't give a shit about you, so you owe them no loyalty.",
      "subreddit": "cscareerquestions",
      "score": 2226,
      "url": "https://reddit.com/r/cscareerquestions/comments/bwp6of/once_you_have_experience_dont_let_employers_treat/",
      "comments": [
        {
          "body": "Damn, I wonder what they were smoking because it must have been good.",
          "score": 729
        },
        {
          "body": "Fuck right, excellent talk, know your worth because if you don’t nobody’ll value you",
          "score": 283
        },
        {
          "body": "I got a call from a company I applied to on Indeed and they wanted me to do a *month* long probation period where I would be paid $1000 for the *entire* month, and THEN we could discuss salary. After giving them a month of my life. Absolutely fucking insane.",
          "score": 121
        },
        {
          "body": "&gt; Don't let employers treat you like shit.\n\nFull stop. Screw experience level. We are people.",
          "score": 626
        },
        {
          "body": "One time I rejected an offer with a funny backstory. I had written this technical documentation/reference manual for acquiring forensically sound images/log data from cloud infrastructures. The hiring manager thought I “memorized” said documentation, and thought I wouldn’t be a good fit based off that. I told them to double check who it was written by, then an hour later get calls from their HR/CEO/CTO convincing me to come on board. I rejected.",
          "score": 98
        },
        {
          "body": "This is why I always ask what the pay is on first contact.",
          "score": 55
        }
      ]
    },
    {
      "title": "I deleted LinkedIn and Indeed today. I’ve been on the market for 12 months. I revamped my resume, built a portfolio, submitted countless apps and did multiple interviews. I launched my business last week, slowly have lost faith in the job market.",
      "body": "\nMy life is was consumed by applying I would spend all day glued to my phone applying from morning to evening, writing cover letters and reaching out via LinkedIn. I had a few interviews but anytime I got to the last round I lost to internal promotions. I have a wife and kids and it wasn’t fair to them. I was also super anxious about it. Lately I deleted LinkedIn and indeed altogether and am feeling much better. Even though financially it’s scary, I’ve started putting more time towards my side hustle. This month I made an extra 1,100.",
      "subreddit": "jobs",
      "score": 823,
      "url": "https://reddit.com/r/jobs/comments/19cx8o0/i_deleted_linkedin_and_indeed_today_ive_been_on/",
      "comments": [
        {
          "body": "Kudos to you. Im sure you are not going to regret. But I would suggest spend a couple hours every weekend applying. Its not you, its the market. Maybe you can work a FT and also manage your business. Good Luck!!",
          "score": 156
        },
        {
          "body": "As former solopreneuer, I recommend rebuilding your LinkedIn. I got many paid clients through it. Think of it as part of your marketing strategy. GL.",
          "score": 108
        },
        {
          "body": "It's tough when job searching takes so long but it's great you started your own business. Stepping away from constant applying is good for mental health. Try to balance work life and family. Making $1,100 from your side hustle is a great start. Keep focusing on your business it might grow bigger.",
          "score": 27
        },
        {
          "body": "When I was finally free of all the indeed notifications I became much happier. Something about doom applying is just so taxing. Then half the time you get an email it's a scam but you can't turn off notifications because what if an employer contacts you through there?\n\nSidenote: I did eventually learn that the best thing to do is go to the actual company's website. It still sucks going on indeed. I ended up just going through state gov jobs in my desired field",
          "score": 26
        },
        {
          "body": "There will be many like you. At some point, people get fed up.\n\nI tried for a year and a half to find another job and I basically gave up.  I still have my profiles, but I only apply to a few jobs a week now.  \n\nThe better my skills and portfolio got, the more I was ignored.  So I keep working on building my own stuff to generate income.  Might as well…\n\nWith your background, you can do the same as me-Build websites, post ads, affiliate links, create email lists, sell digital products, and more.  \n\nIf you eventually get hired, you’ll still have this all generating income for you and not 100% dependent on someone else.",
          "score": 20
        },
        {
          "body": "I am really feeling this myself as I am 7-8 months in on the search myself.  Made it to final rounds, but no luck yet :(",
          "score": 14
        },
        {
          "body": "Definitely support local! I’m paying a local guy just starting his business a good chunk of change for a job.",
          "score": 11
        }
      ]
    },
    {
      "title": "A year ago I graduated from a bootcamp with 21 other people. Only 6 of us are working as SWEs today.",
      "body": "I wanted to make this post as kind of a counterweight to all the stories that get posted here of people attending bootcamps and then quickly making six figure salaries, because I do not think those stories really give an accurate impression to the people here who are considering going to a bootcamp. \n\nThere's a concept in statistics called [survivorship bias](https://en.wikipedia.org/wiki/Survivorship_bias) where cases of failure are ignored because they're less visible than cases of success. The people who went to a bootcamp and didn't make it aren't going to come in here and talk about it, and they certainly aren't going to show up in the \"placement statistics\" that the bootcamps advertise. \n\nMy cohort of 22 graduated a year ago from a fairly well-known bootcamp. Our program was pretty standard, three months of full-stack work focused on JavaScript and React which cost ~$15k. \n\nOut of those 22, 6 (including myself) are in full-time SWE roles, mostly small companies or agencies. No FAANG. 5 more are in other non-developer industry roles (recruiters, designers, support engineers etc). The other 11 are not working in the industry and most of them haven't even touched their LinkedIn profile for months. \n\nThis amounts to a placement rate of 27% which is not great for a program that costs $15k. The official \"placement rate\" of my program according to their advertising materials is ~60% (which they reframe as ~90% by excluding people who don't participate in their career services \"to completion\" whatever that means).\n\nI don't mean to scare people off bootcamps- they worked for me (although I already had a humanities BA). But I do want to warn people who are thinking about a bootcamp as a *shortcut* to get into the industry without the effort or cost of a BSCS. Is it possible? Yes. Is it easy or guaranteed? No.",
      "subreddit": "cscareerquestions",
      "score": 2807,
      "url": "https://reddit.com/r/cscareerquestions/comments/u23kix/a_year_ago_i_graduated_from_a_bootcamp_with_21/",
      "comments": [
        {
          "body": "It's really impossible for me to imagine someone who's not a genius going from 0 to 100 in 3 months and being employable. There's a big caveat that's left out and it's that there is still a lot of self-study required outside of the course. I think if you are well-prepared and well-studied on your own you will have better odds coming out of a bootcamp.",
          "score": 1394
        },
        {
          "body": "my bootcamp class had 31 students and only 3 of us got jobs.",
          "score": 162
        },
        {
          "body": "&gt;mostly small companies or agencies. No FAANG.\n\nI think most bootcamp people not working at FAANG isn't a red flag in and of itself. Most SWEs with CS degrees aren't working at FAANG either. What I would be worried, though, is the 6 out of 22 stat. Although I'm curious whether the 5 who are in tech in non-development roles took those because they no longer wanted to do development, rather than they couldn't get into development. Pretty crucial difference. I know someone who did a bootcamp but ended up becoming a PM instead because he just preferred it over coding all day.",
          "score": 261
        },
        {
          "body": "[deleted]",
          "score": 166
        },
        {
          "body": "[deleted]",
          "score": 285
        }
      ]
    },
    {
      "title": "These tech \"influencers\" are the reason why you don't have a job in the tech industry",
      "body": "I've been in the tech market as a Data Scientist in Silicon Valley enough to recognize that at this point, tech \"influencers\" in Youtube, MOOCs, Kaggle, etc. are now the ones preventing entry level applicants from getting their first technical job in the tech industry. Now bear in mind what I see is in the Data field, but I think I can abstract it out to the software field as a whole.\n\nThese people give the worst and just purely wrong advice you can imagine in the tech industry and profit off of the naive young applicants who make up majority of the scammer's audience. For instance, in the data field, all these \"experts\" claim that a lifecycle of a data science project in industry ends with heavy Machine learning solutions. Anyone who has successfully derived meaningful value out of data science in their company knows that this is absolutely the wrong approach to project management and project scoping. But the young inexperienced ones listen to these advices when most of these \"experts\" and \"influencers\" haven't worked in the field in a long time.\n\nI don't know if it's fair to mention names, but we all know who these people are: Jo. Tech, S. Raval. These \"influencers\" run down stream to lesser influential people on medium/towardsdatscience.com/etc. who again have little experience in industry themselves but are pumping out garbage content that sounds deceivingly attractive with hot words like \"edge computing\", \"deep reinforcement learning\", when only a tiny fraction in the industry actually uses these tech. I know, working in an AI automation company myself.\n\nSo why do they to this? It's painfully clear; they just want to sell courses or make money on medium.  They are only interested in their own brand, they have little of your own interest. How can you tell? How can you distinguish legitimate content from illegitimate content? By this simple trick; if there's something they would lose if their words are found inaccurate, you know it's illegitimate content.\n\nThis is what I mean. I mentor Berkeley/Stanford students all the time, being an Alma Mater in there. If my advice to them on finding employment turns out to be wrong, I have little if not nothing to lose. Because I have nothing to gain whether or not my advice turns out to be correct. But that's not the case for these \"influencers\". This is what I mean. If their advice turns out to be wrong, it has implications on their revenue, their branding, their ability to sell courses.\n\nI suppose why I find this so frustrating is that these snake oil salesmen are giving all the wrong advices for their own ridiculous brands and money making schemes which puts young aspirants and their career prospects to jeopardy. They say they're being moral and altruistic and actually caring about the people who are having difficult time getting jobs, when they're just abusing and taking advantage of the naïveté. I experienced this personally, when I wrote something very minor on subreddit long ago about basically how business intuition is very important in the data field, and all these commenters lashed out at me in droves, saying ridiculous things like \"project design\" in a term I apparently made up since they haven't heard of it from the course-peddlers (wat the f?)\n\nThese influences have real-life effects. I interview data scientists/analysts all the time for my company, and these applicants basically say/do the same thing that I hear from these influencers, such as applying ML methods to non-ML problems just because it's \"cool\", they took courses on it, etc. It's such a turn off and a clear signal that these people have been taught the wrong things in their MOOCs, self-taught journey.\n\nMy suggestion for young applicants is that rather than listening to these \"influencers\" online, reach out to actual Data Scientists/programmers/etc. who have been in the industry for a long time and ask them directly about the market. They're usually happy to dispense advice, which I can guarantee are much more sound and solid.\n\n**Edit: I actually don't mind Tech Lead as much as others here. I know he's had issues with CSDojo and other youtubers. That part sucks. But his rants about the ridiculousness of the tech industry is pretty spot on. I actually don't mind Jo Tech's new videos too, they're pretty funny. But their courses, yea that's the crap I'm talking about. I haven't taken Clement's courses, don't know, but  just be careful about people in general who's more interested in their own brands than you.**\n\n**Andrew Ng, he's interesting I find him both part of the problem and the solution. He's definitely course-peddling obviously and sells the dream to thousands of young data hopefuls when obvious getting DL certifications from Coursera is NOT going to get them a job. Or be actually used at work unless you have a Phd. But Ng's general wisdom on integrating AI to companies in SaaS or manufacturing is extremely valuable.**\n\n**The ones I'm mostly frustrated about are these writers on towards data science or linkedin** **or youtube who have huge influence as a content-promoter but who has never really worked as a Data Scientist. Some of people are like A. Miller, who never actually worked as a Data Scientist, or those who come from Semi-conductor background but somehow call themselves as a Data Scientist. I've also seen interns who've never worked full time giving advice on Data Science. That sh%t is ridiculous.**\n\n&amp;#x200B;",
      "subreddit": "cscareerquestions",
      "score": 2235,
      "url": "https://reddit.com/r/cscareerquestions/comments/o8zdqu/these_tech_influencers_are_the_reason_why_you/",
      "comments": [
        {
          "body": "How do you make a million dollars? Teach 100 people how to be millionaires and charge them 10 grand each. Boom",
          "score": 849
        },
        {
          "body": "When there is a gold rush , there exists shovel sellers. \n\n“So you wanna be a software engineer?\nGo to algo.. blah blah blah and buy our shovels. Forget the free resources like hackerrank and leetcode , forget MIT and other open courseware and pay for our regurgitated tutorials on how to get into companies that will probably not hire you, and if they hire you forget your individuality and look forward into being PIP’ed in the near future .",
          "score": 966
        },
        {
          "body": "What I dislike the most is when they downplay actual education saying \"that it is not important\" while shilling their course that according to them is \"everything you need to know to land a job in the tech industry\".  Like yeah, of course your 30 hour video course is a replacement for a 4 year long CS degree...",
          "score": 426
        },
        {
          "body": "Having started with Linux quite early in my bachelor's, I developed a heuristic that the best resources and tools are often free. This has been surprisingly useful and has become more and more valuable through the years",
          "score": 117
        },
        {
          "body": "*cough* techlead *cough*",
          "score": 375
        },
        {
          "body": "But what about the deep edge reinforcement quantum cloud computing?",
          "score": 48
        }
      ]
    },
    {
      "title": "This job market is destroying my sense of self worth.",
      "body": "I managed in 2022 to get a tech job with little experience (non-cs degree). I worked there for 3 years but have now been unemployed for 9 months. Admittedly, I didn't spend that whole time looking, but much of it I have been applying, interviewing, talking to recruiters, reaching out to friends, networking on linkedin, emailing people that are recommended to me, adding projects to my portfolio. I have been doing this constantly on a weekly basis for months. Nothing. I haven't even sniffed an offer. 95% of the time I just get rejection emails. Many of these positions I am 100% qualified for, literally every single thing on the bullet points is something I have experience in and is on my resume. I know I am qualified. I know that I did good work at my last job. I know I am smart... right?\n\nLately I have been feeling like a complete and utter failure. Applying to jobs feels pointless since I never hear anything back. Even applying to similar positions to the one I left at the end of 2024 I get rejected for. Do I just forget my degree and go work as a waiter? Surely there are jobs out there but clearly no company wants to take me. I tend to think of myself as a capable and intelligent person with a good work ethic, but trying to find a job and watching my savings dwindle away has made me feel like I am worth nothing.\n\nI don't really know why I'm posting this. I guess to vent. Maybe other people can understand my situation. I worked really hard to get my mental health to a good point over the last 5 years or so but lately I feel it slipping. It's hard to stay positive when there is nothing good happening.",
      "subreddit": "cscareerquestions",
      "score": 499,
      "url": "https://reddit.com/r/cscareerquestions/comments/1neh21v/this_job_market_is_destroying_my_sense_of_self/",
      "comments": [
        {
          "body": "It's not your fault, everyone is having this experience right now, including people with a decade of professional experience.",
          "score": 294
        },
        {
          "body": "I understand your struggle. And so does everyone else in the market. It's easy to tie your identity and self worth to productivity, your degree, your years spent studying and grinding your ass off. So it might feel like a waste of time if you don't land a job in the industry.\n\nJust want to say that you're not the only one out there. We are all just rats in a wage cage. I think finding any work at all will help your mental. Don't worry so much if it's not in your industry. Making money, feeling productive, and pursuing things outside of work may help you feel more fulfilled. Don't let this shitty CS market bring you down too much.",
          "score": 51
        },
        {
          "body": "Lurker here, just FYI, this is an issue in a lot of sectors right now, not just CS. A lot of companies are downsizing and closing departments, slowly but surely. \n\nI'm working in a field with a lot of overlap between different industries, and I'm seeing a tendency to fire people without replacements in mind. No outsourcing either, but increasing workload for those remaining while wages are stagnating.\n\n\n\nIn the next 2-3 years, our seniors will leave, that's roughly 40% of our workforce and there are no replacements; with our specific skill set, we need at least three years of training. You can imagine how that will end. I'm already looking for something else because without enough staff we can't run projects, and without projects we are going to bleed dry quickly, as costs of operations are high.\n\nIn general, less companies properly invest in junior talent, they just looking at short term value extraction, then move on to the next opportunity to exploit. Or just stick with their current workforce and try to remain as profitable as possible without blatantly violating labor laws.\n\nI honestly don't know what's wrong, it's like people in charge had their brains fried during COVID or something.",
          "score": 45
        },
        {
          "body": "What sort of roles are you looking for?\n\nI know it's hard, but don't tie your worth to your ability to interview. I've found interviewing is a ton of luck. :/ From how you feel that day, to how they feel that day, to what questions you get asked, a lot of things need to align over a span of days for things to work out.\n\nI'd suggest trying to balance applying/interviewing. Take the time to learn/do some stuff you are interested in. Maybe launch something? I've found that having something that has real users is worth talking about/having on your resume.\n\n\nBest of luck -- You got this.",
          "score": 23
        },
        {
          "body": "Is your degree close to CS? If not, you are competing with CS majors who likely have identical if not more experience",
          "score": 97
        },
        {
          "body": "This is the state of the market now. Layoffs, AI replacing, fake jobs adverts, RTO.",
          "score": 159
        },
        {
          "body": "Computer Science isn't easy.\n\nWaiting for a job offer isn't easy.\n\nI'm not telling you to give up.  I'm saying that you have achieved herculean goals in the past, and can do so again, not just once, but multiple times.  You can do it.  Focus on what you succeeded at, not what you lost.\n\nI am you (you're probably better than me btw).  I eventually got a job offer.  Each of my two jobs took 2 years to get (4 years of unemployment total).  I lost my self-confidence as a professional, but I'm confident in my stubbornness!\n\nTL;DR  Sometimes the job hunt is a game of endurance rather than strength.  You know how animals in African have to survive long droughts until the landscape floods and fills with water/food?\n\nIf you're feeling desperate, you could mix in some escapism into your schedule.  That was my strategy.",
          "score": 24
        },
        {
          "body": "[deleted]",
          "score": 16
        }
      ]
    },
    {
      "title": "1.5 years since graduating, no internships/experience, 1000+ apps, mid school, low gpa, no referal, just signed my offer",
      "body": "great pay. fully remote. I feel extremely lucky. My first and only interview. More then thrilled. Was seriously considering pivoting to electricians apprenticeship. \n\nI leet coded every day, built side projects constantly, made some open source contributions.\n\nStrangely, the thing that I spoke about most in all my interviews was the non-tech related experience on my resume which is only recently added as a single line at the end. \n\nI certainly attribute most of this to luck and don't think I am more qualified then anyone else to give any kind of advice but here is what I think made a difference:\n\n* filter positions on linkedIn by newest or by those with under 10 applicants. Getting in first is probably most important.\n* Search for more then just \"Junior Dev\" or \"SWE\" jobs. Use keywords like code or coding that will come up in the description but not the job title. This will allow you to find positions with unique titles that are more hidden in the results and receive less applicants\n* If you aren't a super stud stop applying to big tech positions. Find tech companies that serve currently thriving sectors like biomedical and healthcare.\n* add your non-tech work experience. I only added my most recent job as a single line but people really seemed to like that I had worked in a diverse fast paced environment before especially in the behavior interviews.\n\nEDIT:\nI have no idea how many jobs I applied for so 1k is a bs number. Probably like 10-20 a week for a solid 6 months to a year. \n\n&amp;#x200B;",
      "subreddit": "cscareerquestions",
      "score": 1454,
      "url": "https://reddit.com/r/cscareerquestions/comments/1arr4au/15_years_since_graduating_no/",
      "comments": [
        {
          "body": "That's what's up 💪\n\nTbh, I'd say your advice is more valuable than:\n\n* Folks who call themselves average but went to top 10 unis and have done multiple big tech internships\n* Tech influencers that started their careers during 2021 - H1 2022 and are now teaching current new grads about their job search struggles",
          "score": 404
        },
        {
          "body": "You have no idea how many people this post will inspire. Salute to you solider, sleep easy tonight.",
          "score": 288
        },
        {
          "body": "&gt;add your non-tech work experience. I only added my most recent job as a single line but people really seemed to like that I had worked in a diverse fast paced environment before especially in the behavior interviews.  \n\n\nPeople swear that irrelevant jobs shouldn't go on a CS cv. But if you have no actual relevant experience, having any other job exp is better than never working in your life.\n\nAlso, you are definitely more skilled and valuable than the average grad if you leetcode everyday",
          "score": 70
        },
        {
          "body": "[deleted]",
          "score": 63
        },
        {
          "body": "1000 apps is the new 500",
          "score": 54
        },
        {
          "body": "Indomitable spirit of mankind vs the indifferent cruelty of the universe (shareholder sexual capitalism)",
          "score": 73
        }
      ]
    },
    {
      "title": "The job I interviewed for yesterday morning got reposted on LinkedIn that evening. Is that a no?",
      "body": "I interviewed for a job yesterday morning that I’m pretty keen to get. Good salary, benefits, etc. I thought I did ok, although I totally flubbed one question.  \n\nThe job was closed to applications on LinkedIn all weekend and up to yesterday, but got reposted yesterday evening. \n\nDoes that mean it’s a no? I know sometimes postings just get refreshed and stay up. But this one was closed and then re-posted. \n\nI’m a bit bummed. I was really hoping for this one.\n\nETA: They just called me back for a second interview!!!! Please pardon my anxiety haha. I guess I’ll leave this up as a bit of a mini status update",
      "subreddit": "jobs",
      "score": 806,
      "url": "https://reddit.com/r/jobs/comments/15ruely/the_job_i_interviewed_for_yesterday_morning_got/",
      "comments": [
        {
          "body": "Not necessarily. It depends on how long that post had been up. Most companies repost on Mondays bc it moves the job up and will likely be seen more. They may just be continuing to screen candidates but not necessarily already rejecting you.",
          "score": 332
        },
        {
          "body": "Keep us updated. I’ve been trying to observe some hiring behaviours but some of them are just so bizarre and not making sense in term of being cruel to candidates 😅",
          "score": 64
        },
        {
          "body": "LinkedIn automatically reposts jobs on a regular cadence. This is not something the recruiter needs to do. \n\nIf the job description is updated that will also refresh a post.",
          "score": 38
        },
        {
          "body": "I wouldn’t worry about this but also they aren’t going to put all their eggs in one basket. Especially if this is a first interview. Maybe you’re the first serious applicant they received? \n\nCandidates fall through all the time for various reasons so while you might be the top candidate, for them to not interview anyone else would be a mistake. You could get another offer and then they have no other options",
          "score": 11
        },
        {
          "body": "[deleted]",
          "score": 26
        }
      ]
    },
    {
      "title": "i got a new job, accidentally",
      "body": "\nI’m not sure how to phrase it but to make it simple, I’m employed and have been working as Software Developer for almost 2 years after graduating in 2023. Since December 2024, I have been mass applying to new jobs on Linkedin, casually. I’m not eagerly looking as I’m still employed, thought I did consider to change jobs.\n\nSo long story short, I applied to a senior role that needed 5 years of experience. Well, I didn’t think much of it as the possible worst case scenario was they rejected me. So I applied and next week I was notified that I was shortlisted and required me to do a recorded screening interview 😹\n\nSo I did and submitted though I felt like I kinda screwed the interview. Then the following week, I was again notified I was shortlisted to do a live meeting with the hiring manager. Tbh, I already know I wouldn’t pass this round as they probably will access my technical skills which might not align with what they wanted in senior role.\n\nSo again, I did another interview with the hiring manager. It was an informative interview, it was positive. They gave me overview on how the working settings will look like if I work with them, which is something nice to know. By the end of the interview, he asked me if I still wanted to proceed after knowing their work culture and If I agreed, they needed me to work on coding assessment . A very simple one. If I’m not working, I could’ve finished it in just 3-4 days but they were nice enough to give me max 3 weeks.\n\nI agreed to do the assessment, to get an experience and explore new stacks I didn’t use before. At the moment, I really don’t care whether I passed or not.\n\nAfter 2 weeks, I submitted the assessment and got invited for another interview to review the code. This time, I was assessed on the skills to explain the code, break down the framework structure (I have never used this framework) and communication skills. Took only around 1 hour as I already shared with them the code 5 days before. I think i did well enough.\n\nThen, on the same day, they agreed to hire me with higher salary than my expected. It’s 80% increment than my current salary, fully remote and unlimited PTO.\n\nAll of this happened since December 2024 so it took me around 1 month and half to secure the job which I didn’t expect at all and didn’t have hope to get accepted.\n\nI feel like this is a sign for you to keep on applying, though you don’t fit the qualifications. They might consider you, depending on what you can bring to the table. Just keep on applying and applying. Luck might be with you. I’m super grateful for keep applying to jobs that I might not be qualified enough 😂",
      "subreddit": "jobs",
      "score": 10534,
      "url": "https://reddit.com/r/jobs/comments/1ii7go4/i_got_a_new_job_accidentally/",
      "comments": [
        {
          "body": "It wasn’t an accident, you showed your skills, and your personality, and the company agreed that you are the right fit.\n\nYou deserve this, you worked for this, and you should feel proud and that you DO in fact belong there.\n\nCongratulations.",
          "score": 2228
        },
        {
          "body": "GG Man, love hearing a story like this. I try to hire people with little experience. We use a lot of proprietary tools and it's up to me to mold them and this has worked out really well for my teams",
          "score": 235
        },
        {
          "body": "# congrats and best wishes on your new role OP!! 😀❤️",
          "score": 111
        },
        {
          "body": "[deleted]",
          "score": 47
        },
        {
          "body": "Omg congratulations!! Reading this makes me so happy for you and I really hope my luck also works like this someday! 😂",
          "score": 38
        },
        {
          "body": "[removed]",
          "score": 31
        }
      ]
    },
    {
      "title": "I have been a hiring manager for 7 years at multiple companies. I see a lot of people here talking about difficulty getting hired. Recently, I have interviewed the worst candidates ever about 50 a week. Tips to get interviews and nail them. Will answer any questions in comments",
      "body": "\nI have been a hiring manager for 7 years, for jobs paying $14/hr all the way to 350k a year salary. \n\nRecently, I have been interviewing for a position that pays $27-$32 an hour.\n\nThese interviews have been the worst I have ever conducted. \n\nIt makes me wonder what the recruiter is filtering out and if good candidates are getting phased out before I even get to meet them. I work very closely to make sure this doesn’t happen but lately with all the “personality test” some companies have and hoops. They are getting filtered out before it even makes it to the recruiter.\n\n\nHere are my tips to get through that and tips for a good interview.\n\nTips to get your resume in front of someone.\n\n1. Now with all the filtering systems, a referral from someone working at the company is best. It will get you to a recruiter and the recruiter can save your resume from going into the abyss.\n\n2. Apply for job even if you are not qualified, it is easier to get higher paying jobs because less people apply and even then the ones that are qualified sometimes have terrible attitudes and as a hiring manager I don’t have anyone to pick from and have to wait. I am willing to take someone who doesn’t match all the criteria to a T but has a good attitude. \n\nThese jobs are usually 120k+ \n\n\n3. Instead of explaining your job in the resume make bullet points of your tasks.\n\nExample don’t say: “I stocked shelves and helped customers and tried to sell credit cards and ran cash register”\n\nInstead say “ •Managed inventory • assisted customers •upsold product add ons”\n\n4. Some jobs require a lot of different tasks and you may know how to do a lot of things. When applying tailor your resume and include the things that will make you a good fit for this job\n\nExample, if you are a server and are trying to get into a sales type position, your resume should say “informed customers of available menu items that fit their request, upsold add ons and pushed daily specials”\n\nIt shouldn’t say “took orders and ran food to tables” \n\nBecause that isn’t going to help you in the new role you are applying for so it’s better to leave it out because the computer systems that filter the resumes may dispose yours.\n\n5. If you are able to get in contact with recruiters directly that’s even better. LinkedIn is a great option, you can also find most recruiters directly that’s emails and remember most recruiters want you to get the job because that’s how they get paid. A lot of them will even give you pointers on what the hiring manager wants if you just listen to them.\n\n6. If you lie to the recruiter, remember your lie. Most recruiters I have worked with take notes and send it to the hiring manger with your profile. \n\nVery often they tell the recruiter one thing and when I ask they forget or slip up. Also recruiters and hiring managers speak a lot and these things do come up so make sure to remain consistent.\n\n7. Make sure your resume is up to date even if you fill out the correct information on your application. Most of the time when I sit down with a candidate what a recruiter hands me is the resume not the application and I don’t see the most recent or relevant experience. I always ask if it is up to date but seeing effort was put into it and it is recent can make or break when I’m stuck between 2 candidates with similar backgrounds\n\n8. If the application requires a personality test read the job description and take into account any attributes they list and make sure to pick the corresponding on the personality test that will get you through most systems. If not just think of the job and what ideal person would be.\n\nExample if you’re not talkative and extroverted but you’re applying for a sales position the ideal person would be talkative and extroverted in order to talk people into a sale. Select that.\n\nIf it’s a management position, you know that a manager needs to be strong, outgoing and persuasive. Select those.\n\nBut most job postings specify what they are looking for.\n\n9. Use the job description and company’s mission statement to tailor your resume to get through any filtering systems.\n\n10. Please apply with an appropriate email something professional. \n\nInterviews- \n\nAnything you say or do around or to a recruiter or hiring manager will be taken into account even if it is not part of the interview.\n\nExamples of reasons I have not hired people:\n\n1. Not following the instructions sent in the interview email. Example: showing up to the wrong location when the address is written clearly in the email. \n\nIt shows you do not follow directions well.\n\n\n2. Showing up early before your interview time and demanding to interviewed earlier. I have had people show up for 2:00pm interviews at 11:00am and demand to be taken in at 11:00.\n\nI will say this is usually the older crowd that does this and they think it displays they are eager for the job. Which is a red flag to begin with. \n\nIt’s also a disrespect to my time and the time I set aside for you. \n\n3. Your interview starts as soon as you are near the location or anywhere you may run into someone who works at the company. Examples a cafe nearby or on premises.\n\nBeing rude to staff: door man, receptionist, security etc. \n\nI’ve had candidates come in and yell at the receptionist because they are late, I’ve seen candidates at cafes nearby prior to the interview being rowdy/rude/combative with someone taking their order. \n\nThe last thing I want is to responsible for hiring someone combative or having to deal with them myself. \n\nVaping in the lobby, while waiting 5 minutes until your interview. If you cannot control yourself enough not to vape prior to even having the job that means you will vape on the job. \n\nCigarettes, same thing. I try to stay away from hiring smokers because they need to stop what they’re doing to go smoke all the time and it is not productive and unfair to others who do not smoke and don’t go outside every hour. \n\nRefrain from smoking at the interview.\n\n\n4. Please don’t smell bad or have very strong perfume on and please don’t smell like weed or cigarettes or anything of the sort.\n\n\nNow mistakes I see during interviews- \n\n1. Assuming who you interview with will not be who you report to if you get hired. I look young for my age so very often people think there is an interview after me and don’t ask all the questions they should or say something like “yeah I have more questions but I will ask the next person”.\n\nOr being combative/rude/condescending\n\n2. Assuming since you have done this type of job for another company it is the same and being very cocky saying things like “yeah seems easy” “I already know this, dont have anyone questions”\n\nInterviewers like people who ask questions, it lets us know that you are taking it seriously.\n\nAssuming you have the job in the bag because you have had a similar position prior. This is a new place with new people, they don’t know you and you need to put forth the effort to show why they should go with you. \n\n3. Complaining about the job before even being hired. Example: When you are told expectations saying they are unrealistic. \n\nI get this a lot depending the position I am conducting interviews for but those expectations are there to let you know from the beginning what is expected. \n\n\nOr complain about the schedule that the recruiter already went over prior to scheduling the interview.\n\n4. Being desperate/begging for the position. Saying things like “please I really need a job”\n\nAs a hiring manager, interviewing takes up a lot of time and so does training. I want to hire someone who sticks.\n\nAny time I have ever hired someone desperate they quit because they are not considering what the job actually is and instead are just focusing on “I need a job” then realize it’s not for them or they’re in over their head or it feels too entry level for them.\n\n5. Asking questions too in depth for the position. Example: if you are interviewing for a cashier position, don’t start asking what the margin on products are and how the company is planning to navigate tariffs and inflation.\n\nThese are great questions but raise a red flag when you are interviewing for an entry level position or a position that has nothing to do with that.\n\n6. Bad mouthing other employers. Big red flag especially if it’s more than one employer you are bad mouthing, because most likely the problem is you. \n\n7. Assuming your age will speak for “experience”. \n\nIf your resume says 30 years experience but I interview you and you’re stuck in business practices of 30 years ago and say things like “this is what we did before you were born”.\n\nExperience doesn’t make you good. Just because you did something for 30 years doesn’t mean you’re good at it.\n\n8. Not understanding the job. I sometimes have candidates that do not understand the position even after I explain it and this is the main reason, I pass on people.\n\nAsk questions, get clarification, be engaged. \n\n9. Do not mention any personal struggles. Example: I’m a single mom, my husband died, my mom is sick etc.\n\nNone of these help me identify if you would be a good fit for the job and feel like you are trying to guilt trip me\n\n\nThings you should do at interview-\n\n1. Interviewers are human, I am very serious but if you make me laugh or feel like you aren’t my 39th interview of the day and it’s monotonous. I am more receptive and willing to hire. Personality sells in any position no matter what it is.\n\n2. Ask questions, an interview works 2 ways get to know the company from your interviewer.\n\n3. If you have any experience related to the job not listed on your resume make sure to bring it up even if it’s just volunteer work or a hobby\n\n\n4. Ask your interviewer what would make someone a great fit for the position and tailor your answers to that.\n\n5. Ask your interviewer what they are looking for in someone to take this position.\n\nThis is your opportunity to double down and sell your self on the traits they list\n\n6. Get a feel for your interviewer or team, if it is a retail type setting observe the type of people working there and let interviewer know you will be a great fit for the team.\n\nLast thing we want is to bring conflict into our team.\n\n7. Study your interviewer.\n\nIf you are given the name of your interviewer prior to the interview look them up online. A lot of them use LinkedIn and post quotes or post what they like to see in the work place.\n\nUse that to your advantage. Mention the quote or author or recite a work style they like. \n\n\n8. When you are leaving say nice meeting with you today (insert name). \n\nIf you call someone by name they are more likely to remember you.\n\n\nThose are the best tips I got. Any questions or advice I will answer comments.\n\nI hope at least 1 person benefits from this \n\n\nEdit: if anyone lands a job after using this I would love to know, comment or pm. Thanks wish you all luck\n\n\nEdit: Another tip, if you’re having trouble getting past the systems that filter out resumes, apply at smaller locally owned companies they typically do not have those and you’re much more likely to get actual eyes on your resume. \n\nEdit: another tip best day to apply is Tuesday \n\nAlso a lot of people has been saying they can’t get picked for interviews and bad candidates get through.\n\nSurprisingly, my main issue is people do not show up for their interviews. Out of 10 scheduled usually about 4 show. ",
      "subreddit": "jobs",
      "score": 1889,
      "url": "https://reddit.com/r/jobs/comments/1l1ubsm/i_have_been_a_hiring_manager_for_7_years_at/",
      "comments": [
        {
          "body": "If you can't find a good candidate and all the good candidates out there can't reach you, there must be something wrong in between.\n\n\n\nThese are good advices but I believe most ppl already know. I had my resume checked over and over by myself, friends and \"resume experts\", and only apply for jobs that I fit almost perfectly. After hundreds of applications I still can't get a single interview after graduation. All I got is rejection after rejection saying \"Your background is impressive, but we decided to pursue someone else.\" Yet, here you are, complaining about getting the worst interviewee. I have seen that complaint a lot, some CEO on Linkedin says 50-60% of their new hire are bad. Looks like the problem is the filtering system companies are using sucks and the HR specialists are doing terrible jobs by sending those unqualified ppl to hiring manager.\n\n  \nYou can give all the advices in the world, but if no changes are made on the employers' end, this situation will continue no matter what the job seekers do.",
          "score": 293
        },
        {
          "body": "Though I appreciate your points here, do you understand how painful it is to redo your resume a 100 times for applying to 100 different jobs only to be ghosted because the job is no longer applicable or they hired someone internally?\n\nBy following these points diligently, I should atleast score 2-3 interviews out of 10 applications and get a effing job. Is that too much to ask for?",
          "score": 269
        },
        {
          "body": "pretty basic common sense advice here. was hoping to hear more about these 50 bad candidates and why you think there are so many bad ones today",
          "score": 92
        }
      ]
    },
    {
      "title": "Interviewer Told Me I ‘Stalked’ Him on LinkedIn and Said He Doesn’t Care About the Job Description",
      "body": "So I just had one of the weirdest and most frustrating interviews ever, and I need to rant.\n\nI was interviewing for a Co-op role at a company, and like any normal, prepared candidate, I looked up my interviewer on LinkedIn beforehand as I was told who it would be. You know, to get a sense of his background, find some common ground, and be better prepared.\n\nWell, at the start of the interview, this guy straight-up calls me out and says, **\"So, you stalked me on LinkedIn\"**\n\nI thought LinkedIn was a professional networking site made for this exact reason. How is checking your public profile before an interview “stalking”? If anything, it means I cared enough to prepare instead of just showing up clueless.\n\nI had studied all the new concepts based on the job description that I didn't know, thinking that’s what they’d focus on. But at the beginning, the guy casually says, **“I don’t care about the job description and the information we provided.”**\n\nI studied for two days prepping based on the role they advertised, and here he is grilling me on completely random topics that weren’t even hinted at in the job post. No questions about my work experience, projects, or actual skills, just technical questions thrown at me.\n\nI get that I should have some baseline knowledge, but I’m a student. Why are they expecting expert-level knowledge for a co-op role? \n\nAt this point, the whole thing felt like a waste of time. If you don’t care about your own job description, why even bother posting one? And calling someone out for doing basic interview prep.\n\nMaybe I’m wrong for over-prepping or looking him up because I liked the company and thought the job description sounded cool but after this experience. Am I in the wrong?\n\n",
      "subreddit": "jobs",
      "score": 375,
      "url": "https://reddit.com/r/jobs/comments/1iv11dc/interviewer_told_me_i_stalked_him_on_linkedin_and/",
      "comments": [
        {
          "body": "Sounds like the interview was successful for finding out that working there would be horrible.",
          "score": 216
        },
        {
          "body": "nah, this interviewer is an asshole and you shoupd inform someone above him of their asshole response",
          "score": 611
        },
        {
          "body": "Sounds like you dodged a major bullet.",
          "score": 53
        },
        {
          "body": "This is a dangerous person.\n\n30 years as a talent management consultant. What we say matters. And intentions are important and interpretation can sometimes be even more important. Someone saying something like that presents the position that you have done something not only wrong but potentially illegal. That’s not a joke that’s not something to be said in jest, and even more importantly, it’s not something to be said seriously—without an undue amount of consideration. Now I’m belaboring this point because this more than anything else is keenly important. And very dangerous to someone’s reputation and even potentially their freedom. This could destroy a person. These words.\n\nSo I’ll wrap it up, never put yourself in a position to be anywhere near a person like this. Period. \n\nPlus, the fact that a job description is literally the blueprint for the position, and any competent professional would know and realize that, is another huge strike. Period, again.\n\nUnder no circumstances work for company that has even one of these individuals. \n\nNow give them no further energy, other than to be proud of yourself for not tolerating such behavior, and sharing your experience with us.",
          "score": 111
        },
        {
          "body": "Nope, literally what linkedin is for.\n\nFor every job I've gotten - I found the company on linkedin, looked at who follows or who posts, try to find people that work there, etc. \n\nThat's literally the point of Linkedin. Its actually not a place to jerk off over how much overtime you take and how much of a bootlicker you are. It is, or was, supposed to be a place where professionals can connect for professional reasons like advancing their career, learning new skills, etc.",
          "score": 25
        },
        {
          "body": "Report him to his bosses.  It sounds like you dodged a bullet.  Good luck with your job search.",
          "score": 33
        }
      ]
    },
    {
      "title": "Worst feeling is when you interview for a job, and it appears on LinkedIn again a day later",
      "body": "Really been doubting my interview confidence lately. Resume has been good enough to justify plenty of interviews but have had a hell of a time closing. Like how could I be so bad at interviewing that they'd rather keep the job open then fill my position",
      "subreddit": "jobs",
      "score": 673,
      "url": "https://reddit.com/r/jobs/comments/11g1gp1/worst_feeling_is_when_you_interview_for_a_job_and/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "You’re applying to multiple places. Companies are interviewing multiple candidates. Don’t get too precious on a specific role. It’s just business.",
          "score": 354
        },
        {
          "body": "You'll probably see it posted in another month, and 6 months, and a year from now. I had one I really wanted, 3 interviews, \"call you by Friday because it's just you and one other\", ghosted, reposted. Then posted again about every month for over a year. Went dark, then posted again and again.\n\nThey either aren't really hiring, have unrealistic expectations, or in that case may have actually hired someone finally and they quit in no time. Sometimes not getting a job offer ends up being a good thing.\n\nHad another last year that was almost as bad. Two candidates left, I was more qualified and experience that the person I'd report to so tough to say I wasn't a great fit for the job. Then nothing. Then I see that job posted again, and a week later I see the managers job posted, then more for the same role in the group. Something was going on there causing everyone to flood out the door.",
          "score": 86
        },
        {
          "body": "I feel ya.  I’ve had many great phone interviews that led to great in-person interviews, then I get “going in another direction”, aka the HR equivalent of “thoughts and prayers”.  I’m starting to think it’s my scarred-up face - I had an accident last year that “blew your nose apart” according to my surgeon, and I broke my cheekbone and orbital socket, so the two halves of my face are horribly mismatched, my eyes especially, and one half sags like an old crone.  Nothing like going into an interview knowing you’re *exactly* what they are looking for and being eager to work for the company and enthusiastic about the job (not necessarily just to finally have a job, income, and benefits, but really psyched about the job) just to hear, “sorry, you just weren’t quite good enough” again.  Especially in the “nObOdY wAnTs To WoRk AnYmOrE” atmosphere.  Like, yes, I want to work, I would be excited to do this job, and I’m willing to accept the compensation as-stated, and I would fucking rock your world with how amazing I would be at this job!  It’s not that I don’t want to work, it’s that nobody will hire me, and yet they aren’t willing to give me a reason or any feedback.\n\nMy last interview, the guy I would be working for was the interviewer, and we got on great.  Even discussed a new project he was working on and how, since I’m familiar with the software, I could assist him, walked through a bit of it, it really felt like I had this one in the bag.  Nope, “going in another direction”.  Like seriously, stop leading me on in the interview.  I’d rather have an uncomfortable interview where it’s pretty clear I’m not your choice and you’re just “going through the motions” than one that leaves me feeling good about it.",
          "score": 24
        },
        {
          "body": "I've seen this, and some reasons I suspect for it are:\n- Resume farming but not really hiring\n- Job posted but then budgeting declares hiring freeze and they forget to remove the listing\n- They hired someone but they quit relatively quick\n- Scam recruiter posting an old/closed/fake job posting (got this one a lot. I vet every recruiter and job listing now)\n- They're looking for a unicorn, like someone with 4 different unrelated specialties willing to do all 4 jobs for the pay of one (that one happened to me. I told them to pick a lane)",
          "score": 23
        },
        {
          "body": "That doesn’t mean they aren’t interested. I was hired and the same ad I applied through ran after I signed my acceptance letter. Sometimes they pay for like a month so they’ll just continue the add and take resumes in case.",
          "score": 14
        }
      ]
    },
    {
      "title": "Can someone explain what is going on with the job market?",
      "body": "I see everyone else is struggling too. Applying to hundreds of jobs, getting interviewed in person with the team, only to see the same listing on LinkedIn with over 100 applications days later.\n\nAre they just collecting resumes at this point?\n\nWhat the hell is going on?",
      "subreddit": "jobs",
      "score": 1036,
      "url": "https://reddit.com/r/jobs/comments/1o95xkv/can_someone_explain_what_is_going_on_with_the_job/",
      "comments": [
        {
          "body": "Mass layoffs mean a lot of smart, talented people in the pool and employers can afford to be picky. So yes",
          "score": 637
        },
        {
          "body": "The world is being prepped foundationally from the ground up and top down to eliminate as much human labor and payroll expenses as possible. This is what it looks like. Hiring freezes, mass layoffs, the majority of jobs are part time, $20/hr 15 hour a week gigs, or delivery service gig work. And this is going to continue until we see a total revolution, or until everyone's jobless, homeless, and unable to participate in a future that doesn't have a place for them anymore.",
          "score": 489
        },
        {
          "body": "I've seen the same job postings from some companies for 2+ years.\n\nClearly they have no interest in actually filling those positions.",
          "score": 70
        },
        {
          "body": "I think this is the situation. More and more companies are doing layoffs. This is pouring in more candidates into the already big bucket of jobseekers. \n\nWhen the economy is uncertain, most people and companies hang on tight to their money and curb spending, including adding new hires. \n\nSo it’s that unfortunate combination of less jobs with more and more people looking for work.\n\nThis puts the employers in a position where they can be and are super picky. They are looking for the unicorn. \n\nI’ve never had to go through rounds of interviews just to lose the job to another candidate. I interviewed every single week. Some would go to 4,5,6 rounds, including an assignment and an in person meeting.  \n\nI accepted an offer last week and will start my new job soon. \n\nAnyway, that’s my perspective.",
          "score": 92
        },
        {
          "body": "The government has systematically destroyed the US economy through trade disputes, federal layoffs, and the decimation of the American farm workforce. Sorry",
          "score": 489
        },
        {
          "body": "Yeah, I’ve been in that exact situation. I once had an interview scheduled, and just 10 minutes before it started, they told me the position had been filled. Then, two days later, I saw the same role reposted on all major job sites. I even emailed the recruiter twice after that, but the recruiter never responded.",
          "score": 36
        },
        {
          "body": "No more entry level work, administration trying to ruin our lives, economy is shit.",
          "score": 68
        }
      ]
    },
    {
      "title": "Why do recruiters act so SHOCKED we stand up for ourselves",
      "body": "I had 4 calls this past week thaat made me MAD 😡\nFrom 3 different companies\n\nSo if I ask for a hike that they promised in the Ad- They are shocked\n \n*Edit to add context*: the job said X on the listing and on call they said, the max we can offer is X minus 50% .. We just put X cause that's the range in the market \n\nIf I say I would like to work within 90 minutes one way.of commute they are shocked\n\n*Edit to add context*: literally it was beyond city limits. The company listing said City A , and the role was based on the outskirts of City A and B . \n\nIf I say I won't interview if I don't have a proper Job Description they are shocked\n\n*Edit to add context*: He actually said, come in for the interview then we will discuss the role...the \"Role is based on your experience \n(( I'm in Supply chain, and roles differ wildly based on product and service or which part of the chain you sit in (Ops, Quality, procurement etc) ))\n\nIf I don't make myself available for an interview within an hour as per their convenience they are shocked\n\n*Edit to add context*: I was in office, recruiter calls for a zoom meeting in an hour, I tell him I can I'm at work, he's literally like \" why can't you be available go into a conference room or something \" like BITCH I am at my JOB \n\nAnd then these same companies leaders put up LinkedIn posts on how they're fighting a War to get Talent in ..",
      "subreddit": "jobs",
      "score": 4481,
      "url": "https://reddit.com/r/jobs/comments/1611h0q/why_do_recruiters_act_so_shocked_we_stand_up_for/",
      "comments": [
        {
          "body": "Recruiters at staffing agencies are paid partially on commission and are heavily driven by metrics. \n\nRecruiters at corporate offices are partially driven by metrics, and are paid a salary with no commission\n\nGuess which ones are nicer",
          "score": 974
        },
        {
          "body": "Had a horrible interview yesterday.  At the end they asked me if I had questions for them, so I asked about onboarding.  Their response was \"I don't know, what do you think?\"  What. The. Fuck.",
          "score": 123
        },
        {
          "body": "While I've met some alright recruiters over the years, I feel like there's a ton of recruiters out there who are those \"hustle culture\" types.  The kind of people who see their job as an opportunity to polish their negotiation skills, and as it turns out, \"shocked\" can be a pretty strong negotiating position to maintain when you are trying to get folks to race to the bottom for a job.  Then there's just a strong contingent of recruiters who are simply call center workers reading from a script, and they get shocked when dealing with someone who breaks from their script.",
          "score": 261
        },
        {
          "body": "Shocked that I don't want to take a lower paying job with no benefits in a crappy part of the country.",
          "score": 152
        },
        {
          "body": "I’m a Recruiter and I hope more candidates continue to give pushback to recruiters, requesting things like JDs, salary ranges, etc. before entertaining a conversation. When all the cards are on the table, everyone can have a much smoother conversation. It drives me insane how many recruiters and even hiring managers take things personal when candidates advocate for themselves.",
          "score": 47
        },
        {
          "body": "Its a negotiation tactic. These people are professional bullshitters. Always remember that ;-)",
          "score": 39
        },
        {
          "body": "I got a job offer earlier this summer for a fully remote position. In the job description it listed like 10 states the position is approved to work from. When I got the offer I mentioned I was moving from the city they are headquartered in to a different approved state in the job posting and they got mad that I didn’t tell them sooner and ultimately rescinded the offer because they wanted someone who could commute into the office if needed. Like, then why list the job as remote? And why list any other state as a viable option? It was frustrating for both me and them.",
          "score": 29
        }
      ]
    },
    {
      "title": "What's working right now to land tech interviews? AI fluff? Reaching out on Linkedin? Etc.",
      "body": "I am a senior IT support person faced with the same issues as the rest of the tech world. So I am certainly not looking for a magic pill here,   \nJust curious what everyone else is doing to land the first screening/interview.\n\nThanks, And good luck everyone..",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1o1e3z8/whats_working_right_now_to_land_tech_interviews/",
      "comments": [
        {
          "body": "Assuming you have a good resume, applying early to a job posting is the most important factor.  You're 8x more likely to get an interview if you apply within the first 4 days of the job being posted.  On the 5th day, your chances drop dramatically.",
          "score": 2
        },
        {
          "body": "first thing would be to reach out to your network, anyone you've worked with or interacted with at previous companies and ask them for referrals, even if they're a 2nd degree connection at a place you want to work at. second thing I'd recommend is to not limit your searches to the big job boards like indeed and LinkedIn. a lot of jobs don't make it there plus the ones that do have a lot more competition. if you're not having luck with LinkedIn try searching on Meterwork, it links you direct to company sites and doesn't have ads so it's easier to spot fresh listings. builtIn is another good one.",
          "score": 1
        },
        {
          "body": "LinkedIn is a no show",
          "score": 1
        },
        {
          "body": "Filter LinkedIn postings to the last 24 hours + less than 10 applicants.",
          "score": -1
        }
      ]
    },
    {
      "title": "I got hired",
      "body": "I finally got hired. My background check came back minutes ago. This is so awesome. My wife's been bearing the weight of everything for quite some time now, and I can finally get back to contributing.\n\nI've applied to hundreds of jobs and this was the only interview I got. I showed up 40 minutes early, and by chance walked in the same time as the interviewer, he commented on that numerous times. I was nervous and told the interviewer (my new boss), he then changed questioning to casual conversation. I asked questions, not money stuff, actual questions about the job that I didn't know yet. I haven't been on an interview in over 25 years. Im 48M and was terrified. I wasn't even the most qualified, but I got it\n\nI hope everyone gets some good news soon.\n\nHappy 4th everyone, stay safe and best of luck, and a big thank you to all the significant others who help us out every day.\n\nEDIT : just to answer some questions, and a couple other things\n\nThe job is -   IT Operations Analyst, its for an international company, 3-12 hr remote shifts, 1 -6 hr shift on site\n\nI've been discouraged multiple times for over 2 years. I just had to shake it every time. I definitely felt my age had a reason I wasn't being hired. \n\nI made over a dozen different resumes. I paid to have my original look more professional, that didn't help so I put it through chatgpt multiple times and literally asked it to \"make me a kick ass resume that'll get me hired\"\n\nThe sites I was using was, builtin, LinkedIn and indeed. I got the job through indeed.\n\nI have no experience in the job and told them I'd learn anything they want to pack me. He said they will and train me in everything.\n\nAlso, I took the free month of LinkedIn premium which didn't do anything and I forgot to cancel so I got charged $40. So I took some of the courses and got 6 certifications out it it. If you have the time, join and take the free month of premium and stack certifications before the month is over. \n\n\n\n Edit to say thanx:\n\nI really want to thanks even for all the kind words and congratulations. It's been a long ride and I was lucky to get this opportunity. Im also lucky to have a supportive wife, who'll now get some breathing room. i wish you all the best of luck. Unfortunately things are super hard for a lot of us but we have to try and stay positive. Thanx again to everyone. You're kindness means the world. Please stay safe this holiday weekend. ",
      "subreddit": "jobs",
      "score": 1129,
      "url": "https://reddit.com/r/jobs/comments/1lqzss6/i_got_hired/",
      "comments": [
        {
          "body": "Happy for you",
          "score": 36
        },
        {
          "body": "Congratulations 🎉",
          "score": 22
        },
        {
          "body": "Well done brother. fight the fight",
          "score": 17
        },
        {
          "body": "Congrats! I just completed my first month at my new job after months of searching. It's rough out there, and glad you got one too!",
          "score": 15
        },
        {
          "body": "Congratulations 🎉🎉",
          "score": 7
        },
        {
          "body": "Congrats!   \n\nThe jitters happen...I had a phone intv yesterday &amp; felt my breath leave a couple words to die on the vine.  We get nervous - because it's important.  Yet, you persevered.\n\nBig Ups to your better half, and to your family a deserved  Independence Day.\n\n.",
          "score": 7
        },
        {
          "body": "Congratulations!!!",
          "score": 6
        },
        {
          "body": "this is fantastic and your new boss already sounds great and supportive!! cheers!",
          "score": 6
        },
        {
          "body": "Man this was a dope read! Thanks for sharing. I’m extremely happy for you and this gives me hope in my long search. I’m also in IT.",
          "score": 5
        }
      ]
    },
    {
      "title": "PSA: Don't ignore when someone offers to 'introduce you to someone'",
      "body": "JOB SEEKERS. FRIENDS. COLLEAGUES.\n\nI've been job hunting since December. Months grinding. Hundreds of applications, a few interviews, constant ghosting... you get it. Was literally asking my buddy last week if he knew anyone hiring at warehouses because I was getting desperate.\n\nThen a family friend out of the blue mentions he knows someone who might be able to help. I'm thinking great, another dead end, but whatever worth trying. Get the intro and suddenly i'm on a call with the CEO of some boutique marketing agency in NYC.\n\nThe CEO almost bailed. But we ended up talking for an hour instead of 15 minutes. I showed her some projects I'd been working on and she straight up called me a \"crazy genius\". Which im not... lol.  I'm ADHD as hell, I've just learned to replace raw IQ with pure grit.\n\nNow we're doing this 90-day trial together, she's pumped about it and is hoping I stay on full time at the end. I'm still processing tbh.\n\nThe best? She never asked for my resume. Never even mentioned it.\n\nFor anyone struggling there:\n\n* Your network is everything, even the random connections. \n* Always be ready to show your work when opportunity knocks. \n* Sometimes your breakthrough starts with \"hey want me to introduce you to someone?\"\n\nAnyone else have stories like this? Can't be the only one who got their break through a connections instead of the LinkedIn application black hole.",
      "subreddit": "jobs",
      "score": 1698,
      "url": "https://reddit.com/r/jobs/comments/1ldmqil/psa_dont_ignore_when_someone_offers_to_introduce/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 525
        },
        {
          "body": "\"Now we are starting a 90-day trial together\".\n\nYou don't have a job yet. Don't count the chickens before they hatch.",
          "score": 244
        },
        {
          "body": "My breakthrough job in ‘95 came from a co-worker recommendation.\n\nAn overseas expat job in ‘03 - Former Co-worker referral.\n\nCurrent position? - Head of department was former boss from job 16 years prior.\n\nYou cannot overstate the value of making (favorable) contacts.  You never know when it’ll pay off.\n\nI’ve personally overseen dozens of friends, former co-workers, etc getting hired from my recommendations as well.",
          "score": 39
        },
        {
          "body": "You guys get people offering to introduce you to someone?",
          "score": 75
        }
      ]
    },
    {
      "title": "Got laid off on the very second day..I am devastated",
      "body": "Yah ...as the title says..I started working yesterday in a dog daycare as a front desk. It was so chaotic with dogs checking in checking out, barking , coaches and managers relaying- yelling  on walkie taklie, pp calling on phone etc ..I was being trained by assistant manager. On my first day itself she told me this is a trial week and I would have to be certified at the end of my first week and then I can continue there. I told her this was never mentioned in the interview on that she said but every company checks if the employee is able to receive the training well and can do the Job. I told her yes, that's why companies have probation period !! But that's usually 1 or 3 month long. \nBut on my very second day I was called in managers office and told that I am not doing great. They need more clarity in my communication. Trainers are unable to understand me over walkies. I told them this is my very first time working in such setting and with walkies. But they told me we have to let u go.\nI am so disappointed and heartbroken.. after so long .. being unemployed for a long time I had got this job in this sick market. I don't have the courage to open LinkedIn adm start search again. I am devastated \nJust ranting so I can feel better. \n\nEDIT- yes, it should have been 'fired' instead of laid off. It was a mistake from my side.",
      "subreddit": "jobs",
      "score": 643,
      "url": "https://reddit.com/r/jobs/comments/1pcrl76/got_laid_off_on_the_very_second_dayi_am_devastated/",
      "comments": [
        {
          "body": "I had this happened but never got to second day only because they sent a text saying oh we found someone else and I was just temp when I wasn’t. It sucks but better things will come",
          "score": 165
        },
        {
          "body": "Consider it a bullet dodged.   You could have been there for a year and been miserable.  Instead, you got an opportunity to find a better position.  Don't sweat it.  Just resume your job search.",
          "score": 456
        },
        {
          "body": "I work in doggie daycare and I think you dodged a bullet, that place sounds like a shitshow.",
          "score": 160
        },
        {
          "body": "I'm sorry this happened to you OP. I went through a similar situation 2 years ago but it was with some kind of sketchy call center/backoffice center: they let me go at the end of my second day with the lame a$$ excuse that my \"performance was poor\" mind you that I was NOT ONCE given any feedback or tips to improve nor did I know how my \"performance\" would be measured.\n\n\nI'm sure that you dodged a bullet OP, just like other reply says. This experience says a lot about the job itself rather than yourself.",
          "score": 42
        },
        {
          "body": "As much as it hurts, trust me… you. don’t. want. to. work. there. Working with animals is romanticized a lot, but what they don’t tell you is how emotionally manipulative people who are in management at these kind of jobs are… I worked at an animal non profit for two and a half years… I love dogs… but… dog people… ugh. It was pure hell. They didn’t do their best to train you and take you under their wing. That’s on them. NOT on you. You will find something better with a better team.",
          "score": 51
        },
        {
          "body": "Oh, ew. \nOP, please, don’t be down over this. \n\nThat place sounds like a big mess!",
          "score": 16
        },
        {
          "body": "Yeah. Get it out of your system... Sounds like they have some management issues that they like working through, which can add energy and importance to tasks from the inside, but it's just chaos from the outside.  Consider it the first date, let this one go.    \n\nIf anything, figure out questions you will ask at your next interview to help find out if they operate out of chaos like this!  Not that you wouldn't take a certain job, but your questions and the org answers can reveal what you'll expect when you start.   Then if they say one thing and do something different, you'll know it's time to exit.",
          "score": 9
        }
      ]
    },
    {
      "title": "LinkedIn rejection during interview?",
      "body": "I literally had an interview for marketing role yesterday &amp; had sent my writing samples for the director as she interviewed me. She told me she would let me know next week. \n\nThis morning I get an email saying I will not move forward (generic rejection). I quickly send a follow up email this morning if it was correct and she has not responded. The other day though after sending my writing samples she responded that she received them. \n\nShould I move on?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1nfebe8/linkedin_rejection_during_interview/",
      "comments": [
        {
          "body": "Yes, keep looking.  Directors cannot respond to everyone, they just have too much on their plate and too many messages coming in daily.  In this economy rejection is common, do not take it personally.  Good luck with your search.",
          "score": 3
        }
      ]
    },
    {
      "title": "Scam? Being Asked to Download Webex for Interview and Can't Find the \"Recruiter\" on LinkedIn",
      "body": "Just got a supposed interview request from a recruiter who claims to be filling a role for a major international entertainment company. I did apply at this company. They're asking me to download Webex for the interview, and something just doesn't feel right about this. (Even though Webex is free.)\n\nFor one thing, the interviews are Thursday, Friday, and (weirdly) Saturday. The \"reply\" to accept the invitation gives no clues as to where the reply would be sent. (It's a long string of words and numbers.) \n\nPlus, I can't find the supposed \"recruiter\" on LinkedIn. And finally, the email uses British vs. American spellings. (\"Analyse\" vs. \"Analyze.\")\n\nScam or not?",
      "subreddit": "jobs",
      "score": 9,
      "url": "https://reddit.com/r/jobs/comments/1emjdrd/scam_being_asked_to_download_webex_for_interview/",
      "comments": [
        {
          "body": "Nothing about what you've said sounds overtly scammy.\n\n\nIf you want, send an email to the recruiter and clarify if it will be a face-to-face call, or a chat-based interview. If it's chat, that's your giveaway that it's a scam.",
          "score": 7
        },
        {
          "body": "How did it turn out?  I had the same request, which was odd because every company seems to use Zoom.  I installed WebEx, they sent me a message in WebEx.  I waited around 30 minutes, then logged out.  It was a big waste of time.  Was your recruiter named Buffy by chance?",
          "score": 2
        },
        {
          "body": " I got one as well, as a response to an actual Indeed application I made. I've gotten hella jaded about these, the responder used a gmail address (red flag!), and then asked me to download the software (red flag!), and reach out to her to schedule with it. Sounds ass-backwards and not industry standard. I looked on LinkedIn and didn't find her name affiliated with the company, and the messaged to actual recruiter  link on the original job post to see if she was legit.... waiting to hear back.",
          "score": 2
        },
        {
          "body": "These are scams. I’ve gotten two within the past two weeks, one was for a job I know I never applied for (which is what made me initially suspicious.) The other was a senior position when I’ve only been looking for entry level stuff which also gave me red flags. \n\nWhat concerns me is how well-crafted these emails are. The first one I looked into had a real job posting to match, and the “hiring manager” emailing me lined up with information present on linkedin. There are tiny things that seem off like the wording of sentences but if I had actually applied to the job I was emailed about I would be more inclined to believe they’re real at first.\n\nAnyway since the ones I got haven’t even been for jobs I applied for I’m confident these are scams so be weary.",
          "score": 2
        }
      ]
    },
    {
      "title": "Messaging the interviewer on LinkedIn after the interview – good or bad idea?",
      "body": "Hey everyone,\n\nI recently had an interview and was thinking about whether it's appropriate to message the interviewer on LinkedIn afterward. I’m not sure if it would come across as professional and thoughtful, or if it might seem like overstepping.\n\nI’d love to hear your thoughts – have any of you done this before? Did it help or hurt your chances? Would a simple thank-you message be okay, or is it better to avoid LinkedIn altogether and just send a traditional thank-you email (if that)?\n\nAppreciate any advice!\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1jt7hg1/messaging_the_interviewer_on_linkedin_after_the/",
      "comments": [
        {
          "body": "Personally, I think it would be awkward.\n\nI would use your recruiter for communication.",
          "score": 17
        },
        {
          "body": "If you're messaging them to say thank you there's absolutely nothing wrong with this. However, this is something you should do within 24hrs of the interview.",
          "score": 3
        },
        {
          "body": "If you contact me outside of the interview process for anything other than a simple thank you for the interview type communication, I have to report it to HR.  HR wants everything to run through the recruiter.  They want to know if people are trying to go around the process.",
          "score": 7
        },
        {
          "body": "It doesn't come across as professional, thoughtful or over-stepping.\n\nIt comes across as desperate and eager to please. Total \"Pick Me\" energy.\n\nPersonally, I treat every job interview as sales negotiation. They have a position to fill and I need/want a job.\n\nIn the interview you are both there to determine if it's a good match. \n\nIf you leave the interview having made a stellar pitch as to how/why you're perfect for the role and they disagree, you'll either be ghosted or you'll get an email saying \"Thanks but no thanks.\"\n\nBut if they agree you are the perfect candidate, then the ball is in their court AND they're more likely to start off with a reasonable offer lest they lose you to another company.\n\nWhy make any contact when the next move is on them? It's not worth the risk. \n\nIf you reach out now, you're showing your hand and losing any leverage you may have. At best they'll see they have the advantage and see how low they can go on an offer.\n\nThere's a common saying about negotiations, \"the first one to speak loses.\"",
          "score": 8
        },
        {
          "body": "I always send a thank you and reinforce to the interviewer a few hey points to remember about me about 24 hours later.  I think it helps set a tone of gratitude for their time but I make it short and sweet.  When I get the rejection email from a real human I thank them also and wish them success with their candidate and let them know in my research and the conversation I really wanted to be part of their company so hope if another opportunity comes along they will keep me in mind.",
          "score": 3
        },
        {
          "body": "Bad",
          "score": 3
        },
        {
          "body": "not a good idea…",
          "score": 3
        },
        {
          "body": "don’t reach out via linkedin. email them a thank you note directly to them if you have their email\nor ask the recruiter you’re working with forward your note to the interviewer. imo this is always accepted and usually seen as a plus. linkedin isn’t the right platform for it.",
          "score": 3
        },
        {
          "body": "Nope. You're being intrusive. Do not do that.",
          "score": 3
        }
      ]
    },
    {
      "title": "To the person that made a post about the 30-60-90 days plan. I will forever be in your debt",
      "body": "Today, I got a job, the HR called me to tell me this morning.\n\nJust before my third and final interview with the company, I saw a guy posting about doing a 30-60-90 days plan for an interview. I needed to prepare a presentation on my projects so I added this plan at the end and I really think that the people interviewing me liked it.\n\nI got a job and can't believe it. It was a humiliating process that I had to endure. On top of a shitty market (Canada), the recent tariffs by Trump, I had to go through this job hunt while there was a war in my home country where my parents currently live(middle east).\n\nGood luck for everyone applying, especially in Canada, for my job 500 other people applied. I saw that on linkedin (I was on my free trial period)\n\nI was rejected so many times, gained weight and even had to wash my clothes by hand in my bathtub to avoid paying fees in my building.\n\nIm glad its over. If anyone need help or tips feel free to DM. My biggest tip: tailor your resume for the job it really does make a difference\n\n  \nUpdate: Thank you all for the nice comments. I wasnt expecting this post to blow up like that but Im glad some people found it helpful. Im trying to answer all dms and so far I think Im on top of all dms, feel free to reach out if you think I can help you.\n\nThanks again everyone for being happy for a random stranger, really warms my heart like you cant imagine\n\nhttps://preview.redd.it/tx8be390zeie1.png?width=581&amp;format=png&amp;auto=webp&amp;s=572bc90c757b37afb72ae5d68215b416d1061322",
      "subreddit": "interviews",
      "score": 1968,
      "url": "https://reddit.com/r/interviews/comments/1imn54m/to_the_person_that_made_a_post_about_the_306090/",
      "comments": [
        {
          "body": "Congratulations on the new job and prayers for you and your family.",
          "score": 155
        },
        {
          "body": "What is 30-60-90 plan?",
          "score": 42
        },
        {
          "body": "Can you somehow link the 30-60-90 plan that you speak of?",
          "score": 25
        },
        {
          "body": "Awesome job! I don’t know you but I’m happy as hell for you.",
          "score": 17
        }
      ]
    },
    {
      "title": "Interviewer added me on LinkedIn after interview. Thoughts?",
      "body": "So, I'm interviewing for this company right now and the first round of interviews went quite well. To the point where the interviewer asked me to connect on LinkedIn. After connecting on LinkedIn, I messaged him after and asked if he had any pointers or advice for the next round and he gave me this response - \"Brush up on basic troubleshooting if needed and more common commands.   \n  \nFWIW I’ve been talking you up internally (no pressure). Let me know how it goes after you speak with \\*hiring manager's name\\* 😉\"\n\nIs this a good sign? I don't want to hype myself up and I want to stay even-keeled but could this potentially mean a job offer could be on the horizon? ",
      "subreddit": "interviews",
      "score": 52,
      "url": "https://reddit.com/r/interviews/comments/1fp93ay/interviewer_added_me_on_linkedin_after_interview/",
      "comments": [
        {
          "body": "Positive feedback, networking request, yeah that seems like a good sign.",
          "score": 47
        },
        {
          "body": "Had a hiring manager add me after the 3rd of 4 interviews. Didn’t get that role. However he was really communicative and said he thought I would be a good fit there.  One of the panel interviewers ended up sending my resume over to his team and I got that, somewhat related, job. ",
          "score": 30
        },
        {
          "body": "On your privacy settings, can they only view part of your profile? If so, they may have added you to view your full profile.\n\nMine is set to display basically role &amp; company but not detail,plus some other key info — a person has to be a connection to see the whole thing.",
          "score": 7
        },
        {
          "body": "Yes, those indicators can be good. I believe this interviewer likes you and sees you as a potentially good fit for the position. He asked to connect with you probably for a number of reasons: 1. To keep the lines of communication open concerning the hiring process. LI is convenient for recruiters to use and get quick responses, if necessary. 2. Recruiter sees you as a good quality candidate and wishes they could make more of you lol. Hence, 3. They hope to recruit someone in your network for other positions or possibly the same position if there is more than one. 4. Having a connection with you on social media gives them more intel about you, like whether you have a mutual connection or if your profile is consistent with your resume. If there are slight differences, I wouldn't worry too much about that.\n\nPay close attention to any advice they may give you in the process there or for elsewhere, could be nuggets.",
          "score": 3
        },
        {
          "body": "Knowing your gender &amp; age would provide a lot of helpful context here.\n\nOn the surface, it's OBVIOUSLY a good sign; however, the winky emoji could definitely be construed as a slight advance if you were the recruiter's type.",
          "score": 3
        },
        {
          "body": "Hey I know this thread was from 5 months ago, but just dropping in for future googlers to say I got added on LinkedIn last night by the hiring manager of a job I did 3 rounds of interviews for around 3 months ago. They called me today while I was looking at this thread to offer me the job 😂 \n\n\nCongrats OP on your offer too. Hope you're enjoying the job!",
          "score": 3
        },
        {
          "body": "Good sign for sure even though a little odd for them to do that. \n\n  Now that you have an in, you can keep them updated on your progress…\n\n“had an interview with x today. Discussed x and y and talked about my z experience. Thought the interview went well and i am looking forward to next steps! Thanks for the support. \n\n(keep it super brief)",
          "score": 2
        },
        {
          "body": "Neutral.  They connect with you on LinkedIn to make their information search on you easier, not because you are a shoe in candidate.  Easier to compare what you say in an interview, or what is in your resume to validate the information.  They can also gauge based on your connections and other information to build a profile if you are a good/poor fit.  If it was the HM connecting with you and communicating then that is more positive.",
          "score": 2
        }
      ]
    },
    {
      "title": "LinkedIn IC4 Infra Design and Implementation interview",
      "body": "Anyone recently interviewed for LinkedIn's Staff SDE role? Could you please share any details on what to expect for Infra Design and Implementation round?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nsdwz5/linkedin_ic4_infra_design_and_implementation/",
      "comments": []
    },
    {
      "title": "Look at this ridiculousness I saw on LinkedIn I deleted this from my sight as soon as I saw the 100 interview requirement",
      "body": "Look how many interviews this requires this is very disturbing ! SMH ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1kqp59a/look_at_this_ridiculousness_i_saw_on_linkedin_i/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "I mean they are teams interviews, not like they are asking you to drive in to the office. Why not? Least they are upfront about this process.",
          "score": 6
        },
        {
          "body": "Five interviews in total, including a pre-screen and a final rubber stamp with the CEO, isn't really that many. Especially when they're virtual. But hey. If it's not for you, it's not for you.",
          "score": 8
        },
        {
          "body": "At long as they’re all back to back this seems fine.",
          "score": 1
        },
        {
          "body": "I think it's the standard now sadly. I have my fourth and final interview scheduled for tomorrow, and if I don't get this job I'm gonna be pissed.",
          "score": 1
        }
      ]
    },
    {
      "title": "Should I put a project I did for an interview (but didn't receive an offer) on my Linkedin?",
      "body": "For context, I went through 4 rounds and two assignments at a company but ultimately never got an offer. However, the last project was a 16 page end-to-end strategy plan on expanding part of their business. I'm really proud of it and want to showcase it on my linkedin. The company's name is on it but I didn't sign anything, the company is not publicly traded so all data is hypothetical along with the prompt itself (hiring manager def used AI). The assignment is technically my intellectual property, no? Does it look bad to showcase something I did and it wasn't good enough to land me a job in the end?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1n4cmg0/should_i_put_a_project_i_did_for_an_interview_but/",
      "comments": [
        {
          "body": "No. You would need to remove any identifiable branding, or colors to put this in your portfolio.",
          "score": 3
        },
        {
          "body": "Absolutely used it. You can redact or change the company name. That’s your time, your IP, your property and your portfolio. People don’t get proprietary work for free.",
          "score": 2
        },
        {
          "body": "Yes you can showcase it \nBut no you wouldn’t want to reveal the company name. \n\nEven if it’s obvious to insiders though, all you’d need to do is black out the company name and any logos. \n\nIt’s fine",
          "score": 2
        }
      ]
    },
    {
      "title": "Talk to former employees on LinkedIn before you interview…",
      "body": "A recruiter for a 3rd party company (Recruit Up LLC) reached out to me for an interview for an Amazon Business Manager position for Kids2. \n\nThe job sounded like a dream - pretty decent salary, hybrid structure, and the company looked good on paper. \n\nFortunately, I reached out to a former employee on LinkedIn to get some feedback and I’m so glad I did. The company has gone through 3 rounds of layoffs this year due to the tariff war. \n\nTHREE. I asked one of the recruiters if she was aware of this. Crickets. I still completed the interview for practice honestly, but I had 0 intentions of moving forward since both companies are completely reckless and contributing to all the issues we’re seeing with the job market. \n\nIf you are in the Atlanta area, beware. These companies are jeopardizing people’s livelihoods and they aren’t thinking twice about the impact it’s having on society. Name and shame. All of them. ",
      "subreddit": "jobs",
      "score": 32,
      "url": "https://reddit.com/r/jobs/comments/1llutul/talk_to_former_employees_on_linkedin_before_you/",
      "comments": [
        {
          "body": "Isn't this like talking to an ex before dating someone?",
          "score": 15
        },
        {
          "body": "This cuts both ways though. There will also be lots of employees that break rules and get themselves fired, but refuse to acknowledge any responsibility for it, and just lambaste their old companies anyway.",
          "score": 7
        }
      ]
    },
    {
      "title": "I applied to 250 jobs. I am still unemployed.",
      "body": "I recently graduated college with a math degree. I didn’t think it was going to be this hard to find a job. I’ve been searching for about 3 months. \n\nI apply to jobs everyday and work on my resume. It seems like I am getting no where.\n\nSo far out of those 250 application, only 5 led to interviews. And 2 led to a second interview. That is 2% interview rate. And a 0.8% second interview rate. At this point it feels like the chances of getting a job is like winning the lottery.\n\nIve used indeed, career builder, and linkedin. \n\nI’ve gotten resume help from 5 different sources and they all said it was a good resume. \n\nSo far the only job offers I got were, Wendy’s cook and a janitor position at a warehouse… someone help me understand.\n\nEDIT: I would like to thank everyone for their advice and their own experiences. I will try to reply to most comments later tonight. I’ve gotten several PM’s, it’s hard to track all of them but I will respond!",
      "subreddit": "jobs",
      "score": 1519,
      "url": "https://reddit.com/r/jobs/comments/x2nv3p/i_applied_to_250_jobs_i_am_still_unemployed/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 231
        },
        {
          "body": "Idk if this helps but the job I got was number 260 something of like 275 I applied to\n\nIf you've got any relevant projects that you can mention in applications that would potentially help",
          "score": 312
        },
        {
          "body": "What actual career path do you want to pursue (I'm assuming it's not Wendy's or a warehouse)? What have your peers from college done to get into jobs? Are you making use of contacts you established in things like internships?",
          "score": 172
        }
      ]
    },
    {
      "title": "Over 700 applications as I watch the financial market burn",
      "body": "The outside world thinks I’m fine. Like the dog in the fire meme.\n\nTonight. This morning. 4am. I’m absolutely fucking terrified of the world and the future. I’m full of anger hatred and fear. For which there is no outlet. No relief. No end and no reprieve. I watch the financial world burn. This I feel now. I’m still a month away from making any money. Everyday a month away. Investments fall. There is nothing, no hope felt. No promise. No help. No chance. \n\nLinkedIn over 700 applications. I write cover letters for every job that accepts one. I take it personally when a company rejects my resume for several positions I’m very qualified for. I stay in contact with all the recruiters I can. I started cold calling everyone I’ve worked with. I apply to jobs within minutes of them being posted. I’m not holding out for any particular position just anything that will allow me to pay my mortgage.\n\n20 years of experience. I can’t get interviews. I’m studying leetcode. I made flash cards. Re-learning basic algorithm coding that I’ll never use in my job. I’m a frontend developer. I’ve always been a frontend developer. I’m turned away from jobs because I never went to college. I wanted to.\n\nThis post helps no one. It does no good. It puts nothing good into the world. But if you read it thanks. Thanks for hearing me cry. Thank you for listening to my tiny violin.",
      "subreddit": "jobs",
      "score": 736,
      "url": "https://reddit.com/r/jobs/comments/1jthbt5/over_700_applications_as_i_watch_the_financial/",
      "comments": [
        {
          "body": "This economy is teaching us that the correlation between doing everything right &amp; being only successful enough to have your stuff together is **very weak if not completely nonexistent**",
          "score": 336
        },
        {
          "body": "Unfortunately your job market is absolutely FLOODED with workers. Seems like every other kid over the last 10-15 years went to college for compsci. Now with AI helping to ease the workload it’s gonna become extremely hard to get a job in that field unfortunately.",
          "score": 141
        },
        {
          "body": "I used to be a frontend developer who went to college and got a job. Then I got laid off and couldn't find any work in my field. The sad truth is, our jobs are going away thanks to a combination of ai and overseas developers working for beans. It was a soul crushing realization that I had to get out. I trained for a job in another field and never looked back. \n\nI am not the only one of course. Several of my former coworkers left the field as well and work in unrelated jobs now. Some got jobs in the armed forces, state or local government agencies, others went to the healthcare fields as nurses, one is working at a post office. The government and greedy corporations have ruined the economy and are destroying the financial markets. All we can do is try to adapt as best we can because nobody is coming to rescue us.",
          "score": 55
        },
        {
          "body": "Not just you bro, I’m a UX/UI designer and engineer with 20 years of experience as well. \n\nAll of my savings are gone, my 401k is cashed out, unemployment is insufficient, and my tax return was pennies. \n\nAfter being laid off in Jan 24 I’ve only gotten one 6 month contract at a 40k pay cut in the last year. Network found me a few k in freelance work but that’s it. I’ve sent out 2k applications to anything under the sun. \n\nEven my GF making 50k can’t cover both our bills, and we live in a small 1-1 condo. We may have to move back in with my parents again at almost 40yo.\n\nBest advice I can give is plan for the worst and hope for the best;\n- Connect with EVERYONE in your support network\n- Get some rations and survival books together for worst case scenario\n- Reach out to any local government unemployment offices, temp agencies, and apply for any government support you can find. \n- Keep applying but try Hiring.Cafe (AI scraped job postings from company websites, and not job boards littered with fake or scam postings) \n- Try jobscan.co to optimize your resume’ for ATS for each job application\n- TAKE TIME TO REST. The state of our industry and country is shit, resting to maintain our sanity is more productive than burning ourselves out.\n\nDM if ya want to vent too.",
          "score": 77
        },
        {
          "body": "[deleted]",
          "score": 33
        }
      ]
    },
    {
      "title": "LinkedIn tips that actually help me get 13 interviews",
      "body": "Honestly, although LinkedIn is now full of fake job posts, it’s still one of the most commonly used websites for job seekers. Not only is it one of the largest job application platforms, but it also allows you to connect with recruiters and alumni for possible referrals and unpublished job openings, and take lessons from candidates' interview reviews. So, it has still helped me a lot in some ways. I summarized some tricks I generally used from job searching to interview prep stage:\n\n**Find jobs posted on LinkedIn in the past 1 or 2 hours instead of 24 hours**  \nSearch for your desired job and filter by “Past 24 hours”. In the url, change from 86400 to 3600 or 7200, 86400 represents 24 hours, 3600 is 1 hour, and 7200 is 2 hours.\n\n**Find the newest jobs that aren't posted on LinkedIn but are hiring.**  \nType-in a search query using this template: “Keyword” + “Role” or “Location”, keywords can be Hiring, Seeking, Looking, Opening, Recruiting...Examples: Hiring Data Scientist New York City.  \nClick posts and filter to show results from the last 24 hours.\n\n**Build your personal interview cheatsheets**  \nCollect questions shared by other candidates or any questions you're interested in. I usually use [AMA Interview](https://www.amainterview.ai/?utm_source=Reddit&amp;utm_medium=Reddit+Post&amp;utm_campaign=experience_share)'s chrome extension to predict interview questions directly from LinkedIn job postings, then give [ChatGPT](https://openai.com/index/chatgpt/) the predicted questions and my resume to generate sample answers for reference.\n\n**Filter out referrals directly posted by team members**  \nType in #referral and filter by “Posts” and you should see post from hiring managers or recruiters posting about openings on different roles.\n\n**Boost your visibility to HR by endorsing your skills.**  \nWhen a recruiter searches for something like Python or SQL, LinkedIn doesn’t just show every profile that lists the skill, It prioritizes profiles based on how many endorsements each skill has. If I have 15 I rank higher. That tiny trick will boost your visibility, pick 5–10 skills that are relevant to the jobs you want. Add them to your profile, ask your friends and classmates to endorse you.\n\n**Build your own outreach cheatsheets**  \nSome recruiters posted their emails on their LinkedIn pages, so I collected them and built my own cold email list. Be polite, don’t sound too desperate, and make sure to show your understanding of and interest in the companies they work for.\n\n**Follow recruiters and team leaders.**  \nThey often post job openings directly on their LinkedIn pages instead of publishing them. In this way they’ll ask you to comment your BG under the post or leave your email. If your BG fits what they’re looking for, they really will reach out you for an interview.",
      "subreddit": "interviews",
      "score": 176,
      "url": "https://reddit.com/r/interviews/comments/1kghm06/linkedin_tips_that_actually_help_me_get_13/",
      "comments": [
        {
          "body": "Super solid tips, especially that URL time filter trick, most people don’t know about it but it can be really helpful to get in early before the flood of applicants.",
          "score": 12
        },
        {
          "body": "gtfo this is just a shitty ad for your AI generated interview question “product” \n\n/u/DefinitelyGallagher",
          "score": 10
        },
        {
          "body": "Thank you I remember this last time about 1-2 hours… that is where I have gotten the most traction",
          "score": 4
        },
        {
          "body": "Really love the tips! Any tips for new grad mailing or searching?",
          "score": 2
        },
        {
          "body": "Nice tips! But any suggestions on how to avoid job posting which are sponsored and keep showing up, even after applying for that job?",
          "score": 2
        },
        {
          "body": "This is gold. That skill endorsement trick is underrated. Have you seen a noticeable difference after doing that? I'd love to hear what worked best for converting interviews to offers.",
          "score": 1
        },
        {
          "body": "These tips are gold—LinkedIn’s still a game-changer if you treat it like a research and networking tool, not just a job board.",
          "score": 1
        },
        {
          "body": "I remember when I was job hunting I stumbled upon mytrudy a platform that uses personality science to match you with jobs where you would thrive It was a game changer for me after taking their personality quiz and sharing my work history I received tailored job matches that aligned perfectly with my strengths this personalized approach not only boosted my confidence but also made my applications stand out Have you ever tried incorporating personality assessments into your job search strategy?",
          "score": 1
        }
      ]
    },
    {
      "title": "LinkedIn tips have landed me more interviews",
      "body": "I’ve been using OfferGenie to help my job applications, and it really made the process easier and less stressful. After researching optimization techniques, my profile views doubled, and I landed more interviews! Today, I’m excited to share these practical strategies to help you make the most of LinkedIn in your job search.\n\n1. **Capture “prime time” job opportunities**\n   * Adjust time filters: Change URL parameters from “&amp;f\\_TPR=r86400” (24 hours) to “r3600” (jobs posted within 1 hour) or “r7200 “ (jobs posted within 2 hours) instead of the default “last 24 hours” filter.\n   * Why it works LinkedIn's algorithm prioritizes job seekers who applied within the hour, giving you a competitive edge.\n2. **Discover hidden job listings**\n   * SEARCH SMART: Use keywords like “hiring” or “looking” or “join us” in combination with your job title and target location or company.\n   * Focus on jobs: Switch to the “Jobs” tab and filter for jobs “in the last 24 hours”.\n   * Identify decision makers: Prioritize posts that focus on department heads or project managers (direct decision makers) over general HR posts.\n3. **Getting on the “insider” bandwagon**\n   * Join company groups: Add yourself to targeted company groups (e.g., “Microsoft Engineers Alliance”) to appear as part of an insider network.\n   * Enhance your profile: Include “insider connections” in your experience - even if it's just for show - to increase the visibility of your profile when recruiters are searching.\n4. **Improve the efficiency of your job search with these free tools:**\n   * Hunter Chrome Plugin Extract HR emails directly from your company's website or LinkedIn to ensure your resume goes straight to the right inbox.\n   * OfferGenie Experience realistic mock interviews and get instant feedback to quickly refine your answers, boost your confidence and improve your performance in real interviews.\n\nWhat LinkedIn job search tips have worked for you?",
      "subreddit": "interviews",
      "score": 202,
      "url": "https://reddit.com/r/interviews/comments/1jlqlsx/linkedin_tips_have_landed_me_more_interviews/",
      "comments": [
        {
          "body": "Hi there, thank you for such detailed insights. I really liked the time filters adjustment idea changing the url parameters and will try this out. Can you please elaborate the point on including insider connections in your experience to increase visibility? I am not sure I understand it. I can DM you if it’s easier to share more information",
          "score": 6
        },
        {
          "body": "Love point 2. I never get through HR. Whatever few interviews I have gotten is when the hiring manager sorted my resume(ideally when I applied for small companies). It’s a different thing that am still looking. But I have experienced this as well.",
          "score": 3
        },
        {
          "body": "Great advice! Thanks! I just learned about joining company groups and commenting on their posts from a LinkedIn trainer at my alma mater. I’m also thinking about following in the footsteps of a friend who has a bunch of recommendations from former colleagues and employers not just “skill endorsements” which makes her page stand out.",
          "score": 1
        },
        {
          "body": "Great advice.\n\nI found that unless you are applying to a job within the first 24 hours it’s posted they aren’t even looking at you. \n\nLinkedIn ect works too well companies get flooded with resumes. And if you’re the 1000+ shopper … chances are you won’t even make an interview.",
          "score": 1
        },
        {
          "body": "Optimizing your LinkedIn isn’t just about visibility—it’s about showing up early, showing up smart, and showing up where decision-makers are actually looking.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is it okay to message interviewer on Linkedin?",
      "body": "I am currently optimistic about this role and I have gone through 3 stages of interviews. This company has been very slow in terms of getting back to me after an interview. I had a final interview for the role  on the 3rd of June and I was assured an update on the 9th (The following Monday) but I still haven’t heard anything from them. I'm at a point where my life is currently at a standstill just because of this job, reason being that I have put so much time and resources into the preparation of the interviews. I have reached out to the hiring team via email and there has been no response. I recently connected with person who interviewed me for this role via Linkedin and I have been contemplating on if I should ask him for an update concerning the Interview or not. Please what do you guys think I should do in this situation?",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1lqndx3/is_it_okay_to_message_interviewer_on_linkedin/",
      "comments": [
        {
          "body": "You had the final interview on June 3rd, it’s now July 3rd and they haven’t responded to your email inquiry…I wouldn’t be optimistic. ",
          "score": 20
        },
        {
          "body": "I don't think you've got anything to lose at this stage. It shows you are still interested. I waited 3 weeks to hear back from two interviews. I messaged the hiring manager for one of them on LinkedIn as I had already connected with her via an ex-colleague who works at the same company. They didn't make a decision for just over 3 weeks but then went with another candidate who had more experience in that type of role. However, I got really good feedback from the hiring manager via LinkedIn. They want me to apply for other jobs there in the next few months that are more aligned with my experience.",
          "score": 2
        },
        {
          "body": "I would move on",
          "score": 2
        },
        {
          "body": "Looking at your comments,iIf this company was this slow giving interviews I would not have put much effort into the interviews for this role. I hope you applied to other jobs while you were waiting for the next steps. Since its been a month now since you had your last interview I do not feel they are going to hire you on. You can contact the hiring manager on LinkedIn if you want asking for an update as you never heard back. If they ghost you on that message than you got your answer.\n\nThis is why I hoped you applied to other job opportunities while you were waiting.",
          "score": 2
        },
        {
          "body": "Do it. I’ve done it before with mixed success. Nothing to lose",
          "score": 1
        },
        {
          "body": "I think it's okay to contact them for an update on LinkedIn. However, you should continue to apply for other jobs. It's very likely that they've hired someone for the position, and you've been ghosted.",
          "score": 1
        },
        {
          "body": "At this point it's unlikely you received the job, I think something that is not pushy in terms of asking for a response along these lines would be appropriate:\n\n\"Hi Hiring Manager,\n\nThanks for considering me for your XXX role, I am guessing you have gone with another candidate as it's been a few weeks and would like to be considered for opportunities on your team in the future.\"",
          "score": 1
        },
        {
          "body": "Forget it. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Did 2 round of interviews-rejected because of referral LinkedIn",
      "body": "Hello \n\nI did an interview for a Senior Data Scientist position through a consulting company. I did a regular and technical interview and cleared both. They sent me links to references which both my referrals filled, I gave them the business emails aswell. The firm reached out stating that they did a referral search on LinkedIn and the manager I put did not show on LinkedIn and therefore they can’t consider me for the role since they can’t verify the referral. \n\nI told them I can have my former manager call and I literally gave them his work email through which he filled the referral link.(it’s a well known company) so it’s not like I can fake it. \n\nThey never informed me of such LinkedIn cross check or I would have asked another manager with a LinkedIn. Should I reach back out or just let it go? Kind of sus of them to go through 2 rounds and just drop it",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1of0skk/did_2_round_of_interviewsrejected_because_of/",
      "comments": [
        {
          "body": "It almost feels like they used that as an excuse. Move on. If you managed to make it two rounds, that means you are close to finding a job elsewhere. Keep going.",
          "score": 3
        }
      ]
    },
    {
      "title": "Did anyone interview with LinkedIn for their Ops team?",
      "body": "Wondering how long it usually takes to hear back and whether they are slow like Microsoft when it comes to offers or pretty fast?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1noxmgy/did_anyone_interview_with_linkedin_for_their_ops/",
      "comments": []
    },
    {
      "title": "Am I crazy, or is the entire office job market just a dumpster fire right now?",
      "body": "It makes my blood boil. It took me 14 years of grinding it out in a government desk job to finally hit $32 an hour.\n\nEvery time I'm on LinkedIn or TikTok, my entire feed is full of people with marketing degrees and years of corporate experience talking about how they've sent out hundreds of applications and can't even get an interview.\n\n  \nEdit: Unemployment is increasing very noticeably according to the currently available data, and this is a worrying thing.\n\nMy advice to anyone is to do anything to get a job, even if you have to travel to another state, work harder, and learn new things about the job market and employees.\n\nLearn how to deal with AI and take information from it that you formulate yourself, but don't just copy and paste because it will be obvious, and that will diminish you as a person.\n\nPay attention to the ATS system for jobs, and many sites offer them, like [Resume Kit](https://resumekit.interviewhammer.com/).\n\nYouTube is a treasure in your hands; it has all kinds of videos from which you can learn interview loopholes. You can search for [interview tips](https://www.youtube.com/watch?v=BWqebQSHSEM).\n\nGood luck.",
      "subreddit": "interviews",
      "score": 759,
      "url": "https://reddit.com/r/interviews/comments/1na0hhy/am_i_crazy_or_is_the_entire_office_job_market/",
      "comments": [
        {
          "body": "You’re not crazy. For unemployment, I’m supposed to apply to three jobs a week. The unemployment report released this week doesn’t surprise me. I’ve been keeping a spreadsheet because it’s getting hard to not reapply to the same job.",
          "score": 127
        },
        {
          "body": "If you're in the US, yesterday the *new* head of the US Department of Labor (after the last one got fired for delivering job data that was \"too negative\"), released the lowest job-creation numbers we've had since the pandemic in 2021; ~~August was the~~ [~~worst month~~](https://www.yahoo.com/news/articles/august-worst-month-job-growth-182800643.html) ~~for job growth this year~~—22,000 jobs created last month compared to 71,000 in August of last year. Eight months into last year, we had added 1.14 million jobs—this year, only 598,000 new jobs. We officially have more people looking for work than job positions available. You're not crazy.\n\nEdit: A helpful commenter pointed out that two days ago, the Bureau of Labor Statistics revised the June numbers from a gain of 14,000 to an actual net **loss** of 13,000 jobs (\"Monthly revisions \\[are a common and part-of-the-process\\] result from additional reports received from businesses and government agencies since the last published estimates and from the recalculation of seasonal factors.\") That makes *June* the worst month for job growth this year and that's not counting agriculture/farms.\n\nEdit 2: The new Commissioner of the Bureau of Labor Statistics is an interim guy named William Wiatrowski that is holding the spot after the previous lady was fired by the president for putting out job numbers that were deemed too negative by the president. The president's pick to take over the BLS is E.J. Antoni from the Heritage Foundation/Project 2025.",
          "score": 76
        },
        {
          "body": "We're in a recession. Everywhere i apply to is only hiring internally. Its a huge mess.  I may have to move back with my parents if things don't change soon.",
          "score": 63
        },
        {
          "body": "I can’t even get interviews for jobs that are $20-$30k pay cuts from the job I was illegally laid off from. It’s brutal.",
          "score": 24
        },
        {
          "body": "I’m happy that I can run my small farm growing falafel.",
          "score": 19
        },
        {
          "body": "Crazy thing to me these days is all the people working multiple full time remote jobs. I have friends doing it and they work 2 or 3 roles and make 300k a year… and at the same time it’s taking people over a year to find their next job. Crazy times.",
          "score": 18
        },
        {
          "body": "Struggling and sadly glad I’m not the only one who sees the reality of the market right now. I truly thought I was lacking something in getting hired, but slowly realized there are a LOT of us out here looking, and many are taking work they are overqualified for just to have something.",
          "score": 12
        }
      ]
    },
    {
      "title": "Recruited for an interview but LinkedIn has be questioning.",
      "body": "I was approached by a recruiter to interview for a position. I did some very cursory research and can see most people who work at this company have only been there a few months. I feel like this is a red flag. Is there anything I can ask in the interview about longevity in a role without it sounding bad?",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1lkdru0/recruited_for_an_interview_but_linkedin_has_be/",
      "comments": [
        {
          "body": "You can ask about company goals or what projects they’re working on",
          "score": 3
        },
        {
          "body": "The company might be brand new. It does not hurt to ask at all. You can ask how long they been in business and ask about the longevity of the business. Is the business growing? Those are legit questions to ask and is recommended. This is to plan ahead just in case they go to the hole and lay you off.",
          "score": 3
        },
        {
          "body": "Totally fair to be cautious. You can ask something like, ‘What’s the typical team tenure like?’ or ‘How does the company support long-term growth for employees?’ .....shows curiosity without sounding negative",
          "score": 2
        },
        {
          "body": "Just watch out for scam attempts involving work or money. LinkedIn is mostly (legitimate) social engineering and circlejerking, so make sure these are actual real people first.\n\nIf it is too good to be true then most likely it is a scam.",
          "score": 2
        },
        {
          "body": "It's fair to be wary. There are plenty of legitimate reasons why people have a short tenure. The company may have actually done a recent fundraising round, for example, and might be hiring aggressively. It would be worth seeing any recent posts they've done on their company blog, or checking websites like Crunchbase to see if they've had any recent announcements that would help explain it. That gives you the added bonus of researching the company a little which will help you craft more targeted questions you want to ask in an interview that helps you to demonstrate you've done that research and have a genuine interest and curiosity in what they do. Good luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "is it bad that i messaged someone in the prospective team on LinkedIn after first interview with HR?",
      "body": "I just had an initial call with a recruiter this morning and was really thrilled about the role and also the company. I decided to shoot a message to someone who's already in the team at the company asking to connect and chat about what the role looks like day-to-day. He was eager to reply at first (i didn't start off by saying i already interviewed 1st round) but completely ghosted me after i mentioned i already talked to recruiter. did this blow my chance? am i doomed? i read that they aren't supposed to talk to candidates as they might have to interview them in the next round.... what should i do",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1lv98zt/is_it_bad_that_i_messaged_someone_in_the/",
      "comments": [
        {
          "body": "you’re not doomed you’re just early  \nthis happens all the time  \nyou showed initiative and curiosity, which is great  \nbut yeah some ppl freak out once they realize there’s a process line they’re not supposed to cut  \ndon’t overthink it  \nkeep it moving  \nprep for round 2 like that message never happened  \nif they liked you on the first call, one random DM won’t tank it\n\n[NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some sharp takes on job hunt moves that *actually* matter worth a peek",
          "score": 2
        },
        {
          "body": "That was inappropriate.  Hopefully I’d didn’t hurt your odds but if the team is close and has a good culture. There’s a pretty good chance the hiring manager already knows.",
          "score": 2
        },
        {
          "body": "You're overthinking. As u/Thin\\_Rip8995 said, just keep going and prep like nothing happened.\n\nMaybe the person is just busy and don't check LinkedIn everyday. A lot of people that are not jobseeking are not active on Linkedin. Maybe they just stopped replying because they don't want to interfere in the process or are just not sure how they should interact in this case.\n\nThere's no way to know what happened and each company has its own policies. There's no one size fits all answer here. But usually simply asking about the company and role doesn't \"doom\" anything.  \n  \nSo focus on what you have control over and good luck.",
          "score": 1
        }
      ]
    },
    {
      "title": "LinkedIn tips helped me land 13 interviews directly with managers, without even submitting any applications",
      "body": "I’m a huge loyal LinkedIn user, I might miss text messages, but I never miss anything on LinkedIn. To me, it’s not just a job application website; it’s a platform that connects me with team leaders far beyond my own network. The first principle of using LinkedIn for students or new grads like me is: never feel awkward if your connection request gets ignored, or if people notice you’ve viewed their profile. Our goal is to land a job or internship, sometimes, let’s be real, pride isn’t the top priority lol.\n\nFollow as many recruiters and team leaders as you can find. They often post job openings directly on their LinkedIn pages instead of publishing them. In this way they’ll ask you to comment your BG under the post or leave your email (so having a professional LinkedIn profile is super important!!!). If your BG fits what they’re looking for, they really will reach out you for an interview!!!\n\nUltilize free Chrome Extension. I dug out 2 completely free extension from Reddit that saved me a lot of time: one is [AMA Interview](https://www.amainterview.ai/?utm_source=Reddit&amp;utm_medium=Reddit+Post&amp;utm_campaign=experience_share) which can predict interview questions for LinkedIn job posting, and give me answer examples for reference, but I will polish again by combining it with my background.\n\nCollected Recruiters’ Emails. Some recruiters posted their emails on their LinkedIn pages, so I collected them and built my own cold email list. Be polite, don’t sound too desperate, and make sure to show your understanding of and interest in the companies they work for. I got 13 interviews out of over 300 cold emails!\n\nHow to find jobs posted on LinkedIn in the past 1 hour. Just change 86400 in the URL to 3600, 86400 = 24 hours, and 3600 = 1 hour. Big thanks to the guy who figured this out and shared it, you saved my life...\n\nTricks I learned on LinkedIn: Endorse your skills. When a recruiter searches for something like Python,  LinkedIn doesn’t just show every profile that lists the skill, It prioritizes profiles based on how many endorsements each skill has. If I have 15 I rank higher. That tiny trick will boost your visibility, pick 5–10 skills that are relevant to the jobs you want. Add them to your profile, ask your friends and classmates to endorse you.",
      "subreddit": "interviews",
      "score": 79,
      "url": "https://reddit.com/r/interviews/comments/1jzglfp/linkedin_tips_helped_me_land_13_interviews/",
      "comments": [
        {
          "body": "Similarly, when you apply for a role on LI, make sure you follow it up with a note to the recruiter, or someone high up in the dept where you’d like to be, as well as anyone who may be connected to you and ask for a referral.  Doing this landed me 7 interviews last week.",
          "score": 1
        },
        {
          "body": "Yeah I've been using the timer trick on the url as well, love the secret is out!\n\nIf you're using Simplify, you might also want to check out [Runmagi](https://runmagi.com) . It's a job app tracker that syncs with your Gmail to automatically update your application statuses based on your email threads. It also summarizes past communication with recruiters/hiring managers and helps draft smart replies using AI. Super useful if you're applying to a lot of roles and want everything in one place — kind of like a smart Kanban board + AI assistant rolled into one.",
          "score": 0
        }
      ]
    },
    {
      "title": "7 Months, 1830 Applications, 30 Interviews, and One Great Offer!",
      "body": "For the past seven months, I’ve been on an intense job search journey. Throughout this time, I submitted a total of 1830 applications across multiple industries and roles, using platforms like: \n\n✅ LinkedIn Jobs &amp; Indeed\n✅ Jobs.ie\n✅ IrishJobs.ie\n✅ Direct Referrals\n✅ University Job Boards\n✅ PublicJobs.ie\n✅ Funding Organization Listings\n\nI went through around 30 interviews—some of them took me all the way to the final round, only to end in rejection.\n\n💡 Did I feel demotivated? Absolutely.\n💡 Did I want to give up? More times than I can count.\n💡 But did I stop? Never.\n\nThere were days when I felt like I was applying into the void, getting no responses, or facing rejection after rejection. Some of the toughest moments were making it to the final interview stage—only to be turned down.\n\nBut I kept pushing forward because I knew that all it takes is one yes. And finally, that yes came🙏🏻\n\nNow, I have an officially offer and I also have one more interview still in progress.\n\nIf you’re currently in the middle of your job search, don’t give up. Rejections are painful, motivation fades, but opportunities will come if you keep going.\n\n💡 1830 applications, 30 interviews, 1 offer. That’s all it takes.\n💡 Keep pushing. Your ‘yes’ is coming too. \n",
      "subreddit": "interviews",
      "score": 1278,
      "url": "https://reddit.com/r/interviews/comments/1j41xi7/7_months_1830_applications_30_interviews_and_one/",
      "comments": [
        {
          "body": "First off, huge congratulations! I really hope you crush it in your new role. That being said, as many have pointed out, bombarding hundreds or even thousands of job applications isn’t the way to go. With features like auto apply and easy apply, you’re not going to get the traction you’re hoping for. The real strategy is to find job listings that align with your skills (on LinkedIn, Indeed, etc.), and then double-check the company’s website to ensure the job is posted there too. You’ll quickly notice that only about 3 out of 10 listings are actually legitimate.\n\nOnce you’ve found the real opportunities, make sure you tailor your resume and cover letter to each specific job. If possible, apply directly on the company’s website. Trust me, you’ll get far better results from sending 10 well-crafted, targeted applications than blasting out hundreds of generic ones. Before you know it, you'll be getting those interview invites rolling in.\n\nRemote job hunters should read these Reddit posts:\n\n[https://www.reddit.com/r/RemoteJobseekers/comments/1fdpeg2/how\\_i\\_landed\\_multiple\\_remote\\_job\\_offers\\_my\\_remote/](https://www.reddit.com/r/RemoteJobseekers/comments/1fdpeg2/how_i_landed_multiple_remote_job_offers_my_remote/)\n\n[https://www.reddit.com/r/jobs/comments/1i9vl5z/i\\_searched\\_for\\_a\\_job\\_for\\_7\\_months\\_and\\_finally\\_got/](https://www.reddit.com/r/jobs/comments/1i9vl5z/i_searched_for_a_job_for_7_months_and_finally_got/)\n\nGood luck..",
          "score": 56
        },
        {
          "body": "Congrats",
          "score": 7
        },
        {
          "body": "Glad you got the offer, but you have to tailor your resumes and filter you search a little. Totally unqualified? Probably shouldn’t apply. Somewhat unqualified? Apply.",
          "score": 8
        },
        {
          "body": "I am at application number 649. And 10 interviews with all ending and rejection. Only halfway there. Wow such a long way to go. Way to hang in there. So there is hope.",
          "score": 4
        },
        {
          "body": "My last job search round a few years ago, I found a job posting site for my state (Illinois) and I went through EVERY listing.  It took months but I just found they had everything in one place.  No redundancy (jobs reposted by the same company repeatedly).  Found a job by carefully looking at a listing and having all my skills align with what they asked for.  Got a job in one interview. \n\nIt was rigorous but that's my nature.  Reporting all job searching efforts to the unemployment office was easy, too.  When I applied for a job, I took a screenshot of my application sent and they were able to tally up my counts effortlessly for them.  It was worth the effort because I didn't have to wait for a call, I just sent in my records, the unemployment person went over it with me weekly and then gave me accreditation for my honesty and conscientiousness.",
          "score": 3
        },
        {
          "body": "Congratulations (from 🇺🇸) ! I was in the same boat. Close to 5 months of job search and 1600+ applications and just got an offer !!",
          "score": 3
        },
        {
          "body": "Congrats",
          "score": 16
        }
      ]
    },
    {
      "title": "do you send LinkedIn requests to the people you are interviewing with? if so, before or after you meet them?",
      "body": "Naturally, i look up the folks I am going to be interviewing with, and view their LinkedIn profile. There's a percentage that will know I saw it....so do you just go ahead and send them a linkedin request anyway? do you do it before or after you meet them?\n\nsometimes ill do it after i meet them, if i feel like the conversation went great. if i forget to do it then, ill do it if i am in the final round",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1hbuluw/do_you_send_linkedin_requests_to_the_people_you/",
      "comments": [
        {
          "body": "I don’t. I wait til they do if they do. Which usually doesn’t happen until you’re hired.",
          "score": 6
        },
        {
          "body": "[deleted]",
          "score": 7
        },
        {
          "body": "If I know all names before the interview, I will flip my account to private viewing and check them out. I don't send them requests. I've done a number of government interviews for state and local government and often don't know all names on the panel until I'm in the interview",
          "score": 3
        },
        {
          "body": "I usually do after I meet them.",
          "score": 2
        },
        {
          "body": "I rarely even add people unless I’ve worked with them. I see no benefit to having 500+ connections of people that I don’t know professionally. Some of the people I work with shouldn’t have even been hired to begin with.",
          "score": 2
        },
        {
          "body": "No way, they don’t want to be bothered.",
          "score": 1
        }
      ]
    },
    {
      "title": "I have an interview soon and my interviewer connected with me on Linkedin, should I reach out ?",
      "body": "As the title says I have an interview next week and I was informed who I will be meeting with.  I looked them up a day ago on Linkedin but did not connect. This morning I found a connection invite from them ! I accepted it but now I am wondering whether to reach out or not before the interview.\n\nFor context I am a junior biotech (B.sc.) graduate and the position is a sales associate at a sequencing solutions focused company.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1lmk3tp/i_have_an_interview_soon_and_my_interviewer/",
      "comments": [
        {
          "body": "As a recruiter, i think you should not reach out to them before the interview.",
          "score": 9
        },
        {
          "body": "The fact that they reached out to connect on LinkedIn is actually a positive sign - it means they're already thinking about you and potentially building rapport before the interview.\n\nI'd keep it simple and professional. You could send a brief message like \"Hi \\[Name\\], thank you for connecting! Looking forward to our conversation next week about the sales associate position.\" That's it. Don't overthink it or try to \"pre-interview\" via LinkedIn.",
          "score": 2
        }
      ]
    },
    {
      "title": "Got a call from HR but that comp. Is not showing in linkedin should i attend the interview??",
      "body": "I got a call today from HR. for job opportunity and when i searched abt that in linkedin, Glassdoor I didn't find that company so is that company a scam/ fake ??... so should i give interview ??",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1kf98ij/got_a_call_from_hr_but_that_comp_is_not_showing/",
      "comments": [
        {
          "body": "Scams are becoming rampant and you should definitely be on your guard. Definitely don’t send any money or personal information like bank details or passport copies or anything like that.\n\nThat said, not every company is on LinkedIn or Glassdoor. Do they have a website? Have you Googled them?",
          "score": 1
        },
        {
          "body": "The company itself may not have a LinkedIn presence, but what about people working there? Can you find any of their employees? If you can't, that's a big red flag.\n\nDo a whois domain lookup and see when the company's web site was registered. If it is one that's less than a year old and is only registered for 1 year, that's almost surely a sign of a scam. Scammers will slap together a decent-looking web site, but register it for no more than a year. \n\nAlso, just Google the company and see if it is mentioned in any other 3rd-party sites, news articles, etc.",
          "score": 1
        }
      ]
    },
    {
      "title": "Data Science Interview at LinkedIn - Any Insights?",
      "body": "This is my first Reddit post, and I'm looking for help preparing for an upcoming data science interview @ LinkedIn. I'm feeling incredibly anxious. Interview anxiety often makes it hard for me to perform at my best.\n\nI'm looking for any insight and advice specific to the LinkedIn data science interview process.\n\n* What types of questions should I expect?\n* Are there any particular areas they focus on?\n* Any advice on what specific statistical concepts LinkedIn tends to focus on would be greatly appreciated.\n\nI've been told there's going to be:\n\n* SQL/Python data manipulation,\n* a business case study,\n* and statistics for my first round.\n\nI haven't been able to get any more information from the recruiter at the moment, which is why I'm here!\n\nI'd love to hear any tips for managing interview anxiety, especially in a technical context. I code every day for work, and yet I tend to blank out and get flustered during interviews, even when I know the material. Any strategies for staying calm, focused, and presenting myself confidently would be greatly appreciated.\n\nThis role at LinkedIn is a dream opportunity for me, so I really want to make sure I'm as prepared as possible. Any insights or advice would be a huge help.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1iiuea1/data_science_interview_at_linkedin_any_insights/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Hey OP how was your interview? I got a recruiter call scheduled this friday for Data science associate position. Could you please go over the rounds, topics and questions covered in your interview. It would be a great help. Thanks in advance.",
          "score": 1
        },
        {
          "body": "Hey @sad_purple810 , @traditional_ad6073, can you guys share your interview experience? I have a screening on Tuesday",
          "score": 1
        }
      ]
    },
    {
      "title": "Job shared on LinkedIn by hiring manager within 6 hours after my interview!",
      "body": "This job has been open since late February. I passed recruiter screen and had my first interview yesterday (wasn’t with hiring manager but more like a peer interview). 6 hours after the interview, the LinkedIn job posting suddenly got a “Meet the hiring team” person attached to it, and this person shared the job in a post for the first time. Does this mean rejection or I’m not a top candidate and they want to interview more? ",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1jfwoqw/job_shared_on_linkedin_by_hiring_manager_within_6/",
      "comments": [
        {
          "body": "I would assume so. You only have a job if they call you and offer you one. Best to keep looking.",
          "score": 3
        },
        {
          "body": "It's a normal things. You don't need to worry about it.",
          "score": 1
        }
      ]
    },
    {
      "title": "iOS Developer interview LinkedIn",
      "body": "I have an upcoming interview with LinkedIn. Has anyone recently gone through the experience? Is the process more about asking Leetcode-style questions or iOS-specific (API call, display List). Looking for some guidance from the community.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1k1qbnf/ios_developer_interview_linkedin/",
      "comments": []
    },
    {
      "title": "I read this advice on LinkedIn to get over the 'interview nerves', what do you guys think?",
      "body": "Hey!\n\nI was just wondering if this could be beneficial for my interview nerves, and how do you think will the hiring manager perceive this? Can this strategy have any negative implications? Also, how does one go about using these cards in a virtual interview setting without looking like I am reading off of somewhere?\n\nI love the idea of having visual cues. I have used it multiple times for presentations and events but it feels unusual for an interview.\n\nI trust reddit more than LinkedIn, would love to get the community's opinion.\n\n[Link to the original post](https://www.linkedin.com/posts/briannachapman_youre-too-passive-in-your-job-interviews-activity-7307810650754322432-BnGk?utm_source=social_share_send&amp;utm_medium=member_desktop_web&amp;rcm=ACoAACZjcrYBua-ytZu60FyRs_-wKcxoXXH7mvY)\n\nhttps://preview.redd.it/nav6v5z29qqe1.jpg?width=769&amp;format=pjpg&amp;auto=webp&amp;s=169356e8beb2c44bbf29bc60018f230c756f7413",
      "subreddit": "interviews",
      "score": 12,
      "url": "https://reddit.com/r/interviews/comments/1jj69i3/i_read_this_advice_on_linkedin_to_get_over_the/",
      "comments": [
        {
          "body": "Its ok to glance at your notes from time to time. If you need to do this print it out so its clear you're not looking at some AI etc. \n\nPractice can't hurt so do that.",
          "score": 5
        }
      ]
    }
  ]
}