{
  "company": "lululemon",
  "post_count": 5,
  "exported_at": "2026-01-18T17:44:53.286Z",
  "posts": [
    {
      "title": "Interview situation",
      "body": "Hi everyone,\n\nSo basically I had an interview with lululemon and luckily I had passed the first round of interview and was emailed about the second interveiw. Heres where I think I fd up but basically the schedueled interview date and time had conflicted with my current job and so I had emailed back saying \"hey is there any possiblity of rescheduelling since this time and date conflicts with my current job which i am schedueled for that day but no worries if not, I can figure it all out\" (obviously it was more professional etc.) but i sent that email right after I had receieved the email and that was Saturday. Today is monday and I had not heard anything back about it but the email had written that I must confirm my attendence by 6pm Sunday. So I emailed my manager saying if I can get someone to cover my shift for thursday so I can attend this interview in which she said no problem (thank you to her she is the best) and I wrote a follow up email today saying \"apologies for the confusion and was wondering if he had recieved my previous email. But not to worry now and I can make it for the interview this thursday\"\n\nI am just scared I fd everything up and I really want this job and interview but I dont know what is going on since I havent heard back and there has been no communication on their end. Please give me some advice it would be so appreicaited. (I know theres a lot of spelling mistakes pls bare w me I had to write this twice)",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1d7n1o6/interview_situation/",
      "comments": []
    },
    {
      "title": "Help- Store manager requested I change availability after hiring me!",
      "body": "So I applied for a part-time educator position with Lululemon and went through with the group interview and the interview with the storm manager. I got a call that I got the offer and already started my onboarding. After accepting the offer, the manager requested that I change my availability to be open until midnight to help with inventory. This is not feasible for me since I work a day job and it would negatively impact my performance at the other job. From the beginning, I’ve been upfront with the hiring manager, about working another 9-5 and that my availability would be limited to weekday evenings until 10 PM and weekends. In our initial emails, a manager explicitly said that I would not be considered for group interviews unless my availability aligns with the store needs, so I figured that my availability was okay.\n\nI feel blindsided and misled that I am being asked to change my availability after I’ve interviewed and accepted the offer. She said if I can’t change it they will have to consider other candidates. I wasn’t aware that they hiring decision was being made based off of me being able to change my availability, and now I feel like I am being manipulated. \n\nHas this happened to anyone else? Is it worth it go to to HR? Any advice? Thanks in advance!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/vg5jd9/help_store_manager_requested_i_change/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Yes, this happens quite often in the retail &amp; service as the location needs for staff are based on how busy they are. If the availability they want conflicts with the hours you can work, then find another job if their request conflicts with your primary job.\nThe other alternative is to find out if they have other opportunities within the company with the hours you can actually work.",
          "score": 1
        },
        {
          "body": "How bad do you need the job?  Sounds like they're playing a game of chicken with you.  This isn't an HR incident yet.  Try to work it out with the manager first.  Remind them what you agreed to and you just aren't available.  Be firm but also patient.  If they end up scheduling you for the midnight shift anyway, remind them you're leaving at 10.  That's the point where you might want to get HR involved.\n\nHonestly it's best to work this out before you start.  Tell them you can't change your availability and see what they say.  Worst thing that can happen is you find another job.",
          "score": 1
        },
        {
          "body": "Very poor communication from the manager. They may be trying to pressure you into staying later than 10. Hold your ground. Ask if there are any jobs that allow you to stop working by 10 pm. Maybe offer up Friday or Saturday nights till midnight, if that even works for you. It’s always worth a try to ask. \n\nFrankly, this is a bad sign. Even if you are scheduled for hours that meet your needs, your manager may continue trying to squeeze you to stay later. \n\nYou’ll probably be terminated. Start looking for another job immediately. Next time, be specific about not be available to work after 10 pm, and make sure the hiring manager acknowledges that fact.",
          "score": 1
        }
      ]
    },
    {
      "title": "Companies saying my portfolio is unskilled/confusing. Should I change what I apply for or create new material?",
      "body": "Been applying to UX jobs and media design jobs (whatever digital art positions companies like DDB, Moment Factory, and Lululemon post). As you can tell I’m in Canada. I’ve been having an issue where I get to the interview phase or back and forth emails with a company rep., but because of my background I’m either not a good enough graphic designer (illustrating) or coder (software developer). I know education is broad (MFA Media Art) so I know I’m pretty much looking for new grad intern positions or something entry level in any position then move up internally. \n\nHere is my portfolio: Rockerbiedesigns.com\n\nShould I be changing up what types of companies I apply for? Or just do a certificate program and just use it to bump my portfolio work and get an internship on the side?",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/apnvm4/companies_saying_my_portfolio_is/",
      "comments": [
        {
          "body": "I work in recruiting and specialize in design. You need to work on your portfolio stat. Whether it’s mock projects or freelance jobs you need more. I say this is the nicest way possible but you will not get hired for a UX role with this portfolio. The projects while kinda cool all look like art projects you did in school. I could see you being considered for an environmental design position potentially but you would not be considered for any digital designer positions (UX, UI or graphic) with your current portfolio just based on how it compares with other applicants. \n\nI’m not a fan of programs like General Assembly or other design programs but they could potentially help you build out your portfolio and help you network. If you don’t plan on networking while taking classes though I really don’t think it’s worth the money. I would highly recommend trying to find junior level designers in your area at companies you’re targeting on LinkedIn and look at their portfolios to gauge what you need to do with yours to compete for positions. \n",
          "score": 7
        },
        {
          "body": "The time lapse of that machine building makes my eyes hurt. Your links don't really appear to be links, just text. I clicked one and got to the page showcasing the work, but I had to ask myself, is this a link? ",
          "score": 2
        },
        {
          "body": "These look like art project more than UX projects. If UX positions are what you’re trying get, I think you should consider getting some more software training. A degree of some type in that field will help you with those entry level positions, and will make you much more desirable as an applicant.\n\nIt just seems like your degree doesn’t match the positions you’re applying for. One of my coworkers who has a UI/UX position got her BFA on top of a BSE. It depends on what positions you’re looking for, but I don’t think my company would hire someone for a role like that without a BSE or similar degree. Usually you specialize in UI/UX after you get your software degree, but since she has the BFA she was able to get fast-tracked to that position.\n\nBut it depends on the company and specific positions. I hope you find what you’re looking for. 🙂",
          "score": 2
        },
        {
          "body": "It doesn’t seem like you’re interested in UX in the typical sense. You seem to be more into experimental/speculative design, design installations, etc.\n\nYou should probably be looking at agencies that specialize in this kind of work. The reason you’re not getting far with other applications is because the focuses of their work and your work are so different.",
          "score": 1
        },
        {
          "body": "I am in the exact same boat as you are. I am currently getting my Master's in Interaction Design at University of Sydney and while I love this field, I have found that my university emphasizes physical/tangible interactions and installations more than digital experiences, and that has made it extremely difficult to find a job. Most of my portfolio looks exactly like yours: Arduino projects, light-based installations, interactive installations, creative coding, etc. When I apply for UX/UI Design positions I get flat-out rejected immediately, despite having 5 years of work experience in Digital Marketing in the U.S. and now soon this Master's in Australia. It is incredibly frustrating. My only advice is to tailor your portfolio. You can't change what you apply for unless you are sacrificing what you are passionate about. First, imagine your dream job. What do you want to do? Then, start working on side projects that would enhance your portfolio and match your dream job. Even if it's totally made up, a fictional idea or app, just start designing for it. Get practice and keep trying harder. Good luck to you mate, I know how hard it is. PM me if you want to critique portfolios or discuss Interaction Design.",
          "score": 1
        }
      ]
    },
    {
      "title": "Lululemon Part-Time Educator Role interview",
      "body": "Hi! I have a group interview for the lululemon part-time educator role coming up. Has anyone had this interview and can give some advice on what to wear, questions they asked, etc?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1kimr8f/lululemon_parttime_educator_role_interview/",
      "comments": [
        {
          "body": "I don’t have this experience but I’d say you probably wanna wear business casual and make sure u have one Lululemon item on. For general interview preparation as well as calming your nerves in an interview i can offer you to watch two of my videos: https://youtu.be/5uZhlKQPHRE?si=wkOklH_GkNUakMZO\n\nhttps://youtu.be/6xurFRShe70?si=e196GZaF-wUioVVi",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview Situation",
      "body": "Hi everyone,\n\nSo basically I had an interview with lululemon and luckily I had passed the first round of interview and was emailed about the second interveiw. Heres where I think I fd up but basically the schedueled interview date and time had conflicted with my current job and so I had emailed back saying \"hey is there any possiblity of rescheduelling since this time and date conflicts with my current job which i am schedueled for that day but no worries if not, I can figure it all out\" (obviously it was more professional etc.) but i sent that email right after I had receieved the email and that was Saturday. Today is monday and I had not heard anything back about it but the email had written that I must confirm my attendence by 6pm Sunday. So I emailed my manager saying if I can get someone to cover my shift for thursday so I can attend this interview in which she said no problem (thank you to her she is the best) and I wrote a follow up email today saying \"apologies for the confusion and was wondering if he had recieved my previous email. But not to worry now and I can make it for the interview this thursday\"\n\nI am just scared I fd everything up and I really want this job and interview but I dont know what is going on since I havent heard back and there has been no communication on their end. Please give me some advice it would be so appreicaited. (I know theres a lot of spelling mistakes pls bare w me I had to write this twice)",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1d7n2ds/interview_situation/",
      "comments": [
        {
          "body": "Relax dawg\n\nYou're not the first to reschedule...its Monday they probably had some catching up to do AND tried to find additional availability just in case...\n\nNext time try to get the day off BEFORE telling them you cant... \n\nGood luck 👍",
          "score": 2
        },
        {
          "body": "how was the first round of interviews? i have mine this evening and kinda anxious",
          "score": 1
        }
      ]
    }
  ]
}