{
  "company": "lyft",
  "post_count": 46,
  "exported_at": "2026-01-18T17:44:53.286Z",
  "posts": [
    {
      "title": "How I used LinkedIn to land a great job",
      "body": "I see many people on this sub love to hate on LinkedIn, and to be honest, I get it. The endless optimism and success stories that seem to scream fakeness can be hard to swallow, especially when you’re on a job hunt that feels like it’s going nowhere. That being said, I 100% credit LinkedIn for helping me land where I am today. Here’s the method I used. I hope it helps!\n\nFull disclosure: I am a military veteran, and that played into me being a fit for this position. Also, I feel extremely fortunate that I slid into this position in August of last year, which seems to be right before the entire industry cracked down hard. So I realize that my situation is not an exact match for most job seekers in this field today. However, I think the method I used to find the job is applicable regardless.\n\nAs a career-changer and fresh graduate of a coding bootcamp with ZERO coding experience prior to the boot camp (I was a sixth grade Latin teacher before changing over), I did everything I could to get a job. As weeks and months passed, I was starting to feel hopeless as the hundreds of applications I put out yielded no results. I tried LinkedIn’s Easy Apply. I tried customizing my resumes. I tried cover letters. I was listening to job hunting podcasts, trying to glean tips. I was networking like crazy, including following SWE influencers, and reading every scrap of their advice. Worked on side projects. Was cramming as much Leetcode as I could into my day. But no results, ever. 95% of companies never even acknowledged my application. And it seems like this is where so many people in this sub are stuck. Just… Crickets.\n\nOne day out of desperation I changed tracks and it changed my job search completely. I realized I was networking with the wrong people. So much of my network was fellow bootcamp grads, job seekers, and SWEs. But most of the time, SWEs aren’t the ones doing the hiring. So my feed was totally filled with people posting about work or looking for work.\n\nI started my new strategy by making a list of 20 companies I thought I might like to work at, based on name, reputation, product, or just valuation. I followed those companies, so I would see all the posts where someone tagged that company. Then I went to their company page on LinkedIn and scrolled their People tab, looking for anyone with a job title like Recruiter/Talent/Hiring Manager, etc. Anyone I saw that looked like they hired for SWE positions, I followed them too. I stopped following people with the “Looking for work” green banner (Yeah this is rude, but it worked for me).\n\nSo then my feed was filled with recruiters and companies posting about open positions, rather than people making sad posts looking for work. Doing this I also discovered a happy side effect: recruiters are connected to other recruiters, so when they Liked another recruiter’s post, I’d see that too (and follow them). When I saw somebody post a job that I might be a fit for, I messaged the recruiter directly and referenced the post they’d made. Within a couple weeks of this, I had interviews at Lyft, Google (This interview was AWFUL, but good for the experience? Lol), and Oracle, without actually applying to those companies. Eventually, I accepted a position at Oracle and have been working there for about a year now.\n\nI hope this method can help someone else, because cold applying for thousands of positions really sucks. I’ve been there. Without LinkedIn, I wouldn’t be where I am now.",
      "subreddit": "cscareerquestions",
      "score": 1484,
      "url": "https://reddit.com/r/cscareerquestions/comments/15ft4fx/how_i_used_linkedin_to_land_a_great_job/",
      "comments": [
        {
          "body": "A recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface .\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n&amp;#x200B;\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of r/reddit.com, who are the admins of the site: message [/u/reddit](https://www.reddit.com/u/reddit/): submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on [r/reddit](https://www.reddit.com/r/reddit/), such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at [r/ModCoord](https://www.reddit.com/r/ModCoord/) \\- but please don't pester mods you *don't* know by simply spamming their modmail.\n3. **Boycott** ***and*** **spread the word...to Reddit's competition!** Stay off Reddit as much as you can, instead, take to your favorite *non*\\-Reddit platform of choice and make some noise in support! \n\nhttps://discord.gg/cscareerhub\n\nhttps://programming.dev\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Pretty good advice! How do you like working at Oracle btw?",
          "score": 215
        },
        {
          "body": "[deleted]",
          "score": 82
        },
        {
          "body": "Gonna try this combine with machine gun applying.",
          "score": 82
        },
        {
          "body": "Your background is perfect; especially if you have a secret clearance. Some companies will pay a bonus every year if you do. Great strategy. 👏",
          "score": 53
        },
        {
          "body": "We should have a networking thread…",
          "score": 16
        }
      ]
    },
    {
      "title": "Anyone Interviewed with Lyft recently?",
      "body": "This is for an internship. Would appreciate if you could tell what to expect? Even full time experience would be great to know.",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/5ragnt/anyone_interviewed_with_lyft_recently/",
      "comments": [
        {
          "body": "First I spoke with the recruiter and then they schedule you for a technical  phone interview. If you do well on the first one then they schedule you for 2nd one. On-site if you do well on the 2nd one as well.\n\nFor the phone interviews, they basically dive straight into the technical part (standard bay area coding problem), followed by sometime to talk and ask questions say the end (depending on how fast you finish, or don't). \n\nI can't speak for the on-site myself.",
          "score": 3
        }
      ]
    },
    {
      "title": "4.5 years of iOS development experience thinking about getting a CS degree. Worth it?",
      "body": "I live in Argentina, have a great remote job abroad. I am 22 years old, been working professionally since I was 18. Never had official education since high school.\n\nThe other day I had an interview with Lyft and they said they wanted to take me to San Francisco but the government required that I had a degree (or 12 years in the field) so that couldn’t happen.\n\nI am now thinking about getting a CS degree abroad (US, UK, Europe)\n\nPros of getting a degree: \n- Having every door open for me regarding work\n- Deeply learning things like Algebra, Algorithms, Compilers, etc. Which I have not much experience and I find it really hard to learn on my own.\n- I would go abroad for a couple years and meet new people\n\nCons of getting a degree:\n- It’s a lot of money (I can’t get a loan nor a scholarship because I’m a foreigner) and I think it might not be worth it since I already have years experience\n- I don’t LOVE studying\n- It would take time from work, I would need to go part-time or even quit (which would be harmful both economically and regarding the experience \n\nI would love to hear what you think",
      "subreddit": "cscareerquestions",
      "score": 354,
      "url": "https://reddit.com/r/cscareerquestions/comments/f0sc22/45_years_of_ios_development_experience_thinking/",
      "comments": [
        {
          "body": "I think you said it best about the advantage\n&gt; Having every door open for me regarding work\n\nA lot of HR departments are going to reject you on the missing degree alone, which is a shame but a reality.\n\nIf I was you I would get the cheapest and fastest accredited bachelors degree possible, probably from an online program. You just need that checkbox on your resume. Avoid debt like the plague.",
          "score": 318
        },
        {
          "body": "Well, some companies like the one you mentioned will *require* that you have a degree. In this case, due to government requirements. At other places it could also be due to contracts they have with their clients where the company has already made an agreement that the engineers will have a degree. \n\nThat being said, many huge corporations will still hire you and don’t have those strict degree requirements. Yes you will be able to learn the things you listed a bit easier in college with access to professors and colleagues, but it certainly can be done completely self taught. \n\nGenerally this sub will tell you the importance of a CS degree starts and ends with getting your first job, with the additional benefit of gaining a bit of advantage later down the line when the theory you learned becomes applicable. \n\nNow it’s up to you to measure how much that degree is *really* worth.",
          "score": 66
        },
        {
          "body": "If you live in Argentina, why don’t you get a Computer Science degree there? It’s free and the level is the same as the ones in Europe/USA. I have colleagues that graduated from UBA/UNR/UNC that are working in top tier companies around the world, specially in SF.",
          "score": 44
        },
        {
          "body": "Argentina has free education and CS is well regarded abroad. As an argie working in tech in Europe, I recommend you get a degree.\n\nFuerza!",
          "score": 22
        }
      ]
    },
    {
      "title": "Lyft turnaround time for phone screen ?",
      "body": "I had a phone screen on Friday with Lyft and haven’t heard back yet. Does anybody know the typical turnaround time or am I cooked?\n\nThe interview itself went well",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1lpdw9x/lyft_turnaround_time_for_phone_screen/",
      "comments": [
        {
          "body": "Good luck man. I just did a phone interview and coding questions seems harder. If you answered it you will get a call back 100%.",
          "score": 3
        },
        {
          "body": "standard guideline is 5 business days for all companies not just Lyft\n  \nfrom your post it's only 1 business days, not even 2 business days yet, you really need to adjust your brain",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Bay Area experienced hire market data point",
      "body": "I’m making this post since I wished that I had something similar to use when I started my interview process and to hopefully help someone else thinking about making a change with some data points. \n\n&amp;#x200B;\n\n**Who am I?**  \n I’m a mobile engineer with about 5 years experience. For the past three years I’ve been working at Facebook on the FB and Messenger apps, currently as an E5. I also have some startup experience. There are a couple of work projects that I can talk up and sound reasonably impressive but nothing I’ve done is particularly out there for someone with my experience. I don’t have any personal projects. I have a master’s from a target school. I do think interviewing is something I’m pretty good at.\n\n&amp;#x200B;\n\n**The preparation**\n\nI bought leetscode premium and practiced for 2-3 weeks. I researched as many system’s design questions as I could find and I made sure to have prepared answers for common behavioral type questions.\n\n&amp;#x200B;\n\n**The phone interviews**\n\nBeing E5 at Facebook will let you skip a lot of phone interviews if you ask for it. For the ones were I couldn’t the phone interviews were leetcode focused as expected.\n\n&amp;#x200B;\n\n**The on-site interviews**\n\nI interviewed at Google, Uber, Lyft, AirBnB and three other companies over a three week period for L5 or equivalent positions. Compared to the last time I interviewed I was surprised at how few leetcode style interviews there were, most companies would have zero or one of that kind of interview. System’s design (with a focus on mobile apps) and behavior/career were present as expected. It was \\*very\\* common to have a session of implementing a small mobile app on the spot with a follow-up discussion about why you made certain choices and how you would improve your design if you had more time.\n\n&amp;#x200B;\n\n**The negation process**\n\nI managed to get an offer from all 7 companies. The negation process afterwards was very annoying as recruiters will use a lot of psychological tricks. The two biggest ones are acting like going to their compensation teams multiple times is a big no-no and will get them in trouble, as well as asking you for a specific number that you’re looking for. This makes things difficult seeing as a candidate with multiple offers you’re not really looking for a set number but rather the highest possible (combined with the fact that the comp levels now are so ridiculous that you can’t really make any sort of claim that you “need” more money). Obviously it’s all a big game where you pretend like money doesn’t matter that much, but putting up a brave face and just enduring it will result in better offers so you just try to be as nice as possible and communicate updated offers from their competitors as quick as you can.\n\n&amp;#x200B;\n\n**The offers**\n\nThe final offers had an break down of something like this\n\nBase: 180K-210K\n\nEquity (over 4 years): 600K-900K (no noticeable difference between public and private companies)\n\nSign-on bonus: Highest I saw was 50K\n\nYearly cash/equity bonus: would vary wildly between each company\n\nAs for total compensation (first year including sign-on) the highest offer I got from a public company was a little over 450K and from a private company (one of the three mentioned above) about 500K. I think both of these numbers could’ve come in a little bit higher if I’ve kept on negotiating but I was certain the company I decided on had given their final offer so there was no point. \n\n&amp;#x200B;\n\nHappy to answer any questions.",
      "subreddit": "cscareerquestions",
      "score": 108,
      "url": "https://reddit.com/r/cscareerquestions/comments/awme4v/bay_area_experienced_hire_market_data_point/",
      "comments": [
        {
          "body": "What sorts of questions did they ask you if they didn't ask a lot of Leetcode?",
          "score": 16
        },
        {
          "body": "God bless America these numbers are unfathomable to me ",
          "score": 14
        },
        {
          "body": "[deleted]",
          "score": 12
        },
        {
          "body": "It’s good to know that the devs already in the ‘elite’ positions are comfortable.  \n\nI think your interview experience is heavily skewed by already being at a senior role at a Big N.  Seems like they are taking for granted that you know how to write code to me.",
          "score": 25
        },
        {
          "body": "Hi. Thanks for the informative post. I am currently around an equivalent of L4 / L5 level at FB in a well known Bay Area company, looking to make a switch as well (5yoe). I have a few questions trying to gauge the general vibe of interviews nowadays (been 3.5 years since I interviewed):\n\n1. I am looking to grind Leetcode for the following month as well as system design. But after reading your post, it seems that you didn’t get as many leetcode style problems as I would’ve thought. Would you say this is due to your seniority or the company’s interview style in general? (I am a backend eng and not mobile btw) What were some of the behavioral and system design questions you got asked as an L5 and what were the top 2-3 resources you used to prep for them?\n2. Regarding the leetcode style questions, would say they are mostly easy / med / hard? Can you provide a few specific example questions or two? Also, is leetcode premium worth it and did you use any other resource for DS + algo prep besides grinding leetcode?\n3. Regarding your own decision to leave fb, would you say it’s more personal, financial, manager based, location based, etc? For me, it is financials obviously but there are also some office politics that plays a part (i.e. reorgs, new c level execs with new vision, etc). I am wondering if I am making the right decision since I do really enjoy my coworkers, the culture, and the projects. Was wondering if you can shed some light on your reasons to switch and if maybe I’m making the right choice?\n\nThanks a lot in advance!",
          "score": 8
        }
      ]
    },
    {
      "title": "Lyft vs Uber vs Airbnb internship",
      "body": "I am very fortunate to have an intern offer from these 3 companies for next summer. None of them have told me about my team placement yet so all I have is the comp and the company. \n\nLyft and Airbnb pay more (for internship and fulltime) so I'm considering them more seriously. But I'm also curious what other people think would be a great option and why - considering company growth, work culture, etc.  I am also curious about full time because I would like to return full time to the company I choose. Thanks\n\nEDIT: I am actually strongly leaning towards Lyft. I know quite a few people who started at Airbnb and came to Lyft. The culture there seems great and the work looks like it'll be very interesting. The company is still growing super fast.\n\nEDIT2: If anyone could also comment on how return offers work at these companies that'd be great. I've heard it can be pretty competitive amongst the intern class to get one. ",
      "subreddit": "cscareerquestions",
      "score": 106,
      "url": "https://reddit.com/r/cscareerquestions/comments/7am9pf/lyft_vs_uber_vs_airbnb_internship/",
      "comments": [
        {
          "body": "hands down airbnb imo dude.\n\nTheir JS contributions are no joke and you will learn a lot of very relevant industry practices.",
          "score": 166
        },
        {
          "body": "[deleted]",
          "score": 73
        },
        {
          "body": "omg I see one of these kind of question every day. \n\nDon't evaluate an internship based on what they pay you as an intern. internships are short-term. you'd probably get 6k(?) from the higher paying one but in the long term 6k is nothing. you should be more focus on where you want to work full-time. I'd personally pick Airbnb because I'm more excited by their product and their engineering culture. I've Lyft is also growing quite heavily. Do you know what teams are you going to be in? \n\nEdit: Missed a word",
          "score": 61
        },
        {
          "body": "AirBnb all the way. Culture and engineering drive at AirBnB are topnotch and will give you a great start to your career.  ",
          "score": 10
        },
        {
          "body": "thats crazy you got all 3. You must grind leetcode all day :P jk\n\nAirbnb is one of the best companies to work for, period. Lyft is not bad. I would stay away from uber unless you are not near fulltime. Uber has some cool projects for interns. \n\nI'd consider airbnb or lyft for fulltime as these 2 companies are some of the most desirable CS companies in the world. ",
          "score": 34
        }
      ]
    },
    {
      "title": "Devs that work at gig app companies (ex. Uber, DoorDash, Lyft, JustEat), has a tightened economy affected your work?",
      "body": "Hello you guys, I was wondering how less discretionary spending is affecting people at these gig companies. I’m sure if, say, Uber is making less money overall, then it’s not just SWEs affected by it, but I’m still curious to hear from the developer side of things.\n\nIf you work at one of these companies or similar space, do you notice a shift on the types of featured worked on? Maybe more anxiety about financials in meetings and thus layoffs? Or maybe you haven’t noticed anything at all? Thank you.",
      "subreddit": "cscareerquestions",
      "score": 55,
      "url": "https://reddit.com/r/cscareerquestions/comments/1eekkfa/devs_that_work_at_gig_app_companies_ex_uber/",
      "comments": [
        {
          "body": "These companies are doing better than ever actually, Uber recently hit sustainable profitability. They basically were able to achieve the standard VC funded startup playbook: subsidize their services long enough to prevent future market entrants until they could start charging higher prices.",
          "score": 114
        },
        {
          "body": "Idk about the others but Uber closed one of their European offices (less than 150 ppl) and moved the positions to India.\n\nThey offered people a chance to relocate there lol.",
          "score": 28
        },
        {
          "body": "I work for one of them as an iOS engineer. I don’t think my work load change has anything to do with the economy. \n\nMy work has been to release features quickly and see if it has financial gains or not. It’s been like that for 2 years now.",
          "score": 33
        },
        {
          "body": "It’s actually better now than it has been for a while. There seems to be an increase in meaningful work that needs to be done compared to a year or two ago. My org even got a lot of new headcount approved recently, and in the US too. Headcount has been flat for the past few years, and even many backfills were going to India, so this was quite a surprise.\n\nThere’s no talk of financials in meetings, the company’s too big and we’re all too distant as eng to have any visibility on that. There was a lot more anxiety back when every company was doing layoffs than there is now.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Lyft vs Uber (which offer to choose)",
      "body": "I recently got an offer from both Uber and Lyft. The compensation for both offers are really good. I like teams in both companies equally.\n\nWhich company would you pick? My hesitation with Uber is around the negative press and culture. Overall I find Uber has some really good engineering talent but I don't want to risk taking the job if the culture sucks.\n\nThe team I interviewed with at Uber was really good. The engineering manager for the team is woman who really enjoyed her work at Uber and didn't face any issues.",
      "subreddit": "cscareerquestions",
      "score": 44,
      "url": "https://reddit.com/r/cscareerquestions/comments/84j299/lyft_vs_uber_which_offer_to_choose/",
      "comments": [
        {
          "body": "Seems like you've already made up your mind. You are looking for reasons NOT to work at Uber, not to work for Lyft.",
          "score": 60
        },
        {
          "body": "It honestly seems like Uber is trying to do everything they can to light themselves on fire.  It's been a little surprising that they've still remained on top.\n\nThat said, I think that space is going to significantly shrink in the next 5 years for all sorts of reason (they can't all keep losing money forever).  I'd bet on Lyft in the long run.",
          "score": 7
        },
        {
          "body": "Depends on which team you'd be working on and which direction you want to take in your career - i.e. become a technical expert or take a technical management route. Without knowing the details of your situation, I would probably go with Uber assuming you'd be working in one of their core businesses. If you are interested in becoming a technical expert in your field, Uber most likely has larger teams that attracts technical experts that you can learn from/interact with. \n\nOn the other hand, Uber has its risk. For instance, being a publicly traded company with a very high valuation that has yet to make a profit, there is a lot of pressure on it's businesses to perform. You might not feel the pressure as an engineer, but if you become a manager you will exposed to that pressure and can become very intense. Also, Uber has been know for a toxic upper management, which is something that can have more of less effect on you depending on your team/position in the corporate ladder. Finally, Uber having a much higher valuation than Lyft means it will take bigger risk with expanding its business/offerings, some of which will inevitably fail. That's why knowing the team is important; working on a team that gets shut down (like the one that was working on leasing cars to drivers) is not only frustrating but also affects your chances of finding future job opportunities.\n\nIn comparison, Lyft has been much more cautious expanding its business so less chances of working for project/team that gets shut down. Culture is a big thing at Lyft as far as I can tell from.their marketing and they seem to generally treat their drivers better than Uber. I tend to believe it would be a better environment to take the tech-management career route because of the less corporate structure (personal preference) which usually means a little more creative freedom.and less pressure.\n\nI'm.sure people that work at either companies will be able to give you better insights but these are some things I would take into consideration if I were in your shoes.",
          "score": 17
        },
        {
          "body": "Lyft is a way more chill environment. Uber eh..not so much and I've heard things about micromanagement too.",
          "score": 7
        },
        {
          "body": "After all the sexiest publicity Uber had, I'd probably lean toward Lyft. ",
          "score": 67
        }
      ]
    },
    {
      "title": "Lyft SWE apprenticeship Byteboard questions.",
      "body": "So i applied to Lyfts SWE apprenticeship program and made it to the first round interview which is an assignment on byteboard. I picked the frontend test and was just wondering if anyone has taken the assignment yet and can share some insight on what i should expect. Thanks in advance.",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/uypgx0/lyft_swe_apprenticeship_byteboard_questions/",
      "comments": [
        {
          "body": "Hi! Congrats! I also made it to the first round and picked the backend test. Kept going back and forth about if I should've chosen frontend or backend. My main programming language is JavaScript. I'm also trying to see if anyone has any insight into the tests.",
          "score": 3
        },
        {
          "body": "Sending out good vibes to those moving forward! 🤞🏽",
          "score": 3
        }
      ]
    },
    {
      "title": "Lyft interview process?",
      "body": "Hii! So I just had two interviews with Lyft for a business support role. Basically customer service doing chat and emails.\n\nI am pretty nervous for my final 3 interviews and never had to do so many at once. Will be a total of 5 by the end of it.\nThe last 3 are titled interpersonal skills, operational excellence, and mindset.\n\nHas anyone interviewed and had a similar experience and how did it go for you? \n\nI am so use to maybe 3 max interviews and not 5 with it outlined like this so I’m pretty in my head about it. Any advice is appreciated ty for reading 💗",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1lnrrwo/lyft_interview_process/",
      "comments": [
        {
          "body": "This is pretty typical for a customer-facing role at a larger company - they want to make sure you can handle the interpersonal aspects since you'll be dealing with frustrated customers all day.\n\nHere's what I'd expect based on those interview titles:\n\nInterpersonal Skills - They'll probably give you scenarios like \"a customer is angry about a cancelled ride and demanding a full refund when policy says partial, how do you handle it?\" They want to see empathy, active listening, and how you de-escalate without just giving away the farm.\n\nOperational Excellence - This is about process and efficiency. Expect questions about how you prioritize when you have 10 chats going at once, how you'd handle repetitive issues, or what you'd do if you noticed a pattern of complaints about a specific problem.\n\nMindset - This is the culture fit piece. Lyft's core values (according to their website) are customer obsession, excellence, accountability, and belonging. They will likely grill you with behavioral STAR questions and evaluate how your accomplishments stack against these values.\n\nMy advice: have specific examples ready from any customer service experience (retail, restaurant, even helping classmates with something). Use the STAR method - Situation, Task, Action, Result (Score My Interview can help you). And when it's your turn to ask questions at the end of each interview, ask thoughtful questions about their training process and career growth since support roles can lead to operations or product roles.\n\nThe fact they're doing 5 interviews means they're being thorough, not that you're failing. Like Amazon, Lyft is likely practicing fractal interviewing, where one interviewer will evaluate only 1-2 of their values and tech areas. Then they compare notes during the debrief and will add scope to the depth of each person. If you made it this far they already like you - now they just need to confirm that you raise their hiring bar.",
          "score": 2
        }
      ]
    },
    {
      "title": "Free rides to job interviews from Lyft, Goodwill &amp; UW",
      "body": "[Check here](https://www.lyft.com/lyftup/jobs-access) to see if this program is available in your city. \n\n&amp;#x200B;\n\nNice corporate initiative in light of COVID-19\n\n&amp;#x200B;\n\n(I have no affiliation with any of these organizations - just saw this in another subreddit, but had to verify &amp; clean up the info)",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/nqc9yx/free_rides_to_job_interviews_from_lyft_goodwill_uw/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Insight on DS Salaries for Tech Companies in Toronto",
      "body": "Hi all,\n\nI currently have a soon-to-expire offer from a tech company in Toronto (130K base / 25K equity). I’m also interviewing for Lyft but I’m not sure if I’ll receive an offer before the other one expires. Obviously I’m trying to extend the offer deadline and also accelerate the Lyft process but they’ve been slow overall. \n\nI’m wondering if anyone has an idea about junior DS salaries in Toronto and whether I should just accept my current offer? Lyft’s posted salary band for the role I’m interviewing for is 108K-135K but I have no idea on their typical equity grants and if they’ll be able to come in higher than the other offer. \n\nFor more context, I have 3 YOE and Bachelors and Masters in Stats. I’m only considering roles based in Toronto and not US remote roles. \n\nThank you!",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/1npsxh6/insight_on_ds_salaries_for_tech_companies_in/",
      "comments": [
        {
          "body": "Junior with 3 YOE ?\n\nAnyways have you tried level FYI like we all do?",
          "score": 4
        },
        {
          "body": "Just take your offer and re-neg/quit if Lyft comes back with a higher one.   \n\nYes, I know it's frowned upon, but I have seen a lot of people do it. These companies wouldn't hesitate laying you off if it's beneficial to them, why would you hesitate doing something that is beneficial to you?",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Seems 20% under market but the market is shit so take what you can.",
          "score": 1
        },
        {
          "body": "Mind sharing your anon’ed resume? I think your current offer is normal for Toronto, but i feel like you could stretch a bit for more.",
          "score": -4
        }
      ]
    },
    {
      "title": "SWEs affected by layoffs, what are out of industry jobs you’ve taken during your job search?",
      "body": "I’m trying to think of some ideas because I’m running out of money.\n\nI’ve heard:\n-Uber/Lyft driving\n-Doordash \n-Substitute teaching \n\nI need something soon but not something that’s going to take too much time away from my interview prep for software engineering jobs.",
      "subreddit": "cscareerquestions",
      "score": 61,
      "url": "https://reddit.com/r/cscareerquestions/comments/1f0ocdg/swes_affected_by_layoffs_what_are_out_of_industry/",
      "comments": [
        {
          "body": "I went to waiting tables at literally my first college job from 13 years ago. Thankfully it is an upscale restaurant and I left with a fantastic reputation (worked there in various capacity throughout college)\n\nIf someone had told me that that my reputation at that job would be the difference between paying my bills or not in 13 years down the road I wouldn’t have believed them (or wanted to).\n\nI do some IT contract work too for local businesses but it is very sparse. Honestly I am just using this time now to regroup and focus on upping my education and planning my next move (probably joining the military).",
          "score": 81
        },
        {
          "body": "Im tutoring and helping out college kids on their assignments on fivver. I don’t charge much and its pretty easy OOP stuff. Other than that, free time is spent on elden ring 🤺",
          "score": 23
        },
        {
          "body": "After my brother's contract SWE job at Meta ended on 2-23-24, he applied to SWE jobs for 5 months straight while working an in-home support services job, and he got a SWE contract job at Walmart Global Tech via Insight Global.\n\nHe started 8-12-24.\n\nIf you are unemployed, applying to jobs is a full-time job.\n\nIf you are in danger of becoming homeless, you need any type of income, so working a non-SWE job is acceptable, but then if you work a non-SWE job, you have less time for job applications.",
          "score": 64
        },
        {
          "body": "Warehouse lol",
          "score": 12
        },
        {
          "body": "I have a side business and am about to start school soon for a second bachelors, pivoting into healthcare.",
          "score": 9
        },
        {
          "body": "I mean, gig work sounds like your best bet for what you want\n\nOther than that, if you need a more fulltime/part time role to make rent and live, look at help desk roles.",
          "score": 16
        },
        {
          "body": "I haven't had this problem long enough to go this route, but substitute teaching can be great, and it's daily commitment ",
          "score": 9
        },
        {
          "body": "Not myself but my partner is also a SWE/cs grad. She got laid off from her position and got a job as a PM at a warehousing company. \n\nSurprisingly it pays more and has less stress than her former FAANG SWE position. She didn't upskill or get any new certs (no PMP) to get it.",
          "score": 10
        },
        {
          "body": "Wonder if anyone here started as a blue collar job at a tech company to later convert to swe. Like Uber driver to Uber developer, Google janitor to Google swe lol",
          "score": 3
        }
      ]
    },
    {
      "title": "Coding Bootcamp to 110k",
      "body": "Hey Reddit its gamer0293,\n\nI just accepted a role for 110k and I thought I'd share my experience for those who lurk this sub. Maybe what I have to share will help someone out there.\n\nI started at a coding bootcamp in 2018 and I didn't finish it. I was dropped halfway through, I couldn't keep up with the pace of the course it was too much too fast. I didn't appreciate how difficult it was going to be or how much effort I was going to need to invest to make my transition into tech. I wasn't ready.\n\nFrom there I moved back in with my parents.\n\nI spent a couple years after that working various odd jobs in retail/customer service roles. Barback, food running, cashier, lyft driver, you get the idea.\n\nOne day I had a recruiter reach out to me to work at a coding bootcamp, that was a few months before covid. From there I just worked at the coding bootcamp while trying to find something full time. I was rejected from everything. I sucked and still suck at doing algorithms which didn't help. I was focusing on building projects since I figured that was what I'd be hired to do. My mental health suffered a lot, felt like I was behind in life. For those who have been there/are there now you know what I'm talking about.\n\nI found a small startup company to join on Angel List as my first real dev job, but it ended up not being a good fit. The team lead was a junior dev, the senior devs were on the other side of the world it was sink or swim. I was shifted to 4 different projects in 4-5 months. I was transitioned from a full time employee to a part time contractor and then I stopped getting paid. The whole time I was working at the bootcamp to have some sense of income.\n\nI started getting interviews, likely because I finally had a real dev job on my resume. Today I got two offers, one for 57k and another for 110k.\n\nIf I had to give myself advice starting out I would say start with freecodecamp first. Do that coupled with harvardcs50  and then do the Odin project. From there build out projects and make a fiver account to get freelance projects for your portfolio. From there it's just a grind networking and applying till something lands. Or you could go the freelance route, lot of opportunity, but it does take a lot of focused work. If you have ADD like me, this will likely be the biggest obstacle.\n\nYou don't need a bootcamp, I wouldn't do a bootcamp again knowing what I know now. Save your money. My bootcamp charges each student 12k per person and only like 2% probably actually make it. They don't have a vetting process they just take your money if you're willing to give it to them. I've had students ask me how to push to git when they don't even know how to take a screenshot on their mac. I'm not saying all bootcamps out there are like that, I'm saying mine is. I won't say which coding bootcamp I work at either but we are partnered with a lot of major universities.\n\nIf you really want to do a bootcamp I'd suggest you do Andy Sterkowitz's. its 4k to take. I interviewed with him twice to try to get in and both times he turned me down. It's not a bootcamp, he has a vetting process to make sure it's a good fit and he takes people that start at 0 and builds them up personally. You will get the support you need and he has a reputation to uphold. He wouldn't take me since I wasn't starting at 0.\n\nHere's some resources I'd suggest to checkout if you're looking to get into tech:\n\nFireship.io\n\nTraversy Media\n\nThe Net Ninja\n\nThe Odin Project\n\nFree Code Camp\n\nHarvardcs50\n\nGoogle certificates (for non dev roles). These certs don't mean much to employers, but the quality of the content is really good. You learn a lot about the foundations and you can build up from there.\n\nFor the senior developer on this sub:\n\nHow do I make sure I'm ready for this? This interview process was unlike anything I've ever had. What I mean by that is that I didn't do a single line of code during the process. No take home or algorithm. They told me they were looking to hire the right personality and to mentor and train that person. I'm very grateful for this opportunity, but I'm not feeling excited I'm having an \"oh shit can I do this\" moment. I have 2 weeks to get myself ready for this. I'm having doubts that I'm worth this much money or worthy of this opportunity. I understand the imposter syndrome is thing but how do you know the difference between imposter syndrome and outright incompetence? I know that this is where the real work starts. I feel like my start date is the start of a marathon and I want to make sure I'm as ready as I can be. My plan is to use this time to get myself up to speed but I don't really have a metric to measure that.\n\nIt's a fully remote role which is great and all, but I am concerned about how to keep myself accountable and focused. If anyone has guidance on how I can be the best remote worker I can be please let me know.\n\nTheir front end tech stack (what I'd be doing) is React/GraphQL. I've build out simple apps with React but I haven't touched GraphQL. I have a couple resources I plan on grinding till my start date but I wanted to ask this sub if they have any specific content they could recommend.\n\nIf the senior devs can offer me some guidance for how I can make the most of this opportunity and how I can be the best developer as quickly as possible, PLEASE tell me.\n\nIf you have any questions ask. One thing I love about working at the coding bootcamp is I really like helping people transition into tech and I'm good at it.\n\nStay safe out there,\n\n\\-gamer0293",
      "subreddit": "cscareerquestions",
      "score": 204,
      "url": "https://reddit.com/r/cscareerquestions/comments/u1k9b1/coding_bootcamp_to_110k/",
      "comments": [
        {
          "body": "For accountability you need to setup a work space, this means different things to different people but you need a trigger to switch from leisure mode to work mode. Sometimes this means using a space only intended for work, sometimes this means changing into work clothes and stepping out and back into the house “resetting” your mode. You need to find the right trigger for you and  do it every work day. \n\nRegarding the catchup for the technical skills you are going to need to focus and learn fast, take good notes and ask smart questions. \n\nGood luck.",
          "score": 63
        },
        {
          "body": "Congratulations!\n\nThat's a pretty big gap between the 2 offers and I would've taken the 110k without question especially since they know that you'll need to be guided.\n\nRegarding advice, here are a couple of things to do and keep in mind:\n\n1. Take breaks - this is something that I learned to do with experience. I thought staying focused for hours or until I solved a problem was the ideal thing to do. False. When you're stuck, either reach out or take a break or go for a quick walk and the solution will hit you like your daddy spanked you when you were 10.\n2. Ask questions - doesn't matter if they're stupid. ASK. It's better to ask and clarify something rather than trying to figure it out on your own, wasting everyone's time. They understand that you need guidance so ask when you feel the need to, especially something you're confused about or don't understand.\n3. Get a mentor - this is extremely important. You're not going to learn a lot on your own. When you write some code, run it by a senior and pick his/her brain. He/she will come up with edge cases, best practices, and/or why you need to change your code.\n4. Clarify the requirements - once you get familiar with the product/service and you start to take on projects, clarify what you need to do. This will save you A LOT of time so you hit the ground running on the right path instead of writing a lot of code, only to go back and change it after QA finds bugs or doesn't follow requirements.\n5. Exercise - another VERY important thing. Don't know if you do this already but make time and go running or lift some weights to stay in shape and keep a sharp mind. Make it part of your lifestyle just like you need to eat and shit.  Take care of your body so it can take care of you.\n\nI could go on but I think those are the main points to keep in mind. Again, congrats and best of luck!",
          "score": 40
        },
        {
          "body": "OP you’re going to do great, but I caution anyone reading this not to pay much mind to the “you don’t need a bootcamp” mentality \n\nMy two cents is that a bootcamp is just like a CS degree. Sure you can become a dev without a CS degree, and only a bootcamp education. And sure, you can become a dev without a bootcamp education, and only being self taught. However, each step down the ladder of CS =&gt; bootcamp =&gt; self taught significantly increases the difficultly",
          "score": 53
        },
        {
          "body": "I needed this as I’m starting my transition into the software development world.",
          "score": 7
        },
        {
          "body": "Where are you located if you don’t mind me asking you",
          "score": 6
        },
        {
          "body": "Wow, you must've really left a good impression to be getting paid that much with no degree and very little experience. That's how much some seniors are paid in my area. Congrats OP",
          "score": 5
        },
        {
          "body": "thank you for this !!",
          "score": 3
        }
      ]
    },
    {
      "title": "Daily Chat Thread - December 06, 2017",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).\n",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/7hwf7q/daily_chat_thread_december_06_2017/",
      "comments": [
        {
          "body": "I have an interview with Google in a few days and I've been studying non-stop. Even though it's a frontend engineer position, I know the expectation is that I know core CS fundamentals. I did take CS classes (not CS major) so I think I'll be okay but does anyone have perspective what are some big topics I really need to study? I've been studying a lot of sorting and graph questions as I find those I still struggle on but there are things like bit manipulation that I've never had to do in my day-to-day job so I'm debating how worth it is it to study those topics...\n\nI've just been doing CtCI problems and some leetcode. Also I'm trying to recreate some data structs in scratch. Even though I primarily do JavaScript, I have Java as a fallback. Any other advice people may have?\n\nAny advice appreciated!",
          "score": 1
        },
        {
          "body": "How do you guys rate Rubrik's internship? Compared to other Big N",
          "score": 2
        },
        {
          "body": "I'm curious to know - I've accepted an offer with Capital One for an internship this upcoming summer. I know they have been pretty much annually increasing their offers for both interns and full time TDPs.\n\nIf you're a returning intern transitioning to full time at Capital One, can you expect a higher offer than if you're first year at Capital One is full time? Not that I'm unhappy with what the typical TDP salary is, I'm just wondering if I happen to be a returner if mine will be higher.\n\nAdditionally, a TDP grad told me his salary went up by 50% throughout his 2 years in the program. Can anyone here attest to this? ",
          "score": 2
        },
        {
          "body": "If my response rate for internship position applications has been around 2.5% (no previous internships), what can I hope for, for new grad positions with one internship?",
          "score": 1
        },
        {
          "body": "Are there any videos or tools of what a great technical interview looks like? I've been in the final round with several companies but I haven't been able to get an offer. When I'm doing a face to face interview or screen share, it seems like the interviewer is so bored, like I would be given no feedback while I'm coding/talking out my thoughts. Even when my solution isn't fully correct (I google the correct solution afterwards), the interviewer would move on to another question",
          "score": 1
        },
        {
          "body": "Anyone done a phone interview with tableau? (Internship)",
          "score": 1
        }
      ]
    },
    {
      "title": "My Journey: From failing databases in College (~3.0 GPA) -&gt; 3 FT offers including Lyft",
      "body": "Clickbait title aside, this is a story of dealing with mild depression, imposter syndrome, self-improvement and rediscovering a passion for things. [u/elliotbot/](https://www.reddit.com/user/elliotbot/) has already done an amazing post on the “how” of interview prep here ([https://www.reddit.com/r/cscareerquestions/comments/6278bi/my\\_journey\\_and\\_tips\\_29\\_gpa\\_at\\_a\\_noname\\_liberal/](https://www.reddit.com/r/cscareerquestions/comments/6278bi/my_journey_and_tips_29_gpa_at_a_noname_liberal/)), but I wanted to talk more about the “why” and how it’s transformed other parts of my life. Hope this inspires those who are feeling helpless or generally on autopilot in life. \n\n**TL;DR**\n\nGraduated from a liberal arts college 2.5 years ago with a 3.0 GPA and failed Databases class. Got an internship at a large enterprise software company and returned full-time for the $ and perks. No real passion and was living life on autopilot chasing short term highs. Never did Leetcode or had an onsite until the past year. Considered applying for PM roles, but couldn’t be bothered. Felt stifled by work and finally decided to put in the time + energy to work on myself.  Studied/worked 220+ hours in a year with a full-time job. Rediscovered an interest in CS, software engineering and hobbies. Landed 3 offers from 5 onsites including Lyft $300k+ offer. \n\n**Disclaimer &amp; thoughts on prestige**\n\nCopy+pasting this disclaimer from [u/elliotbot/](https://www.reddit.com/user/elliotbot/) 's post because it sums up my thoughts entirely: \n\n“I am not claiming that Big N or unicorn or w/e is the be-all end-all of companies. I'm not interested in debating whether they're overrated. This is aimed specifically at people who might be interested in pursuing these sorts of roles, and especially at people who don't think they can \"make it,\" because of background, etc. I'm also not claiming this is a fully general solution. This is just my journey and what worked for me—hopefully it will prove a little bit useful for you.”\n\n**Background:**\n\nSwitched to majoring in CS mid way through college. The early classes were interesting and I did well, but grades soon went downhill as higher level classes got harder and my lack of study habits really showed. Was pulled in too many directions and couldn’t focus. Late night Netflix binging turned to early morning Netflix binging. Had a C in pretty much every semester and failed my Databases class. I couldn’t motivate myself to regularly attend morning classes and none of them were recorded. There was too much of a disconnect between what I was learning in class and what I thought would actually be useful post-college. Considered looking for PM roles after a largely boring internship as a software engineer, but ended up applying to only Facebook and Google software engineering roles. Solved maybe 2 problems on LeetCode and - surprise surprise - failed the Google interview. Ultimately took the return offer at the enterprise software company because it was the easiest route. \n\nIn hindsight, my lack of passion in anything long term and lack of career direction was the root of why I felt depressed. Every time I tried to branch out and explore a potential career path by joining some club, I got rejected. The rat race had already started one month into college and I didn’t know the rules of the game.\n\n**Full-time work with little passion**\n\nFull time work was soul sucking. I missed the days of being a student, being surrounded by friends and giving few fucks. Was on a brand new team but had to work with some very old frameworks with little mentorship and the codebase was so new that it was hard to be successful. Things settled in a routine fast and I could feel myself spiralling and relying on things like Netflix and video games to compensate for my unhappiness at work. Eventually, projects got more interesting and finally had a good mentor. But it wasn’t long before we our team had a new manager who had no faith in junior engineers. The pressing deadlines meant we were made to work solely on writing tests and other boring work and was told that this work wouldn’t even count towards promotion because it wasn’t deemed challenging enough. I spoke of being unhappy and underutilized every 1 on 1 meeting with my manager but things did not change. There weren't many internal job postings for my engineering level and those seemed like a gamble. I wanted to leave but had no interviewing skills. Call it a first world problem, but I would happily trade those six figures for a job where I didn’t feel so directionless and powerless to change things. \n\n**Reflection**\n\nUp until this point, I had almost always taken the easy route. With every unfulfilling internship, I would get a temporary boost of motivation but it would soon fade. I was content with knowing I had potential. It was a depressing way to live really. Never really being dedicated to anything and caring about nothing. I just wanted to cruise for now. Besides, I could “turn it on” whenever I wanted right? Wrong. I didn’t know how to learn in a structured way and had no self discipline. Procrastination is an [emotional regulation problem](https://www.nytimes.com/2019/03/25/smarter-living/why-you-procrastinate-it-has-nothing-to-do-with-self-control.html) and the [instant gratification monkey in my brain](https://waitbutwhy.com/2013/10/why-procrastinators-procrastinate.html) almost always won. I needed to right this ship. Well, first I needed to learn how to learn again. Cal Newports’ Deep Work was really insightful here. I’m the kind of person who can’t blindly follow advice, and Newport gives simple actionable advice backed by evidence (he is a professor after all) and makes a convincing case for how to live a fulfilling life. My biggest takeaway was to accomplish deep work, we need to establish routines to preserve our limited willpower. Simple \"hacks\" like marking a streak of productive days on a calendar make a hell of a difference over the course of weeks and months. \n\nLooking back at the past years, I realized that if you don’t actively choose a path or work on improving yourself, your circumstances will choose it for you. I was stuck with unfulfilling work because I didn’t have the interviewing skills to job hop nor did I have the hard skills to prove my worth. I never wanted to be in this position again. I started Cracking the Code Interview and worked through an online course on React. Feeling stifled at work fueled my self-studying. Offhand comment by an acquaintance about how I’m only an engineer at &lt;”unprestigious” company&gt;? Thank you very much, extra fuel for my tank of motivation on the Leetcode train. \n\nAfter a new manager was hired, things got a lot better. Got to work on more exciting projects and for once, my career development was actually a conversation. I generally tried to work on the hardest problems I could find. Even when I was made to work on only testing under the previous manager, I took the initiative and worked on creating a separate test pipeline for legacy and slow tests. Got promoted months after, although I was still unhappy because I felt it was long overdue. I was as productive as ever at work and felt fulfilled for the first time at work. But I never wanted my happiness to be jeopardized by a toxic manager again and had other reasons to leave so I continued leetcoding. \n\n**Imposter syndrome**\n\nI still felt major imposter syndrome. I was the guy that failed databases. So I retook the databases class online on the Stanford site. Still felt imposter syndrome because I had no idea what big data, nosql, systems design or distributed systems were. So I joined a book club to read through and discuss Designing Data Intensive Applications. Certain parts of the book were a bit of a slog, but others I actually found enjoyable and continued reading even though it became clear that it was tangential to interview prep. I felt overwhelmed by all this time spent on technical things so I devoted more time with friends, my existing hobby (a sport) and picked up a new one. \n\nThis growth mindset spilled over into other parts of my life. How could I make my existing hobby (a sport) more fulfilling? I started training because seeing improvement and being good at things was satisfying. How could I be a better friend and open up to people more? I started intentionally reaching out more and carving out quality time with friends and family. I felt as alive as ever. \n\n**First interviews**\n\nAll this work and I still bombed a front end interview and later an algorithms interview. I remember being way too nervous and unable to think clearly. Each one took 2 weeks for me to recover mentally, but motivated me to study harder. I eventually hit \\~85 problems solved on LeetCode which is considered a bit of a sweet spot for interview prep. \n\n**Startups?**\n\nAt this point I realized that a lot of my friends at startups felt much more fulfilled by their work and impact and I was drawn to the startup world. I questioned whether I would even enjoy the work culture of another large company. And what if the startup I joined was the next Google?! Extremely unlikely, but one can dream. Unfortunately the LeetCode arms race that I had been training for wasn’t really a transferable skill set to interviewing for startups. They wanted to see projects, put you through bug bashes, see if you can build stuff and most importantly, see if there’s a culture fit. I had already put in so much time on LeetCode prep, but I didn’t want to have any regrets so I set out to build 2 full stack projects I found interesting and deployed them. Besides, you can’t really say that you know a language or framework until you’ve built something with it and even then your skills are functional at best. Projects just look good on a resume anyways. I put my LeetCode on hold and spent some weekends and after work hours working on these projects. Starting the projects were tough, but I ended up enjoying building them a lot and having autonomy over everything. It’s funny that I started with the rather contrived goal of making myself a strong candidate (front-end, back-end, data, practical skills) and actually ended up rediscovering a genuine passion for CS and software engineering. \n\n**Interviewing again**\n\nI started interviewing again. For every interview I aced, I flunked another. It’s a noisy process - many employees wouldn’t be able to pass interviews again at their own company. I got my first offer and after that my confidence skyrocketed. It validated that I wasn’t an imposter anymore. Pre-interview jitters were still a thing, but I enjoyed the challenge of solving problems. I made an AngelList profile (for the uninitiated, it’s essentially LinkedIn for startups) and talked with seed, series A, B and C startups. I got better at selling my skills and experience. I spoke with founders, really accomplished engineers and got to learn about their business models and engineering teams. Some turned me down, but I had learnt to deal with rejection and the no’s bounced off my newfound sense of worth career-wise. Every startup had a skeleton in the closet too so rejections stung less. The startup interview process was tough because it was so hands-on and I struggled with ones that needed me to just write React code to work with an API or write back-end code with transactions, neither of which I had actually done at work. After every so-so interview, I would work on implementing the optimal solution afterwards. Almost every startup I interviewed with was impressed by my side projects, the book club and my full stack skills. I got an offer from a startup with a great engineering team. I saw that my knowledge and experience was stronger than some of my interviewers and turned down onsites for roles or companies that I was no longer as interested in. \n\n**Lyft**\n\nEventually I thought I might as well interview with Lyft even though I had little confidence of passing their onsite interview. It was a “tier 1” engineering company and I was just an evolving imposter. People there collected internships and could solve longest palindromic substring before I even knew what CS was. \n\nTo my surprise, I did very well in the interview and ended up getting an offer. In the experience round, I talked about my previous manager who forced junior engineers to take on menial work and how I made the best out of that situation and took on the most impactful and challenging work. I later found out that round I had scored very highly. I had come full circle. The adversity that made me so unhappy in the first place not only helped me get a job offer but, after negotiations, placed me in the top band of the level and allowed me to make 66% more than I did before. Needless to say, the product, tech stack, engineering culture, reputation, team’s mission, level of ownership, impact, learning and growth opportunities were also an upgrade on before. The biggest wins for me though were a newfound growth mindset, better understanding of myself, rediscovering passion and regaining control over my life. I wasn’t a passenger anymore - I was the driver. \n\nSpecial thanks to my friends, family and SO for their support. The mental side is half the battle. Also recognize that I have tremendous privilege. Privilege to devote time and energy to self-improvement and being in the golden era of software engineering. Never has there been such a clear cut path to riches and the means to attain them for relatively late bloomers and non-traditional learners like myself.",
      "subreddit": "cscareerquestions",
      "score": 118,
      "url": "https://reddit.com/r/cscareerquestions/comments/eew5zh/my_journey_from_failing_databases_in_college_30/",
      "comments": [
        {
          "body": "Not sure if this post should inspire, or deeply depress reader....",
          "score": 43
        },
        {
          "body": "I normally HATE these kind of posts but this was nice man, I’m glad to hear you are doing well and it sounds like you really deserved everything you got. I’m also very impressed with that little blurb where you mentioned picking up non CS hobbies and hanging out with friends as a priority,  you sound like a pleasure to work with so kudos to you\n\nWholesome post is wholesome",
          "score": 12
        },
        {
          "body": "What react course did you do that you found useful?",
          "score": 6
        },
        {
          "body": "OP, I just want to say that this post is downright moving. You remain humble despite working very hard and achieving a great deal. You sound like not only a capable engineer, but a downright good person.\n\n&gt;Special thanks to my friends, family and SO for their support. The mental side is half the battle. Also recognize that I have tremendous privilege. Privilege to devote time and energy to self-improvement and being in the golden era of software engineering. Never has there been such a clear cut path to riches and the means to attain them for relatively late bloomers and non-traditional learners like myself.\n\nThis is wonderfully empathetic, and will catapult you above a lot of other, frankly socially inept, engineers. \n\nIf I can trouble you with a question, do you believe that someone can appreciably improve with technical interview questions, given enough practice?",
          "score": 4
        },
        {
          "body": "I'm a little more senior than you, but I can relate to the emotions you're expressing at the end of this post. I recently left 10+ years of self-employment and managed to snag a $420k / year job at one of the smaller public tech companies. It honestly feels like a dream, and I'm super excited.\n\nCongrats and good luck!",
          "score": 4
        },
        {
          "body": "Anyways, thank you for telling us your story. I will read it slowly and deeply.",
          "score": 3
        },
        {
          "body": "What kind of work are you doing at Lyft?",
          "score": 3
        },
        {
          "body": "&gt;manager who forced junior engineers to take on menial work and how I made the best out of that situation and took on the most impactful and challenging work.\n\nHow were you able to take on impactful challenging work if you were forced to do menial work? Is \"forced\" the right word here or am I missing something",
          "score": 3
        }
      ]
    },
    {
      "title": "Lyft social media home based support interview?",
      "body": "Hey all!\n\nI applied for Lyft social media home based support. I'm seeing a lot of info about the on-site interviews, but there's not a lot of info about the one for this position. \n\nI got an email today to schedule an interview, and they let me know it'll be about 90 minutes, it'll be on Google Meet, and part of it will be me showing them my home office so they know it meets their requirements. \n\nOther than that, I don't know what to expect. 90 minutes seems LONG for an interview - I'm used to 30, tops. Anyone have recent experience with interviewing for this position or insight on what might be asked of me?\n\nThanks so much!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/c8g1h7/lyft_social_media_home_based_support_interview/",
      "comments": []
    },
    {
      "title": "Rejected from every job I've applied to.",
      "body": "Ok I know I'm not the only one out there but I have been rejected from every job I've applied for in the last 4 months. No matter how I format/curate my resume (used AI, resume review and recruiters), change titles or reach out to recruiters begging for at least 1 interview for anything, I get rejected.\n\nI was a CFO of a telecom company, I've applied for at least 600+ finance/accounting jobs from entry level to executive, reached out to hundreds of hiring managers/recruiters and nothing is working. I've unfortunately had to start driving for Lyft just to pay the mortgage and building my consulting business as a bookkeeper/fractional CFO but income is not consistent.\n\nI don't know if anyone has any advice (or a job) but I'm running out of ideas and money.\n\nEdit: I have an extensive network so I have no shortage of connections, the issue is that no one is looking right now. The Boomer CFOs, Presidents/VPs and Directors aren't retiring making it harder for someone in my position. ",
      "subreddit": "jobs",
      "score": 88,
      "url": "https://reddit.com/r/jobs/comments/1m5j07s/rejected_from_every_job_ive_applied_to/",
      "comments": [
        {
          "body": "I relate. Nobody will hire. No matter how qualified we are. Seems like the corporate elite would rather save a couple of pennies for themselves than give people a livelihood.",
          "score": 17
        },
        {
          "body": "Public school districts are often in need of CFOs",
          "score": 10
        },
        {
          "body": "This is not at all abnormal, and those looking to hire are saying they are getting 10 times more applications than they were only six months ago. The \\_best\\_ way to get hired is through your network and \\_weak\\_ ties, connections of connections or casual connections, prove to be one of the best ways.",
          "score": 20
        },
        {
          "body": "as a CFO you should have a good network in place, are you leveraging it?\n\nthe old advice was for every 10k of salary, it would take a month to find a new job so 150k means 15 months.\n\nwhere are you located and how much experience do you have?\n\ni would look at non-profits to volunteer for, they can give you excellent interview stories.",
          "score": 14
        },
        {
          "body": "There's no way you cannot land another finance role as a former CFO for a public company unless you're deadset on only taking another CFO role. Those are limited unless you're looking at startup/Series A-B CFO positions, which are a step down from even a VP/Sr. Director role in a public company.\n\nThere's something not adding up here.\n\n30 year old CFO that's applying to entry level jobs; I get the feeling a lot of important context is missing.",
          "score": 6
        },
        {
          "body": "I've seen people stay at companies so long, that they have no network at all outside of coworkers. I'd suggest reaching out to vendor companies that you worked with. Also look at smaller companies. They don't always advertise jobs because they can't afford the memberships on indeed or linkedin, etc.  While you are driving,look at the buildings, take pictures of their names and symbols, then look them up. Also try your local chamber of commerce, lots of businesses you never heard of are registered. You may have to send your resume directly to a CEO. At your level it's expected.",
          "score": 4
        },
        {
          "body": "Same here, was a general manager for rent to own store for 3 years until I got laid off on March, no one would hire me not even other rent to owns even applying for the csr role, unemployment has been denied for 2 months they don't give me a reason, and I'm running out of options.",
          "score": 3
        },
        {
          "body": "Maybe check non-profit? It could just be timing and that your role doesn't have a bunch of openings in general",
          "score": 3
        },
        {
          "body": "I understand. I’ve been in the process for over 3 years. It’s exhausting and more so because there’s nothing being done to control the unemployment crisis.",
          "score": 2
        }
      ]
    },
    {
      "title": "I am not sure if this is widely known. ",
      "body": "",
      "subreddit": "jobs",
      "score": 348,
      "url": "https://reddit.com/r/jobs/comments/1ehhuhp/i_am_not_sure_if_this_is_widely_known/",
      "comments": [
        {
          "body": "Where ride programs are available (**EDIT** - check the actual form for availability. The cities shown from the link posted below are not all available when trying to actually request access)\n\n- Atlanta, GA\n\n- Austin, TX\n\n- Baltimore, MD\n\n- Boston, MA\n\n- Canton, OH\n\n- Chicago, IL\n\n- Columbus, GA\n\n- Columbus, OH\n\n- Durham, NC\n\n- Easter Seals, MN\n\n- Ft Myers, FL\n\n- Kansas City, MO\n\n- Las Vegas, NV\n\n- Long Beach, CA\n\n- Los Angeles, CA\n\n- Louisville, KY\n\n- N. Charleston, SC\n\n- New Jersey\n\n- New Orleans, LA\n\n- New York, NY\n\n- Oklahoma City, OK\n\n- Omaha, NE\n\n- Philadelphia, PA\n\n- San Diego, CA\n\n- Seattle, WA\n\n- Shreveport, LA\n\n- South Bend, IN\n\n- St. Louis, MO\n\n- Tacoma, WA\n\n- Waco, TX\n\n- Washington, D.C\n\n- Winston-Salem, NC\n\nhttps://www.lyft.com/lyftup/jobs-access/get-help",
          "score": 31
        },
        {
          "body": "*Only available in some cities, also must apply*",
          "score": 15
        },
        {
          "body": "That's really nice of them and a gamchanger in the right situations.",
          "score": 4
        },
        {
          "body": "[removed]",
          "score": 3
        },
        {
          "body": "If that's true then that's really \"Awesome!\"",
          "score": 1
        },
        {
          "body": "That’s actually really cool of them.",
          "score": 1
        }
      ]
    },
    {
      "title": "Working for zTrip",
      "body": "My review for zTrip got rejected on Indeed. I guess zTrip has an account with Indeed so no negative reviews allowed. Anyhoo, I thought I would post it here. Hope this helps anyone looking for a job in transportation.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1n2bovn/working_for_ztrip/",
      "comments": []
    },
    {
      "title": "Microsoft Alumni of over 8 years and not even Apple Retail will hire me...for PT Seasonal!",
      "body": "I think the title says it all. I recently interviewed with Apple for a basic PT seasonal role since Lyft and Uber don't offer a consistent paycheck. They declined to move me forward the very next day. I don't know what to do anymore. I guess I am overqualified for a decent paying retail job?",
      "subreddit": "jobs",
      "score": 39,
      "url": "https://reddit.com/r/jobs/comments/1m7vpmg/microsoft_alumni_of_over_8_years_and_not_even/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 19
        },
        {
          "body": "[deleted]",
          "score": 9
        },
        {
          "body": "Rework your resume to cater to jobs that might be scared if by your experience",
          "score": 5
        },
        {
          "body": "What did you do at MS?",
          "score": 3
        }
      ]
    },
    {
      "title": "what should i say in interview? (starbucks)",
      "body": "hello everyone, im in a confusing situation on what to do.\n\nI might be getting an interview to work as a barista at a Starbucks that's close to me. I do not drive so Ill have to rely on the bus. the issue is that the bus runs from like 6am to 6pm in that area.\n\nI'm able to work at any time (closing or opening shift) but its just the transportation part that's an issue. Ive heard of this thing where some starbucks locations offer free ride credits to their employees via uber/lyft for those who work the closing/opening shifts, but I'm not entirely sure if this location has that\n\nthe thing is I want to tell the manager during my interview that I have full avaialibiltiy and I can work at any time (which is true for me) but I feel like if I bring up this transportation issue it'll really ruin my chances since they could just move onto someone who has more reliable modes of transportation\n\nI could either tell the manager that \"Im able to work any time but I have an issue with transportation after 6pm\" (and maybe ask about the free ride credit thing), OR I can stay quiet about the transportation part and bring it up AFTER I get hired (assuming that I do lol)\n\nwhat should I do? any opinion is appreciated. thanks.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1l1w08z/what_should_i_say_in_interview_starbucks/",
      "comments": [
        {
          "body": "well you could always get an uber if you're worried and you live close",
          "score": 2
        },
        {
          "body": "As a hiring manager I would rather know your availability beforehand. Be honest about your transportation and the times you can be there and need to leave by. They are probably used to working around people's school hours, etc and then you won't be leading them to believe that you have open availability",
          "score": 1
        }
      ]
    },
    {
      "title": "Immigrant designer + co-founder building an AI startup while job hunting in the US — struggling, but not quitting.",
      "body": "Hey everyone,\n\nI moved to the US a few years ago. Since then, I’ve worked as a Product Designer at a B2B AI startup for 2 years and co-founded a new AI-powered platform focused on helping people plan and grow their lives smarter, combining scheduling, goal-setting, and gamification.\n\nBut recently, things have been hard.\n\nI lost my job. We haven’t launched the MVP yet. I’ve applied to many design roles — even senior-level ones that align with my experience, and still haven’t gotten interviews. I’ve been working non-stop on the startup and applying to jobs every week… but it’s been draining.\n\nI’m now going back to Uber/Lyft driving just to cover expenses while still building and designing part-time.\n\nThis week, I cried twice. I’ve been feeling lost, but I’m not giving up.\n\nI believe in the product we’re building. I believe I have valuable skills in product design, gamified UX, AI systems, and building from 0 to 1.\n\nI’m sharing this because I know some of you might have gone through something similar, and if anyone is open to connecting, sharing feedback, or even has freelance gigs, part-time roles, or founder projects that need a product designer… I’d love to hear from you.\n\nThanks for reading. This means a lot.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1kyxgmt/immigrant_designer_cofounder_building_an_ai/",
      "comments": [
        {
          "body": "Part of the early designer/cofounder job in a startup is actually making the product.  The other quite important job is fundraising. You need some money to keep going and that takes a lot of meet ups and networking to eventually cultivate relationships to raise funds. How’s the progress meeting potential customers and investors even just to test product market fit and getting some feedback? The design and idea could be great, but the execution is where it counts.",
          "score": 2
        }
      ]
    },
    {
      "title": "Just realized that a job I have applied to requires a driver license and to own a car.",
      "body": "The job actually has nothing to do with driving. It is just being a coach to very young children. \n\nI have been contacted for an interview. And I don't remember even watching the requirements when I have applied( I already got similar jobs in the past and was never asked for a DL or to own a car. Not using that as as an excuse by the way. Just realized how careless I have been). \n\nAnother funny thing is they are asking for the candidate to have access to a personal vehicle. \n\nWhich is even funnier on my end. I generally use lyft/uber and don't own a car. I live with my cousin and he is the one who owns a car. But right now he can't even use his car because it is under repair. \n\nAnyway. I almost want to cancel the interview tbh.",
      "subreddit": "jobs",
      "score": 24,
      "url": "https://reddit.com/r/jobs/comments/17yq7b7/just_realized_that_a_job_i_have_applied_to/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 23
        },
        {
          "body": "Assuming you're not in the middle of a large metropolitan area with buses, light rail/subways, etc, it's probably because they want to make sure you have reliable transportation to the job, or perhaps they will expect you to run a few errands for them while on your shift.",
          "score": 19
        },
        {
          "body": "I’m sorry that this is a barrier for you. I would definitely still interview. If they bring up the whole personal vehicle thing I would ask if an alternative transportation plan would suffice. I too, don’t have a DL or car and it’s the biggest pain in the ass. I’m right there with you. I’ve found it helpful to think of all of the grown adults I’ve known even older than me who don’t have vehicles either. I’d say I’ve known over 10 of them.",
          "score": 4
        },
        {
          "body": "The DMV is kind of strict. My cousin who has an international license spent 4 years trying to get a driver's license there. \n\nWe mostly get our license within 2 months, but the expedited process due to corruption can shorten it significantly. I was nearly the only one who did not cheat the system and I feel so pissed off. \n\nGo for the interview even if it will take a while to get a car and a license.",
          "score": 3
        },
        {
          "body": "Most places just want to know that you have reliable transportation.  I have people who rely on public transportation, on weekends and certain holidays we have to essentially rewrite every shift because they can't physically get to work at the time they normally do.\n\nIf it's a sports coaching job for children?  They're probably checking that you can make it to game venues.\n\nGo to the interview, ask questions.  It might just be a standard question for whatever application system they're using that they've never changed.  It could be something that's there for a reason, you'll never know unless you ask!",
          "score": 3
        },
        {
          "body": "Go with the interview anyways.\n\nMy guess is that in the event of an emergency having a personal vehicle might be valid.",
          "score": 2
        }
      ]
    },
    {
      "title": "I was fired for \"not being reliable anymore\" ",
      "body": "Last year I quit my job of six months because they cut my hours significantly from four days, five-seven hour shifts to only one day a week and I later found out I basically trained my replacement who was working about the same hours I was before the cut but when I asked for more hours I was told there was no work coming in yet my replacement continued to work like normal so I quit on the job although my boss was very understanding and we parted on good terms. I basically worked for a small electronic repair shop and I mostly took care of the customer service/retail side of things and I also had managerial tasks like closing and opening shop, taking care of refunds, had keys for the shop, and the code for the money safe. \n\nAfter I left I went 3 months unemployed and through my college I was able to get out of retail and landed my first job in a office as a \"Student Library assistant\" working three days a week (two days were five hour shifts and one day was 8 hours shift) my lunch was anywhere between 30 minutes to an hour, and breaks were 15-30 minutes depending how fast we ate and both lunch and break were paid for us, I also counted with sick pay and vacation I absolutely loved my job, I basically sat all day doing very easy tasks like scanning books, putting barcodes on them and checking them in, some heavier tasks were working in the warehouse opening boxes and putting books on carts but that was it. I lasted 10 months before everything hit the fan, I started to have banking issues so I called my bank and since it was evening I was asked to come into the branch and we could resolve the issue the next day so I emailed my supervisor and head of the department that I would need to the day off the next day to resolve the issue at hand. Long story short my account was closed and my money was frozen until I could get it in the mail so I couldnt pay for an uber, lyft or bus passes and since I relied on public transportation I couldn't count on anyone to take me to work so I sent another email that I was waiting on a friend to let me borrow money for the bus passes and I'll be in by the end of the week.\n\nOn 07/16 I get an email from the head of my department asking why I wasn't in that day and that if I worked less than 10 hours per week it was considered position abandonment. I checked my emails to see if my emails went through or not and it turned out none of my emails were sent nor were they saved so I responded and let her know. When I returned on 07/18 I was Able to enter the building with my key fob and was able to clock in and got to working, five minutes later the head of the department pulled me into a room with Human Resources and was told that I was no longer a reliable person and that I needed to turn in my fob and go home that my services were no longer needed. I just don't understand what happened if my internet wasn't working or why my emails didn't send I just held my head up and walked out of there of course escorted by the head of the department who tried to make small talk before HR arrived and they fired me. Luckily I have an interview for a sales position at a health insurance company on 08/05 but it still felt wrong why I was fired.\n\nThe policy I allegedly violated was related to not reporting my absences at least 30 minutes before my shift started and I made sure to send them 24 hour notices but they never got my email, the policy also included unless it's under unusual circumstances which I felt it was but then again they didn't agree, they also tried to say I abandoned my position because I worked less than 10 hours more than 3 days in a row however, had I worked on 07/18 and 19 I would've done 14 hours and the week before I only worked 5 hours but missed just two days. ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1eidpvh/i_was_fired_for_not_being_reliable_anymore/",
      "comments": [
        {
          "body": "Too long to read but they can kiss your ass",
          "score": 1
        },
        {
          "body": "They were probably looking for a reason to fire you. If they don't give you any time to explain or abide by their own rules, they are the problem, and it's best if you just leave. Instead of ensaring yourself down a bigger hole.",
          "score": 1
        }
      ]
    },
    {
      "title": "I want to give up",
      "body": "Did the interview, I researched the job before doing interview with interview questions and role positions. Still failed the interview. I have a whopping 0% success rate from all the interviews and this is my third interview from a \"entry level\" job. It's literally impossible to get a job without experience. No one wants to hire someone without experience and it's obvious at this point. It's a waste of time doing interview.\n\nI don't do well on interviews. However an interview isn't a reflection of my work ethic and ability to do my work. I try to improve every single time and I still get rejected every single time. I feel like they like having the power role of rejecting someone that actually needs the job. \n\nInstead of getting upset and not finding solutions here are the few solutions I come up with. I try. \n\nGo trade school - give these jobs a reason to give you a chance since you have literal proof of you yourself being qualified. Doesn't guaranteed a job but it might be easier than the \"entry level job\"\n\nDrivers license? -  Uber eats, Lyft, door dash, might hire anyone. Which is good. But one problem, I don't have a car and they don't provide a car. I can rent a car but idk if I'll make more profit than I can spend....\n\n^ also, I read online that Amazon provides a car but guess what? They do interviews. And probably ask for driving and customer service experience which I had NONE and it's an automatic fail without even being in one. It's absolutely ridiculous. \n\nIs there ANY solution to this? Is there a job that's guaranteed?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/15028lz/i_want_to_give_up/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "What type of jobs are you applying for? Don't think just because you have no experience that you can't get a job at entry level. You can draw on your life experience as an experience and you should be doing this.\n\n  If im interviewing someone and say \"tell me about a time a customer was angry and what did you do to resolve this situation?\" And they said \"oh, I never had a job\" yeah they aren't getting hired. But if they said \"well, I haven't had a job but I have had to deal with complicated situations like that during so and so and this is how I went about it and this is what the outcome was\" ok now there's someone who is thinking on their feet and showing they can react to a negative situation professionally.",
          "score": 1
        },
        {
          "body": "Feel you. Had a 7 hr loop w amazon and didnt make it. Feels bad lol",
          "score": 1
        }
      ]
    },
    {
      "title": "Declined an offer from Lyft and not sure if I can find remote job instead",
      "body": "Hi!\n\nI’ve declined a job offer from Lyft mainly because I would’ve had to relocate 800km away.\n\nNow realizing that I don’t want to relocate, I’ve been trying to apply for remote work instead. What are my chances of simply having a first interview at a company as cool as Lyft?\n\nI am a software engineer with only 3 years of experience, I have done two AWS certifications (solutions architect and developer associate) and my experience is mainly in nodejs and Java, although I currently work for a small consulting company and so I have been exposed to a ton of different projects.\n\nIs it unrealistic to wish for a company such as Lyft to call me back for a remote job? My goal here is to find a company where I will learn a ton! And of course, a company that will look good on my CV! \n\nI live in Quebec, Canada if that matters.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/17jlbfe/declined_an_offer_from_lyft_and_not_sure_if_i_can/",
      "comments": [
        {
          "body": "Most corporations at a scale of Lyft are doing some form of RTO. Remote still be out there in pockets but hybrid is more likely",
          "score": 3
        },
        {
          "body": "Don't worry, Lyft sucks to work for and probably won't be around in a decade. Ride sharing and on demand apps are miserable places to work, speaking from having worked at 2. \n\nThe remote jobs are still out there - look for companies that are smaller and profitable, or are otherwise seeing revenue growth without sucking on the VC teet. These are the ones that practice good, basic business approaches and are more likely to have a leader who can recognize the benefits and pitfalls of remote work without following whatever newest Zeitgeist Paul Graham spits out on twitter.",
          "score": 3
        }
      ]
    },
    {
      "title": "Am I undervaluing myself?",
      "body": "1st off thanks in advance for taking the time to read this long post, to give me help, advice and respond back! Which you need to understand the back story in order to understand my situation, which is job related.\n\nSo my mother passed away in November of 96 when I was 6 of ovarian cancer. Then I lost my father in December of 2021 and I did lose other family members throughout the years before my father passed away as well. When my dad passed away I was working for him for the past 2 years. I was a caregiver to him because he was getting sick and I also worked for his law firm as he was a very busy well-known criminal attorney that needed help. \n\nWhich when my dad passed away, I was living with him and I needed to sell/get rid of all the high-end antique furniture that we had in the house and put some of the stuff in storage for me. Also from my dad's side, I don't have any other family whatsoever and I only have my mother's family that's from and lives in the state of Pennsylvania. So I had to relocate from Florida to Pennsylvania and live with some of my family because of my dad's passing and the fact that he left me in a really bad living/financial position.\n\nWith that being said, I do have other work experience like at least 2 years of restaurant server experience, 4 years on and off of food deliveries (DoorDash, Uber Eats), 4 years of being a chauffeur (Lyft, Uber and a personal chauffeur for my dad), 6-7 years of small business retail sales, 2 years of personal assistant for a prominent local attorney and 2 years of caregiving services. \n\nThen when I came to Pennsylvania I just immediately started doing food deliveries again for DoorDash and UberEats. Which some of you may know that this is not a good steady income as there's taxes, gas, wear and tear on the vehicle and the fact that the amount of money you make for the same amount of hours each day varies (including days that you'll make no money and or you get no orders at all in a very very long time so you just call it a day). Which having this type of income is not the way to live my life and so I was looking for other jobs since I came up here in April. So far for a lot of jobs that I applied to, I got absolutely no callbacks and the ones that I had callbacks from and or interviews with denied me the job. Also, since I've been up here, one of my aunts (mom's sisters) kept telling me to apply to this big local high-end grocery store chain that she knows the owner/a lot of people at the company well and she also works part-time for them being a banquet server/bartender at events (they do full private catering). So for a while they gave up on me applying to that specific company, but they see that I'm not getting a job elsewhere and the fact that a lot of days lately I'm not able to get in to do food deliveries (if you want to know why, feel free to ask, which this is a known thing within the gig job economy).\n\nNow in the past few weeks, my family has been pushing me to apply to this local high-end grocery store chain again. So last weekend I ended up applying for numerous jobs for this company. Then on Monday I get a call back and they told me that they wanted me to be a dishwasher at their headquarters office where they prep for the catering jobs and they prepare all they already made foods to be delivered to the store locations, but I'm only making $14 an hour 5 days a week with majority of the of all Sundays and all major holidays off (some weeks leading up to Thanksgiving and Christmas I need to work 7 days a week, but then I get the holiday off). Also I did apply to be a cheese specialist, a deli associate and sales at specific locations, but I never got a call back/herd any interest from them about those positions (which according to their website all the positions that I've applied for has been posted for at least 21 days or more without being filled). \n\nYesterday (Tuesday) I went in for a job interview. Which honestly it seemed like they were desperate to hire somebody for this dishwashing position, then within a quick few minutes they instantly hired me on the spot. I brought my resume with me reflecting all the job experiences that I mentioned in the other paragraph. Then without being rude and direct about it, I brought up my work history/work skills to let them know that I'm basically overqualified to be doing a corporate dishwashing job and they didn't seem to care or have any interest in that. Which I knew I was coming in strictly for this dishwashing job and I should have denied coming in and then if I did go in deny taking taking the job when I was there. Also maybe I should've pushed more to try to get another position/job within the company rather than this BS dishwashing job that just makes me extremely anxious (to the point that my whole body trembles) and depressed. I mean at least if I'm going to get paid that type of BS money, then I at least want to do something that I enjoy doing. Rather than just taking/doing this job just to please my family, while being extremely miserable every single day! \n\nSo with the experience that I have, am I undervaluing myself by taking this dishwasher job? Maybe I should just take this job until I find a better job? Also should I just not show up to the dishwashing job (even if I called to let them know) and just continue doing the delivery gig at least until I find a better stable job then this dishwashing job? \n\nWhich on top of all this feeling very down/depressed with myself because I feel like I'm a loser and I'm embarrassed with/at myself that I have to do/I can only get offered this type of job at 32 years old (which I'm going to be 33 in January). So Honestly I'm extremely lost here and don't know what to do and any other help and advice again would be greatly appreciated!",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/z8qgvs/am_i_undervaluing_myself/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "It does seem a very low wage. It is up to you in the end. In the past I made slightly more than you but even that was not very good and felt so little after taxes and paying for insurance and transportation. \n\nYou should have negotiated higher before accepting because in some parts of the city, jobs without experience can start at 21 per hour here. Usually it is 19-21 dollars since no one can live off of 15/hr here.",
          "score": 1
        },
        {
          "body": "Factually... I don't know if you're undervaluing yourself or not.  You didn't say where in PA you are.  It's possible retail or restaurant work is all there is available where you are at the moment.\n\nBut if I'm just going of sentiment I'm leaning toward you are selling yourself short.\n\n*I also worked for his law firm as he was a very busy well-known criminal attorney that needed help.*\n\nFrom looking at that and also from too many details in your post... what would help a lot is if you repurposed yourself.  You may have an aversion to this type of work but I imagine what you know about criminal law or law can get you better paying work where you're not on your feet for 8 hours a day.\n\nShort term goal - get better paying office work\n\nMedium term goal - \"graduate\" into a paralegal position\n\nLonger term goal - no idea.  But where ever you end up you'll be better off trying to figure out what to do when you're making paralegal money",
          "score": 1
        }
      ]
    },
    {
      "title": "Hundreds of applications. 1 interview. 3/4 months. No job. What do I do?",
      "body": "I’m a 23 year old college dropout. I usually pride myself on my ambitiousness and communication skills. Former co-director of a DC nonprofit, had a stint with entrepreneurship, and I worked as a lobbying assistant at the same time. Always been a techie. Self taught I.T. Got a couple certs. \n\nAbsolutely no leads. 99% of companies don’t even bother to send a rejection email. The ones that do are automated. I drive Uber/Lyft to pay bills, networked as best as I know how, but I’ve become so frustrated that it’s taking a serious toll on my mental health. \n\nIn my mind, all I want is a win. I’ve gone through so much failure in life that it’s laughable, and none of my long term goals seem attainable anymore. \n\nI’ve redone my resume with peer and even paid review, had multiple mock interviews, I’m on every conceivable job site, and I’m only looking for an operational support role. Nada. Zilch. Zero.\n\nAlso driving Lyft and Uber absolutely blows. \n\nWhat do I do? I’m completely at my wits end. I’m in DC and open to moving anywhere.\n\nEdit: In DC, willing and prefer to relocate. Been here my whole life.",
      "subreddit": "jobs",
      "score": 26,
      "url": "https://reddit.com/r/jobs/comments/zgvu7j/hundreds_of_applications_1_interview_34_months_no/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "You’re 23 and you dropped out of college when you were 19? 20? So in 3 years you’ve been a nonprofit director, an entrepreneur, a lobbyist and an IT specialist? This is a huge red flag. Tailor your resume to focus on one thing and show how you improved at it over time.",
          "score": 43
        },
        {
          "body": " Might just be me but if I’m reading a resume and the applicant touts themselves as an entrepreneur it puts up a red flag.",
          "score": 13
        },
        {
          "body": "Chances are your resume is shit.\n\nDouble check it for spelling and grammar mistakes. Maybe go for a simple yet professional format too.",
          "score": 7
        },
        {
          "body": "A self taught techie usually won’t get anywhere without experience. You need valid proof of experience and a vast majority will require a a degree for entry level or certs which you have. Find yourself an entry level position, or go back to school and finish up for a successful high paying career. As of right now, a career might be out of your reach since your experience is all over the place.",
          "score": 4
        },
        {
          "body": "You are either applying for the wrong jobs for your experience, or your resume isn't very good. Or both. Hundreds of apps with 1 interview is time to look in the mirror.",
          "score": 10
        },
        {
          "body": "Post your resume on r/resumes for feedback",
          "score": 3
        }
      ]
    },
    {
      "title": "Giving up…",
      "body": "thinking of giving up….\n\nI hope everyone here is having a good day…\n\nI am a 24 year old male, who recently graduated last year in 2024 with a bachelor’s degree in business management, I reside in south Florida, Palm beach county…\n\nIn 2021 of October, I lost my mom, who was a single mother, to Covid.  I was 21 at the time. The only family I have is my sister and have no contact with my dad since he was very abusive, and was a horrible person….\n\nMy mom, did not have any health insurance, no life insurance, no retirement money and no money saved…\n\nBecause of this, I was evicted from her apartment in Orlando. I had to sell everything, and sell so many valuables. I was supposed to have my mom’s car when she passed, but she never had the chance to write a will, so my sister took it, and most of the things in the apartment and sold it to help settle the estate, and my mom cremation…. \n\nMy sister lives in Texas with her husband, she doesn’t want to help me, even when I needed a place to stay after my mom passed, she said she “has no room for me”…\n\nBecause I had nowhere to stay, I had a roommate in college that is now letting me stay at his mom’s house, him and his sister lived there as well. \n\nWhile I’m grateful for the help with housing, and with feeding me, they have not helped me in any other way when it comes to getting my life back on track.\n\nThey haven’t helped me look for jobs, or asked anyone around for any opportunity,  and it doesn’t help that my friend from college, has serious, psychological issues, and says that the  the other personality in his head tells him he feels “bad for me and wants to put me out of my misery because of my sad life” he won’t do anything to physically hurt me but the thought hurts me, cus I’ve been nothing but kind to him…\n\nHe keeps me up at night, because he only works two days a week, and plays video games all night, while screaming in his room and I can hear him. \n\nI can’t sleep, I have nightmares, I’m depressed, I have anxiety attacks, I have days where I don’t eat, and I have days where I eat a lot… there are days where I don’t even leave my bed, and I just cry for an hour until I fall asleep and sleep the day away during the weekends….\n\nI would ask his mom for help like how she helps her own kids but she doesn’t seem like she wants too… she helps him look for jobs or find opportunities (he’s been out of college for almost 3 years) \n\nThe “voice in his head” doesn’t allow me to have my girlfriend spend the night, which isn’t fair to me considering I only have 1 friend down here other than my gf and he’s usually busy with his life…. While he has several friends that always come over… basically his mom doesn’t allow it cus of HIS mental issues…\n\nI feel like an outsider in this house I live in, I don’t get treated the same… a clear example is, for Hanukkah (they’re Jewish I’m not) I only got a bottle of bbq sauce and a bit of money.  they got the bbq sauce on their cruise to Jamaica… they said it was handmade in Jamaica but I can find it on amazon with free shipping for $15 so… her son… got several other gifts as well as her daughter… \n\nI feel trapped in the house and alone… we have a local service, in our area that allows me to get Lyfts for $3.50 but I only get 50 rides a month so… and I’m limited on my money so… I can’t really enjoy my youth… and it’s limited to only palm beach county…\n\nI’m currently working in an internship for my local city government. I go to different areas each day, and work in different departments to gain as much experience as I can. I work very fast and hard so usually if my supervisor doesn’t have any work for me for the rest of the day, I just look for jobs, since this internship only lasts until 20 January, which is this month…\n\nI’ve been applying to jobs every single day since I graduated college last year in May… I’ve only had a handful of interviews, a lot of them I thought went very well…. But sadly, I haven’t been hired yet. The only other jobs offered nearby are commission based sales, which isn’t reliable because it has no salary… or, restaurant jobs that pay me $10 or $12 an hour…\n\nI have ADHD, and I have Asperger’s, which is basically tier one autism… I don’t mean to victimize myself, but I’ve been through a lot in my life… more than what the average 24 year-old goes through… \n\nI just got denied by another job, and I don’t know what to do anymore… I feel like running away, and giving up… I’m scared that my girlfriend’s going to break up with me, because her family is worried about her dating me because of my situation… she’s in a similar situation, she works two part-time jobs, though, and we went to the same college… \n\nI’ve been trying to get momentum for almost a year, I need to build things from the ground up, I have bills I need to pay, most of the things from my mom’s apartment that are valuable to me are in a storage unit three hours away from me, it’s a monthly bill, not to mention. I just got an email telling me I have $12,000 in student loans I need to pay off, to which I can’t pay them off right now cause in about a week or two I’ll have no job so those are developing interest right now…\n\nI don’t know why no job will give me a chance to prove myself, a job with decent pay at least, I lost my mom in the middle of college and luckily had a GoFundMe that I was able to raise some money to help me get through college and pay for my phone bill, and health insurance as well… sadly, that money is gone… I just got denied by another job interview… I’m running out of options, and don’t know what to do… soon my friend’s mom is going to be charging me rent… I graduated with the 3.8 GPA, I was almost valedictorian, I was top a five student in my entire school… I just don’t know why I can’t find anything, I know I need experience, but no one’s willing to even give me experience… I’m willing to put the work in, I’m willing to be patient… but I don’t know what to do, if I don’t have enough money to pay my bills, such as Phone, health insurance, storage unit, and now student loans… I don’t know what I’m going to do, I will lose everything that is valuable in that storage unit, a lot of those things that are irreplaceable, and if I lose those things, it’s like losing a part of me and a part of my mom….\n\nThe person helping me with my finances lives in Virginia, and is the mother of another friend I had in college that was my roommate… she lives in McLean Virginia. Which is a very rich area. Her son just told me they they’re about to spend eight grand on a stove, because they want to renovate the kitchen. She bought her husband a new Tesla model Y in cash. They live in a house that is now worth $3 million, and they have $10,000 art pieces hanging on their walls… oh, and every year in December, they take a first class flight to Hawaii, and stay at a very nice hotel, and eat very expensive food every year…\n\nI hate asking for handouts, but I don’t know why they just won’t help me figure something out… \n\nMy mom and I used to let both of the parents’s kids stay at our apartment orlando, when they couldn’t go back home, we would feed them whatever we want, I would give them my bed to sleep in, while I would sleep on the couch … we didn’t have a lot of resources, but we did what we did the best to treat them like family and make them feel like royalty as much as possible ….\n\nI’m really kind, generous, giving, golden heart, kind of guy. Because of that I’ve been hurt by people in the past, but I stay persistent, but I don’t know how long I can keep going….\n\n\nI’m at my wits end, and I suffer from severe depression, I don’t know what to do with my life anymore, I’m thinking of running away, or possibly just killing myself… I don’t want to let my mom down as she watches over me… but I don’t know what to do… I don’t know how I’m gonna make any money to pay everything… I reached out for Social Security benefits, and they always deny me… even survivor benefits they denied me… \n\nI feel trapped… I’m lost… I’m tired, I’m anxious, im depressed and I don’t know what to do anymore…\n\nPlease… any words or a step in the right direction would be life-changing… even work opportunities…. Please… anything… 😞\n\n\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1hwq1bq/giving_up/",
      "comments": []
    },
    {
      "title": "My Mental Health Has Declined Significantly Because I Have Been Unsuccessful Finding A Good Job",
      "body": "Before I start I want to let you know that this is going to sound like a sob story but it's not. This is really my life.\n\nTo start off I'm 20 year old, I'm a woman, and the only job experience I have is Starbucks which I quit 8 months in because my boss was extremely verbally abusive to me and other co workers. It was a crapy job, it only paid $15 an hour so I was fine leaving it in hopes I'd either get a better opportunity or another crapy job with better pay. But I can't fathom how hard it is.\n\nI've tried working for Sams Club, I landed an interview but they cancelled the interview before I could even attend it. \n\nI tried to get a job at Walmart but they didn't even call back, nor did they answer the phone when I called them.\n\nMind you I don't have a drivers license, or a car so anywhere I want to work has to be close enough for my boyfriend to drop me off, and pick me up. Now before you ask NO there are no buses in the city I live in, there's no Taxis, no Uber, no Lyft, we don't even have side walks on most roads, (if you're wondering its a small city in Texas). So getting a onsite job here felt impossible.\n\nMy friend has been working remotely since 2017 and she has tried to help me get a remote job. I mean a remote job sounded great, I didn't have to commute anywhere and I didn't have to burden my boyfriend with picking me up from work. She helped me with my resume, my cover letter, everything looked promising. I applied to so many remote jobs on every job board I can think of. Indeed, Linkedin, ZipRecruiter, Remotehub, and all I have gotten are scams or MLA scams. I know I am qualified for a remote job, I am computer literate, I am capable of using Microsoft Office, I can type fast, I just lack the job experience but how is that my fault when no one will hire me?\n\nI feel like I'm at a dead end in life. My family doesn't talk to me anymore, my relationship with my boyfriend is sour because Im depressed all the time, I live a state that I'm not familiar with, I don't have anything. I just want out, and sometimes I feel like the only way out is through death. Nobody would even notice or care. I don't know how long I can keep trying to get myself out of this hole I dug myself, eventually I'll be too exhausted and Ill end up dying in it.\n\nAny advice on landing literally any job would help.",
      "subreddit": "jobs",
      "score": 63,
      "url": "https://reddit.com/r/jobs/comments/1aiwz69/my_mental_health_has_declined_significantly/",
      "comments": [
        {
          "body": "You may want to use some free counseling videos on Youtube to work on your mental health as well. Having poor mental health won't help your job search and even if you do get another job, it will become a hindrance for you.",
          "score": 6
        },
        {
          "body": "Education is the key. Seek out community college programs to get started. Many are fully online. A small amount of effort there will go a long way. If you enjoy it, you can continue your education further in the future.",
          "score": 9
        },
        {
          "body": "I'm not the best person to be giving you advice, but I've been in some tight places at countless points in my life. I don't have any quick-fix answers for you, but I find having a trade | certification helps a LOT.  \n\n\nIf you have the time or the energy. Look into doing IT work and obtaining IT certificates via CompTIA. It only takes a few months to study and obtain your core 3 certifications (A+, Security +, Network +)  \n\n\nAlso depending on where you live, I know some places have programs that teach these certs for free to women and minorities.  \n\n\nWhen I was a homeless teen (this was well over a decade or so ago, so once again doesn't fully apply) I met a guy who was a plumber and an electrician and he said even during the great recession he was always able to eke out work because he worked in a field where there will always be value and has a need (think labor work or infrastructure based computer work) that doesn't take a year of your life to obtain the education you need to get started.  \n\n\nI don't know you or anyone on this website but I believe in you. Keep trying yo!",
          "score": 8
        },
        {
          "body": "Agree with people who talked about Tech or trade certifications; if you like those skillsets that's probably the long term best move. But I've also got some other suggestions if that doesn't apply.\n\nBlue Collar option -- If you don't have physical injuries or impairments, possibly try USPS as a Mail Handler Assistant or Clerk/PSE and relocate to the city the plant or office is based out of (from what I've heard, being a carrier sucks really bad for the new people coming in so wouldn't recommend). Once you make it past the 90 day probation it's really hard to get fired, and once you get a conversion to career regular it's a fixed 5-day week. It is a lot of physical work and walking though, and probably night shift for months so that's a con. Another con is the management can be a pain in the ass depending on the installation you're placed in.\n\nCustomer service/minimum wage option -- If you know you won't be able to do heavy lifting or night shift work, then in cities like Dallas/Fort Worth/Irving, or San Antonio there's more retail/customer service jobs to tide you over until you can get education or connections to get into an office job. Even being waitstaff can make a living depending on what area of town it's in and the amount of money people spend per meal (restaurants like Cheesecake Factory immediately come to mind).\n\nWhite collar option -- Another job idea is being a full-time bank teller and trying to work your way into back office. If you're reliably able to get to work and do good customer service that can be a very stabilizing job. It's possible you'd have a job or two open in your city because banks and credit unions are everywhere, but if not there's definitely opportunities in the metro areas. I'm trying to get into a finance job like Teller myself if I can because the ability to move up in an organization or job hop for salary growth seems better than many industries right now.\n\nBonus -- For a last recommend, if you really want to get adventurous -- sites like CoolWorks have seasonal jobs all around the US, many of which provide room and board and often have the housing on site so no car needed. There's different kinds of jobs and not all of them are outdoors, though many of them do involve working with people so that's one thing to consider. If you're trying to make a lump sum of money in a short period of time and potentially get a lot of overtime, that might be a way to get enough savings to put down on a vehicle and/or your ticket to relocate into a better city with better jobs after the season ends.\n\nWishing you luck with your job search and hope my answer was helpful!",
          "score": 2
        },
        {
          "body": "U Apply to poor jobs ran by poor Management🤔\nMost jobs are poor because of poor Management...leading to poor outcome...even their hiring process.\nAttend College.",
          "score": 0
        }
      ]
    },
    {
      "title": "Would you apply? ",
      "body": "I applied for a position at a hospital and got a preliminary interview, from there I got a in person interview.  Due to a pre-existing medical issue I had to call and ask for a reschedule. They replied by email saying thank you for letting us know.  I replied back saying I was still interested the job and could we reschedule? The next day he replied saying we have moved on and selected another candidate. Feel free to apply for something else of interest. I would have spent $55 on a Lyft and 3 hours and it sounds as if they had sometime mind. \n\nWell, they have a social worker position that just posted and should I apply? In a way, I feel as if I might have been “filler”.  Good pay, good benefits.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1g391bx/would_you_apply/",
      "comments": []
    },
    {
      "title": "Can't Drive",
      "body": "Hey all. I just had a preliminary phone interview for a entry level position. I am in PA. Position on MD. About 1hr away. I am unable to drive because of a TBI. He asked if transportation would be a problem. I said no. I have traveled greater distances and have great success with Lyft. Do you think this will hurt my chances?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1f3ij64/cant_drive/",
      "comments": []
    },
    {
      "title": "Landed a job after 11.5 months of unemployment.",
      "body": "I somehow landed a job with the city after a year of unemployment. It'll be temp to hire, 40 hrs, and full benefits. I'm damn near grateful I finally found employment.\n\nAnyone reading this, don't give up.\n\nI spent everyday researching and applying to jobs. I applied to over 100 jobs, 5 interviews, almost 30 variations of my resume, and a lot of disappointment. What helped me through the whole year was exercise:\n\n1. *Getting up early*\n2. *some sort of stretching/exercise*\n3. *a small breakfast and going straight to work (as in applying for jobs).*\n\nIf you have friends locally try to reach out and just hang out when you have some free time, just to unwind and decompress. \n\nIn the beginning I was playing a ton of video games to pass the time, so I removed it from my room to stay focused. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/cg99vrrzitb71.jpg?width=720&amp;format=pjpg&amp;auto=webp&amp;s=a9371a4defcdf7d0a1817f879ade33ece052174d\n\nTry your best to stay focused without burning yourself out, **you have to really manage your mental and physical well being because nobody will do it for you.** \n\nThese are some things people don't tell you while you are unemployed. I had to go through therapy a few times, not necessarily about the job hunt but just someone to talk to. Even after accepting this job, I'll continue applying to more because nothing is ever a guarantee. I had 3 interviews with company X and on my last one I walked away with basically a verbal offer. The next morning she emailed me saying despite my over qualifications they have to look at the entire candidate pool. That was gut-wrenching because despite my confidence in nailing that job, they ripped it out of me the last second and I really thought that was my last opportunity to finding something.\n\nSome type of income while job searching:  \n\n*A few friends of mine suggested doing something part time on the side like Lyft/Uber. I think it's a good idea if you have the wheels to do it. Bring in some cash to pay the bills and also get out of the house. Getting out of the house was big for me. Which is why I stress the importance of finding a good gym or a park to run around. There is also fiver and side gigs you can find on craigslist so I recommend something that takes about 10-15 hrs of your time and you don't have to bring work back home to.* \n\nI really hope some of this info helps you guys. I know r/jobs and r/resumes really helped me through this. I appreciate you all and let me know if you need any help. I'll even look over your resume and let you know what might be missing or what needs to be edited.\n\nP.S If you have any tips about working for the government or for the city , I'd really appreciate it. Thank you.",
      "subreddit": "jobs",
      "score": 79,
      "url": "https://reddit.com/r/jobs/comments/olrqed/landed_a_job_after_115_months_of_unemployment/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Congrats on landing a job. Did you have any anxiety when applying to jobs? I’m currently unemployed and I always feel under qualified.",
          "score": 9
        },
        {
          "body": "Well there is me after almost 3 years of unemployment and working a min wage job that's probably illegal... Totally was worth doing a masters....\n\nGood luck, lovely human...\n\n\nI go cry now.",
          "score": 5
        },
        {
          "body": "Congrats on the on the job, bud.\n\nI’m going to be unemployed soon. Been trying to land something and having major issues, even for entry level sales roles. Had the day off today and couldn’t even enjoy it. Dunno what the fuck I’m going to do without a job to keep me busy. Thank you for the tips.",
          "score": 4
        },
        {
          "body": "Congrats 🥺🥺🥺😭😭you deserve this!! I love seeing people win! Ugh!! Love that for you 💙",
          "score": 2
        }
      ]
    },
    {
      "title": "A dream job 116 miles away, but I can't relocate at the moment.",
      "body": "So.. I have an interview coming up for a dream job with a gov agency located in DC but I live in Delaware 116 miles away. Its a 2h drive each way and I am currently unable to relocate. Should I go for it? Here are some stats:\n\nFirst year salary 56k\n\nSecond year salary: 80-130k\n\ntotal annual miles if I commute by car: 65k\n\nAnnual cost if I take the train + Uber/Lyft: 20k ($940/month for the train + ubering from station to job location)\n\nMy car stats: 2023 with 9k miles on it (MSRP $26,000)\n\nI may be able to relocation in 2 years.\n\nIs this job worth it? Should I commute by car/train or should I just move on?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/18fuaty/a_dream_job_116_miles_away_but_i_cant_relocate_at/",
      "comments": []
    },
    {
      "title": "Lyft ML Engineer Interview",
      "body": "Hi. Just as the title suggest, I have a lyft ML Engineer interview coming up, and I wanted to know if anybody else had previously given this interview.\n\nWhat kind of questions were asked, what level, and what should one prepare? \n\nI just know that there's gonna be a 75 mins technical screening round first (coding + ML),. following which there are gonna be 3 more rounds - coding, ML, and experience/behavioral round. \n\nWould love to get insights from someone who has already been through this interview experience 🙏🏽\nThanks a lot! ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1poyv7w/lyft_ml_engineer_interview/",
      "comments": [
        {
          "body": "Congrats on landing it; from what you described, the screen will care more about how you reason than any exotic math, imo. I’d do a couple timed mocks with Beyz interview assistant and practice talking through solutions out loud. For coding, be crisp on graphs and explain tradeoffs as you go. For ML, be ready to justify metrics and discuss bias variance in plain language. I usually pull a few prompts from the IQB interview question bank, then rehearse 90 second answers for behavioral using STAR so I don’t ramble. A quick checklist next to you can keep you on track. Hope that helps.",
          "score": 1
        }
      ]
    },
    {
      "title": "Lyft Software Engineer, Android interview process?  T5+ role (Toronto, ON)",
      "body": "Hi all,\n\nSo I have call set up with the Lyft recruiter for an Android Software Engineer interview for their Toronto office. I would like to know what their interview process for mobile devs is? Specifically whether they have a Leetcode/DSA type round for mobile devs as well \n\nThis person from 4 months ago says yes there will be a DSA round  \n[https://www.reddit.com/r/leetcode/comments/1l2nuau/got\\_lyft\\_ios\\_offer/](https://www.reddit.com/r/leetcode/comments/1l2nuau/got_lyft_ios_offer/)\n\nThis person from 1 week ago says they went directly into the system design round (and I assume no DSA)\n\n[https://medium.com/@ios-interview/lyft-ios-interview-questions-my-experience-7b96dbb52dc3](https://medium.com/@ios-interview/lyft-ios-interview-questions-my-experience-7b96dbb52dc3)\n\nGranted both of them are for iOS, but I assume it's probably the same process for Android too. \n\n  \nAny one else recently interviewed with them? specifically in Canada? \n\n  \nTIA\n\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nv495a/lyft_software_engineer_android_interview_process/",
      "comments": []
    },
    {
      "title": "Lyft interview process?",
      "body": "Hii! So I just had two interviews with Lyft for a business support role. Basically customer service doing chat and emails.\n\nI am pretty nervous for my final 3 interviews and never had to do so many at once. Will be a total of 5 by the end of it.\nThe last 3 are titled interpersonal skills, operational excellence, and mindset.\n\nHas anyone interviewed and had a similar experience and how did it go for you? \n\nI am so use to maybe 3 max interviews and not 5 with it outlined like this so I’m pretty in my head about it. Any advice is appreciated ty for reading 💗",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1lnrr5p/lyft_interview_process/",
      "comments": [
        {
          "body": "The fact that you've already made it through two rounds means they're genuinely interested in you, so try to see these final three as opportunities to showcase different aspects of your skills rather than additional hurdles to overcome.\n\nThose final interview titles give you a roadmap for preparation. \"Interpersonal skills\" will likely focus on how you handle difficult customers and work with team members, \"operational excellence\" probably means they'll ask about your attention to detail and process improvement ideas, and \"mindset\" is all about your problem-solving approach and cultural fit. Think through specific examples from your past work or experiences that demonstrate each of these areas - customer service scenarios where you turned an angry customer around, times you improved a process or caught important details others missed, and situations where you showed resilience or creative thinking. I'm actually on the team that built [AI interview helper](http://interviews.chat), and it's designed exactly for situations like this where you need to navigate multiple complex interview rounds and want to practice articulating your experiences clearly.",
          "score": 2
        }
      ]
    },
    {
      "title": "Lyft Interview",
      "body": "Has anyone recently interviewed for the Lyft Data Analyst position? How was the interview with the hiring manager? What kind of business case do they provide? Does solving the business case involve writing SQL code?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1i86qm2/lyft_interview/",
      "comments": []
    },
    {
      "title": "I think I am done with interviews...",
      "body": "It's not worth it. I think self-employment is better. Every interview is just sad state of affairs. Some where there is \"What is singleton classes\", and some place else there is \"How do you invert a tree?\". Why should I learn how to invert a tree, i need an *inverted* tree. And there are abstractions over abstractions of already written functions that do that. Why do you want me to learn and explain and then do?\n\nThere is recruitment hell. People ghosting you! How difficult is it to say that \"sorry! you didn't make it\". I am bloody fedup. I am Healthcare Integration Specialist and a Full Stack Developer for 15 years. Deal with it.\n\nWe got to take matters into our own hands. I am just waiting for my license to start Lyft. Atleast that way I don't have to explain myself. If people don't allow you to explain what you *can* do, then it is a worthless interview. Immature Interview.",
      "subreddit": "interviews",
      "score": 11,
      "url": "https://reddit.com/r/interviews/comments/1ppxiyg/i_think_i_am_done_with_interviews/",
      "comments": [
        {
          "body": "Are you getting interviews for healthcare integration roles? Usually finding talent in this area is a bit more challenging.",
          "score": 2
        }
      ]
    },
    {
      "title": "Recommended for role that calls for 8 years of experience but i only have 2, help!!",
      "body": "I interviewed for a ops lead role at Lyft a couple of months ago and was told that i was overqualified and offered a manager role in a different city that i didn’t want to move to. yesterday, the hiring manager for that ops lead role emailed me out of the blue saying a Senior Ops Manager role is available in my city and she thinks i would be a great fit. i only have 2 years of experience tho (worked in ops management and promoted v quickly). even tho she believes in me, im nervous the other interviewers will think im not qualified and im not sure how to show them im up to the challenge. never would’ve considered applying bc of the experience difference until that manager reached out. for context, the person who reached out to me is also a senior ops manager",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/ogyh7c/recommended_for_role_that_calls_for_8_years_of/",
      "comments": [
        {
          "body": "The yoe listed on a job posting are just a proxy for the mix of know-how, knowledge and street-smarts that are required to do the job effectively in a typical case. You wowed someone and already got in with the assumption that you can do the job. Who are you to doubt the hiring manager? ;-)\nJokes aside, go in and focus on showing the competence you have. There is a minor red flag in that if they are willing to compromise on yoe, it may also mean that they are having trouble filling the position with candidates that meet their screening criteria: why? That is for you to figure out at the interviews. Watch the hiring manager and your future peers and ask questions about the person in this job before and how long they had it.",
          "score": 2
        }
      ]
    },
    {
      "title": "Need insight about Lyft Fraud and Risk analyst interview process and questions. What is the format ? Please help!",
      "body": "I have been looking for a job desperately and want to get out of my toxic workplace and finally got an interview after months of companies ghosting me. Would really appreciate the help fellow redditors.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1otujbu/need_insight_about_lyft_fraud_and_risk_analyst/",
      "comments": [
        {
          "body": "omg my roommate did this last year. apparently there's a lot of sql and scenario-based questions to see how you'd handle suspicious activity patterns, so brush up on both if you can!",
          "score": 1
        },
        {
          "body": "On Lyft fraud and risk, the format I saw was recruiter screen, then a case style round on detecting suspicious patterns, a SQL or Excel task, and a final panel with behavioral plus product sense on metrics like chargebacks, precision and recall, and false positive costs. Expect questions on how you’d size an alert, build features, and communicate tradeoffs. What helped me was doing timed SQL drills and narrating my reasoning out loud. I ran quick mocks using Beyz coding assistant with prompts from the IQB interview question bank to keep answers tight. Use STAR, cap stories around 90 seconds, and prep one scenario each for escalation, cross team conflict, and a bad data surprise. Good luck, fwiw this is very doable.",
          "score": 1
        }
      ]
    },
    {
      "title": "Lyft Data Analyst Interview",
      "body": "Hey, recently got an email, wanted to check if anyone knows the process of Lyft interview and how is the overall process like. (DS/DA roles)",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1l8lh17/lyft_data_analyst_interview/",
      "comments": [
        {
          "body": "Lyft's data analyst interview process typically involves 3-4 rounds starting with a recruiter screen, followed by a technical phone screen focusing on SQL and basic statistics, then an onsite (or virtual) loop with 2-3 interviews covering case studies, more advanced SQL, Python/R coding, and behavioral questions. The process can take 2-4 weeks total, and they're particularly interested in your ability to work with messy real-world data, think about metrics that matter for a rideshare business, and communicate insights to non-technical stakeholders.\n\nThe technical bar is solid but not unreasonable - expect SQL questions around joins, window functions, and data manipulation, along with case studies about optimizing driver utilization or analyzing rider behavior patterns. Practice common [data analyst interview questions](https://www.interviews.chat/questions/data-analyst) focusing on A/B testing, metric design, and how you'd approach problems like \"How would you measure the success of a new Lyft feature?\" The behavioral portion weighs heavily on collaboration and stakeholder management since you'll be working closely with product and engineering teams who may not have your technical background.",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Lyft Software Engineer Interview",
      "body": "I have recently interviewed for Lyft Software Engineer (Backend) role in US. The final loop has 4 rounds.\n\n1. CS fundamentals - This is a coding round. Mostly leetcode based. I felt the problem was easy and I was able to explain the approach quickly. I solved the problem quickly and ran successfully. Also answered follow up questions. Completed interview in 30 min (60 min allocated to this round). Discussed few follow up question with interviewer.\n\n2. Laptop round - I was given a real world problem and asked to solve in my local IDE. This is my first time taking round of this kind. I was able to solve 2 parts of the question and handled edge cases. Submitted my code file in zip format for review. The interviewer iterated me through my approach and asked clarifying questions. This round went 5 min over the allocated time since I was asked to make a last minute change which made me to make change in other parts of logic. Overall I was able to solve the problem and handled error scenarios. Didn’t get a chance to ask follow up questions in the end.\n\n3. Design round - This round went well. I discussed on functional and non functional requirements first. Then I listed some API calls, designed basic data base for the use cases and designed a system. Had a discussion on the overall flow and answered clarifying questions. Overall I think I covered all the parts that are expected and had decent discussion with interviewer on the approach.\n\n4. Manager round - I had discussion with hiring manager on my past role, experience and some culture fit questions. There are some scenario based questions that were asked on my past role which I was able to answer for most parts. Overall this round went well. The hiring manager tried to cover different scenarios like how I based the projects in last role, how I mentored the teammates, how I handled the LLDs, communication with team members and stake holders and other questions. (In follow-up questions at end of interview, Manager mentioned most of my skills that I performed in my last role are expected in this current role which made me think this role went very well. Just an assumption though)\n\n\nPost interview, recruiter said debrief will happens next week and they will be able to give the decision. I was worried about the Laptop round since it went over time. The preparation document said grading will be done for this round based on correctness, clean code and performance. \n\nAny idea on my chances of getting hired for this role? Please add comments in this thread if you faced a similar situation.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1jweeor/lyft_software_engineer_interview/",
      "comments": [
        {
          "body": "Hey, did you heard back from them? I also had the interview at lyft a few days back",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Hey do you have any idea how much weightage is the experience round and are candidates rejected due to that round itself ?",
          "score": 1
        },
        {
          "body": "Hey, did you recieve the offer? I'm stuck after clearing all rounds.",
          "score": 1
        }
      ]
    },
    {
      "title": "Lyft Operations Lead Interview Advice",
      "body": "Just had my phone screen for an Operations Lead role at Lyft, and I have my next interview with the hiring manager tomorrow. I was told there's an analytics/excel test. Wondering if anyone here has any experience with that/tips for how to prep for the exam? Saw some guides only that were $70 and would love to hear if anyone has found those helpful",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/mcjst8/lyft_operations_lead_interview_advice/",
      "comments": []
    },
    {
      "title": "Interviewing Techniques - Offered As An E-book!",
      "body": "As someone who is interested in advancing their career, I wanted to gauge people's general interest in an e-book that contains all the technical steps and techniques for excelling in the job interview process and beyond. \n\nThis e-book would be designed to help those who are between jobs or looking for a new start by offering guidance on preparing for interviews, employing techniques that set you apart from other candidates, and creating a 30/60/90 day strategy for success once you are hired. \n\nIt goes beyond just a resume fix and focuses on helping job seekers become an \"All Star\" employee. As someone who may be interested in career coaching, I am considering going into consulting in the career coaching field, and I believe this e-book would be a valuable resource for anyone looking to excel in their career. \n\nI have had a lot of interviews with all sorts of company's including Google, Lyft, etc and I know exactly what it takes to Pass an Interview. Remember I said pass an interview, not getting a job. No one can guarantee you get any job, but employing tested strategies increases the likelihood of getting that dream job.\n\nIf this is something that interests you?",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1162urw/interviewing_techniques_offered_as_an_ebook/",
      "comments": [
        {
          "body": "I just wanted to add a comment here as a coach/mentor for 10+ years and a project manager now… good on you for your interest and experience. One of the best things I’ve learned through experience is that “just because you did doesn’t mean they can (or will)” \n\nEveryone has different learning styles and strengths, backgrounds and areas of resistance.\n\nE books are also a little dates imo (I could be wrong) but perhaps a thread here, social posts or YT channel in digestible formats would be a good way to build community and share what you love. \n\nOnce you do, you may have enough clients or personalities to have worked with to develop more products down the road.\n\nBest of luck to you!!",
          "score": 1
        }
      ]
    }
  ]
}