{
  "company": "meta",
  "post_count": 73,
  "exported_at": "2026-01-18T17:44:53.288Z",
  "posts": [
    {
      "title": "Confused about what role to apply for and how to approach it",
      "body": "TLDR: Confused about what roles to apply for given my varied experience in marketing, seeking help and guidance regard the same Have worn multiple hats since work ex is majorly in early stage startups, so have imposter syndrome and am scared about starting the job hunt. Can’t stick to current job as I’m on deferred payment and financial situation at home isn’t very good.\n\nLong version: Hello fellow marketers, I am planning to move on from my current role, and want to understand the best possible way to land interviews. To summarize my career, I’ve over 6 years of experience spread across marketing , 2 years pre mba and 4 post, and I am currently working as a senior product marketing manager for an early stage startup. My worry is that I am kind of a jack of all trades when it comes to marketing. Started of as a campaign manager, then did sales and marketing for a startup, worked as a consultant where I was tasked with streamlining content for e-commerce websites, head of product marketing for a d2c startup, then ran a restaurant and now was as the product marketing lead for a startup. Since I have mostly worked across early stage startups, I have also taken care of ops, customer success, account management and sometimes even HR activities. I’m confused as to what roles I should I apply for now. I’m clear that I want to stick with marketing, but I see job roles asking for specific years in a particular domain eg: 4 years in product marketing. While I have done activities pertaining to product marketing across all these 6 years, I have held that title only for 1.5 years. And this is just an example. I feel that this disqualifies me when I’m compared with people who have worked as PMMs for 4 years So here’s my doubt: How should I choose what role to apply for next?  And how should I approach it? For context, I have worked on campaign management, lead generation, market research, competitive analysis, revenue generation, customer success, delivery ops, GTM strategy, run growth experiments, created sales materials, content generation and management across fb, LinkedIn, insta, managed influencer partnerships, have worked with Shopify, Amazon seller central, google AdWords and meta ( though to be honest not very high value campaigns) I don’t have anything to offer other than this tensed rant but I promise to help others here when my time comes :)",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1lss5hl/confused_about_what_role_to_apply_for_and_how_to/",
      "comments": []
    },
    {
      "title": "Got an offer from Meta - here are my tips",
      "body": "Landed a job at Meta earlier this year (got lucky with timing before the Feb 10 layoffs lol).\n\n**Job summary:**\n```\nPosition: Mid-Level Software Engineer L4\nTC: $350k (193 base, 29 bonus, 128 stock/year)\nYOE: 2.5 years\n```\n\n**The interview process:**\n* Phone screen: 2 leetcode problems in 45 mins\n* Final: 2 leetcode rounds (same format as phone screen) + 1 behavioral round + 1 system design round\n* Total Time: 5 hours\n\nFrom initial contact to offer signing took 2 months.\n\n**The framework that worked:**\n\nWith 2 problems in 45 minutes, you really only get 22 minutes per problem. Here is how I would break it down.\n\n1. **Understand the problem first (3 mins)** \\- restate it back, walk through examples, ask about constraints.\n2. **Don't code immediately (5 mins)** \\- discuss approaches starting with brute force, explain why it's bad, then work up to optimal solution. DO NOT IMPLEMENT THE BRUTE FORCE SOLUTION. You don't have time for that.\n3. **Get buy-in (10 mins)** \\- make sure interviewer agrees with your approach before coding. I write pseudocode comments first as an outline, then flesh it out. A common failure pattern is coding something that the interviewer doesn't understand.\n4. **Wrap up (2 mins)** \\- explain time/space complexity, offer to write tests for edge cases, or move on to the next problem.\n\n**How I prepared:**\n\n* Use Blind 75. It has good coverage over all problems.\n* I DID NOT buy leetcode premium. If you study and understand the patterns, it doesn't matter what problem you get.\n\nI know the market is ass right now and the competition is rough, but stay disciplined and the hard work will pay off! I was looking for a job for 9 months until I got this opportunity lmao. Ask me anything!\n\n**Soft Plug:**\n\nBuilding a [website](https://chenaaron3.github.io/drawcode/) to visualize code! Mainly targeted towards beginners.",
      "subreddit": "cscareerquestions",
      "score": 1139,
      "url": "https://reddit.com/r/cscareerquestions/comments/1l5apme/got_an_offer_from_meta_here_are_my_tips/",
      "comments": [
        {
          "body": "2yoe and 350k you’re joking lol",
          "score": 862
        },
        {
          "body": "How did you get 350k TC with 2 YOE. seems high for E4. did you negotiate?",
          "score": 50
        },
        {
          "body": "Study all you want, but they'll fail you for some bullshit. I failed because one interviewer specifically wanted me to code in C++. I didn't know C++, and I never claimed to know it. Once I told him that I didn't know C++, his demeanor changed and I knew I wasn't going to pass.",
          "score": 291
        },
        {
          "body": "I think there is a sweet spot in your career where you can take this on. At 2 years you probably don’t have a ton of responsibility and studying even during work isn’t out of the question. The higher up you get and the more responsibility you have it becomes hard to have the energy to take on another job (passing interviews) while you have a lot of eyes, reports, and money on you. \n\nMy advice is don’t try to get pushed up too soon. I have 7 years experience and now I’m an engineering manager not really by choice and it’s so hard to slack at all, yet I get paid half of that this individual does. \n\nTLDR: do what OP did and not what I did. \n\nCongrats on the offer and I’m super jealous.",
          "score": 169
        },
        {
          "body": "Share the questions asked my man",
          "score": 29
        },
        {
          "body": "OP was kind enough to spill the gist of the coding problems (thank you!)\n\nFor peeps, here are the corresponding Leetcode problems:\n\nQ1: [LC605 Can Place Flowers](https://leetcode.com/problems/can-place-flowers/description/). Careful, Meta may want you to optimize your solution to greedily skip indices where possible. My solution [Here](https://github.com/CodingWithMinmer/CodingWithMinmer/tree/main/605_can_place_flowers) if you're curious.\n\nQ2: [LC317 Shortest Distance from All Buildings](https://leetcode.com/problems/shortest-distance-from-all-buildings/description/). This is a rephrasing where it's houses, trees and wells.\n\nQ3: [LC88 Merge Sorted Array](https://leetcode.com/problems/merge-sorted-array/description/). OP got asked a variant to [merge 2 sorted arrays](https://youtu.be/NBGgDle-R6E?t=740) that can include duplicates. Btw, there's another variant where you must exclude duplicates.\n\nQ4: [LC236 Lowest Common Ancestor](https://leetcode.com/problems/lowest-common-ancestor-of-a-binary-tree/description/)\n\nQ5: [LC199 Binary Right Side View](https://leetcode.com/problems/binary-tree-right-side-view/description/). The common variant is to return both side views, left from bottom-up and then right from top-down.\n\nQ6: [LC987 Order of a Binary Tree. ](https://leetcode.com/problems/vertical-order-traversal-of-a-binary-tree/description/)",
          "score": 133
        }
      ]
    },
    {
      "title": "Laid off from Meta. At a loss at how to start prepping.",
      "body": "I was a SWE at Meta for \\~6 years. It was my first job out of college; I had assumed that it would be where I'd build a career until I was ready to try something new.\n\nNow I've been laid off. (Absolutely gutted.) My resume still has my college internships (&amp; non-ATS-compliant (??)). I've only used — or had to think about — internal tech tools for the past six years, so I don't know much about what you would use for system design outside the company.\n\nI'm at a loss for how to begin preparing for interviews or the job search ahead. Does anyone have any advice or a structured set of expectations for what interviewers expect you to be able to accomplish? I just don't know where to start.",
      "subreddit": "cscareerquestions",
      "score": 1296,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ira81o/laid_off_from_meta_at_a_loss_at_how_to_start/",
      "comments": [
        {
          "body": "6 years at meta, you have an in at basically any company and the funds to study for the next 6 months uninterrupted.",
          "score": 2138
        },
        {
          "body": "You have 5 years of experience at Meta in your resume, you will be fine.",
          "score": 770
        },
        {
          "body": "First, take a little time to process being laid off, it sucks. Next, accept that your first few interviews are going to be not great, you are out of practice which is fine. Having meta on your resume will impress a lot of people, have some stories about solving technical and people problems that you can use for behavioral interviews. Happy hunting.",
          "score": 747
        },
        {
          "body": "1. Yes, take a little time to process being laid off. Start updating your resume.  \n2. Get your financial house in order. Better to do before, but read the r/personalfinance wiki, set up your emergency funds, assume you might be out of work for a year but target less than that obviously. Set up your budget.  \n3.Add everyone you know on linkedin. That's your network--you magically see where everyone you know is working and can get referrals from those people eventually.   \n4. Read cracking the coding interview and DDIA. Set up time to practice coding interviews, system design interviews, and soft skill interviews with people.  \n5. Get feedback on your resume.  \n6. talk to people about and research how to talk to recruiters during negotiation.\n\n7. Arrange for referrals to companies that pay well (check levels.fyi) and that you are interested in.  \n8. interview. Most people fail most interviews most of the time and that's OK. Treat it as a chance to learn and you'll pass some of them.",
          "score": 100
        },
        {
          "body": "My 2cents on relating the internal tools to your resume and interviews - find their open source / industry equivalents and list those technologies. All that matters is communicating the same story of what you did internally to what people who aren’t familiar with the lingo will understand. \n\nIf you’ve worked on scalability problems, I’m sure that will be a huge boost to your story telling (and will help speed run your system design prep). \n\nMost importantly, take some time for yourself to debrief and process everything. Interviews are a mindset shift - you’ll be playing salesman more than engineer. I’ve been here twice and it blows. But I’ve always come out much stronger than before. You got this and best of luck.\n\nEdit: just saw someone posted a link of meta internal tools mapped to industry ones. Nice.",
          "score": 45
        },
        {
          "body": "https://github.com/greko6/xfb2xfb\n\nGood luck my friend.",
          "score": 166
        }
      ]
    },
    {
      "title": "Should I cancel my final rounds with Meta?",
      "body": "Senior software engineer with 9YOE.\n\nI got an offer for a fully remote role earlier this week. I negotiated with them with a higher base and told them that I'm in process with Meta (L5). With some back and forth, today they reached out and told me that they're willing to meet my asking base salary, which is higher than their cap for the role. I can tell that they want me and I also told them that I'm willing to stop my process with Meta if they can meet my requirements. They did, and now I'm wondering if I should cancel my final rounds with Meta next week. Regardless I will choose the fully remote role since even if I pass Meta, the 2-3 days hybrid in office requires me to uproot my family and relocate probably, and I do have a 18-month old toddler so work/life balance matters a lot to me now.\n\nSo for now, I'm thinking what's the point of doing the interviews if I'm not going to take the offer. Plus I've been preparing for this round for months, doing leetcode, system design everyday. I'm tired of all of this. If doing interviews, I think it's just for the sake of gaining experience. I don't want to waste everybody's time. The thing is I failed the final rounds with Meta in 2024, so if I fail this time it would be the 2nd fail attempt. But pulling before the final rounds might be better since I technically only failed once I guess. What do you think?",
      "subreddit": "cscareerquestions",
      "score": 509,
      "url": "https://reddit.com/r/cscareerquestions/comments/1pf4onp/should_i_cancel_my_final_rounds_with_meta/",
      "comments": [
        {
          "body": "Sign the papers with the first company but finish up your interview with Meta just in case.",
          "score": 1534
        },
        {
          "body": "Finish the interviews with meta, if you make it through all the rounds and they make you an offer you can still reject it and that will leave you in a much better position if you ever decide to give meta another chance.",
          "score": 344
        },
        {
          "body": "Finish the interview and start your job at the new place. You’re already prepped and you don’t know whether you’ll actually like your new job or whether they’ll do layoffs in a month and a half.",
          "score": 62
        },
        {
          "body": "Nah just finish the meta interview",
          "score": 229
        }
      ]
    },
    {
      "title": "Is anyone still grinding leetcoding?",
      "body": "Between the companies that primarily test leetcode skills not hiring much anymore, and AI being great at solving these types of questions, does grinding leetcode even make sense in 2025? I'm picturing interviews will look completely different in 5 years or so, when hiring picks back up, assuming it ever does.\n\nMost companies don't allow candidates to use AI in the interview, but this is stupid because your ability to use AI well will almost certainly be the primary development related skill going forward that companies will need. In fact, Meta is seems to be planning to let candidates use AI.",
      "subreddit": "cscareerquestions",
      "score": 500,
      "url": "https://reddit.com/r/cscareerquestions/comments/1mseszn/is_anyone_still_grinding_leetcoding/",
      "comments": [
        {
          "body": "&gt;Meta is seems to be planning to let candidates use AI.\n\nI commented on the original post I saw on this subreddit announcing Meta was doing this. I'll re-iterate it here...\n\n***Good fucking luck.***\n\nThink back to college. Do you remember what an open-book test was like? I do. Whenever it was announced an exam would be open book my stomach sank. It was an awful feeling. Because that let me know the test was going to be difficult enough to *warrant* it to be open book.\n\nInterviews are going to be the same way. If you're allowed to flippantly use AI? The interview is going to be difficult enough that it ***requires*** you to use AI. It's not going to be a leetcode question from 2024 that you can blow through because you have AI at your disposal. It's going to be a uniquely crafted question that's difficult enough that you *need* AI. Fuck that.\n\nSo yeah, if I were job hunting, I would be practicing leetcode. Hopefully I could line something up before the hellscape of AI-interviews takes hold, because ain't no way I'm gonna play that game.",
          "score": 955
        },
        {
          "body": "AI being great at solving Leetcode has literally nothing to do with interviewers using it as a filter. A filter is all the DSA interview is. They’re not asking you to find the sum of two number in a list adding up to k because it’s an everyday task.",
          "score": 45
        },
        {
          "body": "TL;DR: I don’t think leetcode problems are going away soon.\n\nRemember, leetcode problems have *never* reflected real sde work. It’s about creating a generic screening that acts as a rough heuristic for measuring problem solving abilities, the willingness to jump through the needed hoops, the ability to communicate, and intelligence. A good screen? Many say no and I certainly think it’s very imperfect but it solves a certain problem (hiring SDEs) at scale.",
          "score": 155
        },
        {
          "body": "I still grind leetcode after 9+ years of experience.\nAlthough it has less correlation with actual dev work, it helps to build and maintain conceptual thinking, working through various use cases , communication  etc. which is very much required in real job scenario.\n\n\nI'am not against memorizing algorithms but emphasis should be on understanding and critical thinking.",
          "score": 18
        }
      ]
    },
    {
      "title": "Completed Meta's E6 loop today - here are my thoughts",
      "body": "**Summary**\n\nI just completed Meta's E6 loop today and I want to share some thoughts about the process, the timeline, my preparation strategy and feelings about the future as I wait for the result.\n\n**Background**\n\nI have interviewed with Meta a couple times in the past for E5 roles and both times I voluntarily withdrew my application halfway through the onsite as I had decided to take up a different offer. I stayed in touch with the recruiter and they reached out to me recently asking if I was interested in a change and I decided to give it a try.\n\n**Process**\n\nWe scheduled a quick phone call to go over the process that looks like this at a high level:\n\n|Round|Format|Notes|\n|:-|:-|:-|\n|Phone Screen|45 minutes, 2 coding problems, some questions about your work ex etc.|It is my belief that beyond helping Meta decide if they should spend time interviewing me, it also helps decide the level I should continue interviewing for.|\n|System Design (2x)|45 minutes, 1 system design problem, few follow up questions on scaling, edge cases, CAP theorem tradeoffs etc.|I found these rounds to be the most intense and subsequently to carry the most weight, along with behavioral rounds, for E6 candidates.|\n|Behavioral|45 minutes with an M1 or higher manager. Lots of questions on work ex, collaboration, handling conflict etc.|I found the interviewer hard to read and perhaps that's by design. I found their questions pretty pointed. I could tell they were looking for specific signals and data points in and around my stories to verify those signals.|\n|Coding (2x)|45 minutes, 2 coding problems of 20 minutes each, 5 minutes in the end to ask questions to the interviewer.|They were all LC questions tagged under Meta. I proceeded as: share naive solution verbally, quickly move past it, write down parts of the better solution as code comments, get buy in, write actual code under the comments, check for edge cases and do a dry run and then proceed to optimize.|\n\n**Timeline**\n\nI had a great time managing the timeline for this loop. I really appreciated the level of flexibility Meta offers candidates. You get your own portal where you can track and manage your interview process with Meta. You can request reschedules (latest by an hour before the interview) and push interviews away as far as you need.\n\nI was most comfortable with system design and behavioral rounds so I took them first, pushed the coding rounds to the last.\n\nI made [this post](https://www.reddit.com/r/leetcode/comments/1daj469/meta_e6_prep/) soon after I completed my phone screen to collect some thoughts on how to proceed.\n\n**Preparation Strategy**\n\nI read both volumes of \"System Design Interview\" by Alex Xu and went through all problems at Hello Interview's [system design in a hurry](https://www.hellointerview.com/learn/system-design/in-a-hurry/introduction). Thanks u/yangshunz for your comment on my previous post!\n\nThis greatly helped with my system design prep; especially the \"what's expected at level X\" sections which helped me cut past the obvious ideas during my interview and get straight to the parts that give the most signal to my interviewers.\n\nI always go back to [this video](https://www.youtube.com/watch?v=PJKYqLP6MRE) by Jackson Gabbard as my foundation for preparing for behavioral interviews and this time was no different. I did not have the time to schedule mock interviews for this loop this time but I'm sure it could have only helped.\n\nFor the coding rounds I focused on FB top 100 with a special focus on FB top 50 and it's fair to say all 4 problems during the 2 coding rounds were from the top 50. It's worth approaching problems as problem families rather than individual problems as this approach helps with follow up questions\n\nE.g. if you were given, and you solved, a tree traversal question involving parent pointers, how would you solve the same problem without parent pointers but with the root node instead? (experienced leet coders will already know the two LC questions I'm talking about).\n\nI would also recommend this sequence of processing coding problems as it really helped me:\n\n1. Verbally explain the naive solution (e.g. to pick the Kth largest element, we could simply sort this array and pick the Kth element from the end) and why you wouldn't want to implement that.\n2. Write down your proposed solution as a multi-line code comment. If possible, outline possible edge cases or rooms for optimization right away.\n3. Write down the key steps of your algorithm as single line code comments and get buy-in.\n4. Write actual code by expanding the single line comments into actual code.\n5. Perform a dry-run and keep optimizing as much as the time allows.\n\n**Closing Thoughts**\n\nI had a great time preparing for and giving these interviews. I am optimistic about receiving a hire decision but not very sure about the leveling. But nothing is guaranteed until I get the news. Time to enjoy not having to grind LC and crack open a cold one.\n\n**UPDATE**\n\nI was told I passed the loop and will move forward to team matching.",
      "subreddit": "cscareerquestions",
      "score": 1383,
      "url": "https://reddit.com/r/cscareerquestions/comments/1e9k0kt/completed_metas_e6_loop_today_here_are_my_thoughts/",
      "comments": [
        {
          "body": "It's honestly fucking nuts.\n\nGetting into FAANG is a completely separate hobby and career in and of itself. It has its own lingo, education courses, skillets to develop. An entire economy and lifestyle propped up around it.\n\nLike, I get it, there's not much better of an alternative.\n\nBut it's wild lol",
          "score": 966
        },
        {
          "body": "Saving this post. Even if you aren’t interviewing for Meta, I think this is a very insightful post with regards to technical interviews in general.",
          "score": 151
        },
        {
          "body": "Your phone screen was 45 mins for 2 problems plus questions on your background?? Or are those notes on the 2x coding questions you had later? You had 2 system design interviews? That seems unusual as well.",
          "score": 104
        },
        {
          "body": "As a preschool student this is awesome. Thanks for putting all the work into this.",
          "score": 327
        },
        {
          "body": "Just FYI, Behavioral is not always a manager. I have done hundreds of behavioral interviews.\n\nThe video you linked is pretty good. I'd say that behavioral is often the *weakest* interview for most candidates and they have a hard time giving specific situations and, importantly, reflecting on what happened and how it fits into their overall growth. I wish candidates consistently used something like the STAR answer format for the behavioral interviews.",
          "score": 73
        },
        {
          "body": "Nice overview of the process and the prep!\n\nI did the E6 loop (and passed) when Meta was only hiring critical roles.\n\nAs you say, system design was the hardest of the whole thing. Studying DDIA really helped me a lot there, as well as watching some prep videos on Youtube.\n\nAlex Xu books were okay for practice problems and learning how to frame the design (albeit, his second book, while interesting, goes into too much detail - more than what is expected in these interviews).\n\nI also did one paid mock sys design interview the weekend prior which helped get me into the mindset.\n\nAnyways, good luck! Hope you hear from the recruiter soon.",
          "score": 24
        }
      ]
    },
    {
      "title": "AWS vs Bloomberg (Google + Meta finals) New Grad (advice)",
      "body": "Hi, I’m a CE senior graduating in May 26, based in NYC and was lucky enough to get 3 full time offers so far from previous internship at Warner Bros. Discovery (HBO Max) then Bloomberg, and now fall internship return offer from AWS.\n\nRight now:\n\n\\- I am signed with Bloomberg for full-time SWE (NYC) 191K cash (no stocks bc private)\n\n\\- I also have a return offer at AWS (going to be on SageMaker/BedRock which is pretty good space at AWS to be in bc doesnt get affected from lay offs in the present not sure if that would change) TC is 205k from what I heard (NYC)\n\n\\- I previously interned on SageMaker, so my background is more ML infra and I enjoy working on MLE problems so had lot of fun especially when I got to do some low level ML stuff. I had a great 3 months and got strong incline and got told I was the best intern they had and built good connections with the team i would return to, but I guess wlb is the big con\n\n\\- I reneged a Warner Bros. Discovery (HBO Max) (NYC) SWE return earlier for Bloomberg.\n\nUpcoming interviews:\n\n\\- Google SWE final (on site beginning of january): worried about team matching and timeline uncertainty I heard it takes forever.\n\n\\- Meta Production Engineering (PE) interviews in a week or so, not sure if PE aligns with my long term goals, so not sure if i should do the interviews\n\nI was able to get a sense of the bad Esh work life balance this fall at AWS, even though I had a great 3 months and was raised constantly for the work I was doing, it was a lot of work I owned a lot more than a “project” and seen the other full timers around me (was there during reinvent times which are known to be most stessful). I know it is better career growth and I would learn more than if I was at Bloomberg which is why I am considering it, but would love any advice from people at Bloomberg or know in general about the company. Sage maker is pretty secure no one gets affected from lay offs but thats just in the present, BB is known for way better security. Also should I still do the meta interviews which seems to be a long process and I am pretty happy with aws/bb or google if it happens. Also heard meta isnt the most secure. Thanks a lot in advance!",
      "subreddit": "cscareerquestions",
      "score": 149,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ptijt2/aws_vs_bloomberg_google_meta_finals_new_grad/",
      "comments": [
        {
          "body": "The answer is very rarely AWS.  Amazon's bad reputation isn't *entirely* deserved, and some orgs are better, but everything you've heard about bad WLB at AWS is true. \n\nThat said Meta PE is the truly terrible choice there. PEs there aren't SWEs, and the mobility to SWE roles isn't great.  You'll be stuck on-call forever, and Meta is closing in on 996 to begin with.  Between AWS *in general* and Meta, I'd say \"pick your poison\" but between MLE you're interested in and being a PE at Meta, that's the rare case of Amazon being the no-brainer.\n\nOf what you've got, I'd take Bloomberg, and consider backing out if Google comes through with something good.\n\nSource: I used to work at Facebook (pre-Meta), and still have a ton of friends there.  I have hired people out of Amazon/AWS.",
          "score": 138
        },
        {
          "body": "Off topic but dang good job getting these offers in this job market.",
          "score": 104
        },
        {
          "body": "Bloomberg or Google",
          "score": 137
        },
        {
          "body": "Bloomberg for WLB and time to spend on personal growth, enjoy NYC etc. Then you can jump as a mid level E4 or even E5 after 2-5 years. You don't need to struggle for promo and get advantage of getting the big vest upfront vs internal promo.",
          "score": 100
        },
        {
          "body": "Hi, former Amazon and Google.\n\nBloomberg and Google because they both invest heavily in their junior engineers.  Your first job teaches you basic skills that noone is going to spend time teaching you anywhere else.  It's very important you have a good first experience.  Bloomberg and Google both have strong reputations for investing in early engineers. If you don't like it they will also be the easiest to transfer from in 2 years.",
          "score": 86
        },
        {
          "body": "Amazon has cratered as a company you want to work for.  The turnover is unreal.",
          "score": 20
        },
        {
          "body": "Don’t do AWS. I work there. Interns are given fun and sometimes challenging projects. Usually helps with retention. If you work on the Bedrock team, I almost guarantee your oncall experience will be horrible and it will take you several years to get challenging work. I work in AI services and you don’t feel safe from layoffs, the pressure to deliver is constant, and it seems like someone always wants you to drop what you’re doing and respond to them. People don’t care if they impact your productivity, as long as, they get what they want. \n\nDon’t do PE if you don’t want to work on actual products. Not 100% aligned with SDE work. \n\nI would go to Bloomberg and wait for Google offer. Could be six months to a year anyways. Nobody will care if you worked there for that short and you don’t even need to put it on your resume.",
          "score": 12
        },
        {
          "body": "Accept Bloomberg, push out start date for one month. If Meta or Google actually come back reneg and take one of them IF THEY GIVE YOU OFFER + CONFIRMED START DATE. Otherwise its a bunch of magical maybes. Google is especially known for taking weeks to do the final steps",
          "score": 27
        }
      ]
    },
    {
      "title": "Thoughts and Lessons from a 22 Year Career in Tech",
      "body": "I've been a professional developer for over 22 years now and thought I'd share some of my experiences and knowledge learned over that time. Sorry it's long, but you can skip to the important bits at the bottom.\n\nFrom the time I was 6 years old and played my first video game (Missile Command) I knew I was going to be a programmer. I didn't set out to make money; writing code was the only thing that made sense to me. So I went to college for CS. \n\nI graduated right before Y2K and got a job for 42K and moved to Austin. I know this sounds ridiculous today, but it was *really* good money. I was an excellent CS student (3.7 GPA) from a very good engineering school, and I interview well. Among my CS friends only my roommate was making more (49K). After a year I got bumped up to 49K too because \"salaries were going crazy!\" and they didn't want me to jump ship.\n\nLife felt good! I liked the company, and my coworkers were my best friends. I had a lot of shit going on in my life (marriage, divorce, other peoples mental illnesses, death in the family, etc.) and the job was very stable. I didn't notice for a *loooong* time, but the work really sucked. I was doing desktop development in C (notice the lack of ++) on a legacy app that was started in 1986. Eventually I got my life in order and I realized that I'd already spent ***13 years*** at a job I actually hated but hadn't realized, because it was the only thing in my life that made sense. I was making 82K a year at this point and had been promoted twice (note: this is a very bad sign).\n\nI'd been playing around with JavaScript, writing little browser games, Greasemonkey extensions, etc., and I really liked it. I decided I should become a web developer. Deciding to do this is one thing; getting a job doing it is another. You can imagine how hard companies are fighting to hire experienced devs with zero professional experience for their entry level WebDev jobs. I studied and practiced and talked/interviewed with two dozen companies over a solid year. Finally I found a startup-ish company that was willing to give me an offer -- the interview had zero coding so I aced it! I'd been with my previous company for 14 years and again was making 82K a year. The new one offered me 85 (benefits were worse) and I negotiated to 90 (**ALWAYS NEGOTIATE**!).\n\nI walked into my new job at 8AM on day one and the dev room was empty. 30 minutes later another guy walked in. It was his first day too. An hour later our manager walked in. Turns out the other two developers had quit or been fired the previous Friday. Our manager was completely non-technical -- hence the zero coding interview. This sounds like a disaster, and it was, but it was also an amazing way to start. No senior devs to tell us not to do anything, so we did what we wanted, broke shit, fixed more shit and generally molded the tech stack the way we liked. After 3 years in that job I had been promoted to manager of the team, hired 8 devs and I was the big fish in a very small pond. I was making 120K.\n\nThat's when a big company expanding into the cloud space came knocking looking for experienced front-end devs. After some intense negotiations I jumped ship, and my TC hit 185K. Life actually was good. Now I was in a massive org with all the incumbent politics and nonsense that comes along with that. However, I was working with people much smarter than me (you never lose imposter syndrome folks) and had an amazing manager, and I actually felt pretty confident in the work I was doing for once. Our stock almost tripled over the next couple years and I got some good raises and my TC hit 235K. I got promoted to Staff engineer and expected the big money to finally come in. I got a 10K raise, but refreshers were piddling. I'd vested all my initial stock and my TC dipped back down to 220K.\n\nIn December I realized that while this company had been paying top of market when I started, the market had moved and they weren't near the top anymore. Corona and fully remote companies had changed the game and salaries were insane. I started interviewing in January with a mix of late stage unicorn startups and some bigger companies. I could get my foot in the door with anybody now (except Amazon who just rejected me outright without even a phone screen lol). Google and Meta were calling *me.* I could afford to be picky. I spent my nights and weekends in January doing some LC and more studying JS fundamentals. It sucked, but it was worth it (although I probably studied too much in the end).\n\nThis week I accepted an offer for 385K TC with a company that ticked all of the boxes for me (pay, WLB, low-stress, room to grow, some \"namebrand\" status) despite the fact that I got kinda down-leveled. For a tier-2 location (Austin), I'm at the very top of their pay scale which made up for that. For 22yoe this isn't amazing these days, but I only really have 8 years of relevant experience, so it still feels pretty good.\n\nLessons and things I wished I'd known from the beginning:\n\n* Don't stay somewhere out of loyalty or because you like your coworkers. You can still be friends with them.\n* Don't be afraid to switch career paths/specializations if you'll be happier or more interested in the work.\n* If you aren't getting promoted at least every 4 years something is wrong. Change yourself, your group, or your company.\n* Nobody values you more than the company that doesn't have you. Job hop if you want to make big bucks.\n* Everything is negotiable. Be a hardass in negotiations and never take the first offer, even if it's more than you expected. If you don't feel comfortable, pay a negotiating service like Levels to help you.\n* Everything you do in your free time can help your career, so never stop learning and playing around with new technology.\n* You're going to have a lot of setbacks, and fail *a lot* of interviews. Try not to get discouraged, learn from the experience and try again.\n* Most people are average. Half your co-workers probably think *you're* the guy who knows everything. Don't let imposter syndrome hold you back.",
      "subreddit": "cscareerquestions",
      "score": 1732,
      "url": "https://reddit.com/r/cscareerquestions/comments/t2tdrq/thoughts_and_lessons_from_a_22_year_career_in_tech/",
      "comments": [
        {
          "body": "One caveat is that if they topped your offer there won’t be any offer other than say vacation days. Say you asked 100-120 and they gave 130, probably best to not negotiate since that’s the intention.",
          "score": 186
        },
        {
          "body": "&gt;Most people are average. Half your co-workers probably think you're the guy who knows everything. Don't let imposter syndrome hold you back.\n\nThis. If there is any advice I could give for the sake of mental health it is this.",
          "score": 268
        },
        {
          "body": "“Right before Y2K I got a job for 42k and moved to Austin. I know this sounds ridiculous today, but it was good money.” Me in 2022 accepting an offer for 50k 👀",
          "score": 469
        },
        {
          "body": "[deleted]",
          "score": 44
        },
        {
          "body": "Haha what a ride man, glad you're satisifed with your current job and thanks for the tips!",
          "score": 21
        }
      ]
    },
    {
      "title": "Reading teamblind motivates me",
      "body": "Blind is a garbage cesspit but reading it motivates me. It. shows that you don't actually need to be smart to crack LC or get into Big Tech. I have seen mind numbingly stupid takes from people who work at Google,Meta, Snap, Uber, Pinterest, Two Sigma etc. If brain dead morons can crack LC and get into FAANG so can you.\n\nSo if you are struggling with LC just stick with it. I guarantee you it's not an intelligence thing. Several Meta employees have confirmed they basically just memorized the top tagged Meta LC list. These people are not high iq geniuses. If you need to memorize or do the same top tagged problems over and over then do so. Some companies , cough...Meta, expect you regurgitate answers anyways so don't feel guilty or shame with having to memorize answers for the most common LC hards asked in interviews.",
      "subreddit": "cscareerquestions",
      "score": 673,
      "url": "https://reddit.com/r/cscareerquestions/comments/1cs6qhf/reading_teamblind_motivates_me/",
      "comments": [
        {
          "body": "I work at Meta and I memorized the top tagged Meta questions. How else does one do two LC hards in 40 minutes?\n\nIt’s a stupid system but the ROI on studying for it is huge.",
          "score": 545
        },
        {
          "body": "First off, you have to realize that people like to just troll on blind because of the anonymity. It's basically if 4chan and linkedin had a baby.\n\nSecond, yeah Meta is known for asking the same top list. The thing is though, they aren't really looking for brilliant engineers. Sure they'll take them if they can get them, but what they really want is engineers who are willing to put in hard work. If you put in months of effort on your own learning questions, you're the type of engineer they want. Keep in mind it's not a small list either; the last 6 months tagged questions for Meta on leetcode is over 300 questions long",
          "score": 205
        },
        {
          "body": "Watching the upper levels at orgs I've been to just convinces me anyone can do it, despite what the job market says",
          "score": 63
        },
        {
          "body": "I like all the posts with guys panicking that they got laid off or got rejected for H1B, but they just bought a Tesla. I swear there's one a day.",
          "score": 17
        }
      ]
    },
    {
      "title": "Does anyone here work for chewy?",
      "body": "Chewy is my dream company. I know its not the most typical dream company for cs folks, but it is mine. \n\nI've applied to every single Software Engineer I position at chewy in the last year but no luck. (Since i was a fresh new grad to now I have 1 YOE).\n\nWithin the last year, I've had interviews for meta, google, some startups and etc. Only bringing that up to point out that I don't think my resume is a blocker (Top CS school, good internships...)\n\nI've tried cold msging recruiters, have sent cold invitations to chewy swe on linkedin but still no luck.\n\nSo my question is - how did you get into chewy? did you have a referral? intern-ft transition? hows the culture? do you enjoy working at chewy?\n\nNot sure if anyone remembers that one post where the ex-meta OP was complaining working for a dog food company, how depressed he is. They never confirmed whether the company was chewy or not but regardless, that post got me kept thinking how everything is so relative lol",
      "subreddit": "cscareerquestions",
      "score": 270,
      "url": "https://reddit.com/r/cscareerquestions/comments/1luamwe/does_anyone_here_work_for_chewy/",
      "comments": [
        {
          "body": "I can't speak to Chewy but I can speak to working at your \"dream company.\" I finally accomplished that for myself a couple years back. It's the worst job I've ever had. I guess what I'm saying is sometimes we get into these mindsets where there's one truly great company/school/etc for us out there but the reality can be quite different",
          "score": 438
        },
        {
          "body": "I have to ask, why? I know a lot of people at chewy and none of them have good things to say about it. It's all ex amazon leadership and that's how they run it.",
          "score": 269
        },
        {
          "body": "I interviewed with them and just got the dumbest questions. Typical full stack resume.",
          "score": 46
        },
        {
          "body": "[deleted]",
          "score": 37
        },
        {
          "body": "Username checks out",
          "score": 21
        },
        {
          "body": "I had an interview with them a month or two ago, and the woman seemed very disinterested and rejected me at the end because they wanted someone with more Java experience (for an entry level position btw).  So I guess tell them you have a lot of experience with whatever technologies are on the job listing",
          "score": 19
        }
      ]
    },
    {
      "title": "I did everything they asked me and more and still got rejected rant.",
      "body": "I used every available waking moment to study Leetcode for my tech screen with Meta while working full time. Solved 200 questions, 10 mock interviews, 5 coaching sessions from FAANG mentor. For the tech screen interview I solved both questions optimally without hints with time to spare.\n\nI hit all my marks, clarifying questions, constraint questions, coming up with my own edge cases, walking through the solution and confirming with the interviewer before starting, discussing complexity and tradeoffs. I wasn't a dick, multiple mock interviewers mentioned coding speed was my problem and communication was great. So I spent time fixing my speed. Against all odds I felt like I pulled it off. I did everything that I was ever told to do. In the interviewer's own words (unprompted) I did really well.\n\nThen wtf gives? It felt like a gut punch. I obviously did something the interviewer saw as not passable. But if my performance was not a pass I honestly don't know what they want. I'm so mad right now.",
      "subreddit": "cscareerquestions",
      "score": 327,
      "url": "https://reddit.com/r/cscareerquestions/comments/1kgzu50/i_did_everything_they_asked_me_and_more_and_still/",
      "comments": [
        {
          "body": "You are competing against dozens of other candidates who are as good as or better than you are. Even if you give a great interview, it’s a crap shoot.\n\nAll that prep you did is still very valuable for other interviews.",
          "score": 409
        },
        {
          "body": "&gt;I obviously did something the interviewer saw as not passable\n\nNot necessarily.\n\nIf there's 2 nearly identical candidates that both did everything right, they've gotta pick one. This time it wasn't you. Next time it might be, and we'll get this same reddit post from the person *you* beat out.\n\nA big part of the job search is timing and luck.\n\nThe good thing is you made it to the final rounds at all. That means you're doing everything right. Now it's a matter of repetition until timing/luck swings in your direction. The job search has always been this way, even in good markets.",
          "score": 165
        },
        {
          "body": "An interview is not a pass fail situation like a test. It's more like a date. You don't get the job if you pass. Lots of people will pass. You get the job if you're someone the interviewers preferred.",
          "score": 145
        },
        {
          "body": "\"Then wtf gives? It felt like a gut punch. I obviously did something the interviewer saw as not passable.\"\n\nThis IS your mistake. You need to understand you want to be part of a team of \"human beings\". and human beings are NOT logical for the most part. We make our decisions based on emotion because it is much more energy efficient.\n\nYou aced the interview? so as 10 other candidates. \n\nWhich one of you gets to be picked? the one the team \"likes\" the most. This is not logical. This is pure emotion animalistic instinct. \n\nSo relax :-). nothing wrong with you.",
          "score": 26
        },
        {
          "body": "The interview dilemma. The more you study/prepare, the more painful rejection is. However, if you don’t study/prepare enough you may not give it your best. It’s a fine line.\n\nThe prep you did is valuable, but honestly, the interviews I take less seriously tend to be my best. Don’t put so much pressure on yourself for one interview. Rarely have I found it works out well.",
          "score": 19
        }
      ]
    },
    {
      "title": "Desperate for work",
      "body": "Well I’ve been unemployed for 10 months… I thought I would have something by now. I’ve had so many close calls it’s driving me insane.\n\nI interviewed at Meta and got to the final round but was ultimately rejected. All good. I also interviewed at a few other places with high hopes… no job offer. So in the meantime I started my own company and launched two products. Didn’t find much success but learned a lot of lessons that I could make use of if I just had some income to support it.\n\nBut recently I WAS offered a job with the Government paying very well! It was perfect. I just needed a security clearance. No big deal right? Wrong. I was denied for smoking in a legal state months ago…\n\nMy employer said this never happens and that the government is just denying everyone right now for this government agency because they have no funding and aren’t promised any until next year.\n\nI’m at my breaking point and I’m drowning in debt.\n\nI unfortunately can’t code money so what the hell do I do at this point? Is there a quicker way to get hired with 8 YoE as a data engineer? Cause I feel like I’m going insane and it’s hopeless. Just had another job come up that was perfect but they can’t hire remote from my state? Weird I know… but I said I would love to move for this position! They rejected me anyways…\n\nWHAT THE F***???\n\nWay is it so hard and why is there no work even in a middle zone I can do?\n\nPlease help. Any resources or really connections with hiring companies that want to move quickly are welcome. I really need a job. I can barely find anyone hiring for part time right now it’s insane.\n\nEdit: adding my LinkedIn for reference.\nhttps://www.linkedin.com/in/noahgaryio\n\nEDIT: I applied to some jobs today and I miiiight have a full time position at Best Buy. I worked there before and they’re hiring. I got some FaceTime with the manager when I dropped my resume off. Thank you all for your help and advice. Still looking for a job in my field but at the very least this position could keep me from losing my house.",
      "subreddit": "cscareerquestions",
      "score": 318,
      "url": "https://reddit.com/r/cscareerquestions/comments/1fsp5o7/desperate_for_work/",
      "comments": [
        {
          "body": "Imagine having to pay for a mortgage and a family during this long span of unemployment. Jesus Christ.",
          "score": 194
        },
        {
          "body": "Take any job you can get; it’s better than having no income. You can still keep applying for data engineer positions while working at Wendy’s.",
          "score": 279
        },
        {
          "body": "Apple Genius Bar",
          "score": 44
        },
        {
          "body": "Rough times and you're not in a tech location unfortunately.",
          "score": 23
        }
      ]
    },
    {
      "title": "Sharing my latest job search experience and tips as a mid-level engineer",
      "body": "\nlocation: SF Bay Area  \nbackground: I'm a foreign immigrant in the US on a visa, I have Bachelor's in CS from one of the top CS university in my country  \nYoE: 3.5  \nold TC: ~210  \nnew TC: ~310  \n\napplications sent: 118  \nHR phone chats: 105  \ntechnical phone interviews: 55  \nonsites attended: 24  \noffers received: 8  \n\nkey points that may differ from your experience:\n  \n* I casted my net only to San Francisco Bay Area, New York City and Seattle region\n* I only intended to accept from companies who can offer at least 250+, this somewhat limits my choices but is a luxury that I can afford given the sheer number of interviews  \n* I had a hard requirement that the company must be able to provide US immigration support\n\nsome of the notable companies that I interviewed with in no particular orders: all 5 FAANGs (Google Microsoft Amazon Apple Facebook) \nQualtrics Coinbase Datadog VMWare Uber Doordash Salesforce Stripe Robinhood LinkedIn Twilio Two Sigma Bloomberg Zoom Confluent Blend Expedia Tesla Nvidia\n  \n\ngeneral observations:\n  \n* NETWORK NETWORK NETWORK!!!! my application:phone calls is a bit misleading because I would estimate perhaps nearly half of my HR phone chats were the results of internal referrals \n- the market is on fire, however the hiring bar and the expectation is also extremely high  \n- not a single company wanted me to do a take-home which was a pleasant surprise, I was actually fully prepared to immediately withdraw my candidacy at any mention of 'take-home projects'\n- for onsites, I feel that the companies in NYC and Seattle definitely have a lower hiring bar than SF ones, with couple notable exception like Two Sigma  \n- I wanted to avoid burnouts but it was extremely difficult to schedule so many onsites, hence it was not uncommon split an onsite over 2 or even 3 different days by breaking it apart, recruiters were all very understanding of this\n  \nI would break the process and preparations into 4 major parts: resume, interview prepation, onsites, offer negotiation\n  \nresume: I interviewed over the past several months, but I actually kept a running record of my major accomplishments from my previous performance evaluations, so when I decided to job-search I was able to update my resume within a single day, I took a slightly-selective shotgun approach: there's enough companies in the 3 regions who can meet my requirement but I'm not going to apply to every mom and pop's shop\n  \ninterview prep: leetcode leetcode leetcode, love it or hate it, shut up and leetcode, practice until you're comfortable solving any LC-medium within 30min then you're probably good for 80%+ of the interviews, unfortunately, sometimes interviewers \ndoes ask LC-hard during tech screen and onsites that's where the rest 20% comes from, but I think if you could solve LC-medium you should have a fair chance solving LC-hard with hints from interviewers\n  \nnotable exception to this was Facebook(Meta): during my FB interview the expectation was 2x LC-medium within 45min, with such a short time you basically have to come up with the optimal algo within 5-10min else it's reject because you still have to \nbudget time to physically type out the code\n\nonsites: this is where the real game happens, couple tips here:  \n\n* my onsite:offer is also a bit misleading, I deliberately scheduled the companies who ranks lower on my priority list first, so rejections early on won't demoralize me too much because I know the companies that I care about is still yet to come,\n  I think early on I failed about 8-10 onsites in a row before I started seeing offers, and when offers come in they come in FAST. For example towards the end I was waiting on 3 companies, and within 4 days all 3 replied with offer\n  \n* get a good nights sleep! I'd rather have a 9h sleep while only practiced 1 LC question, than have a 4h sleep while having practiced 4 LC questions  \n* ask the recruiter to schedule the onsites with at least a 15min break in-between (this can be ignored if the entire onsite is split over several days), there's 2 reasons to this: #1 you need a break, #2 I had multiple instances during onsites where I sensed the interviewer really liked me and really wanted to pass me hence the interview may run a bit overtime, it would really suck to say \"oops we have to drop off, the next interviewer is here\" and receive a 'no-hire' when you could had gotten a 'hire'\n\n* MOST OF YOUR TIME SHOULD BE SPENT TALKING and designing: coding is the easiest/fastest part, in a 45min algo round perhaps 30-35min is spent just trying to talk out what the optimal algorithm may look like, \n  what data structures to use, make sure to run a couple test cases on your own because noticing bugs after the interviewer points them out to you is going to hurt you a lot\n* RUN YOUR EDGE CASES, even just say them out loud is probably sufficient, but if you forgot edge cases, no matter how trivial, it's going to hurt you in feedbacks\n* for trivial functions, just ask the interviewer if they'd like you to actually implement it or is it okay to skip it. For example: function to tokenize a string by space, the class definition for a Node in a tree, for a Node in a graph, there's a high chance that\n  the interviewer will just say \"meh it's ok just skip it\" or \"meh you can assume such structure already exists\", saving you lots of time and stress\n* for system design there's way too much information, I used this guide https://github.com/donnemartin/system-design-primer\n  \noffer negotiation: congrats the company would like to move forward with an offer! excited? yes! but don't get TOO excited until you hop on the phone and hear the verbal offer, there were 2 companies that I straight up rejected because it was \neither a clear mis-leveling/down-level to L3 payband\n  \n* COMMUNICATE! early on it's normal to feel hopeless because you're failing onsites after onsites but once you have the official written offer that's when everything changes: the first time I receive a written official offer letter, I will communicate that with ALL companies\n - for the ones that I know there's 0 chance I'd sign with them anyway, I would email the HR, thanking them for their time, and withdraw my candidacy\n - for everyone else I will blast out an email, telling the HR very very clearly that #1 I have an official offer pending, #2 the official offer expiry date, #3 expedite the process (if I haven't done the onsite yet) or ask for onsite update (if I've already done onsite)\n  \n* HAVE LEVERAGE/COMPETE OFFERS! I had multiple written competing offers on my hand before I decided to sign\n  \n* KNOW YOUR WORTH! since I was targeting L4 level I already knew roughly what's the low, mid, upper range for all the companies that I have offers with, levels.fyi was very helpful here\n\n  \n* help the recruiter help you, every counter is an implicit rejection of their original offer, but remember that every recruiter (internal or external) is somewhat on your side because their ultimate goal is to get you to sign, so if you want $X you'd better have good reasons: give the recruiter ammo to help them fight the compensation committee for you\n\nI gave my recruiter 3 ammo  \n\n- I have multiple written competing offers on my hand right now  \n\n- I am in active talks with multiple very well-established companies and several unicorns, strongly hinting I may have more official written offers to come  \n\n- if they could approve $X, I will reject everyone else and sign immediately",
      "subreddit": "cscareerquestions",
      "score": 762,
      "url": "https://reddit.com/r/cscareerquestions/comments/qyen8r/sharing_my_latest_job_search_experience_and_tips/",
      "comments": [
        {
          "body": "Well that is an insane amount of on-sites wow. Well you certainly earned those offers.",
          "score": 255
        },
        {
          "body": "What was your method for getting so many internal referrals? Are these friends/past coworkers or did you find these people from somewhere on the internet like LinkedIn or Blind?",
          "score": 56
        },
        {
          "body": "&gt; MOST OF YOUR TIME SHOULD BE SPENT TALKING and designing: coding is the easiest/fastest part, in a 45min algo round perhaps 30-35min is spent just trying to talk out what the optimal algorithm may look like\n\nThis would fail roughly 75% of the algorithm questions I've been asked in interviews",
          "score": 51
        },
        {
          "body": "24 onsites is insane lol, even if its over several months. gotta assume you couldn't have used PTO for most of those, did your manager/team not notice anything?",
          "score": 102
        },
        {
          "body": "I dont make quite as much as you but I  only did 2 interviews the last time I was looking for a job. I only interviewed at places I actually wanted to work. This is enlightening for me. I didn't quite realize people put so much effort into interviewing to hit a certain TC number. I sort of assumed the people who were doing large numbers of interviews were people just getting into the industry. In my last 2 job searches I just chose the companies I wanted to work for and got hired.",
          "score": 71
        },
        {
          "body": "Congrats on the haul and the new TC but I gotta ask: why did you do so many? You can clearly get interviews, onsites, and offers. Competing offers is great but surely you didn't need 8? Just seems like a ton of work doing so many interviews when by your stats you clearly could've gotten a job with far fewer.",
          "score": 25
        }
      ]
    },
    {
      "title": "Meta E4 interview prep",
      "body": "I have an upcoming E4 interview with Meta. If anyone’s interested in joining for prep sessions, we can connect and do mock interviews together.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1o6t5t7/meta_e4_interview_prep/",
      "comments": []
    },
    {
      "title": "Why is big tech more concerned with l**tcode than others?",
      "body": "I have spent the last 6 months or so talking almost exclusively to startups. At almost every technical interview, I was told something along the lines of \"we're not interested in how well you can leetcode, so our tech screen is going to be something closer to what you'll be expected to do on the job\". \n\nI talked to a Meta recruiter earlier today, and he straight up said \"all of our technical interviews are going to basically be leetcode challenges\". I wonder why the stark difference?\n\nPerhaps big tech feels they have the resources to train someone in how they actually do things on the job, and only care that you have the fundamentals?",
      "subreddit": "cscareerquestions",
      "score": 718,
      "url": "https://reddit.com/r/cscareerquestions/comments/18jcrge/why_is_big_tech_more_concerned_with_ltcode_than/",
      "comments": [
        {
          "body": "Pretty much yeah, startups want people who can hit the ground running. They need to put out a product as quickly as possible and they don't have the time/money to wait several months for a new hire to learn a new area before they become productive.\n\nAt big tech it's the opposite, they assume that as long as you have fundamental engineering skills you can learn whatever is necessary for the job, and they can afford to wait. Also, many big tech companies have very customized internal tools and frameworks, so outside knowledge of a particular tech stack provides only minor benefit.",
          "score": 937
        },
        {
          "body": "I think it’s the other way around- LeetCode grew around Big Tech’s interview process. Asking questions about libraries, frameworks or tools doesn’t make sense at Google, FB, et. al., since everything they use is internal/bespoke, so all that’s left is general algorithm and system design questions. Those companies need good engineers that are strong on fundamentals, who can pick up stuff that they likely would never see outside. Over time, a kind of mythos built up around Google’s interview process, and other companies began cargo-culting it. This, in turn, along with the desire to land jobs at Big Tech, led to a market for interview prep services like LeetCode.",
          "score": 315
        },
        {
          "body": "Startups also get waaaaayyyy less applicants. Big tech can’t afford to not screen out people in boat loads and leetcode is good at that.",
          "score": 76
        },
        {
          "body": "At a startup or small company you may only have two or three good candidates for a job opening. The same group of people will interview all the candidates, then discuss and make a recommendation on who to hire. \n\nAt big tech you will likely have dozens, maybe even hundreds, of good candidates for each job opening. They need a way to filter those candidates, and they need it to be standardized (at least in theory) so that they can compare results across different interviewers. They also aren't worried about missing out on a good candidate because they'll just pick from one of the other good candidates waiting in line. \n\nAnd if we're being honest, at this point they've been doing leetcode long enough that there's probably some element of hazing involved.",
          "score": 36
        },
        {
          "body": "- It is cheap, fast, and an easy way to evaluate a candidate.\n- Companies are fine with false negative, but are NOT fine with false positive. The former costs none, while the latter costs a lot.",
          "score": 29
        }
      ]
    },
    {
      "title": "Still job hunting after 48 months, 9yoe - starting to feel 'discouraged'",
      "body": "I have 9 years of experience in web and mobile development. While I don’t consider myself exceptionally talented or a natural engineer, I have worked hard to build myself. I am self-taught and have a degree in a different field. Back in my home country, I supported myself through a combination of remote freelance and full-time positions, focusing mainly on UI development with HTML, CSS, JavaScript, React, and Angular.\n\nJust before moving to Canada, I decided to transition to iOS development. I quit my last real job (4 years ago) and jumped into learning mobile development. The pandemic provided plenty of time to study, and I completed several online courses, the most significant being the iOS Developer certificate from Meta, which took six months. I built some projects and spent two years at a startup designing, developing, and launching a social media app. Then I built more projects, and still doing it.\n\nSince moving to Canada, I have struggled to secure any tech interviews for both web and mobile positions. Initial screening calls often ended with feedback that companies were seeking 'someone more experienced'. I couldn’t land any freelance gigs either, despite competing for low-rate projects. I never imagined that years of hard work and real experience would count for next to nothing in the job market. It's disheartening to think that I haven't earned a single dollar for the last 4 years after nearly a decade in tech.\n\nThis situation is astounding for people like me. I never aspired to be a prodigy who solves complex algorithms on breakfast, but it seems that’s what companies are looking for. I don’t need a $200k salary; I just want an opportunity to secure a tech job for any salary that is close to market average. Now it's more about having stuck in a dead-end after years of trying to solve this huge problem. Looks like I tried everything - applied more than thousand times worldwide, including WITCH companies, including Senior, Mid, Jr. and internship positions, completed expensive courses, finished local bootcamp, applied to startups, got into an unpaid startup for 2 long years and justified it as a good experience, created my own big project which is a cross-platform app and spent 2 more years on making it perfect, churned LC. The worst part is that I see all this as wrong decisions. It all seem to me like a big fucking mistake and waste of time. Any decision that I do in this environment ends up as a wrong decision. So I don't know what to do anymore. Maybe someone could help me understand how this shit works.\n\n  \nFor anyone interested in my resume: [https://i.imgur.com/RJ9wWOq.png](https://i.imgur.com/RJ9wWOq.png)",
      "subreddit": "cscareerquestions",
      "score": 379,
      "url": "https://reddit.com/r/cscareerquestions/comments/1dvh53i/still_job_hunting_after_48_months_9yoe_starting/",
      "comments": [
        {
          "body": "Looking at OP post history their YOE claim is very questionable.\n\nHere they are saying they did no paid work since moving 4 years ago. Elsewhere they said they had 6 YOE when they moved.\n\nSo if they are counting all this time they've spent in Canada doing no/unpaid work as experience who knows what they are counting for the other 6 years.",
          "score": 149
        },
        {
          "body": "&gt; I have 9 years of experience in web and mobile development\n\n&gt; I quit my last real job (4 years ago) and jumped into learning mobile development.\n\nThis two statements seem conflicting.\n\nI'm not surprised that you have an issue in this job market with a 4 year gap, but I have no clue what happened 4 years ago. 4 years ago was one of the best job markets that ever existed for tech, and people were falling into jobs.\n\nAnyways I don't think anyone can give real advice based on this post. Maybe share your resume, and do a mock interview, but at this point I would expect things to be hard.",
          "score": 518
        },
        {
          "body": "I took a look your post history. Some of the things you wrote:\n\n * \"can’t even get through screening calls\" \n * \"Can’t solve LC problems\"\n * \"I'm not an experienced developer. Yes, I have 9 years of 1 year of experience. I've got some skills, but I have never worked in a real professional environment of a 'serious' scale and teamwork\"\n * \"It’s not normal when waiters won’t leave me fucking alone and to avoid them I always have to order food to go and eat somewhere outside.\"\n\nSo many red flags and very little self awareness. You come off as strangely entitled despite your circumstances. I'm pretty sure it doesn't take a recruiter more than a few minutes to rule you out. Your resume is already very weak, I would think it's AI generated from all the word salad. Also, if you lost your job at 6 YOE, been out of a proper job for 4 years, you don't become 9 YOE (10 in some of your posts). Nobody will care about certificates. Nobody will care about free labour, even worse, it tells employers that your work was not valuable enough to pay for.\n\nMy advice: stop doomposting, go to therapy, hire a coach to get proper, personalized advice, get your shit together, and then get a job.",
          "score": 133
        },
        {
          "body": "Echoing most of what has already been said here\n\nCanadian market likes degrees in a related field\n\nFreelance work can be frowned upon, especially the likes of Upwork etc.\n\nSuch a significant gap in work history is a red flag, especially coming out of covid when the market was booming.\n\nYes, you're now having trouble finding freelance work because the market has shifted, and a lot of what you do has been offshored to cheap 3rd world freelancers.\n\nTips. \n\nEnsure your github is up to date with *quality*, finished projects.\n\nMake sure your resume clearly targets the type of work your looking for. Mixing and mashing ios with engineering or anything else will not present well.\n\nLook to apply to MSP or consulting companies,  while many offshore there are some that will still keep a presence in CAN/US.\n\n-Tech Recruiter",
          "score": 30
        },
        {
          "body": "[deleted]",
          "score": 136
        },
        {
          "body": "I saw your edit and you posted your resume. Frankly, with someone with 9 YOE, your resume is pretty bad.\n\n&gt;\"Developed a wide range of custom components\".\n\n&gt;\"Developed an app focusing on simplicity and functionality\"\n\nYour entire resume needs to be redone. It doesn't really communicate anything of value. If this is what you're sending out, then you're making your job hunt harder on yourself especially right now with how competitive the market is.",
          "score": 21
        },
        {
          "body": "48 months ago was the start of the strongest job market in history of the tech industry. If you continuously looked for work for two years starting in July 2020 and couldn't land anything, unfortunately that means you are an extremely weak candidate. You should either drastically change something (get a degree, move to the US, etc.) or look at another field.",
          "score": 32
        }
      ]
    },
    {
      "title": "Has preparing for GAYMAN companies changed? Is it still DS&amp;A/systems/behavioral?",
      "body": "To get an offer for meta, I prepared by grinding leetcode. I was laid off a few years ago, been working regular companies since. I plan on asking my old colleagues for a referral, has anything changed in the last few years or with the new age of AI? Is leetcode style interviews still the norm?",
      "subreddit": "cscareerquestions",
      "score": 334,
      "url": "https://reddit.com/r/cscareerquestions/comments/1oqcnsh/has_preparing_for_gayman_companies_changed_is_it/",
      "comments": [
        {
          "body": "...sorry, what's the Y?",
          "score": 187
        },
        {
          "body": "The last round was showtunes and I got dqd for a flat note ",
          "score": 147
        },
        {
          "body": "Guess I'm gay",
          "score": 35
        },
        {
          "body": "[deleted]",
          "score": 220
        }
      ]
    },
    {
      "title": "Meta Referral - Told Applicant Won’t Be Considered in the future. What did he do?",
      "body": "I work at Meta and have referred people for all sorts of roles without issue. Recently I referred a friend (more like friend of a friends husband). \n\nI’ve never had an issue and have seen several referrals hired, but this time the recruiter reached out to me and said he won’t be considered for any future positions. Pretty much a blacklisted. \n\nI figure it wasn’t technical because I’ve referred and had people not pass the code assessment, so I figure it might’ve been more social. \n\nAny ideas what might’ve happened? Haven’t told his wife that they told me he’d be ineligible for anything going forward. He seemed like a normal competent guy the few times I’ve met him.",
      "subreddit": "cscareerquestions",
      "score": 702,
      "url": "https://reddit.com/r/cscareerquestions/comments/xatcda/meta_referral_told_applicant_wont_be_considered/",
      "comments": [
        {
          "body": "Probably got caught cheating during interview, else he said something completely inappropriate.",
          "score": 1151
        },
        {
          "body": "That dude must have fucked up hard. Like real hard.\n\nLike Cheating/racism/sexism/huge assholeness hard",
          "score": 496
        },
        {
          "body": "[deleted]",
          "score": 416
        },
        {
          "body": "[deleted]",
          "score": 118
        },
        {
          "body": "[removed]",
          "score": 513
        }
      ]
    },
    {
      "title": "I failed twice at Google, once at Amazon and once at Meta (Seeking for advice)",
      "body": "About 4 years ago, fresh out of my CS degree, I interviewed at Amazon and Meta. I had no clue about LeetCode or how to properly prepare for interviews. Naturally, I failed: no DSA prep, no interview preparation.\n\nSince then, I’ve worked at a Fortune 500 company and a well-known startup that _used to be_ a unicorn. These roles helped me grow, but I still had a long way to go in interview prep.\n\nA Google recruiter reached out during that time. I made it to the Hiring Committee for an SDE II role but failed my DSA skills weren’t up to par. A year later (I got referred, so didn’t have to wait), I interviewed again for an SDE III/IV role. This time, I didn’t even make it past the first round. Same issue.\n\nI've solved 250+ LeetCode problems, and I’m ranked in the top 40% in contests. Still, technical interviews remain a big challenge for me.\n\nDo I see myself as a failure? Absolutely not. I just know interviews aren't my strength.\n\n**What I’m looking for:**  \nAdvice on how to grow as a software engineer, increase my income, and continue progressing without needing to become a LeetCode master.  \n\nCurrently I'm a mid software engineer and very appreciated at my company, but very difficult to promote due to politics. \n\nAre there alternative paths that don't revolve around grinding DSA?",
      "subreddit": "cscareerquestions",
      "score": 427,
      "url": "https://reddit.com/r/cscareerquestions/comments/1k68uth/i_failed_twice_at_google_once_at_amazon_and_once/",
      "comments": [
        {
          "body": "This is my area of expertise - FAANG interviewing (DS&amp;A, SD, behavioral specifically). Also disclosure that my company has fairly expensive coaching, mentorship, practice etc... for these interviews **BUT** I'm giving this answer with my personal hat on and not suggesting that.\n\nThe most common issue I see is people practicing LeetCode alone by themselves and fiddling with problems until the tests pass.\n\nIt can feel like the interviews are a game to beat, but DS&amp;A is really about testing your problem solving process and communication of that process.\n\nSo some advice is to:\n\n1. Follow a consistent problem solving process (you can google around).\n\n2. Practice speaking out load through that process when you practice.\n\n3. Don't underestimate easy and medium problems, don't skip too far ahead to hard ones.",
          "score": 354
        },
        {
          "body": "What actually goes wrong with your technical interviews? They're a skill like anything else.\n\nHave you ever had a mock interview? Do you know what your feedback is?",
          "score": 58
        }
      ]
    },
    {
      "title": "Got laid off last year for the first time in 12 years. Experienced the worst job search of my career. Here's the Sankey.",
      "body": "[2024 Job Search Sankey](https://i.redd.it/wwa5kzx1nz7g1.png)\n\n\n\n[Here’s my previous post](https://old.reddit.com/r/ExperiencedDevs/comments/rqpfir/the\\_result\\_of\\_my\\_passive\\_job\\_search\\_over\\_the\\_past/) where I got the job I was laid off from. I was there for two and a half years and I hadn’t interviewed at all during that time.\n\n  \n\n\nIt took me four months to get an offer and I managed to get two of them in the same week. One was from an early seed stage startup and the other was Meta. I accepted Meta for more immediate TC and stability, but then I got laid off again just before hitting my year mark. I just finished interviewing again and this time the results are much better. Waiting for the last potential offer/rejection to come in before I post that Sankey.\n\n  \n\n\nOverall the system design interviews were my biggest weakness again like in my previous search. Hellointerview helped a lot with that and I ended up paying for two mock interview sessions with them. Those are painful but worth it.\n\n  \n\n\nBesides system design interviews, though, I got rejected a lot in the initial round for not having enough depth in particular tools. I’ve been working in developer tools and infrastructure for most of my career and a lot of places I was applying to wanted much deeper experience with Kubernetes, Terraform, and AWS. I had worked with all of those at the previous two jobs I had in the 6 years prior to this search, but hadn’t really dug in deep on them and it showed in those early screens.\n\n  \n\n\nI also got several rejections in the final rounds towards the end where the feedback was that I did very well but someone else just had a bit more relevant experience so they were getting the offer. I even had one recruiter say that the hiring manager tried to get headcount approved to extend offers to me and the other candidate but got denied and I was the second choice.\n\n  \n\n\nHere’s the details of the two offers I did get:\n\n  \n\n\n**Seed stage startup**\n\n* Salary: $190k\n* Target bonus: 10%\n* Equity: $88k in options\n* Remote\n\n\n\n**Meta**\n\n* IC5\n* Salary: $215k\n* Target bonus: 15%\n* RSUs: $710k over 4 years\n* TC: ~$425k\n* Hybrid 3x/week\n\n\n\n[Sankey source](https://sankeymatic.com/build/?i=IIBxBsEsFMBMAIDaA2AHAXXgOQPbwE7QDOIOAdkdAFCgQwKIDsArJgErQBW0AxgC5wqAeiHwAhkSIBXALaQyAc3Hhw8HADN4fABbRxPHtBACEYsFB5i%2BkckQLEp4E%2DHnxLKogBp4UkLCt6kJpkvMREYvgAnjTm9EgATBjwAMJiKvAA7qKEPPhSkAL4MXRwCZgA8mRQIeKSYTLQZHzFUKWIAIyYABJipuCEvZEuTdD4AG4wGaXqOPhaugQ44NS0rQzx7Lx5BaP2JOSwgqtxHZgAkmQFkGlavNqX7otSZLBUVD19A7BD8oUT0FMEDM5jo9PglnpTvAONx%2BIIqBxcvlCntSC82ht4ABxbQ4IgmN6I7YohqSMQKUoNJDtZAAFkwAHUCtpYIQMgitsjdqTwhSEFSUElUuksvYkTsikSuXMeeTKZDaUkcXiCVKJfBZXyNZD2vToVxeKrOerNfKkHrKtU9BJKJIGk0OeKSWE5fydedLtYbgIePdII9wc9XlRhapRTlibsoQAVMQAaz0uKpNsgCjI9uaocy2WNKI6AE5NrCCVnw7mo8xOvALldvXcHjdAy8Q2kwzmnVGAMyM5msgEtkXtyNzJgVKrya11O2NTOt7Ni4fU1jY3H4%2BGxhPwJOToip9MzsrwJk6PvsjeJnDJyR7jPUouGwTnreXnc3g%2BITEAMXkjZwQaoT7brUu5preULHiybLiOoKJiAYRjWIoajqOooyEtAcG6Agf58FoeAyEMIR8Bksxxne%2BrFoIHCYaUOF4RqhHQMRpHkbgqK2NQVA1l6qg%2Bn6AZ%2Di8CTIPecKvNx1y8fW%2Dq%2DkG1J6t%2BZCyc2El1r6DaqE2DDtAADJgypruJnqSbc6kyZpgkMMugEvsBb4OqpUlmQJcngb2bJccZan8cp2ljlawH1DObyWhOgXTk0SDdhRD6vKFNQ2kFkWIHqEGnlQ8U7kluEpR6tZOT5Fn%2Dpl4VEGB0WKb5byVUVQkdMuMKxVQNVPHVmJpVBYgwbscGGMY8hKBoqFFC1WnkeUKFoaNlnkdGGEyBqVi%2BgNbxzWIC0yEt2gDeNk1FBle3kcA8HGIIE3DeRAAivBWsGABcjVifAADEyTJDpH06VQd1sYQ%2BwUHoz2MLSwPA99pZDtKL0AEbMDwtLxIw30dQCL35vmqDqIwnbfcdfXOM9H2fp%2BH3feduyEzpPD5qTd2OaZhWtQglO0swtPTXJlOMLAtPXTwt0vR9CO0yjGTQbBJ2IYNh3PYcYg0%2DmuOxKUlOfV9D0Yb6tFSLhfD4YxzH4GRqufd9arOmSWpUibtMlYlEW4c9nbxNDnY6Ujd0GQTyDc8g0DqzZV4gfukVOy7btI7uABeehi%2B0%2BbxF9W7wLpqBfZt%2BAKK4qjtPEVAECnedaCnqD59D8CJ1Q0NKDwSyzC9KGN%2Bo%2Bd8PgYgUCAEQHlgVBkDghyZIX%2BfaPAbP5yQcE7SwZezIccxJ6Cyb57X4D189qAb5v%2Bc4J3PAFEM7RUOoq9izwUjjFY596DpAB0zD5%2DIuj4AU6jggtfARBSzRuHXczPejADFZqF3vveAt9WZUHAGISIdFZ49R1peKw%2Dp86cCkPiIIMDn5ZwoNgFBaDrDqEiI0WAdge72DGKMSgCg24gBHmQqwH9lpkFrjICATFiB63gCELu%2BJIFiGhtAcAdgV5rzVqTLckAB5kO2gobQUBZG4VvtPeAMwmjqDgnocIFAAC0lBn7N3gFaCee8kK3yLoQKB1gKHRz0O0XS%2BdNppgwSnUmUCBHgCUsmMAGF8B2AAJrj0gDHFOyB85TFTNoXCtJXH8MEWMNIUhrTeIiP4%2DO6hHDgBADkSAu5yDwACfAUgu5rB5PcTgdkmRoARKiTE9xRSrh5LEAgtIe4wHjy1smBBaTIC%2BNwgI4E1B4DQwGHGUgvwK5fXieARJKjZibVwgAck8DfBZ%2BcsnQHUJAAAHvABZqz4DSBQts3ZqzF7QCGpQXCYh4ChKGW0tw9yEDpyYtcjMNgKDtwTJEeZ%2Dp8n5ygOgmQ0M0jt0MKkmQOAKHwGOKUbRt8dK6R0swbwcKb66niCDKgEKoW%2DWIGiSgYCb5Ip0p2fMKLb66WYLSLFkK9Dm25C6K2ehtHtDvp2ZAyBvAUpBtS7FdLNZYTUDreiBEuFMRIkbQlH12ioGRfAVFnZUCJBxnylIc4ywdjmKitO8R8ztC5WihFOk86qrtlOMqB5UXMHzMwZAnZyU3zdgik1tLqxeQKhpJm8rb7WvZfEA18R44%2BxpVCr2pR4U2vzLSA17RGAIvvqq0W4seqSx2kNXYqK7HxFtTG5AGND6qo5kJBVMrs0Gp0nqzsvLXWB1fKBS14DaT5kVQGukjBQmqses4eF7Qq3lsVcwF1UKk3worS2qVaBEghr0OTLV8LkAVrlai41iRS6qrxghcNRKkXsodanZgCbXV8wFqOn2DqdKs3aIeqFHxlBfB%2BCMcYkxpj11BIsZY3qb60jzagaNn6PqJEVqqtaG0to7UzagTs1rz0XtQAW119K5h%2DTRIcBAqLkDxE7O2h1aBkDWqAA)\n\nEDIT: Explaining my terrible labels: \n\n* Withdrew after accepting offer: I used this for the companies I withdrew from once I accepted Meta's offer.\n* Rejected: means the company rejected me at some point\n* Ghosted: the recruiter stopped responding to me without an outright rejection\n* Call w/ recruiter: Only used this if it was the first step before anything else after either applying or getting their email or LinkedIn message. A few places slipped this and I also used it to distinguish between getting rejected or withdrawing before or after talking to the recruiter on the phone.",
      "subreddit": "cscareerquestions",
      "score": 282,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ppv153/got_laid_off_last_year_for_the_first_time_in_12/",
      "comments": [
        {
          "body": "So where do you work now after the meta layoff?",
          "score": 80
        },
        {
          "body": "Wow meta rampup is short if they laid off within a year. All the best, OP",
          "score": 29
        },
        {
          "body": "[deleted]",
          "score": 23
        },
        {
          "body": "Holy shit the RSU at meta is WHAT after 4 years 🤯",
          "score": 14
        }
      ]
    },
    {
      "title": "Winter may be coming, some high level tips and advice on how to navigate an tech downturn",
      "body": "I've been active on this sub for a while now, and the very recent change in atmosphere around here has been quite sobering. I posted [this post](https://www.reddit.com/r/cscareerquestions/comments/uj7hnt/is_anyone_noticing_any_sentiment_changes_in_the/) 6 months ago and the responses back then felt like a different lifetime.\n\nI can only imagine how many students, junior or even experienced engineers are feeling anxious right now dealing with the first industry downturn in their professional career. After thinking for a few days I think I should pen a post that may help some people around here.\n\nSome background about me: I graduated college in the middle of the 2008 recession, but since then I have worked at multiple startups (including one YC and one pre-IPO unicorn), 2 of the FAANG companies, and I helped build a startup that saw a decent exit from acquisition. Until very recently I was in eng leadership position at a medium sized tech company. I'm also an angel investor on the side and from my network connections I tend to hear whispers and rumors a bit earlier than most people (part of the motivation of why I wrote that earlier post).\n\n**Disclaimer**: I will try my best to **not** predict the future in this thread. I want to keep this post as matter-of-fact as possible and I want it to be *descriptive* and if the situation applies, *prescriptive*, but I do not want this post to be *predictive*. I have my thoughts and opinions about the future but I do not want to engage in speculation here.\n\nWith all that said, let's start.\n\n**2 major misconceptions I see a lot around here that I'd like to address**:\n\n1.\t\"If I work for a solidly profitable company with a good business model, the recession won't impact me\" -- This is a popular sentiment that usually gets upvoted to the top. There are 2 things wrong with this statement. First is that no companies exist in a vacuum. A company may have a solid business model and good cashflow on its own (eg, Microsoft, Google, Amazon, etc), but there is no way to guarantee all of their paying customers are in the same shoes, let alone their customers' customers, etc. That's the reason we are seeing all the top companies are giving conservative fiscal outlooks at the moment. Secondly even profitable companies look for reasons to trim fat and cut cost during a downturn. This may start with hiring freezes and may lead to actual layoffs. Different companies do this differently. But just know that leadership do respond to investors and shareholder pressures and sometimes have no choice but to show that they are being fiscally conservative. During the boom time many companies hired people they didn't need just so they can tell a *growth story* to investors and Wall Street, but during a down cycle the reverse can also be true. It's silly I know, but it's what it is.\n\n2.\t\"Engineers aren't going to be impacted\": It is true that engineers are harder to replace and are considered strategic assets for many true tech companies. But as far as cost saving goes, these are some of the *most* delicious fat to trim since engineers tend to command a larger compensation than other roles. Due to the narrative, PR and morale damage, tech companies tend to be a bit conservative with cutting engineers at the beginning stage of a recession. But if things don't get better, cutting engineers *will* be an effective ace-in-the-hole cost cutting measure. Think of it as a \"nuclear option\" for growth tech companies.\n\nThere are some more but I will move on for now.\n\n**Some tips**\n\n1.\tDo Not Panic: I can't stress this enough. Do not worry about things that's out of your control, like macroeconomics or global events. In times like this, I hate to say it, but the best thing to do is be self-centered and focus on yourself. Take a deep breath and know that most mistakes are made by emotional people. And every single minute you are being emotional is a minute you aren't making things better for yourself.\n\n2.\t(Re)Warm Up Your Network: Sometimes it's nice to play by your ego. Recession isn't one of those times. If you can reasonably reach back out to recruiters that you've ghosted in the past, now may be a good time. You don't need to be seriously interested in a job to have them as \"what-if\" options. Similarly true for coworkers and ex-coworkers. Good professional relationships go beyond individual companies and sometimes a solid referral is the difference between weeks of job searching and starting a new position 2 weeks after being laid off. \n\n3.\tIncrease Your Visibility: In some situations I mean that *literally*. Like turning on your webcam once in a while in meetings (and try to use webcam in 1 on 1s especially if your manager/lead does it). I know this is a controversial topic on a sub of introverts and people with social anxieties, but just remember that the people who make decisions during layoff are just that... *people*. They fall for some of the most primitive human flaws, emotions and biases. In the boom time people who are more vocal and visible tend to get rewarded more when compared to people of equal technical skills, and in the bust time they tend to...well keep their jobs better. Be visible to your manager *and* to your coworkers. A few junior engineers telling your manager how amazing of a mentor you've been can go very far in your career, whether it's promotion or layoff. \n\n4.\tPolish Up Interview Skills: Just do enough to make sure you aren't so rusty that you lose confidence. There is no need to spend X hours a day practicing LC unless you think your job security is in imminent risk. It will just unnecessarily stress you out and may even impact your daily job performance, which can lead to unintended consequences.\n\n5.\tFor Graduating Students: Apply to as many places as you can. Keep your expectation realistic. Whatever the type of company you were shooting for 6 months ago, be mentally prepared to accept an offer from a company 1 or 2 tiers below that. It *sucks* I know, but any job on your resume will still be far more valuable than nothing. Edit: Credit to /u/ZhanMing057's [comment](https://www.reddit.com/r/cscareerquestions/comments/yqmrci/winter_may_be_coming_some_high_level_tips_and/ivpgqtk/), grad school is also an option that should be considered by some people.\n\n6.\tKeep a Good Perspective: I am making an exception to the \"no prediction\" thing here. If this is your first recession, well it won't be the last. But on the other hand the boom time we just saw won't be the last one either. These things come in cycles, but the common denominator across booms and busts are *you*, the person. Focus on learning and growth, and there is always opportunities for those even in the worst of the times. And nothing can take your learning and growth away from you. Focus on things you do have, and know that things are never as bad as they look (I tell people the opposite in good times lol).\n\n7.\tIdentify risks and priorities *if* worst case scenario happen, and plan accordingly: Credit to /u/it200219 's [comment here](https://www.reddit.com/r/cscareerquestions/comments/yqmrci/winter_may_be_coming_some_high_level_tips_and/ivp991a/). \n\n**Closing thoughts**\n\nLike I said, I can't predict the future. I *hope* this post is 100% unnecessary in hindsight (and my investment portfolio hopes so too). And if the recession gets bad, you could end up doing all of the above and still get screwed, or (very likely) do *none* of the above and still end up perfectly fine.\n\nBest of luck everyone. I can answer some questions as well.\n\nEdit: One related advice: If your company offers VRIF (Voluntary Reduction in Force), *consider* taking it. Some companies would let people volunteer to get laid off, with the same severance packages. The reason I'm offering this advice is that in a prolonged recession, severance packages get subsequently less generous with latter rounds of layoffs, as the situation becomes more dire. Meta and Stripe's first round came with amazing severance packages. By round 3 (if it gets there), I highly doubt it would remain the same.",
      "subreddit": "cscareerquestions",
      "score": 992,
      "url": "https://reddit.com/r/cscareerquestions/comments/yqmrci/winter_may_be_coming_some_high_level_tips_and/",
      "comments": [
        {
          "body": "Thank you, very valuable post and want to echo almost everything you've said.\n\n&gt; For Graduating Students: Apply to as many places as you can. Keep your expectation realistic. Whatever the type of company you were shooting for 6 months ago, be mentally prepared to accept an offer from a company 1 or 2 tiers below that. It sucks I know, but any job on your resume will still be far more valuable than nothing.\n\nI cannot stress this enough. \n\nI also graduated in the depths of the 2008 recession and had an offer from a big tech company rescinded. Job markets, even in the tech industry are closely tied to the broader economy. When belts tighten and investors look for profitability, the same tech company that promises you that you are a rockstar and that you're like family, will not think twice about letting you go. You could be a top performer in a division that's no longer deemed necessary and you will be cut.\n\nBut the good news is, at least when it comes to dev roles, there is always someone else hiring. It may not pay you FAANG+ money, but it will pay the bills and give you experience. I took a job in a small consulting body shop that paid 55k/year in NYC in 2009. Even in 2009, NYC was super expensive. I didn't like the company or the job, especially when compared to the brand value and the offer I had from the big tech company. I took it anyway because I thought being gainfully employed is better than being jobless and being forced to move back in with my parents. I'm glad that I did, because the job market eventually recovered by 2011 ish, and I found a FAANG job by then, thanks in no small part due to the experience I gained in the shitty consulting gig.\n\nWhen job markets tighten, it is important to focus on being gainfully employed rather than chasing the next big thing. Being prepared and being willing to take jobs that you wouldn't otherwise take will take you far.\n\n&gt; (Re)Warm Up Your Network: Sometimes it's nice to play by your ego. Recession isn't one of those times. If you can reasonably reach back out to recruiters that you've ghosted in the past, now may be a good time. You don't need to be seriously interested in a job to have them as \"what-if\" options. Similarly true for coworkers and ex-coworkers. Good professional relationships go beyond individual companies and sometimes a solid referral is the difference between weeks of job searching and starting a new position 2 weeks after being laid off.\n\nThis one is also another golden nugget. My first FAANG job happened because my immediate manager from a legacy F500 company was hired as a Director at one of the FAANGs and he straight up poached me from there. \n\nIt always pays to maintain good relationships with your former managers, coworkers, and recruiters. Even if I'm not interested in a job a recruiter is messaging me for, I tell them I'm not currently looking to leave, but would like to stay in touch for future opportunities and just add them on LinkedIn.\n\nI got my last job by just messaging one of those recruiters, who then got me to skip the phone screens because I already had another offer. All of these little things add up over time.",
          "score": 183
        },
        {
          "body": "I would offer a counterpoint in that if you are a new grad, and you have the financial options (help from family, funded program, some kind of +1 year thing at your school), you should at least look into grad school as an option to delay market entry. \n\nThe effect of recessions is \"[sticky](https://siepr.stanford.edu/publications/policy-brief/recession-graduates-long-lasting-effects-unlucky-draw)\" in that it disproportionately affects those who enter the labor force during a recession. If you already have a job, it behaves like a temporary shock, and if you enter after the recovery, the persistence effect is weak. But going into the market during the shock makes the temporary shock more permanent. \n\nThe intuition here is really straightforward. If you already have a good job on your resume and got laid off, people will still see the prior title on your resume. But if you go into a less competitive position at the outset because of a recession, the signal you send is not distinguishable from people who wouldn't have been able to land a better job in the first place. \n\nIf you can wait it out, and it's not going to saddle you with a lot of student loans, that is likely better for you in the long run. You may hear a lot of stories of how people went from $50k to $200k TC after the 2020 market crunch, but what you don't hear are the people stuck in the same $50k jobs.",
          "score": 100
        },
        {
          "body": "Identify most important and critical risk when you loose job. It could be immigration, finance etc  \n\n\nAccept what gets first in line. You can always change your job if it required travel or pays less. You need to consider again whats most important.",
          "score": 41
        },
        {
          "body": "Tldr: Work, Workout, Vibe",
          "score": 194
        },
        {
          "body": "This post is giving me some sort of relief. I'm self-taught and just started looking for work and it's stressing me out even though I had planned to aim a lot lower than what is typically advised. I also graduated around the time 2008 and it was really hard watching my friends and family suffer a lot. This industry downturn is bringing back a bunch of anxiety from that time.\n\nJust gotta keep my head down, stay focused. Might even need to get a part-time job while I'm job searching.",
          "score": 17
        },
        {
          "body": "[deleted]",
          "score": 15
        }
      ]
    },
    {
      "title": "Indirect evidence suggests Meta Eng. hiring up 10x since last year",
      "body": "https://interviewing.io/blog/how-to-negotiate-with-meta\nIt's also an interesting read overall.\n\nNetflix also way up and Amazon picking up, we back in business!!",
      "subreddit": "cscareerquestions",
      "score": 350,
      "url": "https://reddit.com/r/cscareerquestions/comments/1b1jeac/indirect_evidence_suggests_meta_eng_hiring_up_10x/",
      "comments": [
        {
          "body": "[removed]",
          "score": 276
        },
        {
          "body": "Always be aware of amazon hire to fire practice https://www.inc.com/jason-aten/amazons-controversial-hire-to-fire-practice-reveals-a-brutal-truth-about-management.html",
          "score": 263
        },
        {
          "body": "(SWE) meats back on the menu boys!",
          "score": 153
        },
        {
          "body": "Anecdotally LinkedIn consistently reported 30+ new jobs each day last week, up from 1-29 which has been the norm all 2024 (obviously based on my filters). I’ve been getting more LinkedIn profile views and random recruiter emails as well over the last couple weeks.",
          "score": 79
        }
      ]
    },
    {
      "title": "Getting a first job is so much more difficult than I previously thought",
      "body": "... circa a thread posted 6 years ago.\n\nThis subreddit is full of scared students. If you want a real pulse of the market, check out teamblind.com, where you have actual software engineers talking about actual experiences. People who are actually in the field and not just stirring up shit or scared 16-year-olds. People talk down Blind as some kind of TC-obsessed dick-measuring contest, but it's really not. There are trolls, but there's a greater concentration of experienced people willing to help out others than anywhere else online.\n\nI'm mid/senior-level and regularly see folks lining up multiple interviews with big names like Amazon, Uber, Meta, etc, with offers north of 400k. I get it's a different ballgame than the entry-level scene, but the competitive market has handed a convenient excuse to those facing serious strategy issues (resume, personality, technical interviewing) – an easy way to pin their failures on something else.\n\nPeople around here are always talking up the good old days. Well. here's a random sampling of the good times that I found in five minutes.\n\n* 3 years ago: [So is this field oversaturated yet?](https://www.reddit.com/r/cscareerquestions/comments/kh67tz/so_is_this_field_oversaturated_yet/) Thread answer: Yes, for entry-level.\n* 5 years ago: [CS Grads: How long did it take you after graduation to land a Developer position?](https://www.reddit.com/r/cscareerquestions/comments/9a0v6p/cs_grads_how_long_did_it_take_you_after/). Thread answers: 3 months, 5 months, 6 months, 8 months, 12 months. \"The market is really difficult right now.\n* 6 years ago: [Getting a first job is so much more difficult than I previously thought.](https://www.reddit.com/r/cscareerquestions/comments/71pek3/getting_a_first_job_is_so_much_more_difficult/)Thread answer: The Bay Area is incredibly competitive; you have to look elsewhere. Basically, move to Michigan.\n* 6 years ago: [Can't land a job.](https://www.reddit.com/r/cscareerquestions/comments/8txpz2/cant_land_a_job/) Thread answer: Entry-level is incredibly competitive, and their resume sucks.\n* 7 years ago: [Why aren't more people freaking out that Bootcamp Grads are getting Dev Jobs?](https://www.reddit.com/r/cscareerquestions/comments/6g648a/why_arent_more_people_freaking_out_that_bootcamp/) Thread answer: You should be if you are in web development.",
      "subreddit": "cscareerquestions",
      "score": 235,
      "url": "https://reddit.com/r/cscareerquestions/comments/1avn15h/getting_a_first_job_is_so_much_more_difficult/",
      "comments": [
        {
          "body": "Both Blind and this sub have their biases. This sub skews young and less experience. Blind skews FAANG and other big tech, so their view is biased towards higher-earning companies, etc. I think they are both worth considering when looking at data/trends. I'm sure there are plenty of people on Blind that would consider a lot of \"normal\" jobs to be peasant-level. \n\nI don't read Blind much, but I do see a lot of comments complaining people are posting more personal and relationship topics there than they used to. The common response is, \"When did Blind turn into Reddit?\"",
          "score": 42
        },
        {
          "body": "This is disingenuous. Just because it was difficult when we were looking for our first job does not mean it’s not comparably MORE difficult now. It absolutely is. I do agree that not all is doom and gloom, but disagree that these hiring markets are anywhere near the same.",
          "score": 347
        },
        {
          "body": "There’s literally data out there that job listings are down. It’s even less than 2019 when there were less CS grads and less population.",
          "score": 27
        },
        {
          "body": "the issue is that entry-level/new grad has always been difficult, you can literally say that every year for probably the past 10 years (ok fine 2021 was maybe an exception) and it would had been true\n  \nso it's just a matter of **how** difficult, the problem nowadays (just one of the many, there are other factors too like interest rates and whatnot) after the mass layoff in 2022 there's a lot of Senior and mid-level floating around = crushing the entry-level job market\n  \n7 years ago is 2017, I'm pretty sure in 2017 you don't have 100s of thousands of people out of work simultaneously (which happened in late-2022/2023/2024)",
          "score": 161
        },
        {
          "body": "Funny thing is these types of posts are always coming from mid/senior software engineers who are not in the job market applying to entry role levels.",
          "score": 78
        },
        {
          "body": "2018: fresh chem eng grad with 2.10 gpa and a javascript calculator, 20-30 applications, 5 interviews, 2 offers\n\n2024: fresh comp sci masters grad, 3 years professional experience with java, distributed systems personal projects, 200+ applications, 0 interviews\n\nJust my personal experience when applying in 2018 vs 2024.",
          "score": 122
        }
      ]
    },
    {
      "title": "Snap L4 Offer Signed",
      "body": "Current: Backend engineer at a startup \\~30 engineers, 3.5 YOE. The base is 135k and equity is paper.\n\n**Process**\n\nI applied to a 3 YOE backend opening, then got approached by a recruiter. I asked about the process and asked for 1+ month to prepare.\n\n**Phone interview**\n\nThe interviewer was very friendly and professional (15+ YOE). Behavioral question on navigating through uncertainty (15 minutes). The technical question was based on BFS, but with one rabbit hole trap if you don't understand the graph well. After getting the working solution + test cases I explained the most optimal approach to building the adjacency list but didn't have time to code. (35 minutes) During the Q&amp;A (10 minutes) the interviewer talked about how at Snap privacy is paramount and luckily I read a relevant blog article on Snap Engineering's blog on differential privacy and he seemed very pleased discussing it. Heard back about moving onto the onsite the next day morning.\n\n**Onsite Day 1**\n\nRound 1: An engineer from the short-form video ranking team came in. Behavioral was about telling a story when you had to finish a project given limited information. (15 minutes) Technical was a simple array-based question, but he wanted to go through all possible approaches on how to solve the question. I wrote the working solution + all test cases (30 minutes). That's when he gave a follow-up question with a tricky condition that you have to wrap your head around, and I had to reiterate the example case multiple times to understand the condition. After a few minutes, I figured out the logic and wrote the working solution + test cases. (10 minutes). He had one more follow-up question now to turn this into a stream-based question, but the approach was what we already discussed in the original question, and didn't have time to code. Did a brief Q&amp;A (5 mins) about the technical details of how Snap ranks videos.\n\nRound 2: A team lead from the Maps came in. Behavioral was about empathy and kindness (15 minutes). The technical question was based on topological sort + DP. I got the working solution + test cases (20 minutes). Follow-ups were typical ones (finding cycles + best practices on function signatures) (5 mins). Asked quite in detail about what his team does (15 minutes).\n\n30-minute Q&amp;A: This doesn't factor into hiring decisions. An experienced iOS engineer came in so I asked about tips on how to become a senior engineer. Good conversations.\n\n**Onsite Day 2**\n\nRound 1: I knew this interviewer had to be the bar-raiser based on the LinkedIn profile and prepared some system design ideas around what his team does. Behavioral was about learning new technology fast and he wanted exact details so had many follow-up questions (20 minutes). He gave a system design interview as I expected, and it was on ad insertion &amp; delivery in stories. I prepared well for system design so it went well (35 minutes). Q&amp;A was short since we didn't have much time left (5 minutes).  \n  \nRound 2: A different interviewer came in. Behavioral was again around working through uncertainty and I ran out of stories so I reframed one that I prepared for something else (15 minutes). The technical question was around the Dijkstra algorithm and we discussed a lot about using a priority queue vs a FIFO queue. The follow-up question was to do this in a distributed system so I gave a simple design similar to a Web Crawler design.\n\n**Result**\n\nI finished the last interview on Thursday afternoon and heard back about the hiring decision on Monday morning. The recruiter told me that I got strong feedback all around. I had team match calls with three different teams and I decided to go with the team that was most interesting to me (platform integrity + content moderation).\n\n**Offer**\n\nInitial offer: 185k base + 178k annual equity = 363k\n\nFinal offer: 190k base + 178k annual equity = 368k\n\nMy initial offer was already at the top of the band so I couldn't negotiate more. Maybe if I had experience working at FAANG or had offers from other FAANGs would have been easier. Other FAANGs didn't respond to my applications.\n\n**Tips**\n\n[https://interviewing.io/snap-interview-questions](https://interviewing.io/snap-interview-questions) was the best resource to learn about Snap's interview process. They have a very similar interview process as Amazon in that there's a behavioral question on every round instead of a dedicated behavioral round. Refer to Snap's values [https://eng.snap.com/values](https://eng.snap.com/values) and prepare at least 2 stories per value in SAIL (Situation, Action, Impact, Learning). The main difference is that the technical portion is around the same difficulty as Google or Meta. Snap looks at how fast you code, so perhaps that's why they give such limited time on the coding part by having a behavioral question on every round. If you can consistently solve mediums that you've seen around 5 minutes and haven't seen in 15 minutes, and hards around 30 minutes you're probably in good shape for trying Snap.\n\n**Edit:**\n\nOffer entry on levels.fyi: [https://www.levels.fyi/offer/28877853-ebf0-4833-b615-03a56329afd1](https://www.levels.fyi/offer/28877853-ebf0-4833-b615-03a56329afd1)",
      "subreddit": "cscareerquestions",
      "score": 321,
      "url": "https://reddit.com/r/cscareerquestions/comments/1eb969o/snap_l4_offer_signed/",
      "comments": [
        {
          "body": "That is a great L4 offer, I'm not too sure you could have increased by much more without having a senior offer",
          "score": 136
        },
        {
          "body": "man is this all the shit you have to go through for non new grad faang offer?\n\nSeems quite sweaty... fkn dijksrats and topological sort.\n\nCongrats on the offer! well deserved.",
          "score": 176
        },
        {
          "body": "Good job and good luck at snap. I currently work at snap and this is pretty standard interview process here. I also do work some with content moderation team (mostly ml side though) so maybe I’ll meet you in slack.\n\nThat is not the top of l4 payband but it’s solid offer. If your recruiter said that I guess that’s negotiation trick. Equity is pretty standard and not flexible outside rare cases. Salary band is pretty big though and can go up some more. Assuming california/similar col as locations do have some payband differences. Signing bonus are also negotiable and sometimes happen. Top of band offer for l4 is ~400ish. Salary caps out somewhere around 230ish I think.",
          "score": 35
        },
        {
          "body": "[deleted]",
          "score": 106
        },
        {
          "body": "&lt;&lt; Me with 2yoe at a faang-adjacent company knowing that I’d fail the fuck out of this interview loop because I got tricked into joining a SRE/devops team so I never get to write code and probably couldn’t solve a leetcode medium anymore 😭\n\nCongrats on the offer. I’m not sure if this motivates\nme to start leetcoding and applying for something, or makes me want to just not even start.",
          "score": 28
        },
        {
          "body": "Congratulations, I have never seen a question combining Topological Sort with DP . I have seen course schedule ii but this is just Topological sort.",
          "score": 17
        },
        {
          "body": "Snaps stock has been beaten down so much there’s not much left to drop (-60% at worst imo) 178k equity of this is huge. Sucks for the people who had their equity when it was at 80 and now it’s 13. (My ex company shares dropped 90% from Covid to now it’s disgusting fml)\n\nInterview seems pretty advanced but the comp matches it.",
          "score": 17
        }
      ]
    },
    {
      "title": "Habits that helped me get my next job as a software engineer",
      "body": " Yesterday I accepted an offer to be a software engineer at Netflix. Rather than write up a story of my whole “incredible journey”, I’d like to share a few habits that I think helped me. This is written for my future self more than anyone else. For context, I had decided to go back to being a software engineer after failing at founding a startup. I was unemployed while preparing. My completion rate of these habits was 10-80% (yes, a huge range).\n\n### Go for a short walk very first thing in the morning\n\nI read some hacker news comment (that I haven’t been able to find) about someone else who would go for a short walk first thing in the morning. They didn’t want the first thing they did to be sitting and the first thing they looked at to be a screen. For some reason, I tried it and I found it to be a great way to start the day. Use the bathroom, throw on yesterdays clothes, walk out the door. I’d say some important things out loud (more on that later) then walk and think, then maybe listen to a Ram Das lecture. Walks ranged from 2 minutes to 40 minutes.\n\nI found this habit a really low effort way to make the start of my day better. Mostly it’s nice to get anything in before getting sucked into a computer. I was in Mexico and weather was almost never an issue.\n\n### Say important things out loud each morning\n\nMost days (I’m bad at being perfect) I’d say how I intended to meet the day, my goal, three things I was grateful for, and how I want to be with my partner. Only the gratitude list changed, everything else is constant. I think mantras like these are more powerful when you live them instead of share them, so I won’t go into details except on the goal. I’d say “My goal is to get a job as a software engineer making $250k by June 30th.” I had the last interview on June 30th and got the offer on July 8th. I exceeded the salary goal. Wouldn’t be software engineering if I didn’t miss the delivery date!\n\n### Do 2 hours of core work after the walk\n\nIf there’s any habit I want to be sure to keep, it’s this one. My idea of “core work” is the most basic, distinguishing function of your job. It’s also important that it’s creating instead of consuming. I’m a software engineer, so that’s writing code. From about 7am to 9am I’d write code. It’s really nice to start the day with a few hours of the real thing before a bunch of bullshit creeps in. It’s amazing how much nonwork creeps into working life even when you’re unemployed. If you’re wondering what your core work is, there’s a good chance it’s some form of writing.\n\n### Use more single-purpose electronics to reduce phone usage\n\nSpecifically, I made better use of my Apple Watch (audiobooks in the morning) and Kindle (reading at night). Computers and phones are attention sucking black holes. Maybe more neutrally, they’re incredibly powerful machines. It is not a good thing to have a box of endless novelty in my hands when trying to read a book.\n\n### Read important things many times\n\nI think I have above-average reading comprehension. I scored very well as a kid on standardized tests and it hasn’t gotten any worse. I’m not trying to brag, just make it clear I’m not trying to make up for a reading deficiency. I’ve started reading import things many times. I read it a few times immediately, then revisit it again over time. It is amazing the new things I find in things I’ve already read. A coding problem description I might read 2-4 times. The ad for the job I ended up getting I read around 10 times. The five point summary of the Netflix culture deck I read at least 50 times.\n\n### Think of how you’ll win, think of how you’ll not lose\n\nMy two step strategy for passing the interview: 1. Win. 2. Don’t lose. It’s sounds obvious, but the split was very helpful. I’d imagine “Where can I blow them away? Where can I really win?” For me, that was coding in Python. So I wanted to make sure to create and exploit situations to show that off. I wanted them to have some really positive things to say in the debrief. Then the other side was “How would I blow it?” There are some mistakes that can really outweigh the positives and sink you. I knew for Netflix that was not knowing the culture. Some others for me were sucking at SQL and not having good answers for some work history questions. So, I strengthened in these areas and didn’t lose. These things aren’t going to be yours, but just some examples to find your own.\n\n### Rehearse\n\nLet’s say that you get a description of your interview schedule. One of the interview topics is “how you handle interpersonal conflict”. You could just read that and go “uh-huh” but another move is to like actually prepare. How about answering the question out loud “How do you handle interpersonal conflict?” then answer it again a different way. Then again the same way. Then think of more questions. “What’s a time you handled interpersonal conflict and it went well? And it didn’t go well?” There are really only so many questions about interpersonal conflict that an interviewer is going to ask you. Maybe like 8. And if you’ve practiced 8 and they ask you a 9th, you’ll probably be fine. I did this for a few dozen topics. It’s a lot of work, but I found it to be easy work. Another version (related to not-losing) is to think of all the questions I’d feel dumb not knowing the answer to, and then get an answer ready.\n\nI also practiced out loud with my girlfriend and using [interview.io](http://interview.io/). I think many people believe that you need to interview with a few companies to get warmed up before going for the companies you really want. Maybe if you’re a new grad and you really don’t know what’s going on. Otherwise, that is a very inefficient way to rehearse.\n\n### Meet with a project manager weekly\n\nLife coaches are expensive and creep me out. I found meeting with a project manager to talk about all the ongoing to projects in my life for just 30 minutes is extremely helpful. I found someone on Upwork who lives in Colombia, speaks perfect English and is very affordable.\n\n### Spend 30 minutes each day doing my oldest tasks\n\nI use Todoist, and wrote a script that grabs my oldest tasks one a time. At the same time each day, I’d spend 30 minutes just taking the tasks in order of oldest first. If I couldn’t do it in that moment (maybe it’s taking something somewhere) I’d try to move it forward somehow (put the object near the door). The oldest task isn’t usually the most important. But by the time a task is the oldest, it means I’m avoiding it.\n\n### Focus\n\nMy job application funnel was one cold email, one interview loop, one offer. I’d rather come in first place for one job than second place for a hundred. I couldn’t have done the prep I did for Netflix for even five companies at the same time. Some companies lowball and you need competing offers.\n\n### Do a shutdown ritual\n\nLook at all the tasks I completed today. Look at all open tasks. Look at my schedule for the next two weeks. Say “that’s enough for today” out loud. Then do something besides work or study the rest of the day.\n\n### Put my phone and laptop away\n\nEach day (ok probably like half or less) I’d have a notification go off to put my phone and laptop away. I left them charging in a closet. It made getting them out in the morning more purposeful, too. I still had my kindle for books.\n\n### Actually try some of the things I read about\n\nSort of a meta comment, but it’s so easy to just consume productivity porn. There’s a bunch of things on this list and they’re pretty different from each other. The odds that none of them would be helpful to you seem pretty low. So maybe read it again (ha!) and see if there’s anything you should try for a bit.",
      "subreddit": "cscareerquestions",
      "score": 917,
      "url": "https://reddit.com/r/cscareerquestions/comments/ohguuy/habits_that_helped_me_get_my_next_job_as_a/",
      "comments": [
        {
          "body": "I was skimming your post and read \"do 2 hours of core work\" after the walking in the morning one, so I thought you were advocating for some ultra intense ab workouts first thing in the morning.",
          "score": 454
        },
        {
          "body": "I'll start with the walk for now, thanks",
          "score": 146
        },
        {
          "body": "\"**Do a shutdown ritual**\" ==&gt; this is an extremely important tip. Before the pandemic, the ritual was automatic, you got up from your office chair and went home. Now, if you work from home, there's no boundary between personal and professional life hence the importance of this ritual.\n\n\"**Go for a short walk very first thing in the morning**\" ==&gt; it's all about natural light exposure. Andrew Huberman discussed this in his podcast: https://youtu.be/nm1TxQj9IsQ\n\nCongratulations for getting the job!",
          "score": 131
        },
        {
          "body": "Congrats!! Wow more than 250k a year is insane. What kind of tech stack will you be working with?",
          "score": 55
        },
        {
          "body": "&gt;My job application funnel was one cold email, one interview loop, one offer. I’d rather come in first place for one job than second place for a hundred. I couldn’t have done the prep I did for Netflix for even five companies at the same time\n\nSimilar to you, I successfully completed a job search for FAANG while unemployed. I have to disagree (for lower levelled roles). Don't go all in preparing for Facebook, then Apple, etc. Most tech and software companies follow a similar interview process. Interviewing for a no-name start-up helped me interview with Microsoft, which helped me with Google. I suggest broadly preparing by leetcoding and preparing STAR stories. When you get to the onsite stage, then narrowly prepare such as stories for Amazon behavioral principles.\n\n&gt;Some companies lowball and you need competing offers.\n\nThe way to do this is to receive multiple offers. Don't put all your eggs in one basket, that's a mistake I made as a new grad while going through FAANG interview loops. You need the offers to arrive at similar times to be able to negotiate, and the way to do this is to be in the interview process with multiple companies at the same time\n\nGood write-up in other points. Especially agree with the single-purpose electronics and how'll you win not lose. Phones are way too distracting, I deleted facebook while unemployed and started using my kindle again. Sometimes you'll lose and it'll be out of your control, such as having a terrible interviewer who won't pass you no matter what. For example, I interviewed at IXL with a guy who sounded like his dog had just died. He didn't speak unless prompted and when he did it was single sentences. Wasn't shocked at all when I got rejected shortly afterward. You've got to get over that and don't think of any one company as your \"dream\" company, which is why I think pursuing multiple companies at once is important.",
          "score": 36
        }
      ]
    },
    {
      "title": "Meta Full Loop Interview,  No Update After a Week, Should I Be Worried?",
      "body": "Hi everyone,\n\nI recently completed my full loop interview with Meta on June 3rd and 4th, and I haven’t heard anything back since then. The only communication I’ve had was a quick call from the recruiter mid-last week asking for references, which I promptly provided.\n\nIt’s now been a full week with no update, and I’m starting to feel a bit anxious. Is this kind of delay normal with Meta’s hiring process post-interviews? I know big tech companies can take their time, but I’d love to hear from anyone who’s been through this , how long did it take for you to hear back? And does the reference request generally indicate positive signals?\n\nWould really appreciate any thoughts or insights. 🙏\n\nThanks in advance!\n",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1lglmcj/meta_full_loop_interview_no_update_after_a_week/",
      "comments": [
        {
          "body": "Please forward to anyone you know in meta so that I can get some help.",
          "score": 1
        }
      ]
    },
    {
      "title": "Structural Design Engineer at Meta interview in 2 weeks",
      "body": "Hello guys I have an interview with meta for the Structural Design engineer- FEA position in 2 weeks and I’m very very tensed. What questions can I expect and which topics can I expect to be drilled on. Which concepts should I be ready with? And what problems (topics) can I expect to be solved in the on-site/virtual interview.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jvjb3q/structural_design_engineer_at_meta_interview_in_2/",
      "comments": [
        {
          "body": "for structural design/FEA positions at meta, from what ive seen recently they focus a lot on:\n\ntechnical fundamentals:\n\n* FEA theory n mesh generation\n* material behavior/properties\n* static n dynamic analysis\n* thermal analysis basics\n* simulation validation methods\n\npractical skills:\n\n* ansys/abaqus experience\n* how ud approach complex loading scenarios\n* optimization techniques\n* convergence issues n how to fix em\n* model simplification decisions\n\ntalk thru ur thought process! they care tons about HOW u approach problems. like:\n\n* wat assumptions ur making n why\n* which boundary conditions ud use\n* how ud validate results\n* trade-offs between accuracy n computation time\n\nquick prep tips:\n\n* review core mechanics concepts\n* practice explaining technical decisions clearly\n* do some sample FEA problems w/ time pressure\n* think about real world applications\n\nif ur super nervous, def worth doing a mock interview w someone whos actually done meta structural interviews before. getting specific feedback can help u identify blind spots n improve ur communication",
          "score": 2
        }
      ]
    },
    {
      "title": "Meta post onsite interview",
      "body": "Hello everyone,\n\nI have 2.5 years of experience as SDE. I recently interviewed for Meta for IC4 and recruiter send me an update that debriefed happened and they gave approval for IC3 and will submit my profile for candidate review. If I couldn’t find any team then my results are valid for 1 years. Should I be worried about not getting an offer?\n\nit was a reject and employment hunt continues ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/18n73oy/meta_post_onsite_interview/",
      "comments": []
    },
    {
      "title": "Name dropping companies that post fake jobs",
      "body": "I will be namedropping and name shaming these \"companies\" in my area because they deserve to be called out. I have reported all of these jobs as fake ghost jobs to these job boards like Indeed, but some you can't report because they're on the companies own websites. Reporting these real companies to the BBB might be a better option but in most cases nothing happens...\n\nI have seen so far 50 fake job posts on Indeed in my area just this month. These are just a few that I can fit in this post. I can prove these are fake jobs because the companies dont even exist, they do not have a website and cannot be found on Google, or there are no businesses in my area on google maps with those company names. OR the jobs are being spammed with no intentions of hiring you to get as many applicants possible to sell your information. If these \"companies\" are posting 20+ job listings but don't even have a website, it's 99% fake job postings. If they're posting less than 10 but has no website okay we can give them the benefit of a doubt because I've seen that happen before for family owned businesses, and at least those mom and pop shops showed up on google maps. 20-30+ job postings and no company website and nothing on Google Maps is ridiculous and a big red flag. How are you gonna hire 20+ people and have no proof of your existence?\n\nThese company names are generic like they have acronyms like TQC or they're generic like Intelligen, none of these companies exist. And these companies on Linkedin do not have any reviews but have over 30 job listings that have been opened for 30+ days. [Intelligen Jobs and Careers | Indeed.com](https://www.indeed.com/cmp/Intelligen-1/jobs?q=&amp;l=#cmp-skip-header-desktop)\n\nThere was a job post from a company called Belva which is hiring for software development jobs but it's actually a scam call center in India. [BELVA Jobs and Careers | Indeed.com](https://www.indeed.com/cmp/Belva-1/jobs)\n\nPort City Executives has a job post in my area but they are located in Conneticut, they do not have any office in my area. These job posts are listed as account representative internships entry level. [Port City Executives Careers and Employment | Indeed.com](https://www.indeed.com/cmp/Port-City-Executives)\n\nTQC is a call center in Pasadena California but is posting jobs all over the country, require you to already live in or relocate to near Pasadena for minimum wage [TQC Careers and Employment | Indeed.com](https://www.indeed.com/cmp/Tqc-2)\n\nEpic is a notorious one also, they also post jobs all over the country and require you to take FAANG type leetcode interviews and then you to relocate to Madison Wisconsin if you even make it that far for the onsite interview [(13) Search all Jobs | LinkedIn](https://www.linkedin.com/jobs/search/?currentJobId=3955127048&amp;f_C=163658&amp;originToLandingJobPostings=3955127048,3849819243,3955120929,3986116441,3886682190,3988346514,3880427853)\n\nAbercrombie stores asks for your social security number before you even get an interview, if you even get one, and you still won't get hired, same with Hollister, American Eagle, and other stores like them. Who knows what they'll do with your social security number, they have all of your personal identity if you apply for a job there\n\n5 jobs were taken down in my area, Management Science Associates Inc apparently is located in Pittsburgh but has job postings in United States so it appears in all over the country [Management Science Associates, Inc. Jobs and Careers | Indeed.com](https://www.indeed.com/cmp/Management-Science-Associates,-Inc.-1/jobs)\n\nAerotek asks for your social security number on a phone call before you even get a job offer. Criminally awful benefits with long contract times if you even get the job from what I heard. People call Aerotek/Actalent a cult, has offices all over the country but has no intentions of getting you a job in most cases they're just collecting your information to sell it to data companies, if you submit your resume to them you just did their job for them for free now they get to make money from your information they were reported multiple times to the BBB for this but they still keep doing it [United States (aerotek.com)](https://www.aerotek.com/en/locations/united-states)\n\nBrooksource is notorious for spamming job posts listing them as entry level jobs but will say 5 years of work experience is required, falsely advertising these jobs as remote to gain as many applications possible around the country. [(13) LinkedIn](https://www.linkedin.com/company/brooksource/jobs/)\n\nInfinite Advantage Inc doesn't even exist [Infinite Advantage, Inc. Careers and Employment | Indeed.com](https://www.indeed.com/cmp/Infinite-Advantage,-Inc.)\n\nAmway lies about their pay range for their warehouse job posts. It’s actually near minimum wage. Lies about pay range to get people to apply. [Amway Jobs and Careers | Indeed.com](https://www.indeed.com/cmp/Amway/jobs?jk=f6a9be8f61edc931&amp;start=0&amp;clearPrefilter=1)\n\nGordon Foods posts jobs claiming they hire immediately for these jobs but has no intentions of actually hiring for these. I know this because I applied months ago and never got an interview. They had this job post listed since April 2024. [| Gordon Food Service (gfs.com)](https://gfs.com/en-us/careers/search/result/?jobID=part-time-freezer-associate/R-26735)\n\nFedex posts fake ghost jobs also. My application for their delivery driver and office printing center jobs has been in \"under consideration\" hell since March 2024. and they use a ai chat bot for your job application so wtf is the point a human is not seeing your application\n\nTarget posts fake retail job posts. They made me go through their one way video recording hell for cart pusher and cashier jobs and I still got rejected. Same with Best Buy and other retailers that use one way video recordings, it's just free discrimination for them if you're an ethnic minority without you seeing another human. This is a minimum wage job, not Microsoft, why are you requiring video recordings to see if we're ethnic minorities to be discriminated? Have you noticed why Target has only white teenage girls working there and no ethnic minorities like asians, this is why...\n\nMcdonalds makes you go through their online 64 question IQ test for their fry cook job. I did that too and got rejected somehow\n\nI applied to Tim Horton near my house and the manager texted me saying they stopped hiring in my area but there is one hiring 2 hours away... Fuck that shit\n\nPrecise Advancement Inc does not exist, look at the reviews on google maps they're even saying it's a fake ghost job  [Precise Advancement Inc Job in grand rapids, mi | Indeed.com](https://www.indeed.com/cmp/Precise-Advancement-Inc/jobs)\n\nASR Health Benefits is a health insurance call center is posting a EDI developer job as remote but requires you to live in the area and does not post the wage range, has a 1.9 review on google maps so you know how they treat their customers [ASR Health Benefits - EDI Developer](https://www.asrhealthbenefits.com/home/job-postings/edi-developer/)\n\nAccenture and Meta posts fake jobs, they just laid off thousands of employees so do you really think they have any intentions of hiring  people for the jobs they just laid off with these job posts they keep putting up? Entry level positions do not exist for these big tech companies anymore because they only hire people who are mid to senior level of experience now. Accenture announced they have stopped hiring for the foreseeable future via email.\n\nBig Lots posts fake jobs, they filed for bankruptcy. Do you really think they will hire you when they just went bankrupt?\n\nCU Answers has no intentions of hiring anyone for these minimum wage jobs. Apply and you'll get ghosted or never have your application seen [CU\\*Answers Jobs in grand rapids, mi | Indeed.com](https://www.indeed.com/cmp/Cu*answers-2/jobs?jk=8cc7e0ea5d6c8907&amp;start=0)\n\nLacks Enterprise posts tech and trade jobs with no intentions of hiring, and puts the pay range near minimum wage insultingly low, or sometimes no wage range at all, and require a bachelors degree when the tasks they want you to do absolutely does not require one its just factory work and manual labor [Lacks Enterprises Jobs in grand rapids, mi | Indeed.com](https://www.indeed.com/cmp/Lacks-Enterprises/jobs)\n\nLastly, Walmart and Sams Club. They spam these job posts in my area but has no intentions of hiring anyone. Theres over 50 jobs posts they spammed. I know someone who works at my local Walmart and he said they haven't hired anyone in months but are still spamming job posts to make it look like they're hiring\n\nI'm sick of these fake ghost jobs. And entry level jobs seems to be non existent when they all want to pay minimum wage and want you to have 5+ years of work experience to even get an interview, or the companies and job dont even exist, this is why we can't get jobs in 2024. How is this shit not illegal yet?",
      "subreddit": "jobs",
      "score": 535,
      "url": "https://reddit.com/r/jobs/comments/1g5wcb0/name_dropping_companies_that_post_fake_jobs/",
      "comments": [
        {
          "body": "Posts like this should be more frequent. Keep it up.",
          "score": 124
        },
        {
          "body": "ADMA Biologics in Boca Raton Florida",
          "score": 41
        },
        {
          "body": "There are fake job postings for Costco and Blue Cross Blue Shield as well.",
          "score": 34
        },
        {
          "body": "BBB is just a trade association. It doesn't enforce anything.",
          "score": 26
        },
        {
          "body": "[deleted]",
          "score": 16
        },
        {
          "body": "This is great! If you do get ghosted from applying to these jobs I've made [https://ghostedd.com](https://ghostedd.com) where you can anonymously report companies for ghosting. It's time to do something about this shit and i encourage you to report companies to hold them accountable.",
          "score": 10
        },
        {
          "body": "Aerotek does temping for construction type jobs, we used them at our warehouse in the CA Bay Area. Granted the people were terrible and they skimmed so much of the pay that the temps didn’t really make any money. But they are very much a legit company and our job listings were genuine.",
          "score": 9
        },
        {
          "body": "I once got an interview for Tech Support thanks to Aerotek. They had offices in my area but they work mostly with welders, maintenance, electricians etc.",
          "score": 7
        },
        {
          "body": "Pareto Realty",
          "score": 7
        },
        {
          "body": "You should post this on r/Scams.",
          "score": 7
        }
      ]
    },
    {
      "title": "Transitioning into Big Tech",
      "body": "I am about to sign a FAANG offer. I am currently @ 2 YOE, working for a super chill no name making 90k. My work days range from 0.1-10 hours with the majority of days closer to the left bound. I'm on pace to crack 100k this year. \n\nThe company I am about to join is going to be a very different experience. It is stack ranked and I was upleveled so the expectations are likely high. For those who have done something similar, how did you handle the added work pressure? \n\nThanks!",
      "subreddit": "cscareerquestions",
      "score": 138,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ks1ixp/transitioning_into_big_tech/",
      "comments": [
        {
          "body": "My first job hop was from a chill, low paying company to a much higher paying, higher expectations role.\n\nMy biggest piece of advice would be: if you're currently doing any coasting at work, you need to start cutting those bad habits out of your life now.  If you aren't fully ready for the change of expectations, your time at the new company will quickly become miserable before finally ending with a PIP, and by the time you realize you are drowning it'll be too late.  If you're not used to self motivating, it can really suck, but I promise that the alternative will suck a lot more.",
          "score": 138
        },
        {
          "body": "I went through the same transition. \n\nBiggest things are longer hours and more stress. There is a never ending stream of work in Big Tech. You can’t take the rest of the day off once you’ve finished your ticket. \n\nYou will feel imposter syndrome stronger than you’ve ever felt it at first, but you will learn more in the first 6 months than you’re entire stint at your previous company if you embrace it and absorb everything you can. \n\nYou will become a much stronger engineer. It’s a lot of hard work but it’s worth it.",
          "score": 65
        },
        {
          "body": "I am assuming it is Amazon based on your description",
          "score": 84
        },
        {
          "body": "Just work hard, be coachable, and don’t be afraid to ask questions. Focus on work in the beginning and reduce outside distractions until you’re up to speed",
          "score": 54
        },
        {
          "body": "Again why can't people just say the name of the company?",
          "score": 16
        },
        {
          "body": "Team dependent, but expect 8+ hour days. Stack ranking is a pita, you’ll probably be fine though. If you’re in office never turn down the chance to grab lunch or do an activity with coworkers, easy way to network and they will help you get up to speed. When you’re starting out don’t take on any extra projects, focus on your tickets. Have fun and try to be a person that people enjoy working with!",
          "score": 23
        },
        {
          "body": "More stress, longer hours, pay is better though. IMO ask good questions (like, questions after you've already done some research) and embrace gen AI and you should be fine. \n\nHave some form of note taking system. If you currently work out, try to continue as best as you can, because it's really easy to just stop.",
          "score": 7
        }
      ]
    },
    {
      "title": "Is this a scam? I’m having trouble with Meta &amp; scheduling an interview via a video call.",
      "body": "So I received this invite for a video call from Meta to interview for a Director of Marketing position. When I click “schedule a call” it takes me to a page to login with my Facebook. I don’t use Facebook so I made a profile. I type in my info and it just keeps loading and loading and loading, like for almost 20 minutes. Then it says password incorrect but then I go to my Facebook login and it goes right into my page. I’m confused. Like am I doing something wrong? The interview page is legit from my doing a little bit of digging. Additionally, I received a similar invite back in November and was able to login and set up a video interview but then after adding it to my Google calendar, there was no video link sent. What am I doing wrong? Have anyone been through this experience wrote? ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jao6pr/is_this_a_scam_im_having_trouble_with_meta/",
      "comments": [
        {
          "body": "yes its a scam and they probably just stole the account you just made lol",
          "score": 2
        }
      ]
    },
    {
      "title": "What does it mean? After Meta interview",
      "body": "2.5 weeks ago I had a full loop of Meta interviews. I felt that 2 of them went really well, but 2 others were 50/50. But when I asked recruiter, he said that feedback is quite ok so he will come back soon.\n\nDo you think my chances are ok or reject can still be highly probable?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1hg5e4o/what_does_it_mean_after_meta_interview/",
      "comments": []
    },
    {
      "title": "Non-technical job interview at Meta",
      "body": "There is not a lot of info about this on Reddit or across the internet so I figured I’d post here. Has anyone been through the interview process for a non-technical role at Meta? Can you offer any advice to prepare?",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/169452l/nontechnical_job_interview_at_meta/",
      "comments": [
        {
          "body": "I just finished a final interview a few days ago waiting to hear back. It’s a project management-ish role, but not quite.\nI had the initial phone screen, met with the hiring manager then had 3 other behavioral interviews.",
          "score": 2
        }
      ]
    },
    {
      "title": "Look at the baffling amount of job duties for this local SPCA marketing position vs. the pay...",
      "body": "This is just baffling. We are a mid-sized city. I edited out some names and redundancies, but read all the things they want, then look at the pay range. This is about 4 different degrees worth of things to maintain. \n\n-\n\n**Marketing Coordinator**\n\nThe primary responsibility of the Marketing Coordinator is to promote a positive public image for the SPCA and to advance the organizations’ missions through the use marketing strategies including print &amp; design, social media, web content management, video production, research &amp; analytics, and electronic communications. The Coordinator is responsible for development &amp; implementing marketing strategies.\n\nThe Coordinator also works to implement the comprehensive marketing and public relations plan. The Coordinator will collaborate with other key staff members to achieve brand consistency, coordination of messages, and the highest standards for internal and external communications. This position is responsible for coordinating organization-wide design, message, and content generation, including electronic and print, managing the organizations’ communications calendars, for such work as graphic design, form creation and creating design lay-out for annual reports, flyers and appeals.\n\n-\n\n**Print and Design**\n\n- Manage creation, production, and dissemination of printed publications for education, development and administrative purposes (newsletter, press releases, annual report, brochures, appeals, exhibit and event materials, internal and external form creation).\n- Support the development and creation of identity and collateral materials for major organization(s) initiatives.\n- Create and coordinate production schedules and maintain ongoing relationships with graphic designers, mail houses, printers and photographers.\n\n**Social and Digital Media**\n\n- Research audience preferences and discover current trends to create engaging text, image and video content and design posts to sustain readers’ curiosity and create buzz around the SPCA\n- Stay up-to-date with changes in all social platforms ensuring maximum effectiveness\n- **Monitor activity on social media, including nights, weekends and holidays.**\n- Create and manage blogging.\n- Facilitate online conversations with customers and respond to queries\n- Report on online reviews and feedback from customers and fans\n- Develop an optimal posting schedule, considering web traffic and customer engagement metrics\n- Oversee social media accounts’ layout\n- Suggest new ways to attract prospective adopters or donors\n\n**Web Content Management**\n\n- Post content to the websites – filling out fields in the content management system for page titles, meta descriptions, and image alt tags to optimize SEO for web pages, and coordinating the design team to implement new features\n- Ensure that all website information remains up-to-date, compliant, and on-brand\n- Propose changes to website to improve search rankings\n- Maintain a library of website images with documented usage permissions\n- Collaboratively manage and coordinate the creation and update of web content.\n- Collaborate with other staff to ensure ongoing improvement of websites including phased updates.\n- Manage creation and selection of photography for print and electronic communications including all animal photos and profiles on the SPCA websites.\n\n**Video Production**\n\n- Create, utilize and manage production of videos for the website\n- Coordinate all phases of video production\n\n**Research and Analytics**\n\n- Execute SEO audits, finding opportunities to improve organic visibility\n- Compile and present monthly report data on traffic and rankings, and make data-based recommendations for improving statistics\n- Serve as a subject matter expert on web analytics, remaining informed of related best practices and new applications\n- Monitor and report on Google Analytics metrics\n \n**Additional Responsibilities**\n\n- Implement and manage e-communications for various SPCA constituencies \n- Assist with the execution of special events.\n- Additional duties as assigned.\n\n**EDUCATIONAL OR OTHER REQUIREMENTS**\n\n- Bachelor's degree or equivalent.\n- Experience in communication, marketing and branding for a non-profit organization.\n- Excellent written and verbal skills\n- Creative thinking and problem solving skills.\n- Familiarity with PC based windows, Microsoft Office Suite, and Adobe design software.\n- Experience managing websites and social media.\n- Ability to work with volunteers in.\n- Demonstrated interest in animal welfare.\n- Must maintain a valid driver's license \n- Ability to work in (two different cities, 45 minutes apart)\n- **Ability to lift and move objects and animals weighing up to 50 pounds for short distances and humanely restrain an animal when necessary.**\n\nJob Type: Full-time\n\n**Salary: $12.00 to $14.00 /hour**\n\n---\n\nYes, that's right, for $12-14 an hour, they want you to do all the web design, SEO, graphic design, monitor social media 24/7, be blogging, address customer concerns, manage a image &amp; stock database, do monthly traffic report audits, be a videographer, be a photographer, solicit donors, and LIFT AND RESTRAIN ANIMALS. ",
      "subreddit": "jobs",
      "score": 389,
      "url": "https://reddit.com/r/jobs/comments/8zuppy/look_at_the_baffling_amount_of_job_duties_for/",
      "comments": [
        {
          "body": "Haha",
          "score": 262
        },
        {
          "body": "This was a rollercoaster for my estimated salary thought process. At first i was like, \"okay no so bad, 30-40k maybe,\" then moved to, \"wow okay, thats a lot, even 40k would be pretty low now, 50k would make sense\" then, \"jesus christ i know its going to be low but at this point id need 70-80k to work this job, your\" pratically running 4 or 5 departments.\"\n\nBefore scrolling to the final salary, i knew itd be laughable so with all the duties in mind, i guessed forty thousand a year, which imo would be laughable for the amount of job duties described.\n\nNope, $14 an hour max. What the fuck.",
          "score": 192
        },
        {
          "body": "And they will have to go through 3 group interviews to get the honor of working there.",
          "score": 121
        },
        {
          "body": " **Monitor activity on social media, including nights, weekends and holidays.** \n\nNice, 80 hr weeks i bet they expect.",
          "score": 114
        },
        {
          "body": "Can we get the listing ? I want to send them a message.  I manage salaries as a large part of work and someone needs to say something ",
          "score": 51
        },
        {
          "body": "That’s enough work for 3-4 people. ",
          "score": 50
        }
      ]
    },
    {
      "title": "RATE MY CV: The Job Market Is Killing Me",
      "body": "Hey everyone,\n\n  \nI'm in my last semester of masters studies in a highly decorated European university, and I have about 2.5 years of mar-com experience in sports and fintech industries, including a high-intensity tenure at a national basketball federation. With all that, I can't even land an interview for a cursed internship. This is much less than what I expected when I enrolled to my uni. \n\n  \nI'm tired of getting auto-rejected from jobs that I think I'm over qualified for. I didn't receive any valuable feedback on how to improve my odds in applications. For the last 3 weeks, I've been tailoring my CV for EACH application, this one is the latest internship CV variant I used for applying to Marketing &amp; Marketing Communications Internship at Philips. My Junior CV variant is simply education and experience flipped. \n\n  \nI'm spending so much time and effort on applications, and I think for some positions I should at least get an interview with my experience and educational background, but I had 2 interviews in the last 6 months (unbelievable to me). Any solid feedback or advise for my job search? I feel like my biggest challenge is being hired as a non-EU in the EU (I have permit for internships in Italy, I need sponsorship otherwise), but I know Turkish friends from my uni who secured positions. I am starting to feel depressed about this, so hearing your thoughts hopefully will shed some light in my search. I'm kinda running out of time to find something.\n\n  \nI'd like to thank everyone in advance!\n\n  \n10-9,5 letter size\n\nhttps://preview.redd.it/61j29spzbfbg1.jpg?width=1275&amp;format=pjpg&amp;auto=webp&amp;s=8c3c13bde9d539f956683d86c201007c6e8baa57\n\n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1q46fdn/rate_my_cv_the_job_market_is_killing_me/",
      "comments": [
        {
          "body": "Everything looks fine to me! Universita Bocconi is really good! I’m based in NYC and know about them! You most likely need internships at an agency before you try inhouse especially at a desirable company like Phillips! You can try, but will be more realistic to start at agency unless you get super lucky! Personally, I don’t know the companies of any of your previous experiences so if I interviewed you, it would basically be as if I was interviewing someone with no experience!",
          "score": 1
        }
      ]
    },
    {
      "title": "$1000+ of free work being asked in the interview!",
      "body": "I am just venting...I saw this and I can't NOT share it...\n\n",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1p7lmjc/1000_of_free_work_being_asked_in_the_interview/",
      "comments": []
    },
    {
      "title": "Really tough time getting any traction with interview calls",
      "body": "I have posted this elsewhere too but I am really struggling to get any interview calls anywhere, I have a slightly non standard resume(some gaps + very good education + a startup that is not too profitable). I do not even know how I can get an honest assessment of what types of jobs recruiters may be interested in talking to me for, and no idea how to proceed. I have just screenshotted my resume, considering that I am applying in ML,AI space which is comparatively still hot, what is so wrong with my resume/skillset that I cannot land a single interview call with scores of applications  \n\nhttps://preview.redd.it/7lxhsqm89kob1.jpg?width=2550&amp;format=pjpg&amp;auto=webp&amp;s=93f0211b7be42c218802f535880d286f17b9fcc7\n\nhttps://preview.redd.it/sn6bitm89kob1.jpg?width=2550&amp;format=pjpg&amp;auto=webp&amp;s=20b1bc46cc4673710ea9173cc7c994ee3572925b",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/16k04y3/really_tough_time_getting_any_traction_with/",
      "comments": [
        {
          "body": "I love the amount of education you’ve put into yourself, but I have say man I would consider taking a resume course too. Your GPA and courses are not relevant or necessary in this resume. Move Education below work history, Projects I would flush out more. It just screams book smart not business smart to me.",
          "score": 4
        },
        {
          "body": "You've been out of college since 2015.  Move  your education to the bottom and your experience to the top.   Many companies do not care about certificate programs, which are often proxied by middle-men, despite using the name of a notable university. \n\nYour work experience is very limited.   It needs to sell the impact of what you did in business terms, not just like a job description.  Consider that your resume won't be reviewed (at least initially) by people with a fraction of the qualifications you have, so they are not going to understand how to 'sell' you to the hiring manager without impact.",
          "score": 3
        },
        {
          "body": "First thing that stands out is you’re a CTO - are you applying for CTO positions? I would imagine you don’t have the depth of experience that most companies would need for a c level executive. But the fact that you have a company who does the same work is a conflict of interest. They don’t want to hire someone who is going to piggyback on their resources and data. And certainly not for a c level person. You said in your post that your startup is failing, so that’s a definite negative — you’re literally telling them “I don’t have the skills to do this job, please hire me”. If your company info is private, you should keep it private (at a minimum, redact it from your resume on this board) because any basic background check will uncover this. If it’s not blatantly on display anywhere then you can spin the idea of being a founder as being so passionate that you’ve dedicated time to a personal project that has been purchased by XX number of fashion brands and used by XXXX millions of people. There could be a great story here (if true) about your great ideas but you’re pausing the project for now, etc. \n\nI’d also recommend that you include *results* in your resume. You only mention duties here which doesn’t give enough information. “worked on software and provided engineering” is super vague and applies to 100% of candidates, what makes your experience special? How are you unique? Why should they hire YOU? Did you have a giant project breakthrough? Did you improve sales by 27%? Did you expedite delivery times? Did you handle a massive rollout across platforms that received a 10% uptake in 30 days?",
          "score": 2
        }
      ]
    },
    {
      "title": "So, Meta called me with a job opportunity...",
      "body": "I need to preface this by saying that I am based in Canada and have 12 years of marketing/copywriting experience supporting some of the top companies in the world. I am actively job hunting/interviewing.\n\nI received a call from Meta earlier this week about a \"Creative Writer\" opportunity.\n\nIntrigued, I asked, \"What does a Creative Writer at Meta even mean?\"\n\n\"Well, this would be for teaching our AI how to engage more creatively with users... Oh, and it pays $30 CAD per hour and you need to incorporate yourself.\"\n\nI would make the same money as a Starbucks barista. Possibly less after tips.\n\nGod help us all.",
      "subreddit": "jobs",
      "score": 123,
      "url": "https://reddit.com/r/jobs/comments/1l9yx21/so_meta_called_me_with_a_job_opportunity/",
      "comments": [
        {
          "body": "Starbucks baristas make 30 an hour??",
          "score": 64
        },
        {
          "body": "Red flag is you would need to incorporate yourself... Why this is a massive red flag, well because you would be a business once this happens they do not set the rates you do.  You would then be offering services to them and set your rate.  More than likely the real value of the work is $90 CAD/hour and not $30.  \n\nTalk with a business advisor so you don't get screwed here companies big and small are screwing over people that do not understand what they are missing out on.\n\nThis would have been more professional asking if you offered the service and what your rate would be.",
          "score": 16
        },
        {
          "body": "Teach the AI wrong, on purpose, as a joke.",
          "score": 2
        },
        {
          "body": "Good on you for rejecting quick. I read that and was offended on your behalf",
          "score": 2
        }
      ]
    },
    {
      "title": "27M, Stuck in small startup. 2-Page resume gets zero replies from big corps. Roast it please!",
      "body": "I started my degree in marketing after trying out different jobs because thats where I see myself in 30 years. \n\nHowever Im stuck in a startup with a boss that i cant vibe with.  I'm trying to get into a big multinational company to level up my career. My resume’s been optimized by ChatGPT, Claude and Grok for ATS, but I’m getting blue-ticked so bad from the big companies.\n\nOnly small local startups (&lt;50 staff, reporting to the founder) have tried to arrange for interviews with me.\n\nAlso those Google/Microsoft Coursera certs are a big L, no boost to interview rates.\n\nHere’s my CV... rip it apart. ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1n479w9/27m_stuck_in_small_startup_2page_resume_gets_zero/",
      "comments": [
        {
          "body": "You’re 27 and don’t have a degree, and you claim to be a “senior executive” and think you’ve accomplished enough to have a two page resume? No one will take that seriously.\n\nA “manager” should be bragging about team accomplishments. There’s no way to justify hiring a team of people if the team’s top accomplishments are using ad budget of only $18k and saving only $12k. That scale can’t even support one FTE, let alone a team of them. So either you’re a manager of a team that shouldn’t exist, or you don’t actually manage people so you’re not a manager.\n\nAlso remove pic, age, and nationality. Those are immediate HR red flags that will get you thrown out rather than deal with the hassle of proving they aren’t discriminating throughout the hiring process.",
          "score": 10
        },
        {
          "body": "Why is your nationality on here",
          "score": 10
        },
        {
          "body": "Condense it down to one page. Only people far into their careers need more than one page and even then it should only show the most *relevant* and *noteworthy* achievements.\n\nThere's too much obvious fluff. Are those industry standard certs that are required for jobs or just online certs you obtained in a few days? Which do you think employers find better?\n\nYour \"tech stack\" (that's not what that even means) is too broad and it makes it look like you have a very surface level understanding of them. This section should only include your *best* and *most relevant* skills, not every single technology you've ever touched. On a similar note, knowing things like Office and SharePoint are not professional skills, they are things every employee learns to use to do basic job functions. That's like saying you know how to dial a phone number. Yeah, you better. Leave them out.\n\n4-6 bullet points for each job experience. Pick your proudest achievements and the ones you can talk the most about if asked in an interview.\n\nLeave age, nationality, and you're photo out of the resume. They don't care about that, and legally they are not supposed to.\n\nDo not title it \"Job Application\". Your name should be the title. They already know what it is.\n\n\"Transferred from legal department\" is unnecessary. The company is the same, its obvious there was a job title switch.",
          "score": 2
        }
      ]
    },
    {
      "title": "[Meta] Is this subreddit for real?",
      "body": "I don't really like to make posts like this, but it's practically 95% of the interaction I run into around here these days, and it's getting a little stale.\n\nLet's say that OP has a serious physical illness. It's really bad and it impacts OP in his/her daily life, every day, for months or years. OP needs serious help. Let's say that this is a health-related sub - or a sub that claims to be health related. OP comes on here to ask for help, and only holistic healers respond. These healers offer pseudoscience with specious reasoning, urging OP to buy more healing crystals and eat more kale. A practicing medical professional, who specialize in OP's illness, also makes an input. The holistic healers respond in vitriol against the medical professional, make death threats, attack his character, all to make it seem like the medical professional doesn't know what he's talking about.\n\nThis is the caliber of discussion that's been happening here.\n\nAny Tom, Dick, and Harry that had to read a stack of resumes, or sit in on an interview panel, all of a sudden has intimate knowledge in Personnel Selection, Recruitment, Negotiation, Team Effectiveness, and even sometimes mental health and wellness...\n\nThis isn't just happening to me. There's been other professionals in the past who no longer contributes to this sub, who's met similar negativity. The Ph.D. who works in Psychometrics in hiring settings couldn't know what he's talking about, because some rando read this blog about how you should just fill out answers in the extreme. The Master's who is practicing in the field can't link articles to how poor interview methods may ruin hiring decisions, because it goes against the circlejerk of Resumes-Phone-Questions-Hire format. I can't talk about SJTs and Assessment Centers because job fillers think it's too expensive...without even knowing which specific exercises or what these methods even are.\n\nThere's no recourse for discourse. There's no allowance in knowledge share. It's either we buy into these outdated, ethically-questionable, legally indefensible practices, or we're a bunch of kooks. Because you experienced it when you hired, it must be how the entire industry works. If you haven't seen it, it's obviously made up or too ivory-tower for \"the real world\".\n\nRight, some of you are external recruiters with years of experience. Great, a couple of you are hiring managers with a Fortune 500 company...but if you're using old and terrible techniques, your \"expertise\" isn't really that valuable. It's also gone to some of your heads, and now I see some of you talking about personality traits and episodic depression as if you have deep, intimate knowledge in those subjects. It's all just adding noise to an already complex environment.\n\nIn no other subreddit would this level of silliness be tolerated. But here, articles titled \"X THINGS YOU NEED TO DO TO LAND THE JOB!\" are littered left and right, and at one point, a resume reviewer can host an AMA every month to talk about ANYTHING job-related. I even seem to have a standing order to have every one of my comments downvoted if I respond to u/van_the_recruiter...a **moderator** in this sub...\n\nMeanwhile, applicants are becoming more frustrated and confused about the job seeking process. They are desperate for help and REAL, ACCURATE information and insight about how personnel selection works. But all they're getting are speculations and anecdotal evidence from people who made cold calls to garner an applicant pool. I think that's a disgrace. ",
      "subreddit": "jobs",
      "score": 160,
      "url": "https://reddit.com/r/jobs/comments/3t8gjw/meta_is_this_subreddit_for_real/",
      "comments": [
        {
          "body": "Some reasons for this, I think:\n\n* This subreddit is both /currentjobs and /gethired.  Two different mindsets.\n\n* The get-hired process out in the real world has an incredible amount of noise, from applicants spraying resumes at jobs they're not remotely qualified for, to hiring managers not willing or able to put together a realistic job description, to inexperienced HR people who never really get good training.  That's just the tip of the iceberg -- there are many other examples of and reasons for dysfunctionality.  Because the process is so broken, people are comfortable giving advice without having much evidence or experience to back it up.\n\n* The process of getting hired is dramatically different in different industries and at different times in your career.  We're handling them all here.  For that matter, the reasoning for staying hired is dramatically different at different times in one's life.\n\n(Funny you would mention van_the_recruiter.  I didn't know Van was a moderator, but they were the very first person I \"friended\" on reddit a couple years ago, after years of just lurking.  They made me make that step.)",
          "score": 27
        },
        {
          "body": "I thought about this the other day, and frankly, kind of agree. I wish the moderators would do more to actually create new discussions, create a tagging structure, FAQ lists. Monthly AMAs with different types of jobs would be great (why you chose it, what you do, why you like it, how it's hard, how does the pay, etc). Weekly discussion threads could easily weed out so many of the \"fuck job searching\" type threads. There's a dozen things that could be done to help wear down the attitude that basically results from the same questions being repeated over and over again.",
          "score": 53
        },
        {
          "body": "I agree. I am also appalled at how often I see advice like, \"just stick out your horrible job where you are being abused and your boss is illegally paying you less than minimum wage. You don't want a blank spot on your resume.\" I also see a lot of, \"you need to gain some skills before you can get a living wage. Have you tried moving out into   the farthest end of North Dakota and working on an oil rig for two years?\"\n\nUtter nonesense in this subreddit on a regular basis.",
          "score": 45
        },
        {
          "body": "I'm very interested in starting to gather (and sticky?) actual data on many of the crucial questions that keep getting asked, so we can point to something definitive rather than anecdotal.",
          "score": 10
        },
        {
          "body": "I see your point.\n\nYou're saying that people are coming in with a legitimate concern, and may be walking away with god-knows-what for advice.\n\nAnd the stakes are high - no one should be basing life-altering decisions on a bunch of random internet comments.\n\nWhat if we were to adopt a user flair system?  Take me for example: I've been a consultant in Fortune 20 companies, have been a hiring manager for nearly 10 years, and have done mentoring and coaching for a number of those years.  I'm not a PhD, but I'm not sure you need one to give well-thought discussion and comments here. So for someone like me, if I had a \"Hiring Manager\" flair, that would let people know that I've actually been there.\n\nFor others, who for example, work in HR, they could have a \"HR\" flair.  \n\nI don't know the correct answer, but this is not a lost cause, and I believe there is a way to genuinely help the people who come here for answers.",
          "score": 10
        }
      ]
    },
    {
      "title": "Anyone from Meta HR here? Trying to verify a job offer is legit.",
      "body": "I got a very official looking email from someone saying they were hiring for the Reality Lab team. They asked me to make an appointment to meet the team for a pre-interview. \n\nThey asked me to share my availability via a website they linked me to. The page looks like a meta job listing page, complete with Meta logos, footers and menus, but the URL doesn’t say Meta.\n\nIn order to do anything on the site, they want me to log in with my Facebook. Which makes me suspicious. I have applied for jobs at Meta recently, so it’s possible this is real, but the URL and FB login makes me question it.\n\nSo, if anyone here works at Meta HR or on the Reality Labs team, would love to chat and confirm this is real.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1llkrmc/anyone_from_meta_hr_here_trying_to_verify_a_job/",
      "comments": [
        {
          "body": "Lmao, so instead of contacting Meta directly, you're posting on Reddit trying to contact someone from Meta? Where you cannot verify if they're telling the truth or lying? I cannot fathom why anyone with an ounce of intelligence would make this kind of post...",
          "score": 2
        },
        {
          "body": "how about the URL?  \n\nand logging in from facebook has some legitimacy to it, since they are facebook.  but the URL is kinda key here.",
          "score": 1
        }
      ]
    },
    {
      "title": "Reading daily unlocked a growth mindset I didn’t know I’d lost",
      "body": "I recently landed a FAANG offer - but what mattered more was how much I grew getting there.\n\n\n\nA year ago, I was coasting at a chill SDE job: decent pay, barely 5 hours of real work a day. It looked fine on paper, but I knew I wasn’t learning or pushing myself. Then the company decided to cut costs and outsourced the entire team to lower-cost regions - and just like that, I was out.\n\n\n\nSuddenly I had time, but no direction. I spent days scrolling TikTok, telling myself I’d get it together “tomorrow.” Eventually, I had to face a hard truth: I hadn’t grown in years. In college, I devoured books like Sapiens and Meditations. After graduation? I got tired, distracted, and self-growth just faded out. Meanwhile, some of my friends - people who saw the AI wave coming - were making big moves: launching side projects, pivoting early, landing FAANG offers. What set them apart? They had a growth mindset. They read daily, followed trends closely, and spotted new opportunities before the rest of us even noticed.\n\n\n\nSo I made one simple rule for myself: set aside a little time every day for self-growth - no scrolling, no noise, just learning. I started with one book. Then another. And honestly? After a few months, I felt like a different person. Reading didn’t just make me smarter - it changed how I think, focus, and carry myself. If you’re feeling stuck or all over the place like I was, you’re not broken. You probably just need better inputs. Reading became mine.\n\n\n\nAs someone with ADHD tendencies, reading daily wasn’t easy. My brain wanted dopamine, not paragraphs. I’d reread the same page five times. That’s why these tools helped - they made learning stick, even on days I couldn’t sit still. Here’s what worked for me:\n\n \\- The Almanack of Naval Ravikant by Eric Jorgenson: This one hit me hard. It made me rethink everything about how I use my time. Naval’s whole thing about not selling your time but building leverage is a game changer. I still go back to it when I need to reset my mindset.\n\n \\- The Laws of Human Nature by Robert Greene: This one really helped me understand people better - at work, in interviews, even in my own head. It’s dense but worth it. Every chapter made me pause and think.\n\n \\- Show Your Work by Austin Kleon: I used to be scared to share anything. This book gave me permission to just start. It’s super short, no fluff, and lowkey gave me the push to finally put myself out there. - Stolen Focus by Johann Hari: I thought I just had bad focus. Turns out the system is stacked against us. This book made me feel so seen - and also gave me practical ways to reclaim my attention.\n\n \\- The Charisma Myth by Olivia Fox Cabane: I genuinely thought charisma was something you were born with. This book proved me wrong and helped me feel way more confident in high-pressure conversations.\n\n \\- Lenny’s Newsletter: If you’re in tech or product, this is gold. Lenny (ex-Airbnb) shares real-world strategies, job market insights, and frameworks that make you 10x smarter. - BeFreed: Kept seeing people recommending this lately. It’s a smart reading + book summary app built for busy professionals who want to read daily but don’t have the time or energy. You choose the abstraction level you want for each book: 10-min skims, 40-min deep dives, 20-min fun podcasts, and flashcards. I usually listen to the fun mode while commuting or at the gym. Tested it on books I already read - deep dives hit \\~80% of the key ideas. I always recommend it to friends who always say they don’t have time to read. - Ash: A friend told me about this when I was completely burnt out. It’s like therapy-lite for work stress - daily check-ins, calming prompts, and tools that helped me feel like a person again. - The Tim Ferriss Show: One of the few podcasts that kept my attention even when I was running on empty. Every episode leaves you with at least one mindset shift or tool to try.\n\nTbh, I used to think reading was just for “smart” people. Now I see it as survival. It’s how you claw your way back when your mind’s falling apart.\n\nIf you’re burnt out, heartbroken, or just numb - don’t wait for motivation. Pick up any book that speaks to what you’re feeling. Let it rewire you. Let it remind you that people before you have already figured this stuff out.\n\nYou don’t need to figure everything out alone. You just need to start reading again. \n\n",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1kx81us/reading_daily_unlocked_a_growth_mindset_i_didnt/",
      "comments": [
        {
          "body": "Just wanted to say thanks for sharing the resources you included in your post. Didn’t know how much I needed your post until I made it all the way through. I’m pretty jaded by the horror that is the job market right now and am becoming apathetic about daily rejections of my applications, so while I don’t know if this will help me actually land a job but I like having useful ways to spend my time when the anxiety skyrockets and I start panicking about being unemployed and homeless 😕 How much time a day did you spend reading or learning before you realized it gad become a habit?",
          "score": 1
        },
        {
          "body": "Thanks for the recommendations, I'm in a similar position. I just got rejected by Meta without an interview and I just wanted to ask, how do you even get an interview at these places?",
          "score": 1
        }
      ]
    },
    {
      "title": "Best Career Coaching Service That Guarantees a Role? Willing to Pay If It Works",
      "body": "Hey all, I’m in need of **serious** career coaching that can actually **deliver results**. I started my career in **marketing**, then transitioned into **sales**, and now I’m looking to move back into marketing. I’ve worked at **Meta, Suzy, and Newell**, where I’ve built strategic partnerships, driven **multimillion-dollar revenue growth**, and led **go-to-market strategies**—but breaking back into marketing has been way harder than I expected.\n\nDespite my experience, I’ve had **zero luck landing interviews**—not even through **referrals**. I’ve optimized my resume, my LinkedIn is solid, and I’ve applied strategically, yet I’m hitting a wall.\n\nAt this point, I’m willing to **pay for a high-quality career coaching service**—but only if they can **guarantee** an offer within a set timeframe (within reason). I don’t need fluff; I need someone who can open doors and make it happen.\n\nAnyone have **legit recommendations**? Preferably a service that works with **senior-level professionals** and isn’t just resume tweaking and generic advice. Appreciate any leads!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1ilrce0/best_career_coaching_service_that_guarantees_a/",
      "comments": [
        {
          "body": "There's no such thing, but here's some free coaching: Stop bolding random words. It's distracting and makes you sound like a tool.",
          "score": 3
        },
        {
          "body": "If you're still looking for something like this you can look into reverse recruiting services - they give you career coaching and reverse recruiting where they apply for you. I believe Relentless, Findmyprofession, WeAreCareer are some agencies that do this. I've spoken to them before and used wearecareer before.\n\nNo service guarantees offers because getting an offer is our responsibility and our performance at the interview determines us getting an offer. But when I worked with wearecareer they helped shape up my profile and applied to relevant jobs which I approved and I ended up with 12 interviews and got a better offer than my previous role so it was super worth it.\n\nAny company that offers a job guarantee or tries to pressure you to pay on the call, don't walk, RUN. Good ones like wearecareer go through a qualifying and send you a plan to ensure alignment.\n\nThat said, it’s still important to do your own research and see which service aligns best with your goals and expectations.",
          "score": 2
        }
      ]
    },
    {
      "title": "Fake Meta Job Ads",
      "body": "Guys and Gals! These emails are phishing scams. Trust me, I know. I have been interviewed by Meta before. Often times, if they reach out to you, it’s via a recruiter. It won’t be an email. Also, when I was interviewed it was 5 rounds. The job stayed confidential until I met with the hiring manager and he told me he was from Meta. The company was based in Texas, not Menlo Park. And the role was Marketing Director over the Account Manager. They worked as a 3rd Party but it was a job with Meta. I wasn’t hired because they were looking more for a Finance person, not a Marketing Director. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jwpf4m/fake_meta_job_ads/",
      "comments": [
        {
          "body": "The schedule appointment part is where they ask you to log into your page. Don’t fall for it. It’s a scam. Your page will be taken.",
          "score": 1
        }
      ]
    },
    {
      "title": "Upcoming Application Security Engineer (Privacy Org) interview at meta please help",
      "body": "Hello, from my internet research I see that in the techical screen there would me 2 easy-medium leedcode questions. I don't have too much coding/leetcode experience. Can someone help me with the question/topics that are a minumum and how many should I practice at a minimum?\n\nI saw way too many videos of mock interview and speaking while you think is so hard. Any tips?\n\nWhat is the second technical screen like? What should I be concentrating on? Would there be source code reviews? Threat modeling?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1o5x90f/upcoming_application_security_engineer_privacy/",
      "comments": [
        {
          "body": "I’m in AppSec and had to cram LC for a Meta style screen recently. What helped was sticking to a tiny core: arrays and strings with hash maps, two pointers, basic BFS on grids, and sorting based problems. I did about 25 to 30 easy mediums, then reworked the ones I missed the next day while talking through each step. I ran short timed mocks with Beyz coding assistant using prompts from the IQB interview question bank to practice thinking out loud. Keep explanations tight, around 90 seconds per idea, and narrate intent before typing.\n\nFor the second screen, expect light secure code review and threat modeling basics STRIDE, simple DFDs, authz flows, input validation, secrets handling. You’ve got this.",
          "score": 2
        },
        {
          "body": "For coding:  \n1. Focus on covering as many problems as possible from [https://leetcode.com/company/facebook/?favoriteSlug=facebook-thirty-days](https://leetcode.com/company/facebook/?favoriteSlug=facebook-thirty-days) \\- They rarely ask Dynamic Programming so you can avoid. Spend more time on String and Array manipulation. Covering problems from that list would give you nice hands on experience.  \n2. For every coding problem you do, watch Minmer's videos to cover potential variants. He is the OG when it comes to Meta coding interviews.\n\nFor technical screen:  \nThat might be dependent on interviewer but majorly will try to cover basic security concepts. u/Various\\_Candidate325's suggestion is spot on. Focus on those concepts for sure.\n\nAll the best!!",
          "score": 1
        }
      ]
    },
    {
      "title": "Slowly starting to lose my hope",
      "body": "Hi everyone,\n\nI just wanted to put this out there because im slowly starting to lose my hope . I graduated with a degree in Mechanical Engineering this April (2025), and I’ve been seriously job hunting since December 2023, even before graduation. It’s been a grind.\n\nI’ve done everything I could think of: I’ve been to career fairs, reached out to people for referrals, worked on my resume until I couldn’t stand to look at it anymore, and practiced my interview skills until I felt like I actually got pretty good at it. I even managed to land interviews with some amazing companies like Tesla, Stellantis, AMD, and Meta.\n\nBut lately, it feels like nothing is working. Either I get ghosted after interviews, the position gets filled before I hear back, or I run into sponsorship issues. It’s draining. I see my peers landing good roles, some of them even at the companies I’ve interviewed with and I can’t help but wonder what’s wrong with me.\n\nI’m proud of how far I’ve come and how much I’ve grown, but at the same time, I feel like I’m losing hope. It’s hard to keep showing up every day, to keep writing cover letters and sending out applications when I don’t even know if anyone’s reading them.\n\nI guess I just needed to share this with people who might understand. If anyone’s been in the same place, or has any advice on how to keep going, I’d really appreciate it.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1l4ah21/slowly_starting_to_lose_my_hope/",
      "comments": []
    },
    {
      "title": "Went on bereavement leave over a year ago for 2 weeks and haven’t been able to find a job since",
      "body": "I guess I’m just very confused. I’m 29, have a great resume, college degree, have worked in fast food, grocery stores, bakeries, worked with at risk children, then got my degree and worked with kids with developmental disabilities in school and 1 on 1 at home, then I worked in the substance abuse industry and worked up from Graveyard shift treatment tech to intake director. Then that’s when my mom passed. Went back to that same company in a non management roll and couldn’t handle my grief plus helping other though the same issue my mom died from. Left the company in April 2024. \n\nThe kicker now is I’m newly homeless due to my ex partner of 7 years kicking me out (we had moldy apartments, I got sick, he didn’t, it ruined our relationship and gravely affected many other aspects of my life) and living in my car with no physical address. I have a PO Box, but I’m not sure if employers are seeing that as a red flag? Also, in my experience, it’s not uncommon for hiring managers to check someone’s Meta profile before hiring, and I have a go fund me on my profile that explains the nature of my disabilities and current struggle (Cptsd, autism, autoimmune, mold recovery) so I can eventually get out of homelessness. My fear is that hiring managers are reading that and denying an interview based on that rather than my professional experience. It feels discriminatory but I really don’t know. I do know legally they can’t deny due to a disability. Does anyone on here maybe know what could be going wrong? Im applying to every industry I have experience in. ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1jya1xh/went_on_bereavement_leave_over_a_year_ago_for_2/",
      "comments": [
        {
          "body": "Sorry for all you are going thru. \n\nBut…take all that down. It’s tragic you suffer from these things, but in the job market you are selling yourself. \n\nJust imagine if you were a car posted for sale and you list “leaks oil, two tires are bald, wipers streak, and transmission slips”. \n\nNone of these ultimately make a car not drivable, but surely don’t do anything to encourage the sale.\n\nLegally, you can’t be discriminated against but 99% of employers will see that and go “eek, could be a lot to take on”. Just reality. And virtually unprovable.",
          "score": 14
        },
        {
          "body": "I am sorry for what you’re going through.\n\nAsk a friend or relative if you can use their address, or there are ways to arrange a real street address for work.\n\nYour professional email address should be different from any email address you use for social media. Never use your full name for any social media. Sleep or delete unnecessary accounts.\n\nIf you have health issues with a doctor’s note, you may request interview Accommodations. Connect with your regional Labor office.",
          "score": 2
        }
      ]
    },
    {
      "title": "Seeking Advice on Improving My Data Role Job Search",
      "body": "Hello everyone,\n\nI recently graduated with a Master’s in Information Systems this May. Since last year, I’ve been actively pursuing full-time roles in Data Engineering, Data Analysis, and Business Analysis.\n\nI’ve had some interviews with an AI startup and Meta, but unfortunately, they didn’t result in an offer. Despite some referrals and applications, I’ve yet to see the response I was hoping for.\n\nWhile I have experience from internships and part-time roles, they weren’t with large companies. I’m wondering if anyone has advice on how to improve my job search in this competitive field, specifically in a short time framework, given my current situation.\n\nI would appreciate any insights on:\n\n* How to better stand out and increase response rates\n* Strategies for getting access to exclusive job opportunities (e.g., hidden job market)\n* Tips for improving my approach to landing a role in tech and data\n\nI understand if the answer is simply a matter of time, but I’d greatly appreciate any advice or insights you might have.\n\nThanks in advance!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jw6nuu/seeking_advice_on_improving_my_data_role_job/",
      "comments": [
        {
          "body": "&gt;Strategies for getting access to exclusive job opportunities (e.g., hidden job market)\n\nThis isn't a thing. Abandon this idea.\n\nI'm willing to bet you just don't have a lot of the skills that modern data positions require. If you post your resume here I can take a look.",
          "score": 2
        }
      ]
    },
    {
      "title": "Should I take full-time roll or temp part-time position?",
      "body": "Edited for formatting and to add more pros and cons\n\nI’m still waiting for a response from the full-time position at org 1 to see whether I get the job offer. I am confident that I will get it, but I likely won’t hear back until after the Thanksgiving holiday. I also got a temp job part time offer this morning at org 2. Assuming I get it, which should I pick? Also, how does I delay accepting the temp work so that I have more to wait to hear back from the full time job?\n\nWhat the roles have in common:\n\n-they’re both basically office assistant roles.\n\n-they’re more of a “I just need a job for the time being” career step while I try to figure out what I really want to do with my life.\n\n-I know that I “should” apply to roles that are more aligned with my goals, but I literally can’t qualify for them (no experience in them, picking the wrong major, etc.)\n\nPros of the full time job:\n\n-benefits and full time hours\n\n-great team (from what I gauged from the interview. Team seems very nice)\n\n-great work life balance (such as the org gives everyone the first Friday off and paid without dipping into accrued PTO)\n\n-remote work\n\n-out of the two roles, this role is technically closer aligned to my goals, even if it’s only marginally closer \n\n\n\nCons of the full time job:\n\n-even though I will earn more money in total just by \nworking full time, the calculated hourly rate will at most be $23 if I get the highest salary rate.\n\n-the organization is not as well known in that many people won’t know about it unless they in this specific industry.\n\n-I don’t want to end up “stuck” in this role. As much as they said there is room for career growth, you never know. There also so many unwritten rules (not even specific to this company, but in general) it makes career planning more difficult.\n\n\nPros of the temp part time job:\n\n-the hourly rate is at least $25\n\n-the organization is big enough for people to at least have heard about it before. It’s not huge like working at Meta, but still big.\n\n-it’s a part time job, so I’m hoping to take the extra time to study and do things that are more aligned with my career goals.\n\n-given it’s a temp job, I’ll continue applying to jobs and doing other stuff so that I can transition into my next step in my career after the role ends.\n\n\nCons of the temp part time job:\n\n-no benefits\n\n-the full time job still has decent flexibility, even if it’s full time hours\n\n-no job security, especially with how bad the job market has been\n\n-total pay will be noticeably less even though the hourly rate is higher (about 20 hours less a working week)\n\n-the team is nice for sure, but their “energy” isn’t really “there” when comparing to the other organization’s team (in other words, I think I would work better with the other org’s team when compared to this org’s).",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1h0qawj/should_i_take_fulltime_roll_or_temp_parttime/",
      "comments": [
        {
          "body": "&gt;I’m still waiting for a response from the full-time position at org 1 to see whether I get the job offer. I am confident that I will get it\n\nOkay...Unless you have a written job offer from a company, then *never* assume you will automatically get the job. \n \nSorry. I'm not trying to sound harsh. I've just seen too many people take the same attitude and have it backfire on them . \n\nThey assume that the interview went well, and they have the job \"locked in\". When in reality, there are 50 other applicants who are also interviewing. And they all also \"feel\" the interview went well. \n\nIve interviewed applicants in the past while working at a company. We were all told to treat the candidate nicely and make them feel welcome. Many of them got tours of the building, and I'm sure many of them felt like their had the job locked in. In reality we were just being polite. We never saw most of them again after the interview. \n\nYour best bet it to just apply to jobs, interview, and just move on to the next job application. Keep always moving forward. Don't wait on a single job application. Don't assume you will get any job unless you have an offer in writing. \n\n\nRegarding your part time job offer... \n\nDo you need money now? \n\nDo you have bills to pay?\n\nDo you have rent due? \n\nIf you turn this job down, can you wait 3 to 6 months while looking for another job? \n\nI don't know your situation, but these are questions you need to realistically ask yourself.",
          "score": 2
        }
      ]
    },
    {
      "title": "Meta Data Engineer Full Loop Interview",
      "body": "Hi,  \nI have a upcoming data engineer full loop interview with Meta. Based on the info provided by the recruiter the interview consists of three tech rounds of1 hour each made up of Product Sense, Data Modelling, SQL and Python followed by one 30 mins Ownership interview.  \nLooking for advise on how do I go about preparation:  \n1) How do I prepare for Product Sense and Data Modelling. Is it worth investing into [meetapro.com](http://meetapro.com) . Or can I jjust rely on chatgpt to help me prepare\n\n2) Is the SQL question based on the data mode that I just build or is it on a different schema that will be provided\n\n  \n3) Is the Python questions similar to what was asked during Phone screen. I read some posts about question might also be on File parsing, Streaming  \n  \nAny insights is greatly appreciated",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p0by71/meta_data_engineer_full_loop_interview/",
      "comments": [
        {
          "body": "Interview Query's [Meta interview guide](https://www.interviewquery.com/interview-guides/facebook-data-engineer) for data engineers may help you prepare you for the Product Sense rounds, with questions like conducting a user analysis journey and recommending UI changes for a Meta app/product. The site also has a Questions section for more sample questions for the role/company you're applying for.",
          "score": 1
        },
        {
          "body": "To prep for Meta’s DE loop, here’s what worked for me and quick answers to your questions. For Product Sense and Data Modeling, I used a simple flow: clarify goal and metric, list guardrails, propose 2 to 3 approaches with tradeoffs, then sketch an ERD and call out assumptions. SQL is usually on a provided schema, not the one you just built, though they might do light follow ups. Python felt similar to phone screen, plus some parsing and streaming style iterators, so practice file IO and generators. I did timed mocks with Beyz coding assistant using prompts from the IQB interview question bank, which helped tighten answers. Keep Product Sense responses around 90 seconds per chunk and narrate assumptions out loud. Good luck!",
          "score": 1
        },
        {
          "body": "For product sense on data eng interviews, they want to see how you think about data infrastructure supporting actual products - not just technical chops. I've seen candidates prep with chatgpt but honestly the meta-specific nuances matter a lot here. SQL is usually on a new schema they provide, not your data model from earlier. Python varies - could be file parsing, streaming, or similar to phone screen depending on the team. Since you're already in the loop, maybe worth doing a mock or two with someone who's been through meta DE interviews recently? We have a few meta data engineers on prepfully who coach these specific formats if you want targeted practice on the product sense part especially - just another alternative to meetapro, but you can chose that as well - your call! but generally speaking - mocks is usually a return investment, go for it",
          "score": 1
        },
        {
          "body": "Ping me. I can help you with the preparation",
          "score": 1
        },
        {
          "body": "For the Meta DE screening:\n\n* I prepped for SQL/Python using this blog: [100 Essential SQL &amp; Python Patterns](https://www.meetapro.com/blog/100-essential-sql-python-patterns-for-meta-data-engineer-screening-with-practice-problems-72)\n\nFor the onsite:\n\n* I focused on product sense and data Modelling around things like news feed, Uber carpool, streaming apps, and food delivery.\n* What really made a difference for me was doing multiple mock interviews with a coach on Meetapro. Getting targeted feedback and being challenged on my weak spots was a game changer — highly recommend it!\n   * Here’s the coach I worked with for mock interviews: [Meta DE Mock Interview &amp; Coaching](https://www.meetapro.com/mock-interview/meta-de-data-engineer-mock-interview-virtual-on-site-560129)\n   * I also found coach prep blogs super helpful: [Meetapro Coach Blogs](https://www.meetapro.com/provider/meetamate-31419/blogs)",
          "score": 1
        },
        {
          "body": "I scheduled a mock using meetapro.com. I took the mock session for my DE technical screen. The questions in the mock were quite similar and helpful. I would recommend scheduling this to get an extra edge over the preparation!",
          "score": 1
        },
        {
          "body": "Meetapro has some pretty solid mocks with reasonable prices. Worth giving them a try.",
          "score": 1
        },
        {
          "body": "Even I have my loop interviews soon. How much time did you take between your screening and the loop?",
          "score": 1
        },
        {
          "body": "Absolutely worth it to get some sessions from ‘meet a mate’. He is very good at prepping you especially the PS and DM portions. The ROI is great!",
          "score": 1
        }
      ]
    },
    {
      "title": "Meta link to schedule a call not working, is this a scam?",
      "body": "So I received this invite for a video call from Meta to interview for a Director of Marketing position. When I click “schedule a call” it takes me to a page to login with my Facebook. I don’t use Facebook so I made a profile. I type in my info and it just keeps loading and loading and loading, like for almost 20 minutes. Then it says password incorrect but then I go to my Facebook login and it goes right into my page. I’m confused. Like am I doing something wrong? The interview page is legit from my doing a little bit of digging. Additionally, I received a similar invite back in November and was able to login and set up a video interview but then after adding it to my Google calendar, there was no video link sent. What am I doing wrong? Have anyone been through this experience wrote? ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1jankse/meta_link_to_schedule_a_call_not_working_is_this/",
      "comments": []
    },
    {
      "title": "Finding it hard to standout in crowded job market? Me too",
      "body": "It’s a wild time to be job hunting right now. I got let go last November, and while it’s never been easier to apply for jobs, it’s never been harder to actually land an interview.\n\nWith just a few prompts, boom, customized resumes and cover letters tailored to every job posting. I figured my experience with ChatGPT, using it for complex use cases, would give me an edge. But it’s so easy now that everyone else is doing the exact same thing. It's hard to stand out\n\nDespite having 10+ years of experience in my field, I wasn’t even getting a callback, let alone an interview. \n\nThis approach might not work for everyone—it depends on your line of work—but if you’re in tech or a creative industry, I highly recommend going the extra mile. For me, that meant creating a personal marketing campaign I call #hiremehuman.\n\nThe campaign centers on a portfolio website that’s kind of a meta-commentary on the world we live in. A mix of irony and reality. I make fun of AI while fully using it in my daily life. \n\nSo, I put in a fair amount of effort in developing the concept, building the website, and creating marketing materials to go with it. The result is something I hope will inspire others to take their job hunt to the next level. Check out the site if you’re curious or looking for inspiration: [https://hiremehuman.com/](https://hiremehuman.com/).\n\nGood luck to everyone out there navigating the job market. I hope you find something that helps you stand out!\n\nP.S. The “movie” I’m working on for the campaign isn’t finished yet, but I’m planning to use it for cold outreach to recruiters on LinkedIn.\n\nP.P.S. I’ll update you on how this approach works once I start promoting it. For now, it’s still in the theory stage—but I’m optimistic!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1hyl9op/finding_it_hard_to_standout_in_crowded_job_market/",
      "comments": []
    },
    {
      "title": "Meta interviewer was a no-show, and cancelled my application because I complained about it.",
      "body": "TLDR:  \nThe recruiter no-showed our initial call  \nThen I complained  \nThen he terminated my application.\n\nI've interviewed with Meta several times, and I'm always shocked by exactly how careless and unprofessional they are.\n\n**8 months ago**\n\nThere were so many times during the interview process, when e.g. I'd wait for the meeting to start, the interviewer was a no-show so we'd have to reschedule. It was so irritating to me, because I'm currently employed and I kept having to block my calendar for interviews that never happened.\n\nI almost got the job, but they told me that I was \"L4 and we're only looking to hire L5\". They told me they'd reach out when they start hiring L4 again.\n\n**Now**\n\n8 months later, they did actually reach out to me like they said that they would. After we schedule the initial phone screening, the interviewer is a no-show. He ignores all of my emails during the time that the interview is supposed \"I'm waiting for the interview. When will you call me? Or is there a link?\"\n\n9-minutes into the interview he did actually call me, but I missed it because I was too focused on finding another way to contact him. I tried calling back, I tried sending emails, etc. no response aside from that one 9-minute late phone call.\n\nSo I couldn't help but call this out:\n\n&gt;For my sanity that this meeting was originally supposed to be right now, here's a screenshot (attached).\n\n&gt;This same scenario happened to me many times throughout the interview process 8 months ago. I would plan my day around the interview, no one would show up, and then it'd be rescheduled.\n\n&gt;This is very unprofessional of Meta. I feel that my time is being disrespected.\n\nHe responds a day later:\n\n&gt;Thanks for reaching out.\n\n&gt;I called you at our scheduled time but I did not get an answer.\n\n&gt;We will try this again on Monday, talk soon.\"I called you at our scheduled time but I did not get an answer.\"\n\nI respond:\n\n&gt;Here are my call logs (screenshot attached) you called 9-minutes late. I only missed it because I had assumed that you weren't calling me at that point, and I was focused on finding other means to contact you.\n\n&gt;I tried to contact you for 30 minutes straight, through phone calls + emails + even your LinkedIn. You did not reply to a single email, you didn't even leave a voice message, and you didn't attempt to call me back after I missed your very late &amp; unexpected call.\n\n&gt;\\+ Facebook Recruiting\n\n&gt;I am triggered by this, because I experienced this same level of unprofessional behavior 8 months ago. Meta does not care at all about my valuable time.\n\n&gt;I've heard from other engineers that their recruiting team has this reputation, and I'm sure that at least 9/10 candidates are too afraid to speak up about it.\n\nRather than apologize, the interviewer tries claiming that he made an effort to connect. When I send him my call logs and continue to point out the issues, he decides to terminate my application.\n\n&gt;Take care \\[name\\], I will be closing out your application.\n\nAnyways, I wouldn't be surprised if I was in a block list over this. I was so close to finally getting a big tech job, but I was stuck with a terrible recruiting team.",
      "subreddit": "interviews",
      "score": 88,
      "url": "https://reddit.com/r/interviews/comments/1j7up7i/meta_interviewer_was_a_noshow_and_cancelled_my/",
      "comments": [
        {
          "body": "\"Fool me once, shame on you; fool me twice, shame on me\"\n\nWhy do you want to work somewhere that treats you horribly before they even hire you? I could understand if you don't have a job and are desperate but it seems like you have options. I would take this as a sign that this isn't the right place for you and move on. If you continue seeking employment at Meta then don't get angry if they continue behaving exactly the way they've been behaving.",
          "score": 30
        },
        {
          "body": "I had a similar experience with Meta.\n\nHad a call with the recruiter which went well and was a fun chat. They told me they would put me through to the next round, which was an informal chat with the hiring manager, and if I passed that then they would give me a technical exercise to complete which I would have to present and discuss at a third interview, along with having a technical discussion.\n\nI dialled in to the meet and greet session and nobody turned up. Messaged the recruiter after 5 minutes to ask if there were any problems but nobody showed.\n\nThe next day I got a message saying that I hadn't shown up to the interview. I replied again asking them to rearrange, which they did.\n\nSo I dial in for the meet and greet and guess what? I'm met by quite a surly guy who asks me to present my technical work. I told him I hadn't been set anything and then he asks me a series of in depth technical questions based on the 'reading material' which I was never given.. After 45 minutes he said there was no time for questions and disconnected.\n\nAbsolutely appalling all round.",
          "score": 13
        },
        {
          "body": "Your reaction to their inconsideration could easily be a deal breaker. If I'm the hiring manager and the recruiter shows me your messages, I'm done. If that's how you react to an inconvenience, I can only imagine the drama that working with you daily entails. I've got 1600 too many applicants to be knowingly signing up for that.",
          "score": 9
        },
        {
          "body": "I know it won't give you any consolation, but you were not close to this job at all, if it was an initial screening call. A few percent of screened candidates will be successful through all stages. That you almost got a different job 8 months ago does not really matter, it is a different role now, different hiring manager, etc.",
          "score": 8
        },
        {
          "body": "Probably canceled your application for stating, \n\n\"I am triggered by this\"\n\nIt was a late interview start, and you tried to hunt them down like a crazy ex. You literally stalked the interviewer.....then complained.\n\nIf you're triggered by a late call, then you have bigger problems and they want nothing to do with that.",
          "score": 7
        },
        {
          "body": "I once told a recruiter who was interested in placing me somewhere that I wouldn’t work for Meta or Amazon. She never continued the conversation after that lol.\n\nI am doing just fine without groveling to bad companies. You will be too!",
          "score": 3
        },
        {
          "body": "Oh so you did everything right? What if the recruiter had an emergency or a family issue home ehich needed to be solved you make a huge drama and imagine he will say sorry and then reach out again and hire you? I would have done the same and rejected you. Not so much because you were frustrated,but the tone and that after the second frustration you kept going. What did you want to prove,screenshots,really? You say meta is very unprofessional,ok,then don't come work here if you don't like it. As easy at it is. The recruiter might be pissed of himself that things don't work because he has to cancel,rearange meetings,having a boss who is a dickhead and might have shouted to him a few minutes before your intervwiev,what do you know, so he doesn't need your bs and it won't change their recruiting process. Patience is king.it s hard,of course,especially if handled unprofessionaly,,but usually the ones who don t get emotional and don't let their anger go during the process will have a much higher chance to be employed.",
          "score": 3
        },
        {
          "body": "Why would you throw a hissy fit directly to the guy? If you’re gonna complain, why not complain to his manager or someone else at meta. I mean your move was insanely low IQ dude, how did you expect this to turn out?",
          "score": 6
        }
      ]
    },
    {
      "title": "Researcher interview at Meta",
      "body": "Hi all, \n\nI am very fortunate to have received an email from a Meta recruiter to schedule an initial phone screening for the researcher roles for one of their demographic and survey teams. I’ve found an abundance of interview prep and material for the data scientist roles, so I’m wondering if anyone has any insight into the interview process for researchers. \n\nFor context, and this may not be relevant for this post, I have a PhD in security (quantitative social science-esque degree) recently obtained this past July. My dissertation focuses on advanced spatiotemporal statistics for answering questions related to health care systems in countries experiencing active political violence. I don’t have much experience in survey design and analysis - I took 1 class 4 years ago at the start of my PhD and that’s really it. \n\nDoes anyone have insight into what or how I should prepare for the phone screening? Are coding interviews required for this role? Is the interview process the same for this role relative to a data scientist and data analyst? \n\nThank you 🙏 ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p3wp6h/researcher_interview_at_meta/",
      "comments": [
        {
          "body": "Congrats on the screening! Meta researcher interviews are usually way more focused on your research methodology and how you think through problems rather than hardcore coding like the DS roles\n\n  \nYour PhD background sounds super relevant even if it's not exactly survey work - they'll probably want to hear how you'd approach research questions and design studies. The phone screen will likely be behavioral stuff mixed with walking through your research experience\n\n  \nI'd brush up on basic survey methodology concepts and think about how your spatiotemporal stats work could translate to understanding user behavior or demographics. They love hearing about how you've dealt with messy real-world data\n\n  \nGood luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "Meta Product Analytics DS Interview – Recruiter Asking Team Preference &amp; Compensation Early",
      "body": "Hi all,\n\nI’m interviewing for a Meta Product Analytics Data Scientist role in the Bay Area. During my initial recruiter call, she mentioned I’d likely be IC5 based on my background, though depending on how the interviews go, it could also be IC4.\n\nI just finished the technical screening and got an email that I passed. Now I’m heading into the virtual onsite. In that same email, the recruiter asked me a few follow-up questions. Two of them stood out:\n\t•\tDo you have any team or product you’d like to work with, and why?\n\t•\tWhat’s your compensation expectation?\n\nThis got me thinking:\n\t•\tAren’t these conversations usually saved until after an offer?\n\t•\tIf I name specific teams now, could that limit me if there aren’t openings there?\n\t•\tAnd if I share compensation expectations now, does that box me in later when negotiating?\n\nWould love to hear from anyone who’s been through this process at Meta (or similar companies). Any insights or personal experiences would be really helpful.",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1nlorb4/meta_product_analytics_ds_interview_recruiter/",
      "comments": [
        {
          "body": "I think these are standard questions. It definitely could have implications on your salary negotiations later but it’s not unusual to discuss with the recruiter so they have an idea if your expectations are compatible with theirs.\n\nGood luck with the final loop! I just finished mine for prod DS last week and am waiting to hear my results. I know the bar is high, so trying not to get my hopes up even though things went pretty well during the interviews.",
          "score": 1
        },
        {
          "body": "I think this depends on the recruiter. I just entered team matching this past week, and neither of these questions started until my last call with my recruiter.",
          "score": 1
        },
        {
          "body": "Hey I'm interviewing for the same position, would you have any tips for the interview process?",
          "score": 1
        }
      ]
    },
    {
      "title": "Meta Interview Experience/Questions",
      "body": "I recently had the opportunity to interview with Meta this year, an experience I approached with a mix of apprehension and excitement. My initial phone screen went smoothly. The interviewer presented two LeetCode questions, one easy and one medium, which I was able to solve effectively. The next day, the recruiter reached out to inform me that I had been advanced to the full loop interview round.\n\nTo ensure I was thoroughly prepared, I requested a four-week window to get ready for the full loop. During this time, I dedicated myself to preparing for the coding, behavioral, and system design rounds. A strategy that proved particularly effective was consistently engaging with all three areas every day. This routine helped me mentally prepare to switch contexts quickly during the actual interviews.\n\nFour weeks later, I completed the full loop. I felt confident about the behavioral round and had a positive experience with the coding challenges. The coding rounds consisted of two medium-level questions each, similar in difficulty to the initial screen. I was able to find the optimal solution for all but one. For that specific problem, I initially explained a less-optimal O(n) solution, which the interviewer asked me to code. Because we had extra time, I was then able to think through and implement a more efficient O(log n) solution. A key takeaway from my coding rounds was the importance of verbally outlining my approach and getting the interviewer's buy-in before beginning to write code. The system design round also went well, as I felt comfortable with the question I was asked.\n\nFour days later, I received a call from the recruiter. They explained that while my feedback was positive overall, the Hiring Committee had received mixed signals on my system design performance and requested a follow-up interview. In hindsight, I can see a few mistakes I made that likely contributed to this. The follow-up system design interview, held the following Monday, went even more smoothly. The interviewer was excellent and approached the session as a collaborative problem-solving exercise, which made it feel like working alongside a colleague.\n\nNow, I am in the final waiting period for the recruiter to get back to me with the final decision. It has been three days since that last interview.\n\nQuestions:  \n1. What is Meta's interview timeline like?   \n2. How long do they take to respond back?  \n3. I am thinking ahead, but if they extend an offer, do they share the comp package before or after team matching?\n\n\nUpdate 09/16: They liked me and I am moving in the right direction with Meta. ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1ndwnd1/meta_interview_experiencequestions/",
      "comments": [
        {
          "body": "Meta usually takes 1-2 weeks post-interview to give feedback, but it can vary. If you're anxious, a polite follow-up with the recruiter is ok. Typically, comp details are shared before team matching, so you know what you're considering if they extend an offer.",
          "score": 1
        },
        {
          "body": " Hello even I got an follow up interview with meta for system design but it’s in person for me can I dm you if you don’t mind",
          "score": 1
        },
        {
          "body": "It just feels like my experience, I'm yet to hear back from candidate review :)",
          "score": 1
        }
      ]
    },
    {
      "title": "Are Hello Interview meta tagged questions out of date?",
      "body": "I have purchased hello interview for system designing but I found that it has tagged questions like meta ,google etc. that are marked as recent and popular.\n\nWanted to understand from others who have used it whether it is relevant or is leetcode premium the only way to get up to date questions ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oljtn2/are_hello_interview_meta_tagged_questions_out_of/",
      "comments": []
    },
    {
      "title": "Meta/Facebook full loop interview for non tech role",
      "body": "Anyone here done a full loop interview at META/Facebook for a non tech role? It’s a series of 4 x 45min interview for a sales role. \n\nHere are the interview segments:\n\n1. Operating at Meta \n2. Domain &amp; Business Knowledge \n3. Problem Solving \n4. Working with others \n\n\nHow do I prepare for this and what type of questions can I expect? ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nu6xo0/metafacebook_full_loop_interview_for_non_tech_role/",
      "comments": [
        {
          "body": "For Operating at Meta, be ready with tight, metric-backed stories that show speed, tradeoffs, and direct communication - moving fast, cutting scope, being data-first, and owning mistakes in the “year of efficiency” mindset. For Domain &amp; Business Knowledge, show you understand the ads ecosystem: how an auction works, what iOS14/ATT did to measurement, incrementality and lift vs attribution, LTV vs CAC, how Advantage+ and CAPI fit into performance workflows, and how you’d tailor strategy by vertical. Expect questions like “Explain Meta’s auction to a CMO,” “Why would ROAS fall after a creative refresh,” or “How would you improve measurement for a privacy-constrained advertiser.” Read Meta for Business docs on ad delivery and measurement, and be ready to translate complexity into a client-friendly plan.\n\nProblem Solving will feel like a lightweight case - clarify the objective, state a hypothesis, structure the drivers, quantify impact, and propose a test plan with success metrics and risks. A classic prompt is “Your ecommerce client’s CAC is up 30% QoQ on Meta - what’s your diagnosis and plan?” Think auction dynamics, conversion lag, signal loss, creative fatigue, budget distribution, and experiment design. Working with others focuses on influence without authority and cross-functional friction: have stories where you pushed back on a client or internal partner, aligned Legal/Policy/Product, navigated conflict, and landed a measurable result. Keep answers under two minutes, use STAR, lead with the headline result, ask clarifying questions, and end each story with what changed because of you. If you want a quiet place to practice Meta-style cases and behavioral drills with real-time AI coaching to navigate tricky interview questions and ace job interviews, try [interviews.chat](http://interviews.chat) \\- I’m on the team that built it.",
          "score": 1
        },
        {
          "body": "Hey, how did your interview go? Mind if I DM you?",
          "score": 1
        }
      ]
    },
    {
      "title": "Seeking guidance: Interview for the Solutions Architect role at Meta",
      "body": "For people who want to avoid a long para, please jump to last para! \n\nI applied for the above role through meta careers and a month later I get an email that my profile is shortlisted for the role. So I connected with the HR over a 30 minute call and then she scheduled a 45 min tech overview interview. The interviewer asked me tech questions like “tell me a time where you worked on designing or updating a product/solutions, what is a difference between a client environment and server environment,” etc. and then hopped on to a coding round, now this is where it gets tough. I have an engineering background, I currently work as a solutions consultant where I am owning end to end solution creation to deployment but I don’t know coding, never done it nor am I interested to learn it. I know basic coding like Js or python which I learnt because it was required for my current job but I don’t write new codes, just help clients integrate solutions or create scripts to run APIs in batch using ChatGPT. \n\nSo coming back to the round, he asked me to design a solution that would help us analyse the actual sales for an e-commerce company running ads through meta platforms. I somehow tackled this question by skipping the code and running a flow chart. Fast forward, I passed this round. \n\nNow I have a 3 hour round of 4 different sections of 45 mins each. The very first round is a coding round using SQL, never used SQL in my jobs so far. The rest 3 looks okay to me I.e. Project retrospective, Hiring Manager and Collaboration. \n\nGuidance needed: 1. what kind of questions/cases do these guys ask for SQL ? \n2. How do I prep? P.s. Already started the YT channels, finds the basic ones SQL comparatively easy but I’m sure they won’t be asking me basic questions. \n3. Anyone who has gone through these rounds, please share feedback! \n \nThanks in advance!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1nki8bj/seeking_guidance_interview_for_the_solutions/",
      "comments": [
        {
          "body": "Meta's Solutions Architect SQL round typically focuses on complex data analysis scenarios that mirror real business problems they face daily. They'll likely ask you to write queries involving multiple joins, window functions, subqueries, and aggregations to solve problems like analyzing ad performance metrics, user engagement patterns, or revenue attribution across different touchpoints. The questions often start with a business scenario and require you to design the database schema, then write increasingly complex queries to extract insights. Since you've made it this far without strong coding skills, they clearly see potential in your solution design thinking, but the SQL round is usually a hard gate that requires actual query writing, not just conceptual understanding.\n\nYour best bet is to focus intensively on intermediate SQL concepts like CTEs, window functions (ROW\\_NUMBER, RANK, LAG/LEAD), and complex joins, then practice with datasets similar to what an e-commerce or advertising platform would use. Try platforms like HackerRank or LeetCode's database section, and focus specifically on problems involving user behavior analysis, funnel metrics, and time-series data since those align with Meta's business model. The other rounds should play to your strengths - the project retrospective will focus on your solution design experience, and the collaboration round typically involves walking through how you'd work with different stakeholders on a complex technical project. I actually work on [AI for interview practice](http://interviews.chat), which can help you improve your thought process for those behavioral and system design questions, especially when you need to explain complex technical concepts to different audiences.",
          "score": 2
        }
      ]
    },
    {
      "title": "Help/Suggestions/Advice needed for Meta’a Full loop interview for non tech Design specialist role",
      "body": "Hey everyone,\n\nI’ve just been invited to the next stage of an interview process (a full-loop), and I would love to get some advice from this community on how best to prepare.\n\nHere’s what I’ll be interviewed on, four back-to-back 30-minute conversations:\n\t1.\tMCA – Collaboration / Working with others\n\t2.\tProject Management &amp; Execution\n\t3.\tCritical Thinking / Problem Solving\n\t4.\tCustomer Centricity\n\nI have about a week to prep, and I really want to make sure I go in feeling confident and structured with my responses. If anyone here has gone through a similar format before, I’d love to hear:\n\t•\tWhat kind of questions I should expect for each section\n\t•\tAny frameworks that help with structuring responses (beyond STAR/CAR if there are better ones)\n\t•\tExamples of strong stories people typically use for these areas\n\t•\tCommon mistakes candidates make in these interviews\n\t•\tRecommended YouTube channels, articles, or other resources to sharpen thinking for these topics\n\nEven a few “wish I had known this before my interview” tips would be super helpful.\n\nThanks in advance to anyone who chimes in, I really appreciate the support!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ohqvnv/helpsuggestionsadvice_needed_for_metaa_full_loop/",
      "comments": [
        {
          "body": "How did your interview go?",
          "score": 1
        },
        {
          "body": "All the best, I hope you get the good news! Can I DM you? I have a meta interview coming up",
          "score": 1
        },
        {
          "body": "How did it go? Did you hear back?",
          "score": 1
        }
      ]
    },
    {
      "title": "Odd experience with a META interview",
      "body": "HR recruiter reached out to me asking if interested in a role. I said sure. Over period of 6 months I SPOKE to different directors. Then one had me talk with one of their architects. I spoke with her, and had a good conversation but found her knowledge (and questions) to be lacking some depth. I brushed it off thinking the deeper technical interviews would happen later. 4 days later I get the \"we decided to go with someone else\" but oddly it also said do not apply for a similar position for 1 year. \n\nSomeone told me this is how META fills other h1b roles by doing \"filler\" interviews. They also said I probably dodged a bullet with that group.\n\nIs this typical at META?\n\n\n\n\n\n",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1olyoug/odd_experience_with_a_meta_interview/",
      "comments": [
        {
          "body": "I had a Meta virtual interview (behavioral and technical) that felt unusually chaotic. The interviewer joined about five minutes late, stepped away briefly midway through, and the overall pace felt hectic. Some questions were odd: how I had the opportunity to work on a specific extracurricular project, as if the interviewer wanted to know for themselves how to get these opportunities. They also mentioned personal interest in pursuing my academic degree after reviewing my resume. The interview ultimately ran 10–15 minutes over the scheduled time.\n\nI’m trying to understand whether this was part of Meta’s Jedi behavioral assessment approach or unintentional. Was it a social experiment? \n\nHas anyone had a similar experience?",
          "score": 2
        },
        {
          "body": "This is typical of most tech companies..most if not all h1bs folks 1. Stick longer due to headaches involved in h1b transfer or lack of mobility due to visa transfers 2. compromise with pay which is much lesser than prevailing wages ( in other words work more due to stress of lay off with less pay and stick to the company due to lack of options). It’s no brainer for tech companies to prefer them and thus these filler interviews are played to show case “lack of talent”.. I am not saying all but most cases.. it’s no brainer that this play out benefits big tech in every angle",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewing for Meta's Data Scientist, Product Analyst role (Full Loop Interviews)",
      "body": "Hi, I am interviewing for Meta's Data Scientist, Product Analyst role. I cleared the first round (Technical Screen), now the full loop round will test on the below-\n\n* Analytical Execution\n* Analytical Reasoning\n* Technical Skills\n* Behavioral\n\nCan someone please share their interview experience and resources to prepare for these topics?\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nto6rb/interviewing_for_metas_data_scientist_product/",
      "comments": [
        {
          "body": "[removed]",
          "score": 3
        },
        {
          "body": "The analytical execution round will likely throw you curveball scenarios about user behavior, A/B testing design, or metric trade-offs where there's no single right answer - they want to see how you structure problems, make assumptions explicit, and communicate your reasoning clearly even when you're unsure.\n\nThe behavioral component is where many strong technical candidates stumble because Meta heavily weights culture fit and leadership principles like \"Move Fast\" and \"Be Bold.\" They'll probe situations where you've had to make decisions with incomplete data, disagree with stakeholders, or drive impact beyond your immediate role. Your best preparation involves practicing the STAR method for behavioral stories and doing tons of product case studies where you analyze real Meta products and metrics - think about why Instagram shows certain engagement metrics or how Facebook might measure the success of a new feature.\n\nI actually built [AI for interviews](http://interviews.chat) specifically to help candidates navigate these kinds of complex interview questions and practice articulating their thought process under pressure.",
          "score": 2
        },
        {
          "body": "I like how every answer to this is a bot pushing their ai \"they developed\"",
          "score": 1
        }
      ]
    },
    {
      "title": "Meta Data Engineer, Analytics onsite interview",
      "body": "I had my onsite interview last week. Can someone tell me how the decision is made?\nI solved all SQL and python questions. Also for product sense and data modeling section did everything.\n\nCan someone help me on this? Should I be hopeful for an offer ?",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1kpplzh/meta_data_engineer_analytics_onsite_interview/",
      "comments": [
        {
          "body": "Op, can I dm you?",
          "score": 2
        },
        {
          "body": "I've been in your shoes before, and I can tell you that it's completely normal to feel uncertain about the decision-making process. From my understanding, Meta typically weighs a combination of factors when deciding on candidates, including their technical skills (which it sounds like you nailed with those SQL and Python questions!), as well as their fit with the company culture and product sense.\n\nWhile it's impossible to know for sure how your interview went down, it sounds like you aced both the technical and data modeling sections. One thing that helped me when I was in a similar spot was using an AI tool that listens to common interview questions and suggests responses in real time - it made me feel more prepared and confident during my own interviews.\n\nIf you're interested, I can share this tool with you as well. In any case, try not to stress too much about the decision-making process - just focus on what you can control, which is your own growth and preparation for future opportunities. Keep working hard and believing in yourself!",
          "score": 1
        },
        {
          "body": "Heyy hi, could you share more details on the kind of questions asked in the interview? What was the approach you took? Is there any framework you followed? Also, what was SQL and Python like?",
          "score": 1
        },
        {
          "body": "Did you get an offer? If so , how many days did it take for a decision?",
          "score": 1
        },
        {
          "body": "Hey OP, how long after the interview did you hear back? Thanks!",
          "score": 1
        },
        {
          "body": "hey, I have tech screening call with recruiter she told me she'll ask about sql and python in like 15 minute call so what do I expect? it's my fist time giving such a screening call with recruiter, could you please tell me? thanks",
          "score": 1
        },
        {
          "body": "are you open to share more information about the technical interview? got a call for similar role and have my interview in a week - same 5 sql and 5 python but Phone Interview",
          "score": 1
        },
        {
          "body": "Hello is someone interested to do a mock interview for tech onsite interview ? I can do the same",
          "score": 1
        },
        {
          "body": "For the Meta DE screening:\n\n* I prepped for SQL/Python using this blog: [100 Essential SQL &amp; Python Patterns](https://www.meetapro.com/blog/100-essential-sql-python-patterns-for-meta-data-engineer-screening-with-practice-problems-72). Prepare for Library Schema and took mockinterviews from this coach\n\nFor the onsite:\n\n* I focused on product sense and data Modelling around things like news feed, Uber carpool, streaming apps, and food delivery, Car rental, friend requests.\n* What really made a difference for me was doing multiple mock interviews with a coach on Meetapro. Getting targeted feedback and being challenged on my weak spots was a game changer — highly recommend it!\n   * Here’s the coach I worked with for mock interviews: [Meta DE Mock Interview &amp; Coaching](https://www.meetapro.com/mock-interview/meta-de-data-engineer-mock-interview-virtual-on-site-560129)\n   * I also found coach prep blogs super helpful: [Meetapro Coach Blogs](https://www.meetapro.com/provider/meetamate-31419/blogs)",
          "score": 1
        }
      ]
    },
    {
      "title": "Meta's Data Scientist, Product Analyst role (Full Loop Interviews) guidance needed!",
      "body": "Hi, can someone please tell me the types of questions asked and relevant resources to prepare for the analytical reasoning and analytical execution rounds of interviews at Meta for the Data Scientist, Product Analytics role.\n\nThanks.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oij6q8/metas_data_scientist_product_analyst_role_full/",
      "comments": []
    },
    {
      "title": "Meta Project Manager, PDO interview - full loop (Seeking Help)",
      "body": "Hey everyone,\n\nI’ve got my full-loop interview coming up for the Project Manager, Product Data Operations role at Meta, but my recruiter hasn’t given me much guidance.\n\nFrom what I’ve gathered online and through a few chats, Meta often gives candidates a general idea of the types of questions they might face—but I’m still a bit in the dark.\n\nIf anyone here has gone through a similar loop or can share insights on what kind of questions I should prep for under these areas, I’d be super grateful:\n\n1. Project Management\n\n2. Cross-functional collaboration / leadership (XFN)\n\n3. Critical Thinking\n\n\n\nHere’s the JD for context:\nhttps://www.linkedin.com/jobs/view/4254873312 \n\nThanks in advance! ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1midc43/meta_project_manager_pdo_interview_full_loop/",
      "comments": [
        {
          "body": "For the project management and cross-functional stuff, I found it really helpful to practice articulating how I'd handled past projects and team dynamics. Like, having a story ready for those \"tell me about a time when...\" questions. Sketching out examples on paper first kinda solidified things in my head.\n\nI also lowkey benefited from simulating the pressure a bit. Used the Beyz interview helper, just ran through practice questions solo. Wasn't quite the same as the real deal, but it did ease some jitters. And browsing through [IQB](https://interviewquestionbank.com) might give you a clearer picture of the kind of questions you could face—it’s oddly reassuring. Good luck with Meta!",
          "score": 1
        },
        {
          "body": "I work in Operations at Prepfully and we've got Meta PMs and TPMs who coach for these exact rounds - the project management round focuses heavily on dependency navigation, risk mitigation, and stakeholder management scenarios. For XFN/leadership expect behavioral questions around conflict resolution and influencing without authority, while critical thinking usually involves data-driven problem solving and prioritization frameworks.",
          "score": 1
        },
        {
          "body": "Good luck! I didn't get past the hiring manager round back in July :(",
          "score": 1
        },
        {
          "body": "How was the interview, any tips can help brother prepare better?",
          "score": 1
        },
        {
          "body": "Hi guys! For the background control for a position within compliance (Meta Europe) - are they calling my references and checking previous employment dates and salary? What kind of employment verifications are they doing. I need to know how accurate I need to be in my CV with dates…",
          "score": 1
        },
        {
          "body": "Did you end up getting the job? A similar role opened up at Meta in their PDO team, and I would like to seek your guidance in pursuing the role further. May I dm you?",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone interviewed for Support Design Specialist at Meta? Looking for tips/advice 🙌",
      "body": "Hey all!\n\nI’ve got an interview coming up for the Support Design Specialist role at Meta and I’m trying to get a feel for what to expect. If anyone has gone through the process (or knows someone who has), I’d really appreciate any insights questions they asked, what they seemed to care about most, anything you wish you knew going in, etc.\n\nEven general tips about how the role works day-to-day or what skills they focus on would be super helpful. I’m seeing mixed info online so I figured I’d ask real humans instead 😅\n\nDrop literally anything sample questions, prep advice, red flags, “I wish I practiced THIS more,” etc.\n\nThanks in advance! 🙏",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o9cnyb/anyone_interviewed_for_support_design_specialist/",
      "comments": []
    },
    {
      "title": "Meta Interview Experience (Infra, aiming IC4)",
      "body": "**Recruiter Call**\n\nWalked me through the process, shared immigration details, and sent the tech screen scheduling link.\n\n**Tech Screen (1 round, 45 mins)**\n\n\t•\tTwo coding questions straight away.\n\n\t•\tRecently popular LeetCode (last \\~3 months): trees and sliding window.\n\n\t•\tSolved and discussed optimizations; mentioned I’d use DP for a follow-up and that was fine.\n\n**Onsite**\n\n\t•\tCoding Round 1 (45 mins): Two problems. Backtracking + an optimization follow-up where I outlined a DP approach.\n\n\t•\tCoding Round 2 (45 mins): Two problems. Trees and heaps. I explained one heap approach but coded it a bit differently — that mismatch hurt and triggered a follow-up round.\n\n\t•\tSystem Design (45 mins): Infra/search flavored. Used the Hello Interview framework to stay structured. Most follow-ups were about tech choices and sharding. Didn’t go super deep on non-functionals but felt IC4-appropriate.\n\n\t•\tBehavioral: Heavy on Meta values. I prepped scenarios around teamwork, feedback, continuous learning, and delivery.\n\n\n\n**Follow-up (Onsite) — Coding (45 mins)**\n\n\t•\tTwo problems: graph and two-pointer.\n\n\t•\tStill recent LeetCode-style. Designed so you can finish within the time.\n\n\n\n**Takeaways**\n\n\t•\tEvery coding round jumped straight in — no fluff, no trickery.\n\n\t•\tMost questions tracked closely to the last \\~3 months on LeetCode.\n\n\t•\tI was definitely nervous in the later rounds, but overall I enjoyed the process.\n\n\n\nAll the best!!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nzac7g/meta_interview_experience_infra_aiming_ic4/",
      "comments": [
        {
          "body": "Thanks for sharing your experience! Keeping up with recent problem trends and practicing timed rounds seems key. Staying calm under pressure clearly helps too. Good luck with your next steps!",
          "score": 1
        }
      ]
    },
    {
      "title": "Meta Product Analyst Interview Experience?",
      "body": "Hey folks,\n\nI just got contacted by a recruiter at Meta for the Product Analyst role on the Product Quality &amp; Experience team, and I'm trying to get a better sense of what the interview process is like.\n\nIf anyone’s been through it (or something similar at Meta), I’d love to hear how it went — like what kind of questions came up, how many rounds, what to expect overall, and what they seemed to really care about.\n\nAny tips or insights would be super helpful. Thanks in advance!",
      "subreddit": "interviews",
      "score": 7,
      "url": "https://reddit.com/r/interviews/comments/1l56uae/meta_product_analyst_interview_experience/",
      "comments": [
        {
          "body": "You're looking at typically 4-5 rounds including a phone screen, technical case study, product sense interview, and final onsite rounds. They'll throw SQL problems at you that go beyond basic queries, expect you to design experiments and interpret A/B test results, and ask you to break down complex product metrics scenarios. The Product Quality &amp; Experience team specifically cares about how you think about user experience through data, so be ready to discuss how you'd measure product health, identify quality issues, and translate messy real-world data into actionable insights.\n\nThe interviewers will push you on your reasoning and want to see how you handle ambiguity since product problems rarely have clean answers. They're looking for candidates who can balance being data-driven with understanding the human side of products, especially given the team focus on user experience. Practice common [Meta Product Analyst interview questions](https://www.interviews.chat/questions/meta-product-analyst) around metric design, root cause analysis, and experiment interpretation, but also think deeply about how you'd approach quality measurement for products with billions of users. The bar is high, but if you can demonstrate strong analytical thinking combined with genuine curiosity about how users interact with products, you'll stand out from candidates who only focus on the technical side.",
          "score": 2
        },
        {
          "body": "Hello, I did too! When is you technical screening round?",
          "score": 1
        },
        {
          "body": "I have Meta full loop \"Analytics\" and \"Technical\" rounds coming up soooon for QA Manager position. Any idea what kind of  \"Analytical\" and \"Technical\" questions they could ask from me as QA Manager?",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Culture fit interview at Meta",
      "body": "Had three rounds of interviews with Meta. Did not get the role, but the recruiter called and said he marketed me for a similar role on a sister team. He scheduled me for a 30 minute culture fit interview next week. Anyone have any idea what I should expect? \n\nI’m not the most charismatic person so I’m worried I won’t do well when the focus is on culture fit. I get along with everyone, I’m just far from the life of the party, so I don’t know how well I’ll do in an interview that’s focused on them deciding if they want to work with me instead of past projects (and the like). \n\nAny and all advice is appreciated!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n44ai5/culture_fit_interview_at_meta/",
      "comments": [
        {
          "body": "Culture fit interviews aren't about being the most charismatic person in the room or being the life of the party. Meta is looking for people who align with their values like \"Move Fast,\" \"Be Bold,\" and \"Focus on Impact.\" They want to understand how you collaborate, handle feedback, approach problems, and contribute to team dynamics in authentic ways.\n\nYour concern about not being charismatic is misplaced because culture fit is really about demonstrating that you're someone people can work with effectively, not someone who needs to entertain them. Think about specific examples where you've helped teammates, navigated disagreements constructively, or adapted to change. Be genuine about your working style and how you contribute to team success - maybe you're the person who asks thoughtful questions, helps others think through problems, or brings calm focus to chaotic situations. Those qualities are just as valuable as being outgoing.\n\nI'm on the team that built [interview AI assistant](http://interviews.chat), and it's designed exactly for situations like this where you need to navigate tricky culture fit questions and present your authentic self in the best light during interviews.",
          "score": 1
        }
      ]
    },
    {
      "title": "Meta (FB) Data Engineer technical screen interview - python question",
      "body": "Hi\n\nI have an interview at meta soon.   \nI was told that the python questions will not be leetcode style, but just \"regular\" python data structures (list, dict, tuple, set).   \nWhat about data structures such as \\`heap\\`, \\`collections.defaultdict\\`, \\`collections.counter\\`, \\`bisect\\` (binary search on sorted list) - stuff like that. Did anyone saw these in an interview?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mbp9yc/meta_fb_data_engineer_technical_screen_interview/",
      "comments": [
        {
          "body": "Meta's technical screens for data engineering roles typically focus on practical Python usage rather than obscure library functions, so you're unlikely to see heavy emphasis on specialized modules like bisect or heapq. That said, collections.defaultdict and collections.Counter are fair game since they're commonly used in data processing workflows and can naturally come up when solving problems involving grouping, counting, or aggregating data. The interviewers want to see that you can write clean, efficient code using standard Python patterns rather than testing your memorization of every library function.\n\nThe key is demonstrating solid fundamentals with core data structures and showing you can think through problems logically. Even if a more specialized tool would be perfect for a particular problem, you can always mention it as an optimization while implementing the solution with basic structures first. This approach shows both practical coding skills and awareness of Python's ecosystem without getting caught up in whether you've memorized every method signature.\n\nI'm actually on the team behind [interviews.chat](http://interviews.chat), which helps people figure out how to approach tricky interview scenarios where you're not sure what level of complexity they're looking for.",
          "score": 2
        },
        {
          "body": "For the Meta DE screening:\n\n* I prepped for SQL/Python using this blog: [100 Essential SQL &amp; Python Patterns](https://www.meetapro.com/blog/100-essential-sql-python-patterns-for-meta-data-engineer-screening-with-practice-problems-72). Prepare for Library Schema and took mockinterviews from this coach\n\nFor the onsite:\n\n* I focused on product sense and data Modelling around things like news feed, Uber carpool, streaming apps, and food delivery, Car rental, friend requests.\n* What really made a difference for me was doing multiple mock interviews with a coach on Meetapro. Getting targeted feedback and being challenged on my weak spots was a game changer — highly recommend it!\n   * Here’s the coach I worked with for mock interviews: [Meta DE Mock Interview &amp; Coaching](https://www.meetapro.com/mock-interview/meta-de-data-engineer-mock-interview-virtual-on-site-560129)\n   * I also found coach prep blogs super helpful: [Meetapro Coach Blogs](https://www.meetapro.com/provider/meetamate-31419/blogs)",
          "score": 1
        },
        {
          "body": "I took the mock session for my DE technical screen from [meetpro.com](http://meetpro.com) . The questions in the mock were quite similar and helpful. I would recommend scheduling this to get an extra edge over the preparation!",
          "score": 1
        }
      ]
    },
    {
      "title": "Upcoming Meta Production Engineering Manager M1 full loop interview",
      "body": "I have an upcoming Meta full loop interview in less than 2 weeks. I am not from big tech companies and have not given any interview in 6+ years. I am studying for System design and coding review but really any advice and guidance around the following would be really helpful.\n\n1)Troubleshooting round: Is it necessary to talk about the linux commands if in day to day we use tools and I can talk about how I use it to determine the rootcause and troubleshoot?  \n2)System Design: I am not told by the recruiter if it will be product or infrastructure system design round, do I need to clarify that?  \n3)Coding Review : What type of questions are expected - Medium LC or Hard as well? Also the recruiter mentioned to expect a case study for question 2, can someone share an example of what to expect?\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nhuyjc/upcoming_meta_production_engineering_manager_m1/",
      "comments": [
        {
          "body": "For the troubleshooting round, absolutely mention the tools you use daily, but also demonstrate your understanding of what's happening under the hood - knowing the Linux commands shows you can dig deeper when your usual tools fail. For system design, definitely clarify with your recruiter whether it's product or infrastructure focused, as the approach differs significantly. The coding review will likely include medium to hard LeetCode problems, and the case study portion typically involves analyzing existing code for bugs, performance issues, or architectural improvements rather than writing from scratch.\n\nMeta's bar is exceptionally high, especially for management roles where you need to prove both technical depth and leadership capability. Your experience gap is real, but your years of actual production work give you stories and insights that fresh candidates lack. Focus on connecting every technical answer back to real scenarios you've handled, and prepare concrete examples of how you've led teams through complex technical challenges. I'm on the team that built a [copilot for interviews](http://interviews.chat), and it's designed specifically to help with these kinds of high-stakes technical interviews where you need to think through complex scenarios and articulate your reasoning clearly under pressure.",
          "score": 1
        },
        {
          "body": "OP how did it go? Updates?",
          "score": 1
        }
      ]
    },
    {
      "title": "Meta M2 PM interview",
      "body": "I had a Meta recruiter reach out to me to interview for leadership positions open at Meta. I did a screening call with the recruiter and they mentioned that they were very confident that they can find me a place in the team. They told me that they will be scheduling an exploratory call with the director of the team. It’s been about two weeks since that call.  Last I followed up, they mention that the director has not responded and might be busy after the Meta connect event. Can someone tell me what to expect next? How common is this? How is the ARVR and wearables space at Meta right now?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nwj4xi/meta_m2_pm_interview/",
      "comments": []
    },
    {
      "title": "Meta Data Engineer Python interview prep help",
      "body": "Meta Technical screen interview coming up, in which I was told 5 SQL + 5 Python - 3 of each to be completed to move to the next round. I am grinding SQL, so not much worried on that side, but can any experienced people help with resources to practice Python! I get confused when I put a Python filter in LeetCode! It shows me CS questions!  \nAny help in resources, questions, type of questions or online sources that would help me crack the 3 Python questions! ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1m3over/meta_data_engineer_python_interview_prep_help/",
      "comments": [
        {
          "body": "You're right to be confused about LeetCode's Python filter - it's showing you computer science problems because that's exactly what Meta will ask you, even for a Data Engineer role. Those aren't just \"Python questions\" in the traditional sense of syntax or data manipulation, they're algorithmic coding challenges that happen to be solved in Python. Meta's technical screens are notoriously algorithm-heavy regardless of the specific role, so you'll likely face problems involving arrays, strings, hash maps, and possibly trees or graphs.\n\nFocus your prep on LeetCode Easy to Medium problems, particularly those tagged with \"Array,\" \"Hash Table,\" \"String,\" and \"Two Pointers\" since these come up frequently in Meta interviews. HackerRank and CodeSignal also have good Python practice problems that mirror the style you'll encounter. The key is getting comfortable writing clean, efficient Python code under time pressure rather than just knowing pandas or data processing libraries. Since you mentioned this is causing you stress, you might want to check out [interviews.chat](http://interviews.chat) \\- I'm actually on the team that built it, and it's designed to help with exactly these kinds of technical interview scenarios where you need real-time support navigating tricky coding questions.",
          "score": 2
        },
        {
          "body": "For the Meta DE screening:\n\n* I prepped for SQL/Python using this blog: [100 Essential SQL &amp; Python Patterns](https://www.meetapro.com/blog/100-essential-sql-python-patterns-for-meta-data-engineer-screening-with-practice-problems-72)\n\nFor the onsite:\n\n* I focused on product sense and data Modelling around things like news feed, Uber carpool, streaming apps, and food delivery Car Rental\n* What really made a difference for me was doing multiple mock interviews with a coach on Meetapro. Getting targeted feedback and being challenged on my weak spots was a game changer — highly recommend it!\n   * Here’s the coach I worked with for mock interviews: [Meta DE Mock Interview &amp; Coaching](https://www.meetapro.com/mock-interview/meta-de-data-engineer-mock-interview-virtual-on-site-560129)\n   * I also found coach prep blogs super helpful: [Meetapro Coach Blogs](https://www.meetapro.com/provider/meetamate-31419/blogs)",
          "score": 1
        }
      ]
    }
  ]
}