{
  "company": "microsoft",
  "post_count": 64,
  "exported_at": "2026-01-18T17:44:53.289Z",
  "posts": [
    {
      "title": "I had an \"interview\" done via Microsoft Teams chat. Is this a scam?",
      "body": "(EDIT: The person who emailed me had an @ williamscommerce.com email as well)\n\nIn a nutshell, I applied to the job on LinkedIn. The company is Williams Commerce. Here's there website: [https://www.williamscommerce.com](https://www.williamscommerce.com/technology-platforms/shopify/)\n\nI looked up the person who sent me the initial email and they showed up in searches with this company. They've posted about them on LinkedIn about two years ago as well, so it seems that they've at least been with them a while.\n\nHere's the initial email I got:\n\n**Dear Applicant,**\n\n**Your resume was reviewed at Williams Commerce (**[**https://www.williamscommerce.com/**](https://www.williamscommerce.com/)**) and we are inviting you to a 30-minute interview for the DATA ENTRY (Remote) position offering $30/hour.**\n\n**To proceed with the job briefing and interview, please contact Mr. James Griffin via Microsoft Teams following the link below.**\n\n**INTERVIEW HOURS: 9am - 4pm(teams link)**\n\nThe person in that teams link was different and I tried to look them up, but I couldn't find them. Their English was pretty good though, which I know may or may not be a fair indicator if a job is a scam or not, but I wanted to clarify this anyway.\n\nThe \"interview\" was this person essentially reposting the job application. They sent the \"About Us\" section of the job application, the actual description, and the benefits. They then sent me a [jotform.com](https://jotform.com/) link to fill out, with around 21 actual questions and 4 information questions, which were my name, number, email, and address, all of which they technically already had since they're on LinkedIn.\n\nHe says that the questions will be reviewed for \"immediate hire.\"\n\nIt seems a bit out of the ordinary and even though it's a remote job, I figured it'd be a video interview, but it being a chat interview seems really sketchy. Is this a scam or am I being too cautious?\n\nTL;DR: Applied to job, got response fast, did interview on Microsoft Teams chat and [jotform.com](https://jotform.com/) , offer is $30/hr if they accept me. Scam or no?\n\nThanks so much",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/1b79obt/i_had_an_interview_done_via_microsoft_teams_chat/",
      "comments": [
        {
          "body": "Yes. Its a scam. No legit company interviews via text,chat email or questionnaire. Remote work still do face to face nterviews on videoconferencing.\n\nData entry is a dying role but the real ones sont oay this much. I'm about to start a temp data entry job and its $18 an hr.",
          "score": 6
        },
        {
          "body": "This is a well known scam. The next thing they will do is tell you you're hired, and then they'll tell you that they're going to send you a check to cover the cost of purchasing equipment for your home office. This is the scam, and it will cost you a lot of money. Block this person and run the other way.",
          "score": 6
        },
        {
          "body": "Yes, I just got this too and right away, I'm thinking weird as I connect to Teams with no interview time. And they are obviously using chatbot so I'm out. How horrible is this to be targeting desperate people basically looking for work?!?!? Who can we report them to ?\n\nPlus the lengths they go to to look legit. They put a bunch of working for reviews on glassdoor and indeed which are the exact copy of each other. Plus a website ? Wow?!? These scams are becoming more and more elaborate. \n\nCan we block someone on Teams ?",
          "score": 4
        },
        {
          "body": "Yes, it's a scam.\n\n1. Nobody is paying $62,400 per year for a remote data entry position that they could just as easily farm out to India. \n\n2. Nobody does interviews solely though teams, especially not for that kind of a salary.\n\n3. Even if the company is legitimate, which it appears to be, there is no proof that the people you are corresponding with actually work for the company, or are even the same people that are listed on LinkedIn.",
          "score": 3
        },
        {
          "body": "It’s a scam, please be careful! :(",
          "score": 1
        },
        {
          "body": "I just had this happen today. Got an email from a UnitedCenterInc email and the “recruiter” quickly responded with a pdf on the job and how to schedule an interview. I downloaded the teams app and proceeded to have a chat conversation with their “Hiring Manager”, which proceeded to ask me many questions about the job, and then started asking for my personal info. Thanks to my bestie and Reddit, I quickly learned this interview was in fact a scam. So I decided to say that I was tracking their IP address (I definitely wasn’t) and the person then proceeded to IMMEDIATELY go offline. \nBe safe out there friends, people are crazy these days😭😅😅",
          "score": 1
        },
        {
          "body": "I just found this thread because the same thing is happening to me right now. I got an email from a generic name (this time it was careers@fartherjobs.us). They do have what looks like real people on LinkedIn, a website, logo, address at the World Trade Tower, all that. The “person” signed the first one, and I found “him” on LInkedIn, listed at a “VP of Wealth Management.” Why would someone with that title be reaching out for a marketing job interview? \n\nI did reply with some available times and asked what job this was for, on Friday. Then today (the next Monday), I got a generic reply, not signed by the “person,” with a PDF attached, &amp; including a basic job description, telling me I’ll have to provide my bank account info “to get paid” (no shit, every job does this, but later, down the line with HR, once hired, Direct Deposit is just a thing but is usually NEVER mentioned on the JD), with specific instructions on how to download Teams, and to chat this other person, now with an @outlook (not an @company.com email) to setup an interview. NO ONE REAL DOES THIS!!! \n\nI still bit because I was curious and not much damage a Teams chat can do (I won’t download anything or click any links they send), and it looks like it’s a bot, telling me I was “confirmed” and it’s a chat interview that we can do “right now.” I’m going to block them and run. Not sure if I can report them to anyone or not.",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm a former Googler and current Microsoft engineer (and interviewer) willing to give mock interviews periodically this week.",
      "body": "Sorry if this violates the interviews daily thread.\n\nSo I'm kind of frustrated seeing the increasing number of \"I'm too stupid to get hired as an entry level engineer\", so I want to try and help with that by giving mock interviews (same interview that I give candidates) + full feedback to those who want it.  Hopefully this will help boost some confidence and give some people tips to improve their interview skills.  Anyone have any interest in this?  Any input on how I should go about doing it?\n\nI might do 3-4 interviews a night starting tomorrow, and probably (even more) on the weekend depending on my schedule.  Here's kind of the priority that I want to give interviews in.  I'll most likely work my way up from new grads without jobs up to mid-level engineers.  Sorry Senior SWEs, I'm not really qualified to give you feedback / a good interview.  I'll do interns if I get the chance.\n\nHere are some details/rules on the interview style (up for change if there's a request for it).\n\n* The interviews will be 30 min and 15 min of honest feedback afterwards.\n\n* I won't give out what hire recommendation that I would would have submitted for you.\n\n* 2 questions: one \"foobar\" style question and one hard one.\n\n* Please be honest with me.  If you've seen the hard question before, please tell me, it won't benefit you at all repeating what you already know.  I'll probably just end it right there if you don't.\n\n* The first 5 minutes of feedback, I want you to give me your feedback on yourself.  I've found success by being able to predict feedback from interviews that I've been in.\n\n* TBD on more if I think of any others.\n\nFYI: I am not representing Google or Microsoft with this.  My feedback and style is of my own, you may have interviews that are completely different (that being said it has worked for me getting offers before).  Just because I give good or bad feedback on your interview, doesn't mean that you should assume that you'll get hired or think that you suck because of it.  Everyone's interview experiences are different.  TBD on more?\n\nSo I hope this will help some people.  Maybe it's a stupid idea, we'll see.\n\nEdit: Apparently I can't reddit format :).\n\nEdit 2: Sorry, I should say how to sign up for it.  Just send me a message (for now) with your experience (or resume), available times and current situation (i.e. jobless, new grad, job + mid level engineer, etc).  Please be honest with the current situation, I want to get the people in first who are freaking out about stuff.  Then I'll work towards everyone else.  Sorry for the massive paste of \"Please see this edit\" :).\n\nEdit 3: RIP my inbox.  Based on that + the 98% up-vote ratio, I'm guessing that this will help a bunch of people.\n\nEdit 4 (and a good one): /u/Surfcasper has graciously volunteered to do something similar for PM roles [here](https://www.reddit.com/r/cscareerquestions/comments/4in6ue/im_a_former_googler_and_current_microsoft/d2zl4vk).  Be on the lookout for a new post from me (I'll edit it in here once he posts it), send some messages his way as well.\n\nEdit 5 (11:30 PM PST): I'm cutting it off here for tonight to put together a list.  I'll send out info later.  For any overseas people, I'm not sure if I can really work with the time difference, so I'll send you a time that works for me'ish and see if you're available.\n\nEdit 6: Ugh, so tired (read that is ti red :)).  Finally got through everyone's messages.  I didn't expect that.  Thanks for all of them + the feedback here.  **So I'll start to email people in the morning for tomorrow, and probably will start to email others throughout the week with times.  Be on the lookout here and in your messages for updates.**\n\nSo I narrowed it down to 25 people, hopefully I can get through those.  Interns, sorry you're out I'm not going to have time.  A couple of you I've reached out to postpone until later so I can provide further help beyond just an interview.  If I don't get to you, it's either that you're in a good situation and you just don't like it (in this case, I won't have time this time around), or you graduated from from a great school rocking a 3.97 gpa and have 127 offers in your back pocket and you're freaking out about the google interview.  Sorry, please refer to the big 4 sticky for those situations.\n\nOn a side note.  A few of you need to watch how you send your messages.  You're not texting me so don't do: \"u, i, 60000 character sentences...\".  It will show when you talk to recruiters and managers, etc... You'll be in a world of hurt when it's time for design docs.\n\nSo I'll still be here to talk over the week and maybe pick up a couple more people if I can.  **So when this is all done, I'll post a follow up thread on trends that I see and overall feedback.  No video this time, I'll probably stream it on twitch next time.  Everyone is encouraged to post their experiences and feedback on that thread.  When I get done interviewing someone, please don't share the questions with others until I make that thread.**\n\nEdit 7: Gilded!  Thank you kind stranger :).  This is ridiculous, hands down my most popular post ever.  Holy fuck you guys are relentless, alright I'll live stream the interviews when each person gives me permission.  **My only stipulation is that future interviewees don't watch.**  I want to interview you when you don't know my questions.  For everyone else, [this page](https://www.twitch.tv/twitchlearnsprogramming) is my twitch channel.  **I'll probably start live streaming at 7pm every night (with the exception of maybe tonight) into the weekend.**\n\nAlso as an edit to edit 6, interns and grads with current jobs may not be turned away just quite yet.  Someone volunteered to help me out with that.\n\n**May 10th Sessions and Updates**\n\nI plan on starting at 5:30 today on twitch to do a Q&amp;A then roll into the interviews.  I have 3 spots today filled.  7, 9 and 10 (with a break at 8).  I sent out 5 invites to fill the ~~6PM~~ and (potentially on how I feel) 11PM spots.  All in PDT.  So please check your messages and send your skype account and if you feel comfortable being on stream.  If those two spots, anyone who messaged me before the cutoff yesterday, feel free to reach out to fill those two spots (first come first serve).\n\n~~**Live Now**~~  Thanks for coming out everyone.\n\n**May 11th Sessions and Updates**\n\nI'll be starting at 7 today (with a potential 6:30 Q&amp;A).  It'll be live streamed again on twitch. The four spots have been sent out so please check your messages.\n\n**May 12th Sessions and Updates**\n\n/u/ashyre has graciously offered to take some interviews off my hands.  So I'm going to take a break and tonight's interviews will be streamed from [his twitch channel](https://www.twitch.tv/ashyre).  The invites have been sent out for today.\n\n**Friday the 13th Streaming**\n\nI'm back to steaming.  Good to have a day off.  I'll be starting today around 8-8:15'ish.  I'm only doing 1 official interview today (doing some over the weekend as well) but will be taking walk-ins as well / Q&amp;A.\n\n**May 14th Updates**\n\nSorry, I couldn't get around to streaming today.  Didn't feel all that great today, basically spent the entire day catching up on sleep and will continue tomorrow.\n\n**May 15th Updates / Streaming**\n\nPhew, final day.  I'll try and start around 4:30PM today.  I'll send out invites before that I hope, but today might be more of an on the limb type of thing.  I'm looking at using Google forms or something to keep track of people and send out notifications if they come up.  If you haven't been interviewed yet, I'm sorry there was a lot of you, hopefully that'll change later.",
      "subreddit": "cscareerquestions",
      "score": 836,
      "url": "https://reddit.com/r/cscareerquestions/comments/4in6ue/im_a_former_googler_and_current_microsoft/",
      "comments": [
        {
          "body": "This is amazing. I'm sure there are tons of people who would love to take you up on this offer. I'm preparing for interviews for Fall internships as well as FTE for fresh graduate. I'd love to take you up on your offer!\nUsing some sort of online calling paired with a collab online IDE would work great! (Possibly just use Google Docs so Google interviewees can get even more exposure to that)",
          "score": 41
        },
        {
          "body": "[deleted]",
          "score": 21
        },
        {
          "body": "Also, if anyone is interested, I did a [presentation](https://www.youtube.com/watch?v=MyFxMpKn7yk&amp;feature=youtu.be) on how Google interviews, which might be a good supplement to what /u/Kevincav is helping you do!",
          "score": 18
        },
        {
          "body": "I'm a tech program director for Google, I'd be willing to do mock interviews or answer questions about getting into project/program management if anyone has interest. Great idea op!",
          "score": 28
        },
        {
          "body": "Hey I just started working at Microsoft today!  That's pretty neat!",
          "score": 45
        }
      ]
    },
    {
      "title": "Family of Microsoft employee who died warn tech companies not to overwork workers",
      "body": "https://padailypost.com/2025/08/29/family-of-microsoft-employee-who-died-warn-tech-companies-not-to-overwork-workers/\n\n&gt;Pandey had told his roommate and colleagues that he was under a lot of stress, juggling multiple projects at the same time, community leader Satish Chandra said in an interview Thursday.\n\n&gt;On the night of his death, Pandey scanned his badge to get into the office at 7:50 p.m., and he was found in the courtyard about six hours later, his uncle said.\n\n&gt;Pandey’s roommates and friends relayed that he continuously worked late nights for a “very extended period of time,” his uncle said.\n\nHow many more deaths will it take before this industry finally unionizes for better workers' rights? Or will most of the jobs already be outsourced by then?",
      "subreddit": "cscareerquestions",
      "score": 1375,
      "url": "https://reddit.com/r/cscareerquestions/comments/1n5jy5m/family_of_microsoft_employee_who_died_warn_tech/",
      "comments": [
        {
          "body": "Most of big tech is super toxic and high demand. Wished he took care of his health more. I would assume there would be some signs. Pretty sure he is probably on a work visa.",
          "score": 500
        },
        {
          "body": "I was expecting Microsoft to be a little bit more chill compared to other FAANGs. Looks like all the top tech companies are overworking their employees.",
          "score": 283
        },
        {
          "body": "I'll not be surprised if I see something similar at AWS, the way they make people work. 10months into it and I can see visible physical changes in my body due to consistent overwork. It is daunting. No point in living to work when we should be working to live.",
          "score": 193
        },
        {
          "body": "In my previous German company, it's even illegal to work after 19:00 (including sending email, pushing git, etc).\nThe mentality is, if you can't finish your work within the working hours, then you are not being productive, or you don't set realistic goals with your team/stakeholders. Working hours are strictly protected by workers counsel.\n\nMeanwhile, in my current US company (FAANG), the mentality is \"visibility\" and \"impact\". Productive or not, people like to \"appear to work hard\" by sending emails at 1am or while on vacation, just to show how hard they work.",
          "score": 159
        },
        {
          "body": "Y'know what, I don't see enough dialogue about CS people unionizing. It would be difficult, especially now, but I support it.",
          "score": 460
        }
      ]
    },
    {
      "title": "Ex Microsoft dev here. Market sucks even for us",
      "body": "5 years of experience , 3 at Microsoft. \n\nIf you’re a new grad it’s not just bad for you. I’m looking for mid level positions and it sucks. \n\nAt this point I’m thinking of doing my own start up on the side since I got some time and money now. If any of you are still struggling give a startup idea a shot. It’s good experience and hey you never know. If anyone wants to join me dm me. \n\nTo those who are struggling keep trying and do projects. Gather some friends work on something together. Leetcoding all day is exhausting. \n\nBest of luck everyone. \n\nEdit: I should add that you can ace your interview , give perfect answers and they will love you and still be rejected because someone else also did well but they fit the Job description better 🥲\n\nEdit 2: guys I’m getting lots of Dms. I promise I will get to you all but to those who think I have a startup idea established I don’t. I’m just talking with people bouncing ideas and if it’s something we both like we can give it a shot. ",
      "subreddit": "cscareerquestions",
      "score": 1959,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ewitiv/ex_microsoft_dev_here_market_sucks_even_for_us/",
      "comments": [
        {
          "body": "Still a MSFTer, and I can confirm a lot of the resumes we sort through when we backfill positions are ex-FAANG employees or even previous Microsoft employees. It’s incredibly competitive out there right now.",
          "score": 1110
        },
        {
          "body": "\"At this point I’m thinking of doing my own start up on the side since I got some time and money now.\"  \n  \nI left my job last summer to do this, and we are just about to launch now, a year later.\n\nJust a tremendous experience boost: using new tools, solving new problems, and spending a lot of time thinking about a project end to end, and being the person where the buck stops. When you're career isn't moving forward, you can always write your own ticket!",
          "score": 211
        },
        {
          "body": "I’ll be honest with you, msft in your resume is great if you’re applying to similar companies, but it’s arguably detrimental if you’re applying to lower tier companies. A lot of places get scared off by FAANG because they know they can’t afford them and will be a flight risk. I don’t have FAANG on my resume have been getting a lot of offers at mid tier places",
          "score": 523
        },
        {
          "body": "I was at Meta for 4 years, let go last October. I took some time away bc I was on parental leave when it happened, then lost my brother in a pretty tragic way a few months later. I started applying in March thinking my experience would get me into doors. Boy was I wrong lol it's been awful.\n\nEdit: Thanks for the virtual hugs everyone! Also for the record, the layoff sucked, but the gigantic silver lining was that it gave me a lot of time to grieve and support my mom and sisters. The severance has kept us more than afloat, and it also let me spend way more time with my baby girl, which I didn't get to do with my son.",
          "score": 99
        }
      ]
    },
    {
      "title": "Referrals Are King - A Shithead Guide On Successfully Applying To Jobs, Even - ESPECIALLY - When You're A Shithead.",
      "body": "I must introduce this guide first with this preamble: I cannot for the life of me believe that people are *not* doing this. I mean that literally - I believe, and to a larger degree, I hope, that this is all useless information.\n\nHowever, I have helped close to three dozen friends go from getting nearly zero interviews or even responses, to getting them all the time, just by... get ready for it... this one simple trick.\n\n\\------------------------------------------------------------------------------------------------------\n\nIf your primary strategy for applying to jobs is by going to [indeed.com](https://indeed.com), [monster.com](https://monster.com), [jobs.linkedin.com](https://jobs.linkedin.com) \\- etc, and hitting submit on an application, then I am so happy to inform you that you're just doing this wrong. I have applied to many jobs this way, and I have sparingly seen a response. Why? Because I'm a shithead, and no one wants to hire a shithead.\n\nSo, what did I do instead, and what did all my other shithead friends do instead?\n\n# What The Hell To Do Instead\n\nHAVE A RESUME THAT LOOKS GOOD\n\nI have seen so many resumes from newgrads and junior engineers with the most *blegh* looking resumes. I am not talking content here - by now, I hope you know how to make your resume sound, and this is not going to be a guide on how to make your resume *sound* good. But for the love of God, if you're making your resume on microsoft word, do yourself a favor and [make yourself a resume on overleaf.](https://www.overleaf.com/gallery/tagged/cv) Or whatever you want. Make it look good. Overleaf makes it hella easy, especially if you're a developer. Don't know LaTeX? Neither do I, and I got by just fine, and, remember, I'm a shithead. You can figure it out, I promise.\n\nOkay, have a nice looking resume? Good.\n\n&amp;#x200B;\n\n# Use LinkedIn to Contact People. Seriously.\n\nI have never, ever, *ever*, sent an application randomly through one of those crap-chute websites and expected to ever hear anything back. And guess what? Lo and behold, I nearly never hear back. So, here's what I do.\n\nLet's say I want to apply to a Spotify job. I'll go to Spotify's \"careers at spotify\" page, and look for two, three maximum, roles that sound right for me. Then, I go on [linkedin.com](https://linkedin.com) and search \"Spotify\" and land on their company page. You should see something like [this](https://imgur.com/a/uoIPIXH).\n\nThen, I click on the [People](https://imgur.com/a/ZBT5oOg) tab.\n\nThen, I look at the [filters that are immediately available.](https://imgur.com/a/TQRLKxk)\n\nAnd I apply some filters!\n\nYou want people in Engineering. You want people who went to your college. You want people who studied what you studied. You want people who are first, second, or even third connections. Just add as many filters as *you* can. The more related they are to you, the better!\n\nThen, start mass-adding people that clear the filters. If they are already a connection - great, send them a message. If they went to your school (this is very helpful) - great, send them a message. If they have your first name - great, send them a message.\n\nIf they share fuck-all with you, great, send them a message!\n\nBut they have to accept your connection first, of course, if you don't have Linkedin premium. A lot of them will. Some of them won't. Whatever, doesn't matter. You really just want 1-3 people.\n\nOnce you have at least one person accept your connection request, send them a message! You don't want more than a paragraph. 1-2 sentences telling them why you are messaging them, 1-2 sentences introducing yourself, and 1-2 sentences to just shoot the shit. Something like:\n\n\"Hey, my name is Texzone, and I am messaging you because I am interested in a job at Spotify. These roles I have sent below seem like a great fit for me (send roles after sending the intro message), and, I would love if you could refer me. I am a newgrad interested in backend development with a focus in data engineering, and I have some experience under my belt that I think would be beneficial to Spotify. \\[insert line about your qualifications; seriously, Keep It Simple, Stupid\\]. Thank you so much for everything, and have a great day!\"\n\nThat's it.\n\n\"*But* u/texzone\\*, that's so annoying! I'm surely harassing them by doing this!\"\\*\n\nYou idiot. You know, if they refer you and you get accepted, most companies have a bonus that they offer the employee! It ranges anywhere from 2k-10k. And all they have to do is drag-and-drop your resume on some shitty internal portal, then continue picking their nose while watching whatever tiktok nonsense they were watching when you messaged them.\n\nEven if they don't get any money out of it, people like helping other people. Really, it's true. They do.\n\nAnd, with a referral, you are almost *guaranteed* an interview if you:\n\n1.\tHave a clean looking resume and it sounds good.\n2.\tYou are applying to a role that matches your background/experience, at least loosely.\n3.\tThat's it.\n4.\tYeah that's really it.\n5.\tI swear.\n\nEasy. I have applied to dozens upon dozens of jobs this way, and I have gotten interviews at nearly every single damn one. My resume isnt amazing. My experience isn't way out there. My friends? A lot of them had a clean looking resume, but had shit-all for experience. But they all got interviews as well.\n\n&amp;#x200B;\n\nI am sharing this because I am forced to believe people aren't doing this, and are instead hitting submit on some portal. This is by far the worst god damn way to ever apply *anywhere* nowadays. Unless your resume is filled with jargon, years of experience, and a sprinkle of FAANG, forget this ever being a smart way to apply to jobs.\n\nSo, that's how I, a shithead, have gotten over a hundred (I'm seriously not kidding) interviews over three cycles of job hunts that lasted about 3-5 months each. I applied once when I graduated, once during COVID, and just finished a job hunt right now.\n\nI *now* have some impressive stuff on my resume, thankfully. I look less and less like a shithead, and more like a professional - much to the dismay of the world - and I *still* don't ever hear back (rarely) from applying to jobs \"normally.\" I still do apply normally - I'll send out applications every month or so, even when I'm working, so I can keep interviewing and stay ontop of my interviewing game. But from, say, 50 applications I send out, I'll maybe hear one  response.\n\nBut when I apply the way I described above? If the person delivered, and referred me, I never *don't* hear back. Neither do my friends. And I will almost always find someone to refer me. So... yeah, I hope this helps.\n\n&amp;#x200B;\n\nNote: I guess this may not work for super small startups. Whatever.\n\n# FAQs\n\n1.\tIs this method something you would recommend for internships?\n   1. No, not really - this method is something that I strongly encourage for full time jobs. Internships, co-ops, etc - those are a different beast and I know nothing about that. A college internship? ...Maybe. A High school one? ...Unlikely.\n2.\t***AM I SUPPOSED TO SUBMIT MY APPLICATION BEFORE OR AFTER THEY REFER ME***\n   1. ***VERY VERY VERY VERY VERY MUCH AFTER! DONT APPLY, LET THEM APPLY FOR YOU!*** If you apply before they refer you, well, then, you applied, and they can no longer refer you. So don't apply unless they explicitly tell you to do so.\n3.\tAm I supposed to contact recruiters?\n   1. Yes. They are excellent. Yes, do contact them. But honestly I've just never really had much luck with them.\n4.\tDo I attach my resume unprompted?\n   1. Up to you really. I usually don't. But you can. Especially if u like it\n\n## Edit\n\nThis strategy may not be so effective anymore. Good luck, its rough out there right now.",
      "subreddit": "cscareerquestions",
      "score": 4452,
      "url": "https://reddit.com/r/cscareerquestions/comments/uczkay/referrals_are_king_a_shithead_guide_on/",
      "comments": [
        {
          "body": "A recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface .\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n&amp;#x200B;\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of r/reddit.com, who are the admins of the site: message [/u/reddit](https://www.reddit.com/u/reddit/): submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on [r/reddit](https://www.reddit.com/r/reddit/), such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at [r/ModCoord](https://www.reddit.com/r/ModCoord/) \\- but please don't pester mods you *don't* know by simply spamming their modmail.\n3. **Boycott** ***and*** **spread the word...to Reddit's competition!** Stay off Reddit as much as you can, instead, take to your favorite *non*\\-Reddit platform of choice and make some noise in support! \n\nhttps://discord.gg/cscareerhub\n\nhttps://programming.dev\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "You should know that at Amazon there are 2 types of referrals: networking leads (people you haven't worked with) and actual referrals (people you've worked with directly). You only get a referral bonus for actual referrals, *however* you may be questioned as to your prior experience with the referral. Also, there are consequences to giving bad referrals (your future referrals are taken less seriously).",
          "score": 316
        },
        {
          "body": "Counter-point: every job I've ever gotten was from blind applying or a recruiter contacting me through LinkedIn. And every job I've ever gotten a referral for, I've never even gotten so much as a call from the recruiter.",
          "score": 642
        },
        {
          "body": "1. Can you define \"shithead\" and explain how, specifically, it's causing a problem that your advice aims to solve?\n\n2. It's probably just me being me, but given that I have actually been on the other side of this once before, I will say that a stranger approaching me for a \"referral\", personally, is off-putting. Even if they end up becoming a fine employee of the company I work for (this actually happened), I still find it to be an odd thing to ask of somebody who doesn't know you. Sounds like a lot of people don't think about it this way, but I think of a referral as a meaningful, individual endorsement, which I'm not really comfortable giving to a complete stranger (for reasons that are hopefully obvious enough).",
          "score": 93
        },
        {
          "body": "[deleted]",
          "score": 191
        },
        {
          "body": "Mods delete this he is revealing cheat codes",
          "score": 791
        }
      ]
    },
    {
      "title": "lnterview From Hell",
      "body": "I just went through my Microsoft onsite for new grad and literally just had the worst interview experience of my life. Interviewer showed up with his camera turned off and wanted to go straight to coding. He gave me a question and I explained my approach and then he wanted me to solve it using a stack DFS instead of recursion, which I had never done before so I struggled a bit. I usually have some scratch paper in hand so I can visualize things, but he told me that I wasn't allowed to do that and to use the Codepair scratchpad. Later as I looked to the side to think for a second, he asked me \"why the fuck are you looking to the side\" (verbatim) and to focus on the screen, to which I apologized and kept going. He wasn't really angry, in fact he was laughing when he said it but at this point I was extremely uncomfortable and it was impossible to think through the problem. I was explaining my thought process and when I said something about popping a node from the stack he deadass replied \"Ayee pop it like it's hot\".\n\nHe then started getting impatient when I couldn't solve the problem and he started throwing out a lot of curse words in his hints (that weren't ever helpful) and then said \"C'mon you're a \\[T10 uni\\] student, show me some code\", which is probably one of the most demoralizing things I've been told. He ended it and asked me if I had any questions. I asked him how he liked Microsoft and he said you learn a lot but \"the pay is shit and the work is boring.\" I thanked him for his time and he said yeah and dc'ed (this was the first interview of the loop). Got rejected the next day.\n\nGG",
      "subreddit": "cscareerquestions",
      "score": 3174,
      "url": "https://reddit.com/r/cscareerquestions/comments/rdn3z9/lnterview_from_hell/",
      "comments": [
        {
          "body": "Lmao, he was probably about to quit.\n\nSorry for your experience tho",
          "score": 2533
        },
        {
          "body": "wow wth, have you considered reporting it to your recruiter? I don't know if Microsoft would be responsive about unprofessional interview experiences.",
          "score": 876
        },
        {
          "body": "He's more than likely leaving soon. Regardless he's a total asshole, I'd let your recruiter know your experience. Nothing may come of it, but you still should.\n\nBTW you should also learn how to do dfs iteratively, that's not too rare of an ask.",
          "score": 426
        },
        {
          "body": "im sorry this is hilarious. im dying at “ayeee pop it like its hot”",
          "score": 620
        },
        {
          "body": "I had a hostile interview at DoorDash. The guy was from NYC and was arrogant as fuck and completely disinterested in being there. He ended the coding section with 10 mins left even though I was almost finished solving the question. I complained to the recruiter but he didn't respond back at all. Fuck those guys.",
          "score": 83
        }
      ]
    },
    {
      "title": "Laid off after 5 years at Microsoft. Need help landing a new role.",
      "body": "5 years at Microsoft out of college. It’s been a few months and I haven’t received any offers. I was wondering what helped to those that have had success. Interviews seem to go well, made it to several final rounds. It got to the point where multiple interviewers told me they would start using some of my methods in their own work (SLA management and stuff). And then I get ghosted. By the recruiter and all that interviewed me. So I never get any feedback on what I could do better. \n\nThe only interviews I’ve gotten were from recruiters reaching out. My resume and cold applying has gotten me nowhere. And this is after several resume reviews and refactors. \n\nDoes anyone know what could help me here? Even seemingly successful interviews go nowhere. I am also a US citizen so there’s no sponsorship concerns. I’m also willing to relocate so I’m not just picking remote roles. ",
      "subreddit": "cscareerquestions",
      "score": 767,
      "url": "https://reddit.com/r/cscareerquestions/comments/1n2lcmr/laid_off_after_5_years_at_microsoft_need_help/",
      "comments": [
        {
          "body": "if you're getting into final rounds with good responses, its really honestly just a numbers game. getting that far means they did like you, but they went with someone else for reasons completely out of your hands (they had a better direct skillset/experience fit, etc...) \n\nkeep at it. market is *weird* right now. it's not just you.",
          "score": 783
        },
        {
          "body": "A better job market with less competition would help. Otherwise, persistence in going after any and all applicable job openings",
          "score": 360
        },
        {
          "body": "You’re in a better position than like 90% of us brother",
          "score": 225
        },
        {
          "body": "[deleted]",
          "score": 46
        },
        {
          "body": "I'd get a trusted counter-party to review your behavioral patterns. Your answers may be technically perfect, but these days teams will reject you if you don't give off strong personable vibes. I have been part of more than a few interviewing committees where a candidate gave great answers, but was rejected because they would not be a fit into the team comradery.",
          "score": 84
        },
        {
          "body": "Who do you know from college or from Microsoft who left previously that you can reach out to? You need to know someone that can put in a recommendation for you.",
          "score": 19
        },
        {
          "body": "How many final rounds did you get to, and what are the salary ranges for those roles?",
          "score": 29
        }
      ]
    },
    {
      "title": "Microsoft Campus Interview. I want to share and vent about my experience in precise detail. Looking for feedback.",
      "body": "I'm a third year PhD in Computer Engineering. I use s/he to remove gender bias.\n\nI went to my career fair with one resume in hand.  I went straight to Microsoft, handed a recruiter my resume, and told them why I was qualified for the position.  I knew right then and there I'd have an interview.  He asked if I would attend the [Microsoft College Code Competition](https://msft3c.com/), and I told him absolutely.  I enter the competition with two co-workers, we win.  Icing on the cake, got my interview.\n\nI get an email saying it's from 9:00AM to 9:45AM.  I read over a hundred articles about how to prepare, I brush up on generic data structures, I'm prepared for a personality test and a basic weed out question.  I arrive at 8:30 to be safe, I check my phone at 8:55AM, they haven't arrived yet.  Time is immeasurable to me as I'm extremely nervous.  The interviewer comes in soon after out of breath and rushed, asked the desk worker where the Microsoft room was.  I wait even longer, I expect around 9:05 they call my name.  I introduce myself, realize s/he is not a native English speaker nor are they having a good morning, and we enter the room.\n\nFirst words, \"I see you're a PhD student, what are you researching\".  My current topic is on Hardware Transactional Memory, so I reply with just that.  The interviewer gets **glued** to the word *hardware*.  My stomach dropped when s/he asked \"Do you realize this is a software interview?\".  I tried to explain concisely that we modify open source simulators to do our research.  The blank stare was piercing as I knew s/he had no clue.  I just started talking about contributions and pipeline stages and other things to be added to these types of simulators, and it was obvious the interviewer was disinterested.  It felt horrible.\n\nThen s/he looked above my head (I assume at the clock) and said \"We need to press on, I'm going to ask you a technical question\". I was actually excited, not knowing whether I'd implement a lock or reverse characters in a string, anything trivial to prove myself worthy of a campus visit.  S/he asks \"Program a function that takes in a string, removes all duplicate characters, and returns pointer to said string.\" *Immediately*, I vocalize \"I know an inefficient way off the top of my head but I know it can be better\".  S/he replies \"write it down\".\n\nSo I initialize a map&lt;char, int&gt; and I use for (i = 0; i &lt; str.lenght(); i++), map[i]++.  If the value &gt; 1, str.erase(i).  I'm stopped because of time (it felt like two minutes passed), S/he said okay, but can you do it without any unnecessary memory.  I said sure, once we identify the duplicate, lets use the str.erase() function.  **I was scolded** for using the .erase function and s/he made me feel horrible for 'cheating' saying I have to implement that myself.  So I respond with \"Then at point i, we shift the contents of the string on the right of the pivot to the left one space.\" S/he tells me \"Good, that's what we're looking for.  Now you realize if you get this position, you have to be able to program?\"  Once again, my heart sank. I thought I nailed the question, vocalizing thought process, etc.  How is this supposed to make me feel?  I choke out a \"Yes I understand and s/he tells me that I would have time to practice before a campus interview, but my theory as a PhD was good.\"  \n\nI then get rushed out, so I thought it was 9:45.  I look at my cell phone as I walked out, it was 9:23.",
      "subreddit": "cscareerquestions",
      "score": 121,
      "url": "https://reddit.com/r/cscareerquestions/comments/2hi3lp/microsoft_campus_interview_i_want_to_share_and/",
      "comments": [
        {
          "body": "You should gve an anonymous complaint maybe. My Microsoft interview was pretty good compared to most other companies. This person sounds like an anomaly.",
          "score": 80
        },
        {
          "body": "Many, many years ago, I had a horror-interview experience where I was expected to recall encyclopedia's worth of information off the top of my head.  It was a full-day interview process, and I interviewed with 8 different people, most of whom would have rejected any programmer who wasn't Linus Torvalds (and they would have rejected Linus Torvalds, too).\n\nI actually got the job anyway.  I was told later by the VP who offered me the job that part of the reason I was hired was because I was 87th candidate that the tech people had interviewed and rejected.  This was back in the 90's, too - they actually paid to fly me down from Illinois for this interview, and I hadn't been the first they had flown in from remote areas.  They had been trying to fill that position, unsuccessfully, for two years.  Within my first week on the job, half the people who had interviewed and rejected me apologized and thanked me for the contributions I was already making.\n\nThere seems to be something fundamentally wrong with they way programmers are interviewed, hired, and measured; we keep hearing that there's a talent shortage, and considering that you must be able to move heaven and earth to be considered a few notches below drooling idiot, I can't say I'm surprised.  Are even medical doctors held to these kind of standards?",
          "score": 22
        },
        {
          "body": "I had a similar experience. I was asked if I wanted to be a SDET or SDE. I nicely replied SDE. The interviewer suddenly got defensive and started asking me why not SDET. I simply replied nicely that I'm interested in beIng on the development side. He just kept asking why not testing. It reminded me of that Comcast call where they just kept asking why. ",
          "score": 25
        },
        {
          "body": "I'll have a campus interview in a few weeks, albeit for an internship, and I'm doing the whole day deal. Still, hope I don't get that person. ",
          "score": 9
        },
        {
          "body": "Wow, that is horrendous. Try anywhere else in the Silicon Valley or San Francisco Bay and you'll be treated way better.\n\nI'm sure Google or Apple would be glad to have you.",
          "score": 54
        },
        {
          "body": "It sounds like this interviewer (1) was expecting a particular implementation of the solution, (2) probably using a char array and (3) had a weak grasp of the STL. Of course none of those things are your fault!\n\nTo go into the specifics of the problem (rather than the bad behavior of the interviewer), to me the problem with `erase` is not that it's \"cheating\" in any sense (if the interviewer didn't want you to use the standard library then he/she should have specified that) but that it's inefficient (your solution becomes O(n^2 )); but the interviewer didn't say that. The only way I know of to not use extra space is to sort the string in-place; but the interviewer didn't say that you could reorder the string (although you could ask that).\n\nAll in all a bad interviewer and perhaps if this person was new to it they should have had a second person to help. I believe if you do report your experience to another Microsoft contact, if you have one, such as an HR person, said report will be taken seriously.",
          "score": 20
        }
      ]
    },
    {
      "title": "Feeling suspicious about a Job Interview via Microsoft Teams",
      "body": "Hey, everybody,\n\nI lost my job last month, and immediately hopped onto LinkedIn to update my resume and start applying for jobs.\n\nI've been approached by a recruiter for a Senior Full Stack position at a Latin based company called Nearsure.\n\nI have felt that there has been something \"off\" about the way the recruiter has contacted me, versus other professionals I have spoken to. I guess... everything feels a little too positive? He hasn't been super aggressive, but at this point, I'm suspicious about anybody who's excited about me 😆.  He  is based in Venezuela, so maybe the style is different.\n\nI went to the Nearsure website and uploaded my resume there, just to have it somewhere legit.\n\nNow I'm told I will have an interview this week, and I've been sent an email with a link to Microsoft Teams. Both the recruiter and interviewer's email addresses end in \"nearsure.com\", which is good, and jibes with the email domain used on their legit website.\n\nAnother good sign: The job title and reference number I was given are present in Nearsure's \"Careers / Job Opportunities\" section on their actual website.\n\nOne bad sign: At one point last week, a recruiter with the same name sent me a message via \"WhatsApp\", the hugest red flag in the land of job hunting red flags. Fortunately, I just don't have a good WhatsApp set up, so I couldn't log in... therefore I just ignored whatever that was. Moving forward, I just continued my back and forth with the recruiter on LinkedIn, and he never mentioned the WhatsApp thing.\n\nI do not yet know the format that this will take; I presume it would be a video interview, but now I know that if it is text/chat, I should run away.\n\nI am a little nervous. I'm a sucker for friendly people, and though I know that I would never give out personal info, I COULD be suckered into falling for a fake job offer and a follow up with a fake HR person etc etc etc.\n\nI just don't know how to proceed... should I try the interview and see how it goes?  \nShould I just run away?\n\nWhat do you guys think?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1i19gv5/feeling_suspicious_about_a_job_interview_via/",
      "comments": [
        {
          "body": "The email domain matching is a very big green flag - I feel like I've never seen a scam where this happens. So I'm immediately leaning towards this being legit.\n\n\nYou can easily tell if it's a scam though. If ita a scam, the \"interview\" will be entirely text-based. If you land the job very easily without ever talking face to face with a real person, it's a scam.",
          "score": 1
        },
        {
          "body": "Everything looks normal enough to me.",
          "score": 1
        },
        {
          "body": "Hey, u/CityPickle! I've sent you a dm regarding this company. Could you answer when you have time? Many thanks!",
          "score": 1
        }
      ]
    },
    {
      "title": "IAMA Microsoft Engineer who interviews candidates and recruits at Universities. AMAA!",
      "body": "There seemed to be interest here from new (and soon to be new) college graduates, as well as those who are already in the industry. I may be able to help!\n\nI am a Microsoft Software Development Engineer (SDE) and have been with the company for several years. In that time, I've recruited at several Universities, attended Career Fairs, and interviewed candidates flown in to our main campus in Redmond, WA.\n\nWhile I won't violate my NDA, I can share a decent amount about your possible interview experience, and I can offer tips for getting the job.\n\nAny advice I give, while tailored to Microsoft, is extremely similar to what you'll hear for other large companies such as Google, Amazon, and Apple (among others).\n\nSo, if you've got a question, fire away\n\n**DISCLAIMER:** My responses in this post as well as the comments are not official statements on behalf of Microsoft. They are my own thoughts and insights gathered through my experiences, they don't reflect an official company position.\n\n**HELPFUL RESOURCES**\n\nInterested in applying to Microsoft for an internship or as a new college grad? [Microsoft University Careers](http://careers.microsoft.com/careers/en/us/collegehome.aspx)\n\nExtremely helpful book for technical interview prep: [Programming Interviews Exposed](http://www.amazon.com/Programming-Interviews-Exposed-Secrets-Programmer/dp/047012167X)\n\n----\n**EDIT:** So this got much more attention than I was expecting! I will continue to check back when I can, but I apologize if I don't get to your question. I highly encourage any current or former Microsoft FTEs/Interns to chime in and offer some helpful advice!",
      "subreddit": "cscareerquestions",
      "score": 157,
      "url": "https://reddit.com/r/cscareerquestions/comments/z94la/iama_microsoft_engineer_who_interviews_candidates/",
      "comments": [
        {
          "body": "What's the process like to interview an intern? Any tips to prepare for it?",
          "score": 18
        },
        {
          "body": "Could you outline what constitutes an impressive portfolio?",
          "score": 13
        },
        {
          "body": "Hello and thanks for that! I am a soon-to-be computer science graduate and my primary concern is this: what skill level is expected from somebody who has just graduated? I mean in my university we are being teached mainly C with some java here and there and maybe some other stuff, depending on what courses I will choose to follow. Do they expect me to be a genious guy, developing apps and being in deep water since the first year of university? I have discovered my love for programming at about a year ago and learn many things myself (this is how I discovered reddit). However I feel to be less aable and really not able to compete with others who programm since high school or work already. What do you think on all that?",
          "score": 10
        },
        {
          "body": "I'm an Australian citizen who has just started my CS degree here. I know that the job market in the US is much more appealing and my plans are to one day relocate there. Are international applicants likely candidates straight out of University? Do you have any advice about what I should be doing over the next three years with regards to one day getting an internship or some position at a company such as Microsoft? Thank you.",
          "score": 6
        },
        {
          "body": "As a first year CS student what do you think are my best options to make myself valuable for the job market while finishing my degree?",
          "score": 8
        }
      ]
    },
    {
      "title": "Netflx's First Internship Program",
      "body": "Netflix is the last AFUNGALMASS to host an internship program so it's super cool to see a shift in direction. They only hire senior level SWEs, so it looks like they'll start having new grads/university program.\n\nHere are the postings:\n\n* **Software Engineer Intern - Ads and Marketing:** [https://jobs.netflix.com/jobs/56185209](https://jobs.netflix.com/jobs/56185209)\n* **Security Software Engineer Intern, Cloud Infrastructure Security:** [https://jobs.netflix.com/jobs/47956263](https://jobs.netflix.com/jobs/47956263)\n* **Device Ecosystem Software Engineer Intern, Partner Ecosystem:** [https://jobs.netflix.com/jobs/49474397](https://jobs.netflix.com/jobs/49474397)\n\nHere's the process:\n\nAfter applying, you will receive a questionnaire form.You can only interview for one role.\n\nAnd after that you will have to do a CodeSignal assessment test (different from typical CodeSignal).\n\nIf you pass this, you will be reached out by the recruiter with the following info:\n\nRound 1 (45min — current stage): The first round is a 45-minute technical interview with an engineer and is a pair coding exercise using CoderPad. Java is the preferred coding language. Overall, the general areas that the interviewers will be focusing on are predominantly:\n\n* General engineering/programming expertise\n* Questions will mostly focus on data structures and algorithms\n* Skills and experience in designing and developing maintainable software systems\n\nRound 2 (30min): This non-technical round will be with a recruiter at Netflix and will focus more on your working style and Netflix's workplace culture and values. Our approach to internships is different: we embed our interns in teams and aim to give them the experience of being a full time employee for the summer. This interview will probe your motivations and aptitude for working in the Netflix environment.\n\nRound 3 (45min): The final round will be a 45-minute conversation with the hiring manager. We will be assessing a mix of general soft skills, technical skills, and evaluate your ability to quickly absorb and execute on product development and business objectives.\n\n\\---\n\nWill make hiring decisions around March\n\nThey do have plans to give return offers \"based off the team's business need + exceptional internship performance.\"\n\nMost of this is basically a repost from Ladder: [https://ladder.to/community/swe/LlWXq6LdSzEkpEwIPSJq](https://ladder.to/community/swe/LlWXq6LdSzEkpEwIPSJq)",
      "subreddit": "cscareerquestions",
      "score": 1132,
      "url": "https://reddit.com/r/cscareerquestions/comments/lfjabg/netflxs_first_internship_program/",
      "comments": [
        {
          "body": "Would you mind illuminating me as to which companies are represented in the acronym AFUNGALMASS ?\n\nedit: just found it:\nAmazon, Facebook, Uber, Netflix, Google, Apple, Lyft, Microsoft, Airbnb, Snap, Stripe",
          "score": 456
        },
        {
          "body": "Netflix employees have said that this internship program has little intention of providing return offers for FT, this is why there are no new grad positions. The ones that do receive return offers are the rare exception, not the expectation.",
          "score": 391
        },
        {
          "body": "Is AFUNGALMASS a thing now, or did you just invent that?",
          "score": 77
        },
        {
          "body": "Lol I’d get my ass shredded in the technical interview",
          "score": 89
        }
      ]
    },
    {
      "title": "How I went from construction to Software Engineer.",
      "body": "# Preface:\n\nI have waited about 6 years to post this. I read and bookmarked several posts like this one to motivate myself and get advice from people like me.\n\nWarning: This is not a post about how I went from making 20k to 200k in 6 months while working full time. It's far more achievable and probably slower than you might expect.\n\n# Getting Started:\n\nAt 30 years old, research led me to Software Development. The pay and WLB were both far beyond what I had achieved up to this point in my life.\n\nI thought at the time that I would learn how to make mobile apps for Android. I started learning Java on [codeacademy.com](https://codeacademy.com). This was a long time ago, the site has had a complete overhaul. I cannot speak of it's current state. I learned enough to gain a bit of confidence and I was sure I would become a Software Developer.\n\nI was working full time in construction. Working construction is hard. Up at 5AM long commutes, hard work. I was never going to motivate myself. That's why I enrolled in community college.  I was making 48k at the time. Luckily I dropped out of college a long time ago and actually had credits for some of my general education. I found that I could complete my Associates degree in about two years while working full time.\n\nCourses I took (not sure it's that important):\n\n* Java, C++, SQL, PHP, Microsoft Access, Linux, HTML/CSS\n\n# Making a pivot:\n\nAfter some exposure to a few different languages and reading through different forums, including this one, I decided Web Development was the shortest path to success. I stand by this advice. When I took PHP in college this became even more clear. Weeks and weeks into Java and C++ we were printing stars \\*\\*\\*\\* to the console. With PHP everything was tangible. The browser provided enough that I could see something substantial in minutes, not hours.\n\nI learned HTML/CSS dead last on this list. If I could go back I'd definitely learn this first. I was about to get my AS and decided that I needed to learn JavaScript, which I would need to learn on my own.\n\nLearning Outside of School:\n\n[freecodecamp.org](https://freecodecamp.org) to be honest I haven't used it much in the past few years but for me it was the single best resource. I have heard great things about the Odin Project, but I cannot vouch for it.\n\n# The Shit Hit the Fan:\n\nMy boss in construction caught word that I recently got my AS and was interested in making a career change. He fired me immediately (although he knew I'd been in school).  My wife and I both had family in California. We picked up and moved in with her family. Things were pretty bad at this point.\n\nI was now in Fresno with the goal of getting my first job in development. There's a company in Fresno (and now the rest of the country) called Bitwise ([bitwiseindustries.com](https://bitwiseindustries.com)). Without going into too much detail, their philosophy is that underprivileged communities can teach themselves to code and improve their community by brining higher paying jobs. Anyway, it was the only place locally that I knew I could talk to other people learning and take Javascript / Angular classes for $250 for a six week class.\n\nSleeping on my sister-in-laws spare mattress made me the most motivated student at Bitwise. I was that annoying guy who wanted to meet everyone and talk about code all day to anyone. When a part time position was posted in the Bitwise slack. I was surely the first person to respond.\n\n# My First Job:\n\nDays away from going back to work in construction, I took a job offer that was now full time for $3,000/month.\n\nI was hired as a \"Developer Lead\" basically a large Silicon Valley web agency had most of their work done in India. It was my job to understand what was being made and communicate with clients. I was not on the hook for any code, but I was able to ease into it as I felt comfortable.\n\n# Pay Raises/Promotions:\n\nApparently I was pretty good at being a Dev Lead. I went from $36k, to $48k in a matter of months. Then the company my boss did all his work for hired me directly (everyone was cool with this) for $58,000/year.\n\nI know this is not good money, but remember I'm living at my sister-in-laws house and I've almost doubled my pay in 10 months while learning a lot.\n\nThere's a bit of falling out, a few other guys leave, I ask for more money, now I'm making $75,000/year.  I am suddenly the top dog and living up to expectations (yes 75k is low).\n\nOne year after 75K comes 85k. Then after about 6 months I was promoted to Development Experience Manager and making 92k. Keep in mind I'm still doing the same job I started doing for $3,000/year.\n\n# What about writing code?\n\nRight. I want to write code, not lead an offshore team. I had been studying React in my free time for about 3 years now.\n\nA designer who had left our company a year or so ago hit me up out of nowhere. She asked if I was interested in working at a startup as a React developer. I had just got my promotion, but I couldn't pass up the opportunity.\n\nTwo quick interviews later and I was a Software Engineer making $125,000/year. After 90 days I felt comfortable enough to make this post.\n\n# Key Takeaways(edit):\n\n* Learn early on what you really want to do.\n* Take a crappy job if you can afford to.\n* Study in your free time.\n* Make connections wherever possible.\n* Soft skills and networking are underrated.\n* Learn git  \n\n\nEdit: Proof:  \nNot that anyone questioned the authenticity of my story but...  \n7 years ago: [https://www.reddit.com/r/cscareerquestions/comments/4rm294/im\\_30\\_years\\_old\\_employed\\_full\\_time\\_i\\_want\\_to/](https://www.reddit.com/r/cscareerquestions/comments/4rm294/im_30_years_old_employed_full_time_i_want_to/)  \n\n\n6 years ago:\n\n[https://www.reddit.com/r/cscareerquestions/comments/5spjnu/can\\_i\\_expect\\_to\\_make\\_over\\_20\\_usdhr\\_before/](https://www.reddit.com/r/cscareerquestions/comments/5spjnu/can_i_expect_to_make_over_20_usdhr_before/)\n\n2 years ago:  \n[https://www.reddit.com/r/cscareerquestions/comments/liwttb/i\\_think\\_im\\_being\\_seriously\\_underpaid\\_can\\_i/](https://www.reddit.com/r/cscareerquestions/comments/liwttb/i_think_im_being_seriously_underpaid_can_i/)\n\n6 months ago:  \n[https://www.reddit.com/r/cscareerquestions/comments/wl1oz6/what\\_is\\_the\\_appropriate\\_job\\_title\\_for\\_this/](https://www.reddit.com/r/cscareerquestions/comments/wl1oz6/what_is_the_appropriate_job_title_for_this/)\n\n  \n",
      "subreddit": "cscareerquestions",
      "score": 1012,
      "url": "https://reddit.com/r/cscareerquestions/comments/10pqui2/how_i_went_from_construction_to_software_engineer/",
      "comments": [
        {
          "body": "Congrats! And thanks for putting the post together. Hopefully it inspires someone like you.\n\nAlso:\n&gt; My boss in construction caught word that I recently got my AS and was interested in making a career change. He fired me immediately\n\nSo, logically, he was afraid that he'd lose you because you'd find a non-construction job, so he made sure to lose you immediately?\n\n...that makes even less sense than when I would get rejected from retail things because of having a CS degree.",
          "score": 148
        },
        {
          "body": "Thanks for sharing 👍👍",
          "score": 104
        },
        {
          "body": "Congrats.  I’m 37, and am currently transitioning out of construction, where I’ve been for the last 15 years.  Almost halfway done with my BS in computer science.  Can’t wait!",
          "score": 32
        },
        {
          "body": "Most realistic rags to riches as opposed to the bootcamp for 6 months making $200k at FAANG bs",
          "score": 62
        },
        {
          "body": "Awesome post and straight to the point! I recently shared my journey from management to engineering and had more or less the same takeaways. \n\nFor me, the important lesson is to keep learning in your free time and if your employer can support it, then squeeze every ounce you possibly can from that time and opportunity. My employer offered me a part-time mentorship which probably worked really well in my favor. \n\nThe 2nd most crucial takeaway from your story is to be able to make connections and talk to people around you or teams that you would like to work in. It is highly underrated and believe me, knowing people outside your team or organization can open up new opportunities that you might haven't thought about before. Great post and I wish you all the luck in the world. More power to the people who wish to make the change and transition to engineering.",
          "score": 27
        },
        {
          "body": "Do you think your experience in construction gave you any sort of edge in terms of soft skills, resilience, or anything else?",
          "score": 21
        }
      ]
    },
    {
      "title": "I'm interviewing at Microsoft next week. Please advise?",
      "body": "I'm really pumped for this. I applied for an internship and got selected. What should I study? What angle should I present? Who was phone?",
      "subreddit": "cscareerquestions",
      "score": 21,
      "url": "https://reddit.com/r/cscareerquestions/comments/119tcf/im_interviewing_at_microsoft_next_week_please/",
      "comments": [
        {
          "body": "MS employee of three years, including an internship here.  \n\n1.  Ignore the \"How to Move Mount Fuji\" stuff.  That's at least 5 years out of date.\n\n2.  Ignore anything about how to dress.  Dress to what makes you feel comfortable.  I failed my first interview in a suit, was hired wearing blue jeans and a button down.  It doesn't matter.  No one cares.\n\n3.  Overall, explain your thought process.  You were picked for a reason.  Have confidence, but not arrogance.  Think about your decisions in designs, no matter what, and explain why you are coding/designing/processing the way you are.  \n\n4.  Discipline specific:\n\n* Developer:  Understand algorithm DESIGN (not just function) and data structure traversal.  Think about how to do conventional things in a non-conventional way.  How would you design a spell checker and what data structure would you use for dictionary storage and checking?  Code it.  Explain WHY you made those choices.  What was your thought process.  \n\n* Tester:  Think about how to break things in every way.  Boundary cases are key.  Think about breaking things that have always \"just worked.\"  Don't hesitate to say things that you would file as bugs unless they told you they are specs.  Understand that a bug doesn't mean \"broken.\"  A bug also means not intuitive, wouldn't work right in other cultures, and is not consistent with other paradigms.\n\n* Program Manager:  Think about how to design every day things with unrealistic constraints.  How would you design a toaster without a lever?  Improve the remote control to your TV.  ",
          "score": 16
        },
        {
          "body": "I dunno about internships, but when I interviewed there for a full time spot, it was all coding interviews and one behavioral interview. Just know your core CS topics (data structures, algorithms) and you'll be fine. Not really stuff you can 'study' for - they ask more 'think about it' questions and not 'regurgitate from a book' questions.",
          "score": 7
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "Binary Search Trees. You need to know them. Data structures of all kinds, hash maps, arrays, linked lists, and how to use them. Understand about caching information, when you would want to and how it can be done. Basically, having done multiple onsite interviews @ MSOFT for full time jobs, it boils down to \"do they know their shit\". If you can prove that you do (and gl bullshitting if you don't) then you're in. \n",
          "score": 3
        },
        {
          "body": "Read *How to move the Mount Fuji* in one week.",
          "score": 3
        },
        {
          "body": "Be prepared for some odd questions, such as, \"How would you test a pencil\" ... I got asked various unusual questions, that you can't really study for.\n\nHowever, you are likely to be asked to complete a programming test during the interview. Therefore, it would be a good idea to study all the different data structures (lists, queues, binary trees, arrays, stacks, etc.) and practice writing some algorithms. ",
          "score": 2
        }
      ]
    },
    {
      "title": "Just accepted my first job offer with no leetcode and what I've learned",
      "body": "Sorry for the wall of text in advance!\n\nI am still in school so I am pretty surprised (super senior though), especially because of COVID. I started applying in the summer and I did get a lot of feedback, I just think I didn't realize how serious the leetcode grind was and how most jobs I applied to administered hackerrank or a live coding session. After quite a few rejections, I decided that while my experience and resume was good that I need to work on my technical interviewing skills. So I decided that I wouldn't aggressively apply and instead passively apply and work on Leetcode until the next application cycle (next year since I wont have new grad status until starting spring) and if something hit it hit.\n\nWell something hit. I ended up interviewing with a startup in the New England area who absolutely loved me. Their team was great and any technical portions were more conversational and about projects I had worked on. In the end I accepted an offer for 72K with relocation assistance, profit sharing, unlimited vacation, and some other good benefits.\n\nWhat I've learned in my three months of applying and over 200 applications is:\n\n1. Do the leetcode grind to a point but do not be consumed. I think the earlier you start the better, because you won't be cramming and you'll have more time to let the information sink in through repetition and practice. For me, I didn't start too late, but with this being my first real application cycle where I sent my refreshed resume out I did have some anxiety because I didn't know what to expect. All but one company (the one I accepted the offer from) asked me some sort of leetcode question or had a technical interview.\n2. It doesn't matter if it is a big or small company they will still put you through the ringer. After the first two months of applying I realized that without decent leetcode practice I would keep getting rejections. Almost all interviews asked some sort of leetcode question(s) and they were in the easy to medium range.  All interviews had a minimum of three interviews (including the final).\n3. It mostly doesn't matter where you apply. This sub likes to post that if you apply anywhere in the midwest or low cost areas you'll instantly get a job or it will be a lot easier because they're hard up for talent. That is simply not true. I've sent applications to popular tech states like California, Washington, Texas, etc and states like Kansas, Michigan, Arizona, Virginia, etc. And it was the same experience. While my Indeed and LinkedIn reports for tech states would show 1000+ applications for a position the other states still had applicants in the 100's or sometimes more. I think because of Covid a lot more people are applying and in droves in all the areas you wouldn't think either. Also if you live in Florida, you might have a tough time if you're only applying here. Most companies are not looking for new grad or entry level. I had a friend who just got a job here after almost a year since graduation.\n4. Big N and top company interviews come from either networking or dropping your application when it first opens. I had the opportunity to interview at big companies like Amazon, Microsoft, IBM, fortune 500 companies, and national labs mostly because of friends or graduates from school.  I also reached out to recruiters on LinkedIn with some success.  I also wanted to see if my resume was decent enough to cold apply and so I applied when applications were first starting to come out as well and got decent feedback. For networking I always touched base with graduates from my school and started a conversation about their happiness at work and their work culture. For many of us who want to work at a big N, we know most of the answers to questions about the company and work culture, but the employees of those companies do enjoy sharing their joy. Make the conversation less about how you want a referral and more like wow you're working on really cool things and you love working there so much do you think you could help me achieve that same level of satisfaction because what a dream?\n5. GPA doesn't matter as much as you think. I only got asked my GPA if I applied to or was interviewed by companies at my career fair. I thought based off of those experiences applying was going to suck because I had a 2.1 GPA.\n6. Internships Matter. Most companies gave me the time of day because I threw myself at any campus tech opportunity. I work a really easy web dev job on campus, but maintained it for a year and recruiters loved that. I also worked at a student startup as a dev and later CTO as well and showed my impact there. They liked my initiative and drive for entrepreneurship with that one. I did it for that reason. It was unpaid, but I figured most companies would like that I expressed in interest in tech ownership. That became sort of a highlight on my resume because it showed an extended project turned LLC.\n7. Less than 100K doesn't make you a failure. A lot of new grad and entry level jobs were offering less than 100K even mid tier companies. The highest I came close to getting but failed the final interview was around 80K with I'm sure some wiggle room for negotiation. That 100K+ is certainly achievable if you work for a top company off rip, but not everyone can land an Amazon or Google job as an entry level and that is OKAY. The biggest thing for me to realize is there is always room for a salary improvement. I may not make 100K + now, but its not unreasonable for me starting here to do so in the next year or two with a job hop or promotion(s). You're not a failure because some of your peers beat you to it by a year or a few. Even now, I accepted the offer knowing that within the next 6 months or a year I will be pushing for a higher salary. Also we're all still killing it! These salaries and our career growth are amazing, especially in this current economy! [Less than 10% of Americans make 6 figures anyway](https://finance.yahoo.com/news/more-millennials-have-higher-salaries-than-gen-xers-boomers-185011477.html?guccounter=1&amp;amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;amp;guce_referrer_sig=AQAAABFbFNklIuN5OuD7a2Ox4YTv-UiMLHvrj6vouCKjHJWU0fQgiFRYQranBd_RQSxeq5HFz9-OZSX7S_19bsUpT3DMoh5KllyMqfjAWNQHCDDQDKu1zJU-cjTQ1mxDdOEz7kxst2LKJlfNXQ3-Sg77Ne1EFLbqdS6--PpxcQyFyUrL)\n8. It's also okay to feel dejected and like crap! It is a hard market and as new grad and entry level it can feel awful when you're applying in the hundreds with little feedback. It really makes you question your skillset and competency, especially when your friends are doing much better than you. Don't look at your friends success unless you're asking them for advice or a referral. Otherwise, be sad, complain for a minute, and within the same breath go straight back to applying. Something will hit eventually!\n\nI just wanted to post my thoughts. I know this sub can make getting employment seem dismal or like you're a failure if you didn't land a big N, but honestly just having gainful employment with the prospect of growth is a blessing. Ya'll we can do it!\n\nEdit: For those who don’t have any internships, I wouldn’t say you’re a failure either or it’s hopeless. I can only speak from my experience and how it was applying with internships and what made it easier. I did have friends however who had none. One friend only had research experience and got a great job at a national lab (mentioned his rec above). Another had 0 and works at Lockheed Martin. A closer one, only minored in CS and works for a private making decent money in Florida. He actually got a job in state, while I wasn’t able to get one. Meanwhile I had internships and at the time wasn’t get any bites. Really it’s all perspective. Your time will come!\n\nTLDR: Don't give up. You aren't worthless. It will happen for you too.",
      "subreddit": "cscareerquestions",
      "score": 1274,
      "url": "https://reddit.com/r/cscareerquestions/comments/jd5bd5/just_accepted_my_first_job_offer_with_no_leetcode/",
      "comments": [
        {
          "body": "&gt; In the end I accepted an offer for 72K with relocation assistance, profit sharing, **unlimited vacation**\n\nHey one piece of advice. Unlimited vacation ~~is~~ may also be code for less vacation.\n\nMake sure to schedule 4+ weeks of vacation well ahead of time. Talk to your manager early and often.\n\nI recommend scheduling, e.g. a long, very long vacation to somewhere you want to go, e.g. camping or to Europe or South America. Like 3+ weeks.\n\nWhen the manager will say, \"well I need you to be back after 2 weeks.\" You'll run into the fake part of \"unlimited\" vacation.\n\nThen you'll say, but unlimited vacation, I'm going to take 3 weeks off.\n\nThey'll say well I can't let you vacation for the rest of the year.\n\nMake sure you get the time off ahead of time, and then schedule your vacation before paying for anything.\n\n\n**EDIT**: Please see below for post by /u/t-tekin \n\nAsk about this in the interview. Ask specific questions that have specific answers. Go in with eyes wide open.",
          "score": 186
        },
        {
          "body": "2.5 gpa and graduating in December, you gave me hope thank you. I like to think my resume is not bad with 2 research experience and a publication, it’s just I’m too busy with school work(excuse, I’m lazy/ procrastinate), I haven’t started yet. You talked about next cycle, what’s the next cycle?",
          "score": 93
        },
        {
          "body": "Your title:\n\n&gt;Just accepted my first job offer **with no leetcode**\n\n&amp;#x200B;\n\nYour post:\n\n&gt;What I've learned in my three months of applying and over 200 applications is:  \n&gt;  \n&gt;**Do the leetcode grind**  \n&gt;  \n&gt;...  \n&gt;  \n&gt;**After the first two months of applying I realized that without decent leetcode practice I would keep getting rejections**\n\n&amp;#x200B;\n\n# Seriously what the fuck? I'm confused. Did people even read the post before voting?",
          "score": 75
        },
        {
          "body": "Honestly there needs to be more posts like this, this subreddit has a lot of posts of new CS grads with great qualifications not being able to get a job because they let their low self confidence get in the way. Many would feel depressed about getting 72k at a hcol area as well. You're good with it because you see it as a way of getting your foot in the door, and plan on increasing your salary based on your value in the field in due time. I think mentality is very important and you have that in spades. Thanks for posting this.",
          "score": 317
        }
      ]
    },
    {
      "title": "Microsoft Teams Interview Text Chat Scam",
      "body": "This happen recently when I was approached by a legitimate company via email with an invitation for a quick conversation then an interview. All professionally written and with the HR recruiter info all provided. However, as I agreed to an interview the HR recruiter informed me it was to be text based through chat (Microsoft Teams). Which made me a bit suspicious, as I did a bit of investigation and background checking the HR recruiter did have a verified profile as well as the company. After a few hours of digging I noticed that the email domain addresses did not match the addresses on the emails I received seems they were using .store instead of .com. also conveniently left out email and phone number information from the recruiter's signature info and replaced it with a company address. \n\nAs I patiently proceeded writing back an instructed the dubious HR individual that I'll will have a quick interview however, it had to be a video call via Zoom or Google meet which I do with all advertising clients. \n\n  \nHave not heard anything from the scammer at this point. When the email communication was back and forth. My take on it, they are now impersonating legit recruiters and managers just to get you on chat that way they hide their real identity and then start on what ever scam they want to perpetrate.\n\nBe cautious and look out for.\n\n 1. Interviews and meeting that seem rushed.\n\n 2. Email domains that don't match .store .org  most legit email follow this      \n\nformat \"name@companyname.com\" or name@companyname.net\"\n\n 3. Microsoft Links provided right away with out a calendar set up. (don't click)\n\n 4. Email domain from recruiter with no actual name. Says \"info\" or \"management\" \n\n 5. Text based interviews are a red flag most legit companies and client would not do this\n\nthere is a face to face business interaction that builds trust.\n\n 6. Microsoft Teams lets users hide their location\n\n 7. When in doubt ask for a face to face video call meeting. Just to double check   \n\nresearch the companies and recruiters info.\n\nStay vigilant fraudsters and scammers are getting more sophisticated.  ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1qdo58o/microsoft_teams_interview_text_chat_scam/",
      "comments": [
        {
          "body": "&gt;However, as I agreed to an interview the HR recruiter informed me it was to be text based through chat (Microsoft Teams).\n\nThis isn't a red flag, it's a smoking gun. Any \"interview\" that occurs entirely over chat is 100% a scam because the scammer wants to hide their face and their thick Indian accent.",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft teams chat interview",
      "body": "Hello, I am in the process of looking for a job, just moved to a new state, and I have been applying on indeed as well as Career builder. I recoved these messages yesterday, and I can't tell if this is a scam or a new common way to interview? \n\nI've had interviews on teams as video calls but they have not actually scheduled an interview and is just discussing the job over teams chat now.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1lz7iok/microsoft_teams_chat_interview/",
      "comments": [
        {
          "body": "I’d say it’s fake. They’re contacting you without offering you what role they want you for? In this market?",
          "score": 13
        },
        {
          "body": "This is a scam, no one gets head hunted for data entry roles or low level admin work.\n\nFurthermore each of those roles does actually different experience and skillsets. Yet they're asking you which one you'd like? Come on now..... terminate all comms with these scammers.",
          "score": 10
        },
        {
          "body": "\"Gmail hangouts\" and \"Google teams\". Sounds very suspicious. I would not click on the link they sent you. Also, hiring for a front desk remote position. How would that work?",
          "score": 4
        },
        {
          "body": "The infamous REO Speedwagon car?\n\nLMAO",
          "score": 4
        },
        {
          "body": "A remote role for front desk? Ha! That would be interesting to see. \n\nAnyone who invites you to an interview without specifying the role and without you applying to it is a scam.",
          "score": 3
        },
        {
          "body": "There is zero chance that that was a legitimate job.",
          "score": 2
        }
      ]
    },
    {
      "title": "How do I ace an interview for a role using technology I'm not familiar with (SharePoint &amp; Microsoft 365)?",
      "body": "A recruiter put me on to a role via LinkedIn that would include knowledge management for a healthcare foundation. We have a screening tomorrow (I called it an \"interview\" in the title because I'm taking it just as seriously). I come from a background in content management but this mostly involved marketing and communications (social media, web copy, blog writing, etc.).\n\nThe job description sent via the recruiter says the company is looking for someone who has experience using SharePoint and Microsoft 365, collects knowledge products, manages organizational taxonomy, and supports development of content metadata among other things. \n\nI'm not sure why this recruiter sought me out but I was just laid off and I'm very interested in this company / the role. I'm just not sure how my experience transfers or what I need to know. Any advice?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/11wyyq7/how_do_i_ace_an_interview_for_a_role_using/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "365 usually just means word, ppt, and excel, most people either have experience with those programs or their Google counterparts. \n\nSome people at lower levels will use those just to mean basic computer literacy. \n\nSharePoint, if you aren't familiar with, do some internet research and YouTube videos to get a sense of what it is. Be honest that you don't have experience with it, but you started looking into it and you were really impressed with (thing or reason)",
          "score": 2
        }
      ]
    },
    {
      "title": "My journey and tips: 2.9 GPA at a no-name liberal arts college with 1 mediocre internship —&gt; 4 FTE offers including FB",
      "body": "Since I've gotten so much from this sub, I wanted to see if I could give back a little and share my story / random tips. Hopefully it helps some of you out there. There was also some interest in my [preparation strategy while employed](  https://www.reddit.com/r/cscareerquestions/comments/622ceq/employed_engineers_how_do_you_allocate_time_to/dfj7tj5/).\n\n**TL;DR:** \n\ngraduated from a no-name liberal arts college 2 years ago with a sub-3 GPA and 1 internship at a small local non-tech company; went to work for a large \"unprestigious\" fintech company, then an unknown startup; got a few hits from Big 4 recruiters but always fucked around preparation-wise and never converted an onsite; FB recruiter messages me in Feb. and I decide to go all-in; studied ~150 hrs in 1 month+ with a full-time job and landed 4 offers out of 8 onsites (didn't go to 3 onsites).\n\n**Disclaimer:** \n\nI am not claiming that FB or any Big N or unicorn or w/e is the be-all end-all of companies. I'm not interested in debating whether they're overrated. This is aimed specifically at people who might be interested in pursuing these sorts of roles, and especially at people who don't think they can \"make it,\" because of background, etc. I'm also not claiming this is a fully general solution. This is just my journey and what worked for me—hopefully it will prove a little bit useful for you.\n\nEdit: I want to reiterate that I realize my school and GPA didn't get me into FB, but that my experience and interviewing did. I got in *in spite of* my school and GPA. My title is phrased as it is because of all the questions people ask on this sub about whether not going to a target school and not having an impressive internship *forever* precludes you from working at a Big N or unicorn. Clearly, I don't think so and I aim to provide some context and motivation to those who can relate. If that's not you, then hopefully the resources and tips are otherwise helpful. (Also quibble with the idea that 2 years out of UG counts as that experienced.)\n\n**On prestige whatever tf that means:**\n\nI see a lot of questions on here about whether it's necessary to go to a top whatever school, or whether you're screwed if you go to a public school or a no-name school, or \"will i ever make it to GOOGLE if i don't go to Stanford!?\". The short answer is: no, it's clearly not necessary, but of course it helps. My school was so small (less than 10 CS majors in my graduating class) that we didn't even have a career fair, let alone tech company recruiters visiting.\n\nWhat that means is that you kinda have to make your own path. You have to do the typical side project shit that's recommended here all the time, but may also have to do a bit extra in terms of networking (few of my classmates now work at a tech company, let alone a startup or big N), keeping up in tech (reading blogs, HN, etc.), learning (MOOCs, small exploratory side projects), and your resume/Linkedin/Github.\n\nOther things I did to try to set myself apart were taking the initiative at work and putting myself on projects that worked on \"hot\"/trendy techs (cloud, big data, ML) and maintaining a relatively polished resume and the like. Even when I didn't have an interesting project at work, I tried to keep myself busy with staying up-to-date and not letting my skills atrophy.\n\nRe: Linkedin/Github, I got my previous job at a startup through Linkedin, as well as my current job at Facebook. Definitely don't underrate it. I also had an interviewer at a Microsoft onsite specifically mention checking out my Github.\n\n**On imposter syndrome, learned helplessness, and failure:**\n\nLast fall, I was contacted by Google and Amazon. I halfassed an absurdly optimistic study plan, lucked my way through to onsites, and then failed miserably. And I mean failed. I didn't even code a brute force solution to at least 3 problems. It was brutal.\n\nThe issue was, I was scared of failing. Scared that I might do my best, and yet still fail. It was a lethal combination of learned helplessness, imposter syndrome, fixed ([vs. growth](http://www.aaronsw.com/weblog/dweck)) mindset, and self-destructiveness. If I didn't *really* try, and failed, well, maybe if I had *actually* tried, I would've gotten it! My precious ego was protected. My self-identity was safe.\n\nIn practice, what that meant was that I skimmed CTCI, did a couple Hackerrank problems in an IDE, read up on some algorithms and data structures on Wikipedia, skipped any problems that looked scary or intimidating (all Leetcode mediums+ and literally every single graph or DP problem), and convinced myself that practicing whiteboarding was a waste of time.\n\nNow, I know this sounds pretty dumb. But I also know this resonates with at least some of you. Don't fuck up like I did. If you truly want it, go after it and actually commit. Fuck being scared of failure. Don't preemptively discount yourself.\n\n**On obsessive studying:**\n\nIn February, I got a message on Linkedin from a FB recruiter asking if I was interested in applying to a Data Engineer role. I said enough was enough and decided to go all-in. I wanted to see what I could do if I truly applied myself 100%. I didn't want to regret not having done all I could.\n\nI wrote up a study plan and schedule, resolved to study about 3.5 hrs a weekday and 7 hrs a weekend day, read a bunch of motivational stories (like this one aspires to be), told my friends and SO that I'd be a shut-in for the next month, and hit the books. I kept track of [all the time I spent studying](http://i.imgur.com/vAtIJqp.png). I trusted the process. And it worked out.\n\nAs I expected, the first week was a struggle. I was getting lost with Leetcode easy problems. Wtf was a trie again? Etc. During this time, I also wanted to up the stakes and not \"waste\" my preparation, so I cold applied to a ton of roles. Probably over 150. I went through [the easy application list](https://github.com/j-delaney/easy-application), cmd-clicked every company I recognized, and applied to any and all relevant roles.\n\n**On study materials and studying tips**:\n\nDS&amp;amp;A:\n\n* Leetcode\n* Interview Cake\n* the Algorithm Design Manual\n* [Arden Dertat's list](http://www.ardendertat.com/2012/01/09/programming-interview-questions/)\n\nSystem Design:\n\n* [High Scalability](http://highscalability.com/)\n* [System Design Primer](https://github.com/donnemartin/system-design-primer)\n* [Hired in Tech](https://www.hiredintech.com/classrooms/system-design/lesson/55)\n\nSQL and data modeling:\n\n* [Mode Analytics SQL tutorial](https://community.modeanalytics.com/sql/tutorial/introduction-to-sql/)\n* [Kimball's The Data Warehouse Toolkit](https://www.amazon.com/Data-Warehouse-Toolkit-Definitive-Dimensional/dp/1118530802)\n\nI did 76 problems on Leetcode, about 75% easy, 25% medium, and a few high frequency hards. Did all of the Interview Cake problems. Had already gone through CTCI, so just skimmed it. Whiteboarded ~25 problems in total in detail (drawing test cases, iterating through multiple solutions, talking out loud about algorithmic logic and time/space complexity, etc.). Did about 5 complete mock interviews with my GF (including the \"talk to me about your background\" elevator speech portion).\n\nInterview Cake is pricey, but the cost/benefit analysis made sense for me. I focused a lot on quality over quantity, and it was a good fit there (big fan of the hints and iteration from brute force to ultra-optimized). The feedback from phone and onsite interviews was that I did a great job communicating my thought process and talking through efficiency and test cases.\n\nAnother thing I got good feedback on was my level of engagement. Prior to every interview, I looked up all my interviewers, any engineering blog posts, recent company news, etc. This made it easy to ask things like, \"I was looking at the recent announcement from [YOUR AMAZING COMPANY], how do you feel about it?\" or \"I saw that blog post your team did on BigQuery, what were some of the challenges you guys faced in refactoring your pipelines?\" I can't objectively back this up, but I do feel like this aspect is both overlooked and low-hanging fruit. (Plus, shouldn't you be curious about your future company?)\n\n**On stats and other interviewing process details:**\n\nFirst contacted by Facebook on January 18th. Signed their offer on March 28th.\n148.5 hours spent studying from 2/10 to 3/18. Avg: 4.13 hrs/day.\n\n8 onsites: FB, Microsoft, Yelp, Twitch, Venmo, Foursquare, Indiegogo, Capital One. Didn't go to onsites at Capital One (wasn't too interested), Yelp, and Twitch (latter 2 happened after FB offer). Converted 4 out of 5 (not Microsoft; was a general SDE role).\n\nOverprepared for my onsites with the exception of Microsoft (should've done more Leetcode hards) and FB (should've practiced more on SQL window functions and pivot tables). If I had studied more efficiently, I probably could've gotten away with 50 hours. But it was worth the peace of mind, especially since I wouldn't get another try for at least half a year.\n\nTraveled to 5 onsites in the span of a week ([schedule here](https://www.reddit.com/r/cscareerquestions/comments/61e0t1/how_do_people_get_so_many_offers_at_once/dfe3ra4/)).\n\nTalked to / interviewed with about 20 companies at the \"peak.\" Some ghosting on both sides, some rejections on both sides. (Somewhat funny, mostly infuriating ghosting story: AWS S3 recruiter wanted me to apply, we set up a phone coding interview, the day of the interview was the day of the S3 outage (:/), nobody called, recruiter said sorry they were super busy (understandable), some phone tag, I emailed another follow-up, complete radio silence.)\n\nReceived 3 takehome coding assignments. Didn't do 1, converted 1 of the remaining 2 into an onsite and offer. Spent about 20 hrs total on the assignments.\n\nNegotiated my offers a little with the help of [Haseeb's blog posts](http://haseebq.com/my-ten-rules-for-negotiating-a-job-offer/). Added about $25k to my total comp. If I had another big N offer, I think I could've done better on this front with FB. Ended up with a package totaling ~$185k.\n\n**On useful lists:**\n\nWhen interviewers asked if I had any questions, I stuck with a bank of questions that I believe went over really well:\n\n* What first attracted you to [AMAZING COMPANY] and what has helped keep you here over the years?\n* What are some challenges your team is currently facing?\n* What are you most excited about regarding the future direction of [AMAZING COMPANY]?\n* Walk me through the development workflow/process: do you guys do scrum or standups? Pull requests? How are tasks determined and assigned?\n* What are some projects I would work on in my first 90 or 180 days here? \n* What did you work on when you first got here, or alternatively, tell me about the project you're most proud of?\n* (to hiring managers/VPs/directors) When you think of a successful software engineer at [AMAZING COMPANY], what are the most common traits that come to mind?\n\nMy mostly sorted list of heuristics I would go through when stuck on a problem:\n\n* Always consider hash tables (dictionaries) with their O(1)-ness. (\"Tip: using a dictionary is the most common way to get from a brute force approach to something more clever. It should always be your first thought.\")\n* If at all array-related, try sorting first.\n* If search-related, consider binary search.\n* Start with a brute force solution, look for repeat work in that solution, and modify it to only do that work once.\n* Space-time trade-off! That is, for better time complexity, try using auxiliary data structures. E.g., do something in a single pass over an array—O(N) time—by using a hash table—O(N) space—vs. doing something in multiple passes—O(N ^ 2)—without using any extra space—O(1). What information can I store to save time? (Another example: O(1) get_max method for a Stack class stores extra information (the max at and below each element) to save time (instead of iterating through the stack O(N)).)\n* Try a greedy solution:\nIterate through the problem space taking the optimal solution \"so far\" until the end.\n(Optimal if the problem has \"optimal substructure,\" which means stitching together optimal solutions to subproblems yields an optimal solution.)\n* Remember that I can use two pointers (e.g., to get the midpoint by having one pointer go twice as fast, or in a sum problem by having the pointers work inward from either end, or to test if a string is a palindrome).\n* If the problem involves parsing or tree/graph traversal (or reversal in some way), consider using a stack.\n* Does solving the problem for size (N – 1) make solving it for size N any easier? If so, try to solve recursively and/or with dynamic programming. (Using the max/min function can help a lot in recursive or dynamic programming problems.)\n* A lot of problems can be treated as graph problems and/or use breadth-first or depth-first traversal.\n* If you have a lot of strings, try putting them in a prefix tree / trie.\n* Any time you repeatedly have to take the min or max of a dynamic collection, think heaps. (If you don’t need to insert random elements, prefer a sorted array.)\n\n**On weird things I did:**\n\nI used moda to help me stay focused and study. Wasn't necessary, but it did help (big YMMV disclaimer here). Didn't use it on the day of any interviews because I didn't want to make myself more nervous/anxious.\n\nI copied over all the solutions I wrote for Interview Cake and most of the Leetcode mediums and high frequency / notable easy problems into a local directory and pushed it to Github. I then concatenated all these files and printed it out. Took the stack of solutions with me when I was traveling the final week and looked it over on flights, etc. Basically just priming my pattern recognition.\n\n**On concluding:**\n\nIf you made it here, I'm impressed. I'm sure there's more I could write or that I forgot to include, but for now, that's it. Ask me any questions you have and I'll answer every one!\n\nAlso let me know if there's interest in my open-sourcing my pretty comprehensive Workflowy study guide.\n\n**Edit:**\n\nOverwhelmed by the response, and thank you very much for the gold! I will clean up my study guide a bit and link it here within the next day. \n\nFeel free to continue asking questions, and if I missed yours, definitely remind me! \n\n**Edit 2:**\n\nMy study guide is still quite messy, but I didn't want to procrastinate and let the perfect be the enemy of the good, so here it is: https://workflowy.com/s/wGqavcPQFm\n\nHope it helps, and if you have any improvements, please tell me.\n\nAlso, if people want to open-source it for real and somebody knows of an easy way to turn a Workflowy note(book) into a Github repo, please let me know :)\n\n(Note: I don't use this account anymore and am not able to reply to all the messages I get, but if you need personalized advice or even coaching, you can try emailing me at suryc011 [at] gmail [dot] com.)",
      "subreddit": "cscareerquestions",
      "score": 1914,
      "url": "https://reddit.com/r/cscareerquestions/comments/6278bi/my_journey_and_tips_29_gpa_at_a_noname_liberal/",
      "comments": [
        {
          "body": "Lots of helpful information here- thanks for the tips/resources and congrats on the offers!",
          "score": 103
        },
        {
          "body": "Just want to say congrats. You're a testament to what hard work can achieve. ",
          "score": 40
        },
        {
          "body": "About the disclaimer: I feel like I sort of have to go for the big tech roles. If I apply to average companies, I get 0 responses. They don't seem to want anyone without years of experience in java, spring, c#/.net, javascript/react/angular, swift/obj-c, hadoop/spark, etc., etc. But I do get interviews from tech companies, including big 4 and some unicorns. So it's not just about people getting a hard-on for big 4.",
          "score": 87
        },
        {
          "body": "Can you share your Workflowy study guide?\nThank you for sharing your journey it's very inspiring. ",
          "score": 28
        },
        {
          "body": "its your work experience that got you into FB, not your school.\n\nthe title gives the impression you got the FB offer straight out of school. you even drew an arrow. \n\nvery informative post nonetheless",
          "score": 161
        }
      ]
    },
    {
      "title": "My leetcode study guide",
      "body": "I interviewed at Google, FB, Microsoft, Uber and was never tested on a concept that I have not seen before.\n\n# Step 0 - You know how to code. (You can solve some Leetcode Easy Questions)\n\nCredits: u/keanwood\n\n\nPrereqs: You are comfortable with programming in general, and you can flesh out your thoughts via code.\nGo to codewars.com and do a few of their easiest problems (lv8 and lv7)\n\n### If you can't solve any Leetcode easy just keep revising easy questions. Easy questions do not require any algorithms except linear traversals and the likes. \n\n\n# Step 1 - Algo MOOC or book  \n\n  This is what I used:  https://runestone.academy/runestone/books/published/pythonds/index.html\n\nor this if you have time (avoid network flows):\nhttps://www.coursera.org/learn/algorithms-part1\nhttps://www.coursera.org/learn/algorithms-part2\n\n\n\nJust get to solving the actual questions as soon as you can. MOOC take a lot of time to complete and If you know the basic data structures and traversals, start step-2. If you do not know how to solve it (Which will be the case), look it up and upsolve.\n\nI already knew my way around basic data structures and traversals so I stared from step 2. \n\nFor me BFS/DFS is basic while Dijkstra's is not.\n\n# Step 2 - Coderust\n\nhttps://www.educative.io/courses/coderust-hacking-the-coding-interview\n\n### Do not buy educative. Search the questions on leetcode.\nI was not able to do most of them so please look at the answer and upsolve.  This will give you a great base to solve other similar questions. \n\n\n### This should be enough for Tier 2 companies.\n\n\n### FAANG/BIG N\n\n# Step 3 - Teamblind List\n\nhttps://www.teamblind.com/article/New-Year-Gift---Curated-List-of-Top-75-LeetCode-Questions-to-Save-Your-Time-OaM1orEU\n\n### In leetcode list format: [https://leetcode.com/list/xoqag3yj/](https://leetcode.com/list/xoqag3yj/)\n\n# Step 4 - A week before the interview\n\nCompany specific leetcode explore questions  \nCompany tagged leetcode discuss\n\n#\n\nThe hardest part for me was to come up with a proper plan as there are just so many questions and it's easy to get lost. Also please look at the solution if you can't solve it in 30 mins.  \n  \nFollowed this for 3 months and received internship offers from FB, FAANG(dont wanna get doxxed) and Microsoft. Hope this helps you as well.  \n\nGood luck!\n\n\nEDIT 1: Added a more descriptive step 0\n\nEDIT 2:\n# My LC count is 160.",
      "subreddit": "cscareerquestions",
      "score": 1754,
      "url": "https://reddit.com/r/cscareerquestions/comments/eb1e2b/my_leetcode_study_guide/",
      "comments": [
        {
          "body": "OP has big LeetCode energy",
          "score": 278
        },
        {
          "body": "My smart friends only need to do leetcode and review them for 3 months to pass big n interview. For me, the idiot guy, it took me 1 year grinding after work to have a job at big n.\n\nMy suggestion is to do 1 leetcode a day even you have a job.",
          "score": 229
        },
        {
          "body": "[deleted]",
          "score": 66
        },
        {
          "body": "Fucking LeetCode",
          "score": 43
        }
      ]
    },
    {
      "title": "Name and Shame: IBM",
      "body": "# IBM's (Terrible) Interview Process\n\nNow that I've finally landed a job for myself, I feel secure enough to go around and name and shame the places which offered a terrible interview experience. In this case, it's IBM.\n\nThe general interview process of IBM consists of two, sometimes three parts:\n\n* 1 screening interview\n\n* 1 phone interview\n\n* A \"finish line\" event\n\n\n## Technical Screening Interview\n\nBasically, you receive an email saying \"congratulations! you're being considered for &lt;x&gt; position!\" This is an automated email. There are no humans behind it, and there is a short deadline to actually complete the screen. If you need to extend the deadline for the screen, tough luck. If you need literally any accommodation, have fun. You won't be getting it. `no-reply`, bitches!\n\nThe screening interview requires:\n\n* A webcam with a clear view of you and your room\n* Granting a tool (admin) access to your computer to make sure you don't cheat\n\nwhich alone constitute a massive breach of privacy, in my opinion.\n\nThe screening interview consists of a basic coding challenge and *pre-recorded* video questions to which you must give a response. Your response must be in video format - it cannot be written. After you are delivered a question via video, you are given about a minute to formulate your response and then are required to narrate it back staring into your webcam. This is the lamest method of interviewing that I have ever come across. There is no human interaction, so there are no body language/social cues to work off of when narrating your response. It can't really have mistakes and it has to be delivered straight with no interruptions.\n\nThen there are other trivially easy coding challenges which literally anyone could solve, but they also require a verbal explanation of what you did. This is a bit easier because you have had more time to parse through your solution. It's still lame to talk into your webcam like it's a real person.\n\nWhichever brilliant mind at IBM thought video questions and responses were a great idea should be fired. Now that I'm not a desperate CS student, I don't see myself ever applying to IBM ever again simply because of how humiliating the *screening* interview is.\n\n## Technical Phone Interview\n\nThe phone interview is fairly normal. You're greeted by a bored interviewer who sounds like he'd rather do nothing more than jump out of the nearest window. He asks some useless brain-teasers (who the fuck does this) and a simple coding challenge. They place quite a bit of weight on the brain teasers - take slightly longer than average to work through the brain teaser and they'll mention it in a negative light. \n\nBrain teasers are the worst and provide literally no value in an interview. Whichever brilliant mind thought of asking these during a phone screen (looking at you, Microsoft) should be fired.\n\n## Finish Line\n\nThe IBM Finish Line event initially sounds fairly neat. You're flown in to one of their Finish Line locations in which you're treated a stay in relatively nice hotels. In the Finish Line event, you're randomly divided into different teams. At the kickoff dinner, you are presented with a problem statement and given 3 days to develop a solution. Your team consists of everything from prospective programmers to project managers to UI/UX designers.\n\nMeals are provided. During the event, IBM will take you on a tour of their nearby offices, focusing almost 90% of their time on Watson. In reality, only something like 10% of offers will be on Watson teams.\n\nAt the end of the event, you are to present your product in front of a board of \"executives\" in a standard slide deck format.\n\nI have to give IBM props for the idea here. When executed correctly, the Finish Line event sounds like an amazing way to vet candidates and introduce students to the IBM culture. However, in practice, I find that this fails terribly. It fails because of two reasons: *no technical vetting* and *politics.* And also because IBM has a soul-sucking culture and I'm not sure why they would ever try to advocate it.\n\nThroughout the whole event, there is literally no one vetting the candidates from a technical point of view. Sure, they have \"HR\"/social-side employees stopping by at tables to judge the behavior of people and single out people for early hiring, but there is *no one* that is actually trying to make sure that you know what you're doing.\n\nAnd so often, candidates will cheat on the interview. A girl at my table downloaded Python libraries for detecting faces in videos and claimed it entirely as her own. When asked, she said with a straight face that she wrote it. Bitch, you don't even know Python. You had to ask me for help on what `for` loops and `import` statements are. I had to give her a crash course on running Python code and using Git. This girl was fast-tracked to an offer on the Watson team. None of the IBM employees understood what she was doing because there were *literally zero technical people in the loop* - it just sounded/looked cool so her plagiarism went unnoticed.\n\nAnd finally, there's politics. Everyone's trying to backstab everyone. Even on your own team, someone is trying to one-up you. IBM makes sure that there are at least two people competing for the same position on each team which inevitably leads to this scenario.\n\nThese two issues seemed to summarize IBM. In essence, the feeling I got is that the company culture couldn't give fewer shits about actually creating decent software or solving any meaningful technical challenges. It was all more about keeping up appearances as a \"business.\" Business culture first, engineering second. This really rubbed me the wrong way.\n\nThe Finish Line event is a solid way to network with both IBM employees and other interviewees. If you can make some friends, you have great contacts to get referrals to other companies. Most IBM engineers I spoke with hated what they were working on. It seems the vast majority of the engineers I spoke with were working on legacy end-of-life technologies with seemingly no way forward for career growth.\n\nWhichever brilliant mind thought of not having literally any technical vetting during the on-site event should be fired.\n\n## The Offer\n\nFortunately, most people that attend the Finish Line get an offer. Unfortunately, the offer is shit. You're looking at $100k in Silicon Valley. $10k more if you're a grad student. No stock options and negligible raises. \n\nFor comparison, the average new grad offer in Silicon Valley at a FAANG company here is $160k. If you play your cards right, you can negotiate this to $190k+.\n\nWhichever brilliant mind thought that $100k is reasonable compensation in this location should be fired.\n\n---\n\nTo summarize:\n\n* The technical screen was shit\n\n* The phone screen was shit\n\n* The Finish Line was mostly shit\n\n* The offer was shit\n\n* Everyone here should be fired\n\n0/10, avoid this company if you can. Feels like it preys on desperate new grads. Aim higher.",
      "subreddit": "cscareerquestions",
      "score": 891,
      "url": "https://reddit.com/r/cscareerquestions/comments/97qhdo/name_and_shame_ibm/",
      "comments": [
        {
          "body": "Looks like a very elaborate HR circlejerk festival.",
          "score": 158
        },
        {
          "body": "&gt; given 3 days to develop a solution. \n\nI mean are you being paid for this? If not, that is absolutely insane",
          "score": 319
        },
        {
          "body": "&gt;Then there are other trivially easy coding challenges which literally anyone could solve\n\nI must suck since I wasn't able to solve a single one. They seemed LeetCode medium. ",
          "score": 164
        },
        {
          "body": "&gt; scoffing at $110k\n\n*cries in European*",
          "score": 459
        },
        {
          "body": "Is someone in this thread have positive experience with IBM? Just to complete the company picture.",
          "score": 91
        },
        {
          "body": "I just interviewed at IBM in Toronto, none of this happened to me, interviews were the normal CTCI style",
          "score": 92
        }
      ]
    },
    {
      "title": "My failed attempt to jump to a bigger ship w/ 3 YOE, hopefully someone finds it useful!",
      "body": "I have 3 YOE at a large (not well known) company, originally hired as a junior graphics programmer with some computer vision. Yet the last 3 years my company had me working in the C++ plumbing side of things, solving system-specific features/issues. More recently I was moved to a lead role for various IOS projects despite my annual requests for more graphics/CV roles. I’ve probably only written 4 shaders during my time here. I’ve kept my projects up to date, but they aren’t anything mind blowing. One weekend night, out of frustration I tossed some applications out there not expecting much, but to my surprise got callbacks for 10/13 positions, mainly at some of the giants in our industry. So I got to studying again, while continuing to work full time, and I only had 1 month to prepare. \n\n**The study plan:**\n\nMy primary areas of focus were as such in order of importance:\n\n1. Leetcode (85 done in 4 weeks)\n\n2. C++ (the usual, but with a focus on multithreading)\n\n3. Graphics\n\n4. Linear Algebra\n\n5. Hardware/OS\n\nI filled up 7 pages of paper back to back writing out my notes for #2-5. Monday-Friday, I'd do 3 LC questions from neetcode, where I'd attempt the problem first. After 15 minutes I'd watch the solution, then implement it on my own. Then I'd review the notes written up to the previous day, and write some more notes. For stuff like linear algebra I'd do a final exam w/solutions released somewhere on google from some university. Every Saturday and Sunday was dedicated to re-doing **all** of the LC problems I'd solved up to that point.\n\n**RESULTS:**\n\nMy resume got me good callback rates, and I made it to onsites for about half of the 10 callbacks. My study plan was great as well, there wasn't a single problem I wasn't able to solve, though they weren't always optimal. In the end, the odds didn’t work in my favor. Out of the 10 callbacks:\n\n*Made to onsites:*\n\n- **Some fruit company:** Did perfectly on phone screen, and the tech screen. Onsite I did well on about 75% of the interviews, but it was enough to drop me from the running. I knew I was out of my league here, but it was a valuable experience.\n\n- **A startup:** Crushed nearly everything, some of the interviews on the onsite were a bit shaky since it seemed like they were looking for a unicorn. I honestly used this one for practice, but did get an offer. However the comp wasn't great and I don't want to be at a startup at this point in my career.\n\n- **A game studio owned by Microsoft:** I did solve all the problems they gave me, but it required a hint or two from the interviewer. Someone definitely just did better than me here.\n\n- **Company that makes VR goggles:** They didn't ask me a single question related to graphics lol. From beginning to end it was LC, so again someone probably just did better/faster than me, even though I found optimal solutions.\n\n*Dropped after tech screen:*\n\n- **Rainforest:** I dropped the ball on a LC-medium question that could've been easily optimized, I wasn't on my A-game.\n\n- **A social media app:** Did well on the tech screen, but dropped regardless. Other candidates probably had better backgrounds.\n\n*Dropped after phone screen:*\n\n- **Companies Green, Red, Blue:** For all three, I suspect my lack of graphics driver experience was the culprit.\n\n- **An animation studio:** The devs on the team seemed to like me, but my lack of graphics research experience hurt my chances here.\n\n\nSome obvious pros/cons about myself I could pinpoint:\n\nCons:\n\n- Others likely had superior/more relevant projects/experience like with graphics drivers, subdivision surfaces, CUDA, etc. That would’ve helped me get past the phone screens for places like green and stand out better for the other stages.\n\n- All the tech screens were solely Leetcode. I at least solved all of the ones they gave me, but sometimes had trouble pinpointing how I could optimize or shorten some of them. More grinding is required for the top positions\n\nPros:\n\n- I am very experienced in various parts of the stack with multiple languages and platforms (which happened unintentionally because of my company haha). Companies were interested because of it, hence the good callback rate.\n\n- I may be an introvert, but I can communicate effectively and quickly build rapport. Even if a problem doesn’t go my way, I can talk my way through it and come up with at least a solution.\n\n- Open to relocating, and open to non-remote. This one is huge. It greatly increased my odds.\n\n**Conclusion:**\n\nI still have a job, and even if the comp isn't the best it's still good to live on and build some savings. Despite the stress, this ordeal helped me figure out areas I needed to grow in more and gave me confidence in other regards. I did damn amazing in the LC/technical for only 1 month of studying, and even I couldn't believe I got 10/13 callbacks.\n\nI’ll do my hunting more casually now. I still do want better comp and a job closer to actual graphics, but prepping for and doing 20+ interviews in the span of 3.5 weeks is god damn misery. Suffered severe mood swings. Seriously, don’t do this unless your firing is imminent or something.\n\nIf you're working fulltime with some YOE, and you think you want to switch jobs, don't start applying like I did. You'll get the callbacks. Plan out a study plan over at least 3 months, and take it slow. Apply to a few companies at a time, don't shotgun.\n\nI hope my experience helps anyone looking to do a similar transition!",
      "subreddit": "cscareerquestions",
      "score": 969,
      "url": "https://reddit.com/r/cscareerquestions/comments/usrwyf/my_failed_attempt_to_jump_to_a_bigger_ship_w_3/",
      "comments": [
        {
          "body": "&gt; 20+ interviews in the span of 3.5 weeks\n\nWhile having a fulltime job? You're crazy.",
          "score": 631
        },
        {
          "body": "[deleted]",
          "score": 164
        },
        {
          "body": "dude. \ni have no words. it seems like you are a very strong and solid candidate. the way you have written the post clearly shows that you are a very effective and articulate communicator. i can’t believe you didn’t clear the bar, even after doing well on your interviews.",
          "score": 279
        },
        {
          "body": "Pretty good retrospective. It'll be good to look back at this in a couple years.",
          "score": 60
        },
        {
          "body": "I'm in a similar position, but I'm 9 YoE total and 5.5 years at my current company. My TC is abysmal for my YoE and current market, and I've been working in a proprietary language/tech stack these past 5.5 years so it has been a major struggle finding work \n\nI put similar levels of effort into my after hour studies (no flying to anywhere but comparable hours). Also got to 10 tech interviews with companies, and final round with 5, barely didn't make it with the last three. Unfortunately this last month we've gone back to office, and with all the skills I've gained studying work is actually leaning on me hard to lead projects/take initiative (mind you I'm not even a senior engineer and the worst paid there, but somehow I have the responsibilities of one?)\n\nAt this point I'm burnt out and can't find the energy to keep studying outside of work, but obviously I can't just quit to make the time (being employed makes interviewing that much easier). So stuck at a crossroads, it is encouraging to see I'm not alone though. Power to ya!",
          "score": 51
        }
      ]
    },
    {
      "title": "Microsoft Teams interview scam",
      "body": "Just wanted to make others aware since this is the first time I saw this! Be wary of anyone who texts you offering an interview and then a link to microsoft teams. I got a little too excited, got into the chat, only for someone named **\"Larry Sahu\" from S2G Ventures** to ask for my name and location. The company itself looks legit (and might be idk) and the text I got didn't raise any HUGE red flags, but it wasn't until I saw others talking about microsoft team interviews being scams as well as not being able to find anything on the person I was messaging that I knew it was fake. Be cautious out there, job seekers!",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1fuqxei/microsoft_teams_interview_scam/",
      "comments": [
        {
          "body": "Andres Gimenez with Bloomer Biotech did this to me just now. Way to go Reddit. Thanks for the assist.",
          "score": 6
        },
        {
          "body": "MS Teams is a very normal platform used to interview. Usually this is camera-on for both parties. \n\n*Text* interviews, including text interviews on MS Teams are an indication of a scam. \n\nYou also SHOULD NOT be setting up the Teams meeting, you should *receive* an email with the Teams invite. You just show up at the time.",
          "score": 4
        },
        {
          "body": "This is my exact scenario. He asked me to answer 6 questions, then this morning I got an email telling me I was being offered a job. I asked multiple times what my position would entail, and he kept giving me information on the company. I have no idea what they actually do. He said based on my \"interview\" they want to being me on, Now he is asking for my bank name. The background document they sent asks for name, address, dob, driver licence.",
          "score": 3
        },
        {
          "body": "Same exact thing happened to me! \nHow can these people be stopped? \nIt’s so disheartening.",
          "score": 3
        },
        {
          "body": "Thank goodness for this Reddit. I'm on a team meeting with Larry Sahu right now. All automated responses. Googled his name and found this thread.",
          "score": 3
        },
        {
          "body": "Ok but you might be on to something. I got a series of texts that led to me joining a teams meeting with Larry Sahu. Here’s the text convo. I’m really not sure about this one. The company has a LinkedIn, website, and some matching employees on the site and LinkedIn. But something definitely seems scammy about it…\n\n“Hi, I’m Ms Tracy Brevard, I am the Talent Acquisition Specialist for Lancaster Investments and I’m pleased to inform you that your resume posted online has been reviewed and forwarded to the Management Team of Lancaster Investments for an interview. Are you available and willing to undergo this interview?  Reply (YES) if you’re interested to learn more about the position and interview. Thank You.”\n\nYes\n\n“This is for a remote position.\nThe positions available are: Administrative Assistant, Business Support, Customer Care, Copywriter, Digital Marketing, Finance and Accounting, Tech Support, Typist Clerk, Verification Entry/Data Entry, and Project Management.\n\nThis interviewing procedure will be a computer/smartphone-based interview and it will be done via “Microsoft Teams” Do you have Microsoft Teams on your PC or Smartphone to enable you to commence with the interview?”\n\nThank you for the opportunity! I believe the remote position is a great fit for my skills. I do have Microsoft Teams installed and am ready for the interview whenever convenient for you. Please let me know the next steps!\n\n“Great, Provide the Email Address linked to your MS Teams Account. Also, use this link and message Mr.Sahu on Microsoft Teams now. \n(teams link)”",
          "score": 2
        },
        {
          "body": "Microsoft Teams interviews aren't necessarily scams. \n\nIts like saying interviews that take place on the phone are all scams. Some could be... but simply being a phone call, or an MS Teams meeting, does not indicate scam by itself.",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft Teams Interview Fraud",
      "body": "I have recently received an email with some unreal offer for a Graphic design position.  \nWhen I checked almost everything looked legit, from the name of the sender, even with the email address from where is sent from, at first. Later on I found out domain was fishy.\n\nI always do research of the person who contacted me and that person has a legit linkedin profile.  \nThey sent the teams link for a interview, with requesting to meet like right now - so that was another doubt so I did a google search and figured out that it was Teams fraud.\n\nI found out next: \"If the victim falls for it, they’re asked to share their screen or give remote access through Microsoft Teams or Quick Assist. Once the hacker is in, they install malware, steal data, and, in some cases, lock the business out of its own systems with ransomware.\"\n\nWhen I asked \"her\" that I am not using Microsoft teams and suggested to catch up via Google Meet, they didn't reply.\n\nAs I mentioned, you might find the legit person on linkedin, etc, it's just a hacker that steals someone's identity.\n\nI am attaching the screenshots.\n\nDid someone had a similar experience?  \nBeware of these types of the emails.  \nCheers,  \nMilos\n\nhttps://preview.redd.it/njzo8fr0by1f1.jpg?width=1454&amp;format=pjpg&amp;auto=webp&amp;s=21a788a8600c704b9723c2bbf7bdcf8ba66250c5",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1kr6xo1/microsoft_teams_interview_fraud/",
      "comments": [
        {
          "body": "Very common scam. You could have known it was a scam right from the start because employers don't randomly reach out to people to offer them an interview. You have to actually apply to a job first.",
          "score": 2
        },
        {
          "body": "Good catch. It's definitely fraudulent. If you want to be a good samaritan consider forwarding it to either Authentic Brands Group or Karen B herself, but they may just ignore it",
          "score": 1
        }
      ]
    },
    {
      "title": "Recruiter wants me to shave my beard for interview",
      "body": "I had a Microsoft Teams meeting with a recruiter today. It was informal, but I still dressed in a dress shirt and dress pants. The guy is pretty nice, he kept telling me I should shave my beard for the interview though. I’ve had sales jobs, and I was in real estate and nobody’s ever asked me to shave my beard. I keep it trimmed, and it’s a short beard. It’s not like a ZZ Top beard or anything. \n\nIs this still a thing? He kept telling me it’s a personal preference, but he would shave it. Does it really matter? I’ve had my beard for like 12 or 13 years. I have a fat face, and it helps with that. Has anybody else been asked to shave the beard? It’s a pretty good job, but I don’t know how much it matters if I have a beard or not.\n\nEdit: I got an email saying the company didn’t want to move forward. This post is irrelevant now I guess.",
      "subreddit": "jobs",
      "score": 359,
      "url": "https://reddit.com/r/jobs/comments/1kdb5na/recruiter_wants_me_to_shave_my_beard_for_interview/",
      "comments": [
        {
          "body": "lol and then u go to the interview and the guy has a beard!",
          "score": 219
        },
        {
          "body": "Naw fuck that guy. I mean, ask an honest friend or stranger if its a shit beard but otherwise, no.",
          "score": 445
        },
        {
          "body": "I wouldn't shave it for a recruiter. Maybe if you were told \"we want to hire you but because of policy you'll need to shave it.\"  He just thinks it will make you a tiny bit more marketable because he gets paid a lot to get people a job.",
          "score": 147
        },
        {
          "body": "I’ve had to say that I would be willing to shave my face if the job required me to wear a gas mask. Can’t imagine doing it just to interview",
          "score": 21
        }
      ]
    },
    {
      "title": "Microsoft IC2 interview",
      "body": "Hi, I got an interview scheduled for Microsoft IC2 and they mentioned there will be 3 rounds. Can anyone help me with the level of difficulty and what all will be asked?\nThanks!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1of3tuv/microsoft_ic2_interview/",
      "comments": [
        {
          "body": "When did u gave OA I also gave OA last Sunday solved all questions but haven’t got any call ?\nMy friend gave 3 rounds of interview in \n1st 2 rounds system design and dsa questions were asked last round was kind of chill out round just asked about his job experience and stuff",
          "score": 1
        },
        {
          "body": "can i know for which role ? job id ?",
          "score": 1
        },
        {
          "body": "How’d it go",
          "score": 1
        }
      ]
    },
    {
      "title": "Text-based Interview via Microsoft Teams ",
      "body": "How likely is it that a text- based interview via Microsoft Teams a scam? I recently got an email that O'Neil Langan Architects wants to interview me for a entry level role. They said that it's a 30-minute text-based interview 30-minute evaulation test and then a take-home test that I need to turn in by the next business day. I'm kind of worried now that it's a scam. \n\nUpdate: I took everyone's advice and also trusted my gut and didn't do the interview. I also tried calling the company but got a recording.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1h9ub42/textbased_interview_via_microsoft_teams/",
      "comments": [
        {
          "body": "&gt;How likely is it that a text- based interview via Microsoft Teams a scam?\n\nLiterally 100%.\n\nLegitimate interviews happen via Teams, by video (or _very_ occasionally audio only). They do not happen - ever - by text.",
          "score": 3
        },
        {
          "body": "Sounds like a scam",
          "score": 2
        },
        {
          "body": "Scam scam scam.\n\n**No legit job will ever interview you by text. EVER.**",
          "score": 2
        },
        {
          "body": "Text-based interview?  Scam.",
          "score": 1
        }
      ]
    },
    {
      "title": "Worst most disrespectful interview ever. Name and shame",
      "body": "I barely ever post on reddit, mostly a lurker, but experienced something worth posting about. \n\nI was interviewing for a remote Network Engineer position, with CVS, the healthcare company, Walgreens competitor. This was the final round after 3 weeks and 2 pervious rounds.\n\nInterview was for an hour with the manager and his two employees. The manager asked if I had Microsoft teams experience, he was only looking for someone to support Microsoft teams, which is application support and far from network engineer. Which I found strange, I responded with I use it to collaborate on network issues with vendors and third party, but mostly use WebEx internally. \n\nHere's the turning point, after about 5mins, and my response. He stops his employee mid question to say based off what he heard he doesn't think I'm fit for the role. Again only in this interview, the emphasis on teams and being able to support only this application came up, which seemed highly unprofessional to pivot from a network engineer role to a application support role in the final interview. \n\nHe then continues on to tell me that the two other people he interviewed was highly technical (again only for Microsoft teams, not network engineer), more so than me. And that I would be a better fit for a lower level role for level 1 or 2 support. Because I don't have 4-5yrs of backend teams experience, belittling my 9yrs of IT experience in networking. \n\nHonestly at that point I should of ended the call, but was so stunned at the complete lack professionalism. It was so awkward, even his two employees on call looked as visibly uncomfortable on the call, as I did.",
      "subreddit": "jobs",
      "score": 950,
      "url": "https://reddit.com/r/jobs/comments/154ojrq/worst_most_disrespectful_interview_ever_name_and/",
      "comments": [
        {
          "body": "You can take control in interviews. That’s when you should’ve said, “I’m sorry, am I no longer interviewing for the open Network Engineer position? I am not interested in an app support role, as that is not what I applied for”. It isn’t any less defeating to be turned down that late but you could at least turn it and confront them about it",
          "score": 561
        },
        {
          "body": "Had something very similar. Big wig boss was obsessed with Teams proficiency. Was so excited to hear I know how to use Teams. Not SharePoint, not SAP, but Teams. \n\nI think for some of these people Teams is amazing. You can see people and they can see you! Plus being in the damn application all day through the pandemic, they think it's so critical. \n\nIt's just glorified video chat. That's it. Their time would be better spent coming up with strategies on how to collaborate not the technical details of how the software works.",
          "score": 117
        },
        {
          "body": "Comcast/xfinity. For a CSR role. They were hiring for 4 positions. They did a group interview/contest that pitted us against each other, openly, to win this amazing opportunity to work for $17/hrs for a corporation that doesn't give two.shits about its employees OR customer retention.  I walled out after the first hour (3 hour estimate long 'interview'). I was so embarrassed for everyone else in there.",
          "score": 65
        },
        {
          "body": "I interviewed with Leidos for a PM position. Phone interview was weird, two interviewers, they were very rude and very rushed. They were grilling me on every item on my resume and created a sense that they didn’t think I could do the job.\n\nI was mad because I’d gotten a babysitter just to interview!  I did not get the job.  In hindsight I realize they probably had a candidate lined up - but still - it was a pretty demoralizing experience.",
          "score": 43
        },
        {
          "body": "Went for an interview a few years back and got essentially yelled at for being late to the interview when I was 20 minutes early. He said he considered me late because I got there after the other 2 candidates, who lived walking distance from the interview and I was 40 minutes away",
          "score": 41
        },
        {
          "body": "Had an interview with CVS before as well and they are the most unhinged people to ever have an interview with. I did a video interview where I have to record myself and answer their questions. Then got to the hiring manager that was in a daze and confusion. I felt she was annoyed being there and I was wasting her time. Honestly, I’m glad you walked away. I have senior managements I work with now that left CVS because the environment and expectations were terrible.",
          "score": 34
        },
        {
          "body": "I'm old and have worked for a lot of startups, so I've run into a ton of shitty interviews. Here are some of the worst:\n\n1) \"We think you're perfect for this role, but we are doing the last round of interviews tomorrow in Dallas. Can you get here by 10am?\"\n\nI drop everything, call off work, catch a red eye, rent a car, iron my dress shirt in a public bathroom, then... Get stopped in the lobby. Turns out the guy who wanted to interview me had already planned not to be there that day. No one else in the department or HR was willing to talk to me, either. \n\nThey also fought reimbursing me, as the interviewer denied approving the expense. Even with the email invitation as proof. He accused me of faking it. You don't have to be Captain Obvious to know I didn't take that job.\n\n2) I interviewed for a role with a direct competitor. 2/3 of the panel didn't show up, and the third kept relentlessly pounding me for confidential data. When it became clear I wasn't going to provide it, he ended the interview without even a thanks or goodbye. I didn't need to Get (My) Guide to know I wasn't ever actually being considered for that role.\n\n3) 38 emails. 7 in person interviews in three cities on two continents. 3 personality tests. 4 real life free take home consulting projects. Twice introduced to my team. Shown my desk, twice. Nine months for the entire process. Their end decision: \"we think you're indecisive.\" If I were a wax figure in a museum, I would've melted down at that point. Fuck them and fuck my mentor inside the company who kept encouraging me to continue the process.",
          "score": 37
        },
        {
          "body": "Spark Media.\n\nPut me through six weeks of interviews knowing my salary expectations from the first interview...which I reminded them of multiple times, IN WRITING.\n\nFinally move to the 'offer' stage.  Was told I would receive my offer letter by that Friday (this was a wednesday).  Nothing comes by Friday so I emailed.  Was told to be on the look out Monday.\n\nMonday arrives...EOD, nothing.  Tuesday comes. Nothing.  I didn't email until Wednesday and was told (rather tersely) that the offer would come when it was ready.\n\nThursday.  A call is set up with me to 'Discuss offer.\"\n\nDiscuss offer?  What's to discuss. I've made my expectations known from the start.  I know damn good and well that I'm not going to be taking this job, but I decide to hop on this call because I'm going to tell these people off.\n\nSure enough.  The offer is 40% under what my salary requirements were.  I was livid.  I told the woman who had been in charge of the process that I wad disgusted, offended, felt like my time had been deliberately wasted, and their behavior was absolutely unacceptable.\n\nI burned them hard on Glassdoor.  They kept trying to get my review removed.  I found out after that this was stand practice with SPARK MEDIA.\n\nI'll never forget it.  \n\n\nETA:  What really pissed me off was the woman who I was to be working with kept encouraging me to go on ahead and give my notice at my current gig.  They wanted me to quit and then be able to low ball me and get me on the cheap.",
          "score": 38
        }
      ]
    },
    {
      "title": "Recruiters and interviewing managers think I’m reading off ChatGPT because I can actually form coherent thoughts off the cuff.",
      "body": "This is weird because I’ve been in phone interviews and zoom/teams interviews where they will cut me off and go “rephrase. What does that mean?” I’ll say it another way, they’ll go “say it another way..” then go “ok what does that actually mean?” And I’m not just doing buzzword garbage vomit. \n\nI work in IT so I have a lot of technical projects on my resume. I can also talk technically about high level concepts as well as projects I’ve been involved in, but on the last two phone interviews I have been chastised for “talking too formally” and “clearly reading off ChatGPT……. \n\nEdit:\n\nHere is an excerpt from the conversation. \n\nFor example “give a time where you used intune to deploy and manage assets”\n\nI’ll talk about how I made unattended install packages for deployment of work related programs,\n\nI’ll talk about how I imaged laptops and desktops using an image I made. They then go “ok. What is Intune?”\n\nI’ll tell them a centralized asset management platform that you can both enforce deployment policies, as well as manage computers, mobile devices, software, as well as it works seamlessly with  other Microsoft products.\n\nThey’ll then go “explain what do you mean by manage assets?”\n\nI’ll explain that assets can be anything from physical computers, to tablets, phones, etc. Technically assets could be extended to mean user objects also.\n\nThey’ll ask “ok why would you consider a user object an asset” I would explain that in Active Directory user accounts are classified as objects, and while they are technically not physical in the hierarchy of Microsoft’s ecosystem, they are objects and therefor an asset that can be managed in Intune.\n\nThen I’ll clarify and go “but if you mean purely in the sense of deployment, then that would extend to just laptops, phones, tablets, desktops..”",
      "subreddit": "jobs",
      "score": 421,
      "url": "https://reddit.com/r/jobs/comments/1n2hfam/recruiters_and_interviewing_managers_think_im/",
      "comments": [
        {
          "body": "Humor and real-life anecdotes are good directions to inject some clear humanity. \"Well I'm flattered that you thought my answer was that perfect, but no 😊 . Here's an example of me implementing this concept.\" Probably should be working more anecdotes in anyway if you're getting this reaction.\n\nI feel you though, I'm still reeling from ChatGPT tainting my decades-long love affair with the em dash.",
          "score": 268
        },
        {
          "body": "At my office, we call this \"being Cassandra\" because you'll be speaking truthfully but nobody will believe it. More likely, they don't understand it and they can't admit you are able to do it.",
          "score": 43
        },
        {
          "body": "I read through a bit of the conversation here and it sounds like you may be speaking on an engineer's level to HR and managers who don't understand the technical details and don't share your vocabulary. One of the things I always try to do is find out who I will be interviewing with and look them up on the company website or LinkedIn, or just by Google search and see if I can get a sense of their job title and experience level. Knowing something about who is on the other side of the conversation can be really helpful in preparing your mindset going into the interview. If you're talking with HR and hiring managers, dumb it down at the outset. If you're in the room with the Senior engineer, whip out your impressive field-specific vocabulary. ",
          "score": 32
        },
        {
          "body": "If you're coming across as sounding like a chatbot then your problem isn't being able to form coherent thoughts off the cuff. It means you're either reading from, or naturally coming up with something overly formal that talks around the issue instead of getting to the core of the point. If they're asking you multiple times to rephrase then they and you probably disagree on the question being asked, so you should ask them for clarity on what they want you to talk about.",
          "score": 45
        }
      ]
    },
    {
      "title": "Is Sonde Health a Scam?! I just spend over an hour in a text interview with them on Microsoft teams. and I can't even find their recruiter on LinkedIn.",
      "body": "The first email I was sent is pasted below:\n\n*\"After thoroughly examining your CV, which we obtained through Indeed boards, we think you will be a great fit for our* \\[position\\] *post. As a result, we would like to extend an invitation to you for the process' next steps, which include an interview with the recruiting manager.*\n\n*We want to learn more about you during this interview, and you can ask any questions you may have. We want to make sure that your aspirations and goals align with both the role and the culture of our organization. Please let us know when you are available for an immediate online interview in your response.\"*\n\nI replied and was sent the following email:\n\n*Congratulations on making it to this step of our screening process for a remote senior speech and audio engineer at Sonde Health. We’d like to know more about you, so we prepared a detailed job description and company overview that will give you a glimpse of Sonde Health. We ask that you please read the attached job briefing and company overview to understand and schedule your interview through Microsoft Teams.*\n\n*Job ID:* \\[position\\]\n\n*Company: Sonde Health*\n\n*Type: Full-time*\n\n*Location: USA (remote).*\n\n*How to schedule your interview*\n\n*Please go through the information and install Microsoft Team on your iOS or Android tablet or mobile device. You can also follow the simple sign-up procedure to create an account. Click the interview link: \\[link\\] to start a new conversation with your interview manager. Ms. Alexis Collins. You can also send me an email to assist if you run into difficulties setting up the Microsoft Team. Have a great day!*\n\nTurns out the interview manager's name is actually Alexi Collins (strange how they would get their name wrong). During the interview, there were no responses to my replies, but even more interestingly, I was hit with this:\n\n*\"Should you be offered the job, we’ll provide you with all the working equipment you’ll use for work, all costs covered entirely by the company but you are required to purchase and own a second (separate) smartphone which will serve as your business line, best purchased through your existing postpaid account you have with your current carrier or through our partnership with Verizon wireless. You will however be reimbursed for this expense through your startup funding customarily. \"*\n\nHave I just wasted an hour of my life on this stupid scam?!?!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/181n1k9/is_sonde_health_a_scam_i_just_spend_over_an_hour/",
      "comments": [
        {
          "body": "Text interviews are scams. The hiring process for a remote job shouldn t be that different from an on site job.",
          "score": 6
        },
        {
          "body": "Scam",
          "score": 3
        },
        {
          "body": "100% a scam. A text interview is a huge red flag.\n\nThey just want you to use your USA ID to cash a check. This is how the scam works.\n\n\\- They will send you a several thousand dollar check to buy the equipment, you go ahead and deposit it into your account.\n\n\\-After 2 or 3 days when you see the balance in your account you go and purchase the equipment.\n\n\\-Once you get everything, they will ask you to return whatever is left so you send them back another check. But this time a real check from your own account.\n\n\\- Finally the bank will find out the check is fake and guess what? The bank will take all those funds from your account even if it becomes negative and now you are screwed. you can return the equipment to the store but still you sent them money and that's your loss. At that time they already cashed your real check and stole your money.\n\nBanks take several weeks to fully process a check even though the funds become available in 2-3 days.\n\nIf a company provides office equipment, they will send it, no one will ever ask you to go and buy it with their money. It makes no sense.",
          "score": 2
        },
        {
          "body": "A scammer posed as Sonde Health, which is a legitimate company. You should email Sonde Health to tell them so they’re aware.",
          "score": 1
        },
        {
          "body": "remote jobs that pay well aren't real (accessible to public anyway)",
          "score": 1
        },
        {
          "body": "Thank you for posting this. I got the exact same email. I went through the interview process and sent them the onboarding paperwork, which included my SSN, a copy of my license and signature. Then found your post. I looked back at the initial email I received and realized the address was from admin@sondehealth.co and the company site is sondehealth.com",
          "score": 1
        },
        {
          "body": "I got a similar message but mine had a specific job title and was supposedly signed by Erik Larsen (the svp clinical dev and customer success) but I had the same txt interview with Alexi, she was responsive during the txt interview on teams and told me hr should contact me next week along with provided a phone number",
          "score": 1
        }
      ]
    },
    {
      "title": "I'm having my first ever virtual interview tomorrow (over Microsoft teams) and I would like some advice",
      "body": "Hi\n\nI applied for a work from home role and it is a customer service job.\n\nI have my interview coming up but I'm really nervous as I will be doing my interview via my smartphone .\n\nI need advice.  Shall I just do it or cancel the interview. Will it look unprofessional to use my phone?\n\nMy laptop decided to not work. \n\nThanks",
      "subreddit": "jobs",
      "score": 12,
      "url": "https://reddit.com/r/jobs/comments/wr39ip/im_having_my_first_ever_virtual_interview/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "For the past 8 months I have been completing 20-30 interviews per week as a recruiter, purely via remote video call.\n\nI have had interviews where the first 10 minutes involved both me and the candidate disconnecting and reconnected to fix audio and video issues.\n\nI have had interviews where the candidate was in a public library and kept getting ssshed.\n\nI have had interviews where the candidates video wasn't working.\n\nI have had interviews where their laptop died half way through.\n\nI have had interviews where MY laptop died halfway through.\n\nI have had interviews where I heard babies crying,  dogs barking, even one where a candidates building was doing systematic fire alarm tests.\n\nMy point is, remote interviews are not ideal for all people, if the interviewer and the organisation have their shit together,  then how you join the call will not be important,  the content of your answers will be.\n\nIf they reject you for joining with your phone, then they have their priorities messed up in the process,  and it's a red flag for what they would be like to work for.\n\n\nIn saying all of that,  if you are concerned, send a short email to whoever sent you the invite 'I want to make you aware that I am having issues with my laptop, please be advised that I will attend the scheduled interview via the camera on my phone'\n\nSend it a couple of hours in advance, or tonight if you can, don't apologise for it, don't offer to cancel the interview, just let them know.\n\nIt gives them the opportunity to reschedule if they feel it's an issue, and if for whatever reason you get rejected and joining via phone is part of the reason given, then you can remind them that you gave them as much notice as you were able to.",
          "score": 31
        },
        {
          "body": "I think the phone should be fine, but I would suggest you find a good way to have it propped up and STABLE. You don't want to be moving it around and shaking it like an earthquake.\n\nOther than that, remember to make \"eye contact\" which means look into the camera. Feels awkward, but it leaves a better impression.",
          "score": 5
        },
        {
          "body": "Make sure it works before the interview. My first interview on Microsoft Teams was embarrassing. I was using the website and the audio and video didn't work. I ended up doing ok and making it to the second round, but still. You don't want this to happen. It's better to have everything go smoothly. Now I only use the app, because that's the only way everything works.",
          "score": 3
        },
        {
          "body": "Do it on your phone, it'll be fine. Make sure you have your phone elevated in a way so it looks like you could be on a computer. Have a sticky note next to the phone if possible with key words - not full sentences to remind you of what you bring to the table. Good luck!",
          "score": 2
        },
        {
          "body": "Do a test, make sure it’s propped up securely and you can be seen at a good angle, test the microphone and any early buds/earphones as well.  They won’t know it’s on your phone.  But might also be helpful to get the app vs using the web browser. Obviously logon early.",
          "score": 2
        },
        {
          "body": "My first went quite well, until she declined me. Biased woman.",
          "score": 2
        },
        {
          "body": "No one is going to notice if you do it on your phone… literally only you will know lol",
          "score": 2
        },
        {
          "body": "You may well find the quality of the mic and camera, as well as flexibility with camera angles provides a better experience than a built in webcam on laptops (which many candidates would use by default), so this could actually be an advantage. \n\nLike many have said on here, give it a few test runs (maybe try a teams call with a friend on their pc/laptop, preferably with you in same room so you can see how you are seen on the other side of the call). \n\nNot having to stress or worry about this will give you a confidence boost on the day too! Good luck.",
          "score": 2
        }
      ]
    },
    {
      "title": "Data Entry Microsoft Team Interview, chat only no video call no phone call nothing just chat! This has to be a scam right?",
      "body": "I applied to various remote data entry jobs as it seems like it'd be a cool job to work form home and I already have experience with data entry with past jobs. Well I've been getting some texts and emails about an interview they require me to download Microsoft Teams to do the interview, so I did and I've had 3 so far and all of them want to do the interview chat only? It's so weird to me I feel like every company when hiring someone would want to do voice call or video call or in person! I looked it up and lot of people were saying its a scam, which I could honestly see, but I was just curios if anyone had experienced this before where they did a Microsoft team chat only and actually got hired onto a company cause it just aint making sense to me!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1foo9ui/data_entry_microsoft_team_interview_chat_only_no/",
      "comments": [
        {
          "body": "Of course these are scams dude. No legit company hires through a virtual chat.\n\n\nAlso, you should know that data entry jobs are more or less obsolete, and 99% of these \"jobs\" are scams. But either way, anytime a prospective employer wants to \"interview\" you through a virtual chat, it's a scam.",
          "score": 4
        },
        {
          "body": "Data entry is a nearly obsolete role. Remote roles for data entry are likely scams.\n\nWhen a company does a virtual interview, they send you a link. You should not have to download anything and it shoukd be face to face with a real person not chat.\n\nSo, you're right, it doesn't make sense because it's a scam.",
          "score": 3
        }
      ]
    },
    {
      "title": "Anyone knows how technical interviews with Microsoft for cybersecurity technical support \"security compliance\" interview go",
      "body": "Soon I have an interview for a \"cybersecurity technical support engineer \" position with Microsoft. Anybody has any tips, recommendations, suggestions for how to prepare oneself for such an interview?\n\nThanks!!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1dsgtjc/anyone_knows_how_technical_interviews_with/",
      "comments": []
    },
    {
      "title": "Interviews on Microsoft Teams?",
      "body": "\nETA 2: Nope, definitely scams. I decided to try since many of you said Teams are legit. I scheduled an interview and set up a Microsoft Teams account. They ended up trying to sign into my account from Germany. Thankfully, Microsoft alerted me there was a sign-in attempt. \n\nThey are pretty obvious in their stupidity. They speak broken English, can only interview on Teams, and want to interview RIGHT NOW. I really wonder where the legit jobs are anymore.\n\n\n\nETA: Thank you for responses, I will start taking these emails more seriously!\n\nHello!\n\nI am applying to jobs, and many emails I get say that people are \"required to interview through Microsoft Teams\". I have been assuming these are scams, but just thought I would do my due diligence and ask if some companies actually use this platform. Thank you!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/19bc3ju/interviews_on_microsoft_teams/",
      "comments": [
        {
          "body": "My company uses Teams for interviews. Outside of WebEx and Zoom, I don’t know what else people would use for remote interviews that could be more legitimate. You need all that authentication and what not to register. They aren’t exactly “scammer friendly” as you can’t really make endless new, anonymous accounts like with sketchier platforms like Signal.",
          "score": 7
        },
        {
          "body": "Very common for big boy jobs",
          "score": 4
        },
        {
          "body": "I'd honestly be suspicious of any job that doesn't use some sort of video meeting platform for at least the first interview. It's probably 99.9% of company's that do this. Not a scam. I mean, scams might also say it so don't be dumb, but yes it's exceedingly common to interview over Teams.",
          "score": 3
        },
        {
          "body": "Yes they do.  Human Capital (hilarious name) and my boss both in other cities called me on Teams at my office and laid me off after 15 years with them.",
          "score": 2
        },
        {
          "body": "A video or phone call is legitimate, but anything where they want to chat with you via the messaging system is a scam, to my knowledge. They always ask vague, broken questions or request a screenshot of your credit information through some random link. \n\nJust had one today where they baited with a Zoom interview then asked for my credit information first. Once I challenged them, they fought with me. Very professional! Look out for \"LCG Technologies\", they're a commonly used name in scams like this.",
          "score": 2
        },
        {
          "body": "Yes they are scams, they also text you as well with the same.",
          "score": 2
        }
      ]
    },
    {
      "title": "Microsoft Teams or In Person Interview?",
      "body": "So I just received an invite for an interview on Thursday. The invite is for a Teams meeting but here's the thing, this is an internal posting. I'm in the office and the hiring manager is literally a 2 minute walk from my office. Am I too assume that the interview is supposed to be virtual? I have a feeling he may have overlooked putting his office as the location. Perhaps it's an indirect test? Thoughts?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/18k669d/microsoft_teams_or_in_person_interview/",
      "comments": [
        {
          "body": "You should take a sick day leave to do the virtual interview",
          "score": 1
        },
        {
          "body": "Just ping the hiring manager: \"Hey noticed the interview is posted with a Teams link but since we're in the same building would you rather do it in person?\"\n\nDoubt it's a roundabout test or something. Probably just that they're used to putting Teams links on everything so don't really have an exception in place for internal roles.",
          "score": 1
        },
        {
          "body": "If they sent a Teams link _and no physical location_, it's intended as Teams, yes. If they sent an outlook appintment with a physical location, and it also happened to have a Teams link at the bottom, that was the default link that appears any time an invite is made.",
          "score": 1
        },
        {
          "body": "Maybe it's more convenient since he won't have to book a room?",
          "score": 1
        }
      ]
    },
    {
      "title": "Here's what I learned from going on 50+ interviews (including Google, Microsoft, Uber &amp; Twitter)! [x-post r/findapath]",
      "body": "This was really well received over at r/findapath so I figured I would share it with you all here at r/jobs!  \n\nAfter graduating with a biology degree and working a miserable job in a small town, I moved to New York with absolutely NO contacts and the dream of working for a company like Google.  \n\nI spent the next 12 months building a strategy and went on over 50 interviews. By the end I had interviewed with Google, Microsoft, Uber &amp; Twitter and landed a 216% raise.  \n\nI spent the past few months analyzing what worked, what didn't, and consolidated all of my learnings into one post with the hope that it may help other people do the same. [Feel free to check it out here.](http://cultivatedculture.com/how-to-get-a-job-anywhere-no-connections/)  \n\nAlso, please feel free to ask any questions! :)",
      "subreddit": "jobs",
      "score": 92,
      "url": "https://reddit.com/r/jobs/comments/4empdq/heres_what_i_learned_from_going_on_50_interviews/",
      "comments": [
        {
          "body": "Honestly, I think you got the interviews because of your work experience and the fact that you went to a good school. Yeah, you probably tried a few ways to avoid the resume black hole that may have helped, but your career has had a definite progression that culminated in working for a big name. That's cool, but not really impossible considering your background.",
          "score": 9
        },
        {
          "body": "I really appreciate that you posted this. I am graduating with my bachelors in the next couple months, and I applied to a job I don't think I am fully qualified for, but I applied anyway. I was a little nervous about not meeting all of the criteria, but I am going to use some of the ideas that you shared.\n\nAgain thank you for posting this! Your article gave me a confidence booster. ",
          "score": 5
        },
        {
          "body": "Your blog doesn't mention what your role is but it must be tech-oriented based upon the companies you mention. Can you expand upon what you do at the company you got in? It almost sounds like your job role changed and not just merely go to another company that pays higher. Did you get any hostility or the cold shoulder when reaching out on LinkedIn?",
          "score": 5
        },
        {
          "body": "Don't network...your best way to get in is by referrals. \n\nGot it. ",
          "score": 12
        },
        {
          "body": "Tells people not to cold email asking for a job and step one recommends cold emailing people....... ",
          "score": 13
        }
      ]
    },
    {
      "title": "I have to take a Microsoft test for a job interview, is there anything I should know or helpful information?",
      "body": "I have a job interview tomorrow, but I have to take a Microsoft test on word and excel on both normal and pro, as well as business writing. I always get really nervous during these tests, since they generally use some old versions and disable alot of basic functions, which is annoying since nobody i know does that. \n\nI also haven't really used excel since like highschool. Most jobs I've been to use publisher the most, which is odd. \n\nIs there anything I should know or how hard they are, any useful information and how much is weighing on these tests?",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/17g2b4q/i_have_to_take_a_microsoft_test_for_a_job/",
      "comments": [
        {
          "body": "If it's 1995 they will ask you why manhole covers are round and how many helicopters are in the sky right now.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is a \"phone interview\" through Microsoft Teams Meeting just audio or do they expect video too?",
      "body": "Can somebody please clarify if the interviewer is most likely expecting a voice or video chat? The interviewer sent me an email to schedule a \"phone interview\" and once we scheduled a time, they sent me a Microsoft Teams Meeting link stating \"This is a phone interview for \\[xxx\\].\" **Are they expecting a face-to-face video chat or just a voice chat?**\n\n&amp;#x200B;\n\nI'll prepare to be ready to go on camera but I'm just curious. I'll have my camera on if theirs is on, mine off if theirs is off. BUT is there any way they might expect me to have my camera on even if theirs is off? That's weird to me but I'm curious if that's possible.\n\n&amp;#x200B;\n\nEDIT: Thank you everyone for your responses. The update is that the \"phone interview\" was indeed a video interview. I joined the Teams meeting a couple minutes early and they were already waiting on me with their cameras on.",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/17ecvyi/is_a_phone_interview_through_microsoft_teams/",
      "comments": [
        {
          "body": "Be prepared for it all",
          "score": 8
        },
        {
          "body": "All my interviews with teams have had video. If their camera is off then I'd go with them not taking it seriously.",
          "score": 0
        },
        {
          "body": "I have never seen my current boss on camera including in our interview, but I interviewed with his boss right before interviewing with him so I just kept my camera on.  It was no big deal.  And has turned out nice because now I don’t feel obligated to be on camera with him or most people",
          "score": 1
        },
        {
          "body": "It depends on the person.",
          "score": 1
        }
      ]
    },
    {
      "title": "May God bless anyone looking for a job at the moment.",
      "body": "First off, I just want to start by saying I'm actually not religious and the title is a bit exaggerated but do feel like we all need all the help we can get.\n\nI got laid off back in May, I'm a technical Project Manager with 5 years of xp. Initially I took it a bit slow while searching for new jobs. I got severance so there was no rush (oh how naive of me). I only applied to the jobs I wanted (cool companies with great benefits, you know, the Googles, the Microsoft, etc). Of course to this day, I still haven't heard back from most of them. \n\nAround July I started taking it a bit more seriously. Modifying my resume to fit the JD, adding cover letters, only applying to jobs where I met all the requirements. Up to this point I've had 0 success. But also at this time I started getting contacted by recruiters. Keep in mind this is the first time dealing with recruites so I was excited. I got a few interviews but unfortunately nothing came from these interviews. After all companies basically saying the same thing ( we decided to move on with another candidate) the recruiter would very bluntly ghost me. I would reach out inquiring about other possible roles and they would not answer.\n\nWe're now in late August/early September. My severance has been gone for a few months and I'm now living off saving and have filed for unemployment. At this point I'm desperate  I'm applying to pretty much everything I see that sorta resembles my job title. Success rate with applying to companies is still 0%. ALL INTERVIEWS are coming from recruiters reaching out to me. But still nothing (we decided to move on with another candidate).\n\nToday: have gotten more interviews and all responses have been the same, employers keep going with other candidates, recruiters keep ghosting me, companies do not get back to me. It's really frustrating to not know who these candidates that are beating you are and why they are better than you. You never get feedback so there's not much info on how you can improve. It's very demoralizing and frankly I feel like giving up, I suspect I'm depressed because of this since I have very little to look forward on a day to day.\n\nIf I with 5 years of xp, I'm struggling, I can't imagine how difficult it must be for someone with 1 or 2 years.\n\nHonestly I don't wish this on anyone. I just wanted to vent out and share my experience looking for a job these last 6 months.\n\nUpdate 1: first post that blows up for me, I want to thank everyone wishing me luck. I've seen some people ask me for my location, I'm in AZ in Phoenix Metro.\n\nJust a quick update about one recruiter that had ghosted me. I talked to a friend that used to work for that company, he was good friends with the head of recruiting and told him about this recruiter. Well not even a couple hours later this recruiter got back to me asking for an interview. I guess the lesson here is, leverage your network, it's always easier when you know someone that knows someone.",
      "subreddit": "jobs",
      "score": 588,
      "url": "https://reddit.com/r/jobs/comments/17qrqd4/may_god_bless_anyone_looking_for_a_job_at_the/",
      "comments": [
        {
          "body": "Reading these posts from people with years of experience not being able to find jobs puts me on edge. I’m a fresh graduate who’s recently moved to the US. I am just f*cked? 😬",
          "score": 63
        },
        {
          "body": "Imagine me with 0 years. 🙃",
          "score": 170
        },
        {
          "body": "Same boat. Extremely frustrating and depressing, especially considering I will almost certainly have to settle for a lower salary and less than ideal benefits (if any) as a result of having to lower my standards completely. 5 YOE in digital marketing and have never experienced this low of a response rate on the job hunt. Trying to stay hopeful that things will pick up in Q1.",
          "score": 52
        },
        {
          "body": "Nobody was calling back so i took an 11 an hour job. Im about to be evicted because i cant make rent.\n\nI honestly don't care anymore. Fuck everything. I'll take what i can just so i can eat. I'll live out of my car. It's fine.",
          "score": 51
        },
        {
          "body": "I feel you. Product manager with over 4 years of experience. I got laid off back in August. I was fortunate to land a job rather quickly right after, but it’s customer support. Which I resent. But it’s a job. \n\nI used to apply to jobs night and day until I realized there was literally no point. There’s only so much rejection you can take for your mental health. I too only get contacted by recruiters about roles as well now. This method used to feel like a sure thing, but no job is certain in these times.\n\nGood luck. Protect your mental health.",
          "score": 20
        },
        {
          "body": "And there’s people out there that still believe the fake employment stats and “record low unemployment” propaganda from the gov.",
          "score": 32
        }
      ]
    },
    {
      "title": "📚👔 Book - Cracking Job Interviews: Why People Fail and How to Succeed. Practical Tips and A Proven Framework. Lessons Learned from Interviews with IBM, Google, Microsoft, Airbus, Startups and many others 🎉",
      "body": "",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/16qmocw/book_cracking_job_interviews_why_people_fail_and/",
      "comments": [
        {
          "body": "AKA - How to lie good and other sure-fire ways to kiss corporate ass.",
          "score": 1
        }
      ]
    },
    {
      "title": "My 2 year job search is complete",
      "body": "For starters, I started searching for a job while fully employed with a very strong company - I was not in any rush, and I did not have to worry about layoffs. I understand most people do not have this luxury.\n\nI started searching for a new job when I began to realize that my current position won't really allow me to grow in any way - I had been in this position for about 5 years, and my company was pretty small and did not have many growth opportunities. I would casually scroll Indeed about once a week while in bed and make note of jobs that caught my eye/sounded interesting. I'd then send in an application usually the next day after making minor adjustments to my resume.\n\nOf these 33 applications, I applied to one company 5 times (Microsoft) and one company 3 times (Snowflake). The other 25 applications were all unique companies. The first recruiter call I had came after only my second application, but that went nowhere. I then made it pretty far into the second job that responded to me, but ultimately did not get an offer after a take-home assessment.\n\nFinally, I successfully landed a job offer at the last place I applied to and I could not be more excited about it.",
      "subreddit": "jobs",
      "score": 400,
      "url": "https://reddit.com/r/jobs/comments/1ovb61d/my_2_year_job_search_is_complete/",
      "comments": [
        {
          "body": "In two years you only did 33 applications? Nicely done. You were smart and started looking when you were still employed",
          "score": 144
        },
        {
          "body": "you mean 2 days ? nah I know folks who can burn 50 applications in 1 day",
          "score": 89
        },
        {
          "body": "Great job on getting an offer, and thank you for sharing your experience! 😃",
          "score": 10
        },
        {
          "body": "Nice work! I went through a similar experience of looking for a role for roughly the same period of time. While it was frustrating to get many rejections including reaching probably 4-5 final stages, I ended up exactly where I should’ve. \n\nI remember being so disappointed after some of those finals but in reflection realized I was just wanting to get out of my current company and was hoping for anything at that point. It reaffirmed for me that everything happens for a reason - if I’d gotten one of those roles before ever getting my current one, I wouldn’t have been in the amazing position I am today. \n\nJust something for others to keep in mind going through the same. Don’t settle!",
          "score": 7
        },
        {
          "body": "33 applications in 2 years those are rookie numbers",
          "score": 6
        }
      ]
    },
    {
      "title": "Arrived early at an interview to hear they already want to hire the person before me.",
      "body": "So I just had an interview through Microsoft teams earlier today, and as required by the instructions, I entered the chat 10 minutes early. I said hello when I could hear the main panelest speak, but they couldn't hear me. They were talking to an HR person about wanting to hire an earlier interviewee and wanted to start the process now. When the HR person asked the main panelest why they were interviewing me, the main panelest said it was because of my experience and that I wasn't a good fit for the team. I was shocked and a bit broken hearted as I was unsure whether I was a right fit but applied and got the interview, which gave me hope. So, hearing this before the interview dashed my hopes, I wrote that I could hear them in the chat since they couldn't hear me. But they continued to talk until it was time to talk, and they realised they hadn't been on mute initially and then read in the chat that I could hear them. \n\nThe main panelest apologised that I had to hear all that. I said it was OK and I hope they find the best person for the job/interviewee.\n\nI still did the interview because I was there, and nothing is final until the job is offered. I definitely blew them away with my knowledge and experience, but I also feel saddened because it was all for nothing.\n\nUpdate: Thanks everyone for your words of support and advice! It's a range of emotions and stories, thoughts, and ideas, but I can see the main encouragement of believing in yourself and doing what's right by your own standards and goals. Y'all really cheered me up :)\n\nFinal Update: I didn't get the job, but surprisingly, neither did the person they had interviewed, they were looking for someone with a solid skill that means they were looking for a senior position type person. It was a fair answer. They are going to re advertise the position. I'm almost tempted to reapply for it, but I kind of understand the outcome. ",
      "subreddit": "interviews",
      "score": 8127,
      "url": "https://reddit.com/r/interviews/comments/1j8lam7/arrived_early_at_an_interview_to_hear_they/",
      "comments": [
        {
          "body": "That is diabolical. Kudos to you for keeping your cool and taking the high road in that awful situation. \n\nNext internal interview when they ask 'Give an example of a time when you had to adapt to challenging circumstances...\" you have the perfect answer lol.",
          "score": 1405
        },
        {
          "body": "Please don’t let this shatter your confidence. \nA lot of people would have crumbled and bailed but YOU DIDN’T!!  You made the most of a bad situation, and I bet at least one of them feels like a total asshole right now.",
          "score": 261
        },
        {
          "body": "**Their mistake just showed your professionalism.**\n\nHearing that before an interview is incredibly discouraging—but how you handled it speaks volumes about your character. As an HR professional, I've seen hiring decisions shift unexpectedly when someone shines under pressure. Even if they had someone in mind, your strong interview might genuinely make them reconsider—or at least put you first for future roles. You didn't waste your time; you showed impressive professionalism, resilience, and strength.",
          "score": 117
        },
        {
          "body": "I think you handled an uncomfortable scenario for all parties with grace and diplomacy. If anything, this showcases your integrity, guts and perseverance to the interview board. Even if you do not get this role, I would say you got some people in your corner for the next opportunity from how you handled the situation.",
          "score": 129
        },
        {
          "body": "Since they agreed to interview you for your experience, that means you fit what they are looking for. However, the way you wrote, the HR said that you are not the right fit BEFORE the interview. That's so much of a bias I don't think the interview is worth it at this point, unless you need experience in interviews",
          "score": 35
        },
        {
          "body": "Wow. Too many companies are treating talent like garbage these days. I’m waiting for the equation to flip.",
          "score": 50
        }
      ]
    },
    {
      "title": "Microsoft Interview",
      "body": "I have interviewed for Microsoft SDE II, and it has been a week since I completed the loop interview, but no feedback or update in the portal. Is this normal? Do I still have hopes?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1pg90u7/microsoft_interview/",
      "comments": [
        {
          "body": "A week is pretty normal tbh, their hiring process moves slower than molasses sometimes. I'd give it another week before reaching out to your recruiter, but yeah you definitely still have a shot",
          "score": 1
        },
        {
          "body": "It's been 2.5 week. No reply from them 🥲",
          "score": 1
        },
        {
          "body": "This is my 8th week waiting for an update!",
          "score": 1
        },
        {
          "body": "Focus on your next interviews or leads.  Do not get hung up on one specific position or company.  If you hear back, that’s great.  But if you don’t, you would have taken steps in a positive direction to benefit you.",
          "score": 1
        },
        {
          "body": "Hi, I had my loop interview last week (Dec 4th) and haven’t heard back from the recruiter yet. I noticed that my application status had moved to “Inactive” with a “Not Selected” status yesterday (Dec 12), and I wanted to check if this could be an error or if I should wait for formal confirmation from the recruiter. Thank you.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "I have given the interview today and out of 4 rounds, I got mixed feedback saying 2 rounds went well and other 2 not satisfied it seems.  Will I be still considered??",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft Interview result timeline",
      "body": "Hi\n\n  \nI interviewed with Microsoft on Oct27th for the Surface Devices team. No response yet, coming Monday marks three weeks, emailed recruiter 3 times, got ghosted all three times, has anyone else received any response from the recruiting team, any offer/rejection for this org? Am i rejected since no response all three times?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ox87xn/microsoft_interview_result_timeline/",
      "comments": [
        {
          "body": "I gave mine on Oct 15, and still no response. It was said that they are migrating to a new career site, and updates can be delayed. No need to worry until you receive a rejection email. I see from other posts that many people are on the same boat, waiting for more than 4-5 weeks.",
          "score": 1
        },
        {
          "body": "Which role in surface devices team?",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "hey did you got your result, im also on the same boat",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft Cloud Solution Architect Interview Prep",
      "body": "Hi guys! \n\nI have my CSA technical interview in 24hrs and still not sure if I feel confident enough.\n\nThis role is needs a minimum of 1 years worth of experience so I don’t think it’ll be too crazy, but what kind of questions would be there? Both technical and behavioural (as I have a feeling it’ll be a mix of both) \n\nI’m currently apart of a company that has their own version of Azure, so would they ask me questions based on my experience here?\n\nAny tips helps, thanks guys! ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1pxxso1/microsoft_cloud_solution_architect_interview_prep/",
      "comments": [
        {
          "body": "Expect scenario-based questions: customer wants X -&gt;how do you design it, why PaaS vs IaaS, basic networking/security/cost trade-offs. Talk through your reasoning out loud.\n\nIf they don’t know something: say it. Be honest, then explain how you’d find the answer or who you’d involve. That’s actually a plus.\n\nThey will use your current experience as context, but they’re testing principles, not exact Azure implementations.\n\nJust be at ease and be yourself. Consider it as a conversation instead of an interview. You will be fine!",
          "score": 1
        },
        {
          "body": "24 hours is tight but you can still prep. They'll definitely ask about your current Azure-like experience and how it translates to actual Azure services. \n\nHonestly, I'd recommend doing some mock interviews to get your nerves settled. I tried Final Round AI's mock interview feature when I was stressed about technical rounds and it really helped me practice explaining complex concepts clearly.\n\nFor CSA roles they love scenario-based questions like \"how would you migrate X workload\" so brush up on migration strategies and cost optimization.",
          "score": 1
        },
        {
          "body": "Totally normal to feel wobbly a day out. For CSA, I’d expect scenario prompts where you explain tradeoffs out loud, and I’d lean on your current platform as analogies but frame answers in cloud principles. Fwiw, I’d prep two STAR stories that show customer influence and a tricky design call, and keep responses around 90 seconds. I usually run a quick timed mock with Beyz coding assistant to practice articulating decisions, then sample a few prompts from the IQB interview question bank. Focus on how you’d assess requirements, basic networking implications, and cost guardrails before naming specific services. If you narrate your reasoning calmly and prioritize clarity, you’ll land in a good spot.",
          "score": 1
        },
        {
          "body": "For a CSA interview, expect questions about infrastructure, cloud architecture, and specific solutions within Azure or related platforms. You'll likely get scenario-based questions to test problem-solving. On the behavioral side, use the STAR approach to detail situations, actions, and outcomes from your experience. Given your background, they might dig into how you handled specific challenges in your company's Azure-like environment, especially re: scalability or security. Focus on how your experience translates to Azure environments—interviewers love transferable skills. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft New Grad Interview",
      "body": "Completed my Microsoft loop today! What do you think my chances are? Also recruiter question\n\nJust finished my onsite loop today and wanted to get some outside perspective.\n\nAll 3 rounds followed the same pattern: intro → behavioral → coding/HLD.\n\nRound 1: Medium–hard LeetCode style. I got the solution with the expected time complexity, but I did fumble a bit during the explanation. Ended up completing it though.\n\nRound 2: They threw a High-Level Design at me, which I honestly wasn’t expecting for a new grad role. The interviewer was really nice and collaborative. We discussed a lot of approaches, I asked questions, and I contributed ideas but I couldn’t “finish” the design. Not sure if that’s normal or a red flag.\n\nRound 3: Easy/medium LC. Went smoothly and I think I did pretty well here.\n\nSo overall… 2 rounds felt strong, 1 round I’m bit unsure about. What do you guys think about my chances?\n\n⸻\n\nRecruiter situation\n\nMy original recruiter’s email seems to have stopped working :/ possibly laid off? I still have my interview coordinator’s contact and I was given the name of the new recruiter, but no intro to them yet.\n\nCareer portal is also migrating, so that’s adding to the anxiety.\n\nAny idea what I should do here? Should I reach out to the coordinator or wait? Anyone dealt with this situation before?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p1u36a/microsoft_new_grad_interview/",
      "comments": [
        {
          "body": "What was the hard leetcode ? Topics? By high level design you mean like architecture like load balancers and stuff ?",
          "score": 1
        },
        {
          "body": "Which region is this?",
          "score": 1
        },
        {
          "body": "lmk if you hear back, i haven't heard back in 3 weeks",
          "score": 1
        },
        {
          "body": "Microsoft does not make decisions quickly so be prepared to wait. Follow up weekly or bi-weekly to get updates on the role. I highly suggest you apply to other positions just in case this falls through. I have seen on average a person getting hired at Microsoft is 4-6 weeks or longer depending on role. For you I expect 6 weeks.",
          "score": 1
        },
        {
          "body": "Hey! Do you know the org? Sometimes it depends on the org/team",
          "score": 1
        },
        {
          "body": "Hi, I had my loop interview last week (Dec 4th) and haven’t heard back from the recruiter yet. I noticed that my application status had moved to “Inactive” with a “Not Selected” status yesterday (Dec 12), and I wanted to check if this could be an error or if I should wait for formal confirmation from the recruiter. Thank you.",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft SDE interview result",
      "body": "Did anyone receive this kinda response after the msft interview?\n\n\"Thank you for applying for the position of Software Engineer at Microsoft. We enjoyed getting to know you and appreciate your interest in a career at Microsoft. We value your time and interest and hope you enjoyed the experience while gathering some insightful takeaways. Your overall feedback was positive; however, the team did not select you for an open position. \n\nWe will share your feedback with other teams who have similar roles with identical qualifications. In the meantime, please continue to explore opportunities and apply to any that interest you. We also suggest you create job alerts so you're notified when new openings are posted. \n\nPlease inform us of any changes to your employment search status. If you have any questions or need further assistance, do not hesitate to contact us. \n\nThank you for your continued interest in Microsoft.\"\n\nif yes what was the result and did any HM reachout?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p6vgtu/microsoft_sde_interview_result/",
      "comments": [
        {
          "body": "Got the exact same template after my loop there last year. \"Positive feedback\" but no dice - classic MSFT rejection with extra words\n\n  \nNever heard back from any other teams despite them saying they'd \"share feedback.\" Created those job alerts like they suggested but honestly just moved on to other companies. The whole \"we'll pass along your info\" thing seems like fluff to soften the blow",
          "score": 1
        },
        {
          "body": "i don't think its a straight rejection, they'll send straight rejection email if they reject you, have you heard back anything?",
          "score": 1
        },
        {
          "body": "Got the same email. Which role did you interview for ? It's not a reject because rejects are direct, afaik. heard a few people getting contacted by HMS, but also heard people with no updates. So ig it all depends on your feedback and team fit. Also, luck maybe?",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft SDE2 Interview Results Delay",
      "body": "Hi everyone, I recently completed four interview rounds with Microsoft (15 days ago). However, in the Action Center, the status still shows as “Scheduled.” I tried reaching out to the recruiter but haven’t received a reply yet. Has anyone else faced a similar issue? Is it common for HR not to respond after interviews, or could this be a bad sign?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1or4by4/microsoft_sde2_interview_results_delay/",
      "comments": [
        {
          "body": "Any update?",
          "score": 1
        },
        {
          "body": "Was your job id for a specific team or something generic? Did you hear anything back?",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft Teams Interview?",
      "body": "Has anyone had a teams interview with just chat? I’m new to the job search again after a few years and just wanted to see if this is a normal thing now in the world of AI- or if it’s a possible scam lol \n",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1qb21s5/microsoft_teams_interview/",
      "comments": [
        {
          "body": "High scam potential",
          "score": 2
        },
        {
          "body": "No, that's weird",
          "score": 1
        },
        {
          "body": "Not normal.",
          "score": 1
        },
        {
          "body": "Yeah, chat-based interviews are becoming more common, especially for initial screenings to quickly gauge candidates' written communication skills. Always verify the company details and email domain to ensure it's legit. Scams often dodge formal job boards, so stick with official company careers pages or LinkedIn for job applications.",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft CSA 2nd Interview (Culture &amp; Fit)",
      "body": "Hi guys\n\nI managed to pass my technical interview for the Cloud Solutions Architect (CSA) role yesterday and got a email saying they want to schedule the next interview with me for tomorrow. From what I understand, this is a culture interview to see ‘team fit’ and ‘culture fit’ (directly quoted from the interviewer yesterday when I asked them what the next step was).\n\nWould anyone know what to expect from this round? Should I brush up on the Microsoft values found here: https://careers.microsoft.com/v2/global/en/culture\n\nOr would it be more behavioural.\n\nThanks Guys!! ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1pzadnn/microsoft_csa_2nd_interview_culture_fit/",
      "comments": [
        {
          "body": "Yeah, for a culture fit interview, definitely review Microsoft's core values - they often look for alignment there. Focus on storytelling using the STAR method, emphasizing how your experiences align with their values. Be ready for questions about teamwork, adaptability, and communication. Good luck!",
          "score": 1
        },
        {
          "body": "Congrats on making it through the technical round! For Microsoft's culture fit interviews, they definitely focus on their core values but frame it through behavioral questions. Expect stuff like \"tell me about a time you collaborated across teams\" or \"describe a situation where you had to learn something completely new.\"\n\nI'd definitely check out their values but focus more on having solid STAR method examples ready. The market is competitive right now so I'd recommend doing some mock interviews to practice - I used Final Round AI's mock interview feature when I was prepping for similar roles and it really helped me get comfortable with the behavioral format.\n\nGood luck tomorrow!",
          "score": 1
        },
        {
          "body": "congrats on passing the technical! yeah it's behavioral - it's standard honestly - times you dealt with conflict, how you handle ambiguity, examples of customer obsession, etc. Microsoft really cares about growth mindset so have stories ready about learning from failure. I work at Prepfully and we see a lot of Microsoft CSAs come through for mock interviews - the culture fit round is where they really dig into whether you'll mesh with the team dynamics. They love hearing about collab across teams and how you've influenced without authority. Just be ready with specific examples using STAR format and you'll be fine I think",
          "score": 1
        },
        {
          "body": "Curious how the technical interview went and what they focused on, if you’re open to sharing",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft Technical Support Engineer Interview",
      "body": "Hi all,\n\nI have an upcoming interview with Microsoft for a Technical Support Engineering (IC3) position. Just wanted to see if anyone has any info or tips if they have done this interview before.\n\nThis is the specific posting: [Technical Support Engineer | Microsoft Careers](https://jobs.careers.microsoft.com/global/en/job/1852705)\n\nThank you in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nbvi9u/microsoft_technical_support_engineer_interview/",
      "comments": [
        {
          "body": "They'll likely present you with real-world scenarios where customers are experiencing issues with Microsoft products, and they want to see how you methodically troubleshoot, communicate complex technical concepts in simple terms, and maintain patience under pressure. Expect questions about how you'd handle an angry customer whose business is down, or walk through diagnosing a network connectivity issue step-by-step. They're also big on behavioral questions using the STAR method, so prepare specific examples of times you've gone above and beyond to help someone or solved a particularly challenging technical problem.\n\nThe IC3 level means they're looking for someone with solid experience who can work independently and mentor others, so be ready to discuss times you've led projects or helped train colleagues. Microsoft values growth mindset heavily, so emphasize your curiosity and willingness to learn new technologies. They'll probably ask about your experience with their ecosystem - Azure, Office 365, Windows Server - but don't panic if you're not an expert in everything since they often value transferable skills and learning ability over specific product knowledge. I'm on the team that built [interview questions AI](http://interviews.chat), which can help you practice answering these types of technical scenario questions and behavioral prompts so you feel more confident walking into the interview room.",
          "score": 1
        },
        {
          "body": "Are you in Canada? I've got an invite as well. Haha Goodluck to us",
          "score": 1
        },
        {
          "body": "Oh my God. I also got an invite. I am in Canada. it's scary lol",
          "score": 1
        },
        {
          "body": "I got an invite too, and I'm scheduled in 2 days. \nI'm so nervous right now and I almost declined the interview invite.",
          "score": 1
        },
        {
          "body": "Hey all, \nI have interview scheduled tomorrow but they didn’t give me the time. What I expect here ?",
          "score": 1
        },
        {
          "body": "Hi, \n\n\nDid all of you receive an update after the interview??",
          "score": 1
        },
        {
          "body": "Hi Jinny, would you be able to tell me more details of it? I just did my screening with HR and will now schedule a new interview, how was the technical part of it? Was it hard? I'm afraid of doing it because I don't have that much of expertise.",
          "score": 1
        },
        {
          "body": "hello, how long did it take before they contact you after submitting application?",
          "score": 1
        },
        {
          "body": "anyone got any updates after the interview?",
          "score": 1
        }
      ]
    },
    {
      "title": "I might have bombed my microsoft interview and I feel very demotivated.",
      "body": "Hi, I had a interview loop round with microsoft for SWE 1 role recently.  \nOn the first round, the interviewer asked me some of the resume questions along with HLD. I never expected HLD, but it wasn't actual designing interview, rather a discussion on HLD. However, I faced a lot difficulty answering it - Although, I added all the things I knew, I fumbled a bit.\n\nThe interviewer said it's okay it is tough question, so he asked me how do you approach your team to getting clarity on it. Even then, I fumbled while answering. I feel very bad for that.\n\nEven his network connection was bad and he joined through mobile.\n\nThe next questions on behavioral went very well in this round.\n\nSo, assuming other two rounds went well, what do you think would my chances would be in this specific scenario? Like if the interviewer gives a -ve feedback on articulation aspect for the system design concepts, then boom! Game over.",
      "subreddit": "interviews",
      "score": 7,
      "url": "https://reddit.com/r/interviews/comments/1oijgdl/i_might_have_bombed_my_microsoft_interview_and_i/",
      "comments": [
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "I went through the msft loop. Felt confident after 3/4 but the final interview was brutal. Wound up not being chosen.",
          "score": 2
        },
        {
          "body": "Many years ago, in my first interview with a Fortune 500 firm, I made a clear error in walking through a solution in front of the hiring manager, who was a PhD statistician. When I suddenly knew it, I said \"Wait. I set this up wrong.  Let me start again\" and I got it right this time. I acquitted myself well, kept my cool, but I thought well, that's that. Good training for me for next time. But they offered me the role, and part of it was that rather than freezing, I admitted the mistake and proceeded on. They liked that, and my career was now officially launched in my 20s. So, in your mind you may have botched it, but if you answered forthrightly and articulately based on what you knew, did not elaborate on things you did not know, you may have done better than you think.",
          "score": 1
        },
        {
          "body": "Sucks",
          "score": 1
        }
      ]
    },
    {
      "title": "Has anyone interviewed for the Microsoft Applied AI Scientist role?",
      "body": "Hi everyone,\n\nI had applied for a Senior Applied AI role at Microsoft, but after the screening round they moved me to an Applied AI Scientist position instead.\n\nHas anyone here gone through the interview process for this specific role at Microsoft?\n\n1. What kind of rounds should I expect?\n\n2.How technical or research-focused is it?\n\n3. Any tips on preparation would really help.\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ozkp15/has_anyone_interviewed_for_the_microsoft_applied/",
      "comments": [
        {
          "body": "You can take a look at this: [https://github.com/TidorP/MLJobSearch2025](https://github.com/TidorP/MLJobSearch2025)",
          "score": 2
        },
        {
          "body": "For the Microsoft Applied AI Scientist interview, expect a mix of coding, ML system design, and a research style discussion. Mine had a resume deep dive, a coding round at about LeetCode medium with an ML twist, an ML system design session, and a paper or project critique where they asked about metrics and tradeoffs. It felt applied first, with some research depth if you claim papers or novel methods. What helped me was doing timed mocks using Beyz coding assistant with prompts from the IQB interview question bank, plus rehearsing a 5 minute paper summary and keeping behavioral answers to 90 seconds using STAR. Build a tiny offline eval for a model you know so you can talk concrete metrics and failure modes.",
          "score": 2
        }
      ]
    },
    {
      "title": "Microsoft SWE Interview: Positive Feedback but No Offer — Am I Waitlisted or Rejected?",
      "body": "Hey everyone, \n\nI recently interviewed for a Software Engineer (SWE I) position at Microsoft, and after about 2 weeks, I received the following email:\n\n“Thank you for applying for the position of Software Engineer at Microsoft. We enjoyed getting to know you and appreciate your interest in a career at Microsoft. We value your time and interest and hope you enjoyed the experience while gathering some insightful takeaways. Your overall feedback was positive; however, the team did not select you for an open position.\nWe will share your feedback with other teams who have similar roles with identical qualifications. In the meantime, please continue to explore opportunities on Microsoft Careers and apply to any that interest you.”\n\nHas anyone else received something like this?\nDoes this mean I was on the borderline (like a waitlist situation), or is it just a nice way of saying rejection?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o73vsl/microsoft_swe_interview_positive_feedback_but_no/",
      "comments": [
        {
          "body": "Dmed you u/colordoodlz",
          "score": 1
        },
        {
          "body": "Literally got the **exact same feedback today**. All 3 of my interviews were technical and from the same team. 2 of them went really well (**strong hire / hire** for sure). But the 3rd one didn’t go well at all and must've been a **no-hire**, which balanced the final decision toward “positive feedback but not selected.”\n\nI also got the “we’ll share your feedback with other teams” feedback email, but I’m not sure how often that actually leads to anything.\n\nDid you ever hear back from other teams after this point? Or get pulled into another loop? Just trying to understand what usually happens next and whether I should expect anything or just move on and re-apply elsewhere.\n\nWould appreciate any insight from your experience!",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft Interview result timeline",
      "body": "Has anyone interviewed for 1881147 and got results?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p3duy2/microsoft_interview_result_timeline/",
      "comments": [
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft SE role interview help!",
      "body": "I have been referred to software engineer role in microsoft, I need help to prepare for the interview although I have very low chances of getting an interview scheduled because they open the roles for internal hiring but still if I get one scheduled I need your help, please help me out!!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1opqmm3/microsoft_se_role_interview_help/",
      "comments": [
        {
          "body": "Focus on data structures and algorithms. Microsoft often leans towards problem-solving and coding skills, so brush up on LeetCode or HackerRank problems. If you get the interview, be ready for behavioral questions too – the STAR method works well for that. Good luck!",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft CET Interview for Toronto Data Center - Follow-up and Experiences?",
      "body": "Hi everyone!\n\nI had an interview with Microsoft for the Critical Environment Technician (CET) position at their Toronto Data Center on November 4th. I was told I’d hear back within 5 to 10 days, but it’s been a bit longer and I haven’t received any updates yet.\n\nThe interview experience was a bit different from what I expected. The first part was quite fastpaced, and the interviewer was a bit loud and didn’t seem to refer to my resume at all, which was surprising. The second part, however, was much better and went really well.\n\nI’m feeling a bit anxious about the delay and would love to know if anyone else has had a similar experience or has any insights on the usual timeline.\n\nThanks in advance for your help!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p1j128/microsoft_cet_interview_for_toronto_data_center/",
      "comments": []
    },
    {
      "title": "Microsoft / Interview delay in response",
      "body": "I had an interview with Microsoft for a data scientist position, a hiring interview that took place on October 20th. The recruiter told me they would send me an email with instructions for the technical interview. But to this day I haven't received anything. In the Action Center, my application is still active.\n\nShould I still keep hoping?  or  Should I contact the recruiter?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1om22i6/microsoft_interview_delay_in_response/",
      "comments": []
    },
    {
      "title": "Anyone here interviewed for Microsoft SDE II (Level 61) in the US? Need some guidance",
      "body": "Hey everyone,\n\nI’ve got an upcoming interview for Microsoft SDE II (level 61) in the US and I’m feeling pretty nervous since this will be my first time interviewing for an SDE II role.\n\nDuring my hiring manager round, she mentioned I’ll likely have 4 more rounds, a mix of LLD, HLD, LLD, and Behavioral, though I haven’t gotten an official confirmation yet. I have just 1 week left to prepare.\n\nFor those of you who’ve been through this recently: \n\n* What was your experience like? \n* How were the interviewers? more chill and collaborative, or do they grill pretty hard?\n* Any tips on what to focus on in the final week (especially around LLD/HLD)?\n\nThe job market’s been tough and I’m currently without a job, so any help or advice from folks who’ve gone through this process would mean a lot. \n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1n44p6h/anyone_here_interviewed_for_microsoft_sde_ii/",
      "comments": [
        {
          "body": "The LLD rounds typically focus on designing classes, APIs, and data structures for specific features, so practice breaking down problems like designing a parking lot system or a chat application. For HLD, expect questions about distributed systems, scalability, and trade-offs - think about how you'd design something like a URL shortener or notification system at scale.\n\nWith just one week left, focus on the fundamentals rather than trying to learn everything. Practice articulating your thought process out loud, especially for system design questions where they care more about your reasoning than the perfect solution. The behavioral round will likely center around Microsoft's culture values, so prepare examples that show leadership, collaboration, and dealing with ambiguity. Since you're between jobs, frame that positively as an opportunity to be selective about your next role. I'm actually on the team that built [mock interview AI](http://interviews.chat), and it's designed exactly for situations like this - helping you practice those tricky system design explanations and behavioral questions so you can walk in confident and ready to showcase your skills.",
          "score": 2
        },
        {
          "body": "I can help you with a mock interview if you want to do a practice run! :-)\n\n[https://calendly.com/rohit-pixeled-apps/30min](https://calendly.com/rohit-pixeled-apps/30min)",
          "score": 1
        },
        {
          "body": "How was the Hiring manager round, Were there and leetcode questions asked?",
          "score": 1
        },
        {
          "body": "Were there any LLD questions or HLD?",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft Interview!",
      "body": "Hello all!\n\nI am an ms cybersecurity student in my 1st sem with no prior full time work experience and I received an interview invite for the pentesting intern position from microsoft.\n\nI am nervous and could really use some help.\n\nCan you all please help me by asking some questions(technical/behavioral) regarding the projects that i have done and the experience i have accumulated so far? I have listed them down below!\n\nHomelabs\n\n- Deployed and tuned SIEM to monitor 5,000+ logs/day, reducing false positives by 30%.\n- Built CI/CD pipeline with Jenkins, AWS, SonarQube, and Trivy; reduced deployment vulnerabilities by 35%.\n- Analyzed 5+ malware samples, extracted IOCs, cracked obfuscated credentials with Hashcat, automated reporting via Python.\n\nExperience\n\nCo-Founder and pentester for a small security startup(during undergrad)\n- Delivered Security-as-a-Service to SMBs, performing vulnerability assessments and penetration tests that identified 25+\nhigh-severity findings and reduced client security incidents by 30%.\n\nCybersecurity Research Intern(during undergrad)\n- Designed training modules on phishing defense, SIEM usage, and endpoint monitoring.\n- Increased adoption of secure coding and awareness practices by 40%.\n\n\nCybersecurity Tutor(during undergrad)\n- Trained 350+ students in vulnerability assessment, penetration testing, and network defense.\n- Guided practical labs on ethical hacking, malware analysis, and threat modeling.\n\nDoing this because i thought I will get a clear picture of what perspectives different people have on a similar topic and how deep can the questions be!\n\nThank you!\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o8qtuw/microsoft_interview/",
      "comments": []
    },
    {
      "title": "Microsoft Onsite Interview - HRBP",
      "body": "I have my virtual loop interview coming up soon for an HRBP role with the BIC team under Microsoft AI org! There will be three rounds (1 hour each).\nWould love to hear from anyone who’s been through interview process with Microsoft : \n👉 What kind of questions do they typically ask?\n👉 Any prep tips that can help me do well in my loop interviews?\nThanks in advance! \n\n#tech #HRBP #Microsoft #tech #interview #HR",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o3sy7l/microsoft_onsite_interview_hrbp/",
      "comments": []
    },
    {
      "title": "Microsoft interview deadline — can I reschedule after 21st due to a medical condition?",
      "body": "\nHi everyone,\nI need some advice regarding my Microsoft Software Engineer interview scheduling.\nI received an invitation to book my interview, and the email clearly says that the interviews need to be scheduled on or before November 21st.\nHowever, I’m currently dealing with a medical issue — glaucoma — and my doctor has advised me to avoid eye strain. It’s already been about 3 weeks, and I’m still recovering. Honestly, I cannot perform well in an interview right now because my vision gets blurry and painful.\nI’m expecting to be better after the 21st, around Nov 24, 25, or 26.\nMy question is:\n✅ If I explain my medical condition to the recruiter, will Microsoft allow me to schedule the interview after the 21st?\n✅ Or is there a risk they may cancel my interview or withdraw my application because I’m asking for an extension?\nHas anyone here successfully extended their Microsoft interview window due to medical or personal emergencies?\nAny insight or experience would really help me.\nThanks a lot!",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1osleck/microsoft_interview_deadline_can_i_reschedule/",
      "comments": [
        {
          "body": "You can explain it but there’s a risk they’ll just move forward. We don’t know the answer. Your best bet is to reach out to them asap.",
          "score": 2
        }
      ]
    },
    {
      "title": "How long does Microsoft take to schedule interviews?",
      "body": "It's a bit frustrating - waiting for the interview to even get scheduled. I was asked to provide availability too soon and yet it's been a week and the scheduler says we are still confirming schedule from HM and provide you confirmation before 24 hours. I understand but am getting the same template every time I follow up. While, in the meantime, I am getting so anxious waiting here.",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1of6v6y/how_long_does_microsoft_take_to_schedule/",
      "comments": [
        {
          "body": "Microsoft takes their time scheduling interviews. They are always like this. Expect the interview process to spread out over time too. Its not a 1-2 week process. Give yourself 4 weeks for prepping etc. Even though they are not a FAANG company but they act like one and process is slow as usual.",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft Interview",
      "body": "Hey guys I got a first round at Microsoft for their finance analyst rotational program. Was curious if anyone’s done the same, and if they have any tips for me? I heard I need to know some extent of SQL, so since then I’ve been grinding out the basics. Still want to just get a better picture. ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1o7g1s4/microsoft_interview/",
      "comments": [
        {
          "body": "I interviewed for a similar FA rotation at a big tech last year. What helped me was getting comfy with the finance story first, then layering SQL. I practiced quick P&amp;L walk‑throughs, variance analysis, and how I’d partner with PMs to explain drivers. For SQL, I drilled select, inner join, group by, and a couple window functions on simple revenue and opex tables. I ran short timed mocks with Beyz coding assistant to query sample datasets while narrating why each metric mattered. Also kept a tight STAR story bank and aimed for 90 second answers.",
          "score": 1
        }
      ]
    },
    {
      "title": "Microsoft Interview Prep Doubt – Software Engineer (Linux Kernel)Role",
      "body": "Hi all,\n\nI recently cleared the Online Assessment for the Software Engineer (Linux Kernel domain) role at Microsoft. I have 1.9 YOE in C/C++ &amp; Linux,Kernal at IBM as a Software Engineer (Linux Kernel + Systems Programming).\n\nI was told there will be 4 rounds (3 Technical + 1 Managerial/Behavioral).\n\nUsually, I’ve heard that Microsoft’s technical rounds are mostly DSA + LLD focused, but in the recruiter’s email it was mentioned:  \n\n\nNOTE : Additionally, the HM confirmed on what can be expected on all 3 rounds. Please find them below.\n\nCore areas of prep at high level are - Linux fundamentals, Operating Systems fundamentals, C programming concepts with systems and coding best practices, debugging approaches, Kernel Vs User space concepts and system daemons. Additional advantage if they know about Device drivers and Linux Kernel.\n\nNow I’m a bit confused about what to prioritize — should I mainly prepare DSA + System Design like in other Microsoft roles, or should I focus more on these Linux/OS/Systems programming concepts since it’s a Software Engineer (Linux Kernel) role?\n\nHas anyone here interviewed for a Linux Kernel/Systems Software Engineer role at Microsoft and can share what the rounds are actually like?\n\nhttps://preview.redd.it/cbnrr0cszdlf1.png?width=2940&amp;format=png&amp;auto=webp&amp;s=f83d7b0759a3ed93bf41f5a28b7955e172664cb1\n\n\\#microsoft #SDE #interview ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n0ptns/microsoft_interview_prep_doubt_software_engineer/",
      "comments": [
        {
          "body": "Given the role and the specific prep advice, focus on the Linux/OS/Systems programming concepts. DSA is always a good backup, but for a Linux Kernel role, knowing those specific areas will likely stand out more. Practice debugging and familiarize yourself with kernel vs user space concepts too. Good luck!",
          "score": 1
        },
        {
          "body": "Your recruiter just gave you a massive gift by being this specific about what to expect, and you should absolutely trust them over generic Microsoft interview advice. The fact that they explicitly outlined Linux fundamentals, OS concepts, C programming, and kernel vs userspace shows this isn't going to be your typical leetcode grind - they want to see if you actually know the domain you'll be working in. Most Microsoft SDE roles are indeed DSA-heavy, but you're interviewing for a specialized kernel position where your systems knowledge is far more valuable than your ability to reverse a binary tree.\n\nFocus about 70% of your prep time on the technical areas they mentioned and 30% on basic DSA since some coding will likely come up. Your IBM experience already gives you a solid foundation, so spend time reviewing memory management, process scheduling, system calls, and how kernel modules work. Practice explaining complex kernel concepts clearly since that's exactly what you'll need to do in the interview. The debugging approaches part suggests they might give you real kernel debugging scenarios, so think through how you'd approach kernel panics, memory leaks, or performance issues. I work on [AI interview tool](http://interviews.chat), which can help you practice articulating these technical concepts clearly and handle any curveball questions they throw at you during the actual interview.",
          "score": 1
        },
        {
          "body": "Hey man,\n\n\nHow did your interview go?",
          "score": 1
        },
        {
          "body": "Hey, how was the interview? pls share the exp",
          "score": 1
        }
      ]
    }
  ]
}