{
  "company": "netflix",
  "post_count": 64,
  "exported_at": "2026-01-18T17:44:53.291Z",
  "posts": [
    {
      "title": "L5 salary at Netflix",
      "body": "I have an interview coming up for Netflix. The salary range is 190,000 to 900,000. I'm not sure what I should answer for my expected salary. I looked on levels.fyi and other job boards and the reported salaries range from 200 to 500. Does 400 sound right if I have 13 years of experience?",
      "subreddit": "cscareerquestions",
      "score": 565,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ndwn5f/l5_salary_at_netflix/",
      "comments": [
        {
          "body": "When I interviewed with Netflix, they told me the salary up front. They treated it as data gathering. “We aim to pay at the 95th percentile and our team is currently targeting $X. Do you think that’s low or high based on other offers and your experience?”\n\nIf you’re in the Bay Area I’d think they’re going to be a bit higher than $400k. My guess would be more like $450-500k. \n\nThat said, try to avoid giving them a number. I really think they’re not going to ask. But if they do, try to avoid answering. I used to say I’m open to offers and am interviewing elsewhere so I’ll have to compare opportunities. That shut most people up.",
          "score": 701
        },
        {
          "body": "Ask for 9 but tell them you're flexible",
          "score": 315
        },
        {
          "body": "as a 60k European developer i cannot comprehend this, are these salaries for genius level people? are they solving some super complex problems in these fang companies?",
          "score": 92
        },
        {
          "body": "Better off asking on blind, most people here are not experienced engineers.",
          "score": 253
        },
        {
          "body": "Wtf with the range",
          "score": 56
        }
      ]
    },
    {
      "title": "Netflix Interview \"Exercise\" (Round 2)",
      "body": "Round 1: Spoke to the Hiring Manager.\n\nRound 2: Intructed to complete an exercise within 3 days.\n\nI havent received this \"exercise\" yet... anyone know what this entails?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/mm4jto/netflix_interview_exercise_round_2/",
      "comments": [
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "How long ago were you told to complete round 2? Regardless, just call the person who asked you to complete round 2.",
          "score": 1
        }
      ]
    },
    {
      "title": "Netflix Phone Call request after final round",
      "body": "I had my final round of interview at Netflix last week and I got an email from the recruiter when I’m available for a phone call. Does Netflix reject applicants via email or phone call? Anyone experienced something similar? ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n1mtsg/netflix_phone_call_request_after_final_round/",
      "comments": [
        {
          "body": "Any update? Just curious.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "I went to the office for the first time. I fucking hated it.",
      "body": "Not my main account because I know some of my coworkers/friends browse this sub and would recognize me.  I just want to rant and encourage people to keep looking for remote jobs and make the transition if they can/prefer it.\n\nSo last week, after a year or so working from home, I had to go back (for the first time in my career) into the office. According to my company, we should work from the office because it will increase collaboration and people will perform better.  Bunch of bs, but I had no other choice at the moment.\n\nSo first things first, instead of waking up at 8:20 and join a useless meeting at 8:30, be on mute and proceed to go make my breakfast and take my dog for a walk,  I now have to wake up at 7, get properly dressed (no more comfortable clothes), make sure I have lunch and breakfast prepped, get on the highway, drive, get there at 8:15, mindless chit chat till 8:30, join the same useless meeting on zoom (with coworkers from around the globe, what's the f. point? ) and now I HAVE to/MUST pretend to pay attention to something that has no relation to what I work with because well, I got no more flexibility on my surrounding environment.\n\nAt home, I invested in a nice work setup. I have a nice chair, a stand-up desk, wireless keyboard/mouse/headphones, 2 monitors that I can adjust, plus a private kitchen to make my snacks, and teas.\n\nThe first time I went to the office and I saw the work environment I felt ridiculous. It's a fucking cubicle, with a shitty keyboard, mouse, and headset. The best part is that the cubicle doesn't have tall walls so I can literally see/hear everything, including other people's monitors.  The monitors, of course, are facing the hallway, so you can't see who's walking behind you, but whoever walks past you can freely see what you are doing.  Manager's dream.\n\nI also have to wait in line now if I want to make some tea or something, delightful.\n\nAt home, I am able to have a quiet environment and be super productive. When I get a card, depending on what it is, I can finish it in 2-4 hours, and then I can focus on doing something else for the rest of the day (learning/training, other meetings, or just not work at all since I was able to be productive).\n\nAt the office, because of being constantly watched, I became lazy just to have something to hold on to/last for the rest of the day. I also noticed that my team members do the same.  Also for me, IT IS EXTREMELY HARD to actually focus with a lot of background noise and as I mentioned above, because of the cubicles, every time someone gets up (every 10 mins), or gets a phone call, my attention is drawn to that and I lose what focus I had.\n\nThe company kept saying we will be more productive at the office. That's the opposite of what I am seeing. My team is now taking longer for cards, and the amount of time wasted in the office is ridiculous. The number of people, mindless walking around, chit-chatting in cubicles, going out for lunch/ coffee breaks just to fill in the time is a joke(nothing wrong with that IMO, but I'd rather do that at home).\n\nI loved having a private bathroom at my house. I can go and do whatever I want to do in peace. At the office, welcome to the shitty stalls and pooping side by side because, yes, I do love the smell of people farting in the morning.\n\nThe people that wanted to go back into the office, after a week of going to work and lunches and whatnot, started to mention some stuff during the stand-ups and I quote:\n\n\"Are you guys feeling more tired than usual?  I forgot I didn't enjoy the commute\"\n\n\"Man I forgot it sucked to have to prep a meal every day and wait in line in the cafeteria to reheat it\"\n\n\"I actually didn't realize I was saving money eating at home, I spent over 100 dollars last week on coffee and lunch\".\n\nAt home, after work, I could go for a jog right away or just go watch some Netflix and chill out.\n\nAt the office after a long, tiring day? Nope, get in the car, you are going to waste 40 minutes in stressful traffic to get home.\n\n&amp;#x200B;\n\nI am FUCKING glad, I am putting in my 2 weeks this Wednesday and going fully remote. I started looking 4 months ago when the company announced their plans because I was feeling that this office thing would be horrible. I tried it out and it just doesn't work for me.\n\nIf you are looking for a remote role, keep applying/interviewing, you will get something too.\n\nIf you like/prefer going to the office that is fine. I am not trying to say we should all be remote. Companies should offer FLEXIBILITY to let employees choose where to work from.\n\nWe have different personalities and different preferences. Just because some people enjoy going into the office (or because management needs control) doesn't mean everyone has to.\n\n&amp;#x200B;\n\nI am gladly never going to or near an office ever again.\n\n&amp;#x200B;\n\nTL;DR: Went to the office for the first time in my life. I hated it and makes no sense to me.  Companies should let employees decide where to work from. If they can't offer that and make their employee's lives easier/better, they should/will lose all their talent to companies that do.\n\n&amp;#x200B;\n\nEDIT 1: There seems to be a lot of people saying that I am entitled. For a bit of background, I started working a couple of years ago as a dishwasher and made my way to where I am right now. I never had an easy path nor a college degree (I am self-taught with a small coding Bootcamp).\n\nJust because I prefer having a better quality of life/work, doesn't mean I am entitled. Instead of bickering with each other about who works harder or whatever, we should focus on having a better quality of life and trying to make it the norm. If you are working 6 days a week and you feel proud, good for you but I don't want that for me.",
      "subreddit": "cscareerquestions",
      "score": 3737,
      "url": "https://reddit.com/r/cscareerquestions/comments/oosru6/i_went_to_the_office_for_the_first_time_i_fucking/",
      "comments": [
        {
          "body": "My old company went from wfh to full in office while the pandemic was still in full swing. We worked for 3 months remotely and my entire team performed better, had better attitudes, and were overall just more productive. Then one day, I was in the middle of daily scrum when we all got an email from HR stating that we need to report back to the office in two weeks time. Man my entire team was pissed. I threw in my two weeks notice and starting applying. Half my team did the same thing. Ended up landing a job that pays 20% more, gives an extra 2 weeks PTO, and its fully remote until the end of this year. Then we only need to go to the office twice a week and we get 6 weeks time that can be used to work remotely. Fuck the companies that want to control you. There are better ones out there. The one benefit of this pandemic is that it brought to light toxic companies.",
          "score": 203
        },
        {
          "body": "Company refused to let me work from home during the second wave (unlike the first), even for valid health reasons, so I quit, they had over 10 outages since I left, and one month after I quit I got a fully remote job that pays 25% more. I've been enjoying my new job quite a bit for the several months I've been working at it.",
          "score": 963
        },
        {
          "body": "Our 850 member team was told we will be going back to the office in June. Major corporation. When 200+ people put in their 2 week notice at once, the company said we could all work from home permanently OR go into the office, whichever we chose was fine. They quickly realized we had them. Still 20+ people left.",
          "score": 101
        },
        {
          "body": "Yep….funny thing is I have been working at the office for a while, and it’s others who I don’t want to return. The office space is quiet and dark, just perfect.",
          "score": 356
        },
        {
          "body": "Open Office Plan is the hell on earth. Earplugs and noice canceling headphones is the only way for me to stay sane.",
          "score": 132
        },
        {
          "body": "I had really been missing the office so thank you for this. I moved out of state during the pandemic and am now fully remote.",
          "score": 59
        },
        {
          "body": "lol nice rant, I 100% agree. WFH FTW, i hope it soon becomes an industry standard",
          "score": 638
        },
        {
          "body": "I prefer the office, but also like the flexibility to WFH. And I have zero, absolutely zero, problem working with remote coworkers. Companies shooting themselves in the foot by not allowing it.",
          "score": 280
        }
      ]
    },
    {
      "title": "Anyone ever left a chill job for higher pay and regretted it?",
      "body": "I have a PhD in computer engineering and work a chill job in telecommunications. My job is basically to validate 5g connectivity and ensure customers have service. There's no coding at all as it's mainly a gui where we set parameters and what not. I get 150k with good benefits, and there's extremely good job security. My company hasn't laid off anyone, and I love this job because it's remote. I don't do much work at all, and when sites are down, I've automated the scripts needed to reset parameters for recovering them.  Consequently, I'm getting paid to watch Netflix and sleep all day. I literally haven't done any work since February other than join our weekly team meeting. \n\n I get a lot of LinkedIn recruiters sharing 200k+ job interview offers with me in regards to my PhD field of study (system security). I haven't entertained them since they're all in office. I'm mainly scared about getting a manager that micromanages and having to actually do work that can't be automated lol 😅. I'm conflicted between hearing faang layoffs/shit job security, but also seeing their 300/400k+ salaries, so I feel like I'm leaving money on the table by literally sleeping through what should be my hustle years. With my current company, I'll hit 180k in 2 years, 220k in another 3, and staff engineer in another 4 topping at 300k.  Any thoughts would help!\n\n\nEdit:\n\n Thanks everyone for their comments! Did not expect this much feedback 😅. I've decided to stay and keep coasting while leetcoding to keep skills sharp. Just wanted to clarify that I won't over employ due to potential risks, and I'm not smart enough to come up and execute a business. I also wanted to add that another reason for wanting higher TC was to be able to buy a house given current interest rates (detailed numbers in the comments). The 300k is only after 9* years when you basically get auto promoted to staff assuming your manager is happy with your performance. \n\nA lot of people asked how I got this job/how they can get this job. You likely need a MS or PhD in EE/CE/CS or have a couple of YOE with a BS. These types of jobs specifically look to see if you have experience with RF and know 3gpp standards. Apply to companies like Verizon, at&amp;t, dish, mavenir, etc. I mainly got this job because my manager wanted a PhD signing important papers and knew I'd have the skills to quickly learn and get up to speed with managing active sites.",
      "subreddit": "cscareerquestions",
      "score": 1958,
      "url": "https://reddit.com/r/cscareerquestions/comments/12xx9qo/anyone_ever_left_a_chill_job_for_higher_pay_and/",
      "comments": [
        {
          "body": "Suffering from Success",
          "score": 1728
        },
        {
          "body": "You're basically retired.\n\nPeople get into FAANG and work 10+ hours per day (with commuting to the office) just to be able to retire.\n\nYou're already at the end game my dude. Go live your best life. You made it.",
          "score": 3006
        },
        {
          "body": "I'd say enjoy it whilst you can , especially in the current job market. However, don't waste  all your time watching Netflix or whatever and try to do something else to keep your skills up to speed and/or learn something new. As you are WFH you could do this on a non-work PC if you are worried about being monitored.",
          "score": 544
        },
        {
          "body": "[deleted]",
          "score": 250
        },
        {
          "body": "Do. Not. Touch. Anything.",
          "score": 60
        },
        {
          "body": "i genuinely don't believe this is a sincere question.\n\n&gt;My company hasn't laid off anyone\n\n&gt;I'm conflicted between hearing faang layoffs/shit job security\n\n&amp;\n\n&gt;but also seeing their 300/400k+ salaries, so I feel like I'm leaving money on the table\n\n&gt;With my current company, I'll hit 180k in 2 years, 220k in another 3, and staff engineer in another 4 topping at 300k.\n\nread what you wrote over and over. \"oh no i'll top out at $300k in 4 years at my fully remote job where I do 2 hours of work\"",
          "score": 649
        }
      ]
    },
    {
      "title": "After 6 years of struggle. I made it bros/gals. Signed 100k package.",
      "body": "2016 - Graduated with below 2.5 GPA. No job, just my johnson in my hand.\n\n2017 - Live at home NEET, crazy depression, anxiety, and suicidal thoughts. Burned an entire year watching anime, netflix, and movies. Also sleeping 12 to 16 hours a day. Waking up and smoking enough weed to put an elephant asleep because every waking moment was extremely painful.\n\n2018 - start of therapy and medication.  Had to learn how to function as a human again. While also trying to cram leetcode and general cs theory\n\n2019 - Condition improve, but continued to try to learn too many things at once. Didn't help that I was living in abusive home enviorment. Managed to land a internship that paid $10 and hour for 3 month.\n\n2020 -  Switched to an ad agency for $25/hr. Covid happen and was laid off during the height of pandemic. Couldn't code at home because of abusive enviorment. Rented a co-working space when everyone was staying home. Was practically living there because I could not afford to move out. Stayed for 3 months, because I could not afford $250 a month open desk. Spent another 3 month working my mall's outdoor food court 12 hours a day. \n\n2021 - Got a better deal from co working space for $100 a month. Was practically living at the co working space again. A small win, but there was increase of random violence at home. Took remaining amount of money, and left the country. Was able to focus on building a product. Applied, and interviewed for a job November. Received and signed offer in December.\n\n2022 - I start working.\n\nWhat I learned\n\n1. Don't try to learning everything at once. Focus on one thing at a time.\n2. Be brave and leave a toxic home enviorment. You won't be able to actually digest material if you are in constant state of fight or flight.\n3. Watch out for coding anxiety. Don't code for the sake of coding. Think about what you want to achieve. Use bloom taxonomy to learn deeply.\n4. Take your time, and pace yourself accordingly.\n5. Believe in the process and believe in yourself.  \n\n\nTook god damn 6 years because I was constantly in state of anxiety and flight mode. Took me 6 months to readjust to a healthy baseline. FML but I made it and so can you. Don't give up. To the bitter end.\n\nEdit1. I was a non-cs major that majored in accounting. My 3rd year i have a 3.0 to 3.2 gpa. Always loved tech but coming from an extremely poor family i was never introduced or had guidance to coding until college. I do recall learning how to make a website with dreamweaver as a freshie. But I loved tech since i was a kid.\n\nI believe coding is just the modern day carpenter and anyone can do it.\n\nEdit2. I did not get FANNG nor was asked an algro question. Though doing tons of leetcode allowed me practice visually mapping algros and cleaned up my coding logic.",
      "subreddit": "cscareerquestions",
      "score": 3600,
      "url": "https://reddit.com/r/cscareerquestions/comments/s4rkbe/after_6_years_of_struggle_i_made_it_brosgals/",
      "comments": [
        {
          "body": "If you find yourself in a difficult place in your life, we urge you to reach out to friends, family, and mental health professionals. Please check out the resources over at /r/depression, /r/anxiety, and /r/suicidewatch. Feel free to [contact the /r/CSCareerQuestions mods](https://www.reddit.com/message/compose?to=%2Fr%2Fcscareerquestions&amp;subject=&amp;message=) for more information or help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I love posts like this. Optimistic, but shows the struggle, the nonlinearity, and the sheer time and energy to get from A to B. A lot of LinkedIn motivation porn these days is missing all of that. Great job, and best of luck with your endeavors 👍🏻",
          "score": 922
        },
        {
          "body": "Good for you. Everyone has a different path and different story. Glad you are and you feel you are on a good path! Good luck!",
          "score": 141
        },
        {
          "body": "Congratulations. You should be very, very proud of yourself. Keep it up!",
          "score": 83
        },
        {
          "body": "Hi, congrats on your job! I was NEET for 3 years after high school due to mental health issues caused by an abusive family. I've currently been working at a warehouse job for 1 year and have been thinking about going to university for computer science, but I'm worried that no employer will ever hire me due to poor my work history even if I pass interviews.\n\nDid any of your interviewers ask about your employment gaps, and how did you address them in your resume and interviews? I would really appreciate it if you could provide me with an answer for this OP.",
          "score": 61
        },
        {
          "body": "Hey, congrats. Live can certainly suck, but a lot of people aren't able to ever dig themselves out of bad situations. 6 years is a short price to pay, and you'll be forever stronger for it.",
          "score": 38
        },
        {
          "body": "Congrats... you started with your johnson in your hand... now you have your johnson in your hand and a 100k job.\n\nGood luck and stay healthy. Keep a good work/life balance. Exercise. Take that johnson out for a good expensive dinner to celebrate.",
          "score": 101
        }
      ]
    },
    {
      "title": "System Design course for everyone! (free)",
      "body": "Hi everyone, today I open-sourced my free System Design course which is suitable for all levels.\n\nThis course also covers everything from basics to advanced topics of system design along with interview problems such as designing Twitter, WhatsApp, Netflix, Uber, and much more!\n\nI hope this course provides a great learning experience.\n\nLink: [https://github.com/karanpratapsingh/system-design](https://github.com/karanpratapsingh/system-design)",
      "subreddit": "cscareerquestions",
      "score": 2632,
      "url": "https://reddit.com/r/cscareerquestions/comments/wps8kt/system_design_course_for_everyone_free/",
      "comments": [
        {
          "body": "We do have this rule:\n\n&gt; Promotional posts and comments, such as linking to your own content, or posts and comments which advertise yourself or a service are never allowed.\n\nBut I can't find any sort of paid product/service being shilled, the content is being provided free of charge, it's content that is relevant to our community (see upvotes), and the content is not a flaming pile of garbage IMO. Beyond corporate events, delivering \"free content\" in exchange for plugging a personal brand is like ... at least half of the conference talks that I've ever attended ;) I don't see an immediate need to remove this post. If you feel differently you can use this comment as a mini META thread.",
          "score": 1
        },
        {
          "body": "This is very cool. Great job.",
          "score": 142
        },
        {
          "body": "Is system design more for mid &amp; senior levels? Or should someone trying to learn programming also have a good foundation of it too?",
          "score": 41
        },
        {
          "body": "Thank you for providing this for free! Saving for later. \n\nDid you use this to study for your current job or you made this as a side job?",
          "score": 49
        },
        {
          "body": "Finally, a lot of courses are more than beginner level and are more intermediate IMO. This finally seems like a decent resource to start from scratch.",
          "score": 13
        },
        {
          "body": "Any idea on hours of completion?",
          "score": 40
        }
      ]
    },
    {
      "title": "Financial advice after a decade in tech",
      "body": "I've been thinking of putting together a huge doc/repo on the financial advice/lessons I wish I knew before entering the tech industry.  There is a lot of general information on financial advice, but very little tailored explicitly for tech employees. With so many jobs now paying $100k+ out of college, I thought -  **What financial info would I have wanted to know when I was jumping into tech?**\n\nWith the correct information and execution, most of you can set yourselves up for a very comfortable life.\n\nI've worked at a wide range of tech companies, running into most of the situations you will most likely encounter in your tech career.  In the last decade, my income grew dramatically. When I joined Yelp reasonably early on, I made $30k base + stock options. At  Netflix, my salary was over $300k.\n\nHere's everywhere I've worked -\n\n* Yelp (Pre-IPO)- when there were 50-75 employees.\n* Redbeacon (5 employees - acquired by Home Depot)\n* SimpleGeo (\\~20 employees - acquired by Airship)\n* Tindie (founded, raised VC, sold)\n* Netflix\n\n**Things I wish I had known when entering the tech world -**\n\n* Reviewing companies &amp; selecting the right opportunity\n* Salaries, pay raises, and how packages are structured\n   * Startups vs big companies\n* Stock options vs RSUs  - how they work, exercising them, the tax implications.\n* Bonuses - what to expect and also the tax implications\n* Health insurance - picking a plan, should you have a health savings account\n* Investing in your retirement (401ks, IRAs, etc)\n* Real estate - renting in these high costs of living areas vs buying\n* Tech investing - becoming an angel investor &amp; VC investing\n* Contract work - how to bill &amp; taxes\n\n**Is this something you'd like to read? What would you like to be covered?**\n\nI  am thinking of building this in public as a repo. That way, if there are topics or things you'd like to see, feel free to create an issue.  Here's that link.\n\n[https://github.com/emilepetrone/financial\\_advice](https://github.com/emilepetrone/financial_advice)\n\nHopefully, this will be helpful to everyone looking to jump into tech or are just starting their careers.\n\n**EDIT**\n\nWow! Thank you all for the comments and thoughts! This has blown up much bigger than I could have imagined. There have been many great ideas in the comments. I will be adding links to other resources, books, and experts. I also plan to interview some of my friends and contacts that are more experienced/professionals in the various niches. More to come in the following days, weeks, and guessing months.\n\n",
      "subreddit": "cscareerquestions",
      "score": 2148,
      "url": "https://reddit.com/r/cscareerquestions/comments/swdgiq/financial_advice_after_a_decade_in_tech/",
      "comments": [
        {
          "body": "I personally think this will be very valuable for a lot of people here. I'm in a completely different situation myself (from the EU and self-employed) so it's not useful for me personally, but I can totally see how something like this might even be linked to from the FAQ/wiki. \n\nRegarding the investing section; don't forget about more passive approaches like ETFs and index funds. Since these are cheap they often have very good returns relative to more active investments and generally fewer risks too.",
          "score": 306
        },
        {
          "body": "You should do this, this would be great help to everyone. Keep us updated.",
          "score": 116
        },
        {
          "body": "I'm especially interested in your insights on how comp packages are structured, and how it differs from startups to big companies",
          "score": 86
        },
        {
          "body": "I just got my first offer, and didn't have much room for negotiation (or didn't feel like it). Hopefully after a year here and learning a lot more and getting some real world experience, I can certainly see something like this being extremely helpful for me, and I'm sure the entire community here.",
          "score": 54
        },
        {
          "body": "I can't wait to see the completion of the GitHub! I'm 22 and recently started work and I've been trying to learn more about all the topics you listed, but it's so difficult to find the right resources, so I can assure you that you'll be helping at least one person :)",
          "score": 17
        }
      ]
    },
    {
      "title": "In 6 months time, I want to interview and succeed with Amazon/Google/Netflix. How can I better myself to get there?",
      "body": "For starters,\n\n* 8 years experience in the industry\n* Mostly application development experience using Java and Python\n* Don't have a github page\n* I would rate myself a 7/10 for technical knowledge currently\n\nClearly, these companies value Algorithm/Data structures/Smart problem solving more than skill set per se.\n\nWhat can I do day in/ day out starting today to be able to give myself the best shot with any of these three?\n\nPS: Particularly with Netflix, I will invest time on learning Cassandra but any pointers on learning how to solve problems in a distributed architecture would be appreciated.",
      "subreddit": "cscareerquestions",
      "score": 78,
      "url": "https://reddit.com/r/cscareerquestions/comments/32afjk/in_6_months_time_i_want_to_interview_and_succeed/",
      "comments": [
        {
          "body": "You don't need a github page, I've done interviews at all of them without one listed and they haven't asked.\n\nInterview questions are likely to cover CS fundamentals (algorithms, data structures, etc.) and distributed systems design. In terms of knowledge, bring your technical knowledge on these as close to 10/10 as possible. In terms of preparation, make sure you go through and practice answering questions on a whiteboard and prepare yourself for all standard interview questions. Learn about each company so that you can talk intelligently about their products and culture. This is really the crux of it - your knowledge and preparation determine your success.\n\nBest way to learn distributed system design is to listen to talks, read papers, and build some. I don't have any resources offhand, but pick a company and search for information about their architecture (for example, go read about StackOverflow's architecture).",
          "score": 30
        },
        {
          "body": "Be careful with that 7/10 self-rating. A software engineer from Google came to my school recently, and said that 8/10 would be \"wrote a book on it\" level and \"10/10\" would be \"invented it.\" They had someone claim 8/10 C++ knowledge and then Bjarne Stroustrup interviewed him, if the story is to be believed.",
          "score": 20
        },
        {
          "body": "We are similar in experience and I had about six months to prepare and got offers. \n\nHere is how I prepared\n\n\nDid:\n\n* Participated in a tech interview meetup once a week for about two months\n\n\nRead/Re-read: \n\n* Algorithms Unlocked\n* Cracking The Code Interview (Did almost every problem)\n* Java Concurrency In Practice \n* Java Generics \n\n\n\nEach place I interviewed seemed to have things they favored more practical experience vs algorithms etc... so don't worry if one doesn't go well. ",
          "score": 9
        },
        {
          "body": "[deleted]",
          "score": 7
        },
        {
          "body": "For all three, knowledge in distributed architecture would be a great asset. Knowing AWS Netflix (as well if you are interested in working with AWS teams).\n\nKnowing and writing cover letters to Amazon with the Amazon Principles in mind would be helpful: http://www.amazon.com/Values-Careers-Homepage/b?node=239365011\n\nReview the videos here and see if there's any core tenants that you should keep in mind when applying to Netflix: https://jobs.netflix.com/#/who-we-are\n\nReview the hiring process for Google and see how you can spice up your application the Google way: https://www.google.ca/about/careers/lifeatgoogle/hiringprocess/\n\nYou can also reach out to a recruiter for any of these companies and see if that's a way to get you leg in the door. Look them up on LinkedIn.",
          "score": 10
        },
        {
          "body": "* Cracking the Coding Interview\n* CareerCup\n* Elements of Programming Interviews (basically a harder version of CtCI)\n* LeetCode OJ (a horrendously named but really awesome website).\n* Introduction to Algorithms by CLRS\n* Operating Systems: Three Easy Pieces (free online)\n\nPractical advice: pick either Java or Python right now and stick with it for all your preparation. My recommendation is Python, as it's far easier and more powerful for whiteboard coding. List comprehensions in particular are immensely valuable for many interview problems.\n\nMore practical advice: *do not worry* about getting rejected. These companies do not blacklist you in any way for not getting an offer. Not everybody is comfortable doing coding interviews, so practice actually doing it can be *very* helpful.",
          "score": 4
        },
        {
          "body": "1. Read the algorithms book by Skiena and solve every problem. You can find the book online for free.\n\n2. You should have a github page for yourself, not for employers. There is only so much knowledge you can get from taking a MOOC or reading papers. You need to install Hadoop/spark/storm/kafka etc locally and come up with a meaningful personal project that produces a real result. Creating an end to end project is the only way to get your skills to a level that you feel comfortable using at a job.",
          "score": 3
        }
      ]
    },
    {
      "title": "Got an offer! Would love your insight-",
      "body": "EDIT: #1 talked to boss and negotiated a highly improved commute.\n\nHi Reddit, would love to hear your opinion on this.\n\nI'm a Front End Engineer with 15yoe. Received an offer for a Staff UI Architect position at a well known semiconductor company (not Nvidia).\n\nThis position is really unique- it's a hybrid of Front End Engineering + UI/UX Design. I was tested on designing UI's for semiconductor (switches, data center etc) data visualization, as well as javascript fundamentals. I initially asked, wouldn't you want a graphic designer since bulk of the work is UI/UX design? but they said no, they could  never understand the technicals of FE dev nor EE. they wanted someone who knew UI/UX design, FE, AND EE. So i was a unique fit for the role.\n\nStats:\n\n\\-280k TC\n\n\\-High level role with mostly design + telling other devs what to create, less coding\n\n\\-5 days a week, 30mi commute (45m no traffic, 1.5hr traffic), absolute killer. + Occasional travel overseas to india.\n**UPDATE** 4 days a week, 30mi commute 10AM-2:30PM, avoids traffic, 45mins. On call for overseas folks 8-10PM.\n\n\\-highly rated on glassdoor, low layoffs compared to peers\n\n\\-incredibly smart EE folks with buncha guys PhD from MIT in Physics, cutting edge tech\n\n\\-I studied EE in college but pivoted to FE dev and now this is almost going back to my roots.\n\n\\----\n\nI have an potential incoming offer with a well known Streaming company (not Netflix), traditional Senior Front End SWE. Estimated stats:\n\n\\-220k TC\n\n\\-Standard Senior IC role, all coding\n\n\\-3 days a week, 7mi commute (15-30mins)\n\n\\-low rated on glassdoor, citing poor leadership\n\n\\-huge fan of their product, if i told my friends i worked here they'd be like thats so cool!\n\nThoughts? I always love getting opinions from reddit so do please give your honest opinions!\n\nI will give back to the community and do a write up of my interview experience in 2025, with interview questions, app:offer ratio etc. I studied so fukin much my brain's gunna melt. Thanks!\n\nPS- job market is hard af (worse than 2008-2012) dont let anyone tell u otherwise. i had to study 3x harder than before.",
      "subreddit": "cscareerquestions",
      "score": 164,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ozy6k3/got_an_offer_would_love_your_insight/",
      "comments": [
        {
          "body": "oatmeal crown label literate attempt racial merciful consider spoon license\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 131
        },
        {
          "body": "sounds like the first offer aligns well with your background, but that commute is rough. second one sounds fun, but lower pay and reputation. weigh your priorities, maybe short-term pain for long-term gain.",
          "score": 65
        },
        {
          "body": "for offer 2, can you talk to the team you'll be working with to gauge how the vibe is? also, i'd use offer 1 to negotiate offer 2 to at least 250. at that point i'd value hybrid over full RTO. also, be sure to try to gauge the risk of layoff at both roles",
          "score": 22
        },
        {
          "body": "Will the first one negotiate for hybrid? Also will there ever not be traffic while you're going in 5 days a week?",
          "score": 10
        },
        {
          "body": "I'd never do that commute. Your $-per-hour goes down so much taking that into account. Plus, imo, staff roles are overrated. The senior role sounds fine, try to negotiate for higher pay.",
          "score": 13
        },
        {
          "body": "What are your career goals? Is position 2 just a stepping stone for another big tech job? What types of company names do you have on your resume? Is position 2 a considerable step up name recognition-wise? \n\nPart of me is wondering if you want to be at a company like position 1 down the road. Are you taking position 2 but hoping for something like position 1 later and would save some steps just going there now?",
          "score": 6
        }
      ]
    },
    {
      "title": "2024 Job Hunt Results, 3 YOE at the Rainforest",
      "body": "Sankey DIagram : [https://sankeymatic.com/build/?i=PTAEFEDsBcFMCdQDEA2B7A7gZ1AI1tBrLJKAHJoAmsWANKCgJYDWso0AFo1gFwBQIUEOHCAymgCu8AMZsA2gEEAsgHkAqmQAqAXVCaAhvADmBPnwUAHC02n7ojNJBxyAjACZdAcQ5oscSuZWNnYOTqCuAAy6AEqwAFaw0v6B1oy29o7OABy6mokckGn6KKCi0vDEkGax5RKMcIix%2BtIcsJSgktDhHnr5hbYlZRUkZnkt%2DcWl5ZXhLroAUmi4oAAKvvaQRqAAwuhYbXxjBUWD0yThOciMkJPRkpDtKk71sId9J1PDpK4x8YnJSGut3uj2ecHCAGZdCoAGYwhB8QE3Ep3CQPUBPLAvWa%2DBJJA5I4Fo0FY8FyAAsum2%2BkgshQKDaoH0MIaTOksgsGy2aDhCNh8MQP1ACnZsE5B35CG6uSkkEZlEwVSxAC82BhQC4AGwRCJ8IQcUDa3UAW0MRmuDA1bj1oEQ7htXRcWRtyzcutwW2kaHQiAAxHCAzCHfAaVgLIYSF0yHxIFQ1VabQaAKy6oRh5rXLYAdiTLrQ8GoiFT7FaxrY%2BhtXp9oF9WTr9ZtaHD0nqAE8NXwYeh1dIpAA3OxSNgRAB0uaE11a8HqMPgaGNHQk0Cx1AAtNdK978zWAJx7%2DeN5tt0Cj8m5lD6VudDoFqX6JfzkLSG1xCR%2BRgwq%2DT81haNCV%2Dvp%2BJCUDgf62rAfYIPsRghhYBpgXY0DNFwtLztYBA0NAaCgHKEZ%2BHwF74CgOBVtuvo6hRxZcNQ5CJowRgcEwDFdKOOY2jCjjQDCzRsFgoarvs05BkITByumLabCeI7WkIFQXvYkEqmwLguMWppGIUn4ajqBH6ERNxlkyViwIYOAAJo2kpGqajaRD0RwXTkjphGwCgA4oBI5bGaZoAWUIMISPSFgVC2WKOL5NoWL49ShHgrmYLZsD2Y5zl6a5UWkrF95YcU9GkMWWAtLAhnZWg7GMPAfhxRxFQuhU%2BjMFF1xdDZ7meaANWml0ADktAjt1kUVDCjAAB6gN1A1phIcKjeNA2cMVsA8jC%2BxdPooA7i6J6VttQjtCaBDrWWMChHxkCsK2XVpBFIncPYxq4MUNKyOZfDGmgkGgLEeL%2BFJERauSbj0Kuo5uJqbhZlmb0fWwizLGs76SbsviMqDmpZlkELA6Omo7hEbjWu9n2EiiIIYmCbAgyOERZm45LkvQo4uDumpJs6RNsJKiBUy4EJZBESaM9TEQQi40OfZYqTpKdoBUzTOpY7LoNZhEZ7i2w3jrKj2MjrzeNixzX2JPAdSsk0RXtNecsRDuWQ7kLKn0xC6u9OMHxDDM1tugzSvSbjSY2Yb1K0q5DLtMyrLNByXIdLyRbU1qity3uEKBzDwqiuK7RU24EL05qOsRNq9Mu5osryoqvu50mBM6%2B4mouOSQA](https://sankeymatic.com/build/?i=PTAEFEDsBcFMCdQDEA2B7A7gZ1AI1tBrLJKAHJoAmsWANKCgJYDWso0AFo1gFwBQIUEOHCAymgCu8AMZsA2gEEAsgHkAqmQAqAXVCaAhvADmBPnwUAHC02n7ojNJBxyAjACZdAcQ5oscSuZWNnYOTqCuAAy6AEqwAFaw0v6B1oy29o7OABy6mokckGn6KKCi0vDEkGax5RKMcIix%2BtIcsJSgktDhHnr5hbYlZRUkZnkt%2DcWl5ZXhLroAUmi4oAAKvvaQRqAAwuhYbXxjBUWD0yThOciMkJPRkpDtKk71sId9J1PDpK4x8YnJSGut3uj2ecHCAGZdCoAGYwhB8QE3Ep3CQPUBPLAvWa%2DBJJA5I4Fo0FY8FyAAsum2%2BkgshQKDaoH0MIaTOksgsGy2aDhCNh8MQP1ACnZsE5B35CG6uSkkEZlEwVSxAC82BhQC4AGwRCJ8IQcUDa3UAW0MRmuDA1bj1oEQ7htXRcWRtyzcutwW2kaHQiAAxHCAzCHfAaVgLIYSF0yHxIFQ1VabQaAKy6oRh5rXLYAdiTLrQ8GoiFT7FaxrY%2BhtXp9oF9WTr9ZtaHD0nqAE8NXwYeh1dIpAA3OxSNgRAB0uaE11a8HqMPgaGNHQk0Cx1AAtNdK978zWAJx7%2DeN5tt0Cj8m5lD6VudDoFqX6JfzkLSG1xCR%2BRgwq%2DT81haNCV%2Dvp%2BJCUDgf62rAfYIPsRghhYBpgXY0DNFwtLztYBA0NAaCgHKEZ%2BHwF74CgOBVtuvo6hRxZcNQ5CJowRgcEwDFdKOOY2jCjjQDCzRsFgoarvs05BkITByumLabCeI7WkIFQXvYkEqmwLguMWppGIUn4ajqBH6ERNxlkyViwIYOAAJo2kpGqajaRD0RwXTkjphGwCgA4oBI5bGaZoAWUIMISPSFgVC2WKOL5NoWL49ShHgrmYLZsD2Y5zl6a5UWkrF95YcU9GkMWWAtLAhnZWg7GMPAfhxRxFQuhU%2BjMFF1xdDZ7meaANWml0ADktAjt1kUVDCjAAB6gN1A1phIcKjeNA2cMVsA8jC%2BxdPooA7i6J6VttQjtCaBDrWWMChHxkCsK2XVpBFIncPYxq4MUNKyOZfDGmgkGgLEeL%2BFJERauSbj0Kuo5uJqbhZlmb0fWwizLGs76SbsviMqDmpZlkELA6Omo7hEbjWu9n2EiiIIYmCbAgyOERZm45LkvQo4uDumpJs6RNsJKiBUy4EJZBESaM9TEQQi40OfZYqTpKdoBUzTOpY7LoNZhEZ7i2w3jrKj2MjrzeNixzX2JPAdSsk0RXtNecsRDuWQ7kLKn0xC6u9OMHxDDM1tugzSvSbjSY2Yb1K0q5DLtMyrLNByXIdLyRbU1qity3uEKBzDwqiuK7RU24EL05qOsRNq9Mu5osryoqvu50mBM6%2B4mouOSQA)\n\nI started interview preparation on the day of the RTO5 announcement. I spent about a month doing nothing but leetcode and system design prep. I completed the Blind 75, Neetcode 150, and a bit of Neetcode 450.\n\nAfter that, I began sending out applications to companies that I was interested in. At the start, I sent out applications to some smaller companies/start ups/banks so that I could warm up my interviewing muscles but I got rejected by all of them. I think this might be because these companies don't want to waste their time interviewing a candidate who doesn't even want to work there in the first place. After that I sent out applications to companies that I wanted to work at (mid size, FAANG, Big N companies) and received responses. I only applied to mid level Software Engineer / SDE II equivalent positions.\n\nOverall, I was pleasantly surprised to get a 10/30 response rate, considering the market conditions for Software Engineer hiring have been terrible. Balancing full time work with interview preparation and onsite interviews was incredibly difficult / exhausting and required sacrifices on my end. I swore off Netflix, video games and dedicated 100% of my free time towards just interview preparation. This resulted in moments where I felt incredibly burnt out and in hindsight, I don't think this was the best strategy. it's important to take small breaks in between.\n\nAt the end, I was incredibly gracious to receive 3 offers from companies. I accepted an offer with a company that is fully remote and I'll be starting work in the new year !\n\nTo all of those who are currently interviewing, I sincerely wish you nothing but the best and that something will come through for all of you !\n\nEDIT: Leetcode progress [https://ibb.co/vddcV1N](https://ibb.co/vddcV1N)\n\nThere wasn't a set amount of leetcode questions I forced myself to do everyday. Most days, I would do just 3-5 and on days/weekends where I had lots of time, I'd attempt 20.  And in most cases, I had to watch the Neetcode walkthrough videos to get a full grasp of how to solve questions I struggled with. Instead of fast forwarding to the part where Neetcode writes the solution, watch the entire video to get a full understanding of how Neetcode comes up with his solution.\n\nIn addition, everyone has their own ways of learning and processing information. For me, I feel that writing things help me digest information well. So I bought some pencils and notebooks and treated interview preparation like school. I wrote down every leetcode question I struggled with and wrote the solutions and code by hand in the notebook.\n\n\n\n",
      "subreddit": "cscareerquestions",
      "score": 279,
      "url": "https://reddit.com/r/cscareerquestions/comments/1h7gflm/2024_job_hunt_results_3_yoe_at_the_rainforest/",
      "comments": [
        {
          "body": "Congrats. Any chance we can see your anonymized resume?",
          "score": 99
        },
        {
          "body": "When I first joined Amazon, my main reasoning was the resume boost. Being in a FAANG seriously makes job hunting a lot easier. Recently I was reached out to by Uber,Stripe,Meta recruiters and possibly more if I went through my whole LinkedIn inbox. All interviews and already an offer from Stripe. If anyone here gets an offer from a FANNG, if for no other reason than to get the resume boost take the job.",
          "score": 65
        },
        {
          "body": "You got the rainforest bonus. Otherwise, you'd have 1-2 reaching out for interviews instead of 10.",
          "score": 93
        },
        {
          "body": "What were the offered TC? Did you negotiate? Did you have to go lower for full remote?",
          "score": 16
        },
        {
          "body": "That study schedule sounds insane. Are you doing 20+ leetcode problems a day and then studying system design on top of that? I’m in study mode right now and I’m not doing anything close to that.",
          "score": 32
        },
        {
          "body": "What do you think was the role of Rainforest on your resume? Was it significant or just a “nice to have”?",
          "score": 7
        }
      ]
    },
    {
      "title": "You should definitely negotiate salary.",
      "body": "This will hopefully be a small piece of encouragement for anyone doubting whether or not they should negotiate their salary after a job offer.  \n\nI'm a software developer with 5 years of experience and I just received an offer for a new job after a few months being on the job hunt.  The offer was 50% higher than my current salary, and came in 20% higher than the range I had originally told the HR person I was expecting.  Given that the new company's offer blew my old salary out of the water and was even more than I had asked for, I was extremely tempted to forgo negotiation.  Negotiating felt super uncomfortable, and I honestly didn't think my qualifications were such that the company would be tripping over themselves to hire me.  In fact, I was even drafting up a post on this subreddit asking if it was worth negotiating at all.\n\nHowever, I decided to call up the company and told them I was extremely excited about the offer and wanted to work with them, but that the salary, while great, didn't quite cover what I thought I'd need (I am genuinely moving to a higher COL area so I mentioned that).  I threw out a number that was 4% higher (modest because I was already getting such a great deal), and HR accepted immediately.  (Obviously if I was better at this I could have framed this better so that HR had to propose a higher number first, but you live and you learn.)\n\nSo all this is to say: you should absolutely negotiate, even if you do it \"poorly\" like I did.  If a company offers you a job, regardless of how unqualified you may feel they clearly want you and they believe you can do the job.  So don't doubt yourself.  I've seen it posted a hundred times, but it's true: a phone call that lasted 10 minutes resulted in me getting a 4% pay bump.\n\nHint: if you're as nervous as I was, write out what you plan on saying.  I wrote my dialogue in a way that sounded conversational so that I could read it out loud on the phone. I tried to make it sound as if I wasn't reading from a script, adding some pauses and a little improvisation, but having a set script in front of me that laid out my argument was invaluable.",
      "subreddit": "cscareerquestions",
      "score": 1047,
      "url": "https://reddit.com/r/cscareerquestions/comments/oq849p/you_should_definitely_negotiate_salary/",
      "comments": [
        {
          "body": "At my current position the person I was interviewing with tried to trap me into selling myself short. They were like \"What are you expecting for the salary\", and I \\*know\\* if I had given a number I'd have ended up showing how little faith I have in my own experience. My friends noted this to me the other day, that I'm so much better than I think.\n\nSo I put this in mind, and replied with \"Above market average\". I knew what the average was. Asked around some friends and looked at some websites etc. Then he wanted me to be more specific, give a specific number/range.\n\nSo I added 20k to the \"average\" that I actually set higher than market average and asked for \"no less, and benefits\". I had read somewhere about this whole negotiation thing and it said to ask for a price that's really higher than average for skill set and experience etc but not crazy high as to turn them off.\n\nGuess what? They negotiated the offer and instead of going with \"below market average\" I was paid \"above market average + 10K\". They def weren't comfortable with the number as it was more than all people I know personally in the same field with the same experience level. I never felt better.\n\nI don't know if it was pure luck, but damn I didn't even expect them to settle for average, let alone the number I negotiated for.\n\nEdit: The good thing about this is the company is all-remote, so I don't have to pay for commute or expensive food etc. The negotiation also took place in email, so I had all the time in the world to think for proper replies.",
          "score": 198
        },
        {
          "body": "[removed]",
          "score": 464
        },
        {
          "body": "I have negotiated a lot of offers in my time and I got more salary in *almost* all of them. But let me tell you about a time where negotiating made things fall apart.\n\nLast year my company was in shambles, mass layoffs, middle of the pandemic. I decided to start applying and got an interview with a small company in my city that had been around awhile. I did a take home assessment that took over 10 hours (I know I know). Interviewed more and they loved me and made me an offer over text (so I guess that's verbalish, even though it's in writing).\n\nI was excited! So I thought it would be the time to negotiate my salary. I asked for 10k more than the offer I got because that would bring it up past my current salary at the time rather than be lateral. They agreed both over text and verbally over the phone. I was ready to sign on the dotted line!\n\nThen 2 hours later I got a call \"the finance guy went back and decided he didn't agree to your salary, we are offering you 3k less\". I lost 3 thousand dollars in two hours. This seemed so petty to me so I tried to negotiate more PTO (they only gave 3 weeks which again was worse than my current job). Give me an extra week of PTO and they could keep the 3k.\n\nTheir response? \"We cannot change our PTO policy\". I did not think I was out of line with either ask. Their tone this time was rather rude. I soured on them, they soured on me, and I sent them an email declining the next day.\n\nTwo weeks later I looked back on the job description and they lowered it from senior to mid level. Wasted all that fucking time for me when they wanted to low ball the position from the get go.\n\nIt's rare that negotiationing salary can ruin your offer, but yeah it can happen.",
          "score": 291
        },
        {
          "body": "[deleted]",
          "score": 146
        }
      ]
    },
    {
      "title": "Master list of Free Resources",
      "body": "With the holidays coming up, I wanted to share some mostly free resources (well the books and some courses aren't free) that I've used for preparation in the past. If you have any resources that worked for you, let me know and I'll add it onto this list. My goal is to create a master list so everyone knows about which resources might be helpful.\n\nLeetcode Question Sets:\n\n* [https://leetcode.com/discuss/interview-question/352460/Google-Online-Assessment-Questions](https://leetcode.com/discuss/interview-question/352460/Google-Online-Assessment-Questions)\n* [https://leetcode.com/discuss/interview-question/344650/Amazon-Online-Assessment-Questions](https://leetcode.com/discuss/interview-question/344650/Amazon-Online-Assessment-Questions)\n* [https://www.teamblind.com/article/New-Year-Gift---Curated-List-of-Top-100-LeetCode-Questions-to-Save-Your-Time-OaM1orEU](https://www.teamblind.com/article/New-Year-Gift---Curated-List-of-Top-100-LeetCode-Questions-to-Save-Your-Time-OaM1orEU)\n* [https://medium.com/@koheiarai94/60-leetcode-questions-to-prepare-for-coding-interview-8abbb6af589e](https://medium.com/@koheiarai94/60-leetcode-questions-to-prepare-for-coding-interview-8abbb6af589e)\n* [https://h1ros.github.io/posts/coding/leetcode-top-100-problem-selection/](https://h1ros.github.io/posts/coding/leetcode-top-100-problem-selection/)\n* [https://github.com/fterh/leetcode-curation-topical](https://github.com/fterh/leetcode-curation-topical)\n* [https://github.com/liuchuo/LeetCode-Top100](https://github.com/liuchuo/LeetCode-Top100)\n\nSystem Design:\n\n* System design template - [https://leetcode.com/discuss/career/229177/My-System-Design-Template](https://leetcode.com/discuss/career/229177/My-System-Design-Template)\n* [System Design Primer](https://github.com/donnemartin/system-design-primer)\n* [Grokking the System Design Interview](https://www.educative.io/collection/5668639101419520/5649050225344512) \\*this isn't free but widely used\n* [https://www.youtube.com/watch?v=iJLL-KPqBpM](https://www.youtube.com/watch?v=iJLL-KPqBpM)\n\nBehavioral/Deep-Dive:\n\n* [https://www.youtube.com/watch?v=PJKYqLP6MRE](https://www.youtube.com/watch?v=PJKYqLP6MRE)\n* Amazon's official interview guide - [https://www.amazon.jobs/en/landing\\_pages/in-person-interview](https://www.amazon.jobs/en/landing_pages/in-person-interview)\n\nGeneral Interview Resources\n\n* Careercup\n* Glassdoor\n* Catalog of all FAANG interview information on Rooftop Slushie [https://www.teamblind.com/article/Catalog-of-FAANG-interview-information-MRLji71n](https://www.teamblind.com/article/Catalog-of-FAANG-interview-information-MRLji71n)\n* [https://www.freecodecamp.org/](https://www.freecodecamp.org/)\n\nBooks:\n\n* Cracking the Coding Interview by Gayle Laakmann McDowell (6th edition) [https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850/](https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850/)\n* Computer Science Distilled [https://www.amazon.com/Computer-Science-Distilled-Computational-Problems/dp/0997316020](https://www.amazon.com/Computer-Science-Distilled-Computational-Problems/dp/0997316020)\n* [Distributed Systems for Fun and Profit](http://book.mixu.net/distsys/single-page.html) \\- free book, 100 pages or so, but excellent content\n* Designing Data Intensive Applications by Martin Kleppman - this is a more in-depth book, and you can get it on Amazon/libgen\n* The Google Resume by Gayle Laakmann McDowell (1st edition)\n* Programming Interviews Exposed\" by John Mongan, Noah Suojanen (3rd edition)\n* Elements of Programming Interviews\" by Adnan Aziz, Tsung-Hsien Lee, and Amit Prakash (2nd edition)\n* System Design Primer\" by Donne Martin\n* Grokking Algorithms (free to read online) [https://www.manning.com/books/grokking-algorithms](https://www.manning.com/books/grokking-algorithms)\n\nCourses\n\n* [https://www.educative.io/courses/grokking-the-system-design-interview](https://www.educative.io/courses/grokking-the-system-design-interview) \\*this isn't free but widely used\n* [https://www.educative.io/courses/grokking-dynamic-programming-patterns-for-coding-interviews](https://www.educative.io/courses/grokking-dynamic-programming-patterns-for-coding-interviews) \\*this isn't free but widely used\n* [https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/](https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/)\n* [https://www.youtube.com/watch?v=y62zj9ozPOM&amp;list=PLhQjrBD2T3828ZVcVzEIhsHVgjANGZveu](https://www.youtube.com/watch?v=y62zj9ozPOM&amp;list=PLhQjrBD2T3828ZVcVzEIhsHVgjANGZveu)\n\nBlogs\n\n* Netflix tech blog - [https://medium.com/netflix-techblog](https://medium.com/netflix-techblog)\n* Uber - [https://eng.uber.com/](https://eng.uber.com/)\n* Twitter - [https://blog.twitter.com/engineering/en\\_us.html](https://blog.twitter.com/engineering/en_us.html)\n* Airbnb - [https://medium.com/airbnb-engineering](https://medium.com/airbnb-engineering)\n* Airbnb - [https://airbnb.io/](https://airbnb.io/)\n* Here's a consolidated list of company-wise engineering blogs: [https://github.com/kilimchoi/engineering-blogs](https://github.com/kilimchoi/engineering-blogs)\n* [https://medium.com/outco](https://medium.com/outco)\n* [https://medium.com/@liyin2015](https://medium.com/@liyin2015)\n* [https://medium.com/@sourabreddy](https://medium.com/@sourabreddy)\n* [https://github.com/donnemartin/system-design-primer](https://github.com/donnemartin/system-design-primer)\n* [https://www.geeksforgeeks.org/](https://www.geeksforgeeks.org/)\n* [https://github.com/sindresorhus/awesome](https://github.com/sindresorhus/awesome)\n* [https://github.com/liyin2015/Algorithms-and-Coding-Interviews](https://github.com/liyin2015/Algorithms-and-Coding-Interviews)\n* [https://medium.com/leetcode-patterns](https://medium.com/leetcode-patterns)\n* [https://hackernoon.com/14-patterns-to-ace-any-coding-interview-question-c5bb3357f6ed](https://hackernoon.com/14-patterns-to-ace-any-coding-interview-question-c5bb3357f6ed)\n* [https://www.programcreek.com/2012/11/top-10-algorithms-for-coding-interview/](https://www.programcreek.com/2012/11/top-10-algorithms-for-coding-interview/)\n\nYoutube channels/playlists that I found helpful:\n\n* [Back to Back SWE](https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA) \\- playlists [https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA/playlists](https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA/playlists)\n* [Tushar Roy](https://www.youtube.com/user/tusharroy2525)\n* [happygirlzt](https://www.youtube.com/channel/UCamg61pfZpRnTp5-L4XEM1Q)\n* Nick White's Leetcode explanations - [https://www.youtube.com/playlist?list=PLU\\_sdQYzUj2keVENTP0a5rdykRSgg9Wp-](https://www.youtube.com/playlist?list=PLU_sdQYzUj2keVENTP0a5rdykRSgg9Wp-)\n* Tushar Roy - [https://www.youtube.com/user/tusharroy2525/playlists](https://www.youtube.com/user/tusharroy2525/playlists)\n* mycodeschool - [https://www.youtube.com/user/mycodeschool/playlists](https://www.youtube.com/user/mycodeschool/playlists)\n* Tech Dummies - [https://www.youtube.com/channel/UCn1XnDWhsLS5URXTi5wtFTA/playlists](https://www.youtube.com/channel/UCn1XnDWhsLS5URXTi5wtFTA/playlists)\n* CS Dojo [https://www.youtube.com/channel/UCxX9wt5FWQUAAz4UrysqK9A/playlists](https://www.youtube.com/channel/UCxX9wt5FWQUAAz4UrysqK9A/playlists)\n* Jeff Dean's talk at Stanford: [www.youtube.com/watch?v=modXC5IWTJI](http://www.youtube.com/watch?v=modXC5IWTJI)\n* Building Billion user Load Balancer at Facebook: [www.youtube.com/watch?v=bxhYNfFeVF4](http://www.youtube.com/watch?v=bxhYNfFeVF4)\n* Netflix Guide to Microservices: [www.youtube.com/watch?v=CZ3wIuvmHeM](http://www.youtube.com/watch?v=CZ3wIuvmHeM)\n* Amazon DynamoDB deep dive: [www.youtube.com/watch?v=HaEPXoXVf2k](http://www.youtube.com/watch?v=HaEPXoXVf2k)\n* [Abdul Bari’s Youtube Channel](https://www.youtube.com/channel/UCZCFT11CWBi3MHNlGf019nw)\n* Derek Banas tutorials [https://www.youtube.com/user/derekbanas](https://www.youtube.com/user/derekbanas)\n\nIntro to CS\n\n* [https://github.com/ossu/computer-science](https://github.com/ossu/computer-science)\n* [https://github.com/ForrestKnight/open-source-cs](https://github.com/ForrestKnight/open-source-cs)\n* [https://upskillcourses.com/courses/essential-web-developer-course](https://upskillcourses.com/courses/essential-web-developer-course)\n\nedit------\n\nadded some of the links/resources people commented. Put youtube channels at the bottom.",
      "subreddit": "cscareerquestions",
      "score": 2559,
      "url": "https://reddit.com/r/cscareerquestions/comments/e4v755/master_list_of_free_resources/",
      "comments": [
        {
          "body": "Thank you for sharing this OP. If you're the kind of person who would compile and then share out a list like this to help others, any team would be lucky to have you.",
          "score": 249
        },
        {
          "body": "Grokking is good, but not free! Might wanna add a disclaimer.",
          "score": 65
        },
        {
          "body": "What's the overall consensus on Clean Code by Robert C. Martin? I really liked it but I don't know how other people feel about the book",
          "score": 36
        },
        {
          "body": "https://medium.com/leetcode-patterns\n\nhttps://hackernoon.com/14-patterns-to-ace-any-coding-interview-question-c5bb3357f6ed\n\nhttps://www.programcreek.com/2012/11/top-10-algorithms-for-coding-interview/",
          "score": 29
        },
        {
          "body": "Maybe also Add, [Abdul Bari’s Youtube Channel](https://www.youtube.com/channel/UCZCFT11CWBi3MHNlGf019nw) here",
          "score": 21
        },
        {
          "body": "This winter is going to be jam PACKED. thanks!",
          "score": 18
        }
      ]
    },
    {
      "title": "C++ System Design",
      "body": "Can i get some advice about whether I should study System Design for advancing towards more senior roles as a C++ Developer?  It’s hard for me to imagine the relationship and/or logical career progression from low-level development with C++ into more of an architect role for System Design.  Like would a Senior C++ Dev or Lead be asked a “How would you design Netflix” type of question for an interview?  \n\nI can understand the relevance with using design patterns to architect higher-level solutions, but that isn’t exactly the same thing as “System Design”.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1qc2kyz/c_system_design/",
      "comments": [
        {
          "body": "yes you should, but not netflix level. focus on concurrency, memory, caching, queues, db schema, api boundaries, scaling a single service. senior c++ ends up doing that. also yeah, hard to grow when jobs are this crap now",
          "score": 2
        },
        {
          "body": "Yeah you should. Pretty much any senior backend role, you’re gonna get a systems design round/interview",
          "score": 2
        }
      ]
    },
    {
      "title": "Tips for Netflix panel",
      "body": "Hey everyone!\nI have a Netflix panel interview coming up on Monday — it’s 3 rounds focused on:\n\t1.\tConcurrency\n\t2.\tCoding / Problem Solving\n\t3.\tDistributed System Design\n\nI’ve been brushing up on threading, synchronization, and async patterns, as well as classic system design topics like scalability, consistency, and data partitioning. But I’m curious —\n\n👉 What kind of questions or depth does Netflix go into for these areas?\n👉 Any recent interview experiences?\n\nAny insights would be super helpful! Thanks in advance ",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ofk3qr/tips_for_netflix_panel/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "here are my stats for trying to land a job (.0016% success rate)",
      "body": "600+ applications, 30+ phone interviews, 5+ on-sites, 1 offer\n\nand the offer was from FAANG\n\nI honestly believe it's much easier to get an offer from a large company who asks leetcode style questions than from small local companies.\n\nFrom those 30+ phone interviews, about ~4 were technical interviews (leetcode), the others were just basic java and behavioral questions. All of my onsites were behavior except for 1.\n\nSmall companies actually NEED you to have practical knowledge. I have some but not like other students, so I figured my best shot into industry is through FAANG. I read a quote on here that said \"these companies don't hire for open positions, they hire smart people and find a place for them to work\". So you don't need to know all of the technologies, as long as you show that you can think they will hire you and train you.\n\nI got interviews with all of FAANG except Netflix &amp; Apple, got the offer from 1, rejected from another (after first round), and moved onto final round with another (i believe I can do well and get the offer, but I will not be accepting it even if I did).\n\nI also got interviews with other large companies that weren't FAANG but still pretty well-known. I did well on their leetcode style interviews as well.\n\nAll over the course of 8 months, and over 600 applications. This was my journey to finally landing a job.\n\nMy resume: 1 internship experience 3.7 gpa skills with java, python, etc (some popular frameworks)",
      "subreddit": "cscareerquestions",
      "score": 116,
      "url": "https://reddit.com/r/cscareerquestions/comments/b7bpct/here_are_my_stats_for_trying_to_land_a_job_0016/",
      "comments": [
        {
          "body": "0.16% success rate. 0.0016 means you applied to 62,500 jobs. \n\nBut yeah. Hiring is stupid af.",
          "score": 278
        },
        {
          "body": "First off, congrats, you had a long journey. Good job.\n\nThat being said, I just want to say that we shouldn't glorify these posts of \"I did a ton of applications and finally got an offer!\"\n\nIn my opinion, if you do more than 100 applications and don't hear anything even remotely promising back, you need to seriously re evaluate your strategy and/or learn more skills before you try again. It should not be the norm that anyone needs 500 applications. There are people reading post after post of things like this and think they're fucked because they're statistically 550 applications away from getting a reasonable job offer.",
          "score": 63
        },
        {
          "body": "I cover this a bit in [my guide to preparing for technical interviews](https://algodaily.com/lessons/how-to-prepare-for-a-technical-interview), but smaller companies tend to have less resources and will thus look for more experience (and usually ask more specific questions, whether for language or position).\n\nIt's really interesting how as a new grad, it's harder to get an interview at a Big-N but theoretically easier to get the actual job because the interview is more general/theoretical.\n\nWhereas as an experienced dev, it's easier to get an interview but probably harder to get the actual job because you haven't thought in theory in a while.",
          "score": 73
        },
        {
          "body": "[deleted]",
          "score": 46
        }
      ]
    },
    {
      "title": "Programming Interview : Why do they all ask those CS 101 Algorithm/Data Structure questions these days?",
      "body": "I'm 51 and have been programming since I was around 13.  I've worked in all sorts of companies, big and small, in many different industries.  I like to think I write good, efficient, quality code that's readable, extensible, and reasonably clever.  A good \"software craftsman\" as it were.\n\nRecently, I've been phone screened at Google, Twitter and Netflix.\n\nFor the first time in my long career, almost all the questions in my technical interviews were what I call \"Computer Science 101\" style questions.  Tree/graph traversal, tree balancing, checking for cycles in data structures, shortest-path algorithms, Cartesian Product algorithms, most-efficient-access algorithms, etc. etc.  Things that could be found in the slew of recent \"How to interview at Google/Microsoft/Facebook\" books and articles.  And they are - amusingly - things I've almost NEVER had to use in any job I've ever had.\n\nAnd these techniques seem to be starting to be used at lots of other, not-as-big-or-successful companies.\n\nTo what do you think we can attribute this rise in this style of interview?\n\nIn the past, the technical portion of the interview process has been composed of:\n\n1. Do I have the skills they need for this project?\n2. Demonstrate to them my experience in these skills\n3. Here's a real-world sort of problem - solve it\n4. Add complexity to this real-world problem, and solve it again\n5. Explain my solutions to this real-world problem\n6. Relatively simple discussion of algorithms and data structures (eg. when would I use which kind of algorithm or data structure, and why?)\n7. Describe some difficult technical problems I solved, and how I solved them\n8. Code samples for projects I worked on\n9. Coding tests\n\n... and a few other things.  They were more \"organic\", if you will, not quite so \"Solve this classical/academic CS problem that's been solved before, so we can see if you know it, or 'how you problem solve' if you don't).\n\nPersonally, I really suck at some of these sorts of interview questions, but my work - in my own estimation and that of quite a few of my past colleagues and managers - has been first rate.  But my past performance is immaterial if I don't solve these sorts of interview questions to the interviewer's satisfaction.\n\nThe entry to a lot of these interviews now seems to be this sort of question, and if you choke up, you're out immediately.\n\nWhy has the programming interview morphed into this kind of thing lately? Anyone have any good clues as to why?  Is it just because \"Google does it, Google is successful, so we'll do it too\"?  Or is it that much better than past interview techniques, do you think? \n",
      "subreddit": "cscareerquestions",
      "score": 232,
      "url": "https://reddit.com/r/cscareerquestions/comments/3c9a1z/programming_interview_why_do_they_all_ask_those/",
      "comments": [
        {
          "body": "I recently had a pre-screening with a big-four company. Automatically scored on two problems involving matrix manipulation. When chatting on the phone with them afterward, they said it was odd that I scored as well as I did, given that I had no professional experience. \n\nThis response completely baffled me. I'd expect the things I would learn in a professional environment to be stuff like enterprise Java, frameworks, collaborative coding practices, testing, building, documentation, working with existing code bases, navigating large projects, etc. The problems they gave me.... they weren't even really algorithms. It was just thinking through shit. \n\nIt doesn't make sense to me either. I'm just glad it's working in my favor.",
          "score": 60
        },
        {
          "body": "[deleted]",
          "score": 132
        },
        {
          "body": "What can I say? It's just plain ridiculous. I am looking for a change right now with decent experience under my belt but I have to take out my data structure and algorithm notes and start all over again. I cannot imagine what it must be for your level of experience. There was a similar discussion on hacker news about this after a guy that developed HomeBrew was asked to invert binary trees in a google interview : https://news.ycombinator.com/item?id=9695102\n\nHonestly, look at candidate's resume for God's sake and use your common sense and ask relevant questions. We use agile methods in our engineering but there's zero agility here and such stupidity is allowed when it comes to interviews, it boggles my mind.",
          "score": 64
        },
        {
          "body": "its due to massive amount of new hires who just graduated.  I would say well over 50% of interviews at the big companies are with recent grade (people with under 2 years experience).  since its difficult to have real world experience interviews with these people  you refer back basic cs101 questions.  in turn you start hiring lesser experienced people (as intended) and then after they have a year of experience you let them start interviewing people.  these new interviewers not only dont have experience with interviewing, they also dont hqve much experience in general and they can really only ask you those basic questions.  due to their poor interviewing experience (as well as many other downsides to inexperienced people), they dont really even interview you and instead just read a question out loud and think that their job is to grade how well the candidate did.\n\nits really just a vicious cycle thqt has found its way down to the bottom.  many of the questions that they ask are good questions in theory, but theyre good to led an interview to when you understand that the candidate is familiar with that.  not as simple quiz type question that you give to everyone.",
          "score": 38
        },
        {
          "body": "&gt; The entry to a lot of these interviews now seems to be this sort of question, and if you choke up, you're out immediately.\n\nYup. \n\nGot to round two of Google's interviews. The first interview went great! Super interesting question. Nice Q &amp; A. At the second interview, I got presented with the question:\n\n    Given a set of sorted integers of size N, count all tuples x, y, and z that add up to a sum less than or equal to a given value V.\n\nAfter quickly shitting my pants, I was able to get out an answer in half an hour. The interviewer then said \"You're answer has a complexity of O(n^3). Can you do something to get it down to O(n^2). \n\nI, of course, told him that my answer wasn't efficient given the time constraints, and tried desperately to figure out how to omit one of my nested loops to bring it down to O(n^2), but ran out of time... and was immediately turned down.\n\nI dunno, maybe I dodged a bullet. Because if working at Google involves these dummy math problems day in and day out, then I don't think that I'd like to work there.",
          "score": 8
        },
        {
          "body": "[deleted]",
          "score": 30
        }
      ]
    },
    {
      "title": "Companies announcing hiring freezes is increasing by the day. Should we be worried?",
      "body": "It started with Meta last month announcing that they were going to stop hiring for while. Ii wasn't surprised, given the performance of their stock.\n\nHowever more and more companies are making the same announcement. Salesforce,  Twitter, Netflix, Zendesk, AWS to name a few. I've also heard of job offers being rescinded, interviews cancelled and people being made redundant.\n\nThis somewhat surprises me. I know the stock market has preformed poorly this year, inflation is high and  we're probably in a recession (will be confirmed in July), but a few months ago, that market was on fire.\n\nIs trouble brewing? Should we strap in and stick with our jobs, and not risk moving jobs, only to be cut due to being the last in.",
      "subreddit": "cscareerquestions",
      "score": 33,
      "url": "https://reddit.com/r/cscareerquestions/comments/urrox5/companies_announcing_hiring_freezes_is_increasing/",
      "comments": [
        {
          "body": "I had 2 AWS recruiters reach out to me this morning alone. Are you sure about them?",
          "score": 143
        },
        {
          "body": "AWS has a freeze going on? Anyone have any links? I think I'm surprised by that the most, considering how desperate  they were for software developers.",
          "score": 77
        },
        {
          "body": "AWS is not freezing. Their recruiters are still carpet spamming everyone on LinkedIn.   \nSome companies freeze because they hit peak hiring in Q1 like Meta.  \nSome companies have to sort their shit out before sinking like Netflix.   \nDon’t think too much. Apply and interview if you get call",
          "score": 31
        },
        {
          "body": "There’s no freeze in AWS. This is how rumors start.",
          "score": 23
        }
      ]
    },
    {
      "title": "Courses on Excelr",
      "body": "I'm planning on taking an online course from excelr on \"*Fullstack Java Development*\". So anyone who has or is doing a course or completed. Is it of any worth? Do they get you placement? Any small info would be appreciated. Thanks!\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nEDIT: (For those who want to apply in any course in excelr): \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n~~~~~~~~\n10 Jan '24: \n~~~~~~~~\nI purchased the course \"*Fullstack Java Development*\" and the procedure took around an hr or so(Got 2 verification calls- One call where the finance person guided me with the registration process which will start my no-interest EMI for 10 month's and the other call for actual verification and agreeing statement). AND it was all simple and good guiding. \n\n~~~~~~~~\n12 Jan '24:\n~~~~~~~~\nI'm provided with the dashboard from where I can access all the study materials, LIVE SECTION, Quiz Questions, etc.\n\n~~~~~~~~\n17 Jan '24:\n~~~~~~~~\nThe first lecture went for 2hr &amp; 40mins(Time: 20 - 22:40) and it was interactive and very thoroughly explained. The first day was obviously a theory lecture to explain the architecture, languages, tools, projects, interview, placements and so on. MOST OF THE STUDS WERE ANNOYED Because there was this particular student who has already completed his/her master but for some reason joined this course. The annoying part was he/she kept asking advance Q in the middle of the teaching(sir was friendly so couldn't say \"you can ask me the Q at the end of lecture\" nope instead he answered his/her question even tho sir must be getting irritated as well) GOOD THING was one of the excelr managing department member interrupted in middle of the lecture and said \"sir please mute everyone, we will be keeping a QnA section as well then we can get their doubts and Q clear as many of them here came to learn from basic\")But overall it was A GOOD, INTERACTIVE and COMFORTABLE lecture. \nPS: He/She again started asking the advance non-basic Q :) \n\n~~~~~~~~~~~~~~~~~~~\nEDIT[BETWEEN APRIL-MAY]: \n~~~~~~~~~~~~~~~~~~~\n(adding my reply here from a comment which I was not able to respond to cuz of the moderator restrictions.) We've completed the frontend part of the course (HTML, CSS, JavaScript, and React), and I can confidently say it was worth every rupee. The classes were practical and interactive, with plenty of hands-on learning. We worked on small projects like an online burger shop (UI only, not interactive), a Netflix clone (UI only), and an interactive online course website using React.\n\nNow, we've moved on to the backend, starting with Java. I'll share updates on that as we progress.\n\nAs for the question, \"Isn't similar or even better content available for free?\"—Absolutely! But the key difference lies in the experience: we get real-time doubt clearing, daily assignments to stay in practice, and structured learning.\n\nOnce the course content is completed, they’ve promised:\n•A 2–3 month internship\n•Mock interview training\n•Resume building support\n•Multiple interview opportunities until we land a job\n\n~~~~~~~~~~~~\nEDIT[19 Jul 2025]: \n~~~~~~~~~~~~\nDon't know what the issue the moderator has with me replying but you can DM me for any specific Q if you planned on joining for this specific course. Thanks :)\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nPosting my RESPONSE to a few Questions I got asked in DM's from others(I'll just copy-paste it here. If you have the same Q): \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nQ: Hey is it worth joining this center for placement?\nA: I haven't been disappointed with it so far, but I'll be able to confirm its effectiveness in terms of placement only after a month or two, when my placement starts(updated: it was worth the time and money)\n\nQ: How long is the course duration\nA: 6 months + 1 month team project and so\n\nQ: And how many companies can we apply to?\nA: Don't have the specific answer to it BUT they will get you multiple calls from companies as long as you are not accepted. For package it depends on you but they promised between 3 - 4.5 LPA\n\nQ: can I know about your experience with excelr as I'm willing to join and tell me how they are with their placement?\nA: Yes and it's been 7 months and right now I'm working on a team project so still a month or 2 to go for actual placements to proceed(But I'd say I'm satisfied with their course).\nAs for Rating(includes their explanation along with code + concepts covered):\nHTML: 100%\nCSS: 101%(this was taught best)\nJS: 95%\nREACTJS: 80%\nJAVA:98%\nSPRINGBOOT: 70% .\n\nQ: hey, thank you for your response, actually im planning to relocate my self to [state name] for this particular course because ik I will not be able to concentrate in online, and im planning to take data analytics course from them.. if just in case you have any friends with in the excelr taking the course, can you let me know what was their experience with the course, and coming to the placement.. whats your opinion till now abt the placement.. will they really provide?? and once again thank you for your response\nA: Anytime! I did my course online (Offline is always the best choice), and as for the DA course, I can't help with that. The friends I have are all within the same course as I am. I did know about a student from my college who did the \"Selenium Testing\" course from EXCELR (for free because he/she was selected), and he/she got a placement in some company in 12-14 months, but yes. I myself went on with this institution because of it, and it's promising as far as now.\n\nQ: Hey! Thanks a lot for sharing your experience 🙌 That really helps. I totally agree, offline is usually better for learning and networking. It's good to know someone got placed after doing the Selenium Testing course, even if it took some time. I'm glad to hear you're finding the institution promising so far. And based on your experience till now, would you personally recommend that I join ExcelR for the Data Analytics course? I'd really appreciate your honest opinion \nA: I would recommend you to check out the review from their website as teaching might differ from course to course(But a placement is at least promised)\n\nQ: Excelr is for data analytics right?\nA: No it's not just for one course. It has other field study as well check out their official page",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1hw9431/courses_on_excelr/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Any update?",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Hey there , Hows it going now ?? Is the course a good one , after the initial intro classes ??\n\nIs it worth the money that they are charging, like can we get similar or better content for free on the internet ??",
          "score": 1
        },
        {
          "body": "Hey can I get a quick review on your overall experience??",
          "score": 1
        },
        {
          "body": "Good selected for free training and placement assistance there. Will the classes be taken separately or combined with paid students, and is it worth the time?",
          "score": 1
        }
      ]
    },
    {
      "title": "Will Disney become a huge place to work for with the launch of Disney+?",
      "body": "If Disney+ is a success, will Disney pay their workers the same if not better than Netflix?",
      "subreddit": "cscareerquestions",
      "score": 198,
      "url": "https://reddit.com/r/cscareerquestions/comments/dax79j/will_disney_become_a_huge_place_to_work_for_with/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 478
        },
        {
          "body": "Throw away account...\n\nSpeaking as someone who may or may not work for Disney Streaming Services; I can assure you this will not happen.\n\nAs [BamTech](https://en.wikipedia.org/wiki/BAMTech) migrates all of the legacy workers from the Bamtech benefit plan to the Disney Benefit plan.  There are some positives and negatives, but overall employees will come out at a net loss.  We're being migrated slowly over--sort of like the frog in the boiling water.\n\n**Health Insurance**\n\nIn 2020, we'll lose our \\`no premium\\` health insurance that covers just about everything and move into a more 'traditional\\` non-tech company plan.  Depending on your usage, you can expect to pay anywhere from $0 to $8K for health insurance expenses which you did not have previously.  \n\nDisney is letting us go premium free in 2020, which is nice, but after that the Bamtech-legacy employees will start paying for health insurance via paycheck deductions.  \n\nThis is the type of plan where we pay an amount per month in monthly premiums, and then pay another $1K-$8K for actual health care costs depending on what you need /use.\n\nThose with families and/or pre-existing conditions lose significantly.\n\n**Vacation**\n\nIn 2019, everyone was bumped up to 3 weeks vacation instead of 2.  The newer employees won out big in this; but didn't affect anyone who had been there enough to accumulate more than 2 weeks vacation already.\n\nA minus long term, you'll have to stay a lot longer to get that 4th week of vacation.  I don't have the numbers in front of me, but I think it was 9 years instead of 5 or 6.\n\nIn 2020, the company is losing the winter shut down week between Christmas and New Years.  This is being off-set by additional vacation days,  and some floating holidays throughout the year, however it has still ruffled some feathers.\n\n**Retirement**\n\nBamtech put in 6% of your salary into a retirement fund for you. This is not a match.  After 4 years, this amount increased 1.5% per year and capped at 15%.  This is a huge benefit and incentive to stay for the long term.  Bamtech legacy employees are locked in at their current percentage.\n\nDisney plan caps out at 9% or so and uses a weird formula to figure out their contribution.  My interpretation was that I'd have to work there for 50 years before I can increase beyond the 6% I'm locked in as.  That is a huge negative.\n\nOn the plus side, in addition to the non-match contribution; Disney is adding a matched contribution; 50% of the first 4%.  If you are already contributing at least 4% to a 401K; this is a nice.  If you aren't; you'll see further reduction in take home pay in order to make use of this benefit.\n\n**Overall**:\n\nMany employees are expecting a $5K-$7K decrease in overall compensation in 2020.  This will increase in 2021 and 2022 as we take on a larger burden for paying our health insurance premiums.  \n\nMany people have been reprimanded for discussing this \\`publicly\\` on internal slack channels.\n\nA mass exodus of employees is expected starting in 2020 without changes.",
          "score": 92
        }
      ]
    },
    {
      "title": "The complete guide to bootcamps",
      "body": "As a teacher at a well known bootcamp (won't say to protect it and myself), I've seen the whole spectrum of thoughts and opinions on bootcamps, and I hope this post can lay the debate to rest. Tldr, it's very naive to use one persons success or failure at a bootcamp as a blanket statement for everyone else. Not everyone from Harvard is successful, not every gym goer is fit, and not everyone who does/uses product X gets results Y. The biggest comparison I can draw is r/fitness view on CrossFit. There are many of those who swear by it, and there are many who think CrossFit is the dumbest thing ever existed. While CrossFit has worked for many, of course it doesn't mean it will work or be the right fit for everyone, and bootcamps are no different in that regard\n\n&amp;nbsp;\n\n**CS degree vs no degree**\n\nFor the most part, people who have CS degrees tend to do much better. They are able to understand the curriculum faster and get through our challenges faster. Something to keep in mind is that there are students with CS backgrounds who come to bootcamps to broaden their skill set, and who come strictly for the interview preparation, resume building, and networking. Does this mean they're always better than the non CS grad? Not at all. In this industry, you still need to be a great team player, be an effective communicator, and have an overall positive attitude. I've had CS grads in the past who have a ton of difficulty in public speaking and interviewing. I've also had CS grads with terrible attitudes, the ones who know they're stronger technically, and  think they're a better person in life as a result of that - I would never recommend these students to my friends who are in the industry. \n\nFor those who don't have CS backgrounds, most of them turn out just fine. The ones who don't are the ones who go to the bootcamp strictly because they see the outcomes numbers, and want a piece of that pie. If you're thinking of going into a bootcamp with no background in programming, ask yourself honestly: Do you look at tech and programming related content during your down time? Have you tried building out small projects on your own? Do you look at tutorials on your own? If the answer is no, save yourself the time and money, and don't go to a bootcamp. There is a large misconception that if a student \"graduates\" (even if they cheated through the program), they will fall into the outcomes statistic and get a super high paying job. As a result, these people will game the interview system, they will try to fly under the radar throughout the whole program, and then struggle when it comes to finding a job. Why don't we kick these people out? As an instructor, I try to not kick anyone out unless I'm 150% convinced that you will not be successful here. My general approach is \"Okay, you're behind right now, I've still got X weeks with you. Let's put together this plan for you to get you back on track.\" For those people who cheat and float under the radar, I can see and sense it from a mile away. When you consistently write terrible code, and then one day write perfect code, it's very obvious to me that you got outside help. However, it's nearly impossible to prove unless it was a direct copy/paste, and it's not worth my time to scour the internet to see which site you plagiarized off of. Removing someone from the program is very sensitive, because people give up a lot to be here. \n\nThe non CS background students do well when they're genuinely interested in programming. Instead of going home to Netflix, they're looking up a topic that someone else in class mentioned. It's very common to see students with impressive backgrounds (doctors, lawyers, phds, masters, etc), and the reason they succeed at bootcamps is because they applied the same dedicated learning approach that made them successful in their previous profession to programming. If a bootcamp ends at 6pm, these people are the ones who stay until 7 or 8pm consistently. When they do go home, they're not jumping on Xbox, and instead they're checking out a tutorial or reviewing that days material. \n\n&amp;nbsp;\n\n**Outcomes**\n\nHave I taught students who have landed jobs at Google, Apple, Uber, etc? Yes. Does that mean I'll get a job there if I go through your bootcamp? No. Does that mean that our program is a hoax? No. Do only the best of our students get jobs there? Debatable. Interviewing ability, technical ability, and salary are all seen as things which go hand in hand, but reality is that this is true only sometimes, and therefore not hand in hand. It's impossible to quantify, but lets say student A overall is clearly technically stronger than student B. If student A can't articulate themselves well in the interview, they'll fail. Or, student A, despite being stronger overall, may get a question that they're not too familiar with, that person B just happens to know. Your salary is dependent on way too many factors, and has zero correlation with your technical strength. People who are stronger technically may take a smaller salary because the job is closer to home, because they desperately need a job now and can't afford to interview anymore, because it's in an industry/startup that they're passionate about, because the culture/benefits outweigh the salary difference, or maybe because they didn't negotiate well. Make no mistake, people who are technically stronger (assuming communication ability is the same) will very likely get more offers, but that doesn't mean they'll get better offers than those who are technically weaker. \n\n&amp;nbsp;\n\n**The Curriculum**\n\nEverything every bootcamp teaches content wise could be learned on YouTube/the rest of the internet. We just happen to bundle it in a way that helps you learn it a bit faster. What you're paying for is the structure of the program. If you are relatively new to programming, and you see a job posting which requires A B C D E F and G, you won't know which order to study them in, nor will you know at what point you know enough and can move on to the next topic. What you are also paying for is the community - not only will you likely become lifelong friends with (some of) your classmates, but also you're part of an environment where everyone is just as hungry as you to succeed. That kind of environment is really intoxicating, and will get the best out of you to push yourself during times you normally wouldn't. \n\n&amp;nbsp;\n\n**Advice to future/current bootcamp students** \n\nMake the most out of your time and ask questions whenever anything is unclear. The classic example is when I ask a student \"How are you doing on ____ topic?\" where they'll respond \"I'm good\". I'll say \"Great can you explain how ____ works?\" and they won't be able to. A lot of people have a fear to show weakness, and instead I ask that you embrace it, and strive to work on it. \n\nDO NOT BURN BRIDGES. This happens all of the time when students think they're so much smarter than their partner/group and think that they're slowing them down. Rather than the mindset of 'let me work without you', you should use that as an opportunity to teach that to them. Not only will the recipient be eternally grateful for that, but it will come full circle when you need help one day. There's a very good chance that your classmates will end up at a job that you're interested in, and your relationship with that person better be good if you want any hopes of getting hooked up. Something to keep in mind, the staff notice your attitude from day one, and we get recommendation calls all the time about you. \n\nSpeak up. I can't read your mind if you don't voice your thoughts on your lack of clarity on ____ or your unhappiness about ____. A lot of people will complain about something, and when I ask them \"Is this something you brought up?\" they'll say no. We can't do everything for you, but if it's reasonable, we'll accommodate it to make you happy. \n\nGet outside of your comfort zone. It's natural for people to stick to their comfort zone, but on the other hand, you're here to learn. If you're introverted, make an effort to reach out to people. If you're bad at explaining things, take the opportunity to try by helping your classmates when they need it. This is a completely safe environment to 'fail' and fall flat on your face with anything you try, so you should absolutely try it. \n\n\n&amp;nbsp;\n\nI'll be happy to answer any questions you might have on this, hopefully this helps some people out\n\n",
      "subreddit": "cscareerquestions",
      "score": 176,
      "url": "https://reddit.com/r/cscareerquestions/comments/506myw/the_complete_guide_to_bootcamps/",
      "comments": [
        {
          "body": "&gt;It's very common to see students with impressive backgrounds (doctors, lawyers, phds, masters, etc)\n\nDoctors?",
          "score": 8
        },
        {
          "body": "I've never looked into bootcamps before, but I am graduating in December and applying for jobs now. I am not qualified for the positions I'm applying for (Flatiron District in NYC) because the school I am graduating from has a very low budget CS program with dated material and professors (even though I love the guy, our program head teaches lessons he created in the 80s... and horribly at that).\n\nI assumed the nature of the bootcamp was as you described and never considered needing to join one until now. I have applied to only a handful of jobs, all entry level positions, and haven't had so much as a conversation with someone from the company.\n\nNeedless to say I'm nervous about landing a job on time for graduation, and money is very crucial right now.\n\nI -love- programming, but I do not spend the time I need to on personal endeavors. I love many a hobby. In order to focus on building a resume I'll need to put blinders on and get rid of the distractions in order to qualify for a company I care about.\n\nI think participating in a bootcamp after I graduate could help with building a resume and preparing me for interviews. If I could learn the methodology of something that interests me, like full stack development (just as one example) I can take on a personal project with confidence and produce it in a timely matter. At my school, learning these things conventionally is impossible.\n\nA bootcamp might be the best way for me to learn this stuff. I love learning with others and participating in a classroom setting. I don't enjoy learning alone in my room and often choose to socialize with friends that want to do things outside.\n\nShould I join a bootcamp?",
          "score": 10
        },
        {
          "body": "If you could answer one of my questions with your insight as a teacher. If I am a coding bootcamp graduate that didn't finish college, will I be have more difficulty getting a job interview as opposed to a grad who does have a B.A./B.S?\n\nThis is to get the job interview (i.e. when they look at my resume) not the job itself.",
          "score": 4
        },
        {
          "body": "This might not be answerable by you, but how are boot campers paying the 10k-20k for the bootcamp? \n\nAre they taking out personal loans?",
          "score": 3
        },
        {
          "body": "This is like the holy grail of boot camps. Well done, SIR!",
          "score": 8
        }
      ]
    },
    {
      "title": "Netflix ML EM Interview Presentation Round",
      "body": "I was asked to create a 10 min presentation on a technical complex topic which will be followed by a panel discussion with 4 interviewers comprising of 2 EMs, a TPM and a senior or staff or principal IC. It's pretty open ended, so trying to get any pointers. I am especially worried about the topic selection, how broad or deep of a topic should I choose? What if someone in the loop doesn't have prior knowledge of what I am presenting? I can keep it very generic but that might not be what they are looking for as well. Has anyone gone through such a round in their Netflix interviews? Any others tips, ideas, recommendations? TIA!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1q352su/netflix_ml_em_interview_presentation_round/",
      "comments": []
    },
    {
      "title": "Has anyone ever interviewed with Netflix?",
      "body": "Got an initial phone interview with Netflix next week for a job that I really want. Can anyone tell me what to expect? What is the hiring process like with Netflix? \n\nAlso, how open is Netflix to doing a Skype type of interview in lieu of, or before a final in-person interview? I'm an out-of-state candidate, which they can see from my resume, but my experience aligns perfectly with the job. I just worry they want me to book a last minute flight cross-country during the holidays, which is CRAZY expensive and something I can't afford at the moment. ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/7ihmyd/has_anyone_ever_interviewed_with_netflix/",
      "comments": [
        {
          "body": "Check out what people have said on [Glassdoor](https://www.glassdoor.com/Interview/Netflix-Interview-Questions-E11891.htm).",
          "score": 3
        },
        {
          "body": "If memory serves Netflix actually posts their interview online somewhere. Like they have a book or a video or something outlining the process and also their culture and a bunch of standard questions. If I wasn't at work I'd go find the video for you, but I do remember watching a biography about the company and them mentioning that because they didn't want potential hires to be surprised. ",
          "score": 3
        },
        {
          "body": "They would pay for your travel expenses so I wouldn't worry about the price of the flight. A lot of their questions will be about the culture deck and how you fit into their culture. Be prepared to have examples of previous experiences that align with the deck.",
          "score": 1
        }
      ]
    },
    {
      "title": "Big N Discussion - December 18, 2019",
      "body": "Please use this thread to have discussions about the Big N and questions related to the Big N, such as which one offers the best doggy benefits, or how many companies are in the Big N *really*? Posts focusing solely on Big N created outside of this thread will probably be removed.\n\nThere is a top-level comment for each generally recognized Big N company; please post under the appropriate one. There's also an \"Other\" option for flexibility's sake, if you want to discuss a company here that you feel is sufficiently Big N-like (e.g. Uber, Airbnb, Dropbox, etc.).\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Sunday and Wednesday at midnight PST**. Previous Big N Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Big+4+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/ec9877/big_n_discussion_december_18_2019/",
      "comments": [
        {
          "body": "Company - **Google**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 3
        },
        {
          "body": "Company - **Facebook**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 3
        },
        {
          "body": "Which company has the best food?",
          "score": 5
        }
      ]
    },
    {
      "title": "Big N Discussion - May 11, 2025",
      "body": "Please use this thread to have discussions about the Big N and questions related to the Big N, such as which one offers the best doggy benefits, or how many companies are in the Big N *really*? Posts focusing solely on Big N created outside of this thread will probably be removed.\n\nThere is a top-level comment for each generally recognized Big N company; please post under the appropriate one. There's also an \"Other\" option for flexibility's sake, if you want to discuss a company here that you feel is sufficiently Big N-like (e.g. Uber, Airbnb, Dropbox, etc.).\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Sunday and Wednesday at midnight PST**. Previous Big N Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Big+N+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1kjuyey/big_n_discussion_may_11_2025/",
      "comments": [
        {
          "body": "Hey All, \n\nI have 2 upcoming interviews for a Full Stack Developer Role at SoFi. The team decided to got with a real world simulation type of interview on hackerrank instead of the standard leetcode challenges. I am not sure what to expect, and what to prepare. I am reviewing React basics, but if anyone has any insights, please share!",
          "score": 1
        },
        {
          "body": "Company - **Other**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Company - **Netflix**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Company - **Facebook**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Company - **Amazon**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Company - **Apple**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Company - **Google**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Company - **Microsoft**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Has Anyone Interviewed for Product Manager Roles at Netflix (Ads / Sales Products)?",
      "body": "I’m exploring Product Manager roles at Netflix, specifically on the ads / sales products side, and wanted to hear from anyone who has gone through their PM interview process or worked there.\n\nI’m mainly curious about:\n\n* How Netflix evaluates PM candidates\n* What they emphasize most (strategy, execution, data, stakeholder management, etc.)\n* How ads-focused PM roles differ from core consumer PM roles\n\nFor context, this is the role I was looking at:  \n[https://explore.jobs.netflix.net/careers/job/790312512674](https://explore.jobs.netflix.net/careers/job/790312512674)\n\nWhile researching, I also put together a **short explainer video** for myself to better understand the role and responsibilities. I used an open-source video generator to do that, and in case it’s useful to others preparing for interviews, I’ll drop the repo here as an optional resource:  \n👉 *GitHub link:* [*https://github.com/outscal/video-generator*](https://github.com/outscal/video-generator)\n\nThis post isn’t a job listing or promotion — just looking for insights and sharing resources that helped me while preparing.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1q7bk79/has_anyone_interviewed_for_product_manager_roles/",
      "comments": []
    },
    {
      "title": "Does anyone else feel they don't deserve to enjoy things because they are unemployed?",
      "body": "I have been looking pretty diligently for a job since I became unemployed in January. I am up to getting several interviews a week, but nothing has been nailed down yet. \n\nToday, I was going to take a few hours and watch the \"Fear Street\" movie trilogy on Netflix since I was such a huge fan of the books growing up. But I didn't feel that I deserved it. I told myself \"You can watch it when you find a job.\" I'm doing the best I can, and as I said, interviews have picked up considerably in the last 2-3 weeks. I know its a mental thing, and it's not really helpful, but I can't help myself.\n\nAnyone else feel that way?",
      "subreddit": "jobs",
      "score": 892,
      "url": "https://reddit.com/r/jobs/comments/olx5m2/does_anyone_else_feel_they_dont_deserve_to_enjoy/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "For sure! I felt that way a lot. Idk about your upbringing but for me, I was working at a young age and honestly I put too much self worth in my career (without getting into the details). \n\nThe thing is, I've been working for decades now and being unemployed for a fraction of that.. well that's okay. And what the fuck is the point of life if you can't enjoy yourself from time to time. \n\nThe one thing I regret about my unemployment time is not growing other aspects of my life and figuring out what makes me happy. I don't think I did enough exploration because I was too hung up on trying to get a job and trying to relax from the stress of getting a job.  Don't feel guilty if you can help it. Sounds like you know what you gotta do to find something that makes you money and you're actively working towards it. Enjoy the other part of your life!",
          "score": 149
        },
        {
          "body": "The more you treat your free time as a reward for your work, the more unhappy you will be when you get a job. \n\nSo long as you applied for X amount of jobs you find feasible for a time equalling close to a full-time job then do whatever you want. You still need fun and happiness in your life or else you will just slip into depression. \n\nYou're not spending lots of money seeing three movies in the cinema or going on holiday, you are just watching something you like in your own home, so don't feel guilty!",
          "score": 67
        },
        {
          "body": "Also the propaganda out there with all the people punching down on the unemployed for not working. I know for a fact people I know say it behind my back about it. I try not to let it get to me but I feel it sometimes about all the attitudes I hear. No one wants to work and your a bum too shit. Oh, I'm sorry, do you go to work every day dancing with joy singing out loud I love to work? C'mon.",
          "score": 95
        },
        {
          "body": "Same boat as you, OP. I feel undeserving and worthless right now. \n\nLike you, I'm also waiting for the results of my job application. This is my \"dream job\" and if I don't get in, I seriously don't know what I'll do. I hope I get good results so I will feel relieved. \n\nI hope we get good results on our job applications. 🙏",
          "score": 86
        },
        {
          "body": "My parents are supporting me because they see me trying. \n\nThey've driven me all over the United States for interviews. I've gotten second and third interviews but never selected for a full time job so they know it's bad. \n\nThey told me that so long as I have a part time job, they'll pay for any essential bills such as student loans and insurance. \n\nBecause of this support, I'm able to enjoy a relatively fun gaming life style. But as a middle age man living in their parent's basement, with zero monetary accomplishments, I can't enjoy a long game without the thought that I'm a waste of life creeping in. Any game longer than 20 hours, the thoughts get really bad.",
          "score": 25
        }
      ]
    },
    {
      "title": "Incredibly lonely without a job",
      "body": "Edit 2: I just got called in for a job interview next week. Wish me luck!\n\nEdit: Thank you to everyone for your kind words of advice. I really appreciate you all taking the time to help me.  I'm going to look into some volunteer work and keep trying to get a PT job while I look for the right career opportunity.  Thanks again. \n\nNot sure if this is the best place to post this so I'm sorry in advance if it's not.\n\nI've been unemployed (and actively looking/interviewing) for about seven months now.  Over the last month or two the rejections and the massive amounts of time I've been spending alone have really started getting to me.  Does anyone have any ideas of things I can do to beat the loneliness of not having a job?\n\nBefore unemployment I was a full time student, held 3 part-time jobs at my university, and was really involved in different university organizations. I enjoyed the first few months after graduation a lot, but I'm really starting to miss being around people and having things to do.  All my friends have jobs and my boyfriend lives about 3 hours away so I'm basically home alone all day, watching Netflix, writing, and applying to jobs (and getting dozens of rejections emails, of course).  I just don't know what to do anymore.",
      "subreddit": "jobs",
      "score": 172,
      "url": "https://reddit.com/r/jobs/comments/b2n6yi/incredibly_lonely_without_a_job/",
      "comments": [
        {
          "body": "Have you looked into volunteering anywhere that interests you? \nI have had job interviews where the employer was really interested in some volunteer work I had mentoring young girls interested in the STEM field and even stated that was a reason I received an interview.  Lots of companies are really devoted to volunteering in the community.  You can have a lot of fun meeting new people, doing something good for your community and could also potentially enhance your resume.\n\nI hope everything gets better for you!",
          "score": 48
        },
        {
          "body": "[removed]",
          "score": 59
        },
        {
          "body": "I'm also in the same situation. Being already in a bad place mental health wise I can fully agree that this is a horrible thing to be dealing with. I myself am trying to get out of the house for a job every now and again and that helps.\nI'm going to keep trying hard and I hope you do too. This is only temporary.",
          "score": 12
        },
        {
          "body": "its a very common situation for recent graduates, you go through up to 9 months of job hunting until you get something. its temporary and will pass eventually, treat this time as a holiday until you get ur job. im working on weight loss and reading books, i take a random bus once a week from my main city and spend time with family",
          "score": 9
        },
        {
          "body": "Job search sucks!  It is easy to get down, and people who have not been in search mode just don't understand.  You need a support system.  Look for a career transition group (aka networking groups or accountability groups).  I belong to one run out of my church (not really a religious group, but sort of a community outreach of the church...all are welcome) , and it has been incredibly helpful.  Look to see if you can find something similar in your area.  It is great to find a community of people in the same situation.  The group I belong to offers help with resume writing/reviewing, interview prep, using online tools (linkedin, indeed, etc).  They bring in guest speakers on a variety of job search topics as well.   \n Having a meeting to look forward to every week and a community of people you can call/text or meet up with for coffee is a HUGE help!\n\nAlternatively, look for meetup events in your area for opportunities to meet people in your field, people from your school, etc.  Go ready to network (meet people, find out about companies, potential jobs, etc.",
          "score": 8
        }
      ]
    },
    {
      "title": "My job search in Abu Dhabi so far",
      "body": "Hi,\n\nAbout me : \n\n* I'm 25 years old.  \n* 3+ years experience working as an Audio QC Engineer in an MNC called Deluxe Media Entertainment which has around 4K+ employees around the world. I worked in Bangalore, India. I've worked for major clients like Amazon Prime, Netflix, HBO Max, WB, Disney etc.\n* Current Location : Abu Dhabi, I'm on a Visit Visa and I'm staying with my parents.\n* Qualification : High School Diploma + Diploma in Audio Engineering\n* Current Goal : Find a Job in Abu Dhabi so I can stay with my parents and save up money and also get a degree through distant education. If I'm with my parents, I'll have support to study. I won't have to completely look after myself.\n* Roles I'm targeting : Data Entry, Office Admin, Sales, Document Control, Operations Assistant, Cashier, Audio Engineer.\n* Additional Certifications : I've done a Data Analytics Bootcamp from Coding Ninjas so I have knowledge in Excel, Google Sheets, Power BI, Python, SQL, Basic HTML, CSS etc.\n* Additional Interests : \n   * I also play piano, guitar and bass and I can produce music in DAW's. \n   * I'm proficient in many DAW's like Pro Tools, Ableton, Cubase, Studio One, FL Studio, Reaper etc. \n   * I also know how to edit videos using Premiere Pro. \n   * I'm also into AI. I've been trying out different AI tools like Ollama, Stable diffusion, Custom LoRa Training, Flux Models, Different prompting techniques with different LLM's etc.\n* Languages I'm good at : English, Malayalam, Hindi, Tamil.\n* I also wanted to go meet my gf in Thailand ( Before you ask : Yes she's actually a girl ). It's been 5 years. We met online and we've never met each other in person and I was never able to save money to go meet her which is also affecting me mentally.  \n\nChallenges I'm facing &amp; what I've done so far:\n\n* Referrals play a major role in Abu Dhabi and unfortunately there is no one to refer me. Parents have been trying from their side but it's not working out. \n* I've tried applying mostly though Linkedin, Indeed and Career Websites. \n   * My findings : \n      * Most of them are ghost postings.\n      * I've been tailoring my resume for each job description using different AI tools like Google AI Studio, Gemini, Chat GPT, Job Owl Extension.\n      * I've tried using resume templates but they don't parse very well with ATS so I've been manually creating separate doc files for my resumes and I've been saving them to respective folders in my drive.\n      * I'm confident I have transferrable skills from my previous role which also included data entry, document control, skills to adapt to new software's and workflows very fast, good email etiquettes etc. in addition to the technical audio role.\n      * I've tried to be honest with my resume, I've also tried to fake it to bypass ATS when I started realizing how difficult it is to bypass ATS. \n      * I've tried tailored approaches and I've also tried mass applying approaches.\n      * I gave my resume to Lulu Hypermarket regional office (No Call back yet), I've also approached a few offices nearby my place and gave them my resume. (No Call backs).\n      * I've created an Upwork account for freelancing and bought some connects for bidding for work, but slowly realized that Upwork was almost like tinder. I never got a match for both and both apps kept asking me to boost my profile by paying them money. I've had better chances with tinder though.\n      * I've tried looking for VA jobs as well through reddit. Most of them were shady. \n      * I've also tried looking for other remote jobs but I think you all know how that might have went especially with my educational qualifications.\n      * I've also tried contacting some electronic retailer showroom like Sharaf DG but they ask if we have our own visa. My dad won't be able to sponsor a visa for me because I'm 25 which means I've crossed the age limit restriction in the UAE. \n      * I've also attended an interview at a music school but I didn't get the job because I was out of touch with my sight reading skills. \n   * Things I haven't done:\n      * I haven't gone out to the main city yet. It's just because most of the offices operate during the daytime from 9:00 AM to 5:30 PM and the heat during that time is too bad. I feel dizzy just going out to get some tea. I think My parents are disappointed in me because of this.\n      * There's also a lot of schools in the area we stay. My mom has been suggesting me to approach these schools for any office related work. I'm not sure if this will work out because I don't have a degree.\n* Other Challenges:\n   * Dad's debt :\n      * Dad is in huge debt, however he's confident he can finish it in a few years but I'm not sure about that.\n   * Constant fight between parents :\n      * Mom and Dad are fighting all the time for even the smallest of things. I've been seeing them fight for a long time and from what I realize, they both require different people foundationally. They're expecting each other to be different people but I can guarantee it's not possible. \n      * I've been asking them to attend some therapy but they're not because of the expense. \n      * Basically both of them never understands each others strengths and weaknesses. She keeps on judging him for everything he does and he hurts her back by judging her back. Their problems are so deep that it's very difficult to achieve happy resolutions. \n      * They're 50 now and they need each other. These fights happen most of the time and then they get back together and the cycle just keeps on going. \n   * Baldness :\n      * The water in Abu Dhabi makes you go bald very fast and my dandruff and hairfall has increased a lot. \n* Alternate options :\n   * I can go back to India, Maybe Chennai. \n   * I have friends there and I can find a small job there but then I'll have to start from Zero again. I'm bad at taking care of myself. I also won't be able to save anything if I'm staying by myself especially with the salary I'll earn in India so I guess I'm stuck in Abu Dhabi for now.\n\n  \nWhat do you guys think I should do ?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1lhus0h/my_job_search_in_abu_dhabi_so_far/",
      "comments": [
        {
          "body": "Man what does your baldness have to do with anything",
          "score": 2
        }
      ]
    },
    {
      "title": "Good and bad hobbies when asked about during interview",
      "body": "This may seem like an open ended question and you may just want to say the first hobbies that come to mind. However, there are still better answers.\n\nHobbies to never mention\n\nPorn/sex/smoking weed\n\n\nHobbies that you shouldn't mention because they might be misunderstood\n\nCars (they might think you're a street racer). Now, if you say restoring classic cars, that may be viewed possibly\n\nGoing to church (this is highly context dependent, but if you are hiring into a very progressive environment, this may leave a negative impression on the interviewer)\n\nPartying/clubbing (a lot of negative stereotypes even though most people do it)\n\nHobbies that are too weird/esoteric\n\nMime\nClown\nGhosthunting\n\nHobbies that are OK, but are \"low effort\" and too common\n\nNetflix/Chill/reality tv\nVideo Games\nWatching movies\nPlaying with your pets\n\nHobbies that are great but may be seen as potentially too time intensive or it may give an impression you will take too much PTO and interfere with work (also depends on the role/company)\n\nMusic Festivals\nTravelling\nLong distance camping/rving. \nEntrapraneurship/side business (depends on the context, but I wouldn't bring it up unless it's relevant to the role).\n\nGood hobbies to mention\n\nReading\nCooking\nA specific exercise or sport like Jiu Jitsu, pickleball, yoga, swimming, golf. Rock climbing, cycling\nAnything artistic like painting, photography, sculpting.\nBeekeeping\nWoodworking\nLanguage Learning",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1lwzked/good_and_bad_hobbies_when_asked_about_during/",
      "comments": []
    },
    {
      "title": "Do company names even matter in the job hunt? ",
      "body": "For context, I currently work for a pro sports team and have been in the industry for 10+ years.  Prior to that and with a little transparency, I was employed by Netflix, in it's infancy (streaming just launched). \n\nI've been applying to senior-level positions where I would match the qualifications and yet, I have been getting my application rejected. Not even get an interview.\n\nWith some recognizable employers in my resume, I feel that recruiters overlook my background/experience. It's very frustrating.\n\nAnyone else feel this way, or is this just an old-school mentality? ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1htktow/do_company_names_even_matter_in_the_job_hunt/",
      "comments": [
        {
          "body": "Depends how your resume is formatted. Recruiter only spend a couple seconds on looking through resumes, so if you emphasize your company instead of your title, you might be getting overlooked because the recruiter doesn't notice your title and/or experience/accomplishments because they're making broad assumptions about your experience based on the company's reputation.",
          "score": 2
        },
        {
          "body": "I wish I could help. I think most big companies now days use AI to sort through applications, and it there’s one flaw, it’ll immediately reject, which is why contacting the employer upon application is important. \n\nHow does one get a job with a pro sports team?",
          "score": 2
        },
        {
          "body": "I have two well known national brands on my resume. In my latest search, I also struggled.\n\nThen one interviewer clued me in — they thought I’d be bored working for their shop and would jump ship for something more exciting.\n\nTruthfully, boring was my goal. I want a slow 9-5 where nothing is urgent. No after hours calls, less pressure, and schedule flexibility to make work happen around my family and life.\n\nSo I added a personal statement to my resume. I got more calls.",
          "score": 2
        },
        {
          "body": "Usually having a recognisable or prestigious employer on your resume would be a good thing, I don't think I've ever come across something thinking it was negatively affecting them. Why do you think recruiters are holding it against you?",
          "score": 1
        },
        {
          "body": "It definitely can. If you have worked for some big and notable companies, it can help you get in the door to other companies. I know that some companies want to hire someone who's worked for said company.\n\nAt the end of the day, it really depends on what you did and the tools you used. If you never worked in sap but used a different system, it's not going to help you out in the long run.",
          "score": 1
        },
        {
          "body": "They don't matter as much as a lot of people seem to think they do, no, and it would be very rare for a person to think that they somehow hurt them (unless eg you were looking for work in early 2002, and your last job had been ten years at Enron). I suppose the modern equivalent of that would be in 2 years time people whose sole experience is Twitter, which might make people look askance and wonder what attracts/motivates them.",
          "score": 1
        }
      ]
    },
    {
      "title": "Any Netflix recruiters lurking in this sub?",
      "body": "My dream job is working at Netflix. In all the jobs I've held I have been a standout performer but the companies I have worked for have not liked my blunt honesty. The Netflix culture memo speaks to my soul and describes me to a T, however despite applying for all the roles that fit my skillset I have never been selected for an interview.\n\nThere was one time I did get to a phone screening but I never heard anything after that. I tried following up but they did the same thing as soo many others and ghosted me. That sucks and is bad form but it hasn't deterred me yet. My personal network isn't very vast and I don't know anyone that works there. I have seen multiple LinkedIn profiles of employees that asked to not be messaged about job opportunities so that doesn't seem to be the path.\n\nWhat do I have to do to just get an interview? If you're out there lurking in this sub let me know. I am just so tired of being told that the work I do is excellent but I'm just too direct, or to not mention anything negative because it might upset someone. While I am happy to be employed while many others are struggling (I've been there, it sucks) I know I can do better.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1hdyakw/any_netflix_recruiters_lurking_in_this_sub/",
      "comments": [
        {
          "body": "You’ll have better luck posting this on LinkedIn in appropriate networking groups than hoping that someone working at Netflix HR both sees this and decides to actually respond",
          "score": 1
        },
        {
          "body": "I have friends that work at Netflix as EAs and their in-office requirement is at least 4 days a week (plus their office is basically in East Hollywood, so depending on where you are, the commute might be rough).\n\nAll of the EAs I know that work there have experience at this top consulting firm as EA’s (where I also came from 🙃) — It’s like they directly recruit from this consulting firm, or something lol.",
          "score": 1
        },
        {
          "body": "Sny luck in finding a recruiter? I’m on the hunt for one too haha",
          "score": 1
        }
      ]
    },
    {
      "title": "Seeking advice for applying relevant positions in the media industry. (OTT)",
      "body": "Hi. Getting straight to the point, I have a total of 5 years experience working at Amazon. 2 years at Alexa Data Services and 3 years at Prime Video. Up until I resigned, I was the owner for all the Amazon Originals that released worldwide. By that, I mean I was the only one watching all the Amazon original shows and movies for compliance in IN, AE, TR ,SA ID, EG &amp; JP territories along with the Global market. I was the only POC for the Post production, localisation, delivery, assets, technical, policy, legal, program, operations, etc teams. Which led to me burning out completely and wasn't compensated enough for the efforts I was putting in running the entire show. I'm not exaggerating but if you've worked at Amazon you know how much of this is true and then some.\n\nDue to the poor management and some personal commitments I had to move to my hometown and quit my job. Since then, I've been applying for similar compliance and policy roles at Netflix, YouTube, Disney, JioCinemas, Sony, Zee, WB, HBO, etc. but didn't even get noticed by any recruiter. I've made connections on LinkedIn with people working in the competitive market but 80% of the people just ignored my messages and those who replied also ghosted me after few messages. I've only had 2 interviews at vubiquity (amdocs) and bytedance (tiktok) in the past 5 months but couldn't get through despite my experience and expertise in the field. \n\nThis is not a rant about anything but rather I'd be grateful for any guidance anybody can give me regarding my situation. I want to know if they is anything I can do to improve my profile/resume or do something differently to be able to represent my skills appropriately. I knew the job hunt was going to be a task but not being recognised after gaining expertise in the field is not what I expected. \n\nAny advice or direction will mean a lot to me right now. Thank you.\n\nSharing my [LinkedIn profile](https://www.linkedin.com/in/jasper-prashant-bansod-a27b2b165) for reference.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1fntpy3/seeking_advice_for_applying_relevant_positions_in/",
      "comments": [
        {
          "body": "Anybody? Anything please? 😅 I'm just looking for some advice.",
          "score": 1
        },
        {
          "body": "Guys? I'm sure somebody should have read this! Is there nothing anybody can help me with?",
          "score": 1
        },
        {
          "body": "Nothing?",
          "score": 1
        }
      ]
    },
    {
      "title": "Although it's underreported, efforts to diversify companies leave college-educated white men struggling to recover their pre-pandemic careers",
      "body": "I've noticed a few articles crop up [like this one](https://www.newsweek.com/company-ordered-pay-10-million-firing-white-man-wont-change-diversity-drive-1643697), in which a fired individual (white male) successfully sued for $10 million when he was replaced by two women -- one black and one white -- as a result of a company's \"diversity\" drive. Furthermore, it's been reported that tech giants like [Google and Apple](https://9to5mac.com/2021/10/28/workplace-diversity-catalyze-tech/) (and entertainment companies like Netflix) have started or joined initiatives that \"aim to hold \\[their\\] members accountable for improving the representation and experience of women, people of color, first-generation college graduates and the LGBTQ community in the tech industry.\"\n\nPersonally, I can tell you that in the half dozen final round interviews I've had since the pandemic started, I've lost out on the position -- and later discovered the person hired was (four out of six times) a woman, (five out of six times) a minority, or (at least one out of six times) had stronger internal connections to those in charge of hiring/the team. I have eight years of experience in my field and a degree with a 3.5 GPA from a \"new Ivy,\" plus an Emmy under my belt.\n\nWas thinking of writing an editorial because this is definitely an issue, but of course, it can be -- and is often -- easily misinterpreted as \"privileged white man against diversity.\" That's simply not the case; I think we need more diversity in the workplace. I just want my credentials, which are substantial, to get me back to the position I was in my career before this pandemic madness started.\n\nAnd yes, this is a nuanced conversation about how to implement progressive ideals in the workplace, but choosing minorities just to \"diversify\" your organization is racism in itself. It's just that whites, particularly white men, are not a protected class in the United States.\n\nEDIT: I also want to speak about the (ongoing) effect of the pandemic. There is a strong possibility jobs will return once this is over, which by all measures, it basically is. The overwhelming majority of those getting sick or dying are unvaccinated. Those people have held us back for about six months now, and frankly, their health is their own fault. ",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/qieqou/although_its_underreported_efforts_to_diversify/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I have what is probably an unpopular opinion for this subreddit. \n\nThe problem with saying your “credentials” should get you a position is that there are often systemic inequities in getting to these credentials to begin with. A good example is college education: most Americans do not have a college degree, and degree holders are not a representative sample of the country. \n\nHere’s a situation I was recently in: we were looking for a finance leader for a business unit. We had two final candidates, a white man and a non-white woman. The man had what is more traditionally looked at as the standard qualifications for the role: he’d been with our company longer, and he’d had senior finance roles on the commercial side. The woman was newer to the company and had lots of finance experience but not in the commercial space. They both had great leadership skills and fit the company culture well. We realized that the man had the exact same experience as every other finance leader in our company and therefore wouldn’t bring new expertise to the table. We went with the woman.\n\nShe’s been in role for a few months now and is crushing it. She’s propelling the business forward and her experience with other non-commercial functions is leading to increased collaboration.",
          "score": 19
        },
        {
          "body": "Why are you assuming the people they hired are less qualified than you? Do you have access to their resumes?",
          "score": 13
        },
        {
          "body": "&gt; I just want my credentials, which are substantial, to get me back to the position I was in my career before this pandemic madness started.\n\nI like how you’re just assuming the women getting hired aren’t as qualified as you. You’re not saying it, but it’s implicit in your complaint. You also feel entitled to your previous position when, if we’re being honest, rampant sexism probably helped get you there originally. Sure, you worked hard, but the door was open to you and closed to a lot of other people. Now that the doors are wide open you’re experiencing a loss of privilege and interpreting it as discrimination. \n\nThere’s no need to write an editorial.",
          "score": 13
        },
        {
          "body": "Diversifying teams isn’t a social good that balanced out historical inequities, it’s a good business move. Stacking teams with people who all have the same background and experience leads to echo chambers. Hiring people from outside that mold leads to new ideas and perspectives and innovation. Also if you’re working for a company that creates any kind of consumer product that’s used by demographics other than just white men there’s a very clear benefit to having people from those demographics in your company. \n\nYou may have lost the job to someone who had less traditional credentials than you do on paper but they may have life experience and perspectives that benefit the business more than yours do. \n\nAlso, I regularly monitor labor market statistics for a living. Almost all the long term job loss caused by the pandemic has fallen on women, with Latina women being the most affected.",
          "score": 10
        },
        {
          "body": "As someone who has been a part of the interview process, I always hear people talk about credentials, but there is so much more that goes into a hire. \n\nThe resume is often the credentials gate. Do you have them or not? If you get the interview, it's often not the leading factor anymore. \n\nWe had a tech role and interviewed three people. Two were white men and one was an Indian woman. \n\nThey all had credentials, and the men seemingly had a little more. But they werent personable. One acted and sounded a little green, while one had the skills but was really hard to talk to. \n\nThe woman had less credentials, but she connected well and her overall demeanor told us she could learn fast. \n\nIt would've been very easy for those two men to think they didn't get the job because of a minority issue, but in reality they didn't get it because their personalities didn't fit with the team. \n\nI can't comment on every other job, but be careful when taking this too far and convincing yourself that the fault lies with the company. Make sure you're taking time to analyze yourself, too.",
          "score": 9
        }
      ]
    },
    {
      "title": "How do corporate recruiters keep their jobs when they don't even respond to emails?",
      "body": "These guys get paid good money to literally do nothing it seems. I applied for a job and the recruiter asks me what time I'm available to speak with the hiring manager whos interested with speaking with me. I give him a more than generous time range and then get ghosted. \n\nHow is this possible lol? Recruiters have one job and they're probably too busy watching netflix at work to make a couple of phone calls a day. The whole company only has 12 open positions, its not like they have a million jobs to fill.",
      "subreddit": "jobs",
      "score": 18,
      "url": "https://reddit.com/r/jobs/comments/q659s2/how_do_corporate_recruiters_keep_their_jobs_when/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "The recruiter's job isn't to respond to your email, it's to fill the position. If they are no longer responding to you, they found better candidates, the position was filled, or they decided not to hire for it. \n\nIt sucks, but it's the truth.",
          "score": 47
        },
        {
          "body": "Recruiters have several jobs and their job isn’t to reply to you, it’s to find qualified applicants that the hiring manager will be happy with and fill the position.  In this case, I’m guessing the hiring manager was no longer interested in speaking with you.  For 12 open positions I’m guessing that’s at least 1200-2400 applications to vet.  Recruiters are sales people, their success is based on filling roles with people who do well in those roles.  They found someone better.  It happens.  You move on and keep applying.",
          "score": 14
        },
        {
          "body": "Corporate recruiters are paid WAY WAY less than a recruiter at a staffing company.\n\nLots of corporate recruiters moved to corporate because it's way less stressful, they can work 40 hours and go home",
          "score": 7
        },
        {
          "body": "Dear applicant with the attitude of self entitlement:\n\n\n1. You aren't the ONLY applicant\n\n\n2. YOU aren't special...or rare...\n\n\n3. Responding to YOU is not a recruiters only job\n\n\n4. Emailing a recruiter repeatedly to get a status makes you come across as impatient and annoying. \n\n\n5. If the recruiter doesn't respond to you 1-3 or 4 days after your email to them, assume they were busy, or on vacation, or sick, or an emergency came up. Ya know...LIFE tends to happen. That should be understood.  And please don't be \"that type\" that feels if you don't respond to them in 24 hrs - they cry \"ghosted\". If they stop responding - they aren't interested.\n\n\n6. And just to knock the point home - YOU aren't the only applicant. \n\n\nSincerely - a hiring manager 😁",
          "score": -9
        }
      ]
    },
    {
      "title": "The job market is giving me so much anxiety ",
      "body": "I’m 25 years old and I just graduated with my degree in Communications, it took me awhile because academics weren’t my strong suit, and I went after a beauty certificate out of high school. I obtained my final piece of the puzzle at TESU online and also quit this part time waitressing job thinking this would not last me more than 2 weeks jobless… \nmy dream is to work in the the Production industry but the marketing department (ex: marketing for universal studios or Netflix) I had been applying as a production assistant and I’ve been applying to be a marketing coordinator as a starter job left and right, and since February been ZipRecruiter, indeed, and LinkedIn, I’ve accumulated about 500 jobs I’ve applied for and I heard nothing from a lot of them or got denied on most of them, my guess is the lack of experience but how else do I get experience then?? My resume looks empty and unrelated to what I want which is causing me more stress and no chances. \nHowever, I finally got a hit at a marketing agency, for a Key Account Specialist, but I think now I’m realizing it’s the customer sales division in a marketing agency.. is that correct? I do not want to work in Sales or customer service like at all. \nI have an interview with this company Thursday, because I keep thinking maybe it’s not what I think and it is a marketing job??\n\n I worry as I need a job to pay the bills and move out but I do not want work with a title that’s not going to boost my leg into the marketing/production world. Thoughts?? I’m new so I don’t know what to expect at a marketing job or what the duties will look like. What are your thoughts??\n\n**this is the job description \n\nLiaise between clients and internal staff to coordinate and manage all logistics involved in preparing programs for launch, including offline and online materials\nAdminister project timelines for assigned programs\nTrack project tasks to ensure all milestones are met in a timely fashion\nBecome main point of contact to keep client informed\nWork cross-functionally with internal groups to collaboratively develop projects\nConsult daily with Sales team to ensure client's needs are met\nDevelop and maintain positive and energetic relationships with clients (both internally and externally)",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1cwmcom/the_job_market_is_giving_me_so_much_anxiety/",
      "comments": []
    },
    {
      "title": "Live Talk AMA w/ Emily Mucken, Reddit Senior Technical Recruiter [Wednesday 8/31 @ 11:30AM PST]",
      "body": "&amp;#x200B;\n\nhttps://preview.redd.it/61gnm0sxf3k91.png?width=809&amp;format=png&amp;auto=webp&amp;s=abd0afc3e6e947a98d98e0db927184fd1846acca\n\nHello r/jobs!\n\nWe are excited to announce an upcoming AMA with Emily Mucken. Current Senior Technical Recruiter at Reddit, formerly at Netflix and Amazon.\n\nEmily is a 15-year veteran of hiring people from many backgrounds for many different types of industries. She was laid off from her role at Netflix in May of this year, but put her insider knowledge of the recruiting/hiring industry to quickly land an awesome opportunity… hiring senior tech talent for Reddit!\n\nEmily will use this Talk to share her best timely and practical tips for how to navigate a job search during the market we are currently in. She will bust some myths, share some relevant stories, and maybe even make you laugh through your jobseeker tears.\n\nFeel free to connect with Emily on LinkedIn: [https://www.linkedin.com/in/emucken/](https://www.linkedin.com/in/emucken/)\n\n**Please click \"Follow\" on this event to be reminded.**\n\n**Comment any questions below that you'd like us to ask Emily during the talk\\*\\*. We will do our best to incorporate appropriate questions.**\n\nSee you there!\n\n\\-GamingInterviewer",
      "subreddit": "jobs",
      "score": 21,
      "url": "https://reddit.com/r/jobs/comments/wxk584/live_talk_ama_w_emily_mucken_reddit_senior/",
      "comments": [
        {
          "body": "If you're on [Discord](https://discord.gg/f83HdDqH?event=1012280565292081172) we have an event set up in which you can also be reminded and join the live chat during the event.",
          "score": 1
        },
        {
          "body": "I’m currently applying every day and getting rejection letters that say my resume is impressive, but they decided to not move forward. I have 8 years professional experience including my own video business, and a masters degree—what can I do to support my chances of getting an interview?",
          "score": 3
        },
        {
          "body": "I look forward to this talk. I have a phone interview at the same time this starts so I’ll unfortunately be late.",
          "score": 2
        },
        {
          "body": "Thank you for taking the time to do this. I have had over 40 interviews since spring and am always told I am great and almost got it. Even at my own company. They all say I have solid credentials and good things about my personality. The criticism I had at my company was nobody knows me. I’ve been there 7 years and I talk to everyone and introduce myself so I don’t know why they don’t know me. Is there a way to become more memorable? Any tips on how to get recruiters to reply to me on LinkedIn? Any tips on networking, such as what to say to people you want to connect with? \nAny ideas on how to go from runner-up to top choice? I work very hard and have a good attitude. I’m just not sure what else to do. Thank you again!",
          "score": 1
        }
      ]
    },
    {
      "title": "I think I messed up my interview",
      "body": "I interviewed with two interviewers for an internal position. It was going really well with me asking all the right questions and using the right technical jargon. Got a few laughs out of both of them. Name dropped some of the softwares they use on a daily basis and connected it to my experience using similar softwares at a previous position. It felt more conversational than anything.\n\nThen I asked about the salary. I knew as soon as the question was leaving my voicebox that I should've just left well enough alone. Just thanked them for their time and wished them a happy weekend. That I should've just waited for the recruiter to offer me the job officially so that I could negotiate it.\n\nIt wasn't anything they did or said in response but I felt the tone change a little. I'd like to say I recovered by asking them what they were watching on Netflix but I think I actually fumbled it by making it look like all I think about is money and assuming that I already have the job because of how well it was going.\n\nAm I overthinking it?",
      "subreddit": "interviews",
      "score": 8,
      "url": "https://reddit.com/r/interviews/comments/1oh63hl/i_think_i_messed_up_my_interview/",
      "comments": [
        {
          "body": "Danggg yea I wouldn’t have asked. Get the job first then discuss pay 🫣",
          "score": 3
        },
        {
          "body": "ahhh i think that most of time the company would ask you about the salary first, but dont worrry that, it isnt a big deal . they probaly consider your exp, ability, attitude and if they see you are exactly the person who they are looking for, they gonna discuss with you about the salary futher.",
          "score": 3
        },
        {
          "body": "You’ll lose it because someone was more qualified, seemed a better fit, or due to nepotism before that one faux pas comes into play.",
          "score": 1
        }
      ]
    },
    {
      "title": "[0 YoE, Software Engineer Intern, Software Engineer, India]",
      "body": "Hi everyone,\n\nI’m looking for feedback on my resume. I currently have **1 year of experience** as a **Software Engineer Intern** at **Dell**, working on **Spring Boot, Java, GraphQL, and Angular**. I’m targeting **full-time Software Engineer roles** in **India**.\n\n# Current Issues with My Resume:\n\n* **ATS Score:** My resume currently has an ATS score of **56**, and I want to increase it.\n* **Length:** It’s **3 pages long**, and I’m not sure if I should cut it down to **1 page** or if keeping it at 3 pages is fine.\n* **Formatting &amp; Content:** Looking for suggestions on improving both **ATS optimization** and **readability** to get more interview calls.\n\n# Areas I’d Like Feedback On:\n\n1. **How to improve my ATS score?**\n2. **Should I trim my resume to 1 page? If yes, how can I effectively condense the content while keeping key details?**\n\nhttps://preview.redd.it/dfrp8b5f5uoe1.jpg?width=1275&amp;format=pjpg&amp;auto=webp&amp;s=67fd0c3cb9a7f1cc4df09b3d652d2ca68125e7c0\n\nhttps://preview.redd.it/gleg1c5f5uoe1.jpg?width=1275&amp;format=pjpg&amp;auto=webp&amp;s=a6b958f86e7ad839164b4565f101ac88434ac9e0\n\nhttps://preview.redd.it/5z3skb5f5uoe1.jpg?width=1275&amp;format=pjpg&amp;auto=webp&amp;s=7d3b8898abc973c891ec7d7c55ceed79846a7817\n\n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1jbspxc/0_yoe_software_engineer_intern_software_engineer/",
      "comments": [
        {
          "body": "You've got a solid experience for entry level tech work. But you can cut down the length a lot. \n\n\nYour technical skills section takes up far too much space. You don't need a heading to tell me Git is VCS. I'd split it into languages and tools. This section is mostly for keyword tracking, the words need to be on the page, but not prominent.\n\n\nPut your professional experience before your education.\n\n\nYour quantifications feel suspect. I don't want to accuse you of making them up, but all but one of them is in an increment of 5%. Moreover, the metrics you're reporting call the authenticity into question. \"Optimize hardware recommendations by 20%\", \"increase efficiency by 45%\", \"enhancing patient management efficiency by 20%\", etc. Quantifying your work is great, but if you get asked about this in an interview, will you be able to convince someone who knows their stuff that you did exactly what you said? Stick to well-defined metrics, your 92% accurate is a good example \n\n\nAside from metrics, your experience bullets are hit or miss. Space is valuable on your resume. \"Overcame technical challenges to optimize query performance and reduce development time\" tells me very little about what you can do, but it's taking a full line. Your first bullet at Dell is much stronger. You want to highlight responsibilities and projects that demonstrate relevant skills and technologies. Stay focused on your contributions specifically. Your iOS intern experience reads like you were in charge of the project and team. Great experience to highlight if that's the case, but I personally haven't seen an intern act as PM for more than a day as a learning experience. Basically, really drill down on what YOU did, not what your team dead. If that includes leading a team, make that clear.\n\n\nAcademic Projects and Awards and Recognitions sections should be put together simply as \"Projects\" and cut down significantly. Like one line per project, what's it do, what tech stack? If they want to know more, they can look at your GitHub or ask in an interview.\n\n\nPublication is good to keep, link to it, but the bullets aren't worth the space they'll take. \n\n\nPositions of responsibility should be cut. With a year of internship experience, and significant project experience, extracurriculars don't matter to decision makers unless it creates a personal connection.\n\n\nOverall, you've got the experience you need to make a strong resume. Your goal is to provide a quick, authentic fact sheet that clearly shows how you can do the job they're hiring for. Don't make them hunt for it, fill 1-page with the most compelling reasons you're the right person, and leave it at that.",
          "score": 2
        }
      ]
    },
    {
      "title": "The importance of a thank you email.",
      "body": "TLDR: Today, I received a job offer because of a thank you email sent after a rejection **8 months ago**. \n\n\nStory: I wrote (under a different account) about 8 months ago that I interviewed for 2 different positions in the same company. Both times, I was rejected after I was in the final three candidates. Both jobs were my ideal dream jobs. I'm a graphic designer and it was with my dream company with the perfect position. \n\nAfter the second rejection, I was devastated. I was so angry and saddened after months (11 months) of failed job searching. I'm sure a lot of us know the pain and depression from it. \n\nIn fact, after the second rejection, I decided to quit my job search and attempt to freelance. I couldn't take another rejection. I have been doing freelancing work for 8 months and have been struggling to make ends meet. \n\nAfter the second rejection, I took a 2 - 3 days of just sadness and binge eating/Netflix. It was a long interview process and the rejections took me off my feet, both times. \n\nAfter my 2-3 days of recovery time, I decided to write a thank you email to the man who interviewed me.  It took **A Lot** to write that email. I was so mad/sad/disheartened; I simply didn't want to even think of that company. \n\nI mustered up the courage and broke down and wrote an email something along the lines of \n\n\"Thank you for the opportunity to interview for X position.  It's a shame I didn't get the position, but hopefully we'll be able to work together in the future\"\n\nSomething along those lines. Extremely short, but I had some personal touch to it. \n\nI wrote that email and didn't hear back. \n\n.\n\nAfter 8+ months of free lancing and REALLY struggling to make ends meet, I received a call from the man who interviewed me. The call went something along the lines of \n\n\"hi, it's X; you interviewed with me for position X a long time ago. \nI had to dig up your last email to get your contact information. We actually have a position open (the same one I had interviewed for) and we would like to offer you the job. We've interviewed you, several times *laughs nervously*, and we know you, your work and your abilities. We would like to offer you the job now. We figured we would see if you are available before we begin the interview process.\"\n\nI just went in and got my job offer and signed on. \n\n\n\nMy point is: send thank you emails. If not to get an opportunity like me, to be in good terms with people in the industry. It literally takes a few seconds and it can go a long way. ",
      "subreddit": "jobs",
      "score": 267,
      "url": "https://reddit.com/r/jobs/comments/4phs5a/the_importance_of_a_thank_you_email/",
      "comments": [
        {
          "body": "Agreed! I think this also applies to a thank you email after an interview, but before receiving any feedback.\nI was reading an article which basically said the following:\nIt doesn't hurt to send a thank you email (especially one that is personalized). It may not help if you weren't the ideal candidate after the interview, but it may just give you the edge you need if you're neck and neck with another candidate.\nPlus... in your case, it could be just what gets you hired down the line. Congrats, btw!",
          "score": 27
        },
        {
          "body": "I agree. I got a rejection email a few days ago with what I assumed was a courtesy mention that they might have more opportunities in the future. I'd gotten really far in the process so was a bit bummed out, and it's pretty common for rejections to say they'll keep you on file, but I sent a thank you email nonetheless. To my surprise, my contact replied with a specific opening  I'd be a good fit for -- at least I wouldn't be starting from scratch in the process.",
          "score": 9
        },
        {
          "body": "I saw a post very similar to this a while ago. I was interviewing with a really great company at the time. I had made it to the final round of interviews and knew that there were only a few other candidates. I didn't get the job but still sent an email in this same vein. While I didn't get a job with them, the interviewer did respond back. I'm hoping that it left the door open for me when I apply with this company again. ",
          "score": 9
        },
        {
          "body": "I've recently been a part of the interview process for a position where I work, and out of the 7 candidates we interviewed, only one sent a thank you email. They sent it to everyone they interviewed with (it was a day-long interview with multiple 'teams' of people-very intense), even little old me (I'm not one of the big wigs, not at all). They were already a really strong candidate, and it helped emphasize that they stand out among the rest in a lot of ways.\n\nWe're actually hiring more than one person that we interviewed, and I don't get the final call (like, at all haha), but I always think that it's a nice gesture. Especially if you had a strong interview, since it might give you a leg up when compared to other strong candidates who didn't think to do the same. ",
          "score": 7
        },
        {
          "body": "[deleted]",
          "score": 16
        },
        {
          "body": "Congratulations on your new job!  It always pays to be gracious.",
          "score": 4
        },
        {
          "body": "Should I send a thank you immediately after the interview?",
          "score": 3
        },
        {
          "body": "I'm a hiring manager and am currently looking to fill a position with heavy client contact. Thank you emails are absolutely appreciated and speak volumes for follow up. All things being equal, I'll hire the person who sends the emails very time. ",
          "score": 3
        }
      ]
    },
    {
      "title": "Job Interview Monday!",
      "body": "After years of working in what I thought was going to be a career job....it's time for a change.  I graduated in 2010 with a degree in graphic design, bounced around retail for nearly a decade in a \"semi-adjacent\" field, and for the last 4 nearly 5 years I've worked as a field support marketing rep for a franchise company.\n\nThe job I applied for is with an established liquor and spirits distributor, one of the largest in the country as an Inventory Sourcing Analyst.  Got my foot in the door with this interview as I have family that work for them.  In this job market.....I'm not above playing that nepotism card.  Hardly a \"romantic\" position, but after nearly 5 years of rather extensive travel, spending the last 2 years doing the job of multiple people for NO extra pay, and having my higher ups try and strong arm me into a new position I'm REALLY not comfortable with, it's time for a change.\n\nMy position involves copious amounts of really random travel, sometimes drivable, sometimes I'm on a plane a few times a month.  My higher ups want me to segway more into the \"sales\" side of things because well...it's the natural progression.  Field Support &gt; Area Manager &gt; Regional Vice President.  Each step up means a better salary obviously, but also A LOT more travel and A LOT more responsibility.\n\nI'm in my early 30's, married, house, no kids....because well honestly, I refuse to start a family with my wife with a job like this where I can literally get notice on a Thursday where the following week I'll be on the road 3-4 days.  As I type this from the bed of a hotel room 5 hours away from home....\n\nFingers crossed the interview goes well Monday.  At this point, I'm desperate for a boring ass, Monday-Friday, 9-5 kind of job.  Jobs that involve a lot of travel sound exciting...on the surface.  But before long it's just a lot of lonely nights in hotel rooms eating fast food and watching Netflix.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1fzfbyu/job_interview_monday/",
      "comments": []
    },
    {
      "title": "11 weeks since I was laid off, 114 job applications, and finally received a wonderful job offer!",
      "body": "I found this sub really helpful and wanted to share my story and provide tips that I found helpful through this (very long) ordeal just as a way to give back.\n\nContext:\n\nI was very shocked to have been laid off on January 31st of this year from my previous job with zero heads up. It had nothing to do with performance - it was a small startup company that pretty much didn't know what they were doing. Needless to say, I felt completely devastated, shocked, and left to sit in a pool of anxiety and fear about what's next. My depression flared up, and I was pretty much left to panic about how I'd find work again (thank GOD I had savings to keep me afloat in the meantime).\n\n&amp;#x200B;\n\nTips regarding the actual job search:\n\n1. I hate applying to jobs pretty much more than anything. I'd rather sit in a DMV for a week straight than job hunt. But, you have to do what you have to do. I built myself a spreadsheet so I could track all the jobs I applied for (date I applied, job title, company name, link to job posting, application status, interview date, and misc. comments). This helped me not only see the work I've been putting in, but also keep track of places that have denied me/moved me forward and what stage I was at during the interview process.\n\n2. I pretty much did the shotgun method for a while - firing my resume everywhere hoping for a bite. I found, that once I started letting go of that and took a more tailored approach that I was seeing better results. Really tailoring your application to fit one particular job description will get you a lot further (especially coming up against an ATS). This is what I did for the offer I received so I have to think this piece of advice is really worth taking into consideration.\n\n3. Additionally, I recommend getting a LinkedIn profile (if you haven't already) and polishing it up. I had some recruiters reach out to me that way, but none of those were related to the job offer I received.\n\n&amp;#x200B;\n\nIn the meantime:\n\n1. Taking care of your mental health is above and beyond important during this time - even more important than the actual applying to jobs. Aligned with my #2 tip above, I recommend only applying to 3-5 jobs per day and taking your time with each application. Shooting out dozens of applications for 5+ hours a day is going to drain you (trust me, I learned that the hard way). Try and keep your sleep routine as close to your original work/sleep schedule as you can.\n\n2. Practice your interviewing skills even if you don't have an interview setup yet. Luckily, all of the places I interviewed with were remote, so I was able to have notes handy without the interviewer noticing. Research common interview questions, and maybe have an example or two written down from your work experience that you can think of. Having those handy will really be beneficial when the dreaded \"Tell me about a time when....\" comes up. You'll avoid being a deer caught in the headlights. Try and be as relaxed as you can -- remember it's just a conversation and not an interrogation. Be sure to follow up with questions and a thank you e-mail!\n\n3. While you're in this shitty situation, try and make time to focus on other things than just applying to jobs and doing chores. If you need to, get a temp or part-time job to help with income. Or, like me, practice learning a new skill or getting involved with a hobby. I recently picked up on coding and photography and I'm glad I used those things to occupy my free time vs. video games and Netflix binging.\n\n&amp;#x200B;\n\nTo sum it up:\n\nThis process sucks, and if you're in this boat, you are not alone and I'm sorry. Having to look for work now is the equivalent to being asked to backflip through ten hula hoops that are all on fire. This is NOT forever - it is just temporary. I'm so glad that my next opportunity will provide me a lot of growth potential and job security - and I'm sending that good mojo your way. Hopefully this is helpful to someone out there.\n\nCheers.",
      "subreddit": "jobs",
      "score": 155,
      "url": "https://reddit.com/r/jobs/comments/ubx0hx/11_weeks_since_i_was_laid_off_114_job/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 11
        },
        {
          "body": "My deepest condolences on finding a job.",
          "score": 7
        },
        {
          "body": "Congrats on the new job!! All the best",
          "score": 3
        },
        {
          "body": "Congrats!",
          "score": 3
        },
        {
          "body": "Decent numbers tbh",
          "score": 2
        },
        {
          "body": "Congrats and thank you for the encouragement 🥲",
          "score": 2
        },
        {
          "body": "\nWonderful good luck",
          "score": 2
        },
        {
          "body": "Congratulations on landing a new job! Wishing you all of the best!",
          "score": 2
        }
      ]
    },
    {
      "title": "How to address I'm looking to stay at company, but change management to be successful in internal interview?",
      "body": "Hey folks,\n\nI'm trying to leave my current role and I have been trying to leave externally for months.\n\nI haven't had much traction as many of you may have. I do know my resume is good as I've heard from 5 companies including Netflix.\n\nI decided to look internally and found a dream role in HR at my current company that would be perfect to join. I like my current company, but I absolutely hate my team due to toxic management that drove off all my predecessors.\n\nI applied to the role after mentioning it to my manager, who then proceeds to give me the nastiest midyear review I've ever seen. I saw complaints about not supporting a shared mailbox when I had in writing, him mentioning to me that I was to not support this shared mailbox with my change in my new role. And other comments like that.\n\nThe HR interview went well, and I have an interview next week to speak to the hiring manager. I would prefer to give a interview response, but knowing my manager is going to try and sabotage me from leaving as our team is short staffed, and I'm the most senior person on the team despite being there less than a year, I don't know what to do.  I'm hurt, confused, and most of all upset. The treatment I've had just reinforces more and more why I need to get out.\n\nFor example I can't take my medication into work after I caught my manager going into my coworkers desk while she was gone 3 times. I don't feel safe bringing my things into work now. It's actually pretty serious and I did get a photo of it as well.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1dqs34a/how_to_address_im_looking_to_stay_at_company_but/",
      "comments": []
    },
    {
      "title": "My Interview / Application Rate for different companies",
      "body": "\n\n|Company|Rate|\n|:-|:-|\n|Meta|0%|\n|Google|0%|\n|Nvidia|10%|\n|Netflix|0%|\n|Atlassian|33%|\n|Others|1%|",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oqgoea/my_interview_application_rate_for_different/",
      "comments": []
    },
    {
      "title": "I got the job! HOLY COW! (x-post from r/getemployed)",
      "body": "Hey guys! I'm super excited to say that I landed an internship at a government agency! This is basically the entry level into working for the government. I've been applying to many different positions within the government and never once received a reply. So I started applying for the internships, since I'm currently attending uni full time anyway. This is a great opportunity for me to gain experience and the skills and move up with in the agency!\n\nI've been all over r/resumes, r/jobs, r/getemployed and other subreddits trying to prepare for an interview for a couple of months now. \n\nWhat really helped me was this [thread](http://www.reddit.com/r/AskReddit/comments/1vcpy7/employers_of_reddit_during_an_interview_when_you/) in r/AskReddit about what to ask during the interview. What also helped me was [this](http://www.reddit.com/r/jobs/comments/1ximgb/if_you_have_a_job_interview_coming_up_you_may/) r/jobs thread about the 50 hardest questions in an interview. The comment section was great too, with answers to the questions! What I think really hit it out of the ball park was the questions that I asked them. I relayed what I got about the position, asked them a question about the position. I asked why the position was open. Another one I asked them was if there was anything they wanted to address with me about my abilities to perform the job. They responded very well and even had me meet the facilities manager after the interview! All those questions I got from those threads.\n\nTed Talks about [body language](http://www.youtube.com/watch?v=RWZluriQUzE&amp;list=PLNoq47wYQZMAkB1H0bjhhUiXLgVRwg1__&amp;feature=share) and even this [game to maximize](http://www.youtube.com/watch?v=lfBpsV1Hwqs&amp;list=PLNoq47wYQZMAkB1H0bjhhUiXLgVRwg1__&amp;feature=share&amp;index=1) your life. These Ted Talks *are* on Netflix. However, I think these Ted Talks really helped me relax, feel confident and not nervous. I felt sharper mentally and came back with great responses quickly and with no hesitation.\nI was also reading in my sociology book about the [The Presentation of Self in Everyday Life](http://en.wikipedia.org/wiki/The_Presentation_of_Self_in_Everyday_Life). Here's the [PDF](http://clockwatching.net/~jimmy/eng101/articles/goffman_intro.pdf) of the entire article. I suggest giving it a read since it helped me change my perspective. \nLong story short, the interview went great and they called me yesterday with the offer. This is definitely the start of my career in the public sector, which I have been wanting for so long and I'm so excited to start!  \nI wanted to point out the simple things that helped me prepare for the interview process. I also want to say thanks to everyone! This is a great community and I couldn't have done it without you guys!",
      "subreddit": "jobs",
      "score": 101,
      "url": "https://reddit.com/r/jobs/comments/1xwrpd/i_got_the_job_holy_cow_xpost_from_rgetemployed/",
      "comments": [
        {
          "body": "internship=automatic permanent govt job? ",
          "score": 4
        },
        {
          "body": "Congratulations! You will be great!",
          "score": 3
        },
        {
          "body": "Congratulations! and good luck to you on your intern.",
          "score": 3
        },
        {
          "body": "Congrats. Transitioning to a full-time paid position is hard as fuck. Source: current intern trying for a full-time job. ",
          "score": 3
        },
        {
          "body": "Awesome! What sort of position did you get and what kind of education do you have?",
          "score": 3
        },
        {
          "body": "Best of luck!",
          "score": 2
        },
        {
          "body": "I too applied to a government agency and they are suppose to let me know today, hopefully we are not talking about the same thing.",
          "score": 2
        },
        {
          "body": "Congratulations! Hope this goes well with your Valentine's Day!",
          "score": 2
        },
        {
          "body": "Well done! Nice post too - consolidating the resources you used.",
          "score": 2
        },
        {
          "body": "Congratulations! And thank you for sharing those other threads too.",
          "score": 2
        }
      ]
    },
    {
      "title": "Don't trust your company's salary market research",
      "body": "Recently upper leadership at my company has read the book \"No Rules Rules\" that's written by Netflix people about their company culture. One proponent of the book is paying employees top of market and then you won't have a problem having your employees poached (something our company has been having a lot of problems with lately). Our CEO has been talking about this in company meetings and that that's an active effort they're making.\n\nThis has really rubbed me the wrong way since I've talked with recruiters and know that jobs with my same title + industry can come in for $30k+ more than I'm making now. I brought this up to my manager and we're going to have a discussion about pay next week. In the meantime, they've sent me a bunch of research they've done that all insist that I'm getting paid a fair market rate.\n\nI decided to change my LinkedIn status to show that I'm casually looking, and within a week of doing so, I've had 4 recruiters hit me up and 2 interviews with the jobs offering the much higher salary range. I'm not even hardcore searching.\n\nI'm not dumb enough to think I'm irreplaceable, but I know for a fact that it would hurt them to replace me if I left (I'm in leadership) and they wouldn't get someone as good as me with what they're paying.\n\nI really like my job and the people I work with, but I'm tired of being gaslit about my pay.",
      "subreddit": "jobs",
      "score": 8,
      "url": "https://reddit.com/r/jobs/comments/pzheq8/dont_trust_your_companys_salary_market_research/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Damn i wish i had recruiters hitting me up lol you go girl",
          "score": 7
        },
        {
          "body": "You should not be looking for a lateral role if you move. Move upward. Bigger pay bump and it seems like you’ve been in your role a while.",
          "score": 3
        }
      ]
    },
    {
      "title": "Need help with tech sales interview task please!!",
      "body": "Help!! I am running myself in circles to the point now where I’m questioning every word of this task. FYI- I am in the 3rd round of my first tech sales interview process for an SDR role. I have been in sales for 20 years but have NO experience in tech sales. Everything has been going really well up until this point and I am literally at a total loss as to find the right companies for this task. I am starting to question every word of the task and feel I’m in a rabbit wheel. It doesn’t help that I have completely confused myself on the difference between AWS and a cloud data warehouse like Redshift/Snowflake etc. I am at a loss and have been working on this for days. \nThis is the task I have been asked to complete. I have questions and am looking for any insight that any kind soul would be willing to impart! \n\n“ Based on what you have learned from our discussion, website, and your own research, I'd like you to spend some time identifying the most on-profile stakeholders within an organization to whom we should conduct an outreach.\nPlease use the following as your criteria.\n1/Use AWS as their cloud platform\n2/Has an existing cloud data warehouse (AWS Redshift, AWS Athena, Snowflake)\n3/Are a tech-forward organization\n4/Not a consultant/service provider\n5/Expect a project for a new cloud data warehouse within the next 6 months\n6/So please:\nCreate a list of 10 prospects that you recommend we add to our potential outreach list that works for mid-sized US tech companies and you expect to meet the qualification criteria  listed above.\nPlease include their:\nName\nTitle\nLinkedIn profile\nAs much information as you can to support why you chose them and their organization”\n\nHere are my questions- \n1-What is a mid size tech forward company. Is mid sized based on revenue, employee size, valuation?? Can you be a unicorn and still be mid-size? Can you be a public company and fit the requirement? My initial ideas we companies like Spotify, Airbnb, Netflix- but I think they are too big and are they tech forward mid size US companies. Netflix uses Google anyway and not AWS so that rules that out. \n2-What are some ideas of US tech forward mid size companies? \n3-What does a service provider or consultant company mean- aren’t all tech companies providing a service? I can’t work out the parameters \n4-I have been looking on Whois.com, Wappalyzer and also googling to see if they are using AWS BUT- how do I know if they are using an existing cloud data warehouse??? Is there a way to find out for each company? What kind of companies fit this target audience?? Are there certain types of companies that need a cloud data service (so they can gather big data quickly) but how do I find out what they use- every time I google a company it states they are Snowflake or Redshift compatible?? What does that mean? Don’t they have to just have one? Or am I looking at the wrong types of companies?? \n5/And, lastly, how am I expected to find out if these companies expect a project for a new cloud data warehouse within six months???",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/u9ypcq/need_help_with_tech_sales_interview_task_please/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Not the answer you were looking for but it sounds like they are using interviews to generate a sales pipeline for themselves",
          "score": 3
        },
        {
          "body": "I was in your position three years ago, been in sales most of my life and transitioned to tech sales— good on you for finding this. Agree that this company wants to pump any potential SDR for information.\n\nThe way i got past these hurdles is to google the hell out of everything i could. \n\nFor mid-size companies (generally revenue yeah, but also company size) check out Crunchbase. Everything involving AWS, google and YouTube for examples of what they are &amp; do. These are pretty technical questions to be asking somebody starting in tech sales, and the type of thing that can be taught / learned while sales teams need people like you that have skills harder to come by.\n\nAgreed that some of these phrases are confusing— you could ask what they mean by service provider but most likely they mean offering cloud hosting. I don’t know if that would include SaaS (Software as a Service) companies, as well.\n\nOverall yeah, i would be just as confused as you here. This is a huge ask for an entry-level role! \n\nShould you be looking to interview for other SDR roles, feel free to DM me and i can point you in some good directions. All best of luck.",
          "score": 3
        }
      ]
    },
    {
      "title": "How to get over my fear of finding a job and going to work?",
      "body": "Hi everyone,\n\nI started to look for a job after 1 year and half of returning to uni in order to avoid to get a job (i am French). \n\n2 years ago I worked at a firm and it didn't go well, I was depressed. I quit my job, before started one year at law school again for another speciality.\n\nNow I am looking for a job and I am so stressed out to fail my interview or even fail to work or just afraid to make mistake (since I really struggle to focus I make a lots of gross mistake). When I know that I will have an interview, I just can't focus or concentrate to prepare them. I ended up just binge watch Netflix or YouTube. \n\nI am lost, since I don't know if I want to work in law anymore, I don't know if it's really for me, that's why I still reply to interview for job related to law. But I am so afraid to fail I actually don't know how to change.",
      "subreddit": "jobs",
      "score": 13,
      "url": "https://reddit.com/r/jobs/comments/d3t6nv/how_to_get_over_my_fear_of_finding_a_job_and/",
      "comments": [
        {
          "body": "Fail a lot so you get used to it and learn to deal with it. Specifically go out and intend to fail and experience failure often. It won't feel so bad once you've done a lot of it like me. I fail often, we all do.\n\nHere is some inspiration:\nhttps://www.npr.org/sections/health-shots/2015/01/16/377239011/by-making-a-game-out-of-rejection-a-man-conquers-fear",
          "score": 7
        },
        {
          "body": "You know how they say you learn more from failure than success? It's very true in this case. I mean the worst thing that can happen when you fail is that you didn't get anything out of the failure, not even a chance to learn something. \n\nYou don't lose anything when you fail. So you fail your interview? Fail at work? You still have to move forward. You'll most likely learn what to change and how to do better for the future. \n\nAnother thing is that you're playing psychic too much. You can't just assume that you'll fail at your job and the world is going to end. What if your failures end up not being so significant? What if you don't even fail at all? You could only fail for a month and then become somewhat of an expert at your job all of the sudden (happened to me before). Don't put yourself at such a low level. Confidence in yourself plays a huge role in your success.",
          "score": 3
        },
        {
          "body": "Look at it like this: If you fail, o well you're in the same place as you are now. However, if it goes well you get a job. In other words, you have no where to go but up. \n\nAlso, you're playing with house money right now. You can bomb every interview and it won't affect you. Try approaching the first few interviews as a learning experience. Eventually, you'll gain experience and the fear of a job interview will go away.",
          "score": 2
        },
        {
          "body": "I do this: \n\nForce myself to apply to more than I'd like to. Asked my neighbour if he could help - now as he said it's all coming together I feel I can't disappoint someone who dealt with so much disappointment in his life so far. So whenever I feel negative thoughts emerging, I just shout a loud NO in my mind and immediately start doing something that draws my attention - at the moment, Reddit. So I don't overthink and get to the point of not caring enough. It's hard. Especially now, just before trying to get some sleep. But I have to go on...I don't have a future otherwise and I do want to have one.",
          "score": 1
        },
        {
          "body": "Try to be passionate or pseudo-passionate about something. I'm saying try because not all of us can find our \"fire\" yeah, life is not a music video. But , you can TRY and be passionate and pretend to love a job that you wanna pursue so when you land it, it will be an achievement in itself. You have to work anyway, why not be enthusiastic about it. It's all Psychology. Or if you want to be an ordinary worker then just work. Everything in the world is a job. You have an internet connection because it's somebody's JOB to make sure you have a working one, for the money you pay. Remember you can save your money or spend them to get the benefit of other people's \"jobs\" . School/college is the blue pill of life and work is the red pill. Basically, everything is work, so try if a changed mindset has any effect on your attitude/anxieties etc.\n\n&amp;#x200B;\n\nEdit 1 : I am a very unconventional person who tries unconventional things, so if the above isn't really making sense to you, feel free to ignore it.\n\nEdit 2: I think I may have accidentally used some  [r/PsychologicalTricks](https://www.reddit.com/r/PsychologicalTricks/)",
          "score": 1
        },
        {
          "body": "I wonder if it would help if you did interview practice with friends or with organizations that help folks find jobs. Do you think you would want to do a community college vocational program to get new skills? You could also interview for jobs that would be easy interviews, and then gain confidence when it goes well, and work your way up to jobs that are harder interviews.",
          "score": 1
        },
        {
          "body": "I've been experiencing the same thing recently...\n\nBasically, you just need to force yourself to. It's the only way. That, and knowing your money is slowly but surely fading into oblivion.....yeah, it's a good time to stat job hunting. That's what happened to me and I finally had to start looking.",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone interviewed for Netflix L4?",
      "body": "Anyone interviewed for Netflix L4 role? I have their cultural fit coming up for Android Engineer L4.\nJust curious to what their interview is like. Some say its a 6-7 step interview. Some say its not DSA ish like google or amazon.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p5it42/anyone_interviewed_for_netflix_l4/",
      "comments": [
        {
          "body": "Had a buddy go through their process last year for a similar level. The culture fit part is pretty chill compared to their technical rounds but they really dig into the \"keeper vs non-keeper\" mentality stuff. Way less leetcode grinding than FAANG but they'll still test your system design knowledge hard\n\n  \nGood luck with it, Netflix pays well if you make it through",
          "score": 2
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Netflix job posting disappeared after my interview — what does it usually mean?",
      "body": "I recently interviewed for a marketing-related role at Netflix.\n\nIt’s been about a month since my final round interview with HM, and I’m still waiting for a final update. Last week I noticed that the job posting disappeared from the official careers page.\n\nDoes this usually mean the role has been filled, canceled, or could it still be open internally? I’m feeling pretty anxious about what this might imply.\n\nHas anyone experienced something similar with Netflix?",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1npwask/netflix_job_posting_disappeared_after_my/",
      "comments": [
        {
          "body": "It means yes-  they decided not to fill it, it expired, they have enough candidates, they hired someone, they are done interviewing, probably something else I’m not thinking of right now.   It’s a choose your own adventure!",
          "score": 13
        },
        {
          "body": "They will have a lot of ghost jobs up (the marketing jobs that lay like 150-300k) on their site in the event that the need someone at some point but they aren’t priority roles or roles they’ll even hire for",
          "score": 2
        },
        {
          "body": "It means absolutely nothing",
          "score": 1
        },
        {
          "body": "What did it end up meaning for you",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "I have a job interview at Netflix and I’ve wanted to work with them for the longest time. Would appreciate any suggestions!",
      "body": "Ps - I have gone over the culture memo and other pre interview material. Was hoping to get tips from previous applicants and current+ex employees",
      "subreddit": "interviews",
      "score": 11,
      "url": "https://reddit.com/r/interviews/comments/sflp6d/i_have_a_job_interview_at_netflix_and_ive_wanted/",
      "comments": [
        {
          "body": "Hi! Di’s you get in?",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "The ATS doesn't really work that way",
      "body": " ATS: applicant tracking system\n\nA lot of people have a lot of opinions on how these things work and they throw all kinds of advice out there, some of which can be quite misleading. I have worked with many different ATS and I want to shed some light for those of you who think you’re fighting against the “system”.\n\n***Disclaimer:*** I have not worked at ALL the companies there are out there and I have not used all ATS that exist, so it is quite likely that there are some systems that are customized in a way that I have never seen before. The advice below is based on how I have seen them generally set up to be the most efficient and yield the most useful information. I have primarily used Workday and iCIMS as a recruiter, but I also have experience with other systems. A lot of top companies like Netflix, Abobe, Activision, Target, Hulu etc. use workday recruiting.   \n\n\nATS can be set up however the company wants to use it, but it is not a robot picking keywords and tossing out your applications because you didn’t have the right combos. An ATS is set up not only to track applicants but to also coordinate the full cycle recruiting process and on-boarding after the person is hired. So it is a very man-powered system, for lack of a better word. Someone is looking at, sharing, moving, and closing out your applications.\n\nSome system are set up to show you everything, such as:  \n1) whether the application is incomplete or fully submitted  \n2) how many times you’ve applied to the company and how many different roles you’ve applied for  \n3) how many profiles match the same name as yours (duplicates)  \n4) what your applicant status is for each of the roles you applied for  \n5) whether you are a self nominated applicant, referral, internal employee, previous applicant etc.  \n6) what you have uploaded into the system\n\nWhen you submit an application to the system, it shows up in a recruiter’s queue. Think of it as an excel table that lists the most important details about the applicants:\n\n1) name  \n2) stage the candidate is at (typically new or review, depending on what the initial stage is set up as)  \n3) location  \n4) contact information  \n5) resume or file attachments (or work history depending on what the dashboard looks like\n\nAs a recruiter, when you go to a dashboard for a particular role, you’re looking at a list that, in some views, looks just like an excel table with many filter options. It could also be a funnel with just numbers next to it that represents how many people are in a particular stage. Ex: new (or review) 534. Some ATS have filters that show you how a percentage for how qualified a person seems for the role based. Let’s say it’s a green bar that says 95 %. A recruiter has the option to look at every single candidate to find what they’re looking for, which is super time consuming depending on how many candidates applied for a role, or they can filter that list down by whatever criteria they want. Here is an Example of a complex filter:\n\n1. Location: Boston, MA (or a particular radius, or state, or zip code etc)  \n2. Education: BA (can also narrow it down further by major)  \n3. Years of experience: 3-5 (or any specific number or range that you want)  \n4. Skills: Java, Hadoop, Ruby, Rails (whatever skills they want for that role)  \n5. Previous company (if they want to be that picky)  \n6. Previous job title  \n7. (Any other criteria they are interested in)\n\nLet’s say 5,000 applied, they performed that search with all of the keywords (skills) above and only 35 people come up: they might just look at those 35 or fewer, choose who they want to move forward with from that filtered pile, and they could literally automatically close out all 4965 applicants left with one click of a button. In some cases they already have a canned response saved in the ATS that notifies all rejected candidates that they  are not moving forward. So while some advice out there tell you to litter your resume with keywords, the machines are intelligent enough that if you put a specific keyword just once, it will still pick out your resume when the recruiter filters it. In the example provided above, if the recruiter wanted every single skill listed rather than any combination of them, having each one of them just once will have your resume be selected. Not having one will leave your resume out if ALL are wanted. Either way, it is a person filtering and initiating the closing of your application: not a machine doing it automatically, unless there are some very specific reasons why they would want an application automatically rejected, which I will touch on later. It is quite possible that you have all the experience needed, you have a lot of very important keywords listed, but because the recruiter used a different set of skills/keywords, your resume went unnoticed. \n\nI have heard and read that whole \"the machine will automatically reject you\" thing so many times and I have never once heard a recruiter mention a machine automatically doing the job for them. **There is no such thing as the ATS missing your resume or you not making the cut: the ATS's job is literally to track applicants**, **meaning it catches every single application sent in and puts them in the appropriate piles. There is no such thing as the ATS not picking up your resume/application because it didn't have the right keyword or whatever.** There isn't a mysterious place in an ATS where the subpar resumes go to die. Believe me, the recruiters know where your applications are, even if they wish they never laid eyes on some of them. Even if a machine did close out your application automatically, it doesn't just disappear: there is a place where all the closed out applications live in the system. In workday, it's inactive candidates for each specific job. A recruiter can very easily go in there to look: they can reactivate applications if they want to, or if they closed them by accident. They can also perform a company wide search if they are really struggling to find qualified candidates and the ATS will pull up people who applied to a company several years ago who never even applied to the specific job the recruiter is looking at. \n\n**Some other important things to keep in mind:**\n\n1. in a lot of workplaces, referrals take precedence. Using that same example above, if there were 10 referrals in that 5000 bucket, the recruiter may choose to just look at the referrals. Let's say they are all very good or the recruiters have it on good knowledge that these candidates won't back out of an offer, they may not even bother with filtering through the 5000 applicants. They could proceed with the entire recruiting process never having looked at a single candidate, and once they make their hire, close out the role and everyone else who had applied gets automatically closed out. \n2. it is also quite possible that the job is posted online externally but they already have their own candidate for it that was identified in house, via an executive search firm, or is an internal candidate. They legally have to post the job, they don't legally have to review any candidates for the role. automatically close out again. \n3. you might have submitted your application towards the tail in of the process when a candidate was already identified and at the offer stage. Generally a handful of candidates are selected to move to a phone interview stage. depending on the role, By the time they move to an on-site interview, if the recruiters do their jobs right they typically don't have to constantly be setting up other interviews. whoever made it to the onsite interview stage continues to move forward: other applicants are not being looked at. automatically reject all applicants once an offer as been accepted (the recruiter does not need to initiate that, the system can be set up that way to begin with)\n4. some job postings are just pipelines: a place to collect candidates for roles that have a high turnover or are always on demand. You could be a great fit, but if no jobs are available, your application isn't going anywhere.  \n\n\nNow, regarding automatically closing out candidates, I have been automatically rejected (meaning within minutes or barely a day after I applied) from some roles before, but it is not something that happens *that* often (if it happens all the time to you, i am sorry). You can set up an ATS to automatically reject some candidates or put them in a different, less visible pile based on various criteria:\n\n* incomplete application\n* not eligible for rehire\n* previously closed out for a bad reason (background hits, drug testing, failed some kind of test, egregious behavior at interview etc. The system keeps records)\n* missing qualifications\n* not authorized to work in the country\n* location (i have never seen it done but I am sure if can be done)\n* any other criteria that doesn't affect the system (those systems are essentially template based, meaning that was it possible in one job should be possible in all jobs since they are all using the same job template)\n\nTo that last point, I don't think most recruiters or companies would waste their time setting up rejection criteria in the system ahead of posting a job, and it is even less likely that each job would have its own category of rejection criteria. It would be time consuming to do that. But is is very likely that I am wrong: the max applicants I have personally worked with in any one role is about 500 applicants in only 3 days. (by day 2 we had identified 5 candidates we wanted to move forward with and they were interviewing and moving forward while hundreds of other applications kept pouring in.) All of that is to say that you are not in some kind of fight against the ATS: it is not a robot destroying your applications. Most of the time it is *not* a machine automatically rejecting you for some arbitrary reason: it might be the recruiter simply not reading your application for one or many reasons, or you didn't make the cut in the filter, or your application came when other candidates were already identified. \n\nTL;DR: Applicant tracking systems don't work like many people will have you believe they do. There is no such thing as an ATS not picking up your resume (not in the literal sense).",
      "subreddit": "jobs",
      "score": 19,
      "url": "https://reddit.com/r/jobs/comments/hxfydj/the_ats_doesnt_really_work_that_way/",
      "comments": [
        {
          "body": "This is some great information. Thanks for sharing",
          "score": 4
        },
        {
          "body": "So Word, pdf, or no difference?",
          "score": 1
        },
        {
          "body": "&gt;2. how many times you’ve applied to the company and how many different roles you’ve applied for  \n&gt;  \n&gt;3. how many profiles match the same name as yours (duplicates)\n\nAre these seen as negatives/eliminating factors? I'm worried I have older accounts that I've forgotten because I used them to apply to HS/freshman internships.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Why to even care about ATS when referrals/ internal candidates take precedence?",
          "score": 1
        },
        {
          "body": "The ATS really doesn’t work.\n\nNo more words needed.",
          "score": 1
        }
      ]
    },
    {
      "title": "How do you stay motivated to job hunt",
      "body": "Hi everyone. \n\nI graduated in May and have been applying nonchalantly (if that makes sense) while in school throughout my last semester. I have had five interviews in May and three so far in June. I just lose all motivation for...weeks? At a time? It's really bad. I have so much going for me, I'm so lucky to be educated and my dad immigrated here to give me that opportunity. I have a lot on my shoulders. I worry I'm putting too much pressure on myself, but then I waste my days being avoidant of job-hunting by watching Netflix because I'm overwhelmed and not motivated enough? \n\nOnce I start applying to jobs I settle into a routine, it's hard for me to start. It's like I'm afraid of failing so much I won't even try - basically guaranteeing I'm going to fail. \n\nI have two part-time jobs to make rent in Chicago right now, so I have things to do during the day and then when I get home I'm...\"too tired\" to apply for jobs. Does anyone have any advice for staying the course and just...**doing** the job hunt? \n\nThank you. I really hope I didn't sound super...immature. Making this post is immature right? I should be writing a cover letter not writing this post.",
      "subreddit": "jobs",
      "score": 14,
      "url": "https://reddit.com/r/jobs/comments/8stjqd/how_do_you_stay_motivated_to_job_hunt/",
      "comments": [
        {
          "body": "Be like Nike and \"just do it.\" \n\nYou aren't doing yourself any favors by avoiding it. You want a job yet you aren't willing to put in the work to get one. \n\nI know it sucks and it's demoralizing at times. But talk to someone (me) who has been job hunting for almost a year. It's hard but you have to keep at it. I actually got two job offers but had to turn them down for various reasons. You may get job offers but they may not be right or they may seem/feel sketchy. \n\nIf you see a job posting, like a new one, you need to apply **right away.** If an employer gets too many applications they may close the listing. Some jobs, are open until filled, so if there is no deadline listed, you really need to apply right away and the way that you apply right away is you keep looking. You don't have to apply to everything or things you don't want. Pull up a job search site when you're waiting around, in between commercials or just once every hour and see if something sparks your interest. If you see something, apply. ",
          "score": 7
        },
        {
          "body": "If you find a better job, you won't have to work two part-time jobs. You can work one full time job, with better pay and benefits.",
          "score": 6
        },
        {
          "body": "I've discovered that setting a schedule really helps. Book a couple hours a day to dedicate to the job search, and write down what you're going to do each day. Planning out the week ahead may help you stick to it. For example: Monday, 8-11 am, research available openings and prioritize interests; Tuesday, 4-6 pm, apply to top-ranked position from Monday; Wednesday, 12 - 2 pm, visit local career assistance location for resume review; Thursday, 4-6 pm, apply to second-ranked position from Monday...\n\nSomething else you could try is to make a list of why you're seeking a new role, and the improvements to your day-to-day life if you secure a position. e.g. Stability, 2 jobs to 1, no more stress of applying, no more unknowns, ability to learn new skills, ability to engage new people, etc. Acknowledging why you're applying and the outstanding benefits of finding a new job may help keep you motivated. Post these somewhere that you'll see them each day, like the fridge or a bathroom mirror.",
          "score": 4
        },
        {
          "body": "It's a numbers and luck (timing) game. As long as you apply and be persistent, you are bound to be hired.",
          "score": 6
        },
        {
          "body": "Give yourself a goal to apply to X number of jobs a day. This is what I’m doing currently and I find it’s helping. There are new jobs posted every day. Having that daily goal will make you feel more motivated and at least give you something to accomplish every day. Hope that makes sense and helps at all. ",
          "score": 3
        },
        {
          "body": "I've been job hunting since my own gradation in December and I've only had 3 interviews. I wake up every morning, make breakfast, and try to apply to AT LEAST one job per day. The market kinda sucks right now for us new grads, but I've been told things are going to start picking up in July (new fiscal year). So just keep it up! If I haven't lost motivation yet, you shouldn't either :)",
          "score": 2
        }
      ]
    },
    {
      "title": "Frustrated at the Netflix Interview Process",
      "body": "I am a very anxious interviewer. I will have a full on panic attack before the interview starts therefore I struggle with it. I just finished the Netflix interview process, I did 9 rounds of interviews 30min each over the course of a month. This means 9 rounds of panic/anxiety attacks. I did not receive a job offer at the end but does anyone else think 9 rounds is ridiculous? I thought about removing myself from the interview process earlier on but kept thinking \"I made it this far, keep going\". I feel like I put myself through the ringer for nothing and im feeling very defeated and depressed.",
      "subreddit": "interviews",
      "score": 74,
      "url": "https://reddit.com/r/interviews/comments/1ktu7wg/frustrated_at_the_netflix_interview_process/",
      "comments": [
        {
          "body": "9 rounds is a lot. They should made them panel interviews to save you some time.",
          "score": 49
        },
        {
          "body": "Ugh and I thought my recent 5 interviews was a lot. 9 is BRUTAL, I’m sorry OP",
          "score": 11
        },
        {
          "body": "Thank you, OP, for providing us with.a.name. Far too many of these accounts have little to no value if we do not call out bad actors.",
          "score": 12
        },
        {
          "body": "It’s a FAANG, this is a known issue with these companies as they have thousands upon thousands of applications a day and have the leverage to put people through a gauntlet because they know you want to work for them.",
          "score": 6
        },
        {
          "body": "Mental note never apply for a job at Netflix",
          "score": 5
        },
        {
          "body": "Yikes, that is brutal. I recently did 6 rounds over three days and thought that was a bit much. 9 rounds is insane.",
          "score": 2
        }
      ]
    },
    {
      "title": "Got rejected by Netflix — and I can’t stop thinking about that one interview",
      "body": "I got the rejection email from Netflix. After making it through multiple rounds — including system design and the culture/values interview — I felt hopeful. I thought I was close.\n\nBut I messed up the incident management round.\n\nIt wasn’t even a hard question. I just blanked. My mind went foggy. I gave an answer I wouldn’t normally give — and as soon as I walked out of the interview, I knew I had blown it. I still don’t fully understand why I reacted that way. Nerves? Pressure? Doesn’t matter now, I guess.\n\nThey ended up going with someone who had more incident management experience. Fair. It just hurts because I know I *can* do this job. I’ve handled real incidents in production. But in that one moment, I couldn’t show it.\n\nI’m disappointed. I really saw myself there. I’d put in the hours, studied like hell, prepped for every scenario. It wasn’t just a job — it felt like a milestone. And failing it for something I usually *do well*? That stings.\n\nStill, I’ll move forward. Learn. Improve. Try again, maybe even there, someday. But for now, I’m sitting with the disappointment — and reminding myself that one bad moment doesn’t define my whole career.",
      "subreddit": "interviews",
      "score": 18,
      "url": "https://reddit.com/r/interviews/comments/1m2y9sj/got_rejected_by_netflix_and_i_cant_stop_thinking/",
      "comments": [
        {
          "body": "Never assume you are getting the job.  It is dangerous to picture yourself in a job.  It takes you away from what you should be doing - applying for more jobs.\n\nDefinitely learn from this experience.  The only way to get better at interviewing is to keep interviewing.",
          "score": 44
        },
        {
          "body": "Happened to me last interview. It was between me and someone else and i blanked on a question when they asked “how do you know which priorities to work on first?” \n\nThat is literally my day to day job since im a project manager who was applying for a pr officer role, but in that moment i blanked, because im so used to doing it that it comes natural to me, so i was unable to give a fully structured answer",
          "score": 6
        },
        {
          "body": "Things tend to even out over time, even in the interview process, wherein you \"blow\" one round in an interview process when you blank on something, but in another interview process you are asked a question that is difficult to answer yet answer it perfectly without batting an eyelash. I once had an interview where they asked me about a client project from a dozen years ago bullet-pointed on page 2 of my resume. I should have blanked, it was ancient history, but all of a sudden the words came out of my mouth going into detail. It turns out the interviewer had been at the client company then, and wanted my \"take.\" Whew!\n\nYou have a great attitude about this though, and the smart thing is to incorporate the learning for future.",
          "score": 4
        },
        {
          "body": "What was the question? was it for a senior swe position?",
          "score": 3
        },
        {
          "body": "same like me went blank when interviewer ask about incident response, i just blank, i dont know why, just empty. but i have 8years experience in that area. So yeahh, i feel you",
          "score": 2
        },
        {
          "body": "Same thing happened to me with Taco Bell, i didnt agree with their decision. I answered every question correctly/best of my ability but they wanted someone with more experience in a particular field, which didnt make sense to me as i made it through 3 rounds and they saw my resume multiple times.",
          "score": 2
        },
        {
          "body": "Oh man, I feel you.",
          "score": 1
        }
      ]
    },
    {
      "title": "Netflix Data Engineering 2024 Internship Round 1 Interview",
      "body": "Hello everyone,\n\nI received an email from Netflix on Thursday for a first round for the Data Engineering internship. I was wondering if anyone here has gone through the first and/or second round for this position and could let me know what is expected. It is my first live coding so I am a bit nervous. From other posts, I know that DE interviews usually consist of Python/SQL questions, but I want to know how difficult those questions are as there is no information on them. I would also like to know if there are any system design questions. I am fairly new to Data Engineering so I don't know much about the field.\n\n&amp;#x200B;\n\nThanks!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1b5yfqy/netflix_data_engineering_2024_internship_round_1/",
      "comments": [
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "I haven't experienced their interview process myself, but I recommend practicing on the StrataScratch platform. They offer Data Engineering interview questions from Netflix.",
          "score": 1
        }
      ]
    },
    {
      "title": "Why is it so tough to land a data analyst job in India right now?",
      "body": "Hey everyone,\nPosting on behalf of my friend who’s been struggling a lot and I thought this community might have some insights.\n\nHe’s been looking for a full-time data analyst job for more than a year now.\n\nHere’s his profile:\n\nOver 3 years total experience in data analysis\n\nDid freelancing projects before (building dashboards, SQL queries, data cleaning etc.)\n\nCurrently working as a contractual analyst for Netflix through 3rd party company (yes, it sounds amazing on paper!)\n\nBut despite all this, he hasn’t been able to land a permanent job. Interviews either stop after the first round or companies ghost.\n\nHe’s based in India and feels like the market here is way too saturated — every JD has a long list of requirements and companies prefer freshers they can train or very senior people with niche skills.\n\nHas anyone here faced (or seen) a similar situation?\n\nWhat would you recommend?\nAny advice would mean a lot 🙏",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1n756pl/why_is_it_so_tough_to_land_a_data_analyst_job_in/",
      "comments": [
        {
          "body": "Yeah, this is tough but not uncommon. To stand out, he needs to pivot the focus to developing niche analytics skills or get certified in something in-demand like AI/ML tools. Networking actively with professionals in targeted companies or industries on LinkedIn can also give him an edge. Plus, refining how he articulates his value in interviews using STAR can make a difference.",
          "score": 2
        }
      ]
    },
    {
      "title": "Pathetic Interview Experience at EXL (Greater Noida)",
      "body": "\nI had one of the most unprofessional interview experiences at EXL Greater Noida and felt I should share it here.\nI had clearly told the consultant in advance that 12 pm was the only suitable time slot for me, given my own office commitments. She agreed at that time. On the day of the interview, I reached their office on time and reported at the reception.\nFinally, around 1 pm, someone came and spoke to me for just 15 minutes. After that, I was told to wait “just another 15 minutes” for the next round. That “15 minutes” stretched into 1.5 hours of waiting with zero communication.\nInstead of speaking to the senior manager and coordinating, the consultant kept telling me to “please take leave and wait” — as if I had no other work. I reminded her multiple times that I also had office commitments, but it was ignored.\nWhen the next interviewer finally came, there was no apology, no courtesy, nothing. Just casual attitude and complete disregard for the fact that I’d been sitting there without even food or water.\n\nBy 2:57 pm, I decided to leave. Then at around 3 pm, the senior manager suddenly realised I was there for the interview and started calling me to check where I was. \n\nWhen I told him I had already left, his response was: “I told you to wait for some time.” To which I replied: “You said 15 minutes, not 1.5 hours — and still I waited patiently.”\nHonestly, this entire process at EXL was a reflection of pathetic candidate experience, no respect for time, no basic courtesy, and simple ignorance with attitude. It left me with a very poor impression of the company.",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1mys7dy/pathetic_interview_experience_at_exl_greater_noida/",
      "comments": [
        {
          "body": "what was the name of the movie with the scam call center based in noida on netflix? it was a really good series",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Self video ",
      "body": "I got a request for a self interview has anyone done these I’m not really good at them I tried one once for Netflix but I didn’t do so good anyone have pointers on how to do these types of interviews? ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1gpbpia/self_video/",
      "comments": [
        {
          "body": "The key is to treat them like a regular interview, just with a camera instead of a person. Prepare your answers to common questions, dress professionally, and find a quiet, well-lit space with a neutral background. Practice speaking to the camera beforehand to get comfortable with the format and try to maintain eye contact with the lens as if it were the interviewer.\n\nOne advantage of self-video interviews is that you can usually retake your responses if you're not satisfied. Take advantage of this, but don't obsess over perfection. Be yourself, speak clearly, and show enthusiasm for the role. If you're struggling with blanking on answers, consider using a tool like this [job interview AI](http://interviews.chat) to help you prepare and practice. I'm on the team that created it, and it's designed to help job seekers navigate tricky interview questions and boost their confidence in various interview formats, including self-video interviews.",
          "score": 1
        }
      ]
    },
    {
      "title": "Preparing your job interview with Googlers",
      "body": "Tired of scheduling hassles, high interview costs, low quality, and questions that are far from what you'd face in the real world?\n\nWe are now prividing [**Free mock interviews with MAANG (Meta, Amazon, Apple, Netflix, Google) experts.**](https://charly-en.framer.ai/)\n\nhttps://preview.redd.it/dco03rmdyvrc1.png?width=3496&amp;format=png&amp;auto=webp&amp;s=154f47aa8fcf2e5eab1ae7edaac54896eba2ef40\n\nPrepare your technical interview with the best interviewers and boost your interview skills.\n\nSign up now for unlimited access for free\n\n[**&gt;&gt; Join Now!**](https://charly-en.framer.ai/)",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1bt6l0f/preparing_your_job_interview_with_googlers/",
      "comments": []
    },
    {
      "title": "5 things it's actually OK to \"stretch\" the truth about in interviews",
      "body": "We often hear interviewers say “don’t lie in an interview” (which is true), but on the other hand: some things need to be…polished.\n\nAfter years of interviewing for a variety of industries, and helping some friends prepare with tools like Beyz Interview Assistant, I’ve realized that there are some areas where being 100% honest doesn’t necessarily help you.\n\n**Your hobbies**\nInterviewers still ask this. But be honest: “I binge-watch Netflix and Reddit” doesn’t win points. It’s better to mention something that sounds fascinating or balanced. You don’t have to pretend you’re a marathon runner, but hobbies like “documentary photography” or “urban hiking” come across better than “sleeping in.”\n\n**Why you’re leaving your current job**\n“I hate the toxic culture” or “I need more money” may be true, but it’s safer to say: *“I’m looking for new challenges and growth opportunities that my current position doesn’t provide.”\n\n**Where you see yourself in five years**\nNo one wants to hear that you plan to change jobs, go back to school, or retire to a cabin. Just say: *“I see myself growing at this company, ideally leading a small team or taking on more responsibility.”\n\n**Scope of your work**\nIf your scope extends well beyond your title, even if you’re not officially “in charge,” it’s okay to say *“I led X project.”*\nBeyz helper’s mock interview exercises really helped me figure out how to express this through the STAR rule.\n\n**Why this company**\nWe all need to pay rent. But interviewers want to hear something about teamwork or goals. Tools like the interview question bank helped me learn how to craft these answers more thoughtfully: even if you just really need a job, tie it to the company’s mission or culture.\n\nDon’t lie about your performance or technical abilities, of course. But a little narrative? That’s part of the game, too. It can make the difference between sounding aimless… or sounding prepared.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1kzhisb/5_things_its_actually_ok_to_stretch_the_truth/",
      "comments": [
        {
          "body": "Nice ad bro. Too bad Beyz is a total scam and not at all worth the money 😉",
          "score": 29
        },
        {
          "body": "Let me TLDR this for everyone. Ignore everything that was said and lie in the interview. Sincerely, a hiring manager who knows what the job market is like and knows this is totally an ad.",
          "score": 15
        },
        {
          "body": "Lying is the only way to get the job ",
          "score": 8
        },
        {
          "body": "Here's my favorite answer to the \"why are you leaving your job\" although I almost never get asked this question:\n\n\"It's not about why I want to leave, it's that I think working here would be really cool.  I love your company because &lt;x, I like the product, I use the product already, whatever&gt; and I think I'd fit in well with the role, and it'd be a great way for me to grow my skills\"\n\nThis also feeds into the \"why this company\" - if you show that you already know their products and what they do, you're basically a shoe in.",
          "score": 2
        },
        {
          "body": "Btw you can do all these in ChatGPT. Stretch and exaggerate but always make sure you can back it up and really understand what you talk about because they might dig deep after your answer.",
          "score": 2
        },
        {
          "body": "I mean the guy is right tho. It's stretching the truth on motivations, not experience.",
          "score": 1
        }
      ]
    },
    {
      "title": "Netflix phone call after the final round",
      "body": "I had my final round of interview with Netflix. I got an email asking I’m available for a phone call tomorrow. I was wondering if Netflix rejects candidates via email or phone call. If anyone got a job offer, was it over a phone call? Thanks",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n1llpq/netflix_phone_call_after_the_final_round/",
      "comments": [
        {
          "body": "Phone calls are probably for the offer, I'd assume. I think 95% of my jobs call to make an offer.",
          "score": 2
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "FAANG interview didn't go as expected",
      "body": "Today I had my first round of interview at one of the FAANG companies and I feel that I didn't do good enough and might not get selected for further rounds.\n\nFeeling sad and guilty that I should have put more efforts.\n\nJust want to get this off my chest.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1hybwpy/faang_interview_didnt_go_as_expected/",
      "comments": [
        {
          "body": "What is FAANG?",
          "score": 1
        },
        {
          "body": "Here's the thing: one interview doesn't define your worth or your potential. Even if you don't move forward with this particular opportunity, you've gained valuable experience that will help you in future interviews.\n\nTry to focus on what you learned from this experience. What questions caught you off guard? Which areas do you feel you need to strengthen? Use this as motivation to refine your skills and knowledge for the next opportunity. The tech industry is vast, and there are plenty of amazing companies out there looking for talented individuals like yourself. Keep pushing forward, and don't let this setback discourage you from pursuing your goals.\n\nBy the way, I'm part of the team that created [AI interview helper](http://interviews.chat), a tool designed to help people navigate tricky interview questions and improve their performance. It might be worth checking out if you want to feel more prepared for your next big interview opportunity.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview with Chigozie Zeribe Wanodi AKA Zegon Production",
      "body": "Interview with one of the most prolific producers in the Nigerian movie industry proudly conducted by Economy-C Potentials\n\n[Nollywood producer, Chigozie Zeribe Wanobi at a pub in Lagos, Nigeria.](https://preview.redd.it/gnxf9f0avazd1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=6279c29fc8d243f87c4df54868bafe94c1f8c0d4)\n\n*Introduction*\n\n**I am Sir. Chigozie Zeribe Wanodi, popularly known as Zegon Production. I Am from Rivers State, Ikwerre local government area, to be precise. I grew up in Imo State and attended Isiala Mbano Community Secondary School located in the community where my mother comes from. In my school days, I knew I was a brilliant student growing up in a bad system, but I never let that to stop me from reaching the top and fulfilling my dream.**\n\n*A movie Producer and an actor, what else do you do for a living?*\n\n**I am an entrepreneur. I manage my personal business, I import ladies' undies Bebe’s, and so on.**\n\n*Have you produced any movie recently?*\n\n**Yes, I just finished a new movie last week that will soon be in the cinema.**\n\n*When do we expect a new project or are you planning on another movie?*\n\n**I am working on a bigger project that will be shooting in Nigeria, South Africa and Jamaica, with the biggest Nigerian actors, the movie is a Netflix story and will be showcased globally on Netflix.**\n\n*Do you prefer to be a movie producer and a businessman then working in a company or any institution?*\n\n**No banks in Nigeria can pay me. We make money in dollars now on YouTube. I don’t think I can work for any company with the amount of money I spend… (Ha! ha! ha! ha! ha! {\\*laugh\\*})**\n\n[Chigozie Zeribe Wanodi, Nollywood Producer, at a mall in Abuja, Nigeria](https://preview.redd.it/ba90z5ybvazd1.jpg?width=720&amp;format=pjpg&amp;auto=webp&amp;s=ae589c5e7b803aa32e5820ee0e6bb90a81a2927b)\n\n*On your new project that will be on Netflix, which actors are you likely to work with?*\n\n**Just like I said, it is a Netflix movie, and I will use faces that knows how Netflix works; good actors who can interpret their roles very well to give a good meaning to what society needs to understand.**\n\n*How are you guys surviving in movie making?*\n\n**Success is being able to give back to the movie maker and content creators &amp; society at large. Thank God for YouTube Facebook and all social media platforms.** \n\n*What will the public learn from your movie coming up in January?*\n\n**My new movie is like a ministry. The stories are interactive; they are like things you hear from the pulpit; it is about the triumph of good over evil.**\n\n*Thank you for making a timeout for this interview.*\n\n**It’s a pleasure being here.**",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1gl171s/interview_with_chigozie_zeribe_wanodi_aka_zegon/",
      "comments": []
    }
  ]
}