{
  "company": "optum",
  "post_count": 14,
  "exported_at": "2026-01-18T17:44:53.296Z",
  "posts": [
    {
      "title": "Optum/UnitedHealth group technology development program",
      "body": "I applied for the tdp summer internship. I made it past the first video interview stage and have been scheduled a 45 minute final(?) interview with the hiring team. I surprisingly didn't get a coding challenge after I passed the video interview like I saw other people say, so I'm assuming the technical portion is going to be during the actual interview which kind of makes me nervous as I have no idea what they will ask me. I was wondering what people's experiences were with interviewing with them or the actual internship itself.",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/t8wii8/optumunitedhealth_group_technology_development/",
      "comments": [
        {
          "body": "Same situation. 45 mins final was just going over resume and asking questions. Not sure if there is another round my interviewer did not know.",
          "score": 5
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Same situation. Did you end up getting the internship right after the 45 min interview? or did you have to do the coding challenge after before you got offered the job? I just finished my 45 min interview just now and I'm very curious on what the next process of the hiring process it",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "United Health Group's Software Engineer TDP",
      "body": "I usually just lurk in this sub but this is just baffling me and I want to see if anyone here has had any experience with this specific situation or any advice on what I can improve on.\n\nSo, I applied for the United Health Group's New Grad rotational program around the beginning of September and received their email to do my first ever virtual interview about 2 weeks ago. I thought I did ok and based on some of the other posts from this sub(where other people completed it in about an hour while I took more than 5 days), I was pretty certain I would get to move on to their next step with an actual interview with an actual person. Instead, I got a rejection email. I'm so confused right now and thought that as long as I did it, I would be able to move on. Almost every post about optum/UHG's TDP made it look so easy to get into as everyone was getting to the final interview.\n\nWhat I did: Like for any interview, I dressed up from the waist up and did my hair. As soon as I saw each question, I wrote down the response I was going to give and practiced it like 10 times before submitting. I read somewhere that they might track your eye movements and the background noise so I looked straight at the screen and had absolutely no noise in the background. If I saw my eyes deviate even a little or had any sort of noise in the background, I'd retake it. The answers I gave were all related to technology some way or another so I don't think the quality of my responses are the factor, especially when I spent about a day on question. I felt I might've sounded a little robotic but I tried to put as much emotion as I could but it was just so weird for me to talk to a screen.\n\nI applied for their other 2 rotational roles and I want to see what I can improve on. Should I just wing it instead next time and have more filler words and pauses?\n\nA little unrelated but what are some other rotational new grad programs or non rotational tech programs out there that I can apply to?",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/y1f1sd/united_health_groups_software_engineer_tdp/",
      "comments": [
        {
          "body": "CapitalOne, AmeriTrade (maybe), Grainger, and maybe that dialysis company",
          "score": 8
        },
        {
          "body": "-\tTarget\n-\tExodusPoint\n-\tExpedia\n-\tApple Evolve\n\nAre top of my head\n\n\nUsually finance (bank/insurance) or healthcare adjacent companies run Rotational Program",
          "score": 6
        },
        {
          "body": "Hey , I've been rejected as well. I've a decent resume with decent projects and internships so they might hire less candidates in contrast to prior years which makes the hiring process more selective.",
          "score": 5
        },
        {
          "body": "There's a bunch of rotational programs in here. \nhttps://github.com/coderQuad/New-Grad-Positions-2023",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 4
        }
      ]
    },
    {
      "title": "Optum Technology Development Internship",
      "body": "I recently accepted an internship offer in the Optum Technology Development Internship program for the Summer of 2022 in Eden Prairie MN. If anyone has worked in that program in the past, or know someone who has, I was curious as to what it was like? I've read threads from a few years ago and was wondering if there was any discrepancies between then and now.\n\n&amp;#x200B;\n\nI'm curious about everything from what the projects are like, how the office/desk situations work, dress code, anything. I'm just generally curious about the work and the work environment.\n\n&amp;#x200B;\n\nIf anyone has anything they'd like to share I am all ears!",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/qkmvnf/optum_technology_development_internship/",
      "comments": [
        {
          "body": "Depends on which area/department you're assigned to.",
          "score": 1
        },
        {
          "body": "This is unrelated, but when did you get your offer letter after the interview? I interviewed 1.5 weeks ago, and I was wondering if I should have hope or not lol.",
          "score": 1
        },
        {
          "body": "@kstrozin\n\nDear OP,\n I had a question. Do you know what I could expect for a salary for this internship? Like what range",
          "score": 1
        }
      ]
    },
    {
      "title": "Optum Technology Development Program Internship",
      "body": "Hey guys!\n\nI recently got an offer for Optum's (United Health Group) Technology Development Program internship and I was wondering if anyone had any experience with this program and could tell me if it is worth it to take the offer. I have two weeks to get back to them but I also wanted to wait to hear back from other companies that I applied for. For context, I am a freshman CS major and so far, Optum is the only company I have interviewed with. Any advice is appreciated.\n\nThanks!",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/9uj35s/optum_technology_development_program_internship/",
      "comments": [
        {
          "body": "Congrats on the offer dude! I recently got invited to their on-site interview in NJ. Can you tell me about your on-site interview experience? I'm not sure how their interviews are going to be like.",
          "score": 4
        },
        {
          "body": "I used to be in their graduate TDP program in Minnesota. The TDP interns I worked with all say they don’t have enough work to do. A lot of them would hang in groups and chat. If you want a challenge, Optum isn’t the place, but they do pay their interns decent. At the end of the day, it really depends on what team you’re assigned to. If you want to do development, make sure you get your point across. A lot of people complained when they end up doing data and business analysts kind of work",
          "score": 3
        },
        {
          "body": "I interned there this summer. If you ended up taking the offer and have any questions, just let me know!",
          "score": 3
        },
        {
          "body": "I did Optum's short behavioral hirevue, then I did their coding test, then I had a 30 minute hirevue interview with one of the Software developers. I did the 30 minute interview last Friday. He asked me a lot about my resume and projects I've done, but no coding questions. I was wondering if anyone knows if there would be another round of interviewing after this or if that was the last round? Because I haven't been on site yet but that might be because I applied for a position in NJ and I go to school in California. I was also wondering how fast they respond to you guys about next steps because it's been about  a week since my interview and I was wondering when they would reach out next?\n\n&amp;#x200B;\n\nThanks for the help",
          "score": 2
        }
      ]
    },
    {
      "title": "Rotational Program vs Entry level SWE",
      "body": "Im graduating this semester and I got a few offers but I’m torn up on deciding between these two. \n\nSo I got into a the technical development program at Optum/UHG, its completely remote and they’re offering me $100 base, $10k sign-on, and $10k stock this year + $20k stock next year. The insurance however is ironically kind of ass.\n\nI then also got an offer for SWE from Bill.com where they are offering $107k base, $5k sign-on, and $15k stock per year for 4 years. So the TC comes out to around $122-127k. For this role however, its hybrid and I’ll have to commute ~30 min twice a week. They also have decent insurance but no 401k match.\n\nThe reason I’m torn between these two offers is because for one I’ll start off as SWE at Bill.com and they pay slightly more, albeit no 401k match. It’s also a bit more fast pace then Optum since its sort of a midsized company. So I feel like career growth here would be better starting off. At Optum its a rotational program so I won’t be a SWE for at least a year but I’ll get exposure to different fields of technologies and I might have a better idea on what direction to head to in the future. Additionally, I read online that the WLB is really good but the company is slow paced with limited growth opportunities also it’s remote. But yeah, I’m not sure which role would be better to choose when starting my career.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/tjd39l/rotational_program_vs_entry_level_swe/",
      "comments": [
        {
          "body": "&gt;I won't be a SWE for at least a year\n\nAre you going to be a PM or data scientist or something through your rotations?",
          "score": 3
        },
        {
          "body": "Congrats on your offers. Which did you choose?\n\nAnd for the uhg TDP, what was the timeline of the hiring process after your 45 min 1:1 interview?",
          "score": 3
        },
        {
          "body": "What's the location for [Bill.com](https://Bill.com), and is it different than if you were working for UNH/Optum?",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "UnitedHealth Group (Optum) vs AT&amp;T TDP?",
      "body": "Has anyone worked for either of these companies? Can you share the pros and cons? I got offers for both of their TDP Software Engineer roles. I really don't know what to pick. Pay is almost the same. UHG will be remote, AT&amp;T is hybrid...right now I think the decision maker is the company that has good WLB. But at the same time I also want to learn a lot and I am aware health tech may be slow/outdated...",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/rjqly7/unitedhealth_group_optum_vs_att_tdp/",
      "comments": [
        {
          "body": "I was actually in the same exact situation as you a few days ago lol. I ended up choosing AT&amp;T over UHG but that was more due to AT&amp;T being closer to home/family and paying slightly more. Sorry I dont really have any other info for you but Good luck on your decision!",
          "score": 4
        },
        {
          "body": "After the interview with the hiring manager, did you setup a call with a recruiter after? (I'm assuming this is to discuss an offer)",
          "score": 3
        }
      ]
    },
    {
      "title": "Optum TDP Associate Advice Needed!",
      "body": "Hi all!\n\nI accepted an offer to be a full time TDP associate for the rotational program at Optum in Schaumburg, IL, and I need help choosing which track to pick. I start this upcoming June. I have the choice to pick between 1. Data 2. Security 3. Software Engineering. If anyone has any input in these tracks or about TDP please let me know! Thank you!",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/fmp2j1/optum_tdp_associate_advice_needed/",
      "comments": [
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "My main advice to you is if you know what field you're interested in, make it absolutely clear to the recruiter that that is your choice. Do not even give them other options if they ask you for your top 3. If you want to do software development, say that and only that. If you're more open to trying different things then this isn't as big of a deal, but some kids I know ended up getting put in roles they didn't really want. \n\nDo you have any more specific questions? If so you can PM me.",
          "score": 1
        }
      ]
    },
    {
      "title": "UHG/Optum random drug tests",
      "body": "Hello, I've recently set up an interview to work with Optum and am curious about their drug testing policies. I've read that they conduct drug tests as part of pre-employment screening and have taken a break from any recreational activities while this process is underway.\n\nI am wondering, however, if anyone knows or has heard that they randomly drug test their employees. I am a very light/casual smoker, so it wouldn't be a problem there were periodic tests (i.e. couple weeks notice) but am concerned that they may conduct random ones.\n\nFrom what I've read about the laws in my state, random drug tests can happen under reasonable suspicion or in the case of safety sensitive positions. Is being an engineer under the umbrella of a large healthcare company considered safety sensitive?\n\nThank you!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/5i6bai/uhgoptum_random_drug_tests/",
      "comments": [
        {
          "body": "Yes, you're dealing with tech that involves medical and or financials. You will get drug tested. ",
          "score": 3
        },
        {
          "body": "Yes.\n\nMy brother works for Optum in MN and gets randomly screened. ",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Quality of Life for Optum Technology Development Program Associate",
      "body": "Hi guys,\n\nI'm a senior graduating this spring, and I made it past the first round of interviews to a live interview with one of the TDP managers (yay interview season!). I'm trying to find reviews of this position online to get a gist of how my experience would be here, but can't really seem to find much. If any of you have ever done this program, can you give me some advice/warnings if you have any? ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/5zf88h/quality_of_life_for_optum_technology_development/",
      "comments": []
    },
    {
      "title": "Need Advice! Optum (UHG) Dublin Interview – Salary Expectations &amp; Tips?",
      "body": "",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1pf9bzw/need_advice_optum_uhg_dublin_interview_salary/",
      "comments": []
    },
    {
      "title": "Confused after OptumRx Data Scientist interview – great discussion but unclear outcome",
      "body": "Hey everyone,\n\nI had an interview a week ago with OptumRx for a Data Scientist position. The interview lasted about an hour with two senior team members, and I genuinely enjoyed the conversation — it felt positive, and I was hopeful about the outcome.\n\nAfter not hearing back for a week, I reached out to the recruiter via email. He replied saying he had tried to contact me twice but couldn’t reach me. I then called him yesterday, and he returned my call right away. During our chat, he politely mentioned that there wasn’t any negative feedback, but they decided to move forward with another candidate who had stronger stakeholder management experience. He said my background is more on the technical/data science side, and this particular role required someone who could handle more stakeholder-facing responsibilities.\n\nWhat confuses me is that neither during the initial screening nor the one-hour technical interview was stakeholder management discussed at all. If that was a key factor, I wish they had clarified it earlier.\n\nAlso, when I checked my application portal today, the status still shows as **“Under Review”** rather than **“No longer considered”**, and I haven’t received any official rejection email.\n\nIs this normal? Could there still be a chance, or should I take this as a rejection? I’m honestly pretty disappointed — I really thought the interview went well.",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1orr1bv/confused_after_optumrx_data_scientist_interview/",
      "comments": []
    },
    {
      "title": "OPTUM INTERVIEW TIPS",
      "body": "Hello everyone, i am planning to apply at Optum QC this coming week. Newbie sa Healthcare account. Any tips or possible question sa interview .Thank you in advance",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ompybg/optum_interview_tips/",
      "comments": []
    },
    {
      "title": "Senior Healthcare Economist Interview at The Lewin Group, Optum-UHG",
      "body": "Hi folks,\n\nI recently interviewed for Senior Healthcare Economist at The Lewin Group, Optum-UHG. The interview went ok. My interviewer was Senior Consultant. This was the second stage. The first one was with the recruiter. At the end of the interview, I asked the interviewer what the next steps are and when I should expect to hear back. She told me that she did not know and said maybe a couple of weeks. Do you think they do not consider me for the next steps? or the interviewer is not the sole decision maker so she could not say anything about it. Do you guys have any interview experience with the Lewin Group?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1icwj9j/senior_healthcare_economist_interview_at_the/",
      "comments": [
        {
          "body": "What do you guys think?",
          "score": 1
        }
      ]
    },
    {
      "title": "Senior Healthcare Economist Interview at The Lewin Group, Optum-UHG",
      "body": "Hi folks,\n\nI recently interviewed for Senior Healthcare Economist at The Lewin Group, Optum-UHG. The interview went ok. My interviewer was Senior Consultant. This was the second stage. The first one was with the recruiter. At the end of the interview, I asked the interviewer what the next steps are and when I should expect to hear back. She told me that she did not know and said maybe a couple of weeks. Do you think they do not consider me for the next steps? or the interviewer is not the sole decision maker so she could not say anything about it. Do you guys have any interview experience with the Lewin Group?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ibo5pp/senior_healthcare_economist_interview_at_the/",
      "comments": []
    }
  ]
}