{
  "company": "paypal",
  "post_count": 59,
  "exported_at": "2026-01-18T17:44:53.298Z",
  "posts": [
    {
      "title": "Is this new job opportunity legit?",
      "body": "Edit: after having worked for them, I can definitively say this is a bad company that will try and cheat you out of money. Don’t work for them! \n\nI recently got a paid opportunity but I can’t quite tell if it’s legitimate or a scam. Has anyone heard of a company called “Quick Gizmos?” I encountered them through a freelancing site, and got an interview where they said they’re an LLC that hires external writers. \n\nHere’s why it seems sketchy: they hired me immediately, there’s no official paperwork (although I’m new to freelancing so maybe that’s normal), there’s almost nothing about them online, they advocated for paying me separate from the freelancing site \n\nHere’s why it seems legit: they interviewed me, they have training videos and documents, they haven’t asked for any invasive personal info, the only thing needed for payment is PayPal and they did say they will pay me through the freelancing site if that’s what I want (after a spiel advocating for paying separately so I don’t lose money through commission) \n\nI’m not the best at differentiating between scams and legitimate opportunities. If anyone knows anything about them please help me out!",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/ke0lue/is_this_new_job_opportunity_legit/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I'm not all that familiar with freelancing, but the payments through paypal screams scam to me. If they were legit I feel as though they would have you set up a direct deposit. Have they asked you to submit a w-9 or anything like that?",
          "score": 3
        },
        {
          "body": "&gt;(after a spiel advocating for paying separately so I don’t lose money through commission)\n\nSUPER sketchy. I wouldn't.",
          "score": 3
        },
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I also felt uncomfortable that they wanted to move things out of the realm of the freelancing website where the job offer was. The site I'm on provides a bit of protection in terms of payment. I didn't accept the job.",
          "score": 1
        },
        {
          "body": "Hey, this is actually a legit writing opportunity. I currently write for them and they are great to work with. I think they offer both because a ton of writers do complain about big fees taken from all these freelancing sites.",
          "score": 1
        }
      ]
    },
    {
      "title": "Orthopedic Cerebral Palsy, and the Reverberations of Helicopter Parenting",
      "body": "I was born with orthopedic cerebral palsy. Either because of ego or ignorance, my parents never pursued disability benefits for me after my birth. This has had significant repercussions for me, even to this day.\n\nAfter I graduated from my high school, I was given a position there, working in the IT department. I worked there, faithfully, for three years. If you fast forward to 2009, I was essentially forced to move back home, because of the economic downturn that started a year earlier.\n\nWhen I applied, again, for SSDI in 2015, I was ultimately denied. The reasoning was that I had mistakenly surpassed the threshold for childhood eligibility: I had worked seven months beyond my 22nd birthday. If any of you have experience with CP, you know that the actual condition doesn't change much. So, because my parents failed to educate themselves and me about the law, I ultimately accepted a position that cost me my eligibility for disability benefits.\n\nSo, why not just appeal, right? This is where it becomes awkward and painful for me. Since 2010, I've personally experienced my father's alcoholism, drug abuse, physical threats, emotional abuse, and helicopter parenting. This includes mail tampering, encouraging me to falsify a SSDI application, and interfering with a SSDI interview.\n\nLong story short, I currently receive a small amount of SSI, half of which directly goes to my father for expenses. The SSA refuses to allow me to provide proof of these payments, without speaking to him directly. After the abuse from him I've experienced, this is not happening.\n\nThe last straw for me is the overpayment notice I received yesterday. My account briefly went over the limit twice in 2016, while I was attempting to ensure I had an adequate amount of expenses. I could file for a waiver or appeal, but I can't stand having this hanging over my head. Plus, I effectively don't have anyone to help me with transportation, and such. I'll just pay the money back, so I'm done with it.\n\nWhat I need help with, or advice on, is how to get in front of someone that'll hire me, while accepting and understanding that I have mobility concerns. As I hope this post indicates, I like to think of myself as articulate, responsible, and professional. I just have limited work experience, at the age of 38.\n\nAs it would neutralize the disability, I think I would be best suited for an administrative or clerical setting. I'm in Columbus, Ohio.\n\nAny help that anyone could offer me in finding work, so I can get myself off SSI and out of this abusive home, would be wholeheartedly appreciated. If anyone has questions, I'd be glad to answer them. I apologize for the length of this post. I do appreciate your time.\n\nEdit 1: I misspoke when I used the word \"directly.\" \"Immediately\" is more accurate. I pay him voluntarily via PayPal on the 1st of every month, and I've done so faithfully for two years. He had initially tried to redirect my SSI. https://www.reddit.com/r/jobs/comments/6y4tsi/orthopedic_cerebral_palsy_and_the_reverberations/dml6w6o/.",
      "subreddit": "jobs",
      "score": 93,
      "url": "https://reddit.com/r/jobs/comments/6y4tsi/orthopedic_cerebral_palsy_and_the_reverberations/",
      "comments": [
        {
          "body": "What I think you need to do is hire a competent attorney and talk to better social workers. ",
          "score": 11
        },
        {
          "body": "Upvoted for visibility.",
          "score": 13
        },
        {
          "body": "Have you registered on the OhioMeansJobs and OhioMeansAccessibility websites?  Both are part of the state's Job and Family Services division.  It would probably be beneficial for you to also visit an Ohio Means Jobs center and get their advice regarding your best plan of action. I'd suggest visiting a Franklin County center because that's where the biggest employers are based, and because there's not a lot of public transportation options outside of city limits.  \n\nAs of a few years ago, they had a cool 'apprenticeship' program.  They partnered with local businesses to provide an apprentice at no charge to the company;  the worker was paid from state funds.  The caveat is that it had to be a position that they company intended to fill permanently.  It was a good way for people to get their feet in the door.\n\n",
          "score": 4
        },
        {
          "body": "Is your father your payee?  Can you go to the Social Security office, explain what's happening, and request a different payee?  I believe there are different social programs that help with that sort of thing.\n\nAlso, if you haven't yet, contact your local Workforce / vocational rehab center.  They'll be able to help you find employment and advocate for you to ensure your mobility issues are accommodated.  They can help you with additional training, transportation, even practicing for interviews!\n\nBest of luck to you!!",
          "score": 3
        }
      ]
    },
    {
      "title": "PayPal finance ",
      "body": "Has anyone interviewed for PayPal finance team before?\nIf so can you share your experience and what the process was like? I have an interview coming up specifically for financial analyst role and any advice would help.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1fovxfn/paypal_finance/",
      "comments": []
    },
    {
      "title": "Is it common for companies to test junior developers by asking to create a fully functional app within 72 hours?",
      "body": "Hi, I am a self taught React JS Developer with no experience. I was applying for jobs online and I came up into this company that got interest with me and ask me to pm him. So I did and he set up a meeting, then we talked via zoom 2 days later. The meeting went well and I was pretty positive about it until in the end, he wanted to test my skill by having me create a fully functional E-Commerce Application using React JS and Laravel for the backend with PayPal API for the checkout. And submit it within 72 hours.\n\nI'm just worried if it's worth the effort to do it or should I just look for another one. I am not familiar with PHP/Laravel btw which makes it a bit difficult for me.\n\nThis was the description sent to me: [https://imgur.com/a/noiFALQ](https://imgur.com/a/noiFALQ)",
      "subreddit": "cscareerquestions",
      "score": 862,
      "url": "https://reddit.com/r/cscareerquestions/comments/m95lcf/is_it_common_for_companies_to_test_junior/",
      "comments": [
        {
          "body": "Yea, I’d skip it. Even if you knew how to do all that, that’s not something you should do for free. A test should be just that, a test. There will be other opportunities out there.",
          "score": 385
        },
        {
          "body": "Seeing nothing but red flags here. *You sure they aren’t just offsetting some of their own work onto you?* (Said in the most jokingly, sarcastic and even cynical tone)\n\nSeems nuts for a coding test. Most I was ever got was a calculator in Vue that just summed up numbers.\n\nI’d say trust your gut instincts on this one.\n\nEdit 1: Well, I didn’t expect a comment I made in under a minute to reach this far. If you are reading this, please keep in mind that this is a more nuanced topic. There are a lot of good differing perspectives. Make sure you go through them before making any opinions. \n\nI wanted to make clear that I was joking about the potential use of OP’s work, it was nothing but speculative joking. I have edited that portion to make that as clear as possible. I do not want to push any narratives that I can neither prove nor disprove. Though, I do find the particular can of worms it opened a fascinating topic. \n\nMy opinion is subjective from my own intuition and past experiences. You may not see any red flags, that is fine. \n\nIf you find yourself in this predicament, make sure you are doing your due diligence, researching the company and its reviews. If you can speak to former employees that is even better. Keep in mind, all of this needs to be framed to your current job market, your local area and your country. \n\nIf after putting everything into perspective, it is still worth it to you, then there’s nothing wrong with that. \n\nI just want to make clear that I am not against this approach in general. Take anything I write with as much salt as you need to. \n\nAt the end of the day, like I stated in my original comment, always trust your own judgement on these matters 👍",
          "score": 853
        },
        {
          "body": "[deleted]",
          "score": 434
        },
        {
          "body": "Usually these kind of employers just play the numbers game as much as applicants do. Eventually they’ll find someone desperate and hungry enough to do the test without complaint. Last man standing ‘may’ be who they hire, worst case they rip off their source code for themselves and not hire anyone.\n\nIronically in the past I’ve been given offers by companies that only had a single round with no take home test vs ones that had a take home.",
          "score": 88
        },
        {
          "body": "It took me less than 3 minutes to figure out what the company is. And that's without recognizing their logo or even successfully finding it via tineye.\n\nThey're almost certainly using you for free work.",
          "score": 488
        }
      ]
    },
    {
      "title": "Interview with Paypal question",
      "body": "Those who have interviewed with Paypal for software internship positions, could you give me some insight? Glassdoor doesn't help much. Thanks!",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/5ve91w/interview_with_paypal_question/",
      "comments": [
        {
          "body": "I've never done it, but I would mane sure you are familiar with the PayPal API and how to add a PayPal checkout and PayPal donation buttons in the language you are studying at the minimum. And with all interviews, it is good to research the company. Be able to answer the questions \"why do you want to work here?\" and \"what do you like about this job/company?\" Try to make it sound like working for PayPal is one of your dreams even though they suck. ",
          "score": 1
        },
        {
          "body": "Seems like they hire by team. I went through a phone screen and then a 3 hour phone/skype interview with 5 different team members. Two of the interviewers seemed to be going down a premeditated list of questions (ie. what does this keyword do in Java). Never heard back after that interview and didn't bother asking for an update because the interview was so displeasing.\n\nOnly good thing I have heard is that the compensation is competitive.",
          "score": 1
        }
      ]
    },
    {
      "title": "What's the interview process like at PayPal for SWE internship (San Jose)?",
      "body": "",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/5rcte3/whats_the_interview_process_like_at_paypal_for/",
      "comments": [
        {
          "body": "I did it the other day, it's a 1 hour phone interview with the team and then 4 skype interviews with the team. The bar doesn't seem to be that bad - the question was harder than I expected and I flailed around a lot but I still progressed to the next round. \n\nNote they also ask behavioral and domain specific questions in addition to algorithms questions. ",
          "score": 3
        }
      ]
    },
    {
      "title": "Paypal new grad SE interview: What to expect?",
      "body": "So, I have an upcoming interview for new grad SE opening. Anyone here interviewed for them before? What should I focus more on? Any and all suggestions are welcome.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/532a9t/paypal_new_grad_se_interview_what_to_expect/",
      "comments": [
        {
          "body": "You might want to search on r/csinterviewquestions.",
          "score": 0
        },
        {
          "body": "[deleted]",
          "score": -7
        }
      ]
    },
    {
      "title": "Review of Revature, GenSpark, and Cognixia: what to expect when joining these companies",
      "body": "Review of Revature, GenSpark, and Cognixia: what to expect when joining these companies\n\nHello, this will be a long one, so feel free to skip around to the section that you want to read. I want people to get the full idea of these companies before joining. I will try to be as unbiased as I can and try to be honest here but some opinion of these companies will form so that you can understand my perspective.\n\nI think the best way to explain is to split my post up into sections.\n\nI was with Revature in January 2020, GenSpark from October 2021 to March 2022, and Cognixia from June 2022 to November 2022, so I have about “1 year” experience dealing with these companies doing training with them.\n\n**Who are these companies and what do they do?**\n\nThese companies specialize in training entry-level developers/new grads to join roles to work for clients in companies as contractors.\n\nRevature (formerly eIntern): the worst of the three, they spam job postings in virtually every major city on major job boards to increase the amount of people applying to and joining their program. Revature specializes in only entry level talent.\n\nGenSpark/Pyramid Consulting: Pyramid Consulting is the parent company but they have a subdivision called GenSpark that also specialize in hiring new grads and training them to new roles. You may have heard of Pyramid Consulting or seen them for job postings and they are a rather large company.\n\nCognixia (JUMP)/Collabera/Ascendion/whatever the heck name they come up with next: Collabera is the parent company here, but Cognixia is also a sub-company and Ascendion is also their newest sub-company formed just a few months ago.\n\n**How do these companies hook people in?**\n\nThey tell you that you get free training and they give unrealistic percentages of the chances of being placed with a client. For Revature, they claim 70% are placed if you do well in their initial test to start training. For Cognixia, the claim is 90% after you finish training. In reality, the percentage is closer to as little as 0%-30% based on my observations. This low percentage, though, is based on who I observed that started training and made it all the way through, and ended up for a client position. Whole batches can be let go after training if they can’t find a fit for the trainees, so it really can be as low as 0%.\n\n**The bait and switch regarding Revature training, is that true?**\n\nYes, it can happen. You can apply to be a web developer and they force you to join Java training or even mobile developer training, PEGA training, Salesforce, or something else. You applying for that position and getting it does not mean that that is what you will be learning during the training. It is a major reason why many trainees fail out of Revature. It is because they are forced to learn a technology or programming language that they are not good in.\n\n**Dress code for Revature:**\n\nAs mentioned before, I was with Revature before the covid pandemic hit the states.\n\nIf you are thinking of joining Revature in-person (not sure if they do this anymore, they have a dress code, which is business professional on Mondays (wear a suit), and business casual Tuesdays to Thursdays, and casual wear on Fridays, but you can’t wear shorts. If you don’t have a suit, then you will probably have to spend extra money on one. Tough to do on the money you will be making during training.\n\n**How do these companies make money? They make it sound like they are a charity by giving free training and you benefitting from it?**\n\nNot so fast, they are like other staffing companies, where if you get placed, they will actually take a portion of your salary. I’m not completely sure the amount, but it can be anywhere from about 20% to 40% of your salary, they keep.\n\n**What’s this contract I’m hearing about?**\n\nIn order to join these companies, you have to sign a 12-month to 24-month contract depending on the role. If you are more experienced or the required training for the role is smaller, then you may only need to sign a 12-month rather than an 18-month or 24-month contract. It may also be called a “promissory note” which is the same thing. It may or may not also have to be verified by a notary depending on the contract.\n\n**Fee for breaching the contract:**\n\nRevature: like $35,000 or so ($21k for bootcamp training, $5k for staging)\n\nPyramid Consulting: $20,000 or so but decreases by $200 a week after training\n\nCognixia: used to be $20,000 but now it is $25,000. After 90 days, the 25000 turns to 20000 and then that $20000 is there until the end of the 2 year contract.\n\nIf you are let go for poor performance, you will go through mutual release and not have to pay the fee.\n\n**What is “bench?”**\n\nBench is where you finish training and are waiting for a client project. I’m not really sure about Revature since I didn’t make it to bench, but with Pyramid Consulting/GenSpark, the bench period is two months and with Cognixia, it is 90 days or 180 days. With Cognixia, they can let you go before the 90 or 180 days if you are not performing well on their projects and “Glider” quizzes and assessments. At the end of the bench period, you can be dropped if no client projects are available.\n\n**What’s the pay like during training?**\n\nThe pay varies during training for each company.\n\nRevature – I was onsite in January 2020 for their training in Florida, and they paid somewhere around $8.50 to $8.75 per hour, paid for 40 hours a week. I think after the pandemic they are doing more remote training now, but check newer reviews to find this information.\n\nGenSpark and Cognixia – minimum wage or $10/hour based on your state, whichever one is higher. It’s kind of flawed in my opinion since it is based on state and not city, so you could be living in a major metropolitan area in a cheaper city and the money will not go as far.\n\nGenspark – you will be paid for 40 hours a week all throughout training and also on your time on the “bench”.\n\nCognixia – very complex pay structure as it changes during the phases. It costs $100 to join the training. You have to pay the company through PayPal and you will then get some study material and join the training for the first few weeks (it was 6 weeks for me), they call this phase 1. YOU ARE NOT PAID DURING PHASE 1 but you will still be attending the training sessions. Phase 2 is when you will start getting the $10/hour. In phase 2, you will be doing 30-35 hours a week in training. I was in this phase for 9 weeks. Afterwards, you will be placed on the bench. During bench, your hours will decrease to around 20 hours but I will call this one “Phase 3” where you cannot relax here. In fact, “Phase 3” was more difficult than Phase 2, the reason being that in Phase 3, they were giving me a new project every week and I was expected to complete it. So most people in Phase 3 will be doing more work than in Phase 2 but will be paid for less hours. The worst part of this was when I was fired for poor performance, the manager on the phone called me and said that I was expected to study on weekends and nights apparently. This is what I mean when I say that “phase 3” will be more difficult. She expected me to have an effective rate down from $10/hour to just around $3/hour to try to stay in the program with all the hours I would be studying. Basically, my effective rate of pay would have been as low or even lower than even a Chinese or Mexican factory worker if I had gone through with this. I don’t live with family and pay rent, so no way I would have gone through with this. I need to survive and not starve.\n\nThe paystub structure with Cognixia is kind of confusing here but you will get a Cognixia paystub, while your 401k will be with Collabera. You will be paid by Cognixia though, which is its own company.\n\n**What’s the pay like after training if I get placed?**\n\nYou may get lucky and the client “buys out” your contract. In that case, you are free from working for these staffing companies and you are an actual employee. If this is not the case, then you may be working for the client as a contractor at Revature, GenSpark, Cognixia, etc.\n\nHere are the rates for client projects:\n\nRevature: used to be $50,000/year, decreased to $45,000/year now. You can still get the $50k if you are transferred to a high cost of living area. If you are in Canada then you would be making $36,000/year USD based on my research since Revature has expanded into Canada now. After the first year, it increases to $60,000/year for the 2nd year, third year it will increase again to $75,000/year but you are not under contract anymore after two years, so you are free to leave.\n\nGenSpark: $20+ an hour but they have a lot of remote roles so it’s not really that bad\n\nCognixia: $50,000/year but can be $55,000 or $60,000 for areas with higher cost of living. Two examples are Seattle, WA which is $55k and San Jose, CA which would be $60k\n\nIMPORTANT: These companies may offer you a role directly with their own company to work on a client project during the bench period. You can accept these roles, but you will not get the regular client pay, but it may count toward your contract time (the up to 2 years for the contract). For example, Revature or Cognixia/Ascendion may ask you to work on a company project while you are on the bench. You would still get paid the $10/hr or so that you would normally get while still on the bench and not the elevated rate while on a client project.\n\n**What do I need to get started?**\n\nAssociates or Bachelors degree in a STEM field.\n\nFor Revature, associates in any field but if you don’t have any coding experience, you will likely not make it through the training\n\nI would also recommend a savings of $10,000+ since you will be making minimum wage or near minimum wage for up to 9 months. Now you can get a second job to pay the bills but your performance in the training will likely suffer. This is why I’m recommending saving up an amount that can hold you until the end, where you will either get dropped or join a client. If you are living with family or someone that can support you, this may not be a problem, but for me, I didn’t have enough in my savings so I had to go on food stamps and started giving plasma to survive while working with Cognixia. I then had to get a second job which tanked my performance and they ultimately had to let me go in “Phase 3” (bench) since I was the lowest performer in the training.\n\n**How is the training? Is it fast-paced?**\n\nThe training is very fast-paced. If you haven’t done much programming in the past, you might not make it all the way through.\n\nRevature’s training is extremely fast and often seems disorganized since they can do the switcheroo that I’ve explained earlier, causing you to learn something that you have no experience in. I was in the iOS developer training but I didn’t know that I was going to learn iOS until 4 weeks into the training. I thought that I was doing Java full-stack which was what we were learning originally.\n\nPyramid Consulting/GenSpark was the best in regards to the training but it was mostly because of the good instructor. We were doing some training with a guy from India who has been working in the technology for 15+ years (he was a developer working with Oracle Retail). If someone had a question and asked it but we didn’t have enough time to cover it Monday-Friday, he would set aside a Saturday session for the person(s) that needed help with the material. He didn’t have to do that but he wanted to make sure that everyone was caught up. Also, every so often, he would invite guest speakers from around the world to introduce themselves and talk about the work they are doing and the project they are working on. It was a very engaging class.\n\nCognixia can be hit or miss. You can get an instructor that is not really interested in live teaching so you will have to teach yourself. On the other hand, you can get a good instructor that will focus on what people are struggling on so that everybody is on the same page. After the phase 2 is when the quality goes down as they just bombard you with projects, not giving you time to do your own studies to maybe get a certification or something. I’m not really sure if they do this on purpose because those certifications are coming out of the company’s pocket, by the way, so less people that have time to study for the certifications, the more money the company keeps overall. The weekly projects during “phase 3” are also on a loop, so you will get maybe 5 or 6 projects to work on, so at week 7 for example, you will go back to project 1 and try to implement some improvement over the first time you attempted the project. I got bored of this real quick doing the same projects over and over again so my performance tanked, not only since I was working another job on the side, but I just lost interest.\n\n**What happens if I miss a day of training or have to miss a week or more of training due to sickness, etc.?**\n\nFor all of the companies, if you miss a day, you will most likely be fine.\n\nIf you have to miss a week+ of training, then:\n\nRevature: You will have to drop out of training\n\nGenSpark: the trainer will work with you to get you caught up (now this may be instructor dependent though)\n\nCognixia: unsure\n\n**What happens if my laptop/PC breaks during the training?**\n\nIn some cases, the company will give you/ship you a loaner laptop. GenSpark/Pyramid Consulting was really good about this and shipped the loaner fast to you. For Revature, you can request a loaner as well. For Cognixia, you can be screwed depending on which phase you are on. My primary GPU/iGPU on my laptop failed during “phase 3” with Cognixia, but the instructor didn’t really seem to care and didn’t extend the projects for anyone no matter the circumstances. You would just hope that you have another chance to work on the project in another 5-7 weeks if you don’t get dropped. Fortunately, I was able to run on the dedicated GPU until I shipped my laptop to the repair center and then just borrowed a family member’s computer temporarily.\n\n**Will the trainings be recorded so that I can watch them if I miss a day?**\n\nRevature: no, but the training was in-person for me, not sure about the remote trainees nowadays.\n\nCognixia: Recordings are for internal review only, you will not usually have access, you will have to ask for permission\n\nGenSpark: It may depend on the instructor, but all our daily lectures were recorded and uploaded to Google Drive so that any of the trainees could download them. I think I still have them somewhere. Very helpful if you didn’t even miss that particular day, but still wanted to watch the lectures for review purposes. I would recommend downloading them instead of streaming them.\n\n**Do I have to sign the contract immediately to begin training?**\n\nNo. These companies have various lengths when it comes to signing the contract of when you are “locked in.” You can choose to withdraw from the training before this period expires.\n\nRevature: 2 weeks? I think\n\nCognixia: As mentioned before, to even join the training, you will have to pay the $100, but you can drop before phase 2 with no penalty.\n\nGenSpark: can’t remember\n\n**Do other companies count the training as actual development experience?**\n\nAbsolutely, at least in my case. I had an interview a few months ago (not through Cognixia but on my own) where I had the 7 months of training experience through Revature and GenSpark, and the company I was interviewing with for an SRE position actually considered that 7 months and actually said that it was ok to call it 1 year experience which surprised me.\n\n**Conclusion**\n\nJust wanted to give a view of these three companies and my experience with each of them. GenSpark was my favorite of the three, followed by Cognixia, followed by Revature last. I learned a lot and don’t regret my time with these companies, although I never got any actual client project to work on. I am better at interviews now for sure.\n\nFeel free to leave comments, and if you have any questions about these programs, feel free to ask questions and I will answer to the best of my memories. I feel I had to make this post as I have people looking me up and constantly asking me questions about these companies, and I can just refer them to this post to answer any question they have about these programs. If you find any inaccurate or not up-to-date information about these programs, feel free to let me know and I will edit my post. I am going off by memory here so there may be some inaccuracies here and there.\n\n*wow, I didn’t realize that this post was going to be 3,000 words, but I had a lot to talk about*\n\npeace, good luck to all that want to give these companies a try 😊",
      "subreddit": "cscareerquestions",
      "score": 94,
      "url": "https://reddit.com/r/cscareerquestions/comments/z6152m/review_of_revature_genspark_and_cognixia_what_to/",
      "comments": [
        {
          "body": "Thanks for sharing this. I appreciate how comprehensive the write up is. In your opinion, who would be the best candidate for these kinds of companies? Career switchers who have dabbled with programming? Recent college Grads who are struggling to find a job?",
          "score": 14
        },
        {
          "body": "Was it your impression that those who did not end up getting placement after training were those who lacked the skills? \n\nOr was it more because they simply had no contracts to fill?\n\nAlso any comments on mandatory relocation?",
          "score": 8
        },
        {
          "body": "That fee for leaving is bs and not enforced",
          "score": 14
        },
        {
          "body": "Well done, thanks for sharing. I've always been curious of these types of companies, if it was worth recommending to others at all. I'll share your post and let them decide for themselves",
          "score": 7
        },
        {
          "body": "Hello, thank you for your time you put into making this post. It is well written, and it helps see a glimpse into what it is like joining thier programs. I have three questions I would like to ask regarding Revature if you don't mind me asking.\n\nWhat made you choose Revature?\n\nDuring your time in Revature, did you feel like you got into something you shouldn't have?\n\nDo you believe Revature has good intentions to help people become successful in the tech industry?",
          "score": 5
        },
        {
          "body": "what do you do while you wait to be placed and on the bench? do you have to come in to the office? or can you get another job while waiting? WHat if they don't place you?",
          "score": 3
        }
      ]
    },
    {
      "title": "Is Adidev Technologies legit?",
      "body": "I found a job listing on Indeed and decided to apply since Ive been applying for just about any job in my wheelhouse.\n\nThey seem suspiciously eager to talk to me (if that makes sense) my resume is mostly lacking experience so I expect every interview to be an uphill battle. I’ve had a few red flags raised.\n\n1) They called me unprompted (after I applied) for an initial interview. It was 9AM my time, which was fine, but it’s unusual not to schedule these kinds of calls.\n\n2) The initial interview was more of a questionnaire than an interview. They asked me my desired salary which I found odd, but it may be because they contract employees to other companies, so they have to see if they have a gig that pays correctly.\n\n3) The company has under 20 employees according to Glass Door. This may be fine, idk, but it still concerns me.\n\n4) Their website boasts some really big names, but not specific project examples. According to their website they’ve worked with American Airlines, Apple, Chase, Direct TV, Hertz, PayPal &amp; Porsche. However, they don’t say what they did with those companies.\n\n5) They want me to do a technical test with strong restrictions. Webcam always on, No other browsers, no copy paste ability. I understand they’re trying to gauge your abilities, but I Google some pretty simple syntax sometimes. Programming is as much about knowing what to know and how to find the answer than just memorizing solutions to non-real world problems.\n\n6) I’ve been trying to think of a non-offensive way to say this one, and I don’t mean it negatively, but the only person I’ve talked to so far had a strong Indian accent. That could obviously be completely normal, but India unfortunately also has a large amount of scammers online.\n\nYou may be thinking, why not just ignore them and move on, but this is the first job in weeks that has been hiring junior/mid-level programmers in my area. Literally everything else is Senior or full stack engineers which I just am not and won’t pretend to be.\n\nWhat are y’all’s thoughts?\n\nEdit: a year later this post is getting a bunch of comments saying they’re legitimate. That may be true, but it’s a bit fishy that all these comments except for one come from accounts with no other posts or comments. If I were to guess, Adidev saw this post when they searched their name in the sub and are doing some damage control. Doesn’t mean the comments are lying, but it is odd so take it with a grain of salt. Anyway, I am happily employed with another company :)",
      "subreddit": "cscareerquestions",
      "score": 16,
      "url": "https://reddit.com/r/cscareerquestions/comments/i4eblb/is_adidev_technologies_legit/",
      "comments": [
        {
          "body": "I googled them, and their headquarters look like a house in Georgia?  Which doesn't mean its not legit, but it seems like it at best has a horrible work culture.  I don't know about a scam, but nothing you listed makes me want to work for them at any rate, and I've done a lot of CS interviews.",
          "score": 8
        },
        {
          "body": "It's legit, I actually work for them as an Android dev at Verizon. I had no degree or experience, just open sourced pet projects and some Google certificate. These guys were the only ones that took a chance on me, every other place I applied to didn't work out or they just ghosted me. I remember once I was on boarded they assigned some Senior Developer from their technical team to train me, mostly to fill in the gaps of my knowledge since I'm self taught. They used my personal experience to create a resume and introduced me to their clients, which got me my job at Verizon in a couple of months. Anyways, I know how hard it is to land your first few jobs as a developer so feel free to ask any questions.",
          "score": 4
        },
        {
          "body": "I saw this post and I had to chime in.  I get it, Adidev comes off as sketch, I felt the same way, and I actually just went on with them because they gave me a shot and I know I needed one after multiple failed interviews. After joining them, I went through apps evaluations and trainings with them for first few weeks. Despite the sudden impact of the pandemic, I ended up meeting with a lot of clients, getting a lot of technical training in the process from the tech team they have, and I ended up getting a position in Minnesota, which is where I am now.  I totally get that some people could get weirded out at the start, but I'll be honest, I feel like I took a gamble and it paid off. Life is like that, sometimes. There hasn’t been a reward that I’ve gotten, whether it be from a Raid encounter or a job opportunity, that wasn’t obtained by a degree of risk.\n\n  \nEveryone is going to do what thou wilt, but my experience with Adidev was a good one, considering they got me the job I have right now.  The CEO of the company was even willing to help me out when I was going through a tough time. And it IS STILL tough. Seeing my family fight through terminal illnesses in a pandemic made shit real for me. It made me consider doing things I would have scoffed at, with punitive ease.\n\n  \nTo describe Adidev, it’s kind of like a taco truck or, if you’re a Destiny fan like me, a Legendary Engram you got off some strike mission - none of it really looks like much, but some of them are worth more than what you see on the surface.  In the end, you have to let go and listen to your instincts, and mine led me to take a gamble and I hate gambles, but it paid off.   From someone that went through the entire process and landed a good gig as an iOS developer, there are some things I would improve about them, but they delivered results beyond what I was expecting.\n\n  \nJust my two cents.",
          "score": 2
        },
        {
          "body": "Adidev Technologies is a legitimate consulting company from which I worked on several contract job opportunities during the course of several years.",
          "score": 2
        },
        {
          "body": "I'm going through the interview process now. Did the recruiter interview, the video interview, and the tech interview. I have another interview with one of the managers tomorrow. Did you ever get hired here?",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Java Backend || PayPal interview",
      "body": "\n\nRound 1 - Hackerank round (1 DSA + 1 Java based)\nRound 2 - DS/Algo - 1 coding question was hard, it is leetcode Hard\nRound 3 - System design round - completed today(28 July 2025)\n\nCan anyone tell how long will it take to get the feedback for this round.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1mbd8np/java_backend_paypal_interview/",
      "comments": []
    },
    {
      "title": "Paypal not replying me after my interview and recruiter is not replying me too. What should I do?",
      "body": "I have an interview with Paypal last week. IMO the interview went well and I had a great conversation with the software engineer talking about my side project and past co-op experience. Now, it's almost a week but I haven't get any response from them. I have already sent a follow up email to the recruiter but I didn't get any reply from her either. Anybody has a similar issue like me with Paypal?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/43b186/paypal_not_replying_me_after_my_interview_and/",
      "comments": [
        {
          "body": "call them",
          "score": 2
        },
        {
          "body": "I've called the recruiter numerous times but it keep getting into the voicemail. I've no idea what should I do right now...",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "What Does A Paypal Internship Interview Looks Like?",
      "body": "I just scheduled an interview with Paypal and the Site Reliability Engineering team will be interviewing me. Anybody has any experience with Paypal interview? Is it more like Google/FB (pure algorithm and some language-related problems) or is it something else? The interview is just 30 minutes and HR told me that I should be focusing on the job description. According to the job description, they are expecting somebody who knows JAVA, Javascript, and NodeJS. Should I review all these language features or algorithmic problems? I did put NodeJs skill on my resume but I'm just self learning with learnyounode. Are they expecting my NodeJs to be really good?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/3y7ekt/what_does_a_paypal_internship_interview_looks_like/",
      "comments": [
        {
          "body": "Well you should expect them to assume you can use node.js without trouble. Why putting it on your resume otherwise? If you are still learning it you should mention that on your resume. ",
          "score": 2
        },
        {
          "body": "http://www.geeksforgeeks.org/tag/paypal/",
          "score": 1
        }
      ]
    },
    {
      "title": "Any tips for final Skype-interview with Paypal?",
      "body": "* I am currently in the interview process for the **'Recent Graduate Application Engineer'** position in the **Alternative Payments team at PayPal.**\n\n* My recruiter tells me that I have just one final round of Skype interviews left which will be 2 hours long and be with the team members.\n\n* To prepare for this final round, I am doing/have done the following:\n    * Looking at PayPal's Github at their Kraken.js project and trying to get a simple CRUD app running on it.\n    * Preparing for behavioral questions like 'Tell me about a time when...' and 'Why Paypal? Why you?'\n\n* Do you have any other tips for me? Any obvious do's/don'ts or anything else that might help.\n* What sort of technical questions can I expect here?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/4szv5e/any_tips_for_final_skypeinterview_with_paypal/",
      "comments": [
        {
          "body": "Wear clothes and be well groomed from the waist up?\n\nThat's a joke of course, but there's a small bit of truth there.  Treat this like you would an in-person interview.  Dress the way you would for an in-person, communicate like you were in the room with them and maybe set up your computer in a well lit and clean space with very neutral art on the walls (just to give the impression that you aren't a slob or someone with a penchant for some type of art people might find offensive).",
          "score": 2
        }
      ]
    },
    {
      "title": "turing.com is scam or real? Entire app take-home?",
      "body": "(re-posting due to typo error in title... sorry)\n\n&amp;#x200B;\n\nHas anyone tried [turing.com](https://turing.com)?\n\nA few days ago, I applied to their mobile developer role, and in their interview process, they asked me to finish a take-home assignment. The assignment is building an entire mobile app which is consist of 9 screens that are full of interactions and PayPal payment. Size of assignment non-sense (requires days to weeks) and they also told me that PayPal transaction feature MUST work correctly. It seems like I am doing their work for free. More interestingly, in the Sketch files, all screens have \"[storexapp.com](https://storex.com)\" email address everywhere. I found an actual business presence ([https://angel.co/storex/jobs](https://angel.co/storex/jobs)) with same logo and newly registered domain (on 2019-04-26).\n\n&amp;#x200B;\n\nI don't mind take-home assignment, but I think it should be &lt;1day amount at maximum and fully useless toy app. But this one is way beyond the line especially for requiring working PayPal transaction implementation.",
      "subreddit": "cscareerquestions",
      "score": 79,
      "url": "https://reddit.com/r/cscareerquestions/comments/bkjsbh/turingcom_is_scam_or_real_entire_app_takehome/",
      "comments": [
        {
          "body": "Their shit site doesn't work without third-party javascript enabled so you're doing yourself a favor by not working there.",
          "score": 28
        },
        {
          "body": "Don't do it. Sounds like an obvious scam.",
          "score": 21
        },
        {
          "body": "It doesn't really matter if it's a scam or not. That's just too much work. If that is a requirement for getting a job they should pay you for your time.",
          "score": 17
        },
        {
          "body": "Hey, I'm Akshay from Turing. First, to answer the short question, Turing.com is a real, Silicon Valley company that connects experienced developers with world-class organizations. As a deep jobs platform, Turing democratizes opportunities and enables talented remote developers to work with top US and Silicon Valley companies.\n\nTuring is backed by top Silicon Valley investors such as WestBridge Capital, Foundation Capital, Founders Fund (investors in Facebook, Tesla, Asana), Altair Capital, Mindset Ventures, Frontier Ventures, Gaingels, Facebook’s first CTO &amp; CEO of Quora (Adam D’Angelo), and illustrious executives from Google, Amazon, and Twitter.\n\nMost of the concerns I can see in this thread are from almost 2 years back. So, I would like to clear something up. Turing was founded in 2018 and like every new-born start up, we were working with a handful of people and had a few gaps in our processes. Since then, we've grown by leaps and bounds, we've learned a lot and, along the way, we've helped a lot of software developers get their dream job. Now, we're at a stage where we are an established organization with over 1 Million developers and 200+ clients.\n\nTuring.com never charges developers, period. At Turing, every engineer is allowed to set his/her rate. However, Turing will recommend a salary at which we know we can find a fruitful and long-term opportunity for you. Our recommendations are based on our assessment of market conditions and the demand that we see from our customers.\n\nP.S. If you have any query related to Turing or you need any kind of assistance, feel free to reach out to me through dms.",
          "score": 10
        },
        {
          "body": "Lmao on the sample code question on their homepage no matter what answer you give it takes you to the sign up screen, even \"I don't know programming\"",
          "score": 10
        },
        {
          "body": "they sent me an email after i sign up, revealing an internal email of the company from one employee telling other employee saying that my resume looks good (it actually doesnt) and ask the other employee to tell me to hurry up and take the coding test.\n\nI immediately felt fishy... its pretty unprofessional to leak company's internal email to outsiders.",
          "score": 10
        },
        {
          "body": "Lol wth. Trash company. They only hire people who like to be walked on like doormats and taken advantage of. Avoid!",
          "score": 7
        }
      ]
    },
    {
      "title": "Is Leet-code a day for half a year to a year enough to help me get a high TC job?",
      "body": "Currently a 23 year old new grad and I have a fully remote software developer position paying $90k CAD (and I live with my parents still). \n\nHowever, I want to work in the US next year and I want higher TC (high for me would be $130k minimum). \n\nI’m not picky for FAANG (even Capital One or PayPal for instance would be good enough). \n\nI’m going through the Neetcode 150 list and trying to understand all questions (quality over quantity — so I make notes and look back at them) but I honestly can’t do more than 1-2 a day without getting annoyed. \n\nIf I do 1 a day for a year, should I be okay with Leetcode skills to interview for those higher paying companies?\n\nEDIT: I’d want to work remotely in the US as well. Companies forcing me in office would probably turn me off.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/wc35b3/is_leetcode_a_day_for_half_a_year_to_a_year/",
      "comments": [
        {
          "body": "Leetcode a day for 2 months got me a 40% raise. If you're doing it properly for a whole year, you should be very comfortable with coding interviews.",
          "score": 31
        },
        {
          "body": "Getting good at leetcodes easy. Redo an advanced DSA course and code a little bit of leetcode everyday and you’ll be good to go imo. I specially if you’re already a cs grad. I think the most important skill is a little bit of coding everyday",
          "score": 12
        },
        {
          "body": "That kind of investment would significantly improve your coding skill. It likely will help you with a high TC job.\n\nIt is an unpopular opinion here but there is a lot of value in producing correct code quickly.\n\nBut remember you will need to meet the standard on other aspects as well like ya know being able to hold a simple convo like a normal human.",
          "score": 7
        },
        {
          "body": "Leetcode is necessary but not sufficient.",
          "score": 7
        },
        {
          "body": "90k cad remote &gt;&gt;&gt; 130k in NY/SF",
          "score": 25
        },
        {
          "body": "Yes, doing 1-2 problems a day maximum for a year you should be well prepared for coding interviews by next year. I would not recommend spending no more than 45 minutes to 1 hour on any problem regardless of level, if you can’t solve it on your own look at the solution on the Neetcode YT channel, don’t just copypasta his code make sure you understand how and why the solution works.",
          "score": 4
        },
        {
          "body": "Depends, to be honest. I have done 950 leetcode problems and I'm not fully sure I could pass a FAANG interview. There is some nasty medium level question that can be asked.\n\nNeetcode list also does not cover a lot of ideas that might come up. For example, you can get some hard DPs. Some hard back tracking questions.\n\nTo catch me, you would have to do a lot of work. I'm part of a discord called Learning with Larry Leetcode and people their are much better than me.",
          "score": 6
        },
        {
          "body": "Better to start at 1 a day than none at all. Also, make sure that your resume is up to date (have people review it), and brush up on behavioral questions (do not underestimate them).",
          "score": 2
        }
      ]
    },
    {
      "title": "Can an employer ask for an \"interview deposit\" before I get to go to an interview?",
      "body": "I'm going to an interview for a company next week, but they have asked me to send them a deposit of 10£ over paypal within the next 24 hours in order for me to keep this spot. Has anyone else had this experience? I have never heard of this before, and it feels a little bit weird.",
      "subreddit": "jobs",
      "score": 21,
      "url": "https://reddit.com/r/jobs/comments/7w60fe/can_an_employer_ask_for_an_interview_deposit/",
      "comments": [
        {
          "body": "Run screaming in the other direction. This is not a legitimate company.",
          "score": 105
        },
        {
          "body": "LOL this is a total scam. Do not engage.",
          "score": 30
        },
        {
          "body": "Obvious scam. ",
          "score": 14
        },
        {
          "body": "On a side note, even if it were a 100% legit company. If they wanted to people to pay for the privilege to let them interview. Imagine what they must treat there employees like. You wouldn’t want to work their anyways.\n\nThat said run away it’s a fake.",
          "score": 13
        },
        {
          "body": "heck no",
          "score": 9
        },
        {
          "body": "I have never heard of that either... You might be better off not taking the interview since this seems shady",
          "score": 8
        },
        {
          "body": "[deleted]",
          "score": 7
        },
        {
          "body": "[deleted]",
          "score": 6
        },
        {
          "body": "This is fake. Have paypal you money for the time you will be interviewing before you will show up. Then don't show up anyway.\n\n",
          "score": 6
        }
      ]
    },
    {
      "title": "Can anyone share the resume that got a phone screen /interview for an internship at one of the big 5?",
      "body": "Hey all,\nI want to do the microsoft internship program for SDE's for next summer, or maybe the coming fall, and I was wondering if anyone that got an interview for this or any other of hte big 5 companies could share their resume (the one that got them the interview, may be different from your current resume). Thanks!",
      "subreddit": "cscareerquestions",
      "score": 45,
      "url": "https://reddit.com/r/cscareerquestions/comments/27knm9/can_anyone_share_the_resume_that_got_a_phone/",
      "comments": [
        {
          "body": "[I posted the following a couple weeks back](http://www.reddit.com/r/cscareerquestions/comments/25u0eo/could_we_create_a_basic_undergrad_resume/chktg4y) in response to /u/Irremotus_MT, believe it or not:\n\n&gt;...\n\n&gt;I figured I'd post mine: http://i.imgur.com/DaF8rIf.png\n\n&gt;This is a somewhat redacted copy of the resume I used to apply for internships in the fall of 2013. I ended up making it to the final rounds of Microsoft (no offer) and the host matching phase of Google (took another offer) along with offers from smaller companies and a return offer from Intel.\n\n&gt;I was also contacted by Google for a full time position and did an on-site interview in March with a similar (more updated) resume - still the same format overall.\n\n&gt;...\n\nAnother relevant post about GPA/transcripts from the fall:\n\n&gt;[I got through the final round at Google with a cumm. 2.9 GPA. You'll do fine since you have prior internships.](http://www.reddit.com/r/cscareerquestions/comments/1uvxux/how_important_is_gpa_for_the_big_4/cem83lz)\n\n&gt;&gt;[I should also add that before I got phone interviews I had to submit my transcript which had 3 course withdrawals on it. They didn't even ask about them.](http://www.reddit.com/r/cscareerquestions/comments/1uvxux/how_important_is_gpa_for_the_big_4/cem98g0?context=1)",
          "score": 12
        },
        {
          "body": "[deleted]",
          "score": 29
        }
      ]
    },
    {
      "title": "Hiring timeline for new grad positions in major companies.",
      "body": "I wanted to learn about the hiring practices of major companies(FB, Goog, Amazon, Bloomberg, Uber, Paypal, Palantir, Microsoft) for new grad(2016/2017) opening.Will they finish their hiring spree by December or will they keep hiring all year long?",
      "subreddit": "cscareerquestions",
      "score": 38,
      "url": "https://reddit.com/r/cscareerquestions/comments/56mjvm/hiring_timeline_for_new_grad_positions_in_major/",
      "comments": [
        {
          "body": "Generally the larger companies will keep hiring for new grads, but positions fill up in various offices, e.g. Google NYC is done.",
          "score": 20
        },
        {
          "body": "Year-round. \n\nThere's a misunderstanding about what \"new grad position\" really means: it's not a special designation for a special job. It's a specialized *recruiting pipeline* used to fill generic entry-level SWE jobs. Think of it as a batch job of sorts.\n\nFrom a management and resourcing perspective, what really makes a \"new grad\" different is timeline--you're looking to hire (lock in) somebody who won't start or be available for several months to as long as a year...and from a recruiting perspective, candidates with zero real experience tend to behave differently than those who have been in the industry a few years, so it's beneficial to tailor the recruiting process to their expectations. \n\nAll of this requires additional forecasting and long term planning/budgeting, so what most companies do is put university candidates into their own hiring pipeline (company-wide or at least org-wide) and handle team allocations much later as appropriate. However, most larger companies are *always* hiring on generic SWE reqs of all levels--the difference to you is that you'll go through a hiring process more or less identical to the ones that experienced candidates go through.",
          "score": 18
        },
        {
          "body": "I'm in the middle of the timeline for google (flying out for on-site soon), so far it's been really quick. My recruiter said it's about 6-8 weeks from first contact to offer and so far that seems right on point.",
          "score": 5
        },
        {
          "body": "Yes, for instance google New York has already filled up. LinkedIn has essentially finished their new grad hiring already as well. Since many return full time offers from internships have deadlines in late October or November, that's typically when a bunch of decisions are finalized and companies finish.",
          "score": 3
        },
        {
          "body": "Most of the processes started Late August / Early September. It seems unlikely that there will be many positions open past December",
          "score": 3
        },
        {
          "body": "Is this different in Europe or pretty much the same? ",
          "score": 2
        },
        {
          "body": "Also a new Grad can join after May. What about other companies when do they start or stop hiring for full time employees. While looking for intern positions I missed out on a lot of companies because I was too late",
          "score": 2
        }
      ]
    },
    {
      "title": "Daily Chat Thread - May 08, 2017",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).\n",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/69wkvg/daily_chat_thread_may_08_2017/",
      "comments": [
        {
          "body": "I have a question: \nBackstory: \nI was thinking of going to game development but I noticed a lot of cons about it. I'm currently in grade 10 high school. I love video games and I find programming to be fun (I'm still very new) but many people say it's bad and I'm having second thoughts about it and thinking if it's the right choice and the odds of actually being successful. I know I'll possible get lots of hate for posting this but please help.\n\nActual question(s):\n* Should I stick to game development or learn something else in other fields in computer science? \n\n*will it be easy to switch from game dev to something else like information security or software programming?",
          "score": 2
        },
        {
          "body": "Anyone know a good spot to do a coding / phone interview from in SF?\n\nI'm traveling for interviews this week and looking for a semi-quiet place w/ speedy wifi to do an interview.",
          "score": 1
        },
        {
          "body": "Any fall internships open yet?",
          "score": 2
        },
        {
          "body": "Someone I know graduated from a bootcamp. It took her 4 months to go from not knowing how to write a for-loop to getting a software engineer job. 4 months to call herself a \"software engineer.\" It took me 4 years to get a CS degree. I can't find any job. WTF is wrong with the world?",
          "score": 3
        },
        {
          "body": "Did my video interview with Amazon. That was ridiculously chill.",
          "score": 4
        },
        {
          "body": "Hi everyone, I just got offers from Apple and PayPal. I don't like the position at Apple much (it's more like QA/Automation) whereas I really like the Front-End position at PayPal. But Apple will look better on my resume than PayPal. So I don't really know what to pick. And I also prefer Apple to PayPal as a company. I'm just wondering how easy to switch teams once you start working for Apple? Thanks!",
          "score": 2
        }
      ]
    },
    {
      "title": "First Tech Screen Suggestions",
      "body": "I have a tech screening with PayPal, through hackerrank due by the first of July.  Obviously I want to study before I take the assessment, but I'm unsure as to what exactly I need to study.\n\nThe screening says for a \"Checkout Front-End\", so I was planning to study and build a checkout API using the front end, but I always read about LC questions with bigger companies. \n\nShould I study up on LC? Or just keep practicing with PayPal's API and build things involving that? \n\nThis is probably my third assessment overall as a new developer and it's a big one, at least for me. Any help or advice would be greatly appreciated!  \n\nThank you!",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/vfi0c6/first_tech_screen_suggestions/",
      "comments": [
        {
          "body": "Leetcode and the like. Do hackerrank questions to get an idea of how to provide your outputs. Sometimes its via the console, other times it’s via returns. I did a PayPal assessment last month and the questions weren’t too bad. All LC style though",
          "score": 4
        },
        {
          "body": "Hello! I also received an assessment of the same vein from PayPal. I looked on Glassdoor and someone said they were given system design questions. Here’s the website for reference: https://www.glassdoor.com/Interview/PayPal-Front-End-Developer-Interview-Questions-EI_IE9848.0,6_KO7,26.htm",
          "score": 2
        },
        {
          "body": "I just finished that exact same tech screening for that same position on hackerrank, it was super easy. Just entry level stuff! It’s only two questions. If you know how to make a to do list, you should be able to answer both questions fine. The first question for me was react related, second question was editing and returning values from an array. Good luck",
          "score": 2
        },
        {
          "body": "You should at LEAST do leetcode easys and maybe a few of the most common mediums.",
          "score": 1
        },
        {
          "body": "do leetcode mediums primarily.Google the question, OA, company name + OA etc, to see if you can find the question bank in advance.Check [indeed.com](https://indeed.com) / glassdoor for sample interview questions",
          "score": 1
        }
      ]
    },
    {
      "title": "Just got a job offer, don't have tax records to prove experience",
      "body": "I graduated in May and just got a formal offer through a recruiting company. I put on my resumé that I have 5 years work exp. working as a freelance back-end web developer, and now they want to verify this with tax documents. Problem is this freelancing work is just something I did when I could while going through school.  I didn't charge what my services were actually worth, worked with low budget clients and didn't really make enough to necessitate paying taxes. All I have are sporadic PayPal payments at various points through the past \\~5 years. I passed the technical interview and am very confident that I'm qualified... But how do I deal with this? Will these measly PayPal records count as \"proof\", or is this something that could potentially lead to the offer being rescinded because I may have misrepresented myself, etc. Thanks for any help guys.",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/pgan6j/just_got_a_job_offer_dont_have_tax_records_to/",
      "comments": [
        {
          "body": "First off, you should black out any $ amounts on tax/employment records. They are trying to verify your work history, not how much you made.\n\nIf they knew this was was part-time work while in school, you should be fine, just explain it to HR/Recruiter/etc.\n\nIf you made it appear to be full time work and you are coming in as an experienced dev, their could be some issues. \n\n\nBest bet, either way, just be upfront and honest at this point.",
          "score": 7
        },
        {
          "body": "&gt; Problem is this freelancing work is just something I did when I could while going through school. \n\nTo me.... this doesn't sound like five years of experience. If you write \"five years of experience\" I would expect that to mean roughly \"five years of full time paid work\" rather than \"over the course of five years, I did some stuff on the side and barely charged money\". \n\nI think you should be honest about the nature of the work with the company and then work out what documentation you need.",
          "score": 3
        },
        {
          "body": "Just tell them you were exempt from filing taxes. Maybe don't say the part about the low earnings.\n\nIf they still care, they'll figure out another way you can prove you were doing freelance work.",
          "score": 2
        },
        {
          "body": "I realize this may not be an option, but personally I would just refuse to work somewhere that required me to prove that I was being truthful. It doesn't bode well for a culture of trust.",
          "score": -1
        },
        {
          "body": "“Tax records” are tax forms, like 1040s and 1099s, not PayPal receipts. Did you pay income tax on this money or not?",
          "score": 1
        }
      ]
    },
    {
      "title": "Is the pandemic halting new Graduate Job Applications?",
      "body": "Hello,\n\nI recently graduated in December 2020. I've been having no luck with job applications for the past 10 months. I have applied to multiple companies prior to the start of the pandemic, with interviews from those applications. I was even scheduled to meet on-site a week into the official Covid lockdown, which was canceled and ended up not hearing back, obviously since they had issues they were resolving. At the time I was a Software Engineer Intern at an Auto Company, which they too had issues to resolve because of the pandemic, which ended up canceling all internships. \n\nI got offered to come back to work remotely in October 2020. However, I've been applying for jobs non-stop as I've stated earlier. I have multiple personal, academic, and freelancing experiences on my resume ranging from Full-Stack Development to Emulation to leading a Senior Design project. I also have 1 Year of experience as a Software Engineering Intern and (**so far**) 3 months of experience as a Full-Time Software Engineer. I want some peace of mind as to whether I'm the only one having this issue or is it due to actually being the pandemic that is limiting these opportunities. I'm questioning if it's my resume or experience because the positions I'm applying for are in fact recently posted and actively hiring.\n\n# Relevant Application Information\nApplications applied for were in-state and out of state. I have also reviewed my resume throughout the following date range below through my school's career services.\n\n**Total Applications:** ~65\n\n**Date Range**: October 2020 - January 2021\n\n**Companies Applied for:**\n- TechSmith\n- Dynatrace\n- General Electric\n- GitHub\n- Cisco\n- Dropbox\n- Adobe\n- NextDoor\n- VMWare\n- Amazon\n- JWPlayer\n- Ascent Cloud\n- Higher Logic\n- Influx Data\n- Credibly\n- Handy\n- Censys\n- KLA\n- Synergy Interactive\n- SemitaRx\n- Twitch\n- AdmitHub\n- Slack\n- Hulu\n- Lucid\n- IBM\n- Microsoft\n- Ebay\n- PayPal\n- SpaceX\n- Pixar Animation Studios\n- Walt Disney Studios\n- NVIDIA\n- SAP",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/kzwz8u/is_the_pandemic_halting_new_graduate_job/",
      "comments": [
        {
          "body": "Apply for smaller company",
          "score": 8
        },
        {
          "body": "You could check your resume here and find out if it's your resume or not.  You could also give us relevant details, like how many applications and where.  What are people thinking when they come here asking for help and don't include this info?",
          "score": 5
        }
      ]
    },
    {
      "title": "experiences with affirm?",
      "body": "would love to hear from people who have interviewed on-site or interned! seems really lowkey but I admire the CEO, one of the PayPal Mafia a lot and my interactions with engineers have been great.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/avmls3/experiences_with_affirm/",
      "comments": [
        {
          "body": "I interned at Affirm in spring of 2018. Overall I had a really good experience and felt that I learned a lot from the people I worked with, and the engineers I interacted with were friendly to boot. I still keep in touch with many of them as friends. A lot of good engineering talent at the company, and good company culture that goes beyond just the perks. A lot of emphasis on learning and development too (there's a quarterly book stipend and opportunities to attend presentations about how different parts of the company works, for example). Overall recommend.\n\n&amp;#x200B;\n\nLevchin is sort of a celebrity CEO, but of course don't let that stop you on doing your own due diligence about the product, your thoughts about future outlook, and engineering at the company.",
          "score": 9
        },
        {
          "body": "Affirm is great. On most teams it's a good introduction to the intersection of personal finance and tech. People are pretty friendly and smart. Nice office. It is growing pretty quickly, so if you interned there you would get to see the good/bad/pains of that.",
          "score": 4
        },
        {
          "body": "Feels like they've been around for several years now, but aren't gaining much traction.",
          "score": -1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Help with PayPal job process",
      "body": "So In PayPal I had interviews for software engineer backend role. There were totally 4 rounds and I cleared all of them still they made me redo round 3 to test more. After that HR called and told to update my experience to 2.5 years in resume and send so it can be submitted to manager. Now for a week it’s silence. \n\nI was serving notice period and it got finished and joined new org but still I can join in a month. PayPal HR knows my LWD after that the silence going.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1pcd0uv/help_with_paypal_job_process/",
      "comments": []
    },
    {
      "title": "Reluctantly accepted an offer from PayPal with low pay, what Next?",
      "body": "I was unemployed since 1.5 years now due to abrupt layoff from a SAAS company I was working on \"X\" Salary layoff wasn;t due to performance issue though, company has habit of laying off \n\nI worked coupled of jobs for say 3 day and 1.5 months respectively in the unemployed tenure of 1.5 years I left then and there I did not liked toxic work culture and I back my decision till date as my mental peace is extremely important to me post abrupt layoff.\n\nWas interviewed by Paypal last year 3 rounds just to be told that I am not from payments industry at end of 3rd round (wired) \n\nCouple of weeks ago suddenly got call from Paypal recruiter for interviews - I raised about last ti e how it went \n\nAgain gave 3 more rounds of interview - this time selected but what they did was nothing less than rediculous\n\n-  BAse poay 15% lesser than last drawn (I am at all not happy about this one)\n\n-  Aggressive Variable (Hey I am in sales, but variable is variable) \n\n- No negotiation on Base Pay\n\n- Recruiter sent Letter Of Intent not offer LEtter with someones else's name !! Yes you rea that right\n\nI wasn't hapopyw ith anyof this,  I was only given 19 hours toa cceot this offer or offer lapses, I reluctantly accepted this offer for now, Not excited ,feeling cheated What next? \n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1crn2oj/reluctantly_accepted_an_offer_from_paypal_with/",
      "comments": [
        {
          "body": "Take it and keep interviewing. A job and a salary will give you mental room to be able to interview for other companies.",
          "score": 5
        },
        {
          "body": "Keep interviewing on the side of course",
          "score": 5
        }
      ]
    },
    {
      "title": "Lost my passport and don’t have any other identification other than SS",
      "body": "As title says, I can’t find my passport and I have an interview in a couple hours. Can I ask my employer to bring it at another time or orientation or will that make me lose my chances to get the job? I’m 17yo and just moved which is why I don’t have a drivers license or a school record at the moment.",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/x1kdya/lost_my_passport_and_dont_have_any_other/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I have never been asked for ID for an interview, nor have I asked for it. There are laws protecting age discrimination etc in this hiring process. Until an offer is given it shouldn't be an issue in the US.",
          "score": 13
        },
        {
          "body": "Assuming you're in the US, at some point you will need to prove your identity and that you're either a US citizen or have the legal right to work in that position. \n\nAs long as you can provide the correct documents to HR before your start date, it shouldn't be a huge deal if you can't locate them immediately.  You shouldn't need them for an interview anyway, but you will need them afterwards when you accept a job offer.  If you can't find it, your parents should help you get a photo ID from a DMV as soon as possible.  Check and see what your state requires, you probably also need to locate your birth certificate.  You could also renew your passport or request a replacement, but that usually takes several weeks.\n\nJust FYI, in the future I would recommend keeping your birth certificate, social security card, passport, and any other legal documents like marriage/divorce papers in a specific briefcase, portfolio, safe, or other container.  You always want to be able to locate these immediately, and also be able to grab them in an emergency situation.",
          "score": 6
        },
        {
          "body": "I work in HR &amp; have personally done several interviews in my 32 years on life. I have never once been asked for identification on the interview unless I am needing it to sign into a secured building.",
          "score": 3
        },
        {
          "body": "You'll be fine for the interview but you need to quickly figure out the document situation in case you get a job offer",
          "score": 2
        }
      ]
    },
    {
      "title": "Daily Chat Thread - February 09, 2016",
      "body": "Please use this thread to chat and have casual discussions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight**.\n",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/44v337/daily_chat_thread_february_09_2016/",
      "comments": [
        {
          "body": "what's you guys' take on this? https://twitter.com/djcapelis/status/696869166960095232",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "Does anyone have any suggestions on increasing communication on a project? I'm the lowest man on the totem pole on a project with seven teams \"collaborating.\" I've been living the scene in Office Space where Peter says he hears about his screwups from his 8 bosses. Any time something goes wrong that I don't know about that's outside my powers to help with, I generally have at least 3 managers asking me about it and telling me to fix it. It's really starting to wear down my patience.\n\nIs there any hope of improving this situation? Or do I just abandon ship?\n\nBeing at the bottom also means it's also hard to get buy-in from everyone else on things like holding a weekly status meeting. My boss seems to expect me to know if everyone working on this project has any problems at any given moment even if it means making the rounds to every single person's desk a few times throughout the day and ask, \"So, any problems I don't know about?\"",
          "score": 3
        },
        {
          "body": "Former J1 interns: How did you handle taxes when you were back in your home country?",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "I received an internship offer for roughly $20/hr. Is this low? This is in SoCal. This would be my first internship as a 3rd year and I lack experience. I have 2 interviews in the following days (only phone screens), and I have to respond to them quickly. \ntl;dr first offer ever. Not sure if low, if I should wait, or just accept, etc.",
          "score": 2
        }
      ]
    },
    {
      "title": "Possibly Ghosted by Company",
      "body": "Hi everyone I interviewed at Paypal about 3 weeks ago. My interviewer was a senior software engineer and I thought that the interview had gone fairly well. I was told that I would get a response back within a week. It's been a little over 3 weeks since that interview. I've reached out to my recruiter about 3 times and I've never gotten a reply back.  My question is when do we know when a company has fulled ghosted you? How should you handle being ghosted? Is there anything I can do to get a response besides just waiting?  I just want some closure because I had such a great time interviewing (it was honestly such a fun interview) and I thought the energy was reciprocated.  Thanks everyone!",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/rzagfi/possibly_ghosted_by_company/",
      "comments": [
        {
          "body": "You never really know if they have actually ghosted you or if they are just running behind. Its even possible that they liked you but thought you would be better in another position so they have to switch a bunch of stuff around. Who knows. I once got \"ghosted\" for 2 months only to find that they lost my information and wanted me to go through part of the process again. Got the internship in the end. The whole system is a mess. Just don't count on anything from them and keep applying elsewhere.",
          "score": 3
        },
        {
          "body": "I was told I would hear back from a job in a week and got an offer 5 weeks later. Its so hard to know.",
          "score": 3
        },
        {
          "body": "After 3 weeks I'd say you've been ghosted. Especially if you followed up and got nothing back.",
          "score": 2
        },
        {
          "body": "Yes, keep applying is the best solution. Doing nothing, waiting and maybe get a rejection 3 months later (happened to me) is not an option",
          "score": 2
        },
        {
          "body": "Maybe just delayed because of the holidays? I've seen that before. Check in again with your contact(s) there and be sure to tell them you:\n1. Are waiting on THEM to get back to you.\n2. Ask when you will get regular updates on progress (which you or they should have clarified during the process prior to this).\n\nThese are both reasonable things to say if said politely and professionally. \n\n\nThen keep on looking for other opportunities.",
          "score": 2
        },
        {
          "body": "I am still receiving rejection letters from applications I sent out on August 2020.... as entry level without experience you will get ghosted on 95% of your applications. They don't even have the decency to respectfully reject people.",
          "score": 2
        }
      ]
    },
    {
      "title": "If I sign a contract, is it a done deal?",
      "body": "I signed a contract to start working in April. I still have to do the visa stuff because I'm a foreigner. Do you think either the visa or anything else can make the job offer cancelled even after I signed the contract etc? Or is that very unlikely?\n\nFor example, are the background checks / credit check / w.e (not that I expect to have any problem at all) etc? Or them finding someone better or having some sort of change of policy or so, are any of these plausible?\n\nI ask because there are some companies I interview at, which I'm interested in if this job offer fails, but don't want to waste their time if it's done with as I signed the contract.\n\nEdit:  The job is a fulltime job (not contractor job) in a big company (e.g linked in / paypal) in the UK. I come from a tier 4 student visa and I don't know why they would not approve my tier 2 visa (especially considering they approved my student visa 2.5 years ago). ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/lnqjjw/if_i_sign_a_contract_is_it_a_done_deal/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "What does the contract itself say?",
          "score": 1
        },
        {
          "body": "&gt;in the UK\n  \n/r/cscareerquestionsEU \n  \nfrom what I know, UK's labor laws works a little bit differently than US's, mainly there's really no \"contracts\" in the US as both employer and employee can tell each other bye-bye tomorrow if either side wanted, but UK contracts, legally speaking, works a bit differently that I'm not familiar of",
          "score": 1
        }
      ]
    },
    {
      "title": "Internship experience at PayPal?",
      "body": "I was recently offered a SE summer intern role at PayPal. I wanted to get some feedback from anyone here over here who has interned at PayPal before. What was your experience like, and the pros/cons you took away from the internship. Some of the challenges you faced and how you were guided through them?",
      "subreddit": "cscareerquestions",
      "score": 16,
      "url": "https://reddit.com/r/cscareerquestions/comments/5ux2tj/internship_experience_at_paypal/",
      "comments": [
        {
          "body": "Not answering your question, but how long did it take to get a response?",
          "score": 5
        }
      ]
    },
    {
      "title": "Should I be worried here - Interviewed with PayPal for 5 rounds, got \"I hope to have a final decision for you late next week\"",
      "body": "So I interviewed with PayPal for a business analyst role and they wanted someone with SQL, Tableau, and data analytics experience (more of a data analyst position).\n\nThis is the order of interviews I did - a one-way video interview, SQL coding, Hiring manager round, Hiring manager round 2, 3 Higher Managers split into 2 separate calls for the final interview.\n\nI thought I did well with the 1st higher manager, and she was ok with my answers. The 2nd final interview call was with 2 higher managers and I was explaining about an ETL project but one of them stopped me and asked me to stop and speak about a dashboarding project. I did that but stuttered a bit while answering.\n\nAfter the interview, I emailed the HR for email IDs of the 3 higher managers to send thank you notes and received a reply that said, \"You can send them to me I will pass them along and **I hope to have a decision for you by the middle of next week, if not sooner**\". I sent each of the 3 higher managers thank you notes via the HR. I received an email response from the HR that said, \"**I hope to have a final decision for you late next week**\" on Saturday (today).\n\nMy question is - why did the HR change her position from early/middle of next week to late next week?\n\nAlso, the final interview with the 3 higher managers was added last minute.\n\nAm I reading too much into this?\n\nAnybody who has experience with PayPal or Business Analyst interviews with them can explain what might have happened?",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/kbta67/should_i_be_worried_here_interviewed_with_paypal/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I’ve never worked at PayPal or as an analyst before now. The current job I have is is my first data analyst role. Honestly, the jobs in my last Including the one I have now where they realllllly wanted me, they hired me on the spot and skipped further rounds of testing and interviews. \n\nThe jobs I had where they were undecided between candidates or had a strict hiring process (because of a union or whatever the reason) it went similarly to what you’re going through. \n\nTo be honest, the stuttering probably had less impact you think and more about your ability to do the job without them disrupting their flow.  \n\nThat’s the one thing managers and companies hate about having to hire new employees.  The extra work it takes to train them and get them up to speed.  So they’re more likely to hire someone they have to do the least work in “getting them up to speed”.  So when I when I interview I slip it in at some point an example of how I stepped up and took initiative and it lead to xyz results for the company.  \n\nIt shows them that I was a quick learner, I’m not gonna sit around waiting to be taught or waiting to be told what to do, and they I will step up and give more than 100%",
          "score": 3
        },
        {
          "body": "No one has a crystal ball to indicate whats really happening.  I doubt even anyone from PayPal can tell you what's happening.\n\nWhat I do know, is dont sweat it, you came REALLY far in the hiring process.  A series of unknowns to you, you may be a front runner top candidate, but someone is perhaps on league or a little better than you.  They may have someone internally who is vying for the same role.  Maybe the budgeting needs to be signed off and upper management is dragging their feet on approving budgets.  I dont know.  You don't know.  \n\nOk so correction: someone at PayPal might know but the exact reasons are buried under confidentiality.\n\nDont be hard on yourself.  It sounded like you interviewed well and made it really far, so give yourself a pat on the back.\n\nBy the way, thank you notes are a thing of the past man dont even bother with them dude.  Interviewing is like dating.  If they want you, they will call you back and chase YOU down.  You don't chase down employers for jobs.  Dont read into them much.  Think about it like dating: you meet a great girl.  Shes not that into you, but you send her a thank you note after the date.  Ugh.  Does that make her want to suddenly date you?  Kinda the same idea.  When you interview and give it a shot, you can feel free to thank everyone who's present right then and there at the end, for taking the time to meet with you.  Dont bother with after the meeting thank you and especially not for zoom interviews with people thrown into the mix, its absolutely unnecessary and a waste of your time and effort.\n\nPeople seem to think they need to move mountains and be extra nice to people to get jobs but that isn't really the case man.\n\nDont ever have all your eggs in one basket.  Keep applying and interviewing.  Don't stop until you have an offer and date in hand.",
          "score": 3
        }
      ]
    },
    {
      "title": "Most obnoxious job description I've ever seen on linkedin",
      "body": "**Learning curve vs. doing curve**\n\nJan here, the COO. I don’t believe in preemptive learning. What you’ve learned so far doesn’t really matter. No one will ask you about it. How many amazing things did you learn in your second semester of university? Or in 11th-grade math class? It’s all quickly forgotten.\n\nI believe in doing.What have you done? Because what you will do at Buena is something no one can ever take away from you. I also believe that learning is downstream from doing. You’ll be able to say that you brought a company with 10 employees from a 5% margin to 40% while increasing revenue. You won’t need to say that you learned to understand financial data, manage employees, or sell services. It'll be implicitly clear.\n\nI Don’t Care What You’ve Learned Before Or What You Want To Learn Here. I Leave That To The Academic World. What Matters To Us Is That You’ll Do a Lot Here\n\n*  People management, including recruiting: Motivate your portcos (portfolio companies), help them achieve their goals, and decide with the team lead who gets hired and when.\n*  Creating and improving operations and processes: Each property management company has unique characteristics that you’ll need to represent in professional and scalable processes.\n*  Product development: New features are constantly built to handle more property management tasks even more effectively in our software. You can lead such a feature from idea to deployment, its first use in a portfolio company, and finally its rollout across Buena.\n*  Property management: Here, you’ll work hands-on with the largest asset class in the world—and gain insights into what to consider when purchasing your own real estate. Not the most useless knowledge to acquire.\n\nThe above example is the main action for 2025. Once you have successfully integrated your set of 5-8 portcos, the playbook for integrations will be so good, we'll be able to have interns do this job. You will then move on to the next stage: increasing revenue per unit. There are a bunch of industries within residential real estate that are adjacent to property management and could be interesting. One example is insurance. Instead of having every property manager get their own deals with insurers via external insurance brokers, you could negotiate one - much better - deal for all our units directly with Allianz CEO Oliver Bäte—at the Champions League final against Chelsea.Once you have a deal you'll test it with your portcos, integrate it into the product and finally roll it out across all portcos - and grow this business unit as Buena changes property management globally (starting with the US as the second market after Germany).\n\n**Work directly with the Leadership Team**\n\nAnyone Joining Us As a Venture Builder Will Work Directly With The Leadership Team. One Could Say That You’ll Learn a Lot From This, But As Mentioned Above, That’s Secondary. Primarily, Working With The Leadership Team Means Two Things\n\n*  You can do a lot: Your direct supervisor has the autonomy to approve everything and empower you to act quickly. To get a better understanding for what that means exactly ask the Venture Builder you’ll meet in our recruiting process about how budgets work here.\n*  You can grow with the company: In a few years, I'll need senior execs responsible for areas like Banking, Insurance, Brokerage, etc. I want to prepare you for this development so that—even when Buena reaches €100 million or €10 billion in revenue—you continue to report directly to the Leadership Team. Or secure their angel investment for your own startup. #PaypalMafia\n\n**Your first week at Buena**\n\n9:00 \"Here's your laptop; I've assigned you a Linear project where you'll find everything you need to get started.\"You spend about 30 minutes reading “everything” you need to know beforehand.\n\n9:34 \"Your first two companies are our new portfolio companies in Magdeburg and Hamburg. This afternoon, you’ll have an initial call with each team lead. Here are two documents containing everything you need to know about the companies.\"\n\n9:51 You go through the Buena software and review additional onboarding documents to get more context. This includes introductions to property management, our software, and materials from the last two board meetings.\n\n11:00 You talk with Maria, the Hamburg team lead. She briefly introduces her team of 8 employees. You discuss the software currently in use and plan to meet in person tomorrow. She asks if our software can generate reports, as they have a major owner with 340 units (€30 is the minimum revenue per unit per month) who receives a monthly report. You request a sample report. Currently, these are being laboriously created in Excel. You find out that generating these reports takes half a workday each month.\n\n12:00 Lunch break\n\n12:45 You speak with Jakob, our Product Manager, to understand our progress on such reports. The sample report is a simple overview of all units, occupancy status, and outstanding rents. Jakob explains our previous thoughts on the matter, and together you brainstorm where this function could be integrated into Buena. The result: it will take just two days of development to enable these reports at the push of a button.\n\n14:00 You talk with Markus, the Magdeburg team lead. He primarily needs help with recruiting, as new units were recently added. Swift action is required here—maybe the new units can be added directly to the Buena software and managed from there?\n\n15:04 You book transport and hotels for two days in Hamburg and two days in Magdeburg.\n\n15:41 You receive the financial data for your two companies to get an overview. Together, total revenue is €1.2 million annually. Your task will be to increase the margin from 4% to 35% through the integration of Buena software and subsequent growth in units.\n\n17:29 You talk with Anna, our recruiter, about the situation in Magdeburg. She’s already aware, and the job posting is live. The first 10 candidates have already been contacted. Together, you plan to conduct the initial interviews on-site when you’re there.\n\n18:06 You grab some food, and the Ops team eats together downstairs. Most have meal-prepped to save time and eat healthily.\n\n19:00 You go over the import template. It’s a .csv file which you need to fill (via scripts or copy-pasting) to import master data from portcos into the Buena.\n\n20:46 You walk eight minutes home to pack your things—tomorrow, you're off to Hamburg.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jeu00y/most_obnoxious_job_description_ive_ever_seen_on/",
      "comments": []
    },
    {
      "title": "Started working as a personal assistant. We have a very casual arrangement and I'm not sure if I should ask for any paperwork",
      "body": "I  (25 F) just moved to LA about 2 months ago, went to a mixer and I  mentioned that I'm new in town, looking for a part time job. As I was  walking out, this woman (64 F) asked to exchange phone numbers and  invited me to dinner the next day. She was a screenwriter who needed a  personal assistant. We had a dinner interview and I pretty much started  working for her on the spot at the beginning of this month.\n\nBasically  all I have to do is listen to her ideas, ask her some questions and  make suggestions. She needed someone to verbalize her ideas to (Like  rubber ducking for programmers). Otherwise, I will be scheduling events,  designing business cards (part of my actual major), and help her figure  out social media.\n\nI get paid $23  an hour through paypal so I'm making around $400 a week. I keep a time  sheet on a shared Google document but she doesn't really look at it. She  asks me the amount for the week and just paypals me on the spot.\n\nMy  question is, this is all a great deal for me and very convenient, but  there has been no concrete evidence that I'm working with her. No  contract or anything. Is there anything I should ask for? How would I  fill out my taxes in this situation? Are my paypal statements good  enough for any legal situations like proof of employment?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/15z8wz2/started_working_as_a_personal_assistant_we_have_a/",
      "comments": [
        {
          "body": "She's treating you like a contractor rather than an employee, so you'd ask her for an IRS 1099 form in January or possibly earlier if you stop working for her before then. You'd then report the income via IRS Schedule C when you file your tax return, and probably file something equivalent for your state. You may want to pay estimated taxes to avoid being hit with a big tax bill and possibly a penalty for, essentially, owing too much on income. Make sure to track expenses including mileage because they can be deducted from your income to lower your taxes.",
          "score": 1
        }
      ]
    },
    {
      "title": "Offer from PayPal",
      "body": "I have been recently interviewed for a Software engineer position at PayPal. The HR reached out to me and said she received \"Positive Feedback\" from the team and will schedule a call with Hiring manager. It has been 2 weeks and there has been no response. I tried following up but no replies. Can anyone suggest what to do?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/wxl3cd/offer_from_paypal/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "No shame in following up again. The job I got currently I followed up 3 times and when I heard back the head of HR said they had an emergency with their family and had to deal with it ( I think it was true ) anyways follow up again and share how important the job is to you, why you're qualified, and how excited you are for next steps. Theres a difference between following up and harrasing. As long as you're polite and not overdoing it, following up is a skill most people simply don't do. Humans arent perfect and don't take care of things right away, we need a gentle nudge\n\nYou can also try the process again by reaching out to a different manager and recruiter or get a referral from someone you network with to boost your chances",
          "score": 2
        }
      ]
    },
    {
      "title": "Help Explain The Strangeness of A Job",
      "body": "Hello, I wanted to ask for help about this and find out what others were thinking, seeing as I could not find any answers over the internet.\n\nRecently, I took up a job with a company called Jiayou Logistics, which is a company that ships packages to people from all over the world. (We're talking about things that you'd find on amazon) I got the title of quality control inspector. They offered to pay a large sum of money monthly with additional money for each successful package shipped. (I did research on the company before agreeing to join and found that they are based in China and they even have a website)  \nWell, when I signed up with them, I thought it was weird because they offered an \"Over the phone\" interview which was  less of an interview and more of a congrats on getting the job. they even sent me a short video clip which I can try to find a way to link if people are interested. I accepted it and then they helped me get set up shortly after. First it was nonstop emails from two of my new managers talking about how to go about the job and what I needed. My managers had suspicious names like &gt;!Wanda Weaver and Mikki Varley and even Valerio Peck!&lt;. Then, it was emails about how to setup a free fedex account, UPS account, and a USPS account. They made me order free boxes to my house. They also made me sign W-4 and submit photos of my driver's license. They even asked for my paypal to submit money to, or my bank account, but I chose Paypal as it was safer.\n\nPretty normal stuff, right?\n\nWell, the thing was that they sent me packages. I had to open the packages, take pictures and then print shipping labels to send them out. Again, they were pretty normal packages, like Ipads and even Jordans or gold coins.\n\nNothing seems fishy, right?\n\nWell, recently, It was supposed to be payday for me over the weekend. they had a rule where they sent out payment on the next business day if it fell on a weekend or holiday, which I brushed off as sus but not enough to really warrant more suspicion. Recently, I tried calling them, because they weren't picking up my texts. When I would call, a robotic voice would say \"Sorry, the Number dialed can not be reached from your calling area.\" I even tried to reach out to HR, but it told me \"The number you dialed is not in service at this time.\"  \nAlso, to mention, they have this website they use to check packages and stuff, but it recently stopped letting me login and told me that my login was wrong/incorrect, even though HR had sent me an email from a long time ago confirming what it was. Still cannot login it.\n\nLastly, it says that their base of operations was in &gt;!545 Radio Station Rd, Block B596, Strasburg VA 22657!&lt; but it goes to an  an &gt;!Americold Logistics!&lt;\n\nNow, I don't know what to do or say. Did I get scammed out of job? I mean, it doesn't make much sense, they didn't gain any money and all of my stuff that I had to give them is stuff any normal job has to take. Idk. Please help! Thank you!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/jr2ups/help_explain_the_strangeness_of_a_job/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "yeah you got scammed. Likely those shipments were stolen goods or laundering. They never intended yo pay you.",
          "score": 5
        },
        {
          "body": "Have anyone heard of Involal? I’m supposed to get paid pretty soon, I’ve been receiving packages as well. I’m worried now",
          "score": 2
        },
        {
          "body": "Yeah everything happen to me. I reported it to the police in Strasburg then I got a call from a federal agent. Then I was told make a report to the FTC. Good luck but the contracts are real and the company is a common wealth Llc the detective did confirm. So IF AND A BIG IF they get caught there could be something. Just make the reports and make sure your name is all over it.",
          "score": 2
        },
        {
          "body": "Hello I could not find any answers over the internet.\n\n&amp;#x200B;\n\nRecently, I took up a job with a company called Jiayou Logistics, which is a company that ships packages to people from all over the world. (We're talking about things that you'd find on amazon) I got the title of quality control inspector. They offered to pay a large sum of money monthly with additional money for each successful package shipped. They were going to pay $2,800 monthly and $50 per successful package shipped (I did research on the company before agreeing to join and found that they are based in China and they even have a website)\n\nWell, when I signed up with them, I thought it was weird because they offered an \"Over the phone\" interview which was less of an interview and more of a congrats on getting the job. they even sent me a short video clip which I can try to find a way to link if you are interested. I accepted it and then they helped me get set up shortly after. First it was nonstop emails from three of my new managers talking about how to go about the job and what I needed. Honestly, it was practically the same email. My managers had suspicious names like Wanda Weaver and Mikki Varley and even Valerio Peck, or Keith Oliver. Then, it was emails about how to setup a free fedex account, UPS account, and a USPS account. They made me order free boxes to my house. They also made me sign W-4 and submit photos of my driver's license and Passport. They even asked for my paypal to submit money to, or my bank account, but I chose Paypal as it was safer.\n\n&amp;#x200B;\n\nPretty normal stuff, right?\n\n&amp;#x200B;\n\nWell, the thing was that they sent me packages. I had to open the packages, take pictures and then print shipping labels to send them out. Again, they were pretty normal packages, like Ipads and even Jordans or gold coins. (I have pictures of the items the made me ship)\n\n&amp;#x200B;\n\nNothing seems fishy, right?\n\n&amp;#x200B;\n\nWell, recently, It was supposed to be payday for me over the weekend. they had a rule where they sent out payment on the next business day if it fell on a weekend or holiday, which I brushed off as suspicious but not enough to really warrant more concern. Recently, I tried calling them, because they weren't picking up my texts. When I would call, a robotic voice would say \"Sorry, the Number dialed can not be reached from your calling area.\" I even tried to reach out to HR, but it told me \"The number you dialed is not in service at this time.\" Finally, I called them using my mother's phone and it went straight to voice mail. Meaning, they probably blocked me.\n\nAlso, to mention, they have this website they use to check packages and stuff, but it recently stopped letting me login and told me that my login was wrong/incorrect, even though HR had sent me an email from a long time ago confirming what it was. Still cannot login it.\n\nI was able to login on Friday morning, but when Friday afternoon had rolled around, I lost all ability to login into the website or call my managers.\n\n&amp;#x200B;\n\nLastly, it says that their base of operations was in 545 Radio Station Rd, Block B596, Strasburg VA 22657 but it goes to an an Americold Logistics",
          "score": 1
        },
        {
          "body": "Here is all of the emails and phone numbers they have used:\n\n&amp;#x200B;\n\nKeith Oliver | HR Department\n\nDirect number: (804) 799-1547\n\n[keith.oliver@jia-email.com](mailto:keith.oliver@jia-email.com)\n\n&amp;#x200B;\n\nWanda Weaver | Manager Shipping Department\n\nDirect number: (804) 799-1552\n\nEmail: [Wanda.Weaver@jia-email.com](mailto:Wanda.Weaver@jia-email.com)\n\n&amp;#x200B;\n\nMikki Varley\n\nDirect line: (804) 799-9033\n\nEmail: [Mikki.Varley@jia-email.com](mailto:Mikki.Varley@jia-email.com)\n\n&amp;#x200B;\n\nValerio Peck\n\nDirect line: (804) 799-9058\n\nEmail: [Valerio.Peck@jia-email.com](mailto:Valerio.Peck@jia-email.com)\n\n&amp;#x200B;\n\nAccounting Department \n\n[accounting@jia-email.com](mailto:accounting@jia-email.com)\n\n&amp;#x200B;\n\n[human.resources@jia-email.com](mailto:human.resources@jia-email.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "I’m sure it’s a scam but what are your thoughts?",
      "body": "I’m pretty sure it’s a scam\n\nThe first post I read as soon as I clicked on this page is very similar to my experience but imma go ahead and share it.\n\nBack story, I’m a 19 year old, broke university student looking for a job. I’ve applied  to so many but I live in Toronto and chances of me getting those jobs are slim to none.\n\nA month ago, I applied to some data clerk jobs, but I forgot the names of the companies I applied to. A few days past after I applied and someone reached out to me, saying that they liked my resume and want me to work for them. The company itself is legit but all the forms I got from this person are all in Google Docs.They included amounts they would pay per week if you’re FT or PT. The email stated;\n\n\nXXX is glad to welcome you. From petroleum chains to multi-site operators and tunnels to in-bay automatics, XXX helps operators to securely manage their businesses from the internet, adding new\nmemberships easily, managing car wash locations remotely, and using valuable data about users to make better decisions. We are looking for a new teammate.\nWhat we can offer you:\n•       Full Benefits (Health, Dental, Vision Insurance, Car Allowance)\n•       Excellent opportunities to work anywhere in Canada\n•       Professional training, mentoring and job coaching\n•       Salary for Full time 40 hours/week (1470 CAD), Part time 20\nhours/week (735 CAD)\nThis is an online position and you do not need to change your place of residence. We work your time.\nAbout you:\n•       Excellent written and verbal communication skills (English)\n•       Strong interpersonal and computer skills\n•       Exceptional customer service orientation\n•       Ability to pay close attention to detail and accuracy\n•       Strong organizational and Microsoft Office skills\n•       Place of residence Canada\nIf interested, kindly indicate your interest by replying this email.\n\n\nSo I’m 100% sure it’s a scam but a friend of mine told me to go through with it thinking it might something else. I did it only because I’m currently moving cities and the address that would be listed on the form would not be registered to my name. The email below states what I’m supposed to do for the job;\n\n\nDear XoXo,\nCongratulations! You are accepted to XXX for the trial period. We have chosen you out of a certain number of candidates for this position, and we hope that you will not let us down. You are familiar with our responsibilities and we are ready to get to work.\nYou should check your e-mail constantly and respond to my messages quickly.Just keep your cell phone available to get a call from us always.\n\nXXX provides clients’ needs with staffing and human resources services. Our customer service managers perform the full preparation of the client. Your task is to ensure the full sale of services to customers. Your duties will be to accept payments for the company's facilities, which we provide to our customers. Our customers pay for our services using electronic Bitcoin currency. Payments made in this system cannot be canceled. The coins themselves cannot be forged, copied or held twice. Such capabilities ensure the integrity of the entire system. Our company has become one of the first among companies of this scale, who preferred to use the cryptic currency to pay for services. The Bitcoin currency goes the same way as PayPal before, and has already become a part of modern life. The purpose of using Bitcoin is to maximize customers’ satisfaction with minimal financial costs - our customers no longer pay large commissions and fees to a bank, which allows our customers to save our company and earn money.\n\nIn the trial period, there are several stages. At the first stage, you have to fulfill the task of accepting payment for the services provided by our company (this is the replenishment of the Bitcoin corporate wallet). In the second stage, you will maintain long-term growth and keep the customer in sight. You will have to provide our clients with any kind of our services, selling and informing them about the advantages of our services.\nYou will have access to your online account and all instructions for use. I will train you gradually. For the trial period, you will have 3-4 clients.\nTo get started with Bitcoin, you need to fill out your wallet. Our company will transfer money through the Interac system.\nThere is no fee to receive Bitcoins, and many wallets let you control how large a fee to pay when spending. \nMost wallets have reasonable default fees, and higher fees can encourage faster confirmation of your transactions. \nAfter receiving electronic transfer, you will have to fill up your Bitcoin wallet.\nWe will send you 1-3 transactions through the Interac system.\nYou must ensure all necessary tasks for the client. You should find an individual approach to each customer.\nYou should offer services and products to them.\n\nIn other words, your position requires you to do everything possible to make client happy.\nFor the future, he will work with us and recommend our company to others.\nYou need to understand your customer, how to do it:\nProviding a high level customer care often requires you to find out what your customers want.\nOnce you have identified your most valuable customers or best potential customers,\nYou can target your highest levels of customer care towards them.\n\nIt may sound hard, and sometimes it is not clear to you. Do not worry; I'll be in charge of \nYou throughout the 10 days. I will give the detailed instructions gradually. So, after the trial 10 days, \nYou will learn this profession in case you will work hard.\n\n! You must fill out a form for transfer of payments through the Interac system.\nAfter that, I will send Bitcoin wallet to you.\nIf you have any questions, do not hesitate to ask me.\n\n\nSorry for the long post. At first, when reading this what I’m supposed to do, it sounds legit and all, but when i think about the little details, something is fishy",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/dyn37s/im_sure_its_a_scam_but_what_are_your_thoughts/",
      "comments": [
        {
          "body": "I vote scam. Move on from this.",
          "score": 4
        },
        {
          "body": "Scam",
          "score": 3
        },
        {
          "body": "Am I misreading or you didn't even interview for the job?",
          "score": 1
        },
        {
          "body": "Sorry, didn't read it all.  A bit long.  Ask them to call you.  Tell them you aren't familiar with Bitcoin and just have  a few questions.  If they come up with a story as to why they can't, I can almost guarantee that its a scam.\n\nAlso see if they are using a gmail type of email address.  Another tip off that its a scam.",
          "score": 1
        },
        {
          "body": "I read that there are scam applications out there that ask u to forward them ur bank account routing and ssn and all that.\n\nThen ur info has now been stolen. They would probably use ur routing # to send money to them as well",
          "score": 1
        }
      ]
    },
    {
      "title": "What does it take to get a full time at Google or Apple as a Liberal Arts post graduate?",
      "body": "I've been out of college for almost 3 years now doing odd contract marketing/social media jobs at start ups and now working at Paypal but in a low paying recruiter position as a contractor through an agency. I graduated from UC Berkeley but I feel like where I graduated from holds so little weight these days, especially in tech when everyone has fancy degrees. My resume/background isn't stellar with all these random jumpy gigs I've been doing -- and it seems that interns/new grads with all their fancy internships and extracurriculars that I am no match for are mostly what they're looking for. Getting into tech as a contractor is easy, because there's no long term commitment for the companies. How can a washed up early professional like myself with 3 years of experience basically doing nothing worth of value get noticed by large tech companies for a full time non-technical role (i.e. growth marketing or project management)? What can I start doing now or how can I jazz up my resume so that I can even get that first interview?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/52lw3f/what_does_it_take_to_get_a_full_time_at_google_or/",
      "comments": [
        {
          "body": "The best thing you can do is get a job doing the thing you want to do somewhere else where they are willing to grow you, then making a lateral move when your skills/experiences are at the level that these tech companies are looking for.",
          "score": 2
        },
        {
          "body": "What kind of skill do you think you could offer these companies that are typically more concerned with very technical, definable talents, i.e. coding?\n\nJust curious.",
          "score": 1
        },
        {
          "body": "You said you work for paypal at the moment, are you working for them at their office? If so, use your afterwork time to stay in office, make connections to people there. After they jump ship, they might be able to offer you jobs. Tech companies only pays their developers good salary, if you are just a business type of guy you are subject to all the other market paying rate of business majors, I know it sucks when you compare, but you are in a better position because you work for one of them right now. Use your resources around you to prepare you to jump into a better position.",
          "score": 1
        }
      ]
    },
    {
      "title": "New part-time job as an independent contractor! Question about invoices",
      "body": "So I tried googling this question but everything that came up was basically the rules and regulations for employers, so I thought I'd ask r/jobs!\n\nI just got hired for a company directly related to the degree I am graduating with in a few weeks. Very happy to have been given this opportunity. It's part-time work as an independent contractor paying $28/hour (which I understand will be taxed to hell come next year) and it's only about 10 hours/week, but I'm gaining experience and there's promise to be promoted to full-time assuming I do well enough during this trial period. In the meantime, I'm continuing to look for other jobs just in case (2nd interview in a few weeks! Fingers crossed!)\n\nI'm reading all about invoices right now, which according to my contract, I need to turn in twice a month. I'm a bit confused about it, though, and was hoping you could answer some questions. I don't want to feel like a burden to my boss asking him these, since I feel like he's already going out of his way to have hired me.\n\n1. Will the boss give me responsibilities that I will then \"charge\" him for on my invoice? Am I allowed to do what I think needs to be done and then charge them accordingly? (Be a self-starter or no?)\n\n2. I have a phone meeting tomorrow to discuss my first project. Do I charge them for that?\n\n3. Some of these invoice templates I'm looking at include a tax rate. Where do I figure that out?\n\n4. Last one! Should I include my PayPal info?\n\nI think that's all...\n\nThanks for your help guys!",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/4flm6b/new_parttime_job_as_an_independent_contractor/",
      "comments": [
        {
          "body": "Your invoice should look something like:\n\n|PO Number|Terms|\n|-|-|\n|40020104|net 15|\n\n|Code|Description|Quantity|$/Unit|Subtotal|\n|-|-|-|-:|-:|\n|GS001|General Services Apr 4 through Apr 8|10|28|280|\n|GS001|General Services Apr 11 through Apr 15|10|28|280|\n||||||\n|Terms|Please remit payment via PayPal to: abc@example.com||Total|560|\n\nThe purpose of the invoice is to document what is owed.  You should probably have some sort of purchase order to bill against.\n\n&gt; Will the boss give me responsibilities that I will then \"charge\" him for on my invoice? Am I allowed to do what I think needs to be done and then charge them accordingly? (Be a self-starter or no?)\n\nNot sure what this has to do with the invoice.  You're given 10 hours @ 28 per hour.  Doesn't matter how you get those 10 hours, you bill for doing the work.\n\n&gt;I have a phone meeting tomorrow to discuss my first project. Do I charge them for that?\n\nYou should have a consulting agreement that states what you are permitted to charge for.  If you don't have one, be straightforward and ask if you're billable prior to the start of the meeting. \n\n&gt; Some of these invoice templates I'm looking at include a tax rate. Where do I figure that out?\n\nCertain products are taxable.  Generally, services are not taxable.\n\n&gt; Last one! Should I include my PayPal info?\n\nIf that's how you're expecting to be paid, yes.  Include the payment terms in the invoice if it's not a part of the consulting agreement already.\n",
          "score": 2
        }
      ]
    },
    {
      "title": "Anxious about Employment Background Checks",
      "body": "So I recently applied for a new job, went for the interview and got offered a position as soon as the interview finished. Which is amazing - and I was really excited for it up until yesterday when they started doing the pre-employment background checks.\n\nThe problem is, I put “self employed” for the last three years - which is technically true, but I was also claiming UC, but they did not deem me as ‘meaningfully self employed’. Which is to say I wasn’t earning enough, and could continue claiming while declaring. \n\nProblem is, i don’t really have any evidence other than a form of letter from DWP that they don’t deem my self employment meaningful or my PayPal statements with my income. On top of that, I stated the dates to be 01/2018 to present, which is technically true, but my work coach didn’t put me on to the self employed scheme until much later. \n\nSo now I’m worried that I’m going to fail my background checks.. and I really can’t afford to not get this job; I’m on the last of my savings, my debt is building up and my anxiety is going through the roof…\n\nI’m not sure what to do…",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/pnrsk8/anxious_about_employment_background_checks/",
      "comments": [
        {
          "body": "Did you pay taxes on any of this? That's how I proved employment at a company that was no longer around.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is this job sketchy or am I just a dumb baby who doesn't understand adult life?",
      "body": "So a couple months ago I applied for a job as an operations assistant for ANTmailbox, working from home. I've never heard of it before, but they do some stuff with mail, idk. I just applied bc I've had experience with mail sorting/distributing and it was a job and I just graduated from college and applied for everything because dang it I need a job.\n\nI got a response from a hiring manager, saying that they are interested in hiring me. I filled out an application on their website (which looked legit). Later they got back to me about doing a phone interview. Everything seemed legit, but there were some things that set off red flags:\n\n* ***They gave me the job but I never interviewed.*** They said they would call me, but I never ever received a call from them even though they said they tried multiple times. The phone number I provided didn't have any errors whatsoever. I even tried calling them, but I just talked to a bunch of robots, and when they tried to direct me to a real person I got the \"sorry we're busy pls leave a message :)\" crap, so I did. After all of that I get an email saying  \"After a review of your credentials, on behalf of ANTmailbox I take pleasure in advising you that we have chosen you to be **our Operations Assistant in the United States.\"** I was like what??? I didn't even do an interview and they're giving me the job??? I emailed back and told them I never interviewed and they gave me the same \"we called but you never picked up but it's ok anyways here are some forms to sign!\" That was weird.\n* ***Pay might be too good to be true.*** The employment agreement says:\n\na)  $725.00 per week;\n\nb)   8% (eight) of each payment processing operation;\n\nc)  $20.00 per each completed mailed order;\n\nd)  $500.00 Application Bonus.\n\n* That's like, $18 per hour if I technically work 40 hours a week. I've never worked a job with a salary before so maybe this is my 20 yr old brain looking at this the wrong way after years of garbage pay, but it just sounds too nice, especially with that application bonus.\n* ***My duties are questionable:***\n\n\\- Receive correspondence using your own address;\n\n\\- Check your mailbox daily and confirm receipt;\n\n\\- Forward envelopes to our office using prepaid USPS/FedEx Labels; USPS/FedEx Labels will beprovided by the Company;\n\n\\- Maintain accurate records of items shipped and received;\n\n\\-  Receive  domestic  bank  wire  transfers  from  our  customers  in  your  area  (the  payment  from  our customers for services provided under the contract. Since our company works all over the world, it is easier for our customers to transfer their money to our Operations Assistants who are located in the same state/region); an existing Paypal account is highly recommended.\n\n\\- Create reports for each transaction;\n\n\\- Follow the instructions from Supervisor / Manager.\n\n* Using my own address? What? My sister pointed out it's way sketch that they're having me, a new employee, handle important money transactions. What if a transaction messes up, out of my control? Then it's all on me. The agreement also says \"The  Corporation  shall  have  the  right  to  decrease  the  Employee’s  commission  in  case  the  payment processing terms were violated by the Employee. In this case the Employee’s commission will be decreased at a rate of 1% per day.\" Which is understandable, but it's all through paypal? I figure if this is a legit company they wouldn't do all this through paypal maybe?\n* ***They used some weird lingo in their emails.*** In their job offer email, they start off with, \" Rest assured that we are here to help you get started and will always be happy to offer advice or answer any questions you may have. You are definitely not on your own. **You can look forward to a new stage in your professional career and life-enhancing personal growth. You will expand your skill set to include financial services, reporting under US and international standards, adding to your development and future marketability**.\" Now that is the thing that's bothering me the most. Since I graduated and applied for jobs, a lot of pyramid schemes and \"mentorships\" reached out to me, and they would say the same things, talking about how they could help with my personal growth, expanding my career, etc. without really specifying what they're doing. Later I find out it's because they get paid to recruit as many people as possible but the job itself is a scam, so I avoid those. This is the most legit looking offer I got, but it's the wording in that email that's setting off alarms in my head.\n\nI have also tried looking up to see if this company is sketch like I did with previous offers, but nothing weird came up except that this company is relatively new.\n\nMaybe since I'm on the fence but leaning towards no with this thing, and I wrote a whole essay explaining why I'm suspicious, I should just deny it. But while I'm not super desperate for a job right now, I want to develop a stable income and move out, so this offer is looking nice, albeit too nice.\n\n**tl;dr: not sure if this job is legit or a scam/hustle, pls help out this helpless 20 yr old who's entering the workforce.**",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/ixbu86/is_this_job_sketchy_or_am_i_just_a_dumb_baby_who/",
      "comments": [
        {
          "body": "No legit company would ever resort to this scheme. These incoming mailings are probably illegal, and by using you as a conduit they can cover their tracks. Also, if crap hits the fan, *you* will be on the hook, at the very least. Trust your gut and get out of this now.",
          "score": 4
        },
        {
          "body": "I would be wary of any employer that gave you a job without an interview.   I'd be worried they just want you ssn and info for identity theft.",
          "score": 5
        },
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I am so glad I found this post because I am literally going through the same situation with the same people. I did tons of research and couldn't find any spam risks what so ever. I immediately felt off when they emailed me saying I was hired without an interview (which they claimed to call me several times). They finally sent the agreement today and I was so hesitant on signing it so I did some more searching on google and found your post. Thank you. F\\*\\*\\* scammers.",
          "score": 1
        },
        {
          "body": "I received the exact same offer around the end of Sept. this year from someone who called herself \"Kathy Huffman, Hiring Manager.\" It was pretty much the same details you show &amp; for some reason, my acceptance was required within 24 hours. Also just as with you, there was never a phone interview &amp; all they requested was for me to fill out a brief application. On that, nothing personal was requested such as financial info, etc. Their offer did say that I would either be paid by depositing into my bank or Paypal, which didn't set off any alarms. They even provided me with a very official-looking web-site ( [**https://www.antmailbox.com**](https://www.antmailbox.com/)**),** which certainly looks authentic. At any rate, something just didn't smell right (like you said, too good to be true), so I Googled it &amp; although I didn't find anything directly naming them, I did find where this type of scam (mail forwarding) is becoming more popular. The scam is that they do pay you, but the checks are fraudulent &amp; likely by the time you find it out, they've already nailed you for several hundred or any thousands of dollars. They send you a bogus check for an amount more than what's due &amp; then request you to send them back the difference in a money order or certified check, or likely something along those lines. What I found was even stranger than that is that took the time to file a complaint with the FTC &amp; a couple other agencies, but never received acknowledgements at all. So either they're so busy fighting scams or they just didn't care about small-time scams.",
          "score": 1
        }
      ]
    },
    {
      "title": "I [29M] fear my Vietnamese web designer friend [24F] is being taken advantage of by her Europe based boss [30sM], I don't know how much further I should get involved than I already have.",
      "body": "I've just recently moved to Hanoi for a short period of time while travelling, and during my time here I have made friends with a local girl (let's call her Jen). She's a graphic/web designer, and I have a background in industrial/product design so we clicked immediately. She speaks very good English, and she's also talented at what she does: I've seen her work and she has a great eye for design, she's also fast and methodical. I have years of experience in Photoshop, and she's way better at it than I am.\n\nShe just started work at a new job last month for a European man (let's call him Tom, or \"her boss\") that still lives and operates out of Europe. Until today I wasn't aware of their arrangement other than she's been working a lot, and overall seems pretty happy with her work. She has shown me some of her finished products, they're classy looking sites for pretty high end clients like investment firms, and the copy appears to be in some scandinavian language.\n\nToday Jen asked me for help in working out a paypal issue; she needed assistance in setting up her bank account to accept the money that her boss had sent her. While working out the settings I saw the balance: $360USD. I thought to myself \"Hey, $360 a week seems a bit low for the kind and amount of work she's been doing, but this is a different part of the world, who am I to judge?\". Shortly after I discovered it was $360 per month, not $360 a week.\n\nI asked a few more questions and found out this is a salary arrangement, not hourly pay. Jen showed me the emails where they \"negotiated\" this salary; Tom expects her to work 8 hours a day for 5 days a week, use one day as a \"learning\" day, and have one day off. She also has been allowed 7 additional days off per year as vacation whenever she chooses. I let Jen know that I thought this was way too low for the kind of work she was doing. She agreed, but admitted that during her interviewing process she let it slip how much she was making in her previous job: 6,000,000₫ (~$350USD) per month, a shitty job that she settled for right out of school, and had a less intensive weekly schedule than the one she has now. When Jen recieved her offer from Tom it was for 7,000,000₫ and she was too afraid to ask for more. She sees this job as a great opportunity: working with and gaining experience from big western companies instead of the low level local work she had been doing previously. She says although the pay is inconvenient that she would continue to work for Tom even without a raise, that's how much she loves this work.\n\nI can see the argument that this is a different part of the world, there's no minimum wage here (as far as I know), and the cost of living is cheaper, but the truth is $360/month is not a lot to live on in this city. Jen lives with her parents (as is the custom in Vietnam) and is still having trouble making ends meet on this amount, not to mention she has no ability to save for her future or unexpected emergencies if they arise (as you've probably guessed, this job doesn't provide benifets).\n\nWhat really disgusts me is that Tom is likely making 10x what Jen is from these clients without putting in any work, hell, he might be passing it off as his own for all we know.\n\nI convinced her to send an email to Tom... actually I wrote a draft, sent it to her to make little changes to make it sound like it was written in her voice, and then she sent it to Tom. My draft was as follows:\n\n&gt;Tom, I hope this isn't a bad time to talk about this, but after my first salary payment I've been reviewing my personal budget and our arrangement, and I'm finding it very hard to make life liveable. I was very excited to start working with you, and I still very much am, I really do like working with you, but I am working very hard (as I hope you see in my work), and I don't think my salary right now is very sustainable if I want to continue working with you long term.\n\n&gt;Right now I am comparing my salary to my time spent working for the last month with you, and I am only earning $2,25 (45.000VND) an hour. This is very low compared to friends I went to school with, and I hope we both agree that I am worth more than that.\n\n&gt;I've been talking with other designers lately about how much a designer with my amount of experience should expect to receive for their work, and I think it would be fair to expect $6 (120.000VND) an hour for my work.\n\n&gt;I am hoping we can find some time to come to an arrangement that works better for the both of us.\n\nJen was really, really nervous about this, she was convinced that speaking out like this was liable to get her fired. I have to admit that I was a little nervous myself putting my nose where it didn't belong in a way that would risk her employment in any way, but I really didn't want to see her get walked on like this.\n\nTom replied within an hour:\n\n&gt;Hello Jen\n\n&gt;Thanks for letting me know. First of all, congratulations to your English, you seem to get better at it than I do :) As for the salary situation, I will have to review this. I completely understand your request, however I can already tell you that it will be difficult. The reason is simple, I can only afford to actually keep someone working with me if the salary is within certain levels - otherwise I will have to do the work myself, because there simply isn't enough return to pay someone at the moment.\n\n&gt;I will have to review the finances myself and see what I can do. Let me know if you have any questions!\n\nJen was really excited about this because it seems like progress... I haven't burst her bubble on it, but to me it seems like Class-A tech-bro HR aversion tactics. I feel like he's going to sit on it and hope the issue isn't brought forward again.\n\nAs for a $400 salary increase ($360 to $960) being difficult, I don't buy it. I don't have much web design experience myself, but by chance I do have a bit of experience handling web design contracts (the consultancy I worked for did a lot of \"branching out\" when the economy was down) for clients of roughly equal prestige to the ones Jen is catering to. I remember some of the numbers I've seen on term sheets, and $400 would be a drop in the pond unless Tom was absolute shit at writing contracts (which I really doubt considering how tightlly Jen's hiring package was crafted).\n\nThis finally brings me to my question; what is the best way for me to proceed past this point?\n\nThe way I see it there are three options:\n\n1. Let sleeping dogs lie, and don't involve myself any more than I have. Jen is happy enough to stay working for Tom whether she gets a raise or not, whereas it would devestate her if she lost this job and learning opportunity, why risk it?\n\n2. Wait and see if Tom actually follows through with \"reviewing the finances\", if he does then I'd help coach Jen to position herself to get the best leverage she can in renegotiating, and if he just sits on it and says nothing then I should prod Jen to appropriately follow up in a month or so.\n\n3. *Stealth mode, bitches*. Make a throwaway email, contact Tom anonymously, don't tell Jen. Write something along the lines of:\n&gt;Hi Tom, I'm Jen's friend with years of experience in the field of design. I've been helping her settle some issues she's been having with her paypal account, and have stumbled upon how little you've been paying her. You should be ashamed of yourself! $360 for 160 hours of professional skilled work? There is a line where outsourcing becomes exploitation and I really feel you've crossed it, and some. Yes, I did encourage Jen to write that email you recieved, but so far that has been my only involvement, she doesn't know I am contacting you now. As far as I see it you've been given the opportunity to hold yourself to a higher moral standard and have rejected it, but I'll give you that opportunity one more time. You have a choice here: email Jen, let her know \"Good news! I've found the money to pay you a liveable wage\", offer her $1000 a month (still a bargain), you'll never hear from me again. Another option is to bully Jen into accepting a small (or no) raise from her current pittance, or worse yet cutting ties with her based off this email I am sending you now. This would result in me sourcing your clients from the work that I've already seen Jen do for you, scouring whatever other leveragable contacts I can from your Linkedin and social media presence, and informing them of your mismanagement and morally dubious stance on supply chain ethics. It might not sound like much, but trust that I can be a thorn that a budding young entrepreneur such as yourself would not want in his foot. You and I both know Jen is a talented designer that deserves better than this. Please choose wisely.\n\nAnyways, I would love an outside perspective on this. Please let me know what you think in the comments.\n\n**TL;DR:**\nVietnamese friend is a talented web designer that is only being paid $360 a month for 160 hours work on European websites by her Europe based boss. She doesn't know how to speak up for herself on this issue, and I've helped out a little bit by helping her draft an email asking for more, but she's scared that she'll lose out on a valuable opportunity if she pushes the issue and loses her job. I am wondering how far I should allow myself to get involved.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/49fa02/i_29m_fear_my_vietnamese_web_designer_friend_24f/",
      "comments": [
        {
          "body": "Dear god, do not send that email.  Tom could very well retaliate against *Jen*.\n\nA better plan is for Jen to build up her portfolio and then start her own business, negotiating her own contracts with overseas companies.  I.e. become Tom's competition.",
          "score": 3
        },
        {
          "body": "Talented designer only wants 960$/month!? Send her info my way",
          "score": 2
        },
        {
          "body": "You are overthinking this.  Almost all serious raises come from switching jobs.  She just needs to negotiate better the next time.",
          "score": 1
        },
        {
          "body": "You've already involved yourself way more than you should have. I'm not gonna sit here and give you pros and cons, but regardless of your choice, you better be prepared to act like a decent human being and take ***complete responsibility*** for what you'll do. \n\nIt's so easy to make a choice and take action when you're pretty much unaffected by the consequences.\n\n",
          "score": 1
        }
      ]
    },
    {
      "title": "Insights wanted: Do my bosses not like me, or do they have cash flow problems?",
      "body": "Hey all! Can anyone, especially if you're an employer (or employee with a similar story), provide some insight into my current situation? Apologize for the super long post. Basically: my bosses are really bad at paying me, and I'm curious why.\n\nI've worked at my job for about 2.5 years. The warning signs when I was interviewing were there. I had significant experience in my field (though a different degree) and they offered to pay $11/hr for a marketing position. I actually went home and cried when they told me that - it affects your self esteem when it feels like they really like you and can clearly see what skills you have to bring to the table, and they still lowball you to the same amount my younger sister makes as a student cashier. That was less than the last job I had during school as a student. I told them that I had been hoping for $18, after doing research on the position and salary ranges (which was actually on the very low side, I just didn't want to scare them). We agreed to negotiate at $14/hr + a monthly commission. I made some calculations, and being as results-oriented as I am, realized that was fine, better, even. I could make more than $18, way more, if I met my targets. Plus, I have a degree that's useless outside of the context of this field, so I took the job, thinking it was a good place to start, and if I worked hard, I'd get raises, all that jazz. \n\nFast forward: there are all sorts of odd issues with paying me. During the first year, they decided they wanted to classify me as a contract employee. Fine. To stay out of trouble, I was told to work from home and given more flexible hours. I liked that. They said to offset the extra taxes I'd have to pay, they'd pay my taxes (saying that they knew they had lowballed me, so hopefully this gets me closer to my desired range). They paid taxes in 2014, but didn't in 2015. So in essence, I'm actually making less than the negotiated $14/hr.\n\nBut soon, other issues came up. For example, that monthly commission was only paid on time the first 8 months. After that, the payments became more sporadic even as I met and increased all our targets. So, in essence, the better I got at my job, the less they paid me. It's a product-based business, so one theory I have is that as I helped them become more successful, they needed more money to buy inventory?? I don't really know. Or, they're business owners in it for the freedom and have a self-imposed limit on growth? Who knows..\n\nIn all of last year, I had 1 bonus payment, which was really unpaid bonuses from 2014. And during the last quarter in 2015, they told me that calculating the bonuses was getting too hard (honestly, I told them already that I didn't mind doing it, but they sort of brushed it off) so they suggested one larger bonus at the end of the year only IF I reached a new target (thereby cancelling out their original commission plan). Of course, I reached the target easily, even though they thought it was a high target. And, to be honest, that bonus is I would guess about 1/4 of my total owed commissions. Which they have made clear they will no longer be paying because they have only now realized that I reach all my targets and it's significantly impacting their cash flow. Half that bonus has been paid, they said the other half is coming in January.\n\nBecause this is a small business, there was no employment contract, nothing. \n\nThe other issue: I have to pay myself. They have other employees but I'm the only one who works in the \"office\", and everyone else gets paid via cheque on a certain day. \n\nBut for some reason, my bosses have always paid me via Paypal, and only me. On top of that, sometime around 2014, they told me that I could just go into their Paypal account to pay myself (I have full access to all their accounts) after they missed a few payments by a few days. So I did and have been doing that ever since, but I don't particularly enjoy having to do that. Whatever, as long as I get paid. I'd rather get paid myself than not get paid at all.\n\nI've been feeling strife over this for a while, which is why I decided to get another job. I now have another job that I love (at a large company that pays on time!), but have decided to keep working at this place part time to make some side money.\n\nWhy? My bosses, weird payment issues aside, are really great. I like this job and the business. And I feel like I'm really helping to grow the business (I see all stats, so I can definitely see growth), and it's easy work, good for extra income. \n\nFor the life of me I just can't figure out WHY they have such trouble paying only me, and why they seem so relaxed about this, with only me. At times I have felt like they don't really want to pay me and I'm their most expensive employee (everyone else is retail staff). And sometimes I have felt that maybe they don't like me. It eats at me. But they are constantly talking about how I can't ever leave (jokingly) and how much I'm an asset to their company. And I do feel like they like me fine (we're very much friends at work!).\n\nWhen I bring up any money/wage issues in person when I'm in the office, they are truly apologetic. And I always think, oh, it's solved. And then I go home and it's the same. I send an email to remind them and they completely ignore my email! E.g. recently went on vacation. Since I'm contract, I didn't expect to get vacation pay, and told them it's fine. In person, while we were talking, my boss said \"No, of course we'll pay your vacation pay!! You're like a real employee to us. (in reference to my contract status) \"Just email me to remind me...\" etc (even though I hadn't asked her to). I emailed her that night, and 4 days later she hasn't paid vacation or any of December wages - which I usually pay myself but because of the new job, I don't actually know what my hourly wage is. She hasn't replied to this email titled \"wages\" even though she's emailed me about other stuff.\n\nOn top of this, because I've started this new job, my boss wants me to count my hours as I go...which doesn't make sense. You want me to count every 10 minutes of work for a $14/hour job?? I'm pretty efficient so without the meetings and long chats we have, I can probably do all my work in a lot less time.\n\nI won't even get started about the startup they asked me to build. They gave me the idea, I built the whole thing. Now they're using revenue from the startup to pay my wages for this job. So in essence they had a full time worker while only paying 8 work days a month.\n\nI'm not really asking for advice on what to do. I've decided that I want to get out of this situation after I've paid off some outstanding credit card debt and put more focus on my new job. The 2.5 years I spent here (almost 3 now) I feel like I've just been strung along and wasted time that I could've spent building a career. My friends and younger family members have during this period surpassed my income. I had to move back in with my parents because my projected income was way off, due to them not paying commission. They know that I've moved home, but think for some reason that it's unrelated to them. \n\nI know it was my choice to believe my bosses, and so I've made it my choice to move on. Still iffed that I lost out on $15k+ in commissions...but I'll cut my losses and just move forward. Based on the original commission structure, I should be making $4850 if I was still doing this full time, but I was only making $2800, $2000 of which wasn't even from the company, but from that startup I built with the money they invested. \n\nSometimes better to just let go and move on. I'm just curious. As someone who has owned my own business before, the thought of my employees thinking they're not being paid properly is horrifying/stressful to me. I'd rather have no employees. And if I had an employee who was a huge asset, I'd try not to do anything that might annoy her, like not pay her on time. \n\nWe talk business strategy all the time. I was really disappointed, because I really wanted to be long term at this company originally. I felt like I could do amazing things for them (and I did, while I was there). I just feel like there's this invisible limit they place on me. If I do really well, they stress out about having to pay me extra.\n\nPeople I've spoken to about this have urged me to leave since the issues started, but for some reason I felt attached to the company and I believed it was going to get better if I did better. But as I kept doing better in my job, things just got worse. \n\nMy husband has a theory that because my bosses know what a great find I am, they have always consciously or subconsciously anticipated that I'll leave the company and therefore don't put any effort into keeping me, even sabotaging it. It's true: I'm waaay underpaid for my skills. I just always thought that because I didn't have a degree in marketing that I needed to prove myself and work my way up. Well, my \"working my way up\" plan completely backfired due to choosing the wrong company.\n\nTL;DR: Bosses seem to like/trust me, I'm a huge asset to this small business, but they are really slack on paying me (on time, the right amount, at all). They've decided out of the blue to cancel my commission structure. They require me to pay myself, the majority of the pay is actually coming from a startup I built that they invested in. Just generally are really messy about this whole thing, but only to me (their only office worker). Why?\n\nSo what gives? Is there any legitimate reason for my bosses (there's two: they're partners in life and in business) to be treating me this way? And I giving off some vibe of not caring enough about money to be paid on time like a real company should? Do they not really want to keep me, but are too scared to fire me? Do they lack empathy? I know this is a first world problem, but I just wonder. \n\nSorry for the long post!! ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/403vu0/insights_wanted_do_my_bosses_not_like_me_or_do/",
      "comments": [
        {
          "body": "For those that are wondering what the punchline is in this long post, it's this:\n\n&gt; Because this is a small business, there was no employment contract, nothing.\n\nIf you are truly valuable as you say you are, you will get a legitimate contract with a predefined pay structure.  If not, you are either not as valuable as you thought, or you need to leave right away.  ",
          "score": 4
        },
        {
          "body": "They don't pay you because you let them.",
          "score": 2
        }
      ]
    },
    {
      "title": "PayPal interview experience",
      "body": "I interviewed with PayPal six months ago. I missed the LeetCode problem by just one pointer manipulation and wasn’t pushed through—the interviewer didn’t offer any guidance.\n\nI interviewed with them again recently and was pushed to a Karat round. I did okay and scheduled a retry for the following morning, but the recruiter canceled it, saying I did fine the first time and asked me to send some times for the interview loop.\n\nIt’s been a week, and I haven’t heard back. Has anyone else had a similar experience?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oxx356/paypal_interview_experience/",
      "comments": []
    },
    {
      "title": "PayPal India frontend interview – team match waiting, how long does it usually take?",
      "body": "Hi everyone,\n\nI recently completed all my interview rounds for a **Frontend Developer role at PayPal India**. After the final round, the recruiter told me that my candidature is under consideration and that it’s currently in the **team matching stage**, which might take some time.\n\nIt has now been a month since the last round. I wanted to ask if anyone here has gone through a similar process at PayPal —\n\n* How long did your **team match / offer process** take?\n* Did you get matched to your **preferred location** (in my case, Bangalore) or could it change?\n\nThanks a lot in advance!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1n23qr3/paypal_india_frontend_interview_team_match/",
      "comments": [
        {
          "body": "Hi, I am in a similar boat as you. Is there any update?",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Need advice for PayPal 2nd round HR interview (Data scientist 1 role)",
      "body": "\nHi everyone, I have my 2nd round interview coming up with HR for a Data Scientist 1 role at PayPal. The first round was a recruiter screen, and now HR will be speaking with me before the technical rounds.\nI’d love to hear from folks who’ve been through similar HR interviews. What kind of questions should I expect in an HR round at this stage?\nAre there specific things HR looks for beyond what the recruiter already asked?\nAny tips on how to show both technical credibility and cultural fit?\n\nAppreciate any suggestions you can share, thanks!! ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o4a317/need_advice_for_paypal_2nd_round_hr_interview/",
      "comments": []
    },
    {
      "title": "e-commerce job advice",
      "body": "I'm interviewing for a role of admin assistant to VP of e-commerce. Frankly I know very little about e-commerce other than paypal. The HR lady told me to \"make sure you know about e-commerce\".\n\nSo that said, what do I need to know considering the role?\n\nAny help is greatly appreciated.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1mftwx/ecommerce_job_advice/",
      "comments": [
        {
          "body": "[Literally just googled this.](http://www.sagepub.com/upm-data/9598_019964Ch1.pdf) [And this.](http://cyber.law.harvard.edu/olds/ecommerce/)",
          "score": 3
        },
        {
          "body": "I do eCommerce\n\nMake sure your SEO, online stores, and ebay are in top shape.\n\nIt's easy, just do your work. Good luck",
          "score": 1
        }
      ]
    },
    {
      "title": "Paypal Staff Frontend Engineer Interview",
      "body": "Had my 1st round today. I was told it’ll be a HackerRank round but turned out to a question answer session. Lots of JS, TS, Frontend Arch, React and Component Library questions.\n\nI think it went very well.\n\nExpecting to be scheduled for the 4 round final loop which will 1 JS/TS Coding, 2 System Design and Leadership Principles(Behavioral)\n\nI’ve been practicing on Leetcode. But I wondering why 2 System Design rounds? \n\nIs one focused on LLD and another on HLD?\n\nAny and insights are appreciated.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1lv8046/paypal_staff_frontend_engineer_interview/",
      "comments": [
        {
          "body": "yeah usually one’s LLD (component structure, state mgmt, hooks etc) and the other’s HLD (frontend infra, scaling, design tradeoffs)  \nthey’re testing if you can build cleanly *and* think big-picture  \nleetcode helps but system design prep needs mock interviews and clear frameworks  \nfocus on tradeoffs, naming, and communicating decisions out loud  \nyou don’t get points for perfect answers, you get points for how you think",
          "score": 2
        },
        {
          "body": "congrats on the first round going well! yeah the 2 system design rounds for staff level is pretty standard - ur right that one is usually LLD (component architecture, state management, how components interact) and the other is HLD (overall frontend architecture, scaling considerations, API design etc). \n\nfor staff level they really want to see you can think both in the weeds and at the bigger picture. i'd definitely practice both types since the expectations r different - LLD is more about clean code structure while HLD is strategic thinking about scalability and tradeoffs. platforms like prepfully have frontend engineers who've done these exact interview formats if you want some targeted practice before the final loop.",
          "score": 2
        },
        {
          "body": "could you share the coding questions asked in DS/Algo round?",
          "score": 2
        },
        {
          "body": "Yes, they are likely split between LLD and HLD, which is pretty standard for senior frontend roles. One round will probably focus on component architecture, state management patterns, and how you'd structure a complex React application, covering things like folder organization, data flow, and API integration strategies. The other will zoom out to discuss scalability, microservices communication, CDN strategies, performance optimization, and how frontend systems interact with backend services at scale.\n\nSince you crushed the first round, you're clearly on the right track technically. The system design rounds are where they'll evaluate your ability to think beyond just coding and into architectural decision-making. Focus on being able to articulate trade-offs clearly, explain your reasoning for choosing specific patterns or technologies, and demonstrate how you'd handle real-world constraints like performance, maintainability, and team collaboration. If you want extra support navigating those tricky behavioral and technical questions that might come up, I'm actually part of the team that built [interview copilot AI](http://interviews.chat), which helps candidates practice and get real-time guidance for exactly these kinds of challenging interview scenarios.",
          "score": 1
        },
        {
          "body": "I emailed the internal recruiter to get some insight and he said it’ll be HLD focused. But I’m preparing for both, you never know.",
          "score": 1
        },
        {
          "body": "Freaking the fuck out. Interviews tomorrow:\n\n1st Round is System Design with Staff Engineer\n\n2nd Round is Leadership Principles with Engineering Manager(Don’t know if he’s the hiring manager)\n\n3rd Round is DSA with Senior Engineer\n\n4th round got postponed to Friday because interviewer is in CDT zone and he had a hard stop at 3 pm PDT. \n\nNow I’ll have to wait until next week for decision",
          "score": 1
        },
        {
          "body": "The external recruiter has a meeting with the Hiring Manager on Wednesday(Tomorrow). 🤞",
          "score": 1
        },
        {
          "body": "Is there a DS/Algo round? And if yes, are we expected to code in JS only for Staff Frontend Engineer Interview?",
          "score": 1
        }
      ]
    },
    {
      "title": "PayPal Onsite Interview",
      "body": "I recently interviewed for the Senior Backend Engineer (Python) role at PayPal. I completed three rounds, but the final System Design round was abruptly cancelled just an hour before it was scheduled. Since then, the recruiter has stopped responding to my follow-up emails. Has anyone else experienced a similar situation?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1m1l67d/paypal_onsite_interview/",
      "comments": [
        {
          "body": "Can be a few things. They pulled the position and its not available, interviewer is out sick or out of the office, or they are not moving you forward with the position. This is all speculative though. Continue to send follow up emails once a week up to two weeks then move on to other opportunities.",
          "score": 1
        },
        {
          "body": "I am interviewing with them for Sr PM position and finished my 4th HM round on last week Monday( today is Monday when I writing this) it’s been 7 days that I have not received any response.\nI always spoke to the scheduler and the recruiter never really reached out on call.\nDoes Paypal update you even if you have not cleared or will they ghost you simply.",
          "score": 1
        }
      ]
    },
    {
      "title": "Paypal Senior Product Manager Interview",
      "body": "I am interviewing with Paypal for Sr PM position and finished my 4th HM round on last week Monday( today is Monday when I am writing this) it’s been 7 days that I have not received any response.\nI always spoke to the scheduler and the recruiter never really reached out on call.\nDoes Paypal update you even if you have not cleared or will they ghost you simply.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1m5bl4e/paypal_senior_product_manager_interview/",
      "comments": [
        {
          "body": "Could mean a few things. Could mean that they’re finishing up menial HR tasks before sending an offer out. \n\nFrom my experience though, it usually means you’re their second or third choice, unfortunately. \n\nCompanies that want you usually move fast.",
          "score": 3
        },
        {
          "body": "If their other communications were faster than this then I'd say unfortunately you may be second choice and they're waiting to hear back from another candidate first \n\nIf you applied via a portal like workday check the application status. \nBest of luck!",
          "score": 2
        },
        {
          "body": "I interviewed with PayPal for a sales role recently. They moved very quick until I must’ve bombed the final interview and then they went silent until I reached out.",
          "score": 1
        },
        {
          "body": "I’m in a similar situation, have you heard back from them yet? Which organization is it? \n\nAlso, was the hiring manager part of the panel interview, or did you have a separate round with them?",
          "score": 1
        },
        {
          "body": "OP any update on this?",
          "score": 1
        },
        {
          "body": "OP: Any updates on this? Can you please share your experience? How many interviews did you go through, and what were the type of questions in each?",
          "score": 1
        }
      ]
    },
    {
      "title": "Need Advice for upcomin paypal SDET interview",
      "body": "SDET-mobile role",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ktpwyy/need_advice_for_upcomin_paypal_sdet_interview/",
      "comments": [
        {
          "body": "You're looking at coding challenges that focus on test automation frameworks, API testing, and mobile-specific scenarios like handling different device configurations and network conditions. They love asking about how you'd design test strategies for payment flows, which makes sense given their business. Expect questions about your experience with tools like Appium, Selenium, or similar mobile testing frameworks, plus they'll want to see how you think about edge cases in financial transactions.\n\nThe mobile aspect means they'll dig into your understanding of iOS and Android testing nuances, cross-platform compatibility issues, and performance testing on mobile devices. They're also big on behavioral questions about how you've handled critical bugs in production or collaborated with developers to improve testability. The key is showing you understand that testing payment systems requires extra attention to security, data integrity, and user experience across different mobile environments.\n\nI'm actually part of the team behind [AI interview helper](http://interviews.chat), and we built it specifically to help with these kinds of technical interviews where you need to think on your feet about complex testing scenarios and articulate your approach clearly.",
          "score": 1
        }
      ]
    },
    {
      "title": "I wore shorts to an interview while it was 100 outside, did I screw my chances",
      "body": "https://preview.redd.it/oakaktzwtaef1.png?width=3420&amp;format=png&amp;auto=webp&amp;s=c1ae537bd8ce54fd2babfc8276fe08bbe1510733\n\nThese are the exact shorts i wore with i button up",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1m5w92o/i_wore_shorts_to_an_interview_while_it_was_100/",
      "comments": [
        {
          "body": "Yea shorts are a no go. That’s not professional at all.",
          "score": 19
        },
        {
          "body": "Depends on the job. But probably.",
          "score": 19
        },
        {
          "body": "It depends on the job you were applying for but most the time shorts is not acceptable. The job I have now I had to go to an interview ouside golfing and had to wear business professional clothing.\n\nRegardless of temperature I would have worn slacks that feel silky, thin, and breathable which I wore at a 96 degree humid day. This helped with my pants not sweating at all.\n\nI also wore a light button down shirt + tie that is light weight.",
          "score": 4
        },
        {
          "body": "Was the interview outside?",
          "score": 6
        },
        {
          "body": "I have hired over 100 people in my career. Never one who interviewed in anything less than business professional. Same with resume needing to be perfect. It’s not that you need to be like this all the time, merely prove that you can be when the stakes are high.",
          "score": 3
        },
        {
          "body": "Probably, but at the same time I think the world needs more people like you. You're the reason why most of us don't have to wear neckties anymore. Never change.",
          "score": 3
        }
      ]
    },
    {
      "title": "Paypal Team allocation time",
      "body": "I recently gave karat round at paypal and recruiter reached me out saying that the feedback was positive from the interviews and after asking for salary expectations at T24 level and some documents he has submitted my profile for team matching, it's been a week. Has anyone experienced the same and can share how much time it took and does this depends on the salary asked by me?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1l3g9t0/paypal_team_allocation_time/",
      "comments": [
        {
          "body": "I don't work for PayPal. I would suggest you follow up with the recruiter to see where they are at on scheduling your interview. This is going to be your best answer.\n\nI always follow up twice in two weeks and move on to other opportunities.\n\nAlso its not related to salary unless its over what they are asking for the role.",
          "score": 1
        },
        {
          "body": "Hey, where are you in the process? It’s been 3 weeks since my hiring manager told me the offer verbally but didn’t get an offer letter yet. They’ve been calling me once every week about some sort of new things like relocating to another location cause they reached maximum headcount at the initially proposed location and stuff. I’m on the same boat as you.",
          "score": 1
        },
        {
          "body": "Did any of you actually got an offer? \nI was told I cleared my interviews and team matching process is going on. It’s been 1 month and the recruiter still replies saying we are pending on team allocation. I don’t have his phone number to call but he doesn’t give more info than this.",
          "score": 1
        },
        {
          "body": "Same boat. Did any of you end up getting matched? (Or rejected?)",
          "score": 1
        }
      ]
    },
    {
      "title": "Paypal Team Matching experience",
      "body": "hello everybody! So I recently gave paypal interview and got the feedback from interviewer that I cleared them and got positive feedback last week and recruiter mentioned that he submitted my profile for team allocation. Can anybody share their experience and also it is T24 position so is there any chance this time delay is based on my salary compensation asked by me? \n\n\n\nAny insights would be really appreciated.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1l2p7y7/paypal_team_matching_experience/",
      "comments": [
        {
          "body": "Can you please share the location?",
          "score": 1
        },
        {
          "body": "Did you ever get team matched? This is for India correct? Not US?",
          "score": 1
        }
      ]
    },
    {
      "title": "PayPal/Braintree Interview",
      "body": "**Has anyone interviewed with PayPal Braintree for non-tech roles? I have an interview with the Enterprise GTM team and would appreciate any tips.** ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1buw42b/paypalbraintree_interview/",
      "comments": [
        {
          "body": "Not me but have you looked on glassdoor.com?  Maybe someone has posted about interviewing there.",
          "score": 2
        }
      ]
    },
    {
      "title": "PayPal software engineer team matching",
      "body": "Hi, I have cleared all the interview rounds for PayPal software engineer(US) position and currently in the team matching from past 60 days. \nAny idea how much time does it usually take for team matching and did anyone got team matched at PayPal recently. Please let me know it would be really helpful to know.\nAlso if anyone are in same situation you can ping me.\nThank you.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1p1wpba/paypal_software_engineer_team_matching/",
      "comments": [
        {
          "body": "Im also waiting on team matching right now, but it's only been a week so far. With everything I've seen though, I'm getting really nervous...",
          "score": 1
        },
        {
          "body": "same here!",
          "score": 1
        },
        {
          "body": "I passed a karata round. (this included a leetcode round)\n\nThe systems design round was hardly a systems design question.\n\nI passed 1 leet code problem and failed the other got caught up doing backtracking, but I told the interviewer the how I would solve it which was the correct answer. I have not received an offer how do you think I did relative to your performance. Since I have nor received an offer. I have one more interview.",
          "score": 1
        },
        {
          "body": "I’ve been stuck in the team-matching phase at PayPal since July. Has anyone else experienced long delays like this?",
          "score": 1
        },
        {
          "body": "How long did you wait to hear back after your last interview ?",
          "score": 1
        }
      ]
    },
    {
      "title": "Paypal Senior Product Manager",
      "body": "Hey Guys, \n\nHas anyone went through Paypal senior product manager interview in the recent times, i have my last round of my loop tomorrow. Iam just wondering will their be any team match after this or just direct team assignment. I spoke to a hiring manager as part of my loop, but a bit confused here seeing the other posts",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n7kx4m/paypal_senior_product_manager/",
      "comments": [
        {
          "body": "If you already spoke with a hiring manager during your loop, that's usually a strong signal that they're considering you for a specific team rather than doing a general hire-first-match-later approach. Most candidates who make it to the final round and have had that hiring manager conversation get direct team assignment if they pass, but some teams still do a brief informal team match conversation to ensure mutual fit.\n\nThe fact that you're seeing mixed experiences in other posts reflects PayPal's inconsistent process across different orgs and teams. Some groups have streamlined to direct assignment after the final round, especially for senior roles where they want someone to hit the ground running on specific initiatives. Your best bet is to ask your recruiter directly about next steps, but honestly, having that hiring manager conversation already puts you in a good position for direct placement if you nail tomorrow's round. I'm on the team that built a tool for [AI interview prep](http://interviews.chat), and we've seen a lot of PayPal PM candidates use it to practice handling those final round questions about product strategy and stakeholder management that often come up.",
          "score": 1
        },
        {
          "body": "Het just wondering when did you start your initial recruiter screen.",
          "score": 1
        },
        {
          "body": "Any update on this? Did HR get back to you?",
          "score": 1
        },
        {
          "body": "Can you please share your experience? How many interviews did you go through, and what were the type of questions in each?",
          "score": 1
        }
      ]
    },
    {
      "title": "Paypal dsa + SD round tomorrow",
      "body": "Hi All,\n\nHas any recently appeared in paypal interview dsa or sd round if yes can u pls share your interview exp or question were asked, it will be helpful",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mzq9ir/paypal_dsa_sd_round_tomorrow/",
      "comments": []
    },
    {
      "title": "PayPal Senior Backend Java ",
      "body": "\nHello All,\nI have my interview coming for Senior software engineer backend Java role at PayPal. Would really appreciate if you can give me some suggestions on how to prepare for my next round that is System design. The next rounds are as following: \n- System design \n- Problem solving ( Scenario based ) \n- Hiring manager \n- Meet with senior leadership \n\nAny would be highly appreciated 🙏🏻",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1gn37s7/paypal_senior_backend_java/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "Can you give more insight, on what were you asked in these rounds?",
          "score": 1
        }
      ]
    },
    {
      "title": "PalPal Final Interview Round",
      "body": "I have 3 rounds of PayPal interviews: \n\n1.  Customer Focus Interview \n2.  Market &amp; Commercialization Interview \n3.  Stakeholder Management Interview \n\nIf anyone has any specific tips or insights for any of these rounds, I would greatly appreciate it. I am eager to prepare as thoroughly as possible and any guidance would be invaluable. ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1c6gizm/palpal_final_interview_round/",
      "comments": []
    }
  ]
}