{
  "company": "pfizer",
  "post_count": 16,
  "exported_at": "2026-01-18T17:44:53.299Z",
  "posts": [
    {
      "title": "Pfizer graduate programme interview",
      "body": "",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1p14af4/pfizer_graduate_programme_interview/",
      "comments": []
    },
    {
      "title": "Got an interview at McDonald’s but I only have 1 shot of the Pfizer vaccine",
      "body": "Should I still go or should I wait until I get my next shot in September and then schedule another interview",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/wzcpjb/got_an_interview_at_mcdonalds_but_i_only_have_1/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Just don’t bring it up unless they ask about it.",
          "score": 11
        },
        {
          "body": "Just go to the interview.  If they bring it up/ask for your card tell them the truth. You have the first shot you intend to get your second.",
          "score": 14
        },
        {
          "body": "You could always ask the interviewer about their policy when it comes to this",
          "score": 9
        },
        {
          "body": "mcdonalds doesnt care about your vaccination status",
          "score": 4
        },
        {
          "body": "In flordia they don’t ask about any of this",
          "score": 3
        },
        {
          "body": "Nobody gives a fuck, just show up do the job.",
          "score": 3
        },
        {
          "body": "Is there some reason why you can't just go get the 2nd one?",
          "score": 0
        },
        {
          "body": "Go get the other one.",
          "score": -6
        }
      ]
    },
    {
      "title": "Pfizer Interview Timeline",
      "body": "Hi, \n\nI recently had an interview for Pfizer (New York) and I wanted to know about the hiring timeline. The people I interviewed mentioned that they would get back to me in two weeks, and it's been two weeks. I emailed them asking for an update, but I haven't gotten a response. I was wondering, for those who work or were hired at Pfizer what the hiring timeline was like.",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/q84e0z/pfizer_interview_timeline/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Is it difficult to get a job at Pfizer or any other pharmaceutical company?",
      "body": "I have a BS in biology and a masters in Marine Science and Management. I worked as a research assistant working in PCR, DNA extraction, producing and analyzing gel-electrophoresis, and sequencing DNA during senior year in uni back in 2018. I haven't done much more research work since then due to personal reasons and COVID. Instead, I've worked as a teacher for a few months, and have been a freelance writer for about two years now. \n\nI'm trying to find a suitable job in the pharmaceutical industry, but so far I've only received one offer for a biotechnician role. I'm hoping for a associate scientist or researcher role, but I'm not sure if I'm qualified enough for it. From the job descriptions, I feel its enough, however I've never been able to secure an interview.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/110xfd5/is_it_difficult_to_get_a_job_at_pfizer_or_any/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Pfizer is like the google of pharma so yes it's quite difficult. I'd get experience in an easier company before going for them",
          "score": 5
        },
        {
          "body": "Hard to say from the description, but make sure to emphasize the technical skills (PCR, DNA extract, etc.) as many entry-level roles in the pharma industry can get you through the door by having those skills. The industry itself is very competitive. You may have to work as a contractor through a contractor agency or provider (Eurofins, Actalent, etc.) to get a foothold into a Big Pharma.   \nI would say apply for those roles of associate scientist/researcher anyway. There's a lot of graduates with biology/chemistry backgrounds applying. If you have great documentation skills from your time as a writer/teacher, hiring managers may be interested as being an industry scientist requires detailed audit trails of your work.",
          "score": 3
        },
        {
          "body": "I would say yes, it can be rather difficult. Between the state of biotech since last year and the rather large employment gap in your resume in the field. Were you teaching biology at least?",
          "score": 1
        },
        {
          "body": "Their ATS is awesome at rejecting people as though they were a used piece of toilet paper.",
          "score": 1
        }
      ]
    },
    {
      "title": "Current Tattooed College Student Looking For Job Advice",
      "body": "TL;DR at bottom \n\nHi people of reddit, \n\nI am currently a senior in a respectable pharmaceutical sciences program and will be graduating this December. I will be taking the GRE in the Fall as I plan on attending graduate school; however, the program I am in requires that I participate in several mock interviews provided by different pharmaceutical companies. So far, I have done four of these mock interviews (Novo Nordisk, Merck, and twice with Pfizer) and I keep noticing a reoccurring theme. The people conducting the interviews immediately write me off because of my tattoos. When I was younger and constantly getting into trouble, I made the regrettable decision of getting my arms and one hand fully tattooed. Despite having a 4.0 GPA, working as a chemistry tutor and lab assistant, performing original published research under one of my professors, and participating in several extracurricular activities it seems like my tattoos will forever be an issue. I know this is my fault but I have worked so hard to try and make up for my past mistakes. Do you guys have any recommendations as to what I might be able to do in order to get potential employers to look past my appearance and instead look at my qualifications. Thanks a lot.     \n\nTL;DR \n\nI am a college student (Pharmaceutical Sciences/Minor in Chemistry - Senior) with a 4.0 GPA and valuable lab experience but my tattoos are making it impossible to find a job. ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/alz1ff/current_tattooed_college_student_looking_for_job/",
      "comments": [
        {
          "body": "Wear camouflage makeup on your hand until you get a job.\n\nThis is BS though, you shouldn’t be judged IMO just for tattoos, I’m sorry.",
          "score": 13
        },
        {
          "body": "Wear long sleeves isnt a option? Shouldbt a suit cover up most of these issues? If you have face tattoo i dont have sution to that",
          "score": 3
        },
        {
          "body": "Are they *saying* your tattoos are a problem in the feedback? Or are they being more vague about it (using words like “unprofessional” or “maybe not a culture fit”)? Or are you assuming based on their demeanor?",
          "score": 3
        },
        {
          "body": "Who is actually interviewing you?\n\nI'm in pharma/biotech (California) and no one would care if you had tattoos unless they were inappropriate in nature.\nThere are several techs and scientist in my group who have visible tattoos.\n\nHonestly I bet once you have a graduate degree and are looking for a job your skills/experience/publications will far overshadow your tattoos. ",
          "score": 2
        },
        {
          "body": "I know this is something that schools and our elders pound into our head but in my experience my tattoos have never been an issue. I work in a professional setting and have a collarbone tattoo and arm tattoo plus a lip piercing. I take out the lip ring for interviews and when I first started interviewing I tried hard to cover my tattoos based on what had been pounded into my head. Assuming the tattoos look decent and are inoffensive, I wonder if tattoos are truly your problem. It could certainly be different in a lab environment too.\n\nSince they're mock interviews, have you received feedback from them? Did anyone mention the tattoos? I was concerned that my appearance was somehow turning people off so I asked my current boss for feedback on my interview and he tried to gently tell me i sometimes have resting bitch face and it can be offputting, which is feedback i can use. Speculation can help but you can also end up way off the mark.",
          "score": 1
        }
      ]
    },
    {
      "title": "Employment Predicament: accepted new job working with National Institute of Health however better opportunity just arose. How to proceed?",
      "body": "I was out of work for awhile due to the pandemic. I'm a chemical engineer and work in the pharmaceutical industry, however the past couple jobs over the past few months were odd and end whatever jobs to make ends meet. A former colleague of mine, C, who I had worked previously with C at a different Pfizer site for 2018-2020, who is a well respected expert in my field with about 40 years experience and has a high opinion of me as an engineer, contacted me in January about a position with Pfizer. Where the engineering manager is looking at hiring a relatively young engineer (I'm 30, about 6 years experience) to stay with the company, to mentor/groom and replace him as engineering manager for his department within engineering in 5 to 10 years. C recommended me to the engineering director and the director was VERY keen in interviewing me for the job. Unfortunately Pfizer HR moved really slowly about posting the job and nothing came out of it.\n\nSo I continued job searching and about 2 weeks ago I accepted a new job in Washington DC to work with an engineering firm that has been contracted by the National Institute of Health for a facility expansion project. My employer covers rent and food costs in full via per-diem, a rental car, and 1 flight a month back home to the Midwest to see family. However, the pay is 40 an hour (comes out to about 83k for a full year) and I only have 3 days of PTO for the entire year.  The job has no chance for permanent employment as the contract is just from May to December and then I'd be looking for a new job all over again. I've filled out all the new hire paperwork for this role and move to the DC area on the 15th of this month for it. I had let C know about my new job (as we are on good terms).\n\nA few days ago C reached out to me saying that Pfizer had finally posted the job that he had mentioned to me in January, and that he had spoken to the engineering director after seeing it to inform the director that I already have a job that starts in 2 weeks. Engineering director responded with \"well, I'm keen on this guy you recommended, reach out to deg662032 and see if he is still interested\".  I applied, had a phone interview with an HR person. This new role would include a few weeks of PTO, and an increase of 50-70k a year from the job that I am starting in a couple weeks, fully covers relocation fees and even would buy out the rest of my lease if the complex says I still have to pay the remaining months of rent, and a better health insurance plan with better coverage and lower premiums. I would have to go thru 1 or 2 more interviews before they send me an offer, but based on the hiring manager's interest, as long as I don't trash an interview I imagine I'll get the job. Apparently they want somewhere there for this role no later than July.\n\nHow to proceed if Pfizer gives me an offer?  How to proceed if Pfizer wants to fly me to their site for an in-person interview and I am unable to obtain a day off from work due to lack of PTO?  What would be the most appropriate way to put in my 2 weeks so early into a new job without burning bridges with the NIH or the engineering firm that I work for?  \n\n&amp;#x200B;\n\nAll serious suggestions are appreciated.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/n70r9s/employment_predicament_accepted_new_job_working/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Have you carefully reviewed your employment contract for your current role? If you quit before December, what are the consequences of breaching the contract?",
          "score": 1
        }
      ]
    },
    {
      "title": "Questions about Pfizer's R&amp;D Rotational Program Interview",
      "body": "Hello! I have received a video interview invitation from Pfizer for the R&amp;D Rotational Program. This is after the hirevue and I had a couple of questions about it.\n\nCan someone weigh in about how they prepared for this interview? I am obviously willing to do my basic research but I was wondering if anyone had any specific tips that might be helpful for the face-to-face interview? What do the interviewers look for?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/17i43x8/questions_about_pfizers_rd_rotational_program/",
      "comments": [
        {
          "body": "Do you know about how long we have to wait before hearing back? Lol im a bit impatient",
          "score": 2
        },
        {
          "body": "Did anyone hear back yet?",
          "score": 2
        },
        {
          "body": "I’m in the interview process myself and I was wondering when did you hear back exactly after doing your hirevue?",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview help for pfizer as a pharm sales rep",
      "body": "Hey everyone.\nCan someone give me some tips, I have an interview Tuesday with Pfizer to become a pharm sales rep and I have no idea what is gonna happen \nSome bg on me\n29 year old middle eastern male\nFrom Chicago suburbs\nGot my bach in biology in 2012\nWent to a Caribbean med school got sick and dropped out\nBeen working a personal support assistant for 4 years.\nPrevious to med school while I was at college I worked an IT gig and was an electronic sales specialist at Target for a few years.\n\nAny and all help would be great",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/cyeihr/interview_help_for_pfizer_as_a_pharm_sales_rep/",
      "comments": []
    },
    {
      "title": "Texts and Calls for interviews",
      "body": "I recently let ZipRecruiter share my resume and info around to jobs and I have gotten one interview with a job I applied for. However, today I got a text from someone saying they’re from a nearby business and they received my application (which I didn’t send one) and would like to schedule an interview. Another person texted, called, and emailed me about a position that looks great ($43/hr as a technical writer for Pfizer nearby) but it sounds a bit too good to be true. The guy left a voicemail and he had a really thick accent. I know I shouldn’t jump to the conclusion that it’s a scam based on someone’s accent but I’m just scarred from the constant phone scams I get. Has anyone had this experience when they let Ziprecruiter have their resume?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/svr71w/texts_and_calls_for_interviews/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I haven't used Ziprecruiter in the past so I can't say. If you have the name of the person, you could try to look on LinkedIn to see if they exist? Or even lookup the phone number? I have heard a lot about job search scams these days though.",
          "score": 2
        },
        {
          "body": "A lot of recruiters use websites like ZipRecruiter, Indeed, and Monster to find candidates for various roles. Some recruiters are legit, while others are not. That $43/hour might sound great, but there might be a couple of caveats there. The benefits might be crap and/or that rate might be on the higher end of the range, which would be reserved for someone more experienced. If you put your resume out there like that, you can expect a ton of calls, emails, and texts. Just make sure you do your research on the recruiter/agency before you commit to anything. If something seems fishy, don't continue with the process.",
          "score": 1
        }
      ]
    },
    {
      "title": "Where do I go from here? New Job opportunities during COVID-19 Pandemic.",
      "body": "Hey everyone. It's Melvin here. Just posting my first here. So I'm recently on the verge of starting my second job and it's my first full time job. I was working at Cosi for two years until my company closed and then the pandemic happened. At that time, I was working part time. \n\nI had a pretty bad guidance when it comes to the job market. I finished college but in times where you need experience to get a job, but had no idea that I had to devote to internships to get experience. \n\nBut anyway, it worked out for me. I have an Associates from my local CC. I went a year on unemployment during COVID-19 and my Dominican 🇩🇴 Career Specialist from my local college that I graduated from back in 2016, helped me out a ton with navigating jobs. \n\nMy resume updated after I lost my job and she helped me out with more job opportunities. I got references from my manager and assistant managers from Cosi along with her. She reccomended me a website for nonprofit finding jobs and it helped me a ton. \n\nHaving an easier time applying to jobs like I used to and Indeed with other job sites are so saturated with people applying that it makes it difficult to find work. Plus I networked a bit during my time working at Cosi that I had a few recruiters hooking me up with other job opportunities such as Store Staff, etc. \n\nBut they went with someone else so I stayed at Cosi, my company was great with food and I learned a lot from my first time working but they had financial trouble and couldn't give everyone I worked with including myself hours. So they quit and found other jobs. I stayed until they closed, same with a few other coworkers I had.\n\nAlso I had a Spiritual Awakening late 2019 before the pandemic and it has completely shifted my life in a different direction. I'm a completely new person spiritually, closer to god. I'm Spiritual and it was a Twin Flame situation I had with a False Twin Flame Narcisssist from my country the Dominican Republic 🇩🇴. \n\nMy life went well during the pandemic and the COVID-19 madness that I'm extremely grateful because a lot of people's lives got destroyed by this bad virus. Hope you guys and your loved ones are well and safe.\n\nSo with the non profit website that my former local college alumni career specialist helped me with for finding jobs for non profits. I used it for a couple months and had better luck applying to jobs than I did prior to my first job with my resume updated. \n\nFirst one I applied to was for a Church Organizer position for 50-55K and I had the interview with the director of the church here in NYC for CUFFH, a non profit. Went well but there was three rounds of interviews. I never got far after that. Shockingly. \n\nSecond job applied to, Case Manager for Riseboro, recruitment coordinator contacted me for a phone interview. She asked if I was ok with the position and salary for 42K to then 52K. I said yes and that I needed at least one dose of the MRNA vaccines from Pfizer and Moderna. Then I said I was waiting for the Novavax vaccine to be approved by end of year as it's protein traditional vaccines. Much safer and better than MRNA vaccines which I wasn't comfortable with. \n\nSo she helped me out and has the position ready for me and to contact her once the Novavax vaccine is available. I also was looking into buying the company's stock since it skyrocketed after the vaccines getting approved internationally in other countries and by WHO. \n\nThe vaccine won't be approved until end of year by FDA and early next year it will be available. But basically I have the job and she said if I was working. I said yes until the pandemic. But yeah I have the job. Once Novavax is available early next year, I'll take the shot once and start working. \n\nSo I told my local college specialist of the opportunity and other places as well. 2022 is looking to be a positive opportunity for me as it has been since the pandemic began. New job opportunities and so on.\n\nIf I take that Case Manager position, it would be a big boost to my resume already. I've long moved on from Cosi but it was a great experience working and my Spiritual Awakening with the pandemic really got my life going. The position would offer great opportunities in the future for other managerial positions and better pay. \n\nNon profit organizations with more opportunities for me to look into so that's the situation. 42K first year wouldn't be bad because I already saved up a year and a half of unemployment and my two years at Cosi. So saving my first year and then I make 52K after that. \n\nI'm almost at 100K in savings and I had a bad start to my career and working life but I'm still in my mid 20s. But this Case Manager position would really get my life and career going for the future and I'm more excited for post pandemic COVID-19 to end. Extremely optimistic and God really pulled through for me during the pandemic. \n\nA time where people's lives are in shambles but God was there for me and this Spiritual Awakening defines the odds. It's all continuing forward from there. 42K to 52K for a second job starting out wouldn't be bad. Way better than my first job working part time for two years. \n\nThanks guys for reading. Anything to mention with stuff to make job opportunities better and smoother for me with my second job, feel free to post it here. I love Reddit and this platform has a lot of smart wise people with amazing experiences that has helped me a ton.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/rjk49j/where_do_i_go_from_here_new_job_opportunities/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Can you please include a brief TL;DR? This is a longread with unclear question",
          "score": 1
        }
      ]
    },
    {
      "title": "Irish Biotech Graduate not hearing back from employers.",
      "body": "I recently graduated with a Bsc in Genetics and Cell Biology and have been trying to enter the biotech sector. At this point I have no relevant experience as my part-time job is in the transport industry in customer care. I have been applying to many different companies but most have a minimum two year experience requirement. I would love to enter into a PhD and have also applied for a few. Currently I have had one Pfizer interview and one PhD interview and have not heard from anyone else. Any advice on how I could break into it? Is an unpaid internship my only option?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/6o98h8/irish_biotech_graduate_not_hearing_back_from/",
      "comments": [
        {
          "body": "With the info you have provided it might be worth looking into a research tech/asst position in an academic lab. This would give you the lab experience employers are looking for and not lock you into full PhD time requirement (+5 years minimum). \n\nIt'd be wise to make sure this type of position is in a lab that translates well to the biotech positions you a looking for. The added experience is great regardless, but if you really want to differentiate yourself you need experience that is completely transferable and shows you can be a value add day one (same assays/research area/instrumentation) \n\nObviously if you are committed to getting a PhD then going that route will give you the lab experience and degree at the same time, but the same considerations apply as in the last paragraph and it is a huge investment. Additionally a lot of biotech companies want to hire non-Phd's (because it benefits them as they can pay you less and train you if you've got a good foundation, see above). Getting in the door is the hardest part. Stay positive and stay diligent.\n\nEdit: this comes from a US perspective ",
          "score": 3
        },
        {
          "body": "Not having lab experience is a HUGE black mark for companies hiring BS level. These positions are almost 100% lab based and they are looking for people with demonstrated lab skills. Experience requirements are often best case scenarios, but having no lab experience is a HUGE negative. Find ANY way that you can to get research experience. Email PI's in your university, do everything you can to try to get real world lab experience.",
          "score": 2
        }
      ]
    },
    {
      "title": "Made a huge error on my resume and now need some advice.",
      "body": "I put the wrong start date for my current job. It was January 2013, insead i hit 2012. One year makes a big difference. I've submitted to some really great positions (about three at huge companies, Pfizer, and Johnson &amp; Johnson are the main ones). \n\nI caught this, when I had an interview yesterday, the women asked why I wanted to leave my position after two years of work, and I noticed the error on my resume. STUPID STUPID STUPID.\n\nI'm more than qualified for the positions even with just the one year in my current role, it worries me that they probably contacted me because of that second year slapped on there\n\nHow should I approach them about swapping the resume on file, call, say I have an updated resume, and hope they don't catch the change, or what?\n\nEdit: format\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1vrlfb/made_a_huge_error_on_my_resume_and_now_need_some/",
      "comments": [
        {
          "body": "&gt; call, say I have an updated resume, and hope they don't catch the change",
          "score": 1
        },
        {
          "body": "I'd ask about uploading a new resume and editing your job file. Just tell them you caught an error and get it done quickly. ",
          "score": 1
        }
      ]
    },
    {
      "title": "First interview in decades…",
      "body": "Yeah so I had my first real interview as I’ve been laid off recently. I prepared by selecting about 8-10 interview selections from the web. Then I wrote the answers to them. Then every night I rewrote the answers for about 3-4 times. Then I had the interview and crushed it!  I was nervous for about 3 minutes going into it and after I successfully answered the first question, I was so much more relaxed. \n\nA few days later I get a message that they’re not going forward with me. I wrote back, hey I thought I interviewed pretty well, would you mind giving me some feedback?  And then the manager said I did interview well but they decided on another candidate with a better skill set. \n\nIn my old job at Pfizer, if someone interviewed really well, we’d find them a position elsewhere. I guess it doesn’t happen everywhere… but there may still be hope for me.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/wg2qcw/first_interview_in_decades/",
      "comments": [
        {
          "body": "Yep, that happened to me too. Nothing bad to day about me, just unfortunate that the other candidate had more experience in something. Might depend on the size of the company, smaller companies will have tighter budgets.",
          "score": 1
        }
      ]
    },
    {
      "title": "STEM Job Help / Suggestions",
      "body": "Hey /r/jobs, I was wondering if I am doing something wrong, or if I'm just a product of this shitty economy. \n\nI hold a BS degree in molecular biology and a minor in chemistry from a top public university and I cannot seem to land even a basic lab technician job within the field. I have roughly six months of experience in a lab setting as an undergraduate researcher in addition to the 2+ years of experience from all of my coursework. A lot of big companies are in my area (pharmaceuticals such as Boeringer, Pfizer, etc. - hospitals, laboratories) but none of them seem to even consider you if you don't have at least two years of experience under your belt...\n\nI graduated in 2011 and have been looking nearly non-stop, and have gone on several interviews with no positive results. I'm currently working at a thrift store for slightly above minimum wage and it's killing me because I can barely afford to make my monthly payments to Sallie Mae, and I can forget about a savings at this point.\n\nWhat's the best thing for me to do? I'm tired of the seemingly endless submissions to indeed and careerbuilder, but it seems like it's near impossible to even get an interview any other way...",
      "subreddit": "jobs",
      "score": 9,
      "url": "https://reddit.com/r/jobs/comments/23h7kq/stem_job_help_suggestions/",
      "comments": [
        {
          "body": "You need to volunteer or intern. Contact your local medical examiner's office and see if you can intern anywhere in any of the forensic labs. It will connect you with important people in your field, and it's something to put on your resume as you continue to search.  Do you have any clinical certifications, such as CLIA?",
          "score": 2
        },
        {
          "body": "Temping is the new intern. When you do eventually land a permanent position it is unlikely to be stable or interesting. Grad school is a good option if you actually want a career in chemistry labs. If not, then it is wise to pursue other careers.",
          "score": 2
        },
        {
          "body": "you may have tried this, I entered\n\nforeign jobs in molecular biology\n\ninto Google",
          "score": 2
        }
      ]
    },
    {
      "title": "Pfizer interview",
      "body": "Hi !\n\nI have applied for an automation engineer role at Pfizer, and now I have the opportunity to complete my third round of interviews with  2 senior engineers and 1 automation specialist.  \nThis is my first time for a job and I am a bit nervous. I was hoping for some tips and advice for preparation. It's 6-7 days away.  \nThank you.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1an8ify/pfizer_interview/",
      "comments": [
        {
          "body": "Wear a suit, see if you can find interview questions for them on Glassdoor. Don't be nervous go in with the mindset that they need to convince you to take the job.  Send a thank you email after the interview.  Keep applying to jobs until you get hired and start a job.",
          "score": 1
        }
      ]
    },
    {
      "title": "Passed right-to-work check at Pfizer, is there a chance there are more candidates?",
      "body": "I live in the EU with a temporary residency card. Went through one interview, one panel meeting and then the manager did a brief call to explain that there were good feedback from the team present at the panel and the next thing is a right-to-work check. I got the OK from the company that did the check but haven’t heard from Pfizer (manager said they needed to fill the position quickly). \n\nMy question is, does anyone know if they do the right-to-work check with a few good candidates or only with the one?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/17bn5qy/passed_righttowork_check_at_pfizer_is_there_a/",
      "comments": []
    }
  ]
}