{
  "company": "pinterest",
  "post_count": 29,
  "exported_at": "2026-01-18T17:44:53.299Z",
  "posts": [
    {
      "title": "If AI can roast your resume, you're not getting past the ATS bots",
      "body": "I’ve spent years as a hiring manager, and I’m seeing a massive disconnect between \"pretty\" resumes and \"functional\" ones. Most people spend hours on Canva making their CV look friendly to a human eye, but they forget that a bot is the first gatekeeper.\n\nYou have to recognise that this is a game matrix and play it like you own it, or don't get into the ring:\n\n* Format for parsers, not Pinterest: Use standard headings.\n* Quantify everything: If you didn't include a number, you didn't do the task.\n* Don't use pretty graphs to show language fluency or skill levels, be explicit: Java Development - Expert level\n* Keywords are king: If the job description asks for \"Java,\" and you wrote \"Coding,\" the bot doesn't care.",
      "subreddit": "jobs",
      "score": 58,
      "url": "https://reddit.com/r/jobs/comments/1q7avc6/if_ai_can_roast_your_resume_youre_not_getting/",
      "comments": [
        {
          "body": "That [Does My CV Suck dot Com](https://doesmycvsuck.com/) looks interesting. Decided to upload my current resume and it said \"8/10; FINE, IT'S DECENT\". It roasts in both ways.\n\nAlso, footer quote is good too:\n\n&gt; \"Your CV is like a joke. If you have to explain it, it's probably not good.\" - Anonymous Recruiter",
          "score": 31
        },
        {
          "body": "I just plugged my resume in for a position I was just accepted for and it basically said my resume was trash and I had 0% chance of being accepted lol",
          "score": 12
        },
        {
          "body": "ngl, the more i think about it, at this point if we really are fucked beyond repair then we might as well just actually give up and do what we want and stop feeding into everything",
          "score": 34
        },
        {
          "body": "&gt;Quantify everything: If you didn't include a number, you didn't do the task\n\nI was a children's tutor, how would I quantify that?",
          "score": 4
        },
        {
          "body": "maybe we shouldn't have bots look at resumes before people?  just thinkin",
          "score": 3
        },
        {
          "body": "Weird, this was the results of mine, which I'm sure this thing could be used to skim and pull information from candidates or users.\n\n# ATS Murder Rating\n\n7/10\n\nDecent ATS compatibility, could use more keywords specific to Operations and Auditing.\n\n# Buzzword Overdose\n\nMedium\n\nSome relevant buzzwords, but phrases like 'streamlining workflows' feel overused.\n\n# Recruiter Eye-Roll Factor\n\nModerate\n\nThe CV includes some industry jargon but lacks specificity that truly resonates with Operations and Auditing.\n\n# Corporate Cliché Density\n\nModerate\n\nClichés like 'proven record' and 'strong focus' are present; fresh language would be more impactful.\n\n# Desperation Level\n\nConfident\n\nThe candidate displays confidence without overt desperation, which is a plus.\n\n# Length Appropriateness\n\nPerfect\n\nCV length is appropriate for industry standards; concise yet informative.",
          "score": 2
        },
        {
          "body": "Please learn how to take a screenshot.",
          "score": 2
        }
      ]
    },
    {
      "title": "How did you score a job at: Google, Facebook, Amazon, Apple or a fortune 500 company in general?",
      "body": "I'm curious, for those of you who work at a top Fortune company or a top company in general, how did you score a job there? Did you know someone? EDIT: Just to clarify, I don't want to sound like I'm hung up on just the big designer name tech companies that are public...it would be cool to work at \"Far along\" start ups such as HOUZZ, Pinterest, Slack, or even UBER, but those recruit just like the big names I feel like.\n\nI'm curious because I feel like I've put in my time getting and gaining experience as a Graphic Designer (Currently Senior Graphic Designer in marketing, 7 years experience BUT would like to break into UI/UX with limited experience) and as of recently I've shot my resume out to some of these top companies and top start ups and nothing. Now I know you need to cater your resume to these companies as they get filtered in these application systems before even reaching a recruiters eyes so I've used a tool like Jobscan to compare my resume to the job description, but still...nothing!\n\nI'm just curious if you knew someone to get into a top fortune 500 company or top start ups? In my past, I've worked in retail jobs such as Apple Retail (Prior to being a graphic designer), and I see some of the WORST employee's getting jobs at Apple Corporate, Facebook, Google...granted they aren't Graphic Designers by profession and they don't have a portfolio counting against them...I feel like I'm good enough to apply at some of these companies now and these mediocre workers somehow get into these high profile companies. So I know I shouldn't compare myself but it really bothers me that some of these folks don't even have college degree's and that I know some had TERRIBLE work ethic when I worked with them, why are THEY getting jobs at these top fortune 500 companies and I'm not even getting a chance?\n\nThat's not to say I'm a terrible designer, I do get linkedin recruiting request but its for fresh start ups and in the slowing economy, I don't want to take a risk on a freshly seeded startup that may flop. But back to my question, I just need to know if I need to know someone just to get into these companies...I mean I wish I could say I could reach out to some of these folks but we were never close so I don't want to be that person who asks, and they don't respond cause unfortunately, we live in a world where people are \"every man for themselves, if you're not my best friend, I'm not gonna help you\"...sorry if that sounded negative but it's just been my experience. If anyone could give their two cents, I'd really appreciate it!\n\nEDIT: Just one more tidbit, some of you suggested contract gigs, TBH I had a terrible experience myself personally AND I've heard horror stories of Apple being one example where they bring you on as contract but fail to actually ever convert you...I get, if you suck, don't convert them, but sometimes I also feel people try super hard but they get strung along and never get converted to Full time with benefits. So I mean if you've had luck getting converted, please do tell and I may reconsider contract gigs...granted I also know it's nice in a sense it ads to your \"experience\" on your resume and as a designer, that + portfolio may do the trick (Oh and knowing someone).",
      "subreddit": "jobs",
      "score": 87,
      "url": "https://reddit.com/r/jobs/comments/59pug7/how_did_you_score_a_job_at_google_facebook_amazon/",
      "comments": [
        {
          "body": "Interviewed at Google 5 times.  Rejected all 5.\n\nI simply have no idea.",
          "score": 53
        },
        {
          "body": "connection...a friend of mine got a pretty decent gpa about 3.5 but he didn't do any internship or extra curricular activities and got a job working on apple as UX designer due to the company connection with his uncle.\n\nits just how the world works now..connection, network and connection. Because connection = trust ( most of the time )\n\nif you want to get that job then you need earn your respect and reputation among someone that is close with the company.",
          "score": 35
        },
        {
          "body": "If you want to work for a Fortune 500 company then I hear Wal-Mart is hiring. ",
          "score": 70
        },
        {
          "body": "My good friend got a job at Google by having a 4.0 GPA at The University of Florida in computer engineering, while obtaining an internship during the summers at a technology marketing company. Basically he studied a lot and had good common sense.",
          "score": 18
        },
        {
          "body": "I interned at a fortune 100 company but I am in a STEM field so the process may be a little different. My girlfriend is in user experience design and her first job out of college was at a fortune 50 company. Neither of us had any connections that helped us get these positions. \n\nI'll speak to her process as it may of been more relevant to you. Her senior year of college she taught herself basic HTML/CSS and some Jquery, and offered her services for free to local business to make them web sites as a freelancer. By the time she graduated, she had a portfolio of websites, web site designs and wireframes that she created for all of these people.\n\nFrom my experience, Fortune 500 companies are actually some of the top employers of new graduates. Almost all of them have jobs designed specifically for new graduates, and even recruit on many campuses. Her case was similar, as there was a job posting at a local fortune 50 company for new graduates with some UX experience. \n\nTo sum it up: she planned well in advance prior to graduation by looking at the skills that are in demand in her field, taught herself the basics to get her going and did free/low pay work on the side to build up a portfolio to show that she has experience in these in-demand skills. ",
          "score": 25
        }
      ]
    },
    {
      "title": "Pinterest Engage Program Interview Process Question",
      "body": "I have an interview for Pinterest Engage Program on Wednesday and I know I will have a personal interview along with a short code walkthrough and I want a bit more information about it if anyone has gone through the program. This is for the Software Engineering Engage Internship.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/5tpgo1/pinterest_engage_program_interview_process/",
      "comments": [
        {
          "body": "I went through it",
          "score": 1
        },
        {
          "body": "did you get in? Are they still accepting people?",
          "score": 1
        }
      ]
    },
    {
      "title": "Daily Chat Thread - October 18, 2019",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/djjtpr/daily_chat_thread_october_18_2019/",
      "comments": [
        {
          "body": "how different are new grad vs sde intern questions for amazon?",
          "score": 0
        },
        {
          "body": "Edit: Company is Bentley Systems\n\nI completed their coding challenge 2 weeks ago and I was offered an onsite interview with them at their local office in my city. Anyone have an experience with their onsite interviews? How is the compensation and how is it working there as an intern? Can I make an impact or be part of a project that makes an impact instead of just some prototyping?",
          "score": 0
        },
        {
          "body": "Got a new grad Amazon offer for Seattle, and I'm wondering if anyone could ballpark what kind of commute I should expect.  I'd like to live alone (I only need like 1 room), too, and I have no idea what rent costs are.",
          "score": 1
        }
      ]
    },
    {
      "title": "DEAR VALUED CONTRIBUTORS -- FRIDAY RANT THREAD FOR October 21, 2016",
      "body": "AND NOW FOR SOMETHING ENTIRELY DIFFERENT.\n\nCAN'T STOP WON'T STOP DON'T STOP CODING!\n\nTHIS IS THE RANT THREAD. IT IS FOR RANTS.\n\nCAPS LOCK ON, DOWNVOTES OFF, FEEL FREE TO BREAK RULE 2 IF SOMEONE LIKES SOMETHING THAT YOU DON'T BUT IF YOU POST SOME RACIST/HOMOPHOBIC/SEXIST BULLSHIT IT'LL BE GONE FASTER THAN A SPEEDING TRACER.\n\n(RANTING BEGINS AT MIDNIGHT EVERY FRIDAY, BEST COAST TIME. PREVIOUS FRIDAY RANT THREADS CAN BE FOUND [HERE](https://www.reddit.com/r/cscareerquestions/search?q=Friday+Rant+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).)\n",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/58m4mw/dear_valued_contributors_friday_rant_thread_for/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 13
        },
        {
          "body": "I JUST HAD A FINAL ROUND INTERVIEW FOR AN INTERNSHIP, AND I DIDN'T EVEN KNOW IT WAS A FINAL ROUND. THEY JUST TOLD ME AT THE END OF IT. THIS COULD POTENTIALLY BE MY FIRST SOFTWARE ENGINEERING INTERNSHIP AND EVERY APPENDAGE I HAVE IS CROSSED!",
          "score": 12
        },
        {
          "body": "I SPENT THIS SEMESTER STUDYING FOR INTERVIEWS AND I LAG BEHIND IN CLASSES SIGNIFICANTLY. FUCK.",
          "score": 10
        },
        {
          "body": "APPLIED TO SO MANY PLACES YET HAVEN'T HEARD BACK FROM ANYONE. FML. FUCK MY RESUME",
          "score": 7
        },
        {
          "body": "THE CREATION OF SALARY SHARING SURVEYS IS VERY COMPLEX\n\nI HONESTLY DIDN'T KNOW WHAT I WAS GETTING INTO WHEN I SIGNED UP FOR THIS\n\nHOPEFULLY PEOPLE DON'T YELL AT ME WHEN I DO SOMETHING WRONG :'(\n\nEDIT: ARE -&gt; IS",
          "score": 10
        },
        {
          "body": "RESUME QUESTIONS ARE SO REPETITIVE, I WONDER IF YOU COULD TRAIN A NEURAL NET TO AUTOMATICALLY SUGGEST IMPROVEMENTS AND FIXES.",
          "score": 7
        },
        {
          "body": "[deleted]",
          "score": 6
        },
        {
          "body": "IT'S NOT FAIR THAT THIS NEW HIRE IS CATCHING ON SO QUICKLY.  HE'LL EVENTUALLY BE MY BOSS IN A FEW YEARS.  MUST KEEP REMINDING HIM THAT HE'LL DIE ALONE SO I KEEP MY COMFY POSITION IN THIS COMPANY.",
          "score": 13
        }
      ]
    },
    {
      "title": "What's the Pinterest Internship Interview process like?",
      "body": "",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/55tumb/whats_the_pinterest_internship_interview_process/",
      "comments": [
        {
          "body": "Online screen -&gt; 2 phone interviews.",
          "score": 12
        },
        {
          "body": "I gave my first technical round yesterday and got invited for the second round today. My first round was flawless in terms of coding. I used Python and the interviewer asked me to execute both the questions on coderpad.\n\nThe HR mentioned that second round will be based on ranking and my PhD domain (which is data mining). Does anyone have an experience with this kind of interview round?",
          "score": 3
        },
        {
          "body": "What's it like for new grad positions?",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "I completed the online coding challenge and got invited for the first telephonic interview round. I am just not sure what will they be asking but the online round was to do some python and sql coding. ",
          "score": 1
        },
        {
          "body": "Anyone have the \"additional phone interview\" at Pinterest? \n\nWhat does it mean when they need such an additional interview? Are they on the verge of rejecting or selecting or are they somewhere in the middle?\n\nAnd what is expected from this interview to get the offer?",
          "score": 1
        }
      ]
    },
    {
      "title": "need advice on choosing PhD internship offer",
      "body": "Third year phd student, mainly looking for a research/MLE internship where I can do some research instead of engineering work. I have already accepted Adobe's AS internship but later found that the team is very toxic. Now I am considering other options.\n\n  \n1. Handshake AI, new team, I was told that they don't have a specific project so I can do whatever I want. Pay is very good (about &gt;10k more than others for the summer), but my main concern is the lack of mentorship.\n\n  \n2 Pinterest visual search team: still in team match interview, so not sure if I can get the offer or not. The direction aligns with my interest but I heard that pinterest MLE interns were mostly doing engineering work instead of research.\n\n  \nDoes the team at Pinterest sounds better for internship than Handshake? Should I accept Handshake now (since the offer will expire this week) or wait for Pinterest? ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ppczsw/need_advice_on_choosing_phd_internship_offer/",
      "comments": [
        {
          "body": "How confident are you that Handshake is an actual research position?\n\n\nI would bet the Pinterest position is applied/industrial ML and I would not rule out getting a paper out of it. There are, however, some quite good people at Pinterest.",
          "score": 1
        }
      ]
    },
    {
      "title": "Pinterest apprenticeship",
      "body": "Hi! Has anyone done Pinterest apprenticeship program? Has anyone applied? I applied online and didn’t even get a chance to interview, got a rejection letter 2 days later. For people who got to the interview stage, what is your background? If you work at Pinterest, what are you looking for? I thought I was a very good candidate, don’t understand why I immediately got rejected.",
      "subreddit": "cscareerquestions",
      "score": 26,
      "url": "https://reddit.com/r/cscareerquestions/comments/rgt07h/pinterest_apprenticeship/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 6
        },
        {
          "body": "I applied in over a month ago and got an acceptance to the next round last Friday!",
          "score": 6
        },
        {
          "body": "Pinterest is a top tier tech company. Even great quality applicants are gonna get rejected.",
          "score": 3
        },
        {
          "body": "Does anyone have their final interview scheduled?",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 2
        }
      ]
    },
    {
      "title": "What kind of sys design questions do Pinterest ask for SDE-1 roles",
      "body": "Hey all,\n\nI have an interview with Pinterest coming up and the recruiter mentioned that there's going to be a system design question. This is for an SDE-1 position. Does anyone know what kind of sys design questions were recently asked for L4/L5 positions?\n\nThank you",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1fz5tgl/what_kind_of_sys_design_questions_do_pinterest/",
      "comments": [
        {
          "body": "Hello, could you share any details of this interview? I don’t have any callbacks but curious as I’d like to apply.",
          "score": 1
        }
      ]
    },
    {
      "title": "[Guide] Internship Hunting as an Underclassman and Community College student",
      "body": "While this post was written with industry-oriented American community college students in mind, most of it is applicable to any freshman or sophomore student.\n\nI’m wrapping up my sophomore year of community college and have had a reasonably successful experience. For Summer 2018 I received attention from several well known companies (ex AirBnB, Microsoft, Qualtrics, more) as well as smaller but really interesting companies. By “attention” I mean at least an invitation to a first round sent directly by a recruiter, indicating they screened my resume (i.e. not Twitter). I also met cool people, got a couple publications, and am on track to graduate from a great university.\n\nCC has lots of pros, including teaching-oriented professors, small class sizes, and low costs. But it also brings unique challenges, such as internships like [this one](https://imgur.com/a/fCQde) that actively exclude CC students (even though they’re aimed at “historically underrepresented” underclassmen that CCs are full of. Ok Google.). It’s generally difficult to get an internship as an underclassman at any institution, but hopefully this mashup of experience and tips will be helpful.\n\n**1: Building a resume**\n\nContent\n\n* Phrase everything on your resume like an achievement. Here’s some before and after examples from [SJSU](http://www.sjsu.edu/careercenter/students/find-a-job-internship/resumes-cover-letters/accomplishment-statements/index.html) and [UVA - Darden](http://dardenexeced.com/uploadedFiles/Darden_Web/Content/Admitted_GEMBA/Career_Development/Update_Your_Resume/Building_Your_MBA_Resume.pdf).\n* If you’re in community college, make sure to indicate your intention to transfer somehow, like [this](https://imgur.com/a/1cZiS) or [this](https://imgur.com/l1YdXXs).\n* It’s okay to use stuff from High School, but stick to stuff that’s relevant (Robotics Team) or shows responsibility (School Board Student Rep). Drop things as you gain experience in college.\n* Have career services or a non-STEM major friend proofread your resume and ensure it's understandable by non-technical readers.\n* When you have informational networking meetings, end by asking if they can give you advice on your resume. Your resume will improve and you’ll set yourself up for future referral requests.\n* You can also have your resume reviewed on /r/csq's resume review threads (somewhat inactive) or [this FB group](https://www.facebook.com/groups/1487708811477672/) (active, but almost entirely fellow interns).\n\nDesign\n\n* Use a simple but aesthetically pleasing template. There’s lots of options but you can’t go wrong with any of [these](https://resumake.io/generator/templates) latex templates, or this Word template from Cornell’s engineering school ([download link](https://www.engineering.cornell.edu/sites/default/files/users/user240/Undergrad%20Resume%20Template.docx)).\n* Create a second, attention-catching resume for career fairs and other in person events. Some inspiration and design resources are canva.com, cakeresume.com, or pinterest.com (but don't include a profile picture).\n* If your resume looks a little empty (typical for underclassmen), try different templates or use design elements like [lines](https://imgur.com/a/2ilcP) or [spacing or columns](https://imgur.com/a/u5ro2) to fill up the white space.\n\n**2: Gaining experience**\n\n* Don’t sacrifice your grades. If you’re in community college, your primary goal is transferring! You're early in both your education and career.\n* **Research:** Email professors at local universities about research opportunities. Don’t restrict yourself to the CS department; most departments use programmers. Don’t expect payment but keep an eye out for grant and conference/networking opportunities, like the [ACM Student Research Competition conferences](https://en.wikipedia.org/wiki/ACM_Student_Research_Competition). [Here's](https://ugr.ue.ucsc.edu/email) a guide to emailing professors for research, with examples of emails that worked. \n\n While research work is sometimes not as interesting as industry work to industry people, research internships can provide development experience, exposure to emerging technologies, and compelling content for transfer, grad school, and internship apps. And it's a great experience.\n* **Projects:** The easiest way to accumulate projects is through hackathons. [MLH Hackathons](https://mlh.io/) also usually serve as recruiting events. If possible, join the local universities’ CS major social media groups because they are often advertised there. If you do a project on your own, remember that the point is to demonstrate skill and not necessarily originality. If you're having trouble, browse the [devposts](https://devpost.com/hackathons) for past hackathons for inspiration.\n\n* **Extracurriculars:** Join some clubs, or start them. Your club could offer tutoring, leetcode practice sessions, talks by local engineers/recruiters/professors. Or it could be unrelated to CS and show leadership and dedication. ECs help with networking, job apps, transfer apps... and friends, if you’re into that.\n\n**3: Gaining industry experience**\n\n* Recruiting for Big Name companies kicks up in **early September** for the following summer. Apply online while keeping an eye out for recruitment events near you. Universities sometimes let local CC students attend their events. There are also independent events like Grace Hopper or Twitter’s #firstflight and useful Facebook, Linkedin, and Reddit communities.\n* As a CC student you’ll come across a lot of postings that say you must be at a 4 year university to apply, but you should apply anyway, especially via referrals or recruiting events, because you never know. Google, for instance, said they would consider CC students intending to switch to a 4 year the next year when I emailed them. \n* Don't forget or underestimate local companies and non-tech companies! Many of these begin recruiting in January or later. Keep an eye on Craigslist or send cold emails for spots at local companies.\n* Experience snowballs. Whether you start with a no-name company, research, or some serious personal projects, filling up your resume makes it way easier to get interviews.\n\n**4: Additional options for Summer**\n\n* You’re probably not going to land an industry internship as an underclassman, especially at a CC, without some connections or previous experience. This is not a big deal; there are lots of ways to make summer productive.\n* **Summer Research.** Options include [NSF REUs](https://www.nsf.gov/crssprgm/reu/list_result.jsp?unitid=5049), the Department of Energy's [community college](https://science.energy.gov/wdts/cci/) or [4 year equivalent](https://science.energy.gov/wdts/suli/)) and other government programs, and emailing professors at local universities.\n* **Google Summer of Code.** Here's a link to a ([helpful guide to GSoC](http://write.flossmanuals.net/gsocstudentguide/what-is-google-summer-of-code/)).\n* **Teaching.** Try TA-ing classes (even if your school doesn’t have a formal TA program), leading a kid’s coding camp, leading workshops for a local FIRST robotics team, tutoring, or other similar options. \n* **Interview Prep.** Hit the ground running in fall by spending your summer preparing for interviews. If you haven't taken Data Structures, taking it through a [MOOC](https://en.wikipedia.org/wiki/Massive_open_online_course#Notable_providers) is a great way to prepare for a common weeder class and internship interviews. Berkeley shares all of their in-person [CS 61B](https://web.archive.org/web/20170930185417/https://people.eecs.berkeley.edu/~jrs/61b/), Data Structures, class material and homework assignments online.\n\n**5: Academics**\n\n* Before you start community college, pick a college/university that you’d be happy to transfer to. Meet with a counselor there and understand their pre-requisites for transferring. This doesn’t need to be the only school you apply to, but it’ll help you organize your academic plan. \n* One of the biggest issues transfer students face is having to retake classes that won't transfer for course credit. To minimize this, outline a plan of what classes you'll take and what year you'll transfer and have it approved by counselors at both your community college and intended 4 year. Follow “articulation agreements” when available.\n* ***DO NOT aim for an AA***. Aim to complete the transfer pre-requisites you outlined with your counselors. If you incidentally finish an AA along the way, great.\n* Don’t pick a community college just because it’s the closest to you. Consider if it has branch campuses and, if so, how often you will have to travel to classes there; if it offers any CS classes; if it offers tutoring services; if it offers on-campus jobs; etc. Your best option might be a community college slightly further away.\n* If you live near a university and can afford it, try enrolling in a class there as a non-degree seeking student. Doing so allows you to expand your network, makes you a better transfer candidate, and gives you better access to university services like career fairs.\n* Make your guidance counselor your best friend. If you have any questions or concerns, be it financial, academic, or career related, ask! I have so many friends who are taking an extra year or more in community college simply because of incorrect assumptions. If your guidance counselor gives you attitude, switch to a new one.\n\n**6: Additional reading**\n\n* /u/michaeldeng18's [medium post](https://medium.freecodecamp.org/how-to-land-a-top-notch-tech-job-as-a-student-5c97fec82f3d#.fsea4t1r5) entitled \"How to land a top-notch tech internship — and a tech job — while you’re still in school\".\n* A [list](https://callajun.github.io/csfrosh/) of underclassman internships and advice on applying.\n * Uber started a new one in 2019: [Uber STARS](https://www.linkedin.com/jobs/view/uberstar-program-2019-at-uber-969503004/)\n* A [list](https://github.com/HackathonHackers/groups) of useful Facebook groups, some more active than others. A lot of opportunities are advertised in these groups, including internship opportunities, hackathons, company events, and AMAs by tech workers.\n* A community college student's [reddit comment](https://www.reddit.com/r/cscareerquestions/comments/3omczo/is_going_to_community_college_and_2_years_of/cvykzti/) demonstrating how their resume evolved as an underclassman.\n* Hasseb Qureshi's [guide](https://haseebq.com/how-to-break-into-tech-job-hunting-and-interviews/) on breaking into the tech industry from a non-traditional background, with advice on job hunting and interviews. It's targeted at full time jobs, but it's still a useful read. \n* User's [best advice](https://web.archive.org/web/20171201091930/https://www.reddit.com/r/cscareerquestions/comments/7glzx1/what_is_the_best_cs_career_advice_that_youve_been/) they ever got.\n* (If you've got other useful links to share, let me know!)\n\nAll of the above is based on my experiences. If you have disagreements or adendda, please share them!",
      "subreddit": "cscareerquestions",
      "score": 172,
      "url": "https://reddit.com/r/cscareerquestions/comments/7wxf21/guide_internship_hunting_as_an_underclassman_and/",
      "comments": [
        {
          "body": "First of all, thank you for writing this!\n\n&gt;got a couple publications\n\nWhen you say publications, do you mean in academic journals? If so, were you credited as an author?\n\nI want to do research but it seems so far away as a CC student.",
          "score": 8
        },
        {
          "body": "Dude genuinely this was an awesome post like seriously so helpful to incoming CS/engineering majors. And I seriously appreciated the examples for each thing you referenced ty so much!!!!",
          "score": 5
        },
        {
          "body": "Thank You, OP. I am a CC student who really has a hard time to find an intern. \n",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "Thanks bro. Really interesting how Google actually said they would let you intern as long as you intend to transfer. I feel like I should have applied for EP then haha :/ transferring anyway though. Thanks again OP.",
          "score": 2
        },
        {
          "body": "Keep at it hopefully you land something",
          "score": 2
        }
      ]
    },
    {
      "title": "Juggling a job doing defense-stuff, where to find the time to learn web dev, LC, and portfolio projects?",
      "body": "**Background**\n\nTLDR; My job does not train me for my next role, and they don't pay as much to do boring stuff. \n\nI'm currently doing maintenance work at a defense company, in C++, in a non-traditional minimal-coding role i.e., C++ code is generated after I specify the system behavior using UML (I recently learned this paradigm of development is called \"[Model-Driven Development](https://www.youtube.com/watch?v=3aoLV5i1feo)\"). Essentially, the role involves expressing complex \"business logic\" in a modeling language (UML), using a tool generate code to implement that logic, and troubleshooting at \"model level\", given software requirements and specification of system behavior, where logic is broken. This development approach is domain-oriented -- the emphasis is in knowing/learning the \"business logic\", which is knowledge that is less transferable over to tech.\n\nTransferable skills are those that are technical and domain-agnostic in nature (coding language syntax, frameworks, code-management e.g., version control/dev-ops) but it *can* include domain-oriented stuff e.g., features for a shopping cart website.\n\nI'm in a situation where the domain-oriented knowledge wouldn't transfer, a situation where it would take a decade to develop those domain-oriented knowledge and proficiency with the MDD tooling, and a situation where the pay wouldn't scale with the knowledge/proficiency that I develop.\n\n**Problem**\n\nI'm looking to move into tech and using this lull in hiring to upskill. But the transition is tricky:\n\n1. I don't want to lose employment and take a hit to personal finance, which means I can't entirely abandon MDD and C++.\n2. I can probably get a web-dev job at my current company but I think I'd have trouble explaining to my manager how I'd developed a different set of skills to quit my current job. He's been training me for the past 2 years to replace a guy who's retiring in a year or two. It'd be @$s-holish to cruise for another 2-years and quit just as the older guy retires. The decent thing to do is to let my manager know now so he can train another person, but doing so is against my interest - I might get fired!\n3. There is a lot to learn: (1) Web dev basics, (2) Frameworks to build projects, (3) LC for tech interviewing.\n\nI have \\~4-5 hours after work on weekdays, all weekends (2-3 days unstructured time). I started learning DS&amp;A (in C++) and doing LC problems but doing so takes time away from learning web dev stuff (HTML, CSS, JS) and doing portfolio projects.\n\nRe: Problem (3): Progress in DS&amp;A is slow - I have a handful of DS to learn (Trees, Graphs, Priority Qs, Tries) before I can begin to apply them in problems. I also have to learn how to implement and use those DS in C++, which is also a f\\*cking chore to learn (Want to know how to use containers? You have to learn how to use templates -- and Rule of 0/3/5, value/move semantics,... and these are just \"the basics\"). I have a software-related engineering degree but it's not CS so I'm playing catch-up with the kids who learned this for their CS degree). As you know, DS&amp;A can be a sinkhole for time.\n\nRe: Problem (1), (2): Learning HTML, CSS, JS is easy given my background in C#, C++, Python. I don't know what framework/tech stack to learn to use, and how big the scope of the portfolio projects should be.\n\n**The Goal**\n\nBackend developer at Microsoft, Pinterest, Spotify, ++.\n\n**Leverages**\n\n* The company will pay for a master in CS degree (I can work 20 hrs instead of 40 hrs/wk) but this is a double-edged sword. On one hand, I can use this experience to go to networking events to intern somewhere else and use it as an alibi for switching to web dev. Otoh, if I quit within 2 yrs after their last disbursement for tuition, I'm on the hook for the entire cost for the degree.\n* As stated previously: There is room internally for lateral movement. I'm on good terms with my manager and coworkers. They would vouch for me if I applied to another role within the company.\n\n**The Ask**\n\nIt's a monster with many heads. Any tips on:\n\n* What to prioritize/how many hours to dedicate to each head\n* How to broach the subject of quitting/applying for an entirely separate role with my manager\n\n... would be appreciated.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/17jw3wj/juggling_a_job_doing_defensestuff_where_to_find/",
      "comments": [
        {
          "body": "Ah UML. I had a professor in college who thought that was the big thing that would replace all programmers. Now it's AI.",
          "score": 3
        },
        {
          "body": "&gt; Backend developer at Microsoft, Pinterest, Spotify, ++.\n\nWhy are you learning webdev if you want to be a backend developer?",
          "score": 3
        }
      ]
    },
    {
      "title": "I SUCK AT CODING",
      "body": "I got like my 6th coding challenge invitation from companies. Some of the names are Pinterest, Akuna Capital, Amazon, etc. I am confident as shit! Also, I can audible the shit out of recruiter if they let me sit face to face with them, but when those technical interviews and those LC questions come I freeze. I need some tips on where to start. I am in my junior year of my CS program at a &lt;TOP30 university. Java is what I’m trying to specialize, but also I’m trying to branch out further. I still struggle with the syntax, but I can comprehend. I am also in the middle of my Data Structures And Algs class and I can’t even survive. \n\nHELP!\n(Any resources or free courses) \nI am quick learner but it’s all about the mentor/teacher.",
      "subreddit": "cscareerquestions",
      "score": 31,
      "url": "https://reddit.com/r/cscareerquestions/comments/dcu73y/i_suck_at_coding/",
      "comments": [
        {
          "body": "Posts like this should be a reminder that we as an industry puts too much weight on being able to do silly leetcode interviews. It seriously damages the self-esteem and mental health of engineers. \n\nyou probably don't suck at coding. I thought I sucked at coding but did fine in the industry. I was complete garbage at leetcode and still am. \n\nLeetcode != Software Engineering\n\nMay I suggest you use another language for these exercises? Java is so unnecessarily verbose and if you get caught up on syntax then maybe using another language like Python or JavaScript might be better for you.",
          "score": 70
        },
        {
          "body": "Practice dude, practice. \n\nGeeksforgeeks\n\nLeetcode \n\n [collection-of-coders-games-to-improve-your-skills-9ea02906d73](https://medium.com/@ipestov/collection-of-coders-games-to-improve-your-skills-9ea02906d73)",
          "score": 24
        },
        {
          "body": "glad I didnt even hear of leetcode until after I had a job cuz I suck on the spot so I would have obsessed over it as well",
          "score": 7
        },
        {
          "body": "&gt; Java is what I’m trying to specialize, but also I’m trying to branch out further. I still struggle with the syntax, but I can comprehend. I am also in the middle of my Data Structures And Algs class and I can’t even survive.\n\nIt's very rare for companies to reject you just based on syntax mistakes alone - as long as you're somewhat close to it they'll usually help you out. Seems like you don't have a firm foundation in DS &amp; Algs; focus on improving that before applying again. Keep practicing and become your harshest critic, that's really the only advice I can give you.",
          "score": 6
        },
        {
          "body": "I'm a pretty good coder but my only two jobs ive ever had never did a code interview of any kind. Try to find those jobs or keep learning from your failures.",
          "score": 4
        },
        {
          "body": "honestly dude you can train like crazy with like 200 problems, know them like the back of your hand, and then freeze up during the on-sites. my best advice is experience honestly. put yourself into a pressured environment and have someone time you, along with being pretty critical of your work. for me it took completely bombing on-sites and seeing how the process worked in order to really figure out how to succeed.",
          "score": 4
        },
        {
          "body": "Two quick tips  print out a cheat sheet and bring it with you everywhere !! Write down you God damn code !! Lol\n\n Jokes aside,  I never knew that writing code down and planning it out was so vital till someone taught me that. Before I code anything I plan, think about the process and write the code down in plain English.\n I even talk  about the coding solution out loud(when alone or with other weirdos), even when doing interviews, lots of times your thought process is important and if they see you're thinking the right way, that will give you points. Also, even when coding by your self ask a lot of questions,  what is the data, what is the inputs. How will I validate this statement, do I need to check the length of this array, instead of looping 50 times,  shouldn't I check if it works with an n of 1 first, than 2, than 3 etc. Good luck and trust me bro. I feel like I suck ass at code, but I still manage to put it all together. Feel free to PM me if you have any questions.",
          "score": 3
        }
      ]
    },
    {
      "title": "Bloomberg vs Top Unicorn",
      "body": "I'm a current junior who's deciding between Bloomberg NYC and one of {Pinterest, Airbnb, Snap} for an internship this summer.  \n\nMy understanding is that both have solid internship programs, and having either on my resume should allow me to get full-time interviews with other top companies.  With the Unicorn I'd probably be in a more rigorous development environment and my resume would look shinier.  However, because of location there's no way I'd work there full-time (I go to school in the bay and I really don't like it here), meaning I'd have to start my job search next year empty-handed.  On the other hand, I'd LOVE to live in NYC, so a return offer from Bloomberg would be great.  \n\nMy Unicorn offer expires in a few days and I'm torn.  Is the added prestige of the Unicorn worth potentially getting screwed for full time next year?  Any advice would be greatly appreciated.",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/5ez6dq/bloomberg_vs_top_unicorn/",
      "comments": [
        {
          "body": "Unicorn. Bloomberg is much less prestigious than big 4 / unicorns, and you don't learn much in their intenrships. I have about 6 friends who interned there. It will be trivial to find a job in NY with an internship at a Unicorn, and even more, you may even get an offer for the NY office of the unicorn (I think Snap has a NY office, don't know about the others).",
          "score": 24
        },
        {
          "body": "[deleted]",
          "score": 12
        },
        {
          "body": "[deleted]",
          "score": 16
        },
        {
          "body": "I promise you, a full time offer from Bloomberg has zero/negative value. (see my post history!)",
          "score": 5
        },
        {
          "body": "I know plenty of people who've chosen Bloomberg over Big 4 (especially Amazon and Microsoft). They also got very comparable offers to companies like Google and Facebook. ",
          "score": 5
        }
      ]
    },
    {
      "title": "List of companies giving out homework?",
      "body": "So the other day someone posted a URL with a list of companies that don't include whiteboard coding in their interview process.\n\nPeople on here also often complain about companies giving project work for the interview process. Does anybody know a URL that lists companies which give you a project to do at home?\n\nBasically this list filtered on \"home\": https://airtable.com/shr5TdnpVYVTpeRrN/tbluCbToxQ2knSLhh\n\nBut then companies who do whiteboarding + take-home project...anybody know any of these companies other than Pinterest?",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/86uyzt/list_of_companies_giving_out_homework/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 33
        },
        {
          "body": "Honestly I don't think either of these are bad if done correctly. An hour on a real problem is a decent way to evaluate code, and a whiteboard can be used to evaluate problem solving process.\n\nThe problem is the way they are done. 4 hr long take home projects are absurd people have other stuff to do, asking people data structure questions that require specific knowledge you could look up on the internet with a whiteboard is silly.\n\nHaving been on the other side of the table people with nice resumes who can't code at all wasting your time can be a problem, and honestly an interview is a terrible high pressure situation to evaluate coding ability. That is what a take home assignment is for.\n\nLast one I did took me 45 minutes, it was reasonable.",
          "score": 10
        },
        {
          "body": "Trip advisor gave me an assignment after the phone interview ",
          "score": 5
        }
      ]
    },
    {
      "title": "What can I do besides CRUD apps?",
      "body": "So the current company I'm working for is building what essentially comes down to a CRUD app. There are a few algorithms in the code, but literally it's nothing too impressive. Each algorithm could be re-written in a day. I'm enjoying working for the company right now since I've not built a CRUD app from the ground up before. \n\nBut when I read blogs, one thing I hear every now and again is that building CRUD apps is one of the lowest level jobs that you can get.\n\nOn one hand I can understand that CRUD can be boring as you are doing the same thing over and over. But to me there seems to be a lot of variation because I feel like a lot of different apps boil down to CRUD. GMail is a CRUD app, Google Docs is a CRUD app, Reddit is a CRUD app, any kind of wiki is a CRUD app. Actually, it seems like most websites are CRUD. Twitter, facebook, insta, pinterest, etc are all CRUD apps.\n\nI'm just thinking about my next step in the industry in a few years and what kind of job I would like to seek out.\n\nMy question is, what are some other types of jobs can I get in CS that is not CRUD related? \n\nHere are my thoughts so far:\n* Graphics &amp; game programming\n\n* Embedded systems\n\n* Operating systems\n\n* Networking (e.g. a browser) &amp; distributed systems\n\n* Mobile app development (although this feels similar to CRUD, each job is building the same app with slightly \ndifferent features)\n\n* Search engines\n\n* data mining &amp; machine learning\n\nWhat else is there?\n\nAnd as for my career plan, some of these fields (such as data mining) interest me quite a bit. And I feel like I would be better off pursuing a job in one of these more specialised fields, because not only would it be more interesting than CRUD in the long term, but being a more specialised field, I should be able to command a higher salary after several years experience. And then if things don't work out, I can always fall back on CRUD. Are these reasonable expectations?",
      "subreddit": "cscareerquestions",
      "score": 34,
      "url": "https://reddit.com/r/cscareerquestions/comments/3ng9go/what_can_i_do_besides_crud_apps/",
      "comments": [
        {
          "body": "I think you're over-simplifying to an incredible extent. Taking your first example, Twitter, to just be a CRUD app is kind of insane. You've reduced what is an incredibly complex architecture into something  anyone could knock out in a few hours.\n\nWe're talking complex ad delivery and auctioning systems, immensely powerful data processing an delivery pipelines (so much so, that they had to develop an in-house real-time computation system, which they later open-sourced - https://storm.apache.org/), scalable APIs that need to deal with millions and millions of users and apps accessing that data on the fly, mobile apps, search optimisation, payments processing, tools for advertising, tools for internal users, asynchronous job processing, queue management, distributed computing, developer tools, deployment tools - the list is endless.\n\nI don't work for twitter, but I've worked at a fairly large web firm for the last 6 years, and it's still absolutely mind-boggling as to what goes into making a website function.",
          "score": 49
        },
        {
          "body": "Any application that has a database on the backend is going to have an aspect of CRUD to it...that doesn't mean it's \"just a CRUD app.\" CRUD is only one function point of an application that has to persist and maintain data.",
          "score": 17
        },
        {
          "body": "I can only advice you to stay away from gaming. The amount of available positions are like a third of the people looking for one....",
          "score": 10
        },
        {
          "body": "Step 1. Write the phrases \"Big Data\" and \"Machine Learning\" and \"Hadoop\" and \"Cloud\" on your resume in white text so no one can see it.\n\nStep 2. Submit resumes and the auto-resume robots will pick out resumes with certain keywords found in them.\n\nStep 3. ???\n\nStep 4. Profit!",
          "score": 17
        }
      ]
    },
    {
      "title": "Famous tech company vs Pinterest",
      "body": "Famous tech company is a famous OS company based in Redmond, WA. Let's call this company M.\n\nThis will be my last summer internship. I am into machine learning but not sure which project I will have in both companies. I am in the platform pool at Pinterest and the Windows and Devices Group at M. I also need to look at this from a full-time perspective since I need to pay off loans. \n\nPinterest Pros: \n\n1. Higher internship compensation\n\n2. Smaller team, may get to work on a better project\n\n3. Smaller team means more impact\n\n4. Pinterest is yet growing, which should mean more challenging work (correct me if I’m wrong here)\n\n\nPinterest Cons:\n\n1. Not sure if their stock for new grad offers will yield me money at a reasonable pace so that I can pay off loans (help here would be great)\n\n2. Not sure what the future of Pinterest is (help here would be great)\n\n\nM Pros:\n\n1. Well known\n\n2. Cheaper cost of living in Redmond, WA\n\n3. Already IPO-ed, which means stocks already have value \n\n4. Larger range of projects to work on if I get bored since M does a lot of things\n\n\nM Cons:\n\n1. Feel like I’ll have a smaller impact since it’s such a large company\n\n2. Heard that they don’t pay very well even on promotions (correct me if I’m wrong here)\n\n\nWhat I don’t know:\n\n1. If I want to interview at company G or company F for new-grad opportunities, which one will be better on the resume? If I want to go back to my home country (India) and get a job, would Pinterest be much worse than M on the resume?\n\n2. How the full time pay compares in terms of how much I can save annually? If someone can provide hard numbers of what the new grad offers for both these companies look like for 2017, that would be awesome! \n\n3. Pinterest offers stock options for new grads. \nWhat are the odds that these stock options vest soon and what are the odds that they vest for how much Pinterest estimates at the time of making the offer?\n\n4. From a machine learning point of view, which one is better? I know that I won’t be working on the hardcore ML research stuff (MSR) at M. I am in the Windows &amp; Devices Group and so not sure what ML that entails. At Pinterest too, I am not going to be working on ads or ranking. However, there is a chance I get to work on discovery or spam, which are more applied ML sort of teams",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/591xie/famous_tech_company_vs_pinterest/",
      "comments": [
        {
          "body": "Pinterest is undoubtedly more prestigious than Microsoft in the Bay Area. This is because it's a fast-growing tech company that's sucking up loads of top-tier technical talent from top schools. Furthermore, culture is awesome and compensation is great (definitely better than Microsoft but I don't have hard numbers). However, if you go back to India, Microsoft might better because it's a more international brand. I don't really know enough to comment on the ML aspect of either company.\n",
          "score": 14
        },
        {
          "body": "You're getting a lot of good guidance on comp, and I realize it's a lot of money coming out of school and you have student loans to pay off, but which city/culture/team/manager matches well with you and your career goals is far more important in the long-run to your satisfaction.  You're also talking about stock that won't fully vest for years.  \n\nYou are comparing two very different companies; even more-so if you include F &amp; G.  Do consider the non-monetary aspects.\n\nIf you go back to India, companies like M, G, A, etc... have big tech centers in most major Indian cities and they'll gladly pay to move you back there (with a big compensation cut).  Not sure if Pinterest does.",
          "score": 2
        },
        {
          "body": "One of my friends, an intern this past summer at M, actually received 150k stock. Just a heads up :).",
          "score": 1
        }
      ]
    },
    {
      "title": "Has anyone done Pinterest Engage? How is it?",
      "body": "I just sent off my application the other day.  I haven't heard any conversation about this program on the net so I'm not sure where my chances are.  If you've been in this program before, I'd really appreciate it if you could answer these questions:\n\n1. How experienced are most applicants who get invited for an interview?\n2. How difficult are the technical questions?\n3. How much weight does the 'minority' component play into the application?\n\nAgain, thanks!  And please leave a comment if you've also applied, aha.",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/5qw4nf/has_anyone_done_pinterest_engage_how_is_it/",
      "comments": [
        {
          "body": "I was part of the first Engage program at Pinterest so I feel I can answer your questions. This is the second year they're doing the program so it's a bit new.\n\nTo answer your questions though:\n\n1. I'm not sure how experienced most applicants are to _get_ invited for an interview. I know within our group of Engage interns, it was mixed skills with some like me being somewhat experienced and others not really knowing what to do and learning. I'm going to guess it might be the same for this year again.\n\n2. The technical questions aren't all that difficult. If you know Python or Java, you'll be fine to solve them. They're just questions like reversing a string and designing an alarm clock for the blind.\n\n3. Being a minority weights A LOT into the application. Of the **9** engage interns that were given offers out of the **900** that applied last year, 4 of us were black, 3 were latinx, and 2 were Asian females so yeah. 900 people applied or so, like 150 were interviewed and 9 were selected so yeah. Being a minority is a huge part but it doesn't mean that you shouldn't try.\n\nPinterest is a company that prides itself on diversity because the product they're building requires as much input from different people on it as possible. You can read about their diversity efforts last year [here](https://blog.pinterest.com/en/2016-update-diversity-pinterest).\n\nI had a good time in the Engage program. Learned a lot and having Pinterest boosted my resume quite a bit. Not to mention the dope parties I and my other Engage interns threw in SF. Seriously loved it. Pinterest is a great company to work and even though I'm not returning this summer because I want to gain more experience with other companies, I do fully intend on applying as a new grad my senior year. Our group was also mixed up in the sense that like I came from Purdue while my roommates came from Princeton and UCSD. The other engage interns came from RPI, Berkeley, UGA, Vermont, MIT, and Columbia. So Pinterest doesn't really take the school you go to in account... or at least I think. I still talk to my mentor at Pinterest because she's dope and gives great advice. It's just an all around great program for your first internship. Hella competitive because Pinterest has a v small internship program compared to other companies but if you get in, it's a great place to be at.\n\nIf you have any more questions, feel free to ask.",
          "score": 6
        },
        {
          "body": "Amazing program, my friend did it and absolutely had a blast\n\n1. It's the first internship for most people\n2. Not too hard, his questions were \"reverse a string\", then \"find the minimum number of characters you need to add to a string to make it a palindrome\", as well as some behaviorals/design questions (design me an entertainment room)\n3. Large aspect of it, if you're not a minority sorry :(. It's heavily focused on recruiting minorities in CS (as are all freshmen programs such as FBU and Google EP), so just keep that in mind that it's not likely to hear back if you're not a minority",
          "score": 3
        },
        {
          "body": "[Found this Quora post about it, though not directly referring to the Engage Program](https://www.quora.com/What-is-it-like-to-intern-at-Pinterest-1).\n\nI myself plan on sending in my application within the next couple of days, so best of luck to the both of us! :D",
          "score": 1
        }
      ]
    },
    {
      "title": "Customer Engineer at FANG OR SWE at Smaller company?",
      "body": "Hey there,\n\nI received an offer from a FANG company for a technical, customer-facing, rotational program (NOT DEVELOPMENT) in the cloud space. I am excited and grateful to join FANG, but this role was not my first choice. I got rejected for another role (my dream job tbh) at the same company a few weeks ago. Feeling a bit conflicted about that offer but would still take it for sure.\n\nAlso, I just finished my interview process for SWE at another \"smaller\" company (aka Pinterest) and I am feeling conservatively confident that I will get an offer. Should hear back tomorrow.FANG is in Austin TX (city choice #2), Pinterest in SF (city choice #1).\n\nIf comparing the brand equity of the company, of course the FANG offer wins. But I am conflicted about the two different career paths these alternate options would take me on.\n\n&amp;#x200B;\n\n**Assuming I get both offers, my dilemma is:**\n\nThe FANG offer excites me for the chances to network with people from multiple industries (customer facing role in cloud), the brand equity (ex-FANG in resume), and maybe changing careers within the company later on. But I am scared for the not super technical nature of the role.\n\nThe Pinterest offer excites me for the technicality of the role and the impact in the product. It scares me for the not so great brand equity, low compensation for SF living standards (numerically, this compensation is actually higher than my FANG offer but much smaller when factoring in cost of living in SF), and maybe setting aside some of my business/product/customer expertise.\n\nMy long-term career goals are of course in tech, but I am still confused of which path I want to follow long term (ofc, I am a new grad). **As of today,** I feel like I want to be more in the PM side of things (the dream job I was rejected for in FANG was in Product) and create my own tech startup in the future (I have founded smaller startups previously). Yet, I don't want to lose my technical skills. My technical skills are strong, but they are not unique. My interpersonal, sales, business, and product skills are extraordinary and I think the combination of both is what sets me apart.\n\nI would love any feedback or comments for this dilemma I am facing. Deadlines are approaching soon next week to accept/reject offers. Thank you all so much for your help!  \n\n\n**UPDATE:**  \nI ended up not receiving an offer from Pinterest so that made the decision significantly easier lol.  \nThanks for the help tho  \n",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/k6gxhz/customer_engineer_at_fang_or_swe_at_smaller/",
      "comments": [
        {
          "body": "[removed]",
          "score": 23
        },
        {
          "body": "Pinterest.\n\nYou can go from being a SWE to being a sales engineer, PM, founder, any time.\n\nYou absolutely cannot go back to writing code from a non code role, easily.  Especially if you have 0 yoe as a graduate SWE.\n\n\"FAANG\" matters a whole lot less in the new grad period than having a good team and setting yourself up with a career trajectory for the future.  Learning how to be a SWE in industry is more valuable than a name on your resume.\n\nPinterest is a really good company with good senior engineers.  You'll learn tons of things you didn't know before about working as an engineer in your first year or two, then you can figure out your path from there.  \n\nDon't focus on maximising wealth building in year 1, focus on career building.",
          "score": 10
        },
        {
          "body": "Pinterest *hands down.*\n\nNon development roles, even at FAANG, are still zero years of experience. Just well-paid zero years of experience.\n\nIf FAANG is your goal, take a year of Pinterest under your belt and you will be a much stronger candidate for SWE at FAANG. A year of spending 9-5 not doing development work will make you rustier and a worse candidate for SWE at FAANG.",
          "score": 6
        },
        {
          "body": "Do you want to be a SWE or not?",
          "score": 3
        },
        {
          "body": "Wtf lol, I’d choose Pinterest over FANG even if I’d be a SWE at the FANG",
          "score": 3
        },
        {
          "body": "SWE hands down.. Depending on location and team, some FAANGS are known to not give special treatment to move over to development from the support side, you're just like everyone else and still need to apply and go through the entire interview loop as if you were a nobody.. lmao this sub sometimes... there's more to this world than FAANG. Pinterest is a fantastic company to start off in as a new grad.",
          "score": 2
        }
      ]
    },
    {
      "title": "Pinterest finance interview",
      "body": "Hello, I am wondering has any one interviewed with \nPinterest for a finance role before ? If so do you have any advices? Please anything advice will be helpful.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1ahzm2r/pinterest_finance_interview/",
      "comments": [
        {
          "body": "You’re better off on LinkedIn, Fishbowl, or Blind. Few people on thus sub are qualified to answer your question. This is mostly teens looking for part time employment advice, workplace drama, or low skill people seeking remote work",
          "score": 2
        }
      ]
    },
    {
      "title": "Is experience important?",
      "body": "I'm in my mid 40's.  No degree or certs.  With 20+ years experience in information technology.  Mainly tech support and some telecom experience.  I have put out countless applications that are all getting the same responses.  I'm so sick of seeing the word \"Unfortunately\" in emails.  Which certification could I get that could possibly turn this situation around?  I don't have the time or money to go back to school.  I'm pretty sure boot camps are a waste of money and time.  With AI algorithm screening, I'm not getting any interviews.  Even if I try to tailor my resume and cover letter to each job opportunity.   I swear, the reason I'm not getting any interviews is because of my age.  Which doesn't make sense because I have a lot of experience.  They say four years of work experience is equivalent to a degree, so I should have equal to a Master's degree at this point.  I'm losing sleep and sanity, trying to figure out how to pay my bills when I'm running out of money and at this point, disability, affiliate marketing, or just ending it seem to be my only choices.  I have made a website, but I have no idea how to drive traffic to it.  Advertising on Instagram, Facebook, Pinterest, and LinkedIn aren't working.  I'm not very good at using Canva to make videos.  I've watched so many \"make tons of money doing this\" videos, but I feel like I'm wasting my time.  Any suggestions on a certification or video I can watch, would be greatly appreciated.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1cpfife/is_experience_important/",
      "comments": [
        {
          "body": "In my area people with experience can get all the same jobs as people with bachelors degrees! \n\nSo yeah experience can be important. I can’t even find a job that requires a degree most of the time now. \n\nAnd they pay us all the same",
          "score": 2
        },
        {
          "body": "You are competing against more educated, younger people, with specialized skillsets, likely willing to work for less than someone in your situation. \n\nWhy not reach out to your network of the last two decades to see if they can help refresh your resume or connect you to opportunities at their companies?",
          "score": 2
        },
        {
          "body": "I have over 10 years of costumer service and i got refused a job and the reason was meet the  minimum requirements , i used work there like 8 years ago .",
          "score": 1
        },
        {
          "body": "If I was a hiring manager I would be concerned with “20+ years” experience in IT and you haven’t really progressed past tech support. I would think you either aren’t motivated or are unable to pickup on new things. Please don’t take it personal just giving some constructive criticism.",
          "score": 1
        }
      ]
    },
    {
      "title": "Respect yourself and never work for free.",
      "body": "I just need to rant a sec.\n\nI've been applying to digital marketing jobs with some tech startups in NYC. One seemed pretty promising; have a good product and something I was genuinely interested in.\n\nI had a phone interview and it went well. The interviewer, who is the Head of Growth, asked if I'd be open to doing an assignment first before moving forward together, and even possibly working on a contract first. I said that's fine, as actually that's how I found my previous two jobs.\n\nToday he emails me the 'assignment' in which he wants to add me as a Facebook admin to streamline all their FB advertising efforts, as well as design 12 unique Pinterest ads and post them in order to reach their ideal customer.\n\nI replied back that that was too much work for free, and that I'd be happy to do so on a consulting basis. He understood, but I can't help but have a bad taste in my mouth about the whole thing. Maybe he really was just trying to gauge my skill set but it really felt like he was trying to get free work out of me.\n\nSo, pass. If you're a hiring manager and you do this, you are the worst. Don't ask for a full fledged project from someone you do not intend to pay monies.",
      "subreddit": "jobs",
      "score": 213,
      "url": "https://reddit.com/r/jobs/comments/59vh7j/respect_yourself_and_never_work_for_free/",
      "comments": [
        {
          "body": "I can't agree with this more. \n\nIf you work for free, you're signaling that there's no value for the work you're providing. Also, it's technically illegal on their part even if you're fine with it. \n\nIf they want to see your skills, they should be asking you to do something *that they don't actually use* for their business. For my business analyst roles, I have interviewees answer questions about a fake dataset.",
          "score": 97
        },
        {
          "body": "Who the hell would make someone a Facebook admin before they hired them? I'd be concerned about the competence of the interviewer, and the company as a whole. ",
          "score": 36
        },
        {
          "body": "Harlan Ellison rants about this. You can find it on youtube. He goes on about \"cross my palms with silver\" and \"of course I'll sell my soul\".\n\nThere's another guy who gave a talk where the callback chant was \"Fuck you, pay me.\"",
          "score": 17
        },
        {
          "body": "They can get away with it most of the time, so they do.  Many people are desperate.\n\nOnce this was considered bad form above all else. Then everybody began to worship the bottom line -- not just making a profit, but cutting all possible corners to make as large a profit as possible for the distant and insatiable shareholders.  Who are probably large funds of some sort.\n\nYou're right not to give in.  When the economy finally revs up again -- and it will, or it will shrivel to nothing -- these practices will vanish like dew in sunlight.  But always remember who did them.",
          "score": 21
        },
        {
          "body": "\"Hey bud, thanks for the assignment but I don't see things working out long term.\"\n\nPASS.",
          "score": 6
        }
      ]
    },
    {
      "title": "Roast my Resume for FREE!",
      "body": "This is my resume, I just want to take some constructive criticisms and make it better.\n\nI'm using this template because my intent is to apply to international jobs and this looks good for most of countries.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/m9pkh32g1xlc1.png?width=1375&amp;format=png&amp;auto=webp&amp;s=5dec8e1ad07064723ffe9b76caac204a4a12011b\n\nThanks in advance for the reply and for your time.\n\nHave fun!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1b4nch5/roast_my_resume_for_free/",
      "comments": [
        {
          "body": "TLDR. Imo it should be more concise. The interviewer can always ask for specifics",
          "score": 2
        },
        {
          "body": "Agreed it's too long. Say more with less. I also would use a different font like calibri and add a little bit of color to make it more attractive.",
          "score": 2
        }
      ]
    },
    {
      "title": "Got invited to an interview as a media designer (part time). I've been trained in the field of work and I study it as well. These are the questions I have prepared to ask my future employer. Do you think I've missed something?",
      "body": "Hi :)\n\nI'm living in Germany and from 2008-2010, I was trained as a professional media designer in a fairly good, local design agency. By now, I am studying media design and interior design at a university. So, I think I know about the \"how do I design stuff\"-part ;) The thing is, my last work was always freelance-based for small businesses who never had anything done by a media designer before and this interview is for a workplace inside a non-design firm which happens to need a designer. \n\nI would love working there, since they have awesome, flexible working days so it won't interfere with my studies - plus, it's a great business. \n\nI've tried to come up with some questions to ask during/after the interview so they see I'm interested and I get to know what my job is (hopefully) going to be. Of course, if they already answer these questions during the interview without me asking, I wouldn't mention them again.\n\nIt would be awesome if some of you might have a look and point out if I've missed something or if there is something I'd rather ask at a later date (that is: if there is going to be a \"later date\") - or if I should scratch something from that list and just figure it out \"later\".\n\n* How many hours are \"part time\" at your company? Are they fixed or flexible? Is it \"weekly X hours\" or \"based on work needed, but not more than X hours/month\"?\n* Did you have an internal media designer before, or did you work with an external agency?\n* What does the workplace look like? Any non-industry-standard-but-important-to-you programs I should know about? Any people/professionals/external people I need to know/work together with? (Say, working with an external, professional photografer would change my way of describing what image might be needed than if it were a worker inside the busniess who happnes to have a camera.)\n* You've stated that you're searching for somebody who knows how to work with Social Media - anything in particular you are interested about? (Since \"making videos\" and \"designing images for pinterest\" need different skillsets and I would love to know if I need to brush up on anything in particular.)\n* If there was no internal designer before me (and as far as I know, there was none): How come they want one now? What projects do they have in mind? What made them go \"we want that, too!\"?\n\nAnd... well... \"How much do you pay\". I'm still trying to figure out how to ask that question, but I'm certainly not the first person with this problem. I'll figure something out. \n\nYour input/help would be much appreciated :)\n\n&amp;#x200B;",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/9n8mvk/got_invited_to_an_interview_as_a_media_designer/",
      "comments": []
    },
    {
      "title": "SRE interview at Pinterest",
      "body": "#pinterest #sre\n\nHi what are the question asked in Pinterest are interviews? Is it same as ML and SWE?\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1k171cb/sre_interview_at_pinterest/",
      "comments": [
        {
          "body": "Are u done ? How was ur experience",
          "score": 1
        }
      ]
    },
    {
      "title": "INDEED SCAM: Khush Consultants",
      "body": "Hello, all. I am a cybersecurity student that was job hunting these past few weeks through Indeed. I sent my application out to a company called **Khush Consultants** who was advertising a Quality Assurance Technician position. In the application process it required my resume, asked whether I had x amount of years experience in various different skills, and seemed like a very normal job posting.\n\nI applied to their position on Indeed and was contacted back by someone named Tikam Jain who claimed to be a recruiter for Khush Consultants. She sent me an email during the call and was being very pushy about me pressing through the buttons in the email she sent. I use Proton Mail and was notified that the email she sent contained a tracker that was blocked by them.\n\nThe phone interview went extremely normal otherwise, with her asking questions about my past work history, why I felt I was a good fit for the job, whether I did indeed have those years of experience in those skills, etc. It was conducted very professionally, but I ended the phone call telling her I would finish up clicking through the buttons once the call ended.\n\nInstead, I researched the company and found that their website ( [www.khushs.com](https://www.khushs.com) ) is a fake website. It uses fake images for its testimonials that I found on tons of other websites using google reverse image search. The majority of its links to do not work. It has a Pinterest link up on its website for some reason lmfao that also, of course, doesn't work.  It does not have a real address listed. They do not have any social media except LinkedIn. This is, completely and without a doubt, a scam company.\n\nI did further research and discovered the phone number she used to call me +1 (863) - 843 - 4008 is a VOIP number through TEXTNOW.  This is absolutely a scam company that I'm certain has something malicious in the email they sent me.  They've been reported to both LinkedIn, Crowdstaffing and Indeed as well, but I wanted to make a PSA about them so nobody gets scammed. All of their job postings looked extremely legit and if I didn't have a background in infosec, I wonder if I might have fallen for whatever they're trying to pull. They look to be operating on a small scale and only posting a very small amount of jobs. Hopefully anyone who gets a little suspicious will see this post and steer clear.\n\nEDIT:  Upon further research, they even have a Vendor login section on a different site with the s changed to a c, where they list a bunch of vendors they work with and have a  \"login\". I looked at the source code for all of them and it's some  premade BS. Also found who is hosting their site and their vendor site so it's been reported  to Hostinger and GoDaddy as well. \n\nTHEIR LINKEDIN:  [https://www.linkedin.com/company/khush-consultants/about/](https://www.linkedin.com/company/khush-consultants/about/)\n\nBe safe out there, job hunters.",
      "subreddit": "jobs",
      "score": 30,
      "url": "https://reddit.com/r/jobs/comments/14nat4g/indeed_scam_khush_consultants/",
      "comments": [
        {
          "body": "The phone number they list on their site is country code 91 (India).  No surprises that it's scammy.",
          "score": 6
        },
        {
          "body": "This sucks. Thank you for sharing.",
          "score": 2
        },
        {
          "body": "Good job man, stay vigilant broskies.",
          "score": 2
        },
        {
          "body": "I just looked for their address to apply for the print production operator job on indeed. Your reddit thread came up on the first page of my search. Thanks for sharing.",
          "score": 2
        }
      ]
    },
    {
      "title": "How can I improve my resume/impression to get a reliable office job?",
      "body": "I'm 24. I have a bachelor's degree in public relations and experience in news writing, copy editing, some restaurant/retail work, and child care. I am an excellent writer with experience in Canva, AP Style, Adobe InDesign, photography, social media (Facebook, Twitter, Pinterest, Instagram), Google Drive/G Suite, and Wordpress, among other things. I've done two internships and have several very reliable references as well as an email marketing course certification.\n\nDuring unemployment, I've been writing, running my blog, learning to weave, cooking, baking, working out, and most recently building up an Instagram for my dog (as a sort of portfolio piece mostly).\n\nI have no interest in starting my own business/company, being my own boss, or (outside pandemic circumstances) working from home. All I want is reliable full-time hours at a desk in an office with a computer and a phone, working with people I like enough to invite them to eat cake on my birthday. I don't care what I'm doing as long as I'm actively doing something and getting paid for it.\n\n**Some employment backstory if you want it (feel free to skip down):**\n\nIn 2018-2019, I was living in a small town and working at a newspaper. I was a journalist, but I spent more time at the desk than the others because my primary responsibility was receiving, editing, and collecting payment for obituaries. I loved that job, until my (amazing) supervisor was fired and our entire team fell apart. When the editor bombed my reputation\\*, the timing with my lease and my relationship made it the right time for me to leave.\n\n*(\\*More info: the editor changed my headline, and over 200 people called me a racist on Facebook. I posted on Facebook about the situation to clear things up, which I was sure would get me fired, but I was only called in to talk. I apologized to the editor and publisher for making the paper look bad to save my own butt. So I managed to clear up my public reputation and keep on good terms with the company before leaving. I was the first to quit, but everyone else from our team left within two months and the editor \"retired\" shortly after I left. It was a mess.)*\n\nI moved in with my partner in Tippecanoe County, Indiana. I took a job at the Kroger deli until I could find something else, but despite several promising interviews I never got any other offers. Due to unexpected health problems, I had to leave Kroger. I got my health problems treated and under control. I was just about to re-apply for my old job when the pandemic started; we weren't comfortable with me being back at the supermarket, all things considered.\n\nI did get a summer job providing in-home childcare for one family, but now that school has started, that job is over.\n\nMy partner's full-time job has easily provided for all our expenses since I moved in. He is studying engineering at a community college (Ivy Tech). He needs to transfer to a bachelor's program for the 2021-2022 school year, and his associate's classes are getting more demanding as he reaches higher level coursework. He can't keep working full-time and give his studies the time they need.\n\n**The current problem (help!):**\n\nI need a full-time job in Fort Wayne, Indiana, ASAP. That's where the colleges my partner will apply to are both located, and he already has everything set up to transfer to that branch of Ivy Tech. His parents live there and are willing to let me/us move in between getting a job and finding an apartment there.\n\nWhat I need from a job:\n\n* Regular, reliable schedule\n* Long term potential (we'll be there two years minimum, probably longer)\n* Minimum $38,000/year or $18.50/hour\n* Health care, dental, and vision (for myself, doesn't have to be a family plan)\n\nIf it were just me, I'd definitely be open to lower paying jobs — my newspaper job was $14/hour and I made it work — but to support my family's living expenses this is as low as I can go.\n\nI've applied for administrative assistant (and similarly titled) positions, receptionist and secretarial work, event planning, hospitality and hotel positions, and media and communications positions. I've looked into public relations firms and newspapers in the area. I've applied to anything on Indeed and LinkedIn that looks like I might be remotely qualified. So far, I've got nothing.\n\nI know everyone is struggling right now. I know the job field has been thrown in disarray and competition is fierce. But I don't want to keep throwing out applications and feeling hopeless and helpless. I feel like there must be something I can do to improve my chances.\n\nIs there some certification or course or skill I should be working to add? Some part of my experience or personality or skills I need to play up? Some office job that might fit which I haven't considered? I'll take any advice you've got for me, Reddit.",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/iex77j/how_can_i_improve_my_resumeimpression_to_get_a/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "How many jobs have you applied for?  Are you near Fort Wayne right now? Are you using your partner’s parents address on your resume and applications?  Is your resume clear that you’ve made a permanent move to Fort Wayne?",
          "score": 1
        }
      ]
    },
    {
      "title": "Feedback needed for idea: 30 day group mastermind/challenge to find your next job collectively?",
      "body": "I was listening to a podcast this morning where a fitness guru was talking about success she had holding a group weight loss challenge over Pinterest. It sounded like an interesting concept that could translate well to topics outside of weight loss/Pinterest, which got my mind moving.\n  \n**My idea:**\n  \nGather a group of individuals looking to attain a new job over the course of the next 30 days. I (along with the input of anyone who would like to join) can put together a rough outline for what the group should be doing to find success over the next 30 days, receive more interviews and ultimately, their next job. \n  \nThe purpose of making this a group experience would be to share in each others successes, support each other in failure and see what's really working in today's job search environment. By transforming the job search from an individual activity to a group activity, it could potentially make the process more tolerable and enjoyable for those partaking. \n  \nI don't know the best medium yet to hold such a mastermind/challenge group, whether it be directly on Reddit, a private Forum, Facebook group, etc, but would really appreciate feedback. \n  \nIf this sounds like something you'd be interested in or have any feedback on the process, let me know. I'm hoping we can generate some interest in this to significantly benefit the participants of the group and then offer detailed results following the 30 days to those outside of the group. ",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/2eiy71/feedback_needed_for_idea_30_day_group/",
      "comments": [
        {
          "body": "Job seekers can always use more social and moral support during their search. It's the one thing that's been sorely lacking in all areas revolving the seekers - an understanding and empathetic network who won't stigmatize an individual just because he/she is unemployed. Revel in the victories, share the bad stories, and figure out the confusing parts in between, that would be great.\n\nBut, the other objective will be near impossible to meet. Between the blogs, armchair interviewers, and different types of employers out there, there is no longer a winning formula to simply overpower the job search process. Established and proven procedures do exist in employment, but 1) it's more effective for employers to apply them, and 2) not a lot of job fillers appreciate or follow them anyways. Plus, since each hiring is based on a very customized set of needs from the organization, people outside of that company can never fully understand what that it is trying to look for, and thus won't be able to contribute meaningfully to the strategies. Until more employers appreciate the more contemporary, data-driven methods of hiring, it's really a crap shoot for applicants right now no matter what they try. ",
          "score": 3
        },
        {
          "body": "I would love to join this, as searching alone I have been applying quiet a bit but not getting a lot of luck lately so maybe having a group and hearing others experiences will help out a lot !!",
          "score": 2
        },
        {
          "body": "Isn't this basically what this subreddit is for?",
          "score": 1
        }
      ]
    },
    {
      "title": "How to get a job at the Big 4 + Startups",
      "body": "Hey! My friend and I want to make a video to share career advice. I've had offers from Facebook, Snapchat, Quora, Microsoft, Tinder, Google, Pinterest, etc. My friend has offers from Facebook, Google, Microsoft, Pinterest, Uber, Snapchat, etc.\n\nWe want to do a Q&amp;A video and answer any questions you might have (interviewing, negotiating, deciding between offers, dropping out of college, etc)!\n\nComment with a question! :)",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/3sy9rn/how_to_get_a_job_at_the_big_4_startups/",
      "comments": [
        {
          "body": "&gt; Facebook, Google, Microsoft, Pinterest, Uber, Snapchat, etc.\n\nDid he just go around collecting offers or something for shits and giggles? Whats the point of that?\n\nEdit: FYI \"Big 4\" is in reference to the consulting companies McKinskey, BCG, etc. or the big audit companies, PWC, KPMG, etc",
          "score": 3
        }
      ]
    },
    {
      "title": "Tips for job questions/job examples",
      "body": "I will say this page was very helpful in my latest interviews, but I’ve also found some on Pinterest that were just as great for cheat sheets! \n\nI just went for my dream job to become an assistant estimator for a local construction company (which is my ultimate goal in my career), I prepared all week with what I’d written down as my answers for my questions stealing some focus words on my examples I’d found. I definitely felt more prepared memorizing to the point where I might slip up, and go a different route which felt not prepared to the point that they realized I had worked on this for awhile and it sounded more real. I also recommend remembering their name and using it in parts of the conversation and the thank you (interviewer name/s) for the chance to interview your company, I can’t wait to add (said quality for job) to (said company). I also sent a handwritten thank you letter (handwritten only because it was a small local business) to the owner for his time and gratitude THE MOMENT YOU ARE ABLE ON THE SAME DAY OF THE INTERVIEW. The handwritten letter or email for the depending company really see this as something that could entirely change the outcome as to if you get the job or not. \n\nI also have the question to anyone who can answer can I use my knowledge on web sites if I’ve created one using a simple format as in wix?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/dxhfrb/tips_for_job_questionsjob_examples/",
      "comments": []
    }
  ]
}