{
  "company": "plaid",
  "post_count": 15,
  "exported_at": "2026-01-18T17:44:53.300Z",
  "posts": [
    {
      "title": "Interview for Jim N Nicks BBQ outfit",
      "body": "This is what I’m thinking about wearing. I’m not sure if this is too little. The blouse is nice, the jeans are a size 9 (I’m a size 2) and they fit me fine, but the legs are a little slim. \n\nMy original outfit was that blouse and the plaid jeans that u may see a little in the second picture, but those pants don’t have pockets, so I wouldn’t be able to put my phone anywhere because I also don’t have a purse. I had black jeans but they are Belle bottoms. ",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/1l6ftln/interview_for_jim_n_nicks_bbq_outfit/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 9
        },
        {
          "body": "When I was a kid I was told never wear jeans to an interview, even if jeans would be ok once you were hired. \n\nThe black jeans are better than the plaid jeans, though they look really tight. Black pants would be better.",
          "score": 4
        },
        {
          "body": "Try on women’s suits and slacks in a department store. Macys, sears, Burlington etc. Get a feel for sizing, what looks good and what is comfortable. Don’t worry about length because pants are easily/cheaply hemmed. Buy a nice set for long-term use whenever you need to look nice. You can buy it new or look at thrift stores. Avoid yoga pants, skinny pants and jeans.  \n\nThen look at nice blouses. A collared button up and a dressy top. Something that matches the suit pants fine. Demure jewelry and makeup. Boring is fine because it’s about you say and not distractions.  \n\n Don’t bring your phone to an interview ever. Don’t bring anything other than your keys, a pen and your resume. No distractions. Put all items down and don’t fiddle with them. Practice interviewing using the most common questions.. ",
          "score": 1
        },
        {
          "body": "The jeans are really cute, but they are a bit too tight. If you still want to wear jeans, a black bootcut pair would look better and is easier to dress up. The bell bottoms might actually be perfect. If not those, then a regular pair of black slacks or trousers would work just fine.\n\nIt’s probably best to ask directly, too. Is this a casual restaurant or more upscale, like a 4-star place? Working in the back of the house usually means cooking, prepping food, and light cleaning, so the dress code might be different than if you were working in the front. That said, they might have you switch between the two, so it’s better to dress comfortable, but not too casual so you won’t feel uncomfortable while working.",
          "score": 1
        }
      ]
    },
    {
      "title": "Office casual for interview?",
      "body": "I have an interview tomorrow, and I am not exactly sure what I am expected to be wearing. The email I received said these exact words:\n\n&gt; The dress code is not that of normal interviews, we have an office casual dress code. Nothing sloppy, but no suits allowed!\n\nIs this the same thing as business casual? Would dark jeans with a plaid shirt be okay?\n\nI know I should be asking this in the current Resume/Interview advice thread, but it already has 90 comments and I was worried that my question would be lost in there.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/2g5wk4/office_casual_for_interview/",
      "comments": [
        {
          "body": "Maybe khakis and a plaid (long-sleeves) shirt?\n\nJeans can be a bit too casual at times.",
          "score": 2
        },
        {
          "body": "Very dark jeans are OK, or khakis. Wear good shoes, non-white socks and a collared shirt tucked in.\n\nEdit: and a belt",
          "score": 2
        },
        {
          "body": "ive always gone with slacks, a nice button down and some nice shoes, even when told to dress casual.  no one is going to fault you for that at an interview and perception is a big part of an interview.  if you look like you can be trusted, then the interviewer will be more likely to trust you.\n\nif you have no idea about decent fashion though this might not be the best idea.  generally dark colors are easier to get away with than with light if fashion isnt your thing.\n\nof course feeling comfortable is more important as its hard to be confident if youre not comfortable.  ive interviewed a lot of people and when they come in wearing say some tan dockers and a plain colored button up shirt, you can often tell that they just picked it out because they think thats nirmal atire and are incredibly uncomfortable.  as an interviewer (aka human), seeing you uncomfortable makes me feel uncomfortable and will work against you in an interview.\n\nas I finish writing this I realize that if youre asking, you probably dont often wear anything other than casual so going in with a more casual appearance may be best for you.  so if dark jeans and a plaid shirt is comfortable for you, that may be your best bet.",
          "score": 2
        },
        {
          "body": "Software business casual is totally cool with jeans and a plaid shirt. Do wear decent shoes. Don't wear those white-blue jeans (reddit apparently calls them 'virgin jeans'), don't have tears/homes in your pants, don't wear JNCOs. Don't wear a tie.",
          "score": 1
        }
      ]
    },
    {
      "title": "What are some companies other than Plaid and Stripe that have unique application processes?",
      "body": " Plaid encourages applicants to apply by API instead of using [lever.co](https://lever.co/) or an equivalent form like the Big 5 and most tech companies.\n\nStripe interview questions are more practical than your typical algorithmic data structure questions. Their internship HR for example, asks applicants to write a basic API.\n\nI was disappointed at first by both the above, as I strictly prepared for data structure based internship interviews but now I actually find it quite interesting how their distinct hiring practices are reflected in their culture.",
      "subreddit": "cscareerquestions",
      "score": 40,
      "url": "https://reddit.com/r/cscareerquestions/comments/iodbpm/what_are_some_companies_other_than_plaid_and/",
      "comments": [
        {
          "body": "Not a specific company but when I was doing new grad recruitment with a bunch of unicorns, the \"practical interview question\" style was a lot more prevalent. Ex: a series D unicorn asked me to write some backend logic that consumed an API of theirs, a series F unicorn asked me to build an input box with autocomplete\n\nThat same series F unicorn also had me go through a debugging question where we walked through an open source project that had a bug and I had to walk through my process to uncover the bug and fix it. Definitely was pretty unique and the first I've seen like that",
          "score": 20
        },
        {
          "body": "This is pretty clever actually.  If you can't do these things, you won't fit in.  I would love to see companies come up with creative ways to apply that reflect their culture instead of bullshit LeetCode.",
          "score": 37
        },
        {
          "body": "RedHat makes you navigate through their site's code to find the email through which you send your resume. Honestly thought I was going crazy for a bit because I couldn't see how to apply but it was a fun experience",
          "score": 9
        },
        {
          "body": "Can you expand upon what you mean by \"apply by API\"? Just curious cause this sounds interesting. You could say that a lot of applications are sent through an API, there's just a form or UI in front of it. Curious what they are doing differently. \n\nGenuine question by the way, not trying to come off sarcastic.",
          "score": 11
        },
        {
          "body": "Shopify seems to have a relatively unique process with their Life Story interview and similar to Stripe, a more practical focus rather than Leetcode.",
          "score": 5
        },
        {
          "body": "Not application but selection process:\n\nEtsy last time asks you to do an API test as part of assessment, involves using git, etc.\n\nBookBub makes you do a take home challenge for internship (they say 3 hours but takes so much longer for an intern, imo)",
          "score": 3
        }
      ]
    },
    {
      "title": "Starting first \"real\" job on Monday, looking for advice",
      "body": "I just graduated and I'm starting my first post-grad job at a Big 4 company in one of their satellite offices on Monday.  I've had a couple relevant internships so I kind of know what to expect at this point, but I'm super nervous because this is the first job where I really want to try and make a positive impression on everyone, unlike my internships where it was more of a learn as much as possible and leave situation.\n\nFirst of all, what should my appearance be on the first day?  I spoke with the manager and it's very casual dress (jeans and t-shirt), so I was thinking of wearing nice jeans and a polo on my first day.  My parents and gf keep telling me to wear business casual, but at the bare minimum khaki's, but I feel that is overkill and I will stick out.  FWIW, I wore jeans and a plaid button down to the interview.  Also, should I shave before the first day?  I normally keep a trimmed beard of about 3mm [like this](http://www.buzzle.com/img/articleImages/398049-5028-7.jpg) because I look like I'm 15 when I am clean shaven, but maybe it would be better to be clean-shaven for at least the first day?  I did shave before the interview.\n\nMost importantly, I need advice on how to handle relationships with co-workers and superiors.  During my internships, because I didn't care too much about advancing in the company, I often had pretty unprofessional conversations with coworkers who initiated them.  I'm going to try and stop doing this.  I'm also going to try to smile more often at people and be aware of my bitchy resting face.  How do I talk to superiors?  Should I be professional with them, or more informal?\n\nThanks everyone. ",
      "subreddit": "cscareerquestions",
      "score": 13,
      "url": "https://reddit.com/r/cscareerquestions/comments/26dquw/starting_first_real_job_on_monday_looking_for/",
      "comments": [
        {
          "body": "Relax, you've passed the hard part.\n\nNow that you're in the company no one is going to fire you over an unshaven face, or not wearing khaki's. Be yourself and let go of all of these issues, people would feel much more comfortable around you that way. Some people will like you, some people won't. That's just the way it is. Accept it and do the best work you can. Always keep good relations with your boss, and make as many connections as you can - you will need to have non professional conversations to succeed at that, so certainly don't stop it.",
          "score": 7
        },
        {
          "body": "Hey, everyone is nervous on the first day. So don't sweat it. Shave, don't shave, whatever you would normally do (outside of a job) do that. I work with clean shaven, chin strap, neckbeard, and supreme hipster beard toting coworkers. No one cares. My dad told me to wear a full suit to make a good impression (for the interview, and then again for my first day, after interviewing in jeans and a t-shirt). You would likely stand out and look like a stiff. The only people that wear even business casual in my office are Corporate Comms and sales people. I wear shorts, flip flops and a t-shirt every day. ",
          "score": 2
        },
        {
          "body": "&gt; should I shave before the first day? \n\nAre you male or female?\n\nSeriously, what kind of question is that? Ok, you're sincere. Yes, groom yourself properly.",
          "score": -2
        }
      ]
    },
    {
      "title": "If you’re feeling down about your job search, I’ve had a lot of rejection to get where I’m at, crappy economy or not… some tips and my story",
      "body": "I saw a post here a few days ago that made me really sad. Someone had just gotten a job after job hunting for a while after a layoff and then lost their job and I believe their partner also lost their job ..\n\nI know it seems like layoffs are happening left and right … because well it’s the reality … \n\nI am currently employed but I wanted to share my journey as I realize it’s never been quick or simple or easy for me to\n\nI got my bachelors in 2008 and had been working since I was 17. I had various jobs in fast food, summer camps, education system, county etc … \n\nWhen I got my bachelors I was working at a bank .. I graduated 2010 and was so excited to have a career job.. well the market was 💩post 08’.. I ended up staying at that job until 2016…. So a full 6 years! People would ask me why I didn’t have a better job yet and it would send me into sadness… I would drive home crying from work.. \n\nI was interviewing like crazy but it was so competitive … my field was criminal justice ..\n\nin 2013 I decided to go back for my masters… I felt hopeless .. I graduated in 2016 and before I finished I got another job at a bank.. they told me it would be operations but sometimes I would end up helping customers … \n\nI didn’t care but just felt like I was stuck in a field I didn’t want to be in.. I randomly get a LinkedIn message 4 months into that job that changed my life .. it was in my desired field.. the pay was not that great but the opportunity was amazing ..\n\nI end up there for 4 years and get laid off right before Covid … then I get another job at a startup making about double … and I get laid off 2 months later due to Covid!!! Then I’m applying aggressively and getting interviews and being told shortly after the roles were closed .. due to Covid !!! \n\nMeanwhile a friend of mine (with no degree) lands 3 jobs back to back in this time span.. it’s just luck sometimes \n\nAnyways - I take 8 months off and pick up some side work .. I start applying again and I find my job … \n\nWell months ago I see a job in criminal justice (not the field I’m at now) and I apply thinking nothing of it .. and they reached out to me.. I don’t think I’ll pursue it but take it from someone who got rejected thousands of times when I got my bachelors … sometimes it’s just timing \n\nSome tips from me:\n*These worked for me, and we are all different so just my personal experience \n\n- don’t spend 8 hours a day job searching .. pick a realistic timing. It’s exhausting and emotional. Be kind to yourself. My limit was 6 hours a day.. and balancing that with hobbies \n\n- I’m a hiring manager and can tell you, we get 500+ applicants sometimes. I’ve been ghosted before so I try to not create a huge applicant pool so each person can get appropriate communication and not be left in the dark. If you get left in dark, that is a sign of how busy or what the tempo of culture is so maybe a blessing \n\n- tailor the resume to your skills - and don’t over complicate it. I know this is plaid out but sometimes I don’t use an ATS scanner. I literally scan with my eyeballs \n\n- my biggest takeaway - I’ve never been a person who “gets jobs easily back to back in the 6 figure range” like some of the posts I’ve seen online. There have been peaks and valleys and rejection…. So when the economy is not good, it makes no difference for me personally because I experienced a layoff in a good economy … for me it’s about TIMING \n\n- find a nonprofit that offers career support .. I did a career bootcamp with one and it was free and gave me hope .. it was 2 weeks to help you with every aspect of a job search, including the emotional side \n\n- try doing a mock interview .. those help a ton..\n\n- Write up some situations you’ve helped solve at work or made an impact for, and have them ready for your interview .. interviewers want to see the impact you bring not just tasks \n\nI’m happy to answer any other questions too ",
      "subreddit": "jobs",
      "score": 20,
      "url": "https://reddit.com/r/jobs/comments/1l0v0oj/if_youre_feeling_down_about_your_job_search_ive/",
      "comments": [
        {
          "body": "\nnot trying to lower the value of your post, I can see its coming from an honest place. I think people would expect more practical tips to be honest (myself included)\n\ntailoring your resume will work for a few weeks until you realise you are still getting rejected/ghosting.\nand after you are doing a ROI in your head\n\ncareer support group, I personally never had a good\nfeedback/feeling from. because they went through the usual checklist\n\nbut again, this is just me, my feedback in the journey so far. \n\nto be fair, at this point, Im not even sure what more\npractical tips even mean\n\nI think the best bet is networking and there are obvious pro and cons here\n\nagain, not trying to lower the value of this post.\nmaybe Im just not in a very good place atm, I think weekends can be very hard for someone who is searching",
          "score": 3
        }
      ]
    },
    {
      "title": "Plaid suits",
      "body": "Are these type of plaid suits suitable for interviews?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1bidq0u/plaid_suits/",
      "comments": [
        {
          "body": "Yes. I would suggest to always go with navy blue/dark blue suits for interviews. Make sure to get it fitted for correct size and tailored. They should be able to help you with matching colors. For example, they might recommend a light blue dress shirt, blue tie, dark brown dress shoes and dark brown belt to complete the ensemble.",
          "score": 3
        },
        {
          "body": "I wouldn't. Esp not a 3 piece.\n\nBut hey I'm in legal, we're supposed to be boring.",
          "score": 2
        },
        {
          "body": "Looks fine to me.",
          "score": 1
        },
        {
          "body": "Sure, if you’re interviewing to be a fuckin hooker.",
          "score": 1
        }
      ]
    },
    {
      "title": "Appropriate attire for interview.",
      "body": "Do you think it would be appropriate to wear a nice pair of jeans and a blue plaid button-down shirt with a pair of polished leather work boots to an interview at an ice cream factory for a union electrical maintenance technician position?  I've already had the phone interview which went very well and we're both veterans.  The jeans is the one thing I'm most worried about, I've never worn them to a proper interview before.  I have slacks but I think they'd be too dressy and I have khaki's but they have pockets in the knees and I think they'd be just as casual as the jeans.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/hjjep1/appropriate_attire_for_interview/",
      "comments": [
        {
          "body": "Do you have a pair of dress shoes? If yes, go with the dress shoes, slack and button-down. If no to the dress shoes, go with your original assemble.",
          "score": 1
        }
      ]
    },
    {
      "title": "Messed up an interview for a potential good job, feels bad",
      "body": "Hey redditors, I recently did an interview this morning and am feeling bad for messing up. The job is a security monitoring job and the building and people looked highly professional (suits, professional attire in general) and I came in with casual wear (blue jeans, brown suede boat shoes, red plaid button up shirt with a blue Sherpa jacket), this is where I felt immediately out of place. I greeted the front desk clerk and the recruiter was right next to her so she escorted me to a room with about 30 people in total, all dressed up in professional attire, then me of course with regular casual clothing. The recruiter told us what the job entails and the responsibilities along with it, and then asks us to fill out the job application and put our resumes inside of it. At the end she says some people will be doing an interview immediately today, I’m guessing the ones they have an interest in and the other people not are not getting hired so I thought to myself I’m definitely not getting called in for an interview today. Surprise, I’m the last person she calls on for an interview today and out of around 30 people, only 9 of us got an interview for today so I’m extremely astounded and nervous at the same time, getting an interview with a job that directly correlates experience with my major in college right now scared me. And I’m the first person to be interviewed so the recruiter takes me to a room and asks me typical interview questions which I bombed in the sense that the answers weren’t  wrong, but my voice was just trembling, shaky as hell. I have done great interviews many times before even when nervous I would never get a shaky voice but this time was something else. I saw how the recruiter looked at me when I spoke and she seemed like she is definitely gona put me in the do not proceed with candidate pile. Anyone else ever messed up like this? I feel terrible today, i don’t know what came over me to have such a shaky voice, could have been my chance to secure a job that would provide me with enough income to finally move out. The recruiter said she will be contacting everyone within a week via email or phone regarding our status with the job. Redditors, do I stand any chance? I don’t think so personally after having such an interview, but mind you it’s an overnight position and from my personal anecdotal knowledge, companies have a tough time getting people to do overnight shifts so maybe they may consider me? Idk all answers are welcome, thanks!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/827sk5/messed_up_an_interview_for_a_potential_good_job/",
      "comments": [
        {
          "body": "As far as you being nervous, it's probably not as bad as you think.  Almost everyone shows some level of nervousness during job interviews and it's not something most interviewers are going to \"dock you points\" for.  As far as the dress code, yes you should ALWAYS dress up for an interview.  Being too dressed up is always better than being underdressed.  ",
          "score": 3
        },
        {
          "body": "Psh.. I get nervous and shaky too! It helps to practice with people to get rid of the nerves. Honestly, an interview can be very rehearsed. Practice for a lot of questions or take hold of the interview. I personally had a scripted introduction of myself and it helped me with the nerves. I was so nervous my lips were chapped and my mouth was extremely dry. I remember taking a break in between interviews after the first person and when I looked at myself in the mirror I was like wtf!!!\n\nJob interviews are scary.. However, it seems that in this setting they were speed interviewing.. I've never heard of something like this where they invite 30 people. Personally, that's a big no-no because it means that they are not trying to get me personally. Did you even know about the company beforehand?",
          "score": 1
        }
      ]
    },
    {
      "title": "Have My First Interview in The Next Few Days. It Is Expected To Last 2 Hours. Worried, Nervous, and Not Sure What To Expect. How Should I Prepare?",
      "body": "So this is my first ever interview and could potentially be my first job. It is for a vacancy at a cinema.\n\nThe interview is expected to last 2 hours. I'm pretty ecstatic right now, but my nerves are getting the better of me and I am now a bit worried.\n\nWhat should I expect and how can I prepare for it?\n\nEdit: I have just one suit, however I am unsure if it is suitable. It's a dark navy base, with quite a faint teal/aqua and darker navy plaid pattern.\n\nEdit 2: I cannot be certain I believe [this is the same suit](https://i.pinimg.com/originals/a6/d6/52/a6d652c3df8a713009112d1c8d2e83bf.jpg). The plaid pattern is a little more subtle in person.\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/7dku0l/have_my_first_interview_in_the_next_few_days_it/",
      "comments": [
        {
          "body": "That’s a nice suit.\n\nYou can ask the interviewer ahead of time if there’s anything specific they’d want you to have prepared or to cover. ",
          "score": 1
        }
      ]
    },
    {
      "title": "I need some advice about my new job.",
      "body": "Hey everyone, so, I've been in training for the past week in my first job. I'm 25 and I'm doing a \"Data Entry Analyst\" job, it's also remote. However, my hiring manager and supervisor have made me feel like I'm being stringed along a bit but anyways, that's not what I'm here to talk about. I was told by my supervisor that he wants to send me a check to help with the tools I'll be using for this job. So, I chose through bank because I don't have a car and the bank I use is not close to home. Well, he asked today if I could give him my bank username and password, which immediately gave me red flags. I told him how, \"I gave him my bank, routing and account numbers and why he'd need that information?\" He told me that, he's trying to link me through their \"Plaid system?\" but I don't know about that! It feels like it's a breach of privacy and I don't like the thought of my supervisor having my account username and password. It feels like a red flag, maybe, I'm wrong but I don't know?\n\nAlso, just to add to this, I'm autistic so I'm not for sure if I'm just being paranoid or being played for a fool?  \n\n\n  \n\n\nEdit: Thank you for the people that have helped me realize what I was thinking was actually true. I knew something was up with these people, seeming very dodgy by not responding to me, sometimes for days on end, spelling errors in emails and responses, no proper interview, them seeming very robotic in responses, being subtly rude to me, stringing me along and the \"hiring manager\" constantly saying things like \"Are you ready for your training?\" then asking for more information that he should've asked from the beginning, but I didn't realize the warning signs until later on. For the \"training\" from this so called \"supervisor\" I've been receiving, it didn't seem like training, just things you'd copy and paste off of Google when you look up stuff about \"What you'll be doing as a \"Data Entry Analyst.\" He also said something about \"angry customers\", I mean, I don't know about working with \"angry customers\" as a data entry analyst because that seems more the job of a customer service rep or something like that, right? Yeah, I would be working with others in the company to help keep data safe, clean and up to date and doing what people ask for to get things done in a timely manner, but it didn't seem right. I'm now just trying to see what he'll say or do next, I didn't give him any more information, but I want to see how far I can get him to go. I've never spoken to or seen either of these people (the so called, hiring manager or supervisor), face to face. I was recommended to do a video call with the \"supervisor\" but it wasn't working so he started \"training me\" on emails instead. He never told me the time schedules, I knew it was 9-5 because it said \"full-time\" in this offer letter but he never classified that, he also never said anything about a way to accommodate for our time-zone difference because I know, the hiring manager was centered in California due to a text I got that came from California from him. Plus, I don't even remember signing up for this job, maybe, I did but I can't remember because I was applying for so many at the time that I couldn't keep up with all the companies I applied for at that time which was from June-mid July when I got offered this job and then, stopped applying to go for this one. Also, this is a \"plastics company?\" Why would they need a data entry analyst? It just seems all too weird now, I feel really stupid and embarrassed that I believed and trusted them for so long. However, I'm just glad I didn't fall for any more of these people's scam because of you in these comments giving me a second opinion, so thank you very much for that.   \n\n\nIn conclusion, to other autistic people or people who aren't on the spectrum or neurodivergent, please don't give your information to anyone unless you know they are to be trusted in a workplace like a boss or your parents. Sometimes, you can't trust them either but look into things more, don't be like me, learn from my mistakes. ",
      "subreddit": "jobs",
      "score": 14,
      "url": "https://reddit.com/r/jobs/comments/15ggs5y/i_need_some_advice_about_my_new_job/",
      "comments": [
        {
          "body": "This is a common scam. If you just took the check then they would tell you to buy your equipment through a specific website and the check would bounce a few days later. \n\nCut off contact with these people immediately. You do not have a job, you are being scammed.",
          "score": 37
        },
        {
          "body": "This is probably the most common job scam on Earth.\n\nIf you've given them your DOB/Social/ETC., you need to lock down your credit ASAP. \n\nVirtually no one is hiring remote Data Entry Analyst and sending a check with tools.",
          "score": 16
        },
        {
          "body": "I do not know in what universe should someone need you personal bank password for anything.  \nAgain, I might be wrong, but I would be carefull if I was you.",
          "score": 13
        },
        {
          "body": "This is a scam. Please disengage from these people immediately. I'm so sorry this happened to you.",
          "score": 8
        },
        {
          "body": "This is not a legitimate job.",
          "score": 6
        },
        {
          "body": "Scam!!! Check out r/scams for further info. I'm sorry this happened, it's absolutely not a legitimate job.",
          "score": 5
        },
        {
          "body": "I'm so sorry but this whole thing is a scam. Stop all communication with them immediately. You are right- never EVER give that information to anybody. Please update us and like someone else said check out the scams subreddit",
          "score": 3
        },
        {
          "body": "Log onto Equifax and Transunion and put a credit hold on your name.\n\nIf they cannot steal from you with the bank account scam, they can steal your identity at worst and take out credit cards in your name at least.",
          "score": 3
        }
      ]
    },
    {
      "title": "What do I wear to a basic fast food interview",
      "body": "F/14\n\nI applied to Dairy Queen a few days ago and got an interview scheduled for Monday. I know to not dress up to well but I have no clothes that make me out together and can’t afford to get more.i was planning on a basic plaid button up but alas, I have no plain plants to wear them with- no leggings or anything. So I’m looking for more ideas that are a step up from causal but won’t make me look stupid- also, what do I do about my hair because it’s currently slightly blonde and red due to a botched dye job.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/gfevr3/what_do_i_wear_to_a_basic_fast_food_interview/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "If they hired you, you’d have to show up in pants, so... get some pants. Whatever you see the employees wearing.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 0
        }
      ]
    },
    {
      "title": "How to dress for an in-person interview at a \"laid back\" tech company?",
      "body": "Have an interview with a company and looking on Glassdoor, seems like it's pretty laid back (tshirts, plaid, jeans, etc). Do I still wear a suit &amp; tie?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/2vbr7n/how_to_dress_for_an_inperson_interview_at_a_laid/",
      "comments": [
        {
          "body": "Yes.",
          "score": 1
        },
        {
          "body": "Possibly skip the tie but I would still do suit for sure",
          "score": 1
        },
        {
          "body": "Hell no, wear a polo shirt and khakis...",
          "score": 1
        }
      ]
    },
    {
      "title": "I just got an interview for a District Manager position. How should I present myself at the interview?",
      "body": "I've never held a managerial position, and I have very little job experience. I was under the impression that you had to be a store manager before a district manager, and an assistant manager before a store manager, and a shift lead before assistant manager. I learned recently that you can start at assistant manager even without any job experience (this threw me for a loop), so I'm guessing district manager is kind of the same way?\n\nIn any case, they called me, which means they are aware I have very little job experience and no managing experience. What's the best way to present myself at the interview? Also, what do I wear? I have dress slacks, a pair of nice flats, but no \"business\" tops to speak of. I have two plaid button-ups but both of them are slightly too short. Is a white t-shirt okay?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1f0gqd/i_just_got_an_interview_for_a_district_manager/",
      "comments": [
        {
          "body": "Go get a suit. Go. Get. A. Suit.\n\nYou are an expert multitasker, you are good at reading people, and you are completely self-sufficient. They will think this before you walk out of the interview.",
          "score": 2
        },
        {
          "body": "You need a suit, Google search Manager and you'll see what a manager looks like, dress for the job. Get something that fits properly, its probably too late to get it tailored.",
          "score": 1
        },
        {
          "body": "Like a hard ass with no sense of humour.\n\nSerious answer: suit up/skirt up.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview wear + other tips please",
      "body": "Hiya, \n\nI’m 21 M and have a job interview for an IT support apprenticeship role.\n\nI’m autistic and struggle with clothing fabrics. I’ve chosen a nice cotton fabric black plaid shirt and formal black trousers that don’t feel awful. What I’m struggling with is I can’t deal with the sensory issues of a tie, so I’m wondering if it would be okay to wear a bolo tie to this interview.\n\nI live in Scotland, so I’m not American and it’s not something that you really see a lot\n\nI could go without it but I feel like maybe if I wore a bolo tie it would make me more memorable too because it’s a tad unusual. However I don’t want to have to explain I’m wearing it because I’m autistic and have sensory issues. I also don’t want to be memorable in the bad way because of it \n\nLet me know what you guys think please\n\nTLDR:\nShould I wear a bolo tie to a job interview in Scotland? ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1cmhj0l/interview_wear_other_tips_please/",
      "comments": [
        {
          "body": "I would say going without a tie would be better than a bolo tie. Generally you don’t want to wear something unusual even if you think that would make you memorable - boring as it is, company’s generally prefer standard business/formal wear for interviews as it shows professionalism. Doesn’t have to be full suit or shirt and tie - formal trousers, smart shoes and a shirt will be good enough for an entry level position. If I was going without the tie I’d personally wear a smart jumper over the top but that’s personal preference.\n\nGood luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "Have My First Interview in The Next Few Days. It Is Expected To Last 2 Hours. Worried, Nervous, and Not Sure What To Expect. How Should I Prepare?",
      "body": "So this is my first ever interview and could potentially be my first job. It is for a vacancy at a cinema.\n\nThe interview is expected to last 2 hours. I'm pretty ecstatic right now, but my nerves are getting the better of me and I am now a bit worried.\n\nWhat should I expect and how can I prepare for it?\n\nEdit: I have just one suit, however I am unsure if it is suitable. It's a dark navy base, with quite a faint teal/aqua and darker navy plaid pattern.\n\nEdit 2: I cannot be certain I believe [this is the same suit](https://i.pinimg.com/originals/a6/d6/52/a6d652c3df8a713009112d1c8d2e83bf.jpg). The plaid pattern is a little more subtle in person.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/7dl1pm/have_my_first_interview_in_the_next_few_days_it/",
      "comments": [
        {
          "body": "Suit's great. Personally, I would probably ditch the waistcoat for the interview.",
          "score": 2
        },
        {
          "body": "I’m assuming that you’re applying to be a cast member, so in that case prepare to portray yourself as a team player who loves people and challenging yourself. If you ever played on a sports team or did group work at school talk about that and how well you can work with others. \n\nIf it’s a group interview, don’t try to be better than the people you’re interviewing with. Be cool and supportive. \n\nAnd go in excited! Good luck",
          "score": 1
        }
      ]
    }
  ]
}