{
  "company": "pwc",
  "post_count": 27,
  "exported_at": "2026-01-18T17:44:53.300Z",
  "posts": [
    {
      "title": "PWC Corporate Finance Phone Interview",
      "body": "I am happy to inform you that we would like to proceed with your application for a graduate opportunity with our Deals Corporate Finance team. As a next step in our recruitment process we would like to schedule you for a first round technical interview. This will be a one hour technical interview with a member of the Deals Corporate Finance team.\n\nDuring the interview you will be working through a case study given to you by the interviewer. The case study tests your thought process, logical and mathematical skills.  During the case study you will also be expected to use ​market analysis and problem solving skills (strategic thinking)​\n\nWhat do you think I should be studying guys?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/61a1sr/pwc_corporate_finance_phone_interview/",
      "comments": [
        {
          "body": "So this isn't the right sub for your question, but you should research case studies. A subreddit like /r/consulting would probably be more useful. The basic idea of a case study is a fictional business wants to do something and needs you to evaluate whether or not this something makes sense to do, which you figure out through your ability to do arithmetic and asking relevant questions.",
          "score": 2
        }
      ]
    },
    {
      "title": "Negotiating internship offer",
      "body": "So I got an internship offer from PwC at $36 / Hour in New York City. No housing assistance whatsoever, and it seems like it's planned to be on-site. I'm interviewing with a few more companies right now, and to be honest the thought of moving to NYC on 36 bucks an hour doesn't sound great. The good thing is they gave me until the end of the month to accept it, so I'll take it only if I can't get anything else.\n\nMy question is, should I try to negotiate higher pay? And if so, how? I'm thinking of asking them to provide some sort of housing assistance, or bump up the pay to $40+.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/q7c548/negotiating_internship_offer/",
      "comments": [
        {
          "body": "Just ask, preferably with a competing offer. They probably won’t give a shit though.",
          "score": 2
        },
        {
          "body": "As someone who has hired interns, I've had people try to negotiate and we just say \"good luck\" and are done with them. Interns are an afterthought at my company and rarely produce anything of value.\n\nSome companies need cheap labor, so they might bump it up a bit, but I'd have a backup plan if I was in your shoes.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is it a mistake to try consulting for 6 months?",
      "body": "I recently got an offer to work at PwC as a Cybersecurity &amp; Privacy coop for 6 months. Based on the interview, the work would mostly be nontechnical and focusing on consulting. I am currently debating if I should take this offer or continue searching.\n\nI'm currently in my 3rd of 5 years in college and am still unsure if software engineering is what I want to do. I already did a 6 month software engineer coop at a very small biotech company and the experience was ok. It wasn't anything great and I felt burned out at times. I'm not sure if this is because of the company or because I just don't like coding. I didn't really have a team  there and worked alone on projects while getting feedback and code reviews from my seniors.\n\nFor my second coop I wanted to try something security related despite not having security experience because it seemed interesting and would mean less coding. I still want to do some coding but I'm not sure how likely I can get my manager at PwC to allow me to do things such as pentesting. The job still seems interesting and is something I'd like to try but I'm afraid it'll hurt me later on if I want to go back to software engineering or a more technical security job. Will having this as my most recent work experience instead of something more technical hurt me if I want to apply to more technical jobs next year? ",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/9ny9dz/is_it_a_mistake_to_try_consulting_for_6_months/",
      "comments": [
        {
          "body": "PwC is a big time company you couldn't find many better places to try consulting. \n\nI worked in software consulting for a while after college and ended up really liking it. I did end up writing a lot of code though, so don't be fooled by the job having non technical aspects. ",
          "score": 13
        },
        {
          "body": "No, internships and co-ops are your time to try different kinds of jobs with zero commitment.",
          "score": 5
        },
        {
          "body": "Nah. No risks here. Go try out PWC. It might even be a benefit later on. Good to have PWC on the resume. Good to have some security related position on your resume. Not sure if you are going to like it there. But you got to go try it out to know for sure.",
          "score": 3
        },
        {
          "body": "&gt; Will having this as my most recent work experience instead of something more technical hurt me if I want to apply to more technical jobs next year?\n\nI thought it wouldn't matter in my own case/life. IME, it matters quite a lot for technical SWE / security / research roles. I don't want to necessarily put you off PwC, but if you ask me, client facing stuff is the kiss of death this early in the career.",
          "score": 2
        },
        {
          "body": "Pwc is one of the (real) Big 4. Do it.",
          "score": 1
        }
      ]
    },
    {
      "title": "Career suggestion about switching jobs",
      "body": "Hii. I work in TCS(Tata Consultancy Services) for about 2 years now. I was thinking of switching job to a good product based company with decent pay. I've been applying for jobs for 3 months now. But didn't get much response. Only company which responded was IBM. But I couldn't crack their interview.\n\nI'm getting tired now. Can anyone suggest like how long does it take to get job in these type of companies (Microsoft, Google, Deloitte, PWC). Should I keep on trying or should I wait for another year or two, upgrade my skill and then apply. Any advice is welcome. Thank you.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/jaholh/career_suggestion_about_switching_jobs/",
      "comments": []
    },
    {
      "title": "Trying to get into data science - questions on what to do after graduation regarding offers",
      "body": "Hello all, first time posting. For some background I'm a cs major, California based, about to graduate this December and I'm more or less dead set on going into data science at least as a starting point in my career. Sorry if this is kinda wordy but it's a very specific dilemma I found myself in...\n\nI originally planned on going straight to grad school, taking a 6 month data science internship (or two 3 month internships) between now and when it would start. So far I havent heard back from any that I applied to out of 50ish except 5 denials and a request to interview from Genentech. (Side note, I know data science internships are typically for grad students, but I have a previous data science internship and some deep learning research that I think would give me decent chances)\n\nI also have a family member at PWC who encouraged me to apply there, albeit for a tech consulting position. They extended me an offer on the grounds that they'd rather have me on full time as opposed to an internship, and now I have 2 weeks to give them my decision.\n\nThe tech consulting position could potentially be with a team that works with machine learning and statistical modeling (one of my interviewers mentioned theyd really like me to work with their team that does this), but I they wont actually tell me my specific role until after I accept the offer... and I don't know if I'd want to do regular old software consulting.\n\nAll that said, would it be wiser here to take the position and delay my grad school plans? PWC is a really big name and I might still be working in a realm that's applicable to data science. But I also havent heard back from some internships I think I have a decent shot at, and internship + grad school seems better right out the gate for data science then a consulting position.\n\n\n\n\n\n\n",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/9voir3/trying_to_get_into_data_science_questions_on_what/",
      "comments": [
        {
          "body": "What’s your reason for wanting to go to grad school?",
          "score": 2
        },
        {
          "body": "Apply to business analytics positions. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Internship Offer from PWC - Technology Labs(Software Developer internship)",
      "body": "Does anyone have any experience in the PWC labs Technology Development Internship program. I was recently offered from PWC and I was wanting to know how your experience was with the company and or the program. I am leaning towards this company because everything on paper sounds great, the interviewers and HR people were great, but I am looking to gain a lot this upcoming summer(2020). ​ \n\nIf you have any experience with the company in general how was it, did you learn a lot, did this company help with you with getting other job offers? ​ I am also debating on either taking this job offer or accepting another from a large investment bank company( JPMorgan - pays the most) and a commercial real estate company(CBRE). All three are in the Dallas area, and to be honest money has never been my concern, I really just want to develop my skills(lots of hands on experience) and increase my options upon graduation and beyond. Ive never looked into financing, accounting, or any other non-tech companies for that matter. I had an internship at a tech company last summer(2019) it was great but wasn't the role I was looking for.\n\nThanks,",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/doub2j/internship_offer_from_pwc_technology_labssoftware/",
      "comments": [
        {
          "body": "how much travel did they say is required for this role? i just accepted a tech consulting intern position with PwC for next summer and i did not get the \"hands-on\" impression from my recruiters.",
          "score": 1
        }
      ]
    },
    {
      "title": "Business development - phone screen, what to expect?",
      "body": "Hi guys, I have a half hour phone screen scheduled for next week for deployment strategist position at palantir, with an HR person. I have a business undergraduate, and am currently working in advisory arm of a big 4 accounting firm (pwc, ey, deloitte, kpmg). I never in my life interviewed with a tech company, and don't have any tech background (other than my current industry focus is TMT..) \n\nwhat can i expect for the phone screen, and how should i prepare?\nthanks",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/3ibwjl/business_development_phone_screen_what_to_expect/",
      "comments": [
        {
          "body": "don't stress it the recruiter is calling you to see if you are who you say you are with very basic questions give you a little bit more information about the position and what they are looking for.  tell you about the company a little more and give you an idea of the interviewing process.",
          "score": 5
        },
        {
          "body": "HR phone screens are mostly about double checking that you applied for the job, you are still interested, you can legally work, what your salary expectations are, how soon you could start, why you're leaving your previous job, etc. They might also ask fluffy questions like what's your biggest weakness, what motivates you to succeed, etc. In general it's pretty straightforward stuff.\n\nTo prepare, I'd do some google searches for \"soft interview questions\", read up on the company (showing that you've done your research gets you some bonus points), and be prepared to talk about your roles at previous employers. If anything on your resume is a red or yellow flag (changing jobs frequently, employment gaps, etc), be prepared to explain it.",
          "score": 1
        }
      ]
    },
    {
      "title": "PwC interview",
      "body": "Okey i need help pls, what i should expect on hiring process for first 30min video interview with hiring team for PwC Internship for consulting department- Technology and strategy consulting",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1d4fgeu/pwc_interview/",
      "comments": []
    },
    {
      "title": "should i take capital 1",
      "body": "i work at pwc as a consultant in advisory im about 4 months in and capital one reached out to interview when i applied in the summer before starting at pwc. they offered me an analyst program and was wondering if i should take it and quit pwc? by the time i start at capital one i would’ve been at pwc for a year, is this career suicide to leave? \n\nwhat do you guys think is capital one better overall for the resume?\n\ni’m worried that what i’m doing at pwc isn’t transferable to any other companies so when i want to leave i wont be able to. also they have layoffs coming up from what ive heard (i dont think advisory is involved but unsure) ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1p2pwx6/should_i_take_capital_1/",
      "comments": [
        {
          "body": "Capital one far better. Do it",
          "score": 1
        },
        {
          "body": "What pws advisory service line? What CapOne service line?",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview resources for FDD interview at B4",
      "body": "Hello, I've got shortlisted for an interview for an Associate role in FDD at PwC (India), I'm feeling nervous for the interview (live). My background is that I'm a CA and CFA l2 candidate with experience in Direct and Indirect taxes. What can I expect to be asked in the interview (technical and with the hiring manager) and what are the resources I should be referring for my prep. Any help is appreciated!\nThank you.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1aui5tv/interview_resources_for_fdd_interview_at_b4/",
      "comments": []
    },
    {
      "title": "Can anyone offer any specific tips for a Big4 Graduate Forensic Analytics interview?",
      "body": "I am scheduled for my interview for a Graduate Scheme in Forensic Analytics as part of the Technology department of PwC. \n\nSo far I have been doing research on cyber crime and what contributions PwC has made relevant to this subject.\nI am familiar with Statistics notions and I have studied Econometrics so I can perform some extent of analysis with datasets in STATA.\nSince I do not have a Computer Science background I have also been looking at learning some basic coding in Python but I am afraid I am still lacking quite a lot when it comes to programming. I am hoping to work on those skills after I am done with exams.\n\nWhile reading about the general structure of these interviews I could not find much relevant information as most people are applying for jobs in Assurance or Accounting. I have read that the interview is 10% based on knowledge about the specific sector that you are applying to but even that seems a bit vague to me.\n\nI am just wondering whether someone could tell me if I am on the right path when it comes to preparing for this interview or whether I should approach thinga differently. Also if anyone could suggest any other things for me to read I would really appreciate it.\nThank you in advance for any contribution!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/86c25o/can_anyone_offer_any_specific_tips_for_a_big4/",
      "comments": [
        {
          "body": "It's very general. They will ask you behavioral questions with very little (or any) technical questions.\n\nAlso, I don't think you are applying to their technology department.",
          "score": 2
        }
      ]
    },
    {
      "title": "Take an existing consulting offer or delay for better prospects?",
      "body": "Hello, \nI was hoping to get some advice on a dilemma I was having.\nDue to circumstances that occurred in september, I had a job offer with BAE withdrawn last minute due to DV Clearance and mental health history reasons. As such, I ended up rejecting several other offers/interviews and missing the window for grad recruitment starting september.\n\nThe company that handled the recruitment for the job I lost, offered me a place on their grad scheme, that I have been considering. However, I hesitate due to a low base salary with a daily on site bonus (15k +£40 per day on site), which leaves me at a loss should there not be any work. A repayment clause for leaving early, and being lukewarm on the idea of IT consulting. [link to job](https://www.graduate-jobs.com/job/the-qa-academy-it-graduate-consultant-81256) \n\nIn the interim, I have several grad placement applications in the works, NHS, PWC and opus energy among some others. I hope that such a placement would be more secure and lead to better prospects/more agreeable work. However, these do not start till september 2017. Which is a long time to stagnate.\n\nWould it be better from a career perspective to take the QA offer and, even if it's not what I want to do for 2 years, and get the training and experience that comes with it. Or would it be wiser to hold out for september and get some temp work in the meantime? \n\nAny help would be really appreciated.\n\n\n",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/5hwvel/take_an_existing_consulting_offer_or_delay_for/",
      "comments": [
        {
          "body": "In the States, those kind of jobs are usually bad deals.",
          "score": 3
        }
      ]
    },
    {
      "title": "Anyone annoyed of \" games and personality assessments/quiz\"",
      "body": "New grad here and some places literally after submitting my application, tells me i passed or have moved on to the next step! Yay (not). They require me to do these garbage assessments or games that takes up 30 min to 1hr only to get a rejection email few days (or even hours) after. \n\nI just hate how they used ATS and basically every application submitted will \" move on to the next step\". I dont mind doing them if an actual person interviews me and if i am the finalist to evaluate me for something relevant relating to that role. The fact that you're making me spend my time and not even know who i am makes it a time waster. Therefore now when i see these assessments i just ignored.\n\nExample of some companies that requires these assessments (pwc, p&amp;g)\n\nOh and dont get me started with these \" pre recorded interviews\" thats also another waste of time.\n\nAnyone else feels the same way as i do with these assessments b.s? Sorry for the rant, just saw one of these invitiation for an assessment and got triggered.\n\nWOW i never though my rant would've had this many responses and likes. Thank you all! Glad to see many people have the same idea as me, for those who disagree it was great seeing the responses.",
      "subreddit": "jobs",
      "score": 488,
      "url": "https://reddit.com/r/jobs/comments/hlkya6/anyone_annoyed_of_games_and_personality/",
      "comments": [
        {
          "body": "Absolutely. What’s irritating is that they don’t share the assessment results, you have no idea how well or poorly you’ve tested, and where you rank amongst others. What’s disheartening is that we’re subjected to such rigorous testing that takes up so much of our time and we end up with nothing to show for our efforts. How many hours of filling out applications, answering questions tailored for ATS, testing and interview prep do we have to do to get one entry level job? All this hoop jumping to find out if we’re “the right fit” for their company. Something needs to change because this type process just isn’t sustainable.",
          "score": 178
        },
        {
          "body": "Before getting laid off because of the pandemic I was a trainer and used to fly to different locations for my company. Some locations implemented these personality quizzes for various positions in the company but it was after I started working.\n\nOne of the good friends I made was a manager at a location. They weren't getting great results from the quiz and she took it herself. She is so reliable and such a great asset to the company that it was so shocking when she bombed the quiz. So badly in fact that they had to start giving a different quiz because something obviously wasn't right.\n\nThey asked me to take the new quiz as I was the 2nd most senior trainer on my team. They said it was just \"okay,\" like they would gave called me in for the interview but my results were not promising at all.\n\nAfter that I really started looking at those quizzes differently.",
          "score": 66
        },
        {
          "body": "I’m in the final stages for some grad job, had really good interviews, got told that my numeracy test had the highest results and was also completed in the quickest time, but then my personality test they’ve taken some issue with. According to the test I’m not very optimistic and so they are worried about my low levels of trust???\n\nI have to confess I’m not sure why being a bit cautious and not just diving into the deep end without looking is such a bad thing to them",
          "score": 27
        },
        {
          "body": "It's literally yet another thing to weed candidates out on, because they get so many applicants per job they can afford to. It's shitty, but that's what they're for. \n\nI remember reading a joke about how a recruiter just tosses half the resumes into the trash because they didn't want unlucky candidates, which I found hilarious at the time, and probably truthful now. \n\nThere's too many people looking for jobs and not enough jobs.",
          "score": 20
        },
        {
          "body": "My comment got removed because I keep forgetting not to curse on here, lol.\n\nBut I hate personality assessments. They're only testing your ability to lie. Sure, I'm a sociable person! I'm absolutely positive all the time and all I care about is work!\n\nThe cognitive tests where you solve math problems and puzzles? They're there to weed out people with learning disabilities. I've done tests that had nothing to do with the job. I also did an assessment recently that was basically testing how dedicated you'd be to the job and how willing you would be to do overtime with basically no work-life balance at all, for a pretty crappy salary. I gave up halfway through because it was so ridiculous. No way I was doing all of that.\n\nAnyway, I just got out of college, I barely know who I am or what my \"work style\" is or how to describe myself so I just lie on those tests and pretend I'll be super dedicated to a job that I know won't care about me one bit.",
          "score": 17
        },
        {
          "body": "100%, did one recently for a job I forgot I applied for. 150 multiple choice questions of a) ?) Or b), I don't know what's wrong with 'C'. 2 weeks later I'm still unsure of what it assessed or how I did. \nI think I'd prefer even something like a 5 minute off the cuff phone call to see what I'm like conversationally.",
          "score": 16
        },
        {
          "body": "[deleted]",
          "score": 11
        }
      ]
    },
    {
      "title": "Unemployed - Can’t land a job",
      "body": "I have been unemployed for about 3-4 months and can’t seem to get a job. I’ve applied to hundreds of jobs, talked to numerous recruiters (who have occasionally been helpful with getting interviews) but still can’t get hired. \n\nApparently I am having more success than others because I’ve probably done 20+ phone screenings and about 15 interviews where 5 or so have either gone to a second or third interview.\n\nI have my B.S. in Finance and M.S. in accounting, and am enrolled in an MBA program (no more school after that)\n\nMy experience is in auditing for both the government (3.5 years) and PwC (1 year).\n\nI typically apply to jobs that require 2-3 years of experience which seems reasonable and most of the companies aren’t elite but rather normal companies that aren’t super prestigious.\n\nAlthough I am qualified, I can’t seem to make it to the hiring stage. I can probably get an entry level job without an issue but I don’t want to work at a job I could’ve gotten 5 years ago (that just seems crazy to me).\n\nI guess this isn’t a great time to be searching for a job due to the economy and the fact that it’s an election year but I’d figure that my field would be good to go but apparently not.\n\nIs anyone else experiencing the same thing and is this common right now?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1gamyot/unemployed_cant_land_a_job/",
      "comments": [
        {
          "body": "I went from a BS in accounting, did payables and receivables , ended up as a certified nurse assistant, went to grad school for something else after that",
          "score": 1
        },
        {
          "body": "same as in Singapore context",
          "score": 1
        }
      ]
    },
    {
      "title": "Should I leave my job?",
      "body": "Hello. I NEED HELP! \n\nI am 23 years old and I’ve been working in the Back Office of a local IT company for the past year. I’ve had a really good experience, the company has around 100 employees, everything is really flexible and nice! In the meantime I’ve finished my degree in Marketing so I’ve been getting involved in more marketing projects which I really enjoy! Lastly, I received a raise this past month and they expressed how satisfied they are of me.\n\nHowever, (in the time before I got my raise) I was sending out CVs to bigger companies in order to search for a better opportunity. Long story short I did 2 interviews with PwC, one of the Big4 companies, in an audit assurance position, and they did gave me an offer today!\n\nSo my problem is: Although I know that joining a big firm will have many benefits (opportunities, good name, learning etc), now that I have received my raise, I don’t really want to leave. They have offered me the same salary, so I don’t feel as motivated to leave.\n\nAnother thing is that I have applied for an MBA, and the results will be out in a month or so. If I do get accepted, won’t it be too much of a change? Me getting back to uni with long study hours, AND changing a job? I really feel comfortable in my current job especially being herw for a whole year.\n\nBut also, building a good career and having the chance to work with more important clients is vital to me.\n\nThey have given me only 1 day to reply!! Please help! Right now I feel like 60% staying (comfortable, familiar, showing that I’m grateful for the raise) and 40% to go to PwC (risky, more work, great opportunities)\n\nWhat are your thoughts? Thank you!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/16bodrk/should_i_leave_my_job/",
      "comments": [
        {
          "body": "If you're happy, stay. If you want more money, leave.",
          "score": 1
        },
        {
          "body": "It sounds like you're in a bit of a dilemma, and it's understandable given the opportunities and comfort you currently have. To make the best decision, you should weigh the pros and cons of each option. Here are some factors to consider:\r  \n\r  \nStaying at Your Current Job:\r  \n\r  \nFamiliarity and Comfort: You mentioned that you feel comfortable in your current role, and you've been there for a year. Staying would mean you can continue with the familiar work environment and colleagues.\r  \n\r  \nRaise and Recognition: You've recently received a raise, and your company expressed satisfaction with your performance. This suggests that they value you as an employee, and you may have opportunities for growth and increased responsibilities in the future.\r  \n\r  \nMBA Plans: If you get accepted into the MBA program, it might be more manageable to continue in your current job while pursuing your studies since you're already familiar with the role and the company culture.\r  \n\r  \nJoining PwC:\r  \n\r  \nBrand and Reputation: Working at a Big4 firm like PwC can significantly enhance your resume and open doors to a wide range of career opportunities. It carries a strong reputation in the industry.\r  \n\r  \nLearning and Growth: Big firms often provide extensive training and development opportunities. You'll likely gain exposure to larger and more complex projects, which can be valuable for your long-term career.\r  \n\r  \nNetworking: You'll have the chance to build a vast professional network by working with important clients and colleagues in a global organization.\r  \n\r  \nConsidering your situation, here are a few steps you can take:\r  \n\r  \nTalk to Your Current Employer: Since they value you as an employee, it might be worth having an open and honest conversation with your current employer. Explain the offer you received from PwC and your concerns about leaving. They may be willing to provide additional incentives or opportunities to retain you.\r  \n\r  \nAssess Your MBA Plans: If you're confident about getting into the MBA program, consider how it aligns with your career goals. Think about whether pursuing an MBA while working at your current job or at PwC would be more beneficial.\r  \n\r  \nLong-Term Goals: Reflect on your long-term career goals. Where do you see yourself in five or ten years? Which option aligns better with your aspirations?\r  \n\r  \nRisk Tolerance: Consider your risk tolerance and appetite for change. Moving to a new company, especially a larger one, may come with increased work demands and a learning curve.\r  \n\r  \nUltimately, the decision should align with your career aspirations and personal preferences. There's no one-size-fits-all answer, and it depends on your individual circumstances and goals. It's also important to remember that there's no right or wrong choice; both options have their merits. Take the time to carefully evaluate your options, and don't rush into a decision if you're not comfortable. You may want to seek advice from mentors or career counselors as well.",
          "score": 1
        }
      ]
    },
    {
      "title": "Two opportunities and timing",
      "body": "There are two very good PM jobs I am looking at. My feeling is that the interviews will be formalities. \n\nWith both opportunities I have strong connections pulling for me.\n\nOne is contract to hire at a medium sized company and has scheduled an interview already.\n\nAnother is direct hire at PWC with a good shot at being a manager. They have not scheduled a interview date but a partner mentioned flying down to meet me at some point in the next few weeks. \n\nI have a good stable job and am not pressed for time at all.\n\nI want the PWC job but I dont know their timetable. \n\nMy question is should I accept the contract to hire job and continue to interview for the PWC job  if it comes up? What are your thoughts? ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/ahikqm/two_opportunities_and_timing/",
      "comments": [
        {
          "body": "Depends. \nMake sure your contract doesn't have any crazy terms that would prevent you from working for a competitor or leaving within a certain amount of time. \n\nIs it worth leaving your current job to start learning the contract job?\n\nEven if you feel like you've got good chances, would you be satisfied with the contract job long term if the other company never showed interest?\n\nIf you're good with either job and the contract job is attractive enough to take you away from your current job then take it and see if the other comes back with anything. I had a similar situation myself a few months ago where I got a job offer, then an interview at a different place, took the offer, then a few weeks later the other place offered and I accepted. So I worked at the first place for 1.5 months (basically collected a paycheck or two) and moved on.",
          "score": 1
        },
        {
          "body": "If you have a good and stable job, and what you really want is PWC, why would you consider the contracting job? Take the interview for practice but wait it out for the job you want. ",
          "score": 1
        }
      ]
    },
    {
      "title": "PWC security process",
      "body": "I applied for PWC about a month ago, first phone interview then I interviewed with three different interviewers, also another phone interview with another director. Security screening person called me earlier this week and asked about security related questions, how long is this screening process going to take? It's been three day since I had a phone security screening, I have not had any offers yet. I don't have any criminal background nor bad credits (just decent). I was wondering if anyone would know how long this might take and when I can call in to ask for next step.. getting nervous for some reason that I might not get this job offer.. :-/ ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/5fpvdc/pwc_security_process/",
      "comments": [
        {
          "body": "At a company that big? It could take a while. I would wait a week before reaching out. ",
          "score": 2
        },
        {
          "body": "Every timeline is different. Don't put all your eggs in one basket and keep applying to other places.\n\nIf they don't give you the offer, you want to have something to fall back on like other interviews.",
          "score": 2
        },
        {
          "body": "-What role are you interviewing for? \n\n-What do you mean by \"security screening\"? What type of questions did they ask?",
          "score": 1
        }
      ]
    },
    {
      "title": "Pwc Senior Associate - Interview experience help",
      "body": "Hi, I have applied for the PwC Acceleration Center, Bangalore (India location), for a Backend Developer - Node.js/NestJS role.  \nFirst of all, is there any difference between PwC and the PwC Acceleration Center ?  \nSecond,  \nI had my first round of technical interviews, which lasted 30 minutes, and it went quite well. I have my second round of interviews of 60 minutes with US clients. Can anyone help what I should prepare?  \nPS: I am backend dev with around 4.5 years of exp",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1otamx4/pwc_senior_associate_interview_experience_help/",
      "comments": [
        {
          "body": "PwC and its Acceleration Centers are generally part of the same organization, but the centers focus on delivering specific services at scale. In your second interview, focus on problem-solving and showcase your proficiency in Node.js/NestJS. Be ready to discuss past projects that illustrate your backend skills. Given the US client interaction, highlight communication and collaboration skills too.",
          "score": 1
        }
      ]
    },
    {
      "title": "PwC Senior iOS Dev job interview prep and tips",
      "body": "Hi everyone,\n\nHope you all are doing well.\n\nI'm an iOS App Developer with 4+ years of experience in it and having total Work Experience of 5 years till date at an IT Company in Bengaluru. I'm planning to switch to PwC for a senior iOS Dev role.\nCan anyone please let me know the following? Thanks.\n\n1. What could be the salary?\n2. How will the interview process be and what are the rounds in it?\n3. What are the main concepts and knowledge that we need to know/have for the interview.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1em8fb4/pwc_senior_ios_dev_job_interview_prep_and_tips/",
      "comments": [
        {
          "body": "Focus on Swift, UIKit, and software design patterns like MVVM. They'll probably ask about your experience with networking, APIs, and maybe some security concepts. Brush up on your system design skills too, because senior roles often involve architectural decisions. We built a tool called [interviews.chat](http://interviews.chat) to help people get ready for these kinds of interviews.",
          "score": 2
        }
      ]
    },
    {
      "title": "Partner Interviews at PWC",
      "body": "I got an invite for the partners interview at pwc for tax associate. This is the final round so I'm a bit nervous. \nAnyone with some advice on what to expect ? \nI understand the big 4 have the same recruiting process so advice could come from anyone who underwent a similar pocess at any other big 4 firm. \nThanks ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/6frmm3/partner_interviews_at_pwc/",
      "comments": []
    },
    {
      "title": "SHL and Strategy&amp;",
      "body": "Has anyone heard of strategy&amp; game by PWC ? any idea about SHL aptitude test ? I have to take these tests for my job interview, but I have no clue how to solve it. Can anyone help me ? I will compensate nicely.  \nTIA",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/zc4g9n/shl_and_strategy/",
      "comments": [
        {
          "body": "Anyone who might need help with SHL tests in the future, please reach out. I can ensure you pass it",
          "score": 1
        }
      ]
    },
    {
      "title": "Technical Interview Tips",
      "body": "What can I expect from a technical interview with PwC for a position in tax?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/8ddbaz/technical_interview_tips/",
      "comments": []
    },
    {
      "title": "10 months job hunting, finally landed dream job. Here is my journey and lessons for you friends.",
      "body": "I am here to share my story in hopes that it might rub off or inspire those that are struggling to find work. \nI worked for 5 years as an outdoor instructor in NZ before eventually wanting to make something different of my life and I chose to study at the University of Auckland. I chose to study the two fields I was interested in which was philosophy and economics. To do so meant that I would have to do it through the arts faculty and only come out with an arts degree; no commerce degree for me. I did consider my studies as an investment however. I put the time into doing the readings, preparing for exams and took summer school each year in order to shave time off of my degree. I ended up completing it in 2.5 years instead of 3 but sacrificed a number of summers in order to do so. My GPA was only B+ average. Sometimes I got an A, other times I got a C+. I wasn’t a top student of any sort but I was a committed one. \n\nCome November 2015, I had completed my last set of exams, was feeling good about the results I would get soon and put my eyes forward to finding a job. What job did I end up wanted after my degree? Something in economics, business, accounting etc. What really tripped me up in the arts faculty was that they do not prepare you for a business template of job hunting at all, and I suppose rightly so for they are an arts faculty, not a business faculty. This meant that I was not told at the beginning that it was invaluable to be doing summer internships, work placements, volunteer work and preparing for a graduate programme at a large firm after I had finished. Instead I left in November and expected that I would probably have some sort of “office” job by December sometime and I could work my way into something I enjoyed from there. Naïve I know! But I actually had not been given any guidance or clues as to what I was to become. Maybe the business faculty of the university was supposed to do this at some point. I was interested in getting anything “economicsy” or “businessy” for the mean time. \nMy first reality check involved my CV. My sister who works at a large firm saw it once in passing and immediately scalded me for bad spelling, grammar, sentence structure, syntax, font type, spacing, professional wording, you name it. I am extremely grateful for the work she and some other professionals put into making it look nice and presentable and my first piece of advice would be that; get your CV looking professional and do not underrate the value of a second opinion. A well paid for professional CV is actually worth the money hands down. These companies actually have electronic filters for CV’s. They will trawl the list of thousands of CV’s sent and delete 99% of them using keyword culling. The same goes with cover letters to a more important extent. \nSo how long was it going to take me to get a job? 10 months. 10 long months of continuous searching NZ job sites, phoning people for opportunities, writing and tailoring CV’s and cover letters for each one in order for it to at least not be deleted without even being read. Here’s another opinion but I would not discard this method all together; job listing websites such as Seek NZ are almost exclusively after people with experience, or they immediately cull the ones without experience. For what it was worth to me, I never, not once, got an interview from sending my CV and Cover Letter to a company through Seek. Seek seems to work much better for people with experience and certainly not for someone trying to break into a field they don’t have a degree in. So don’t throw it just yet if this doesn’t apply to you. \nHere is where I can teach you the most on how to break into an industry. We have all heard it before, “it’s not what you know but who you know”. In my time phoning around people for jobs I had in mind my conversation would normally go something like this. “Hi X, my name is Y how are you doing today? (reply), hey look I am calling because I am a graduate from UoA in Economics and I am interested in working in (field) and I have heard you might be a valuable person to talk to and seek some advice. I am wondering if I would be able to get you a coffee and pick your brain about the profession sometime”. So this either got 1 of 2 replies. 1 being, “why should I waste my time with you, you don’t even have a commerce degree, no one is going to hire you, you made the wrong choice and need to go back to university and make better decisions” Basically they laugh you off the phone. (Click). The second reply was “I sure would love to get a coffee with you, I really appreciate the effort you have taken to get in contact with me, not many people do this, you stand out as someone with passion for field x, when do you have in mind?”. The people are few and far between but totally work the effort. Every time I sat down with one, they would buy me the coffee, I would have a large list of questions about the industry having done my homework on the field and we could talk sometimes for up to 2 hours about the field, history of it, where it is leading, job opportunities, sage advice from the person at the top. (these guys were often directors or even CEO’s, they actually are jumping in their boots to impart their knowledge, success lessons onto you). Now here’s what is interesting! I didn’t actually get a job from these guys however I can very very close. I would attribute it to just bad luck in the long run that this never worked and would actually advice this as the best way to get a job. These guys will shoot for the moon to get you a job if they like you. Sometimes the industry/company just doesn’t have a job going at the time or the decision just doesn’t stop with that specific person and you don’t get picked. The thing is that in knowing these guys, they will send your CV around to the golden destinations, put in their word for you, vouch for your passion and I even had 2 of them improve my CV once again to make it even more impressive. Once again! Call around and meet people face to face, this is the most valuable and opportune way to get a job in my opinion. \nI applied for 2 recruitment agencies. After talking with both and after a few weeks. 1 called me up asking if I wanted to be a milk man delivery driver, the other sent me to an interview that ended up being my foot in the door for office experience. These guys get you the small experiences that tally up on your CV. I ended up getting a second temporary placement through this agency to work at the might PwC big 4 firm. This was my massive break! 6 weeks working in the nicest offices you could work in. Free coffee quality machines, latest equipment, technology, software and the people are actually really nice! PwC would be one of the places I would love to work and hey I kinda did! For 6 weeks. The greatest part about this was that I now could stamp the brand of PwC on my CV. The funny thing is that no one actually cared how long I had worked there. My CV just showed I did and it was reputable. \nSo after working for 6 weeks in the nicest office imaginable and now having a few office work style experiences on my CV, I continued my search in July. Once again my big break came through the people I knew. You see I had gone to an interview early in the year after applying for a job on a company’s actual website. These jobs are not listed publicly on large job listing websites but are for the opportunist that aggressively looks for them on the individual company website’s career page. The bad news? I didn’t get the job, at that point someone who had worked for a few weeks at a big 4 firm made the marginal cut and was selected over me. The good news? The liked me. They said I had passion, a good nature, the interviewer said I was a neat guy and the HR employee who dealt with me knew my name. Over the year I would ring her for jobs I saw on the website, she would remember me from when I interviewed at the start of the year and would advise me on if it would be a good suited role for me or not. Many times what I was inquiring about was not for me. Finally at the beginning of August I saw something that looked like my field, economics, attention to detail, business minded, degree in quantitative discipline etc. So I called my HR contact up (let’s call her Sally). She immediately remembered me, probably a compliment on her side for good memory and amazing skill to have for her line of work. But since we had talked together about what I was after and I was a likeably quality on their records, she “green flagged” me in an application. This means that I am a priority candidate immediately and within 2 days had an interview.\nSo did I get this job? No! funnily enough, for a second time, it came down to it being between me and another candidate. I had aced the first interview, I had to do a presentation for the second one and apparently aced that and now I had met some of the high up managers of the sector, the really like me and wanted me to have the job. But my competition made the marginal cut once again. I got a few interesting calls basically saying that I was great and it was close but someone else had got it. But they best news was that this commercial manager dealing with me like me so much he was going to personally fit me somewhere, rain, hail or shine! You cannot believe what that kind of call goes down like. You have a manager offering to find you a position in their company due to your skills, experience, passion etc. So a few more weeks went on by and I eventually did land myself a contract. \nNow here is the funny part! All year I had searched for something between 43k – 50k as a good starting point, I was turned down after interviews for these jobs and I turned down a few myself for it not looking like what I wanted to do. I even had one place turn me down, tell me I was arrogant and wouldn’t fit their environment due to such. This was for a 43k job remember. Sometimes me confidence which is incredibly attractive to the industry is just perceived at arrogance and it can be a fine balance when played in an interview. This place asked me for a good example of my impeccable attention to detail and I very respectfully pointed out how their website’s blog page I had read was missing a few words at the start of a paragraph; a copy and paste error it would seem. Where some companies would find this a great example, thank you for helping them improve their website and eliminate an embarrassing mistake, these guys saw it as arrogant! We all know NZ is a really PC place, and that it is smack with tall poppy syndrome and had clearly walked on these guys “eggshell” egos and they weren’t going to have anything to do with me because of such. They are a small govt enterprise by the way and govt enterprises don’t breed the kind of people/managers that will take constructive criticism for its value. Their website still has the spelling mistake/omitted words too which shows the incompetency of these kind of peoples. I have strayed, 43k is what I wanted and this company that I go the job at finally told me early in the interview stage that I had completely undersold my value by saying I expected such a short fall in pay. They said I would probably be looking at the 55-65k range if everything went through. Well! I get a coffee a few days later with the commercial manager to do a “little dance” of negotiations pre-contract so we can smooth the process. He asks if I am happy with the 70-75k offer that he can present me in a few days. I play it cool and say yes. But holy shit! That is more than I was dreaming of for a starter package jesus! Then a few days later, HR calls me, they say my reference checks with my past employers have checked out and they would like to send me the contract. Get this! My starting salary will be 89k. Once again, I play it cool. But I have already gone full super saiyan with celebration when I am off the phone. That is more than twice as much as I was hoping on a starting job and I had been turned down for less than half that much this year!\n\nSo I the contract signed, I have been looking for 10 months and I have had to go through hell to get here no knowing when it will end but it finally has and with the most amazing results. The biggest lessons I can tell you guys are all my mistakes though! These are what teach us! My CV was horrible at the start and I am sure it was binned instantly for being so. Get you CV professionally done, it’s a massive investment. Tailor your cover letters for each and every position so that it has the key phrases they had in the job description. Follow up with calls as soon as possible. HR is either your worst enemy or your best friend. If you annoy them at all, you can guarantee they will bin your CV, block your progress and feed you to the dogs. If you get on their good side, they will fight for you, vouch for you and even call you personally when they hear the good news at the end. The more eager you sound the better! The more people you talk to the better! The more contacts you network the stronger and quicker you will get the job! Know the people you are interviewing with. If you wanted to play it safe perhaps I should not have called out spelling mistakes on a website of the company interviewing me, but that is just me! I still maintain it is a good example but it won’t get swallowed as one every time. Another lesson! A company sees value in you valuing yourself well. If you say you expect 43k, they are likely to think you are only work the minimum amount, if you say you are worth 50k instead, they will see that as you being valuable to them, taking yourself and your expertise seriously and being willing to work harder. Most companies are not actually going to choose the person they can pay the least to because the person who is more valuable is probably going to make that money for the company back more than twice over with their skills. Remember the choices we make will not always bring about the result we wanted but they were still the right decisions. This is what risk and probability tell us. Sometimes the right decision will be a bad result. A last insight is that I am an Arts graduate! I don’t have a commerce degree that everyone seems to want, I don’t have a post-grad degree either! I have just networked a bunch of select people who have all helped me in some way, shape or form and have held out for what I wanted. \nI know I haven’t structured this extremely well but I wanted to write you all anyway because I know how hard it is and have been reading all your posts all year for inspiration. And now I have come out in the clear with a good future and only wish I can help you guys a little with your journey. Hang in their guys! Hold out for what you want. My way of tying my expenses over all year except for the few weeks of office work was to wash windows for a living. I have gone from making about 25k to just get by to 89k in one final signing of a contract. It gets better and the light finally shines, the hardest part is now knowing when it will but it will. Once again, thank you all for helping me all year with your advice and inspiration. I hope I can at least help one other person out today. \n",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/54ixqk/10_months_job_hunting_finally_landed_dream_job/",
      "comments": [
        {
          "body": "wall of text..\n\nuse paragraph and space.",
          "score": 8
        },
        {
          "body": "Wow. I read this whole thing. I think you offered lots of insight and tips. I have a second interview coming up, and while I don't always like to bring up mistakes a company has made, I think it is helpful to do so sometimes. \n\nIt shows you have researched the company and checked it out at the very least. But you are right, it's a fine balance, I say pick the errors that relate to your job and point out positives as well. At least this is what I plan on doing for my Second interview! \n\nGreat read",
          "score": 1
        },
        {
          "body": "Thanks for writing this!",
          "score": 1
        }
      ]
    },
    {
      "title": "PwC graduate video interview",
      "body": "Hi I’ve applied for the Audit, Accounting, Tax and Finance Graduate job at PwC and have been invited to do the online interview. \n\nI’ve done a couple hirevues before and they’re usually fine, taking probably 10 mins to complete overall. But this says to leave aside an hour??!! \n\nHas anyone done this section of the application process and could let me know what to expect because I’m guessing it’s not your typical 3 question hirevue and I’m so nervous!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oi3flq/pwc_graduate_video_interview/",
      "comments": []
    },
    {
      "title": "Hi, I’m interested in joining an audit associate position with PwC Canada. Any tips for the pre-recorded interview?",
      "body": "",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/u5uopu/hi_im_interested_in_joining_an_audit_associate/",
      "comments": []
    },
    {
      "title": "Senior iOS Dev Job at PwC",
      "body": "Hi everyone,\n\nHope you all are doing well.\n\nI'm an iOS App Developer with 4+ years of experience in it and having total Work Experience of 5 years till date at an IT Company in Bengaluru. I'm planning to switch to PwC for a senior iOS Dev role.\nCan anyone please let me know the following? Request your advice on this. \nThanks.\n\n1. What could be the salary?\n2. How will the interview process be and what are the rounds in it?\n3. What are the main concepts and knowledge that we need to know/have for the interview? ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1emurpk/senior_ios_dev_job_at_pwc/",
      "comments": [
        {
          "body": "It's tough to give you an exact salary without knowing your skillset and PwC's specific needs. However, for a Senior iOS Dev in Bengaluru with your experience, you could probably aim for a decent jump from your current pay. As for the interview, expect multiple rounds – technical tests, coding challenges, and behavioral interviews with HR and management. Brush up on your Swift, iOS frameworks, architectural patterns, and be ready to discuss your past projects in detail. You could also check out [interviews.chat](http://interviews.chat) – we built it to help people ace these kinds of interviews. Good luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "Hey guys…",
      "body": "I am not sure this goes here, but I like to take my chances. Does any of you know what kind of questions PWC asks in their one-way interview and how did you personally prepare for that experience. \n\nThank you",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/pg7lch/hey_guys/",
      "comments": [
        {
          "body": "What role? What division?  What country?",
          "score": 2
        }
      ]
    }
  ]
}