{
  "company": "sap",
  "post_count": 71,
  "exported_at": "2026-01-18T17:44:53.302Z",
  "posts": [
    {
      "title": "SAP prescreen interview",
      "body": "Hello!\nI applied to SAP for a Junior AI Engineer role and I received a prescreen interview (30 mins). \nCan someone please tell me what is it about? Is it behavioural/techincal/both?\n\nThank you in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p09qv4/sap_prescreen_interview/",
      "comments": []
    },
    {
      "title": "Interview prep tips for switching from SAP Consultant to Scrum Master role",
      "body": "Hi! I’ve worked as an SAP CRM Consultant (1.5+ yrs) and completed PSM I + Google PM course. I’ve also worked in Agile teams.\n\nI’m now trying to move into a Scrum Master role.\n\nCan someone who made this switch share how they did it or what helped them?\n\nThanks a lot!\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1luwnqb/interview_prep_tips_for_switching_from_sap/",
      "comments": [
        {
          "body": "You're actually in a stronger position than you might realize for this transition. Your SAP consulting background gives you valuable technical credibility that many Scrum Masters lack, and having worked in Agile teams means you understand the dynamics from a team member's perspective. The PSM I certification shows you're serious about the role, but interviewers will want to hear specific examples of how you've facilitated collaboration, removed blockers, or helped teams improve their processes during your consulting work. Focus on stories where you guided stakeholders through complex requirements, mediated between technical and business teams, or helped resolve conflicts - these are core Scrum Master skills disguised as consulting activities.\n\nThe biggest challenge you'll face is convincing hiring managers that you want to step away from technical implementation toward servant leadership. Be prepared to explain why you're passionate about enabling others rather than being the technical expert, and demonstrate your understanding that success as a Scrum Master is measured by team performance, not individual technical achievements. Practice articulating how your consulting experience taught you to ask the right questions, facilitate difficult conversations, and adapt your communication style to different audiences. I'm on the team that built a tool for [AI interview prep](http://interviews.chat), and it's particularly helpful for practicing responses to those tricky \"why are you switching roles\" questions that can make or break career transition interviews.",
          "score": 2
        }
      ]
    },
    {
      "title": "May I know how many interview rounds have been conducted for SAP consultant in Infosys?",
      "body": "I have attended 1 interview round.\nAnd received an email for sending offer letter.\nCan someone tell me please",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/16qit22/may_i_know_how_many_interview_rounds_have_been/",
      "comments": [
        {
          "body": "I don't think you are in the correct place.",
          "score": 1
        }
      ]
    },
    {
      "title": "interview at SAP for app developer/tester intern",
      "body": "Hey! Does anyone have experience with SAP interviews or specifically this one? Would like to know how to prepare for the 30min call.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/12oqojb/interview_at_sap_for_app_developertester_intern/",
      "comments": []
    },
    {
      "title": "Anyone interviewed on-site at SAP concur for an SDE role? What was it like? How to best prepare for the technical interviews?",
      "body": "",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/9ok918/anyone_interviewed_onsite_at_sap_concur_for_an/",
      "comments": [
        {
          "body": "Hey!\n\nHave you interviewed with them yet?  \nI have an interview with them next week.\n\nIf you don't mind can you share your experience?",
          "score": 1
        }
      ]
    },
    {
      "title": "SAP Customer Success Academy Bootcamp",
      "body": "I have Bootcamp day tomorrow for the SAP Solution Advisory position at SAP Customer Success Academy. As far as I know, tomorrow I will be part of a couple of group interviews and 1 on 1 interviews as well. I would appreciate any feedback and suggestions from fellow Academy Graduates or SAP Sales or Pre-sales persons for tomorrow. ( which soft or hard skills are important, what kind of questions are more appreciated, etc.) I have never done a group interview before, The dynamics within the group can be very variable, how should I prepare myself for this? I see it as a great opportunity and I really want to nail it.",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/16rnaug/sap_customer_success_academy_bootcamp/",
      "comments": [
        {
          "body": "Hey, I am in the process of applying to this position. Is there any way you can tell me how it has been, and maybe some qualifications you had that helped you land an interview",
          "score": 1
        },
        {
          "body": "Hello, I just finished the online interview before few weeks and all went well, I followed up with the interviewer and surprisingly replied to the email and said the bootcamp in my country will be on 28 November and he will send bootcamp invitation emails to the selected candidates before 2 weeks (14 November).\n\nI think I will be one of the selected candidates, please contact me if you did the bootcamp or have some tips on how to prepare.\n\nThis is a once in a lifetime opportunity for me and I want to give it 1000%, it will literally flip my life upside down please support.",
          "score": 1
        },
        {
          "body": "Hey how did the boot camp goi?",
          "score": 1
        }
      ]
    },
    {
      "title": "Transforming into the Ideal Candidate: Seeking Advice for a Crucial Full-Stack Intervw in 2 Months!",
      "body": "Hi everyone, I've landed what I consider to be a game-changing opportunity: an interview for a full-stack position in Europe, scheduled for about two months from now. This isn't just any interview; it's potentially the most important one I'll ever have. They're primarily looking for devs with 2 years of experience in Java, specifically in Spring, Angular, and J-Unit. Angular expertise isn't a deal-breaker, but it's definitely a plus.  \nA bit about me: I'm a 22-year-old Engineer with a Master's in CompSci/Data. My experience is somewhat eclectic, stretching across internships and the brief period of summers post-graduation. I've dabbled in Java, SAP ERP, Machine learning, and a few other areas.  \nThis job is in Europe, and they're hunting for web developers with a specific set of skills, including writing clean code, client needs analysis, system improvement, test creation, unit testing, database management, and code maintenance and evolution. The technical stack they’re interested in is Java, Spring, Spring Boot, Maven, Hibernate or JPA, and JUnit.  \nHere's my challenge: I don't quite have the 2 years of experience they're after – I'm a bit short of that. So, I'm looking to create a rigorous 2-month training program to not just meet but exceed their expectations. I want to sharpen my Java, Spring Boot, and Angular skills, but I need advice on structuring this learning journey.  \nHow would you prioritize these skills in a 2-month crash course? What resources or projects would you recommend for an intermediate Java/Spring developer to level up, especially in Angular? I'm particularly interested in practical, real-world applications and any open-source projects that could provide valuable hands-on experience.  \nAlso, if you've been in a similar position – slightly under-experienced for a role – how did you prepare for the interview to outshine more seasoned candidates? Any tips on demonstrating potential and quick learning ability in a technical interview would be immensely valuable.  \nMy goal is to not just ace this interview but to be the standout candidate, showing that what I lack in years of experience, I more than make up for in skill, dedication, and the ability to quickly adapt and learn.  \nThanks in advance for your advice and insights. This opportunity is a big deal for me, and I'm all in to make the most of it!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/18ikaok/transforming_into_the_ideal_candidate_seeking/",
      "comments": [
        {
          "body": "\"specific set of skills\" and lists out the most generic, normal skill set of any swe... anyways idk the company so depends on their interview style but i'd just leetcode lol",
          "score": 1
        }
      ]
    },
    {
      "title": "Should I Obtain PM or IT Certifications Given My Background?",
      "body": "As a quick outline, I’m looking to transition careers and/or continue obtaining certifications and am looking for advice to the best approach. Input as to where to focus next is highly valued and I want to thank you all in advance for your input on this inquiry.  \n\n\nObjective: \n\nTo transition from Real Estate Sales into Project Management. I have roughly five years’ of on paper PM experience (over the last ten years) in the small business environment.   \n\n\nRecent endeavors: \n\nI obtained PMP® and PMI-ACP® certifications in early March, and I have seen a slight increase in outreach already. I have reached out to multiple recruiting services over the last two weeks and have received basically no follow-ups. Additionally, I’ve applied for roughly 150 jobs over the last two months which I’ve had roughly five over the phone interviews.  \n\n\nFuture possible endeavors: \n\nNow the question is, do I start applying for positions only, focus on online networking, continue a balance approach of applying for jobs while also obtaining more certifications, or something else?  \n\n\nMy current path: \n\nGiven my situation I’ve narrowed it down to two primary paths which include moderate levels of both job applications and continuing certifications. \n\n1. PM Path - This seems the simplest from here given that I have one of the highest and most accredited certifications (PMP) you can have in this domain. Continuing certifications, in order of operation, if I wanted to continue down a mastery path would be:\n\na. Certified Scrum Master (CSM)\n\nb. PMI-RMP® - PMI Risk Management Professional \n\nc. IASSC Certified Lean Six Sigma Black Belt™ (ICBB™)\n\nThe only drawback I see to this approach would be that I may be viewed as overly specific. \n\n2. Analytics/Software Path - I’ve had a few interviews for PM roles that I’ve been looked over because they want someone who understands specific systems, most commonly SAS, SAP, Salesforce, BlueYonder, MS Project, Xactimate, or insert one of a hundred other applications here. \n\nWhile worthwhile, I feel it would be difficult to obtain certifications for specific software packages until I acquire a job with an existing set of systems. Therefore, I thought a good offset for a lack of individual software experience would be to acquire Analytics and IT based certifications. Certifications, in order of operation, if I wanted to continue down this more general path would be:\n\na. ITIL 4 Foundation &gt; ITIL 4 Managing Professional\n\nb. Google Data Analytics Certificate for introductory phase (not really a certification)\n\nc. Associate Big Data Analyst (ABDA™)  \n\n\nConclusion/Advice:\n\nDoes being more rounded with generally certifications seem to be a better use of time than mastering the PM approach? Do these seem like good potential certifications to take if the former? Are there certifications out there you would recommend instead? Should I focus on individual software systems instead? Should I focus more on blanketing my resume and work on acquiring a position now? \n\nFinally, it may also be worthwhile to potentially go back to a brick-and-mortar university for a B.S. Civil Engineering Degree, but I’ve been reluctant to do so given the cost and that I have a M.S. Business Management Degree. I feel I get overlooked a lot because my degrees, while from accredited universities, are not exactly household names. Thoughts on this?   \n\n\nEducation/Certifications/Licenses: \n\n• M.S. Business Management\n\n• B.S. Business Management\n\n• A.S.S. Construction Engineering\n\n• Technical Certificate of Computer Aided Drafting Technology\n\n• Project Management Institute - Project Management Professional (PMP)\n\n• Project Management Institute - PMI Agile Certified Practitioner (PMI-ACP)\n\n• Real Estate Affiliate Broker - Two States  \n\n\nRoles (by title): \n\n• Director of Operations – 1.7 Years\n\n• Project Manager – 2.3 Years \n\n• Real Estate Agent / Property Manager – 2.5 Years\n\n• Operations Manager – 5.1 Years\n\n• Lead – 4.5 Years",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/11pmc3z/should_i_obtain_pm_or_it_certifications_given_my/",
      "comments": [
        {
          "body": "I feel that you are over-educated, over-certified and under-skilled.\n\nYou should continue to apply to jobs.  I suspect that your uptick is probably random.  I would not get more training, except perhaps in a specific, hands on technical skill.",
          "score": 1
        }
      ]
    },
    {
      "title": "How to vet a company for its engineers",
      "body": "In a classic entitled millennial move, I recently quit my cushy FANG job with all of its free food, fat paychecks, and high impact work. The company gave me way more than I deserve and I'm truly grateful for that, but I eventually had to leave because the isolation I felt on my team was making me miserable. You could sort my coworkers into two buckets:\n\n1. People with whom I had a large language gap and an even larger cultural gap. I could communicate with them about technical issues well enough to get my work done, but anything beyond that was a lost cause. Also they usually didn't speak English in the workplace which made me feel like an outsider on my own team.\n\n2. Super introverted and/or nerdy, to the point trying to converse or be friendly with them felt like a chore.\n\nHaving no one I could call a friend really took its toll on me and also sapped me of any motivation to perform - there was a huge contrast between my college days, where I could enthusiastically hack late into the night because I enjoyed being around my project partners, and my days at work where I couldn't wait to clock out.\n\nAs bad as my experience was, it was still useful insofar as I learned that by far the most important thing (for me) to look for in a company was the people I'll be working with. With all that said, my question is this:\n\nWhat strategies do you have to vet a company for its people and culture, to make sure you'll fit in? I'm curious about all stages of the process: finding companies to apply to, things you can ask during your interviews, anything you can do after you have an offer, etc.\n\nI really, really want to work at the kind of place where I can actually look forward to getting lunch or happy hour drinks with my teammates. Do companies like this even exist in the bay area? I genuinely enjoy software engineering but I would never have chosen it if I knew this was the social environment I would be consigned to.",
      "subreddit": "cscareerquestions",
      "score": 57,
      "url": "https://reddit.com/r/cscareerquestions/comments/acbnwm/how_to_vet_a_company_for_its_engineers/",
      "comments": [
        {
          "body": "References in the industry are your best friend. Knowing exactly what you're getting into from someone you know is invaluable. That being said, if you don't have a nice network built up, the next best thing to do is just have a conversation.\n\nInterviews are two sided, which I think you understand. Just have an honest conversation without making yourself or your current company look bad. Get a feel for how they are to work with. Ask honest questions. \"What qualities do you think I need to succeed here\", \"What are issues that you are facing as a team or company?\" \"How big is the team, and what are the roles?\" \"What do you like most about working here?\". \"What's the work life balance like?\", \"What's the average day like for a developer?\"\n\nYou don't care as much about the content of the response as much as you do about the attitude. I turned down another Big N position because the responses did not seem genuine, and the one response that did seem genuine seemed like it was carefully worded, but was still negative. Carefully worded negatives, or negatives that are dismissed are usually a red flag for me. \"Yeah we have to log what we're working on every 15 minutes, but it's not *that* bad\". No thanks. \n\nI've asked questions about work-life balance and the responses seemed canned. Or I asked and one guy seemed like he was about to fall asleep. I've asked the question about issues the company has been having, and the guy straight up told me \"Look, we have some really shitty legacy code that we're transitioning off of. You'll probably need to be involved in that a bit, but if you're willing to work past that, I think there are some good opportunities here\" (I took that job and it ended up being great for my career growth).\n\nWhen asked about every day life, one lead told me the daily schedule followed by \"We realize that sometimes sitting in front of a computer isn't the best way to solve a problem. A lot of times we just take breaks and chat, sometimes some of us walk over to Target.\" It ended up being a group of total goofballs, which was pretty fun for the time I was there.\n\nThat being said, it's easy for people to lie in interviews about their company (again, interviews go both ways), so rely on glassdoor or other online reviews to see if any of your suspicions check out. Again, having a reference is your best bet. ",
          "score": 24
        },
        {
          "body": "Make sure you're interviewing with your future peers, not randos assigned to an interview panel",
          "score": 13
        },
        {
          "body": "[deleted]",
          "score": 25
        },
        {
          "body": "I've had a really similar experience moving to a big 4. I used to get drinks with my co-workers constantly at my last job that was pretty corporate but less prestigious. 2 years into this job there's still nobody I would ever hang out with after work",
          "score": 12
        },
        {
          "body": "Stalk linked in employees and read Glassdoor reviews for broken English",
          "score": 5
        }
      ]
    },
    {
      "title": "I have my first Internship interview with SAP. It's for Developer Associate in Test. How can I adequately prepare?",
      "body": "I recently applied to a Developer In Test Internship at SAP and I'm a little worried as it's my very first internship interview.  I'm not sure how I can fully prepare as they've told me that it'll be behavioural and technical.  To be fully honest, I've never actually worked with any sort of QA or Test software and I don't know what to expect.  Can anyone help me out with some sort of preparation, it would be greatly appreciated.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/6h8pyq/i_have_my_first_internship_interview_with_sap_its/",
      "comments": [
        {
          "body": "First off, I would look on Glassdoor to see what other people have said. However, in reality, most if not all companies will always ask a coding question and then follow up with in your case a QA question.\n\nGood luck! \n\nBy the way, is this for Fall 2017?",
          "score": 3
        }
      ]
    },
    {
      "title": "My latest job search after getting laid off for the 2nd time in 2 years",
      "body": "[Here's my latest Sankey diagram from this year's job search](https://i.redd.it/xp4tufwh7z8g1.png).\n\n[Sankey Source](https://sankeymatic.com/build/?i=IIBxBsEsFMBMAIDaBWAbAXXgOQPbwE7QDOIOAdkdAFCgQwKIDMjmAStAFbQDGALnDTBQ4SAByYAwgENw4eAHcA9AR74ArpH75BdEU0wB5MlDLR4UopUsBbaGV5Uq7bus3R88W5akBzEbaRUACZMAHVNAAtYQnknVQ0tT2IiX38zRCCARkkZOSUVFwT3OMK3Dy8UvwQAxHF4AHEInCJ%2BWEd2KW4IkRw1XnhePGsAT3hTXnkcfABrJGz4di4%2BAQ6unr6BodHxyZm5nNkFZUJSrTjO7oRe%2DsHPbegJqdnEeYBJMk1IGQGeCI%2Dub74XpkNqrS7wa6bO5jB67Z7zXAqEjkSiOaSHfInVyJFBhSLRaCxdF5Y7xMpIADsbE4PFaVGJRwK2PcSBYDSaLTgAEh6blGViih4XshMO9Pt9%2BF1%2DoDgW0GZiyTj5gAVKTTMxNAIWIiQHxkWz2XkY0mnFn6eDhXhRGLmABmiU63GgIF4kDIPghVpZOFttuKVCMJjM2uSBv6L2pSzpgbdwcsobs4bZluthIDxlj5njNkT%2B3gADE3TK1CDHMBXuY%2DPZzEJ6PBbVMkkgACwHElMwU0CupatSWsiBvldLzGOmLNWIhhxxi10S37SuRAksMNmLWkCGdfOSSv6QAGL2V5lME2KbudSvfFkFIELs5qtLmPqhn7fzy8H5diTCFshXtovn4L33AhDwjeBRzjCcpwAncFxAz8wOPG0pHtFlHWdV13U9boPB9P1tCoVV1XgTVIN1fVc0Q%2DEYkcH8%2DxvSN1zaOiP2vRBWwtajCTtB1uCdF03Q9HAvVw31ihY%2BC2LZAwxIImT8LzYA%2BIwgR5LNW8ABEeCDNoqAALjXZYEAAYgkCQAAZLPM%2DTEUIZEKDMYyKWbZznP0%2BUTWZDxjIAI2QbhmyCCl9KQ7jjIATnC0RbQpRh9KU%2DjWngYzLPzfNLP0tTvMs7hwoyvSYLfYCl2vFLzObZB8okkqTMsilYHyrTuB05LLMC%2DLQvkHi0OUgSsOEnCIVk5LYGgKQ8vC%2BL%2B1qqz8vLStcz7XQEEHJsytm%2DSwXWG4thhR49nWqzNsVFkKlSapHNm%2DKIPHBNq2Mxggh8xhzOCvTGnvERjNQerUGgaydQALzMLrMnCoJrJI%2BBMnM0RrOsKR8B8N14DkTIgioAhoYxgZodETGfPgCGqB8j1uBwcBG2M30adtTHeHwKQKBARHcywKgyBwUaFGxzGIngSrMZITpBPgClkAJqZRo8SGvS1THycp7zRBV1XMZwFnuE0UZMioW1Ka67g1HwAA3KReGNsxzIAOgl%2BA3RwzRbSBawBkRvwHHgRWqci33JohTXtfgG2KqocApGGSEpbQvocAR11uExjg1BaSBbUj%2DBdTdIhsCTlPXXTuxYBz9mVBN9xKB8RmQH50vzd4C43XJ6wIAeYhblMVmWjDqQfOgcAc%2B97Krr5yBudLiJdQiKAfAifobfFzGG3sW1OjMFIKAAWkoTO6dR2Nha1rCbZxwhw9dcugbMTIYcxhG9TTnWMvDvvwF%2DLUwDG%2DAc4ATSFyBgbQ1QJjeQ0Ap79GbM%2DXu%2DczbgDUMGT%2BiNf5LzULIEAJxIA6nIPAP%2B8BSA6ldNg1%2BOBYgKDAbPCBUDX74M%2BNgqQscZDkWDkLNYWpY5L0gN%2DfofdBzUHgD5QgapSBun6PjWB8D6xTHjvAAA5AAGmtjIzG6DoC2kgAAD1kUo%2BARA1C%2Bg0VoqgctoB4UoP0KQ8BgH8OYV7GxCB4YPAsWGSAKImbqmGPHPcODMZQFTtYHyMgmZOmQdYHA5d4C0GEPYuR8BN423KpFCWoTwm2WIKQBywdraWVQMgCkMS4nW0yKgF6GNklmGcF5JI3gqhNgKW1RgmQYk2yKaITISSwnlLGmsK4GxbgjD2nCTJllMiiGQPkm2jBRBBFEHFMp8APIdnJPE5AlVmxNKycgUZpSOngQzGOEMOZqzNPMowcW6zzJBCCM2SaczCpAXos0kZQRGDjKyS9Rg7TwkfU5PYrJ4VkDhTWZkzIFJzJtKoHM6qh54moHMsgRpQyrLNghTsoiGo45kT1GGWJyzkDNheTirJrTRkovCYZJK8TwptNQK8x6pzkVzM6pkoImznmvJhqgfFpKzBZURVFMZhKrKRW5RE3qSU6kUlQP815cKgjhWAXMpqLUJW5IJfEik6NtnhPmj2cx01JFDkRejAlBTTlRVmTsplKFeKJVFgNb0w14nmVQEU9ZN9yrICAA)\n\nMy previous job search posts:\n\n* [2024 after also getting laid off](https://old.reddit.com/r/cscareerquestions/comments/1ppv153/got_laid_off_last_year_for_the_first_time_in_12/) ([Direct link to Sankey](https://i.redd.it/wwa5kzx1nz7g1.png))\n* [2021's passive search](https://old.reddit.com/r/ExperiencedDevs/comments/rqpfir/the_result_of_my_passive_job_search_over_the_past/) ([Direct link to Sankey](https://ibb.co/wNs95nfL))\n\nThis latest search was after getting laid off at Meta after not quite 1 year as an E5 in Bellevue. Overall the search went much better than last time. With it being only a year since I had gone through this whole thing I felt a lot more prepared and I think it shows in the numbers.\n\nA few clarifying points about my labels:\n\n* \"Reached out to my network\" was me reaching out to anybody I had interacted with previously including co-workers, recruiters I had worked with before, and actually the offer I turned down last year. The company that gave me the offer I turned down last year met with me but they didn't have anything open and it didn't go beyond that.\n* \"AI agent applied for me\": I used several AI services to find and apply for jobs on my behalf. These were Jobhire AI, Wobo AI, and Sonara. I didn't count all of the applications they sent out for me because the vast majority of them were ignored. I estimate that it was approximately 200 applications that got sent out by these. I could make another post on my thoughts on these, but to sum it up, Jobhire was absolute trash, Wobo wasn't much better, and Sonara was worth the price in my mind. Overall the AI agents got me interviews with 3 companies, 2 of which proceeded to the final round (1 rejected me and the other I withdrew after accepting another offer).\n* \"Withdrew after accepting other offer\": This means that I withdrew from interviews before getting an offer from the place I was interviewing with because I had already accepted a different offer. If a company made me an offer, that got counted with the \"Declined\" label after \"Offer\".\n\nI've got 13 years of experience with two FAANGs and a FAANG+ on my resume and my specialization for most of that has been in developer tools and infrastructure. System design questions are still my weakest point, and I'm hoping that this next role will help me with more practical hands-on experience that I can use in the future for those problems.\n\nMy offers:\n\nSeries A Startup | Series B Startup | Axon\n-------------------|--------------------|------\naccepted | declined | declined\n$205k base | $200k base | $188k base\nno bonus | 15% bonus | 10% bonus\nOptions | Options | $160k RSUs over two years with 1 year cliff (+ refreshers)\n2-3 days hybrid | 2-3 days hybrid | 4 days mandatory in office Tue-Fri\n\nSome quick stats from the Sankey:\n\n* Acceptance rate from manual applications: 11% (11/100)\n* Pass rate for initial rounds: 64% (9/14 - not counting ones I withdrew from)\n* Pass rate for final rounds: 60% (3/5 - not counting ones I withdrew from) - this is a personal best for me. I'm not sure if the 4 companies I withdrew from would have been a similar success rate, but I'm happy with it.\n* Nearly half the recruiters that messaged me first were for shitty contracting gigs even though I indicated on LinkedIn that I was not interested in those. Ironically at least 10 of those were third party recruiters that wanted to put me right back in at Meta doing almost exactly what I was doing before ... hmm ...\n* A huge percentage of companies I interviewed with (maybe 85%?) had \"AI\" in their name and almost every company I talked to emphasized how they were incorporating AI in their product or process. The startup I accepted an offer from is the type of company that is selling shovels during this AI gold rush.\n\nOverall this search only lasted two months. I hit the ground running as soon as I got laid off from Meta and I had accepted an offer before 60 days had passed. So much better than last year!",
      "subreddit": "cscareerquestions",
      "score": 122,
      "url": "https://reddit.com/r/cscareerquestions/comments/1pty6o7/my_latest_job_search_after_getting_laid_off_for/",
      "comments": [
        {
          "body": "Congrats!!",
          "score": 15
        },
        {
          "body": "What's the TC difference between Meta and what you have now?",
          "score": 12
        },
        {
          "body": "Why didn't you go with Axon? Seems like it would net you $280k TC",
          "score": 10
        },
        {
          "body": "Can I ask what led to the layoff at Meta? Was it just not a good fit or were there things that didn’t work out that could’ve been improved?\n\nAsking so I can better understand how to survive meta ",
          "score": 7
        },
        {
          "body": "How did you prep for interviews? I find I similarly have most of my experience related to infrastructure and developer tools as well so I’m still very very weak in terms of system design interviews. I recently got interview feedback that I lacked strong enough understanding of db / transactionality concepts related to it. \n\nWanted some good ways and resources to study up / be better prepared for future interviews.",
          "score": 4
        }
      ]
    },
    {
      "title": "I have an interview for a Jr SAP developer in 4 hours, what should I know about ABAP and SAP?",
      "body": "I've been looking for a more traditional programming job in something like Python or C, but this opportunity came up and I figured I would give it a shot. Where can I go after 3-5 yrs as an SAP dev?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/4w06pk/i_have_an_interview_for_a_jr_sap_developer_in_4/",
      "comments": []
    },
    {
      "title": "Is having certificates worth anything anymore?",
      "body": "I’m a junior trying to break into DevOps/cloud roles and I’ve been getting some certs like aws cloud practitioner and aws solutions architect associate, KCNA and I also interned as a DevOps but I’m starting to wonder, do these actually help juniors standout anymore?\n\nI keep seeing mixed opinions. Some say they’re just HR filters, others say they don’t mean anything without experience. But then again, how are juniors supposed to get experience without something to show?\n\nSo Have certs helped anyone land interviews or jobs recently? \n\nAlso what would you recommend doing? I was planning on preparing for either CKA or AWS SAP",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/1m8r1y8/is_having_certificates_worth_anything_anymore/",
      "comments": [
        {
          "body": "Never was. Unless you’re doing like help desk work or security IT.",
          "score": 43
        },
        {
          "body": "Never was for any job requiring a CS or engineering degree. Help desk support dude that unlocked my account said he needed the A+ cert. Different world where certs aren't scams. I'm with u/Known_Turn_8737 here.\n\nIn about 1 in 20 job applications, I'll see entry level AWS/Azure/GCP cert listed as a plus. That is all. Practitioner is a scam within that 95% scam. Associate is what is listed. I've never heard of CKA in 10 years of DevOps.\n\nGet an internship or co-op. That trumps everything else on your resume.",
          "score": 15
        },
        {
          "body": "Have a few AWS ones, never helped whatsoever. No one ever cared",
          "score": 8
        },
        {
          "body": "For DevOps, look into CKA. Also, Azure and AWS certs will do you good.",
          "score": 8
        },
        {
          "body": "Yesn't. You are a fresher and have no way to prove anything without experience, so certifications do highlight things. But after that initial highlight it will boil down to your knowledge. The most qualified and reputed certification means nothing if u don't have knowledge to justify it. Once you get even a little bit of experience, the certification itself becomes useless.",
          "score": 8
        },
        {
          "body": "Certifications alone won’t help you need project work and tech stack which is in demand and also you should have good coding skills etc.\nCertifications are a piece of the solution to the puzzle not the whole solution you need to add other pieces to get hired.\n\nStill they are better than not having them just don’t expect to get hired based on getting them.\nGood luck 🍀",
          "score": 5
        },
        {
          "body": "No my last hiring manager and director of IT literally laughed when our team (about 4 people plus him =5) started talking about certs\n\nI think I remember him saying something like it might even be a sign of a bad candidate",
          "score": 3
        },
        {
          "body": "Niche fields usually require some certificates like Salesforce/SAP etc. Or often times with cloud tech such as GCP/AWS/Azure, but not as often as CRMs I listed above",
          "score": 3
        },
        {
          "body": "I don’t remember a time when the general wisdom wasn’t certificates are worthless.",
          "score": 3
        }
      ]
    },
    {
      "title": "Laded a new Job in a SAP silver partner company as a \"Software Engineer Trainee\"",
      "body": "Laded a new Job in a SAP silver partner company as a \"Software Engineer Trainee\" and now I am being trained on the ABAP language , whereas I was looking for a Java developer role and somehow got here , in fact in the interviews also I was asked springboot and java questions, until the last round where they informed me that you will be working on the ABAP, BTP technology, I am pretty good in java (8/10) and well versed with the Java frameworks like, Hibernate, SpringBoot, SpringSecurity, and also have knowledge of JavaScript...etc , I somehow feel like I am stuck in this proprietary legacy shithole. But since my grades were less I was getting less opportunities , I said yes, but I want to switch to a Java developer role either CAPM Java inside the SAP ecosystem itself(maybe it would be an easier path) or purely as a Java developer I don't care, but I want to get out of this proprietary shit. How can I do this ? I need suggestions is it even possible after 1 year ? if yes how easy or difficult is it??",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ost6od/laded_a_new_job_in_a_sap_silver_partner_company/",
      "comments": []
    },
    {
      "title": "Lowball Power Platform Offer vs. Unemployment &amp; Upskilling – What Would You Do?",
      "body": "I’m at a career crossroads and could really use some outside perspective. I was recently laid off from a Big Tech company due to a mass layoff, and I’ve been using my severance to figure out my next steps. I have a few months of financial runway, but now I have an offer that I’m unsure about.\n\nMy Background &amp; Career Goals\n\nFor the past 3.5 years, I worked in validation, mostly monitoring, reporting bugs, chasing developers, tracking regressions, and managing configurations. I worked with a large CI/CD system, but my role didn’t involve much coding. Since I primarily used internal tools, I don’t have a strong QA tech stack that’s useful on the job market.\n\nIn the three months since I started job hunting, I’ve had around six interviews, and I have two more lined up for tomorrow and the day after, so I would say not bad. \n\nMy plan after the layoff was to pivot into Embedded software, since I enjoyed working with hardware/software while building a robot for my master’s thesis. But I’m still figuring things out—I like tech but don’t know where I truly fit. I’ve also considered RPA and Low-Code automation, since I enjoy workflow optimization and coordination more than pure coding.\n\nThe Job Offer &amp; My Concerns\n\nI got an offer for a Product &amp; Software Specialist role focused 70% on system integrations (mostly Power Platform, but also migrating from SAP) and 30% on user support. There’s also quarterly travel within Europe to learn how employees use the systems and eventually train them.\n\nThe company liked me a lot during the interviews, and I got great feedback on my soft skills. However, the salary is 30% lower than my last job and 20% lower than my expectations. It’s enough to cover my expenses, but it’s far from exciting. The benefits (healthcare, sports card) are standard, and compared to Big Tech, this feels like a downgrade. Btw, the company isn’t tech—it specializes in utility metering services.\n\nWhat bothers me most is that they completely ignored my salary expectations. I was asked about it in the application form and again by the site manager during the first interview. At no point did they say my ask was too high or that the budget was tight. Then, out of nowhere, I got an offer directly from the CEO (who I never even spoke to), without anyone I talked to in CC, for 20% less than the minimum I told them two times and 30% less than my previous job, and it was just a copy-paste of what they probably give every new hire. \nI doubt they’ll negotiate, and they’ll probably just keep looking for someone else if I decline.\n\nDuring my technical interview with the Product Manager, I was told that there’s no real onboarding—they expect 3-6 months of self-learning since there’s no one to train me. I was fine with that at the time, but if I’m getting a junior-level salary, I’d expect growth opportunities in return. Reviews suggest that raises are tiny or nonexistent, and career growth is slow, which makes the low pay even harder to accept. \n\nMy Dilemma\n\nI could take the job, stay for 6 months to learn Power Platform, and then move to a better-paying role elsewhere. \nBut I worry that once I start working full-time, I won’t have energy for job hunting or upskilling as the role is mostly on site with optional WFH. They said 3 weeks on site, 1 week WFH. I'll try to negotiate that as well if they can't do anything with the salary.\nOn the other hand, staying unemployed lets me focus on improving my coding skills (which are currently my weak point in tech interviews) and finding a better long-term fit, but I might end up with nothing.\n\nI like the idea of trying Power Platform, and after talking to the team lead, I feel like I’d enjoy working with them. But the low pay, lack of growth, and the way they handled the offer make me hesitate.\n\nI need to decide on the offer by March 24.\n\nWould you take the job for short-term learning, or keep searching while upskilling?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1jfas72/lowball_power_platform_offer_vs_unemployment/",
      "comments": [
        {
          "body": "You don't need to be unemployed to upskill :) Just take the job and keep looking for better while upskilling from your job + study during free tine",
          "score": 18
        },
        {
          "body": "Take the power platform offer and look for something else. Having income coming in will make it easier to search and reduce the panic of where your rent comes from.",
          "score": 7
        },
        {
          "body": "Take it migrations to and from SAP pay very well just fyi... its all contract work but the pay is insane.",
          "score": 2
        },
        {
          "body": "take the job, keep it off your resume and LinkedIn and keep applying. Jump ship if you get something better.",
          "score": 2
        },
        {
          "body": "In this economy? Take the job and upskill in spare time.",
          "score": 2
        }
      ]
    },
    {
      "title": "What can I expect from a coop developer interview at SAP?",
      "body": "I have one work placement at a smaller north american business software company under my belt already (with a letter of recommendation that I submitted to them along with my other documents). \n\nother than that it is just my personal projects and my github account that I put on my resume. \n\nwhat can I expect?  what are the major differences between a SAP interview and smaller company interviews?  does anyone here have any direct experience with SAP that they would be able to share?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/28qche/what_can_i_expect_from_a_coop_developer_interview/",
      "comments": []
    },
    {
      "title": "Overseas opportunities for junior SAP ABAP/Fiori dev",
      "body": "Hi, i’m aspiring to work abroad to improve my overall life. \n\nWhat are the chances that a junior SAP developer or technical consultant with almost 4 yoe gets hired in EU or US without any working visa? \n\nHow tough are the technical questions? I have passed multiple technical interviews here in the Philippines but mostly they are just questions about transaction codes, how basic things are done.\n\nAny success stories?\n\n\n",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1obbhz9/overseas_opportunities_for_junior_sap_abapfiori/",
      "comments": []
    },
    {
      "title": "Highly dissatisfied in the current job. Should I quit? ",
      "body": "I am working in SAP ABAP language. Placements sucked so had to take it even though I am skilled in python and even interened as ML researcher and python dev.\n\nIt's been 3 months of training and finally we have been on boarded onto the project. The CTC is average 5.25 lpa.\n\nI am not dissatisfied with package but the work itself. They work on their own language ABAP and SAP GUI. Also most of the work is just support work. Work hours are 10-11. \n\nIt's really depressing and I am not able to even learn more of ABAP. The whole platform sucks for me and absolutely know for sure that I don't wanna do this all my life.\n\nAlso, according to the seniors in this company once I complete a year or two, I'd be stuck to SAP roles only as my skillset would be in that.\n\nSo I'm confused what to do. I have a master's offer in management information systems USA (something that I wanna do). And I can join next year. \n\nBut the thing is that I'm afraid what if my resume gets tied to SAP after a year of work experience and even after master's I get such role only.\n\nI actually want to get into business analyst, or data analytics roles. Or try for business consultation roles after my MS.\n\n\nShould I leave this and try for some other job that would actually be relevant to what I wanna do? Even if I don't get one due to bad market.... I'd have a gap of 12 months ...\n\nRight now I'm not able to prepare for interviews as the work is too much and I don't even get time on weekends as they even give work on weekend. Also the tech is shit and I can't concentrate on anything to learn.... I'm having a burnout.\n\nWhat do do? Please talk some sense into me. Thanks!!\n\nEdit :- gap would be 12 months. ",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1dy5dgh/highly_dissatisfied_in_the_current_job_should_i/",
      "comments": [
        {
          "body": "It's really difficult to focus on work and apply to jobs. I get it.   \nIf you can financially afford to leave before starting your masters, I'd say go for it. You can use that extra time to explore more facets of your own life, find an internship or part-time project that interests you, and apply to roles that you actually are interested in.",
          "score": 2
        },
        {
          "body": "I'm on the same boat with hating my current job too and been applying to new jobs ever since. \n\nDon't quit! Work on personal projects and apply to new jobs. Until you get a new job, don't quit current job. Just do the best as you can without going overboard.",
          "score": 1
        },
        {
          "body": "It sounds like you’re really unhappy with your current role, so if you have the opportunity to pursue something more aligned with your interests, like the master's program, it might be worth considering a change to avoid long-term dissatisfaction and burnout.",
          "score": 1
        },
        {
          "body": "It is easier to find a job if you have one. And it also means your resume is gaining experience instead of a gap. \n\nThe opposite side is it is really hard to job hunt while working a full time job. It also sounds like they are overloading you with work. I would be firm about your boundaries and stop working on the weekends and also not work 10-11... maybe try 10-6 or 10-7.  Use the extra time to apply for jobs. You don't want to be there anyway, so if they fire you for not working 13 hour days then... I guess that makes your choice for you.",
          "score": 1
        }
      ]
    },
    {
      "title": "What should I expect from a job with this really long list of requirements.",
      "body": "I want to be prepared and I do know a good chunk of these. Was hoping if any of yall had seen a role similar to this one and could offer insight on the best way to prepare for an interview for this kind of role and if any of yall had worked at a job with such a diverse tech stacks. The role is for application engineer. Here are the required technologies of the job:\n\n* Agile SDLC\n* Electronic Data Transfer (EDT)\n* Section 508\n* Atlassian suite (Bitbucket, Confluence, Jira)\n* User Acceptance Testing (UAT)\n* Symfony (for PHP)\n* J2EE\n* Struts\n* Hibernate\n* SAP Business Objects\n* SAP 360 Suite\n* Oracle 12c\n* WebLogic\n* Apache\n* Tomcat\n* Qlik Sense\n* Informatica\n* Xcelsius\n* Crystal Reports\n* User Validation Testing (UVT)\n* PL/SQL\n* PostgreSQL databases\n* WebLogic SQL\n* PHP\n* XML\n* jQuery\n* Java\n* Django (for Python)\n* RHEL7 (Red Hat Enterprise Linux)\n* Oracle databases\n* APIs\n* HTML\n* CSS\n* JavaScript\n* Python\n* JSON\n\nHere are the known tasks: \n\n* working with business and technical users developing logical designs, user stories and technical documents.\n* working with federal or state IT projects with a focus on applying federal or state environmental statuses and enforcement policies.\n* training and outreach\n* User Support\n* Research and Development\n* Data Analysis\n\n\nSorry if this seems vague. The recruiter also unfortunately had a surface level of knowledge of what I'd be doing day to day in the job that's no more verbose than the information above. \n\nAt any rate, being an application engineer already for a different company, I've been exposed to enough of these to get by well enough. However, I want to be as prepared as I can for this interview Monday 8/19/2024 but not sure how to best prep. I've been exposed or know 75% of these technologies, which is also what I told the recruiter.\n\n He did give me one piece of advice though: If I don't know something say I know it and have a story prepared. Thought that was interesting..\n\nFrom what I gathered based on the tech list, it sounds like they're working on transitioning code from a PHP server stack to a Django stack. I could be wrong though, was looking for any other insight out there on what I might expect given this tech stack. \n\nI appreciate the help. ✌",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ev1rat/what_should_i_expect_from_a_job_with_this_really/",
      "comments": [
        {
          "body": "Sounds like a contracting company throwing a wide net.",
          "score": 2
        },
        {
          "body": "It sounds like this company is in the midst of a major tech overhaul! The sheer range of technologies listed, from ancient (looking at you, Struts!) to modern, suggests they might be trying to modernize their systems. Don't sweat trying to cram in knowledge of every single item on that list. Instead, focus on your ability to learn quickly and your experience with similar technologies. As for the recruiter's advice, it's a bit iffy. It's one thing to have a story about how you learned something similar quickly, but outright lying is risky. Focus on your genuine strengths, and maybe use something like [interviews.chat](http://interviews.chat) to help navigate those tricky \"have you ever used X\" questions. I'm part of the team that built it, and we designed it to help people like you present their skills in the best possible light.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Is forecasting model development a promising career path? ( I am trying to escape the SAP world)",
      "body": "I (30/M) am working as an SAP developer for years now. Mainly developing in ABAP, but worked with SQL as well a lot. I do not really like it, and I think I made a bad career decision back then when they offered me this job.\n\nI do not like SAP at all, trying to leave this world, but it is quite challenging. Even tho, I can code in Python, java, javascript etc not many employees called me for an interview because of my lack of work experience in these fields. I could mostly apply for jobs within the SAP stack.\n\nHowever I was called to an interview now for a Financial Model Developer position, which requires mostly Python. It is at an investment banking firm.\n\nI looked into this field, they are developing loss/balance sheet forecasting models (using CCAR). I am quite new to this field and will do my best at the interview, but I am asking your opinion about it.\n\nIs it a promising career path? If I would stay with Sap I could become a freelancer easily and making good money, but unfortunately I dont like it (like the coding part tho).\n\nNot sure if a model developer can have a similar career path. Or only the corporate ladder?",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/1e70rf1/is_forecasting_model_development_a_promising/",
      "comments": [
        {
          "body": "Financial modeling can be a promising path with opportunities in various industries. It often involves using programming skills, like Python, which you already have experience with. You can certainly grow within an organization or even explore freelance consulting down the line, similar to SAP development. Landing this role could be a great way to leverage your technical skills in a new environment. By the way, I built a tool called [interviews.chat](http://interviews.chat) that helps people ace their interviews, and I think it could be really helpful for you as you navigate these new waters. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "What is potential manager asking?",
      "body": "Hi all, I am a Jr SWE and I have been working for 7 months now. Work in a WITCH company that is currently sponsoring my part-time degree. And recently, I got looked at by another team and the project manager that are bringing me into the team kept asking for my experience, but I am absolutely lost on how to answer.\n\nWe had a minor “interview” where he started asking me what I had developed especially in Angular which I only had 2 weeks of experience with. The rest was with SAP and totally unrelated to coding.\n\nSo I explained what I had developed.\n\n- A communication module for setting up appointment between 2 user.\n- Set up the communication between our DB and Node.\n- Setting up the DB Schema based on our user story at that time\n\nThese were all the things that I could remember as the last time I was involved in this angular project was 4 months ago.\n\nThen the manager started asking exactly what technical stuff I did. \n\nSo I got confused and started focusing on the communication module as I assume the other 2 was a more straightforward technical wise. \n\nI explained that when a user logs in and goes to his appointment page, it would display all of his appointments for that day. That’s the high level POV. \n\nBut on the low level side, I used the users ID as the identifier to get all of the data back from the DB. The data would get CRUD back to the model -&gt; controller -&gt; route -&gt; express -&gt; frontend Angular typescript file and I manipulate the data accordingly.\n\nThis was the short version as I explained a similar logic for people booking appointments as well.\n\nThen he started getting visibly frustrated and said “ugh no! [my name], what I want to know was what you have developed, what exactly have you developed?”\n\nAt this point I was lost and extremely confused and tried to explain it and ask exactly what type of answer he wants, but he kept asking the same thing, which was “what have you developed?”\n\nNearing the end of the interview, he just said “ugh nvm let’s talk about what you have done during the past few month”\n\nI explained that I was in a no coding project, lvl2 maintenance, and the call ended thereafter.\n\nSo it kept replaying in my head, what kind of answer was I expected to give?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1bxa8jo/what_is_potential_manager_asking/",
      "comments": [
        {
          "body": "&amp;#x200B;\n\n&gt;I explained that when a user logs in and goes to his appointment page, it would display all of his appointments for that day. That’s the high level POV.\n\nThis just explains why the task was important.\n\n&amp;#x200B;\n\n&gt;But on the low level side, I used the users ID as the identifier to get all of the data back from the DB. The data would get CRUD back to the model -&gt; controller -&gt; route -&gt; express -&gt; frontend Angular typescript file and I manipulate the data accordingly.\n\nThis explains how you implemented the feature.\n\n&amp;#x200B;\n\n&gt;At this point I was lost and extremely confused and tried to explain it and ask exactly what type of answer he wants, but he kept asking the same thing, which was “what have you developed?”\n\nThink of a tree cutting service.\n\nThey want to know if you were the guy the climbed the tree with a harness, tie off limps, and cut them with a chain saw or if you where the guy on the ground guiding the cut limbs down to the ground over the radio.   Maybe you were the guy running the crane who's job was to lower the limbs to the ground safely.\n\nThe manager wants to know What you personally did on the project, not When, Where, Why or How you did it.",
          "score": 3
        },
        {
          "body": "He seems like a bad communicator. You need to ask him for an example of an answer he is looking for next time this happens",
          "score": 2
        }
      ]
    },
    {
      "title": "What am I lacking?",
      "body": "I graduated from a MS in CS program back in December with a great GPA (which I know most employers don't care too much about) from a reputable university and interned at a major software company, SAP, for 6 months during it. I know that my struggle in getting an interview is not unique, but I still constantly ask myself \"What is wrong with me?\". I thought I would at least get more invitations to do assessments, but out of the 400+ jobs I've applied for since December, I've only been invited to do an assessment twice and wasn't invited to do an interview after. \n\nI've had friends who are high up or are software engineers in various tech companies refer me to open positions, but it hasn't helped at all; however, I know that I'm not the only one doing that either. I've been trying to work on side projects and do additional certification courses while I wait to help buff up my resume more, but with so many unemployed new grads and experienced professionals on the job market, the competition is expectedly fierce. \n\nTo add more details of my previous experiences, my BA was in International Business and I worked around in various business-related positions in accounting and real estate, but after not enjoying and not fitting into any of the different positions I was in, I decided to apply to a MS program that was for people wanted to change their career path and ended up really enjoying software development. \n\nI wonder then, is my lack of a CS background part of the reason why my value as an applicant so low (along with the current state of the job market)? It's really frustrating that practically all companies have a policy against sharing feedback to applicants because it deprives us from knowing what could be done to be more attractive as an applicant.\n\nEDIT: Formatting my post for better readability",
      "subreddit": "cscareerquestions",
      "score": 15,
      "url": "https://reddit.com/r/cscareerquestions/comments/179b5xe/what_am_i_lacking/",
      "comments": [
        {
          "body": "You are lacking a good job market to sell your skills into.\n\nIt’s like you are selling coconuts and people have been gorging on coconuts and throwing up because they’ve eaten so many coconuts.  No matter how sweet your product is, there are very few people right now who want to eat coconuts and, of those who do, they are overwhelmed with people trying to sell them coconuts.\n\nThat doesn’t mean it’s hopeless but any success right now is due to luck and persistence rather than getting something that you are lacking.  It’ll take a while for demand to slowly increase and to work through the oversupply.  Keep applying, still.",
          "score": 49
        },
        {
          "body": "Have you had your resume professionally prepared?",
          "score": 2
        },
        {
          "body": "You very much answered your own question. You lack work experience in the field. It sucks but it's the way it goes. \n\nYou need to start at the very bottom and understand that the vast majority of companies couldn't care less about your degree or education.\n\nThey just need a track record that you can do this job.",
          "score": 2
        },
        {
          "body": "If you're not getting OAs, it's an issue with your resume. It might be the lack of cs background, or it might be that you need visa sponsorship, or it could be your resume being unparseable. Anonymize your resume and post it here for review.",
          "score": 3
        },
        {
          "body": "Here's a linked to my resume (personal info redacted): [https://imgur.com/a/RxWzV5a](https://imgur.com/a/RxWzV5a) . Sorry again for my initial decision to post the resume's text in a comment. Please feel free to make any constructive criticisms. My resume has gone through many iterations and I know it definitely needs work, but sometimes the obvious stuff is hard to see without an unbiased eye.",
          "score": 1
        }
      ]
    },
    {
      "title": "Internship prep question ",
      "body": "Hey guys, I got an interview for SWE_genAI student internship and I wanted to ask what kind of questions are expected in the interview.  Their website says  it’s focused on improving CI/CD for SAP BTP HANA, including integrating large language models. What questions should I expect? It’s my first ever internship interview and I’m not sure what to expect. \n\nThank you!",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/1g1xnye/internship_prep_question/",
      "comments": [
        {
          "body": "Know your frameworks and LLMs. The most popular ones are GPT, Claude, Gemini and LLama. Learn how to make LLM applications, processes behind RAG and agentic workflow, popular frameworks such as Langchain, Llamaindex, Autogen, etc. \n\nSometimes they'd ask you questions about how you're integrating genAI in your own workspace, so try to stand out with your answers so instead of saying \"I use ChatGPT\", say \"I use Sonnet 3.5 with artifacts\" or \"I use Aider chat\"\n\nAlso because it's a field that moves really fast, they sometimes require to be up to date with the latest news. So you could be talking about Realtime API that got released 2 weeks ago or Opus 3.5 getting released soon. \n\nAs for technical rounds, I've had 2 cases where it was completely skipped. One time where they had asked me to build something on site with their shitty internal fine-tuned version of LLama3 and internet access to some websites, and another time with the typical leetcode bs. For the few times when I had a technical round, I found out that the interviewers had little to no experience about LLMs. But for an internship position you should expect a technical round. \n\nAlso no need to know anything about transformers and other diffusion models, this position is not about building LLMs.",
          "score": 2
        }
      ]
    },
    {
      "title": "Seeking Career Advice for Transition into Security Operations (SOC/Blue Teaming)",
      "body": "I wanted to reach out for some advice regarding my career, both in terms of the process I'm following and the emotional challenges I'm facing.\n\n**Quick Background**:\n\n* **Experience**: Nearly 5 years in SAP Security (4.5 years) and GRC Security (6 months).\n* **Current Situation**: I’ve been laid off from my last two roles due to organizational impacts. This experience has led me to realise that I want to transition into Security Operations and Blue Teaming, and build my career in that domain.\n* **Certifications**: I currently hold CISSP, CCSP, and Python certifications, but I've noticed that these don’t seem to carry the weight I expected, especially here in India.\n\n**Current Skillsets**:\n\n* Familiar with Splunk SIEM and proficient in Python scripting.\n* Decent understanding of Threat Assessments, MITRE ATT&amp;CK framework, and static analysis, Network security but lack hands-on experience.\n\n**Current Efforts**:\n\n* **Job Hunting**: Actively applying for roles in both GRC and SOC since September, with plans to expand to SAP Security positions if there’s no progress by December.\n* **Skills Development**: Working through TryHackMe modules and learning paths to build foundational SOC skills.\n* **Daily Routine**: Applying to 5-6 jobs daily (9-5), playing badminton for an hour, and dedicating 1-2 hours each night to TryHackMe.\n\n**Challenges and Reflections**:\n\n* **Career Switch Hurdles**: It feels difficult to switch domains after 5 years in SAP/GRC Security, but part of me feels it’s not too late at 27.\n* **Interview Challenges**: I've faced expectations around incident response experience. In one interview, I tried to build a story around phishing incidents but struggled when asked about EDR, particularly because I lack experience with tools like Microsoft Defender. I’m also unsure how to gain hands-on experience with such tools.\n* **HR mindset:** It seems that some recruiters may still associate layoffs with poor performance, which can impact perceptions. How can I effectively address this gap beyond highlighting my commitment to upskilling during this period? Are there additional ways to convey that layoffs were not performance-related?\n* **Interview Outcomes**: In the past 2 months, I’ve had 8 interviews but didn’t progress beyond the first round in any. Feedback indicated I might be overqualified in some cases.\n* **Overwhelmed with TryHackMe**: I’m wondering if I should expand to platforms like LetsDefend or Hack The Box. If so, could you recommend specific modules?\n\n**Questions**:\n\n1. **Is it realistic to switch from GRC/SAP Security to SOC?** Or am I better off returning to SAP Security/GRC and building a career there?\n2. **Improving Efficiency**: What strategies can I use to streamline my job hunting and resume modifying process?\n3. **Additional Resources**: Would investing in LetsDefend or HTB help me progress, and if so, which modules would you recommend?\n\nI would appreciate any guidance or resources you can suggest. This career shift means a lot to me, and I’m eager to hear your insights on making this transition successful.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1gov3mf/seeking_career_advice_for_transition_into/",
      "comments": []
    },
    {
      "title": "Settled for first job out of college, not what I expected",
      "body": "Hi folks,\n\nPrecursor : Live in SD, fresh out of college, zero experience (internships), zero projects, average GPA, got a 5x40 9-5 job\n\nAs soon as I got out of college, I was in the process of doing in-person interviews and luckily landed one (a job) with a defense contractor under the title of being an 'Applications Developer'. Since I wasn't getting any other bites, I took the job.\n\n&amp;#x200B;\n\nHere I am 2 months in and it's not what I expected. There's no development in my role. Most days I'm just sitting in meetings and twiddling my thumbs, while others I have some work to do that isn't programming related. This mostly has to do with SAP data management (basically exporting one table from one DB into importing into another DB). I don't see much upward mobility in my role.\n\n&amp;#x200B;\n\nIt pays $32 an hour, and in SD I feel like I'm suffocating since I'm not learning anything new (that I think is worthwhile) on the job, but it's the only stream of income I've got so I need it to pay rent.\n\n&amp;#x200B;\n\nIn my downtime at work, it doesn't feel right to be trying to study via YouTube / Leetcode / randomly browsing the internet for programming materials that aren't even related to the work I do. When I get home, I usually just want to relax and am too exhausted from the commute (1.5 hrs) to study.\n\nHas anyone been in the same situation and can provide some advice? Thank you in advance.",
      "subreddit": "cscareerquestions",
      "score": 48,
      "url": "https://reddit.com/r/cscareerquestions/comments/d8pu1y/settled_for_first_job_out_of_college_not_what_i/",
      "comments": [
        {
          "body": " You spend 3 hours commuting a day. I suggest moving closer. A short commute is one of the best ways to improve quality of life I've found.",
          "score": 99
        },
        {
          "body": "no ones checking what you do at work as long as it looks like work and you're finishing your tasks. start looking for another job, you're getting complacent.",
          "score": 30
        },
        {
          "body": "If you're unhappy then you should leave (after a reasonable amount of time, and by reasonable, I mean at least 6-12 months).   Spruce up your resume, focus on the grind (either after work or on the weekends), and at the six month mark, begin to search for a new position (while this is just my opinion, I wouldn't cut tail and run before the six month mark).",
          "score": 12
        },
        {
          "body": "That salary isn't too bad, especially for a non-coding job right out of college. Are you in north county commuting to sd? You should google the san diego coaster commuter train. It'll make your commute way easier. There's plenty of commuter rails in SD county you should look into. You can bring a bike on board and the stations are usually close to all the tech down there. Cheaper than gas and you'll get fit for the gaslamp nightlife \n\nAre you sure there won't be coding in the days to come? My first position was very little coding at first too, eventually I got to learn a lot more",
          "score": 8
        },
        {
          "body": "Had me wondering where the hell in South Dakota you found a new grad zero-experience job paying $32/hr *and* a 2.5hr commute in a state with almost no people or traffic. Was gonna say you’d be nuts to leave it because there’s likely nothing else around for 100s of miles.",
          "score": 15
        },
        {
          "body": "honestly, you got that first job. you got the hardest part out of the way. brush up on what you are looking for, and give it at least a year with the company before ditching. you don’t wanna leave too soon.",
          "score": 8
        }
      ]
    },
    {
      "title": "Should I accept a low paying internship offer?",
      "body": "I'm currently in university with *8 months of internship experience*. I've been looking for a job for this Summer 2022, and have done a few interviews with solid companies (some mid-size Vancouver startups, SAP Vancouver), and did an interview at a small startup and received an offer. Nothing stood out to me as amazing about this company, but also no big red flags (at least ones I know of). However, the pay is very low compared to what co-ops with experience make, according to my school co-op program. I don't want to get too specific, but it's actually less than what I made at my first co-op which in itself was pretty average. This is an **8 month internship**, so it really adds up. \n\nIt's getting quite late in the term. I have no other prospects right now and there just aren't many jobs open to apply to(about 5 in the last two weeks). My interview with SAP was 3.5 weeks ago and I never heard back, although I did apply to that position as soon as the job was posted, but I'm not sure if that's hopeless by now. I was rejected after all my other interviews.\n\nI know it's better than nothing, but 8 months is quite some time to commit. I'd also be willing to just take summer classes or just take a break from school/work and try again next fall for internships if I end up striking out.\n\nWhat would you do in this position? Would you accept a low ball offer? Possibly try to negotiate? Risk it and keep applying?",
      "subreddit": "cscareerquestions",
      "score": 23,
      "url": "https://reddit.com/r/cscareerquestions/comments/t71icd/should_i_accept_a_low_paying_internship_offer/",
      "comments": [
        {
          "body": "You should either earn or learn … sometimes you can do both, but most times you get only one.  \n\nIf you are not earning in this job, make sure you are at least learning something.  But it sounds like this job is the least shitty option right now.",
          "score": 31
        },
        {
          "body": "If I had this opportunity and I didn’t take it, I would go back in time and smack myself. \n\nTake it and keep on looking for other internships. Worst comes to worst you will double your current experience.",
          "score": 22
        },
        {
          "body": "Always pick the best opportunity to learn, especially when you're early in your career. If this is the best opportunity right now, do it. The difference in internship pay is really not much",
          "score": 7
        },
        {
          "body": "Yes. Internships are resume builders, don’t worry about pay unless you have a comparable option with better pay",
          "score": 3
        },
        {
          "body": "Do you know anyone at the company? Are any of them on LinkedIn with interesting profiles?\n\nHaving access to good mentorship early in your education and career is easily worth $50k.\n\n\nYou're with them for 8 months. Go in for a couple, see if you're learning anything or if they're just giving you shitwork, evaluate if you can salvage the situation by learning to automate or abstract anything you're doing, and then peace out at 4 months if not. You can use the next 4 months to take other classes, or work on a personal project, or just grind leetcode. \n\n\nYou don't have to lock yourself into longterm goals. Step back every morning and reevaluate what you're doing and why and if it's getting you what you want. Live mindfully.",
          "score": 2
        },
        {
          "body": "While it's nice to have a good salary during an internship, whatever you earn will pale in comparison to what you will earn once you're out of school, with some experience under your belt. \n\nUnless you have some huge financial burden, from an professional development perspective, you want the internship that gives you the biggest opportunity to learn and grow your skills, so you can leverage what you learn during these experience when you talk during your actual job interviews, and si that you have a taste/understanding of what software development in a professional environment. \n\nI think you should take it. Worst comes to worst you can keep looking and bail on the job for the better one if it gets to that point",
          "score": 2
        }
      ]
    },
    {
      "title": "I've become the dinosaur, looking for help",
      "body": "Hey guys,\n\nSorry, didn't know where else to turn. Could use some career / short-term employment advice. I lost my last contract gig when COVID started, and since then, I've been building apps to round out my development experience for not a lot of pay.\n\nAs a quick background, I started programming 25 years ago at a video game startup after a degree in computer engineering, writing game engine and 'AI' gameplay code for the PS2. This was just after the tech crash, so I was doing a lot of odd jobs to get by, like teaching Java at a community college. After a couple years of that, I transitioned to a more bank account friendly career in analytics (ETL/BI) consulting for the following 20 years. All through that period, I knew that my original love of and skills in programming were starting to stagnate, as I was locked into a single vendor (SAP), but the money was good so I kept at it. After my latest gig, the world shut down, so I decided to broaden my portfolio by creating an e-commerce web app, as well as working in the web3 space.\n\nIt's been three years since I've made a livable income. I'm currently living in an EU country where I have the right to be a freelancer, but not be a full-time employee (for another six months or so). My citizenship is still North American, as are all of my professional links. I'm struggling to find a contract or anything to allow me to keep paying my rent without switching to a non-technical industry.\n\nAlthough I know that I'm a great problem solver and proficient at coding, my programming resume doesn't stack up against other devs with career-long experience, and my analytics experience is becoming more and more irrelevant. At this inflection point, I'm not sure whether to update my analytics/data engineering skillset with more modern tools, and then apply for jobs with no practical experience, or to fully lean into the programming track. I've applied for several jobs in the latter category, but it seems my history of analytics project-based work is holding me back from being seriously considered as a candidate. I don't have a history of contributing to open-source projects, and at this point my funds are probably getting a bit too low to consider that as a short-term resume builder.\n\nI've been in touch with recruiters I've previously worked with in the analytics space, who are wondering what I've been doing with my life the last three years. I'm on job search platforms (Andela). I comb through LinkedIn postings often. All of this activity has resulted in very few callbacks or interview activity. The last round of interviews I did was for a technical C-level role at an incubator/startup, which people have suggested is the way to go for me, but in my eyes is laughable because I have so little real software development experience.\n\nI've been feeling hopeless for a while, and I would appreciate any thoughts, tips on development paths I might not have thought of, or other avenues for opportunities. Thanks so much in advance.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/12zcwwn/ive_become_the_dinosaur_looking_for_help/",
      "comments": [
        {
          "body": "&gt;  I'm currently living in an EU country where I have the right to be a freelancer, but not be a full-time employee (for another six months or so). My citizenship is still North American,\n\nI would have to instantly pass on your resume because we don't allow residency in any country other than the US.  Juggling your country's local labor laws and figuring out how to file taxes the right way is a level of pain in the ass that accounting and legal departments won't be willing to deal with.\n\nYou're limiting your search to large international companies that already do business in your country.  That's a small pool.\n\nSounds like you need to decide what is more important to you: a software career, or living in the EU.",
          "score": 6
        }
      ]
    },
    {
      "title": "Interview for Business Systems analyst SAP AP role- interview advice?",
      "body": "I am in talks to interviewing with an electric company for the position of business systems analyst SAP AP role. I have limited knowledge of SAP but currently work as a financial systems analyst for a small locality directly supporting our ERP system. What should I highlight to distinguish myself? This position would be life changing money. I have a lot of transferrable skills that directly relate and would fit well within this position. It will primarily support the SAP AP section.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1ehnp7j/interview_for_business_systems_analyst_sap_ap/",
      "comments": []
    },
    {
      "title": "It's been 3 months at this new job and I don't know what is going on or what I should do...",
      "body": "Soo I am a bit conflicted right now and need some advice.  I apologize if I jump around all over the place as I have been considering writing this up for some time now so I am basically unloading..  Anyways, I graduated with a bachelors in CS end of 2020.  After 3 months I got hired by a pretty well known consulting firm as a software engineer (remote for now), name starts with a T.  Usually at this firm every new hire goes through an initial learning program (usually 4 weeks java and some go through an additional 5 weeks of full stack).  Maybe because I already had this experience I was not put into this program but got assigned straight to an account/client whereas everyone else had to go through account interviews and had some say on what project or tech stack they wanted to work on.\n\nAnyways, I got assigned to an account automatically.  Its been 3 months going on 4 (started march 1st).  I went through about a month of onboarding for the company and the client company which heavily emphasized agile development, scrum.  Throughout this time the project manager was telling me how I would be developing a little bit but mostly I would be fulfilling their business analyst role for the account project.  This seemed off to me so I had multiple talks trying to reconfirm this as I expected a software engineering (junior dev) role but he kept telling me that everyone on the account has to go through business analysis training so that everyone is on the same page...  Anyways after the first month (onboarding), I went through about 5 weeks of developer training on an ITSM cloud platform called ServiceNow along with some random courses on ITIL and Business Analysis but most of the training was ServiceNow development.  This dev training left me very, unfulfilled?  There was barely any programming, just a small amount of scripts in JS.  I guess I am too used to the programming assignments that I went through at university in C++, Java, and C#.\n\nAfter that 5 weeks (about 9-10 weeks since I started) I was told that I would start shadowing one of the senior devs who I would be helping with an integration project from ServiceNow to SAP.  At this point another thing that caught me off guard was a team meeting where on a document everyones roles were listed.  Next to my name was business analyst...  I talked to the project manager again and he said it was a typo and emailed me an updated file that said junior dev...  I guess at this point I should also say, for the first two months I was “allocated” to the project already but it wouldn't show up in the system so I couldn't see it or the role I was assigned.  It took two and a half months, to get allocated while being told: “HR says you were just allocated so give it a day or two to update” and it wouldn't update, then I would go and inform project manager again, he would say he contacted HR and that it would happen shortly.  This happened close to 10 times until I finally saw it in the system.\n\nAnyways, a day or two after that the senior dev got covid and went on 2 week leave.  During this time I basically had nothing to do.  I asked several times if there was stuff I could work on and the project manager assigned me random courses on servicenow machine learning and performance analytics (never dabbled in machine learning or ai before).  I got these done in about 2 days and afterwards I was told that I could just look at side courses or self learn until the senior dev came back.  I decided to review my old course notes at university and stuff regarding data structures and algorithms.  Did that for about a week and the last 2-3 days before the senior dev came back, I'll admit, I goofed off a bit...\n\nNow, senior dev came back from leave around 03-24-21.  She had a lot on her plate, I'll admit, and told me that we would be starting the integration project shortly and told me to brush up on some stuff regarding integrations with servicenow.  Did a small lab assigned by her that week and awaited more details and or work from her but she was busy the entire week so I decided to try to self learn again.  Now for the last week and half I have been getting small half hour tasks every day or two that honestly anybody can do.  I have literally only written one line of code since mid may while being told that the integration project will be starting shortly up until today.  During this free time I have been trying to keep myself busy, learn python, and just self learn in general but this is driving me nuts.  I was barely getting any development experience with this platform (ServiceNow) and for the last 3 weeks it feels like I have done nothing besides go into the system and change up some text for some labels.\n\nI am considering talking to the group in the consulting firm that handles the allocation of associates to accounts but have been informed in the initial onboarding during the first month that you cannot get off an account or switch accounts in the middle of a project without it negatively affecting the associates internal resume.  On top of that, apparently this project I have been assigned to has been in the works for 3+ years and they still expect another 2+ years (according to the senior dev I am shadowing).  Some people I know in the industry recommend that I should stop complaining and stick it out at this company as I am still getting paid, decently, for my first job post graduation without much work/effort but I feel like I am stagnating...  On one hand it would look bad if I were to try to job hope only 3-4 months into my first job but then it would also look bad (imo) if I work here for a year or two and barely get any programming experience...\n\nI don't know what to do and am looking for some professional advice.\n\n&amp;#x200B;\n\n**Update (06/15/21):**\n\n This happened last friday.  sooooo there are two \"managers\" you could say (offshore lead and onsite lead).  I spoke to both regarding my work (through teams chat).  The first one, lets say person A, said that it hasn't been confirmed whether I am on the development or operation team.....  I asked him what the timeline is like and he referred me to the other manager, lets say person B, saying that he should be able to answer.  Said that he hopes it should be by the end of the month and that most likely will be development...  Then I spoke to person B, who I asked what the status was on my development work, the integration project (this is also the guy who was dropping hints that I would be trained in business analysis, showed me a whole roadmap for it at one time, and when I mentioned that thats not what I do, backtracked and said that my role would be in development and that everybody on the account goes through BA training to be on the same page).  He stated that the details of the integration project I am supposed to work on hasn't been published yet and that it should be \"soon\".  Then said that person A would update me on it.  I then mentioned person A referred me to him and I see he saw my teams message but never replied back after that.....",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/nwde11/its_been_3_months_at_this_new_job_and_i_dont_know/",
      "comments": [
        {
          "body": "Honestly, I think your instincts are correct. They may not be super helpful to you right now but if you keep the communication open with you lead and keep yourself busy with relevant stuff at work, you'll be fine. \n\nKeep a time tracker of the things you are doing if it worries you. I would probably feel the same if I was in your shoes, so making a \"daily log\" of your activities can save your ass if the lead decides to point a finger at you.",
          "score": 5
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "Body Shop is the traditional name for your consulting company. \n\nThey will send any warm body that fits the contract specs.  You just happen to fit the client specs, college graduate with CS background to work in IT systems.\n\nThe client company has a budget and wanted warm body to fill the spot.  As long as the client company pays the monthly invoice, the consulting company is happy and you'll work in the role.  \n\nWhat you actually do is immaterial.  All you have to do is show up, work on assigned IT tasks, fill out the time sheet.  Seems like this is more IT support role than Engineering role.\n\nLearn to self learn better, work on side projects, network with people, look over the intranet to see how they operate, and keep interviewing for better roles with higher salary.",
          "score": 2
        }
      ]
    },
    {
      "title": "Daily Chat Thread - May 21, 2017",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).\n",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/6cfb48/daily_chat_thread_may_21_2017/",
      "comments": [
        {
          "body": "How damaging would it be to have my first job after graduating not being a SWE position? It's looking like I'm going to be interning at a biopharmaceutical factory in my town, and I'm also expecting a chance to be a hire-on after the internship. The position is for process improvement, and includes data analysis, cost/benefit analysis, documentation updates, etc. There was also a big emphasis on using Visio and Sharepoint.\n\nAnother thing that should be noted is that in the interview, we discussed actual programming, and the manager mentioned a company wide initiative going on where there may be some work done using Python, but I don't know to what extent.\n\n\nThanks!",
          "score": 1
        },
        {
          "body": "For those who work in defense, what's the best way to get into this industry? How is the interview process like compared to that of Facebook/Google (easier, harder, etc)? \n\n",
          "score": 1
        },
        {
          "body": "Would you say it would be worth my time to do a peripherally related internship over the summer even if it isn't directly related to software engineering? I have an opportunity for a system administration internship at a local company. Would it be better to just work on side projects and study the whole time?",
          "score": 1
        }
      ]
    },
    {
      "title": "SAP FICO Interview Preparation Course | Gaurav Learning Solutions",
      "body": "",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1b3omet/sap_fico_interview_preparation_course_gaurav/",
      "comments": []
    },
    {
      "title": "How has job hunting become HARDER for me with more experience?",
      "body": "I have about 5 years of full time work experience (+1.5 part time). I have experience with SAP, process improvements, and accounting. Two years ago, I had just some accounting and some junior SAP support experience, and was getting interviews left and right when looking for a job. Got hired for a job where I met 60% or so of the requirements.\n\nFast forward to late 2025. I couldn't keep that job so had to leave in June 2025. As an immigrant in the EU, I needed to find something ASAP, so I took on a more entry level, basic interim job in accounts receivable on a 5 month contract, and I started job hunting again in September. Since then, it's been mission impossible. \n\nI gained quite some relevant experience at the previous job, so on paper my CV definitely looks much more interesting than it did in early 2024. But in practice, it was as if I lost experience. On top of that, I gained permanent residence which even made it much easier to hire me. All I managed to get was yet another entry level role in AR. \n\nIt's almost as if my masters degree and the last 3 or so years of experience don't even matter anymore. I'm getting the kind of jobs that I had as my first job with a bachelor's. Even when I get relevant interviews, I'm ultimately rejected for too little experience. ",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/1qau9gs/how_has_job_hunting_become_harder_for_me_with/",
      "comments": [
        {
          "body": "\"Go to school and get a good degree so you can find a decent job!\"\n\n\"Nah, we aint hiring you..You're too good for us. These other applicants are idiots, their output sucks but they'll work for peanuts or a meaningless internship.\"\n\nI don't get it either.",
          "score": 3
        },
        {
          "body": "Considering how cheap employers are, I wonder if it's partly your qualifications have priced you out of some roles/companies.",
          "score": 2
        },
        {
          "body": "Just wait until you’re told you’re overqualified for a job you’re clearly qualified for and want. It’s a gut punch.",
          "score": 2
        },
        {
          "body": "1. ITs a bad job market and likely getting worse\n\n2. You also came out in the best job market in a 30 years. 2021 was an absoute outlier for corporate job markets with many tech companies increasing head counts for 50 percent. So people who got their first corporate job in that market won the lottery and have completely unrealistic expectations for what normal looks like.",
          "score": 1
        }
      ]
    },
    {
      "title": "Forget break ups, have you ever been ghosted by a job during the interviewing process?!",
      "body": "It is extremely disrespectful for prospective employers to just ghost applicants. I’m on round three with this company that has just gone missing in action. After a phone interview, multiple aptitude tests, an in person interview and reaching out to my references for indepth questionnaires, I am feeling pretty put off at the radio silence. This is worse than a break up!!! I keep checking my inbox like a total sap. Send help. ",
      "subreddit": "jobs",
      "score": 19,
      "url": "https://reddit.com/r/jobs/comments/1n8kjxu/forget_break_ups_have_you_ever_been_ghosted_by_a/",
      "comments": [
        {
          "body": "Yikes. Yeah I have been ghosted numerous times for job opportunities. One particular instance was where I applied for a job, went through 4 rounds of interviews, was told by the recruiter that they will be onboarding me after the 4th and final interview. Afterwards, I got ghosted for a month, and only when I sent the 4th followup email, they said that I was not selected for the position, got ghosted again for another month when asking them for feedback, only to be told that the company ended up not hiring anyone for the position.",
          "score": 5
        },
        {
          "body": "Have been on two interviews for the same place, going for number three and showed up. No one was there. No cars, lights are out, etc.  Waited a bit no one came. Emailed them back on the email chain and never heard back. Week later it was on the news. They were raided by the feds the day before. They were doing all sorts of illegal things.  \n  \nAlso on a first in person interview got there and they told me to leave since I did not look like my last name 'fit'. Last name is foreign sounding to many and I am a white US dude. So they thought I lied.",
          "score": 3
        },
        {
          "body": "I was ghosted *by a suicide hotline* during the interview process recently; I even reached out to the specific hiring manager I spoke to with the standard thank you email post-interview…..\n\nNeedless to say, the irony of a suicide hotline choosing silence as the preferred response to a candidate actively reaching out was not lost on me, lol\n\n\nSimilarly, an acquaintance of mine interviewed for a different position, same nonprofit. She is from an Ivy League school, so considerably more qualified than me just based on education alone and also she’s worked for a ton of nonprofits so she just has a lot of experience under her belt. Now, again, she had applied to a different position in a different department, but same organization……and they still ghosted her as well.\n\n\nSome HR departments are just not good, and it’s not a reflection of us as candidates :) absolutely disrespectful to us nevertheless, but sadly it has become the new normal. Try to take care of yourself during this time, I know it is very frustrating.",
          "score": 3
        },
        {
          "body": "A question with fewer responses would have been:  \nHave you NEVER been ghosted on interviews?",
          "score": 2
        },
        {
          "body": "Yeah. I think what's most disgusting is when you've done a hell of a job on a project and they just vanish. It's so disrespectful and unprofessional. How hard is it to send a bullshit no thanks?",
          "score": 2
        },
        {
          "body": "Yup I finished the second one out of 3 interviews. It’s been total silence for a week and I know what that means especially since I never heard back after my interview. Sucks but you have to get used to it",
          "score": 1
        },
        {
          "body": "Submitted an application on a Thursday. Got an email from someone in the HR department the next day asking for open time to speak. Emailed on Saturday and followed up on Thursday. Called the following Monday and still could not get a reply.",
          "score": 1
        },
        {
          "body": "I just got a rejection letter two weeks ago…\n\nSeven months after the interview. \n\nAlso had  round two interview with a school that included meeting one of the vice presidents…then didn’t hear anything for a month and got a tersely worded email saying the school was no longer hiring.",
          "score": 1
        }
      ]
    },
    {
      "title": "Do employers really expect you to know how to use their own software before applying for the job?",
      "body": "Like I can understand MS Office, but there's no way someone's going to understand how to use a very unique software that only that company before they even start the job, right?",
      "subreddit": "jobs",
      "score": 210,
      "url": "https://reddit.com/r/jobs/comments/uztul9/do_employers_really_expect_you_to_know_how_to_use/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "\r  \nRecently, I did a business analytics interview and they grilled me on what specific transaction codes were in SAP, excel macro questions, they asked me what is the vlookup formula, what is a SME what is a UAT lol? Who remembers excel formulas off the top of their head, you usually just input that stuff and follow along with what it says. They also asked about Azure DevOps, Visio, functional specs, and what is the 3 stage signoff process in SAP for SMEs lol. SQL join questions etc. Is it me or is that really extra?\r  \n\r  \nIt made me question whether to even apply for any BA jobs again and to just stick with admin and tech support. I had this senior dev grilling me on SAP questions.\r  \n\r  \nBut, I've also had interviews for sys admin roles where it would be all over the place and they would ask about Oracle XStore POS machiens, what a specific random powershell command does, python data conversions, JAMF, etc. So, for some of these interviews you never know what you will get asked.\n\nSeems crazy they wanted to know actual transaction code numbers and stuff tho like wtf",
          "score": 105
        },
        {
          "body": "The vast majority of employers today run a skeleton crew, and don't have the resources to train- hence why 3-5 years experience became the norm for \"entry level\". They want a drop in part for their business machine, and it doesn't matter if you can learn on the job. We have an abundance of badly managed jobs today that if not for healthcare, I think people would have quit a long time ago.",
          "score": 76
        },
        {
          "body": "Sometimes they do. Quickbooks is a common accounting software. I have a masters in accounting, but they don't teach you fucking quickbooks in the masters program, they teach you how and why things are done/calculated the way they are so that when a software like quickbooks spits out a bad figure because of an input error or outdated business rules we know why and how to fix it. So no I have never used quickbooks, so I guess I have to pay for another fucking course on top of the $40k or so I spent on the degree because clearly I won't be able to figure this shit out on the fly according to many employers. So they'll hire some book keeper with 5 years experience doing what is essentially data entry without understanding it over someone who spent years learning the principles of accounting and why things work the way they do, who also has worked with far more advanced and difficult software for data analysis and automation purposes and can probably become an intermediate quickbooks user in like 2 weeks. Fuck it. I hate job searching.",
          "score": 27
        },
        {
          "body": "Look folks, they ask these godawful questions in part to see how you react.\n\nAnswer directly, \"there are 66,000 ICD codes now, I know the families and how to rapidly look up the necessary code in xyz table feature and apply them in lmn field.\n\nHow Do YOU solve problems and deal with stress.\n\nThen there are the dicks that do not understand the system they are asking about so they ask impossible questions to feel smart and powerful.",
          "score": 11
        },
        {
          "body": "IT is really bad for this. They expect you to know their specific software and have 2+ years experience but each company uses different programs for same thing.",
          "score": 8
        }
      ]
    },
    {
      "title": "In need an unbiased opinion of a mentor, or of someone who had the same experience",
      "body": "After four really tough months, I finally got a job offer! 🎉\n\nCompany A offered me an annual salary higher than what they initially budgeted (mentioned in my first interview) — an 18% increase from my previous role. I also have another ongoing application with Company B, and I should hear back tomorrow. My interview with them went well, feedback has been positive, and I have a good feeling about it.\n\nI honestly need some help weighing the pros and cons of both roles, excluding salary for now.\n\n**Company A**  \nPros:\n\n* Hybrid work (2 days WFH)\n* Modern ERP system (SAP)\n* Less than a 1-hour commute\n\nCons:\n\n* 7-month fixed-term contract (as per the offer)\n* Consideration for contract renewal is only mentioned in the job posting, not in the contract\n\n**Company B**  \nPros:\n\n* Greater process ownership — I’d be the SME for accounting in NL, with other accounting operations in SG and the US\n* Manager seems approachable and supportive (from interview and follow-up emails)\n\nCons:\n\n* Longer commute (1–1.5 hours each way)\n* Older ERP system (Microsoft Great Plains)\n* Only 1 WFH day per week, with main operations teams in different time zones\n\nI’m leaning slightly toward Company B because of potential job security, but I’m genuinely concerned about the outdated ERP system — that was one of the main reasons I left my previous job. The job market is brutal right now, and I want to make a thoughtful decision that balances stability and mental health.\n\nIf I choose Company A, I might be back in job-hunting mode by June. The past four months have been an emotional rollercoaster, mostly negative, but I’m lucky to have the best support from my partner.\n\nI have personal long-term plans, but I don’t want to sacrifice my well-being by making a decision I might regret. I don’t have a mentor, though I’m fortunate to have supportive friends and family — still, I’d really appreciate some brutally honest advice from anyone who’s been in a similar situation.\n\nI have until Monday to sign and return the contract, so I have about five days to think it over. Any thoughts or feedback would mean a lot. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ojhaaj/in_need_an_unbiased_opinion_of_a_mentor_or_of/",
      "comments": []
    },
    {
      "title": "Advice for Tech Stack change",
      "body": "Hi all, I have 3 yoe in an SBC and working on SAP Fiori tool. \n\nI want to switch my job into Java dev role and been preparing dsa, springboot framework and working on personal projects as well.\n\nNeed advice on how to approach the interviews like should fake the experience nd mention having 3 yoe of Java dev experience or should i apply as a fresher? Is there any other thing that i can do to switch stack and keeping the experience aswell?\n\nThanks for reading, really appreciate any advice provided.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1msyfes/advice_for_tech_stack_change/",
      "comments": [
        {
          "body": "It’s interesting how many posts today have had very little prior history",
          "score": 1
        }
      ]
    },
    {
      "title": "Am I the only one who feels like a beggar In this job market?",
      "body": " I graduated in December 2023 with a degree in Information Systems, where I studied Network Security and SAP. I'm even certified by SAP as a *SAP Certified Associate - Business Process Integration with SAP S/4HANA* and by Google in IT Support and I have two letters of recommendations, yet I still don’t have a job.\n\nSince 2023, I’ve done about 11–12 job Interview. In one of them, I made it to the final round, but they decided to give the position to someone who had been working as an intern. At this point, I’ve started to put my major aside and look for jobs outside my field—things like administrative assistant, bank teller, cashier, shelf stocker, and factory labor—but I still haven't had any luck.\n\nI’m incredibly thankful to my parents for continuing to support me. I just finished a call with an HR representative who told me, *\"You don’t have the experience we need, but you have the computer skills, so I will still pass your resume to the hiring manager.\"* The funny thing is, the job only requires a **high school diploma**—and I have a **bachelor’s degree**. and that bank in walmart that I applied to and the hiring manger told me I don't have an office to interview you so instead we did the interview in the dunkin donuts in walmart.\n\nAt this point, I really feel like a beggar, *begging* for a job. I feel so low. All I want is to feel like a human being—even if I’m just a cashier or a factory worker—I want to be able to support my mom instead of the other way around. I want to build a family of my own.\n\nI’ve even considered moving back to my home country to look for a job there, even though the economy is worse compared to the U.S. But I really don’t know what else to do.\n\n**Thank God I don’t have student loans.**",
      "subreddit": "jobs",
      "score": 210,
      "url": "https://reddit.com/r/jobs/comments/1iijnls/am_i_the_only_one_who_feels_like_a_beggar_in_this/",
      "comments": [
        {
          "body": "IT in US is only worth it if youre at the very top. \n\nEveryone else is outsourced to India and other countries. Not worth it.",
          "score": 98
        },
        {
          "body": "No, you’re not. It’s like begging for a chance to work to escape poverty. Most jobs don’t pay enough to survive comfortably. We have to trade our time for money and corporate profits are more important than our living wage. \n\nDon’t let it get you down, it’s not unique to you. It’s a pretty universal feeling. Everyone has to show case their skills and hope for an offer. Without knowing someone who can guarantee you a position , the whole song and dance of interview are the standard. \n\nKeep looking for the job you want and it will come. If you have to get into an industry that you don’t particularly want to be in then just learn as much as you can. No job is permanent.",
          "score": 30
        },
        {
          "body": "Yeah. Because they make me feel like one. “Why did you want to work here”? Umm, the pay is slightly better, and I have bills to pay.\n\nNext time I go to an interview and I feel it isn’t going well, I’m asking “well, how did YOU get this job”?\n\nYes, even mc d’s. 30 minute wait for a crappy pre made expensive burger, you’re obviously in need of some help. Just hire me wtf.",
          "score": 21
        },
        {
          "body": "Back in 09 you could at least get a job stocking shelves...",
          "score": 13
        },
        {
          "body": "Hey, remember that there is 'a shortage' and we need to import 85,000 more H1Bs this year!!!11\n\n...and next year and the year after that... forever.  \n\nHey why not lift the cap while we are at it. Let's import 800,000 - Elon",
          "score": 26
        },
        {
          "body": "I’m also begging for a job pretty much. I have a high school &amp; college degree. No jobs that fit perfectly within my job experience reach out so I restored to random ass jobs regardless of pay. Being over qualified for a position is a thing and also a double edged sword privilege right now. If you’re applying for a cashier position, they probably don’t care if you have a degree because you don’t need that. Requirement is high school degree, so why would they hire someone with a college degree that is *technically* qualified for more opportunities? This isn’t always the case though!!!!\n\nI wish I lived in my parents time where you go into a store and face to face ask for a position with resume in hand. Now a days if you do that it’s, “Go to the career page on our website…” STFU!!!!!!",
          "score": 10
        }
      ]
    },
    {
      "title": "Can anyone (Managers, HR, etc.) with hiring experience help me?",
      "body": "So this is what my CV shows (I left details of certification and companies out for privacy) \n\n**Professional Summary** \n\nBusiness and Financial Analyst with experience in forecasting, business planning, and data driven decision-making. Skilled in transforming complex datasets into actionable insights through Advanced Excel, Power BI, and SQL. Certified in investment strategies (Certificate Name) with a strong foundation in financial modeling, process optimization, and performance analysis across cross-functional teams.\n\n**Professional Experience** \n\nBusiness Planning Analyst\n\nAug 2024 – Aug 2025 - Consolidated and analyzed financial + operational data from multiple business units to support forecasting and strategic planning. - Built and maintained Power BI and Excel dashboards, improving reporting efficiency and giving leadership real-time visibility into KPIs. - Built and managed financial models to support monthly forecasting, budget analysis, and investment performance tracking, directly informing resource allocation decisions. - Automated recurring reporting tasks using Python + Excel, reducing manual workload and increasing reliability of data refreshes.\n\nInternal Control Intern – Nov 2022 – Jul 2024 - Verified data accuracy across departments, ensuring compliance and risk mitigation. - Supported internal audits and process monitoring. - Developed Excel tools for improved tracking and compliance analysis.\n\n**Education** \n\nBachelor’s Degree in Finance\n\n(Certificate Name)\n\n\n\n**Technical &amp; Financial Skills** \n\nAdvanced Excel (Pivot Tables, Power Query, Financial Modeling, DCF, IRR, Scenario Analysis), Power BI, SQL, SAP, Google Sheets, Microsoft Office Suite\n\nLanguages \n\nSpanish: Native | English: Fluent | German: B2 (Intermediate Upper)\n\n\n\nEverything is true, I have been getting interviews but I get rejected in the process. Today I got a rejection email from and HR manager that literally approached me, I did an assesment and passed, I was explained how the process would be an then just this cold rejection message... I've had interviews even with VP's and nothing.\n\nI know the market is bad but I do not seem to find a way out. So **I have 3 questions**.\n\n1. **What should I change?** (It might be too empty, I might need more proyects, idk)\n\n2. **What should I do in the meantime?** (I've been looking for my next role for 4 months and a lot of people say one should do certificates or do projects but I wan't to hear from actual professionals what would be something that would impress you from a candidate that actually would want you to have them in your team).\n\n3. **Should I aim for different career paths?** (I did started to look for Admin or Data Analysis roles and they just don't pay enough for me even to eat. oh and also gto rejected for a lot of them)\n\nThank you for reading also if you have any other advice that could be helpful everything is accepted, even if you roast me.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1pnitid/can_anyone_managers_hr_etc_with_hiring_experience/",
      "comments": [
        {
          "body": "Your experience doesn’t go into enough useful detail. As a hiring manager, I want to know about the impact your work had. The thing I personally find most interesting from your most recent job is the part about the work you did that “directly informed resource allocation decisions.” This is gold. What decisions got made? How did you shape what you did to what the business needed? What decision did you help leaders make? Need more meat on the bones, so to speak.",
          "score": 2
        }
      ]
    },
    {
      "title": "Recommendations on job search",
      "body": "Hey guys,\n\nI have been looking for jobs lately and made hundreds of applications with almost 10 of them ended up in interviews but no official job offer.\n\nI graduated from English Teaching but never pursued a job in academia as I later noticed that this was not a dream for me. I have 10 years of experience in international companies and in positions such as procurement and contracting assistant and specialist (5 yrs), project assistant and manager (3 yrs), and business development manager (2 yrs). In my country, having an advanced level of English is rare but desired by employers. I do also have an IELTS Academic certificate with a score of 8. \n\nMy wife also graduated from English Teaching and worked primarily in administrative positions. She was struggling to land interviews at the beginning but recently she’s been getting quite number of calls even for different positions than her experience. She is in fact starting at an Italian company as a Procurement and SAP Operator in 2 weeks which is great and I am really proud of.\n\nI wonder and ask for your opinions as to why would be the reasons that I’m getting only a few chances in interviews based on my background. I have seen a lot of people on LinkedIn and from my friends that changed careers continuously (from HR to sales, from customer service to banking, etc.). Even though my job history seems to have constant jumps from one to another, they are actually interlinked. Project management and business development are two layers of a program that interconnect the process as a whole for instance.\n\nThanks for your opinions in advance! ",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/1ptnsde/recommendations_on_job_search/",
      "comments": [
        {
          "body": "If you are getting to interviews, so it's not about your resume, but you have to prepare vey well for the interviews, research and watch videos in YouTube, you will descover your missing points, please DM me if you need help.",
          "score": 1
        }
      ]
    },
    {
      "title": "I have been feeling like an impostor for years, and sometimes that feeling is justified",
      "body": "Please take some time to listen because no one I speak with seems to understand my predicament, and I really need help. I am trapped.\n\nI am an Electronics &amp; Telecommunications (EXTC) Engineer by education: I sucked at it and only got by rote learning and because I couldn’t afford to fail. I graduated in 2014. However, I got selected into a campus placement into one of the world’s biggest IT consultancies, simply because there were no EXTC jobs to give out. I also needed the money for family. I was among the cream of the crop only because of my soft skills and extracurriculars. They took us in, trained us for six months on random technologies—I learnt SAP ABAP, while others learnt Java, some others something else—and then put us on equally random projects.\n\nSince that day I have felt like an imposter. I broke out after a couple of years, got into author acquisitions for a popular tech-education publisher, and then decided to give data science a shot.\n\nI got myself into a Masters’ course in Australia about 7 years ago at great financial and personal cost, worked hard to build a set of skills, and managed to get hired into some of the best companies here. I have built a BI / Analytics skill set, thank God. But it feels severely lacking. I’m currently working for the company that has given Excel and Copilot, and honestly I don’t know how I landed this job. I have some skills, but fuck me, I don’t know everything just clicked during interviews.\n\nBut truth be told, I am absolutely lost. I have been overworking myself just to figure out what needs to be done next. I am sitting extra hours because I am inefficient. I don’t even know what I don’t know. I feel that because I did not have formal education in computer science or information technology, I am always lost when it comes to basic concepts. I keep getting into rabbit holes trying to figure out how to solve a technical issue. I don’t understand a lot of discussions among my peers and colleagues.\n\nIs anyone in that boat? Has anyone been there? How did you help yourself?\n\nI have been here for 10 years and I feel it is too late t jump ship.\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ocu22f/i_have_been_feeling_like_an_impostor_for_years/",
      "comments": [
        {
          "body": "Lol I have a slightly similar career path of not having a technical degree and being in tech and I *know* that I am lacking but I also don't really care? \n\nI'm in a fairly cushy job now and honestly riding it out for as long as I can because if I lost it, I know I would really struggle finding something similar in tech\n\nJust reframe it, if you have stayed for so long in the field, you must be doing something right. If you truly didn't belong, you wouldnt have completed a masters and you wouldn't have gotten hired after that masters in a different country",
          "score": 2
        }
      ]
    },
    {
      "title": "Only ever had one job (16 years at same company) — what kind of remote work could I even get?",
      "body": "I’ve been at the same company since 2009 and I’m still working there now. It’s the only job I’ve ever had, and the last interview I did was back then, so I feel way behind on what’s out there.\n\nI started out unloading trucks, then moved into data roles. For the past several years I’ve been working with SAP/EWM, doing things like inventory reconciliation, BOM management, system troubleshooting, and reporting. I’ve also supported SAP go-lives and helped train people at other locations.\n\nWhat I don’t know is: what kinds of jobs should I even be applying for, especially if I want something remote? Are there certain titles or industries where this background makes sense?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1mvjljz/only_ever_had_one_job_16_years_at_same_company/",
      "comments": [
        {
          "body": "\"Remote\" isn't a kind of job, it's a work location. There isn't a special \"remote-only\" job that exists out there. Some companies will hire certain roles remotely, while others will hire hybrid or in-person. All you can do is look for jobs that you feel can match your experience. But be aware that anyone that you do find is going to be very competitive, so be prepared for lots and lots of rejections.",
          "score": 2
        },
        {
          "body": "No company on earth is going to hire a 16 year old for a remote job. You don't have the education, the experience, or the skills. Abandon this idea, you're just going to get scammed.",
          "score": 1
        }
      ]
    },
    {
      "title": "Job offer - how and when to negotiate salary?",
      "body": "\nHi all. I’d love some advice. I’m stuck in a job that is slowly sapping my will to live. Today I got a verbal offer (via phone call) for a role I’m really interested in for an organisation whose mission I feel very aligned with and passionate about. I liked the panel a lot also. Apparently they were very impressed with my interview, application and reference checks.Lovely feedback.\n\nThe top of the salary range advertised was still 8k less than what I earn now. I had planned to try for something closer to my current wage if successful. I was thrown when she told me today the offer is midway through the range advertised. I didn’t want to negotiate then and there over the phone as I didn’t have a written offer. \n\nI spoke with a friend in recruitment who said I should have negotiated then and there, but my soul is so shattered by my current job I was afraid they might rescind the offer if I essentially asked tor 10k above their offer in an attempt to match my current income. \n\nMy question is when and how do I broach this? I don’t want to risk losing the position, but I also feel I need to at least try to get them to match my current pay. \n\nAny advice welcome! Job offer - when and how do I negotiate salary?\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1mhcy3b/job_offer_how_and_when_to_negotiate_salary/",
      "comments": [
        {
          "body": "The time to negotiate is anytime after they make you the initial offer, and before you accept the offer by signing the offer letter. In other words, now is the time to negotiate.\n\n\nIn all likelihood, the best you'll be able to do is the top of the salary range. Asking for 8k more than that will make this company balk. They have been very clear (via the advertised salary range) about what they're willing to pay for this position, and asking for 8k above that will reflect badly on you. I mean, you can try, but I personally think it looks bad. Proceed with caution.",
          "score": 3
        },
        {
          "body": "&gt;My question is when and how do I broach this? I don’t want to risk losing the position, but I also feel I need to at least try to get them to match my current pay.\n\n* Negotiation **always** involves risk.\n* Successful negotiation **always** requires leverage.\n* If you cannot afford to lose an offer/opportunity, then don't attempt to negotiate.\n* Risk doesn't mean guaranteed failure. It just doesn't mean guaranteed success.\n* The amount you can negotiate is dependent on the degree to which you are better than alternative candidates.",
          "score": 1
        },
        {
          "body": "Been there - I literally never had any negotiating power in all my previous roles as I worked in toxic finance cultures and just needed a way out.\n\nBut as long as you're current job is secure, there's nothing wrong in negotiating. Companies don't reject for attempting to negotiate. The recruiter will tell you if its a take-it-or-leave-it or she can \"check and get back with a better number\". But I'd definitely not tell them that its because of the current pay (I've been rejected before for this).",
          "score": 1
        }
      ]
    },
    {
      "title": "Can anyone please help?",
      "body": "5 months of applying every single day, tailoring every cover letter, adjusting every resume, networking, applying to entry-level jobs and internships alike, but I still haven’t been able to land anything. Not a single offer. Not even a second interview.\n\nI’m looking for anything marketing-related: digital marketing, product marketing, social media, CRM, brand or content marketing, even market research. I’ll work in an office, remotely, in Germany, in France, Switzerland, the Netherlands—anywhere. I just want to work, build my independence, and get out of this loop of waiting and hoping.\n\nMy experience includes multiple internships and student jobs supporting marketing teams. I’ve handled content creation, email campaigns, competitor research, customer segmentation, and more. I also have experience with tools like SAP, Canva, Google Analytics, and CRM platforms. I’ve been told my resume is solid, and I’ve added certifications, built a small portfolio, and redone my CV countless times.\n\nBut still… nothing. No real progress. I'm honestly starting to lose faith and feel completely invisible in the job market. I don’t know what I’m doing wrong.\n\nIf anyone here has advice, contacts, or even just a few encouraging words—or if you’re hiring or know someone who is—please reach out. I’m hardworking, passionate, and determined to make this work. I just need a chance.\n\nThank you for reading.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1krlz3s/can_anyone_please_help/",
      "comments": [
        {
          "body": "Everyone is employable, it just takes the right strategy. If you’ve been applying daily for the past five months, I’d seriously consider getting a fresh pair of eyes to review your resume, it could very well be the root cause. Also, consider using alternative strategies, such as applying directly to companies and reaching out to business contacts via platforms like LinkedIn. Be persistent, but I would generally start with the resume to ensure it's on point and effectively selling you.",
          "score": 1
        }
      ]
    },
    {
      "title": "24F, French, fluent in French and English, living in Germany — I've been job hunting for months and I'm desperate. Please help.",
      "body": "\n\nHi everyone,\nI'm writing this because I'm honestly at the end of my rope and I don’t know what else to do.\n\nI’m 24, French, fluent in both French and English, and currently living in Germany. I graduated in January with a Bachelor's degree in International Management and have been actively searching for a job ever since. It’s been almost 5 months of applying every single day, tailoring every cover letter, adjusting every resume, networking, applying to entry-level jobs and internships alike, but I still haven’t been able to land anything. Not a single offer. Not even a second interview.\n\nI’m looking for anything marketing-related: digital marketing, product marketing, SEO/SEM, social media, CRM, brand or content marketing, even market research. I’m not picky. I’ll work in an office, remotely, in Germany, in France, Switzerland, the Netherlands—anywhere. I just want to work, build my independence, and get out of this loop of waiting and hoping.\n\nMy experience includes multiple internships and student jobs supporting marketing teams. I’ve handled content creation, email campaigns, competitor research, customer segmentation, and more. I also have experience with tools like SAP, Canva, Mailchimp, Google Analytics, and some CRM platforms. I’ve been told my resume is solid, and I’ve added certifications (Google Digital Garage, HubSpot, etc.), built a small portfolio, and redone my CV countless times.\n\nBut still… nothing. No real progress. I'm honestly starting to lose faith and feel completely invisible in the job market. I don’t know what I’m doing wrong.\n\nIf anyone here has advice, contacts, or even just a few encouraging words—or if you’re hiring or know someone who is—please reach out. I’m hardworking, passionate, and determined to make this work. I just need a chance.\n\nThank you for reading.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1karzwt/24f_french_fluent_in_french_and_english_living_in/",
      "comments": [
        {
          "body": "you should learn german",
          "score": 1
        }
      ]
    },
    {
      "title": "Can't make it past the interviews",
      "body": "Hi Everyone,\nI have been having a rough period the past 3 months applying for a job. \nFor context, I have graduated in a bachelor's in IT Management here in Germany. I have worked in Academia for a year during my studies, in addition to having done an internship in DBMS (SQL and Python) at my University, and a Bootcamp at SAP. Furthermore I have worked for a year at a Multinational company in the automotive Sector for a year as a product manager. \nFor some reason I have been capable of getting many interviews, phone calls and Online, and i made it to the second round in some of them, but i keep getting rejected after that, even if I answer all the questions properly. I always ask for the minimal salary since i am still in the junior stage, i am also flexible when it comes to mobility, and yet I can't get through. I have been applying for many junior roles in Sales, product management, account management, business development, project management....\nI am really thankful if anyone could give their insight",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1g17op6/cant_make_it_past_the_interviews/",
      "comments": [
        {
          "body": "Can’t give you an insight but just want to say Im in the same position and it’s quite disheartening",
          "score": 2
        },
        {
          "body": "Further, reflection on the interview process may reveal areas of improvement. Similarly, such tools as Final Round AI could provide insights necessary to further develop interview skills and assessment methodologies, which can be very important in finding the right fit.",
          "score": 1
        }
      ]
    },
    {
      "title": "How do I land my first job in analytics out of college",
      "body": "I am a recent college graduate with a degree in Economics and Enterprise Resource Planning and am looking to get my first job in analytics.  I have applied for hundreds of jobs and gotten probably about 15 interviews.  With those 15 interviews I’ve probably gotten to 5-7 final interviews with no job interviews yet.  I feel like I have good projects on my resume (Research paper and SAP Project), but I did not get a chance to intern because of personal events preventing it.  What am I doing wrong/what should I add to make myself a better candidate to land my first job?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ex81v1/how_do_i_land_my_first_job_in_analytics_out_of/",
      "comments": []
    },
    {
      "title": "Need advise in my career because i lost interest in warehousing ",
      "body": "Hi everyone before i start talking about how i feel toward warehousing career i have bachelor degree in Business Administration Major international business and now i doing my masters degree in supply chain management. So when i graduated in 2020 i start working in DB schenker as warehouse administrator so my job is direct contact to customer and traking outbound and inbound by receiving and make orders on SAP but i didnt like the environment at all the people were very toxic and even the people in the head office see the warehouse workers even the people in managerial level in warehouse as people not educated well and yes i agree with them. I have seen very bad days in warehouse i travel from home to the warehouse by my own car i drive for 2 hours 6 days a week 75 km because they dont offer transportation and they didnt give me any allowance very bad experience for me, i left this job start looking logistics job or supply chain but suddenly someone from DHL they called me from LinkedIn he seen my profile and cv i had an interview with country region manger of warehousing he accepted me and now i am working in DHL they are way better he gives me allowance, increased my salary and he offers me transportation all of this makes me happy but there is something i dont like working in warehouse i want to continue in DHL but in supply chain or logistics not warehousing so my point is to start searching for anther opportunity in this field because i dont see any upgrade in my career i work in the same position and far from home so i need some one to help me to take the right decision i am so lost i need help if i continues in warehousing and take it as step and after i finish my masters degree i can go to the headquarters to work in logistics and supply chain. Please i need some support i am so confused. Thanks in advance.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1d2gcrv/need_advise_in_my_career_because_i_lost_interest/",
      "comments": []
    },
    {
      "title": "advice please",
      "body": "I’m in a really bad place at work and it’s taking an extreme toll on my mental health. I have been continuously job searching for the past few months and nothing has been successful. Meanwhile, in my current role, I get paid an extremely low amount, I am expected to do way more work than I originally started 3 years ago along with no title change, bonuses, vacation time etc. My manager denies that I’m being given extra work, but he doesn’t acknowledge half the work I do and I end up having to do most of his shit too. He’s personally micromanaging me now over stupid stuff and is requiring me to come into work daily, which is an hourly commute. I feel so used and want to quit everyday but I feel like I need the income and job in order to get my next job. What would you suggest in this situation?\n\nEdit - i work as a project manager in IT right now, getting my masters in data science and would like to move into the healthcare field on the product end of things. I have no certifications yet but will be testing for safe PMPO cert and open to any other ones. Have some coding knowledge (R, SAP, SPSS, SQL) and interested in analyst roles. I’ve applied to so many positions via LinkedIn - remote and/or selected yes to relocation. Submitted over 300 but have only gotten to initial interview stages for some and rejection emails for most. I re-did my whole resume based on suggestions by my network but still struggling.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/tny3of/advice_please/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Learn to say no. What are they gonna do, fire you?",
          "score": 2
        },
        {
          "body": "we need details if we are going to make suggestions.",
          "score": 1
        },
        {
          "body": "Have you job searched in different areas not just where you live? Consider to move bcs usually in IT you should be able yo find well paying jobs.\n\nSearch indeed and other platforms across your country and see where it takes you! Often they should be remote as well these days!\n\nCheck insurances etc. many different fields need and use IT ppl.",
          "score": 1
        },
        {
          "body": "If you're a project manager do you have any of the PMI certifications? PMP etc. Those would help get out of there and be paid well.",
          "score": 1
        }
      ]
    },
    {
      "title": "Inventory controller Role red flags or rough setup?",
      "body": "I recently interviewed for an Inventory Controller position, and I’m trying to get a read on the situation — would appreciate any input from folks who’ve been in similar roles.\n\nThe manager told me they fired the last person because they couldn’t handle breaking a product down into smaller units in the system. I haven’t done that exact process myself, but I’ve worked with SAP for 2 years, and based on what I know, that task should be pretty manageable — assuming the system is set up right and the person has some guidance.\n\nHere’s where things felt off:\n\t•\tThe manager seemed unprepared during the interview and had to ask me for a copy of my resume.\n\t•\tHe didn’t seem like the type who offers much support — more like “it’s your responsibility now, figure it out.”\n\t•\tThey mentioned the last guy had no SAP experience. I do, so I think I’d be fine technically — but it makes me wonder if the real issue was poor training, bad onboarding, or just too much being dumped on someone too quickly.\n\t•\tThere is an SAP trainer on staff, which is a plus, but I’m not sure how available that person actually is day to day.\n\nDoes this sound like a setup for failure, or just a job where you need to be self-sufficient from the start? I want to make sure I’m not walking into a trap disguised as a “straightforward” role.\n\nWould love to hear what others think — especially if you’ve dealt with similar dynamics.\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1kr82wz/inventory_controller_role_red_flags_or_rough_setup/",
      "comments": []
    },
    {
      "title": "More than 1000 applications, 2 interviews ",
      "body": "I have been applying for AWS Cloud/DevOps roles for last 8 months. I submitted more than 1k applications, and just got 2 interviews.\n\nI have 7 years of experience in AWS cloud, DevOps, python scripting, terraform and more.\n\nI got 3 AWS certifications - 2 professional(SAP and DevOps Engineer) and 1 associate. And also terraform associate certification. \nI live in DFW area. I have been applying onsite roles in commutable distance, and remote positions as well.\n\nWhat’s wrong with the job market nowadays?\nIs it normal? Or am I doing something wrong?\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1e6hd33/more_than_1000_applications_2_interviews/",
      "comments": [
        {
          "body": "If you’re struggling to land interviews then you should consider posting your resume with personal info redacted to /r/resumes. You can get really great advice for free. Sometimes people have great experience but less than great resumes that get tossed before their content is taken in due to certain things.   Highly recommend checking out the subreddit.",
          "score": 1
        },
        {
          "body": "It’s just bad job market, politicians say the market is booming but it’s not. Due to the increases of price of literally everything it’s obviously affecting companies causing less jobs for people.",
          "score": 1
        }
      ]
    },
    {
      "title": "After having graduated May '17 with a degree in history focusing on museums, I have decided to get an office job w/ a defense contractor that is hiring like crazy. How do I promote myself at a job fair and in interviews for entry level jobs that have nothing to do with my degree?",
      "body": "Jobs that this employer post often are: production planner/scheduler, cost estimating analyst, document control analyst, admin generalist, project management analyst etc. These are general office type jobs that only require a 4 year degree. \n\nI know people who are familiar with these positions and they all think I can do them just fine, but I never studied cost estimating in school, I hold a certificate in public history, not SAP or any other software used to do production scheduling...\n\nMy strengths are that I am reliable, loyal, a good writer, friendly and easy to work with etc. I have skills from volunteering at a museum that can loosely translate to these jobs, and I have found people with this title on Linkedin whose resumes are similar to mine with degrees similar to mine. But how will I do in an interview? Are these types of entry level positions ever filled by specialized people who went to school for these kind of thing? \n\nI just really need some context, words of wisdom, tips, or encouragement. I will meet with recruiters at my old college this month at a job fair and really need to leave a mark on them as a month+ of applying on their site and pulling connections hasn't gotten me anywhere. \n\n",
      "subreddit": "jobs",
      "score": 75,
      "url": "https://reddit.com/r/jobs/comments/9gyyka/after_having_graduated_may_17_with_a_degree_in/",
      "comments": [
        {
          "body": "Based on my own personal experience, you probably have to know someone or you probably won't ever get an interview if you don't have any experience or training in the field. There are too many entry level candidates and not enough jobs. Good luck to you.",
          "score": 37
        },
        {
          "body": "History is all about taking in information and presenting it in an understandable way. You have strong research, writing, and analytical skills. Depending on the rest of your degree and experience, you know how to interact with the public or complete a project on a deadline or whatever. \n\nSource: I studied medieval French history and now I work in marketing.",
          "score": 11
        },
        {
          "body": "No matter how complex the job qualification might look like, most entry level office job is structured to teach you regardless of how well you might know the stuff. So don't feel to intimidated. \n\nYour goal here isn't to babble and brag about all the amazing things you know about the job like most of your competitors are probably going to do. Rather, it's to give your recruiter the impression that you will 1.Learn quickly 2. Not screw up alot 3. be humble.\n\nHow do you do that? First, research the company. Look through them see their culture, review glassdoor, company websites. Second, talk about your passion and why you chose your major. Lead off from that and explain why you're wanting to make the career switch while key pointing hard/soft skill.\n\n\"I've always been so fascinated with History because I love identifying trends and analyzing events that eventually led to this other event..etc \"(Cliche but you get the idea)\n\nLast but not least, have fun with it. It's not the end of the world if you don't get this one job as there are hundreds or thousands of open positions that you can explore. Don't forget to smile~",
          "score": 12
        },
        {
          "body": "r/history recently did a thread exactly like this. \n\nFocus on skills brought to the table not degree.",
          "score": 6
        },
        {
          "body": "What if you were to take a piece of paper and draw a line down the center. \n\nOn the left hand side list the skills listed for the job. \nOn the right hand side write the closest skill you used in college. That’s the transferable skill. \n\nYou can learn how to plan/schedule - that’s a tool. \n\nWhen I was looking for work I’d go to the occasional job fair. I’d research (skill) the heck out of a company. \n\nI Googled the company name + news, read their competitor’s news, and connected with hiring managers and decision managers on LinkedIn. At a job fair be memorable and likeable. You’ll be halfway to your next job if you do your homework and are pleasant. \n\nGood luck! Huge fan of museums and history. ",
          "score": 3
        },
        {
          "body": "check which words keep popping up in job ads \"team work\" \"critical thinking\" \"report writing\". then use what you've done in your degree to address those.\n\n&amp;#x200B;\n\nbut use specific examples. \"I am good at communicating\" means nothing without a specific example",
          "score": 3
        }
      ]
    },
    {
      "title": "Is my resume/background all over the place? ",
      "body": "I feel like my background might be all over the place and completely unfocused, and that might explain why after 60 applications I've had literally just one interview. Can someone confirm if that's true or is it just random?\n\nI'm applying for SAP, data, business analyst, financial analyst/consultant, type roles. I make sure I don't fail more than one requirement, and even then my SAP experience or programming knowledge is usually a plus. \n\nAlso accounting roles because I'm desperate even though I don't like accounting. ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1c7iy4k/is_my_resumebackground_all_over_the_place/",
      "comments": [
        {
          "body": "I'm OCD as fuck and notice you have \"finance\" 3 times in your objective statement. \"And and and\" as well which annoys me because it doesn't read like a real sentence. Since you have a career gap i'd dump the specific months and just leave it at years. \n\nProlly dump the activities and volunteering, nobody cares about that for a resume once you are out of college. \n\nYou also have a lot of run-on sentences / sentences with broken or hard to easily discern English. I'd split them up into more bullet points  \n\nIt also doesn't really matter if the job was remote, or part time. I would leave your job details more vague. \"Co Founder - Finance Specialist\" sounds a lot better to me than \"remote part time co founder finance specialist\"\n\nSome of the verbiage is a bit unprofessional sounding as well \"from scratch\" and \"slashed\" etc etc. You could find better sounding ways to get your point across imo",
          "score": 2
        }
      ]
    },
    {
      "title": "𝐂𝐫𝐚𝐜𝐤 𝐚𝐧𝐲 𝐒𝐀𝐏 𝐅𝐈𝐂𝐎 𝐢𝐧𝐭𝐞𝐫𝐯𝐢𝐞𝐰 𝐰𝐢𝐭𝐡 𝐜𝐨𝐧𝐟𝐢𝐝𝐞𝐧𝐜𝐞!",
      "body": "",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1b676cq/𝐂𝐫𝐚𝐜𝐤_𝐚𝐧𝐲_𝐒𝐀𝐏_𝐅𝐈𝐂𝐎_𝐢𝐧𝐭𝐞𝐫𝐯𝐢𝐞𝐰_𝐰𝐢𝐭𝐡_𝐜𝐨𝐧𝐟𝐢𝐝𝐞𝐧𝐜𝐞/",
      "comments": []
    },
    {
      "title": "Interview questions to prepare for as a consultant in SAP PP/QM domain with an exp of 2+ years.",
      "body": "Hello folks! I am an SAP PP/QM consultant with an exp of 2+ years in testing and support background for leading pharmaceutical and chemical industry clients.\n\nPlease can someone give me a list of questions frequently asked in all the interviews regarding my domain? If you can also let me know if there are any openings in some company, I am happy to apply.\n\nAlso need a small suggestion: I am currently earning around 4.3-4.5 LPA, what’s the range of salary I should be expecting from the companies and is it a good thing to ask between 10-12 LPA as fixed?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ospc3e/interview_questions_to_prepare_for_as_a/",
      "comments": []
    },
    {
      "title": "SAP Interview experience",
      "body": "I had my first technical interview on Jan 16 and second one on Jan 27. \nHR called before the second round and confirmed my expected compensation and official notice period.\nShe said there will be 2-3 rounds in total.\n\nIt's been a week since the second round and I followed up yesterday. \nThe portal still says \"In Process\".\nShall I follow up or does it generally take a few weeks?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ihchuu/sap_interview_experience/",
      "comments": [
        {
          "body": "Have you got any updates?",
          "score": 1
        },
        {
          "body": "Have you got the offer ?",
          "score": 1
        }
      ]
    },
    {
      "title": "Can someone here help me out with some SAP PP/QM interview questions for an experienced consultant.",
      "body": "",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/162jg59/can_someone_here_help_me_out_with_some_sap_ppqm/",
      "comments": []
    },
    {
      "title": "Interview Questions for SAP Product Support Associate--Manufacturing",
      "body": "Does anyone know what interview questions are asked for the SAP Product Support Associate--Manufacturing position? Specifically java questions.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/52etvd/interview_questions_for_sap_product_support/",
      "comments": []
    },
    {
      "title": "I have a technical interview for a position which idk anything about (?)",
      "body": "soo a short backstory, i’m a fresh CS graduate and i applied for a SAP associate consultant position EVEN though i literally don’t meet any of the criteria that they’re looking for i was just applying to whatever job that needs a cs graduates @__@\n\nanyway they contacted me and asked me to reply to an email in which i answered to all the questions with NO because all of them rule related and IDK anything about it and guess what ? they interviewed me after my email AND they scheduled me for the technical interview on Sunday @__@“\n\nso my question is, will the interview be about ERP Systems and aboutthe rule i’m applying for ? or like general code core based questions ? please share your thoughts and suggestions ^^\n\nnote : it’s my very first technical interview i’m nervous.",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1pk44qz/i_have_a_technical_interview_for_a_position_which/",
      "comments": [
        {
          "body": "Congrats on landing the interview! For SAP consultancy roles, the focus might be on ERP systems understanding, business process integration, and maybe some specific SAP modules. Since it's your first interview, brush up on basic SAP concepts, the role-specific duties, and some general CS topics. Regardless, expect behavioral questions too - prep with the STAR method. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "No further response after saying they'd like to hire me",
      "body": "I interviewed with a Big 4 firm for a consultant role almost 2 weeks ago, with the interview set up by a recruitment company. It was on a Thursday, with a partner and director, and the following Monday (so 8 days ago) the director confirmed to the recruiter that they'd like to hire me and it's positive. They just \"need to sort out some stuff internally\" like the budgets. The recruiter assured me that it's just a formality and even sent me an offer to sign.\n\nOver a week later I've heard nothing at all. I was supposed to start on 1st November so there are several weeks to go, but this is also taking an awfully long time. I wonder if there's a chance that they changed their mind or there was some unexpected budget hiccup. ",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1ncgjoy/no_further_response_after_saying_theyd_like_to/",
      "comments": [
        {
          "body": "Sometimes it just takes longer than we expect. It was longer than eight days for both of my last two jobs. \n\nDon’t lose hope.",
          "score": 4
        },
        {
          "body": "HR moves at their own pace, regardless of what the hiring manager wants. I affectionately refer to one of hires as my \"Christmas hire.\" even though they were hired in July. Once time someone asked, \"Why do you call her your Christmas hire?\"\n\n\"Because she was 'supposed' to be onboarded in November. But HR didn't get off their ass until half a year later.\"",
          "score": 3
        },
        {
          "body": "Did you interview for a role already on a team? I interviewed right before lock down in March 2020 and they wanted to move forward but *obviously* the wheels fell off but they dragged it out through April trying to staff me before I started. Then I re-interviewed in October 2020 for a staffed role. Sometimes if you interview during *these times* they try to place you directly on a team so it takes longer",
          "score": 3
        },
        {
          "body": "really noone can tell you for sure what other people are thinking --  if they said you're hired I would check in regularly\n\n\ni can tell you one time i had a difficult time starting (and it really impacted the relationship as the team blamed me i think)  \n\n\nbecause the recruiter disappeared when his wife went into labor early\n\n\nHe received notice to select me and told me that, but didn't get me the start date before he has to focus on his wife, and people thought i no-showed",
          "score": 1
        }
      ]
    },
    {
      "title": "Why am I not getting interview calls in the Bay Area despite solid experience?",
      "body": "Hi everyone,\n\nI’m hoping to get some perspective here. I’ve been applying to roles in the Bay Area for quite some time but haven’t been getting interview calls, and I’m honestly puzzled.\n\nHere’s a bit about my background:\n\t•\tOver a decade of experience as a Quality Engineer and Technical Program Manager in consumer electronics (including 10 years at Apple).\n\t•\tExpertise in manufacturing engineering, NPI, product quality management, failure analysis, and post-sale service.\n\t•\tHands-on with tools like SAP, JMP, Agile PLM, GCRM, Excel, and more.\n\t•\tI also have experience in government research, UN projects, and running my own consulting business.\n\t•\tMaster’s degree + ASQ Certified Six Sigma Black Belt.\n\nI’ve applied to many relevant positions (Program Manager, Operations Quality, NPI/Manufacturing roles) but haven’t even reached the interview stage. I recently did 5 interviews for a Product Program Manager role at Apple Cupertino but wasn’t selected.\n\nI can’t figure out what’s holding me back. Is it my resume? My background being too broad? My career gap after leaving Apple? Something else?\n\nHas anyone here faced a similar situation or have tips for breaking into Bay Area tech roles again? I’d really appreciate any advice on how to improve my chances.\n\nThanks in advance!\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nsg8tw/why_am_i_not_getting_interview_calls_in_the_bay/",
      "comments": [
        {
          "body": "Connect with an acquaintance at these companies and get them to refer you to the hiring manager.",
          "score": 1
        },
        {
          "body": "No one can tell you it’s your resume if you don’t show us your resume.  It could be your resume.  It could be your cover letter.  It could be you’re applying to fake jobs.   Are you currently in the Bay Area?- no one wants to deal with relocating someone right now.  It could be you’re overqualified for what you’re applying to-?  Companies assume you are- you’ll ask for too much money, and be bored and leave the minute something new turns up. It could be you’re blacklisted in the industry in that area?",
          "score": 1
        },
        {
          "body": "Why did you quit apple and not stay while lining up another job?",
          "score": 1
        }
      ]
    },
    {
      "title": "Weird passive aggressive interview",
      "body": "Hey guys\n\nSo i gave a interview a week back. It felt weirdly passive aggressive. So i am into SAP consulting. This manager asked me a question which i answered correctly. The question he asked is about a topic in SAP which i have done 100s of time. Yet this person kept telling me he doesnt think, I have any knowledge on this and that i have not done this activiry at all. It got to a point where i had to tell him that i dont agree with with what he is saying. If he wants he can go back and check. He seemed to be a little more chill after that. He wants a round 2 with more panelists involved. I dont know if i should do it. \nI am very sceptical. Just didnt feel normal. \n\nSorry for the rant. Just had to let it out. ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1oozjnz/weird_passive_aggressive_interview/",
      "comments": [
        {
          "body": "Oof, that's tricky. Sometimes interviewers test resilience by being tough – you handled it well by standing your ground. If you decide on round 2, prep for a mix of technical and soft skills to showcase your full range and maybe anticipate some stress-testing questions. If you're really not comfortable, trust your gut, but if this place could be a good fit otherwise, maybe go for it and see how it pans out.",
          "score": 2
        }
      ]
    },
    {
      "title": "Interview for accounts payable role, i have no direct experience",
      "body": "I have an interview for an accounts payable job tomorrow. I absolutely *must* get this job because I'm in a foreign country and going to be unemployed and this is my last real shot at a job before time runs out. The job is being offered through an agency that first vetted my profile and selected me out of four others.\n\nHowever, my experience is in accounts receivable/order to cash and some backend SAP support for the finance and accounts team. I have a baseline knowledge of how the AP and purchase to pay process works. On SAP, I have handled creating vendor and payment master data, executing payment runs, and posting manual invoices – but again in a support role.\n\nWhat can I do to maximise my chances tomorrow? What do I need to learn/keep in mind? Anyone with AP experience who can weigh in, I would appreciate it a lot. Especially if you've also worked with receivables and can explain how the skills translate to AP.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1op4fqt/interview_for_accounts_payable_role_i_have_no/",
      "comments": [
        {
          "body": "You've got relevant experience to leverage. Emphasize your SAP proficiency and how it allows for a smooth transition to AP. Highlight transferable skills like attention to detail and thoroughness from AR. Brush up on key AP processes tonight—focus on three-way match and handling vendor payments. Showcase your adaptability and readiness to learn! Good luck.",
          "score": 2
        }
      ]
    },
    {
      "title": "I need some advice for my first job interview",
      "body": "So, I applied for an internship at the SAP iXp program and I just got an email scheduling a prescreen. This is the first time I've made it so far. Does anyone know what type of questions should I prepare for?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1nn73iw/i_need_some_advice_for_my_first_job_interview/",
      "comments": [
        {
          "body": "SAP iXp prescreens typically focus on behavioral questions about your motivation, teamwork experiences, and why you're interested in SAP specifically. They'll likely ask about challenges you've overcome, times you've worked in teams, and what you know about SAP's products or culture. The good news is these aren't usually technical deep-dives at the prescreen stage, but rather conversations to gauge your fit and enthusiasm for the program.\n\nThe key is having concrete examples ready from your academic projects, part-time work, or volunteer experiences that demonstrate problem-solving and collaboration skills. Research SAP's values and recent news so you can speak intelligently about why you want to work there beyond just \"it's a good company.\" Practice articulating your stories clearly and concisely since prescreens are often shorter conversations designed to move promising candidates forward. I'm on the team that built [AI for interview prep](http://interviews.chat), which can help you practice answering these types of behavioral questions and get comfortable with the interview format before your big day.",
          "score": 2
        },
        {
          "body": "Congrats on moving forward! For SAP iXp, prep for behavioral questions using the STAR method to describe past experiences effectively. Be ready for technical or role-specific questions to gauge your problem-solving skills. Also, know your resume well; they're likely to ask about your experiences listed there. Good luck!",
          "score": 2
        },
        {
          "body": "Congrats! Be ready to talk about your resume, why you're interested, basic behavioral questions, and maybe some general problem-solving scenarios. Practice speaking clearly and stay calm. Good luck!",
          "score": 2
        },
        {
          "body": "Do mocks with friends and look over glassdoor of potential interview questions (that others were asked), also you should try this free service [voice.neuraprep.com](https://voice.neuraprep.com) if you input the company it will automatically scrape technical questions of it and you do the phone interview with the AI.",
          "score": 2
        }
      ]
    },
    {
      "title": "Job offer - when and how do I negotiate salary?",
      "body": "Hi all. I’d love some advice. I’m stuck in a job that is slowly sapping my will to live. Today I got a verbal offer (via phone call) for a role I’m really interested in for an organisation whose mission I feel very aligned with and passionate about. I liked the panel a lot also. Apparently they were very impressed with my interview, application and reference checks.Lovely feedback.\n\nThe top of the salary range advertised was still 8k less than what I earn now. I had planned to try for something closer to my current wage if successful. I was thrown when she told me today the offer is midway through the range advertised. I didn’t want to negotiate then and there over the phone as I didn’t have a written offer. \n\nI spoke with a friend in recruitment who said I should have negotiated then and there, but my soul is so shattered by my current job I was afraid they might rescind the offer if I essentially asked tor 10k above their offer in an attempt to match my current income. \n\nMy question is when and how do I broach this? I don’t want to risk losing the position, but I also feel I need to at least try to get them to match my current pay. \n\nAny advice welcome!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1mhcme8/job_offer_when_and_how_do_i_negotiate_salary/",
      "comments": [
        {
          "body": "Near the end of the process",
          "score": 2
        },
        {
          "body": "Just know that negotiations are always a risk. There’s nothing stopping a company from pulling your offer just for trying to negotiate. So only try to negotiate if you’re okay with that possibility. \n\nYour best bet is to ask for the top of the salary range, especially since it sounds like you went into the interviews knowing what the range was. If you ask for more than they listed, the first thing they’re going to say is that you knew the range going in. ",
          "score": 1
        },
        {
          "body": "1 After you have an offer in writing.\n\n2. You call or meet the person who made the offer\n\n3. \"I love everything about the role and company\"\n\n4. \"I was expecting X or I'm already receiving X. I need the offer to be Y (More money, PTO, remote, benefits, etc.)\"\n\n5. \"What can we do to bridge this gap? I really want to be on the team.\"\n\nIt's better to do this on the phone or in person so you can read their tone/ facial expressions. You can lose the offer completely if they are already maxed out or have another candidate lined up they like almost as much as you.",
          "score": 1
        }
      ]
    },
    {
      "title": "I've been unemployed for 2 years now, gotten to 10 final interviews, but never once given an offer. What should I do to market myself better?",
      "body": "I have a 2 year diploma as an industrial engineering technician and 10 years of experience as a test technician for a well known aerospace company. I performed at a near peerless level, as I later discovered due to many of my coworkers repeatedly informing me, and was offered a few promotions that I turned down due to lack of pay (no bachelors); which slowly sapped my passion for the job and increased my discontent with management, ultimately resulting in me offering to take a layoff rather than others who needed the money to feed their families. I was laid off in December of 2022, even getting good references from my boss and coworkers, moved back home and have since been applying to jobs almost non-stop; gradually broadening my search from my own region, to state, to the entire US, and am now contemplating looking international, but I don't even know where to look for jobs like that. I've gotten several final interviews, driven up to a dozen hours to do so in person at one point, but never once gotten that call back with an offer. I've barely managed to fit my skills and accolades onto a one page resume, but every interviewer comments on how impressive it is at my age (32m), and I regularly get screening interviews with a 10-20% callback rate. I can ham it up all day long in an interview and very easily win their admiration and respect, but it just never seems to make it to that final offer.\n\nI did community college for my engineering degree for about a year, but that is agonizing as I can't stand doing mindless assignments when I can ace the tests with so little effort or prep. The only classes I passed were the ones with low workloads or professors that actually challenged their students to have an opinion, thus making learning interesting. I'd like to continue my technical education, but the nearest school with anything that could improve my skillset is more than 2 hours away; and my savings, which is now half of where it started, won't be able to sustain that kind of lifestyle for another year. Is this just the average experience when being laid off for a long time? Should I go get a part time job as a pizza delivery guy so that they don't think I'm coming in after 2 years of being totally unemployed? What can I do to convince them to take that final step to I can actually start the process of negotiating?",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1j1o2k0/ive_been_unemployed_for_2_years_now_gotten_to_10/",
      "comments": [
        {
          "body": "One thing, I noticed that you made some comments about management at your previous job. I’ve been asked in several interviews about my previous managers. Be sure to stay positive in an interview and never say anything negative about the managers you’ve worked under. \n\nIt’s an extremely difficult job market, but if you’ve gotten 10 interviews, you’re obviously doing something right. That probably means your résumé looks really good, but now it’s just a matter of finding the right job. If you end up having to take something that is not your skill set and lower pay, that might be what you have to do, because from what I’m hearing, there are many people in the exact same position.\n\nYou’ll just have to keep trying. If you can get somebody to help you with your interview questions and listen to your responses, it can help to get a second opinion.",
          "score": 2
        }
      ]
    },
    {
      "title": "What is your \"Tell me about  yourself\" for interview??",
      "body": "Hello All,\nI would like to know how you sell yourself in interview to get that big hike 🤑🤑.\n\nThis is what I am using nowadays, it would be great if you can review it or share your pitch so that we all can have a good intro 🙏🙏\n\nI am a Senior Data Engineer with over 3 years of professional experience working  in retail vertical, Here i primarily deal with Sales, Finance and sellout data for leading beauty brand. I primarily work with Informatica , Azure Data Factory, SSIS, SSAS, Power BI, and SAP. My Experience includes working closely with business stake holders understanding their problems and providing solution for that.I am also a certified Microsoft Certified Azure Data Engineer. In my free time I love to build data related projects to stay up-to-date with latest technologies.\n\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1k1mqm9/what_is_your_tell_me_about_yourself_for_interview/",
      "comments": []
    },
    {
      "title": "How can I handle an interview for a role that my profile doesn't match well?",
      "body": "Applied for a finance and tax specialist role and got an interview with the hiring team. The role seems to want at least 2 years of experience in financial reporting, accounts receivable, and tax and strong preference for it. Also a bachelors in finance or accounting.\nFinally, they asked for a \"startup mindset\".\n\nMeanwhile, I have 2 years in accounts receivable from my early career, but moved to SAP functional support later (did 2.5 years of that). I did support finance and accounting teams, but I really have little core accounting or tax experience. I do have a bachelor's in accounting and finance. I also had a small business that I co owned and ran with two friends.\n\nMy profile doesn't seem to fit the job much, so I really wonder what prompted them to invite me for an interview. Plenty of people have what they're asking for.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nulrpt/how_can_i_handle_an_interview_for_a_role_that_my/",
      "comments": [
        {
          "body": "Once I applied for a job and it got filled, and they suggested one radically different for which I barely had experience. I assumed they saw my resume and knew what they were getting. I could do it, but like a lot of it was out of my element.\n\n\nNope.\n\n\nDon't spend the interview(s) saying \"I don't know this\" but be very clear where you're at and get clarification on what's involved. Avoid phrases like, \"to be honest\" or others that really don't look good if you're on your back foot.",
          "score": 1
        }
      ]
    },
    {
      "title": "I am looking for a help in preparing for an interview",
      "body": "This is my final round with the company. I have completed two rounds and one online assessment already. This process has been lengthy and long (management changes has been occurred in between) but finally I have been invited for the final follow up round after 45 days.\nI am attending this interview for a Tech SAP Recruiter role. I have overall 5 years of experience. I usually get nervous in interviews and get lost. I really want to join this company. Looking for tips how to prepare and how to answer in the interview.\n\nI got bit of tips from the recruiter-\n\nThey are not looking for a candidate who wants to sell themselves, candidate will be examined on the basis of cultural fit, motivation and how they are as a person. ",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1m0vi6g/i_am_looking_for_a_help_in_preparing_for_an/",
      "comments": [
        {
          "body": "For cultural fit and motivation-focused interviews, I found it helpful to prep by reflecting on what genuinely excites me about the role or company, and then practicing saying it out loud conversationally. I used Beyz mock interview for that. It helped me hear how I was coming across, and smooth out where I was sounding vague or over-rehearsed.\n\nAlso, the IQB interview question bank had a few recruiter-specific behavioral prompts that made me think through past experiences in a clearer way. I didn’t memorize answers, just used them to get comfortable telling stories.\n\nIf you focus more on sharing who you are and why you care about this work, rather than trying to impress, it might feel more natural.",
          "score": 2
        },
        {
          "body": "ive got this tool for practicing interviews and getting better. want to test it out for free for your use case? its a proper meeting scenario video call interview tailored to you job, resume, industry and so on. shoot me a DM if you wanna try your luck there",
          "score": 1
        },
        {
          "body": "Here are some rapid fire tips:\n\n* Ask questions throughout the interview. See my post here: [Keep It Conversational](https://www.reddit.com/r/interviews/comments/1h60vwj/advice_always_ask_followup_questions_throughout/)\n* Practice frameworks like the CAR method to help prevent rambling when responding to questions you didn't prepare for: [CAR Method](https://www.reddit.com/r/interviews/comments/1icanji/advice_stop_rambling_in_interviews_use_the_car/)\n* If in-person, bring a pad folio with the following:\n   * Notepad and pen to take notes throughout the interview\n   * Resumes printed on resume paper (textured &amp; off-white color)\n\nI also offer free 15-minute mock interviews. Just send me a DM.\n\nGood luck! 🤙",
          "score": 1
        }
      ]
    },
    {
      "title": "SAP Business Process Associate consultant - 2025",
      "body": "Hi guys, has anyone applied and received an interview for this? What’s the process? When do they get back? ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1jg4xiv/sap_business_process_associate_consultant_2025/",
      "comments": [
        {
          "body": "Companies often start with an initial screening call, followed by technical assessments and behavioral interviews. The timeline can vary, but you can generally expect to hear back within 2-4 weeks after applying. If you haven't received a response in that timeframe, it's perfectly acceptable to follow up with the recruiter or hiring manager for an update on your application status.\n\nDuring the interviews, be prepared to showcase your knowledge of SAP systems, business processes, and consulting skills. They'll likely ask about your experience with specific SAP modules, your problem-solving abilities, and how you've handled challenging client situations in the past. If you're looking to sharpen your interview skills for this role, I'd recommend checking out [AI for interview questions](http://interviews.chat). It's a tool I helped develop that provides real-time suggestions during online interviews, which could be particularly useful for technical questions about SAP systems.",
          "score": 1
        },
        {
          "body": "Hi, can I ask if you heard back yet? I also applied for this position, and it is been 2 months, and on the website, it still shows application received.",
          "score": 1
        }
      ]
    },
    {
      "title": "Help me prep for second round (client) cognizant. RPA Developer Automation Anywhere.",
      "body": "Hi All,\nI have a second round scheduled with cognizant this evening. For role Automation Anywhere RPA Developer. I have 3 years of experience in rpa with tool AA and Power Automate. I dont have mainframe or SAP experience but I have worked with web, excel, Api automations. How to lead mh interview and what are some dont that I shall avoid to get this round cleared.\n\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1jd7pl1/help_me_prep_for_second_round_client_cognizant/",
      "comments": []
    },
    {
      "title": "Questions ",
      "body": "How to explain SAP EWM project in an interview? \n\nAny one help with example.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1hcm1j0/questions/",
      "comments": [
        {
          "body": "Focus on the specific challenges you tackled and the results you achieved. Start by briefly outlining the project's scope and objectives, such as implementing a new warehouse management system or optimizing existing processes. Then, dive into the key features you worked on, like inventory management, goods receipt, or picking strategies. Be sure to highlight any unique solutions you developed or significant improvements in efficiency or accuracy that resulted from your work.\n\nIt's crucial to tailor your explanation to the interviewer's level of technical knowledge. If they're familiar with SAP EWM, you can go into more detail about specific modules or customizations. If not, focus on the business impact of your project, such as reduced costs, improved customer satisfaction, or increased throughput. Prepare a concise example that showcases your problem-solving skills and your ability to collaborate with cross-functional teams. I'm on the team that created an [interview helper app](http://interviews.chat), a tool that can help you practice articulating your SAP EWM experience effectively for different interview scenarios.",
          "score": 1
        }
      ]
    }
  ]
}