{
  "company": "shopify",
  "post_count": 52,
  "exported_at": "2026-01-18T17:44:53.303Z",
  "posts": [
    {
      "title": "HELP: Coding Test + Challenge",
      "body": " (Cross post)\n\nSo I'm going to be taking an HTML/CSS/JavaScript test in a few days. This is for a developer role. My first one ever.\n\nI'm good with HTML and CSS. I know a tiny bit of JavaScript, but never used it in a real project before.\n\nI come from a background that is strong in web design. The only time I have done front-end development was back in college and creating a TV display for my past job.\n\nOther than that I have used WordPress and Shopify which makes it really easy to create a website with almost no coding knowledge at all.\n\nI really want this job due to potential growth with this role and the work culture seems amazing.\n\nI'm also in a very desperate position where I need a job ASAP. Trust me, I applied to at least 400 jobs at this point and there hasn't been anything as promising as this one job.\n\nI heard of people cheating on code tests. I'm not supposed to cheat as the test says not to. My interviewer says the test is to see where my skills are at. And I'm afraid that I might not beat my competitors.\n\nBtw, I am hard-working and dedicated. I am willing to study and practice outside work hours just to be more competent. Does the hiring manager care at all for someone who does possess some experience and is dedicated to becoming better?\n\nAny thoughts?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/16c6typ/help_coding_test_challenge/",
      "comments": [
        {
          "body": "Depends on the manager what they value.\n\nPersonally, I'd prefer someone who can do 2/3 of it, wants to learn, and is honest than someone who can do 2/3 of it and lies. Character and integrity are the only things you have going for you in the world, and if people learn you cheat on tests and can't be trusted, that'll get around.",
          "score": 1
        },
        {
          "body": "Coding ability, or the lack thereof, is the easiest thing to spot when you’re on the job.  There will be a swift exit for most people who cheat code tests but lack the ability on arrival.  I’d study heavily and take the test so they know where you’re at.",
          "score": 1
        }
      ]
    },
    {
      "title": "Honest Open Application",
      "body": " \n\nHi,\n\nI Am looking to break out of my usual job role in  sales. Posting on reddit is an attempt to find something suited to increasing and improving the skills required to be great at digital sales and marketing. \n\nI include honesty in the title as I am a highschool dropout who has worked for 11 years in sales and marketing by lying on his resume and sheer convincing power during the interview process for mid to large companies, Upgrad, a large edutech company being on this list.\n\nI was at my 1st company(chemical B2B sales) for 7 years after which working for 2 start ups (F&amp;B SaaS, Real estate) and 2 edutech companies (Toppr, Upgrad) convinced me to switch careers.\n\nSince covid i played poker for a living and i did well enough to earn around an average salary every month, however i wasn't able to do more than live hand to mouth from this endeavor.\n\n8 months ago i used the money i had saved to start learning how to create and monetize a website, having underestimated the time it would take to learn and build what i needed i ran out of money but i was able learn a great deal that i hope to offer along with my corporate experience\n\nThe things i learnt include but are not limited to\n\nBuilding a website through wordpress (palolembeachgoa.com which i was able to grow to 800 monthly visits before running out of money for hosting)\n\nKeyword Research and SEO\n\nSocial Media Marketing ( my twitter account for a POD business named bnmscosmicstuff received 1000 profile visits and 18 followers from 0 in 25 days, managing a local rappers youtube channel)\n\nSMA\n\nSetting Up online Stores (shopify, etsy, amazon)\n\nCreating Digital Products ( Tshirts for a POD business and Books for Amazon KDP)\n\nMy greatest Strength is doing research online and I Am a quick learner (as sales jobs have targets and i have learnt every job while actually working it) and i promise you won't find harder working than me, simply because after a decade of personal growth, successes and failures\n\nIam not looking for anything easy or extravagant, simply an opportunity\n\nThanks",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/14t7h21/honest_open_application/",
      "comments": []
    },
    {
      "title": "23 and never had a job.",
      "body": "I've done work but I've never had a formal job where I make a resume, go to a job interview and work a job 9-5. \n\nThis will be long but I really hope someone here can help me out, I'm struggling these days but not in ways others are. Yesterday was my 23rd birthday so it makes this all the more important to write this now. I've been contemplating posting this for a number of days, trying to figure out my best approach to write this so here me out.\n\n\nI've had jobs like I delivered newspapers when I was 10 years old, I sold chocolate bars door to door and outside businesses when I was in grade 8 but since then, I've never had a job, and I don't feel normal, I feel like a failure as a result.\n\nMy hope here is that maybe somebody who is familiar with hiring processes and such can recommend me a solution. I'll go over a few things I've thought about doing later on. \n\nI left school after grade nine (i'm in Canada), it was a mistake, I'm not putting blame on my parents but it's safe to say they shouldn't have allowed me to do it. I talked them into it though and they didn't know otherwise, I convinced them I was doing online school while I was really just developing a short sighted, lazy lifestyle. I've struggled with obesity my entire life but since I left school to the beginning of this year it got worse. I was around 400 pounds this year when I made [this post](https://old.reddit.com/r/Advice/comments/f1n9rn/could_use_a_little_direction_xposted_rself/). Since then and throughout the pandemic, I've lost a chunk of weight (around 50-60 lbs). I'm learning that where I've taken my life has not been the right direction and I'm desperate to correct it. I've set short and long term goals for myself and they are a work in progress. \n\n\nOkay, this is r/jobs, allow me to stay on topic, so around the time I was 17 I started dabbling in some internet money making things, I started selling products on a popular internet forum,  I at the time thought I was doing pretty good making a couple thousand bucks a month. I had no foresight to the future, I didn't even think about where I'd be at in 5 or 10 years, only that everything would probably fall into place and I'd be fine. \n\nWith my selling of things on this internet forum, I taught myself important skills like dealing with customers and how to sell products. \n\nI'd like to consider this experience but the truth is I don't even know how i'd begin to put this on a resume, I did this on and off for years up to the beginning of this year with many different products. I realize now that while I was doing this to make money, others my age were gaining formal work experience working in restaurants or other kinds of work while also pursuing university. \n\nIt feels like I've fallen behind about 8 grades in school. Like everyone is doing better than I and I don't even know where to begin to recover from this and get my life on track. \n\nSome of my skills that I would bring to a job are things like my  writing skills and my ability to type at around 120WPM.\n\nSo what kind of work do I want to do? Customer support would be fine with me or data entry would be good as it matches my typing skills. \n\nI've explored potential job candidates on Indeed and I've even seen a couple that I believe I'd be a perfect match for, they are  customer support jobs for example looking for somebody with experience with ecommerce platforms like Shopify, and I happen to have dabbled in Shopify at one point, I'm familiar with the ins and outs of it. \n\n\nAnother thing I should mention is that for a few years my desire  was obtaining a career in web development, as a result I've learnt web development related technologies like HTML/CSS and also dabbled in Javascript.  \n\n\nSure, that is something I could put on a resume, but what employer would hire somebody without formal job experience? As well as no high school education? (although that's a work in progress and one of my goals, it's achievable as soon as COVID allows me to) The answer is none, and that is why I keep beating myself up, as the older I get, the worse it gets. \n\n\nSo does any one have any ideas? What can I do to get myself into the job market, especially in these times?\n\nI'm open to volunteering my time in order to gain formal experience, I feel my skills in writing and such would be valuable in the times of COVID for a position from home but I could really use some assistance in knowing where to go from here.",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/k9dor3/23_and_never_had_a_job/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "You said you’ve seen jobs you’d be a fit for, but wasn’t sure because of lack of experience.  Have you applied to any of these jobs?  The whole “you miss 100% shots you don’t take” and all is pretty relevant.\n\nAs far as I know, being self taught is more prevalent today than it was before.  You can always put those under skills or talents on your resume, even though it’s not technically experience.  Your resume is a living document, make sure you tailor it to whatever position you’re applying for, but don’t lie about yourself either.\n\nYou can always find some sort of warehouse job if you want to fill time gaps for employment, I know amazon and other shipping companies are in need of seasonal work at the least.",
          "score": 3
        },
        {
          "body": "I'm 20 y/o American myself so I'm not sure how much I can help but here's my spiel.\n\nThe first thing you should do is create a list of any and all activities/projects you have done. from ninth grade to now (do not include anything before 9th). For each activity, write down a description of what role you played and what you did as well as the dates you did those activities for. That list can help you build a resume. Unless it is relevant to the job, ignore anything on your list that is between 9-10 maybe 11th grades. You want to focus on the years from when you would have graduated from high school to now.\n\nHave you worked on any projects in the past 3-5 years? Like using simulations or building a website/program? Have you been heavily involved in any organizations where you helped them out like as a mod/mentor/passing flyers out or even created things for them like posters or simple data entry? If you did (even if it was only once), you can try and put it on your resume as project experience. Skills/certifications and project experience should be the second and third things on your resume. Also, try and get certifications on google analytics or ads. It might help beef up your resume.\n\nSkills: Shopify, Microsoft Office, HTML, CSS, JavaScript,120 WPM\n\nCertifications: Google Analytics, Salesforce\n\nSearch on Google \"*college name* resume samples\". Most, if not all colleges will have sample resumes you can look at and take inspiration from. Here's a [link](https://drexel.edu/scdc/professional-pointers/application-materials/resumes/samples/) to my school's webpage but make sure to look at other schools, especially your local community college.\n\nThe fact that you sold stuff online can be considered as work experience. For example:\n\nKingsandLegends Forum\n\nOnline Seller                                                                                          Oct 2018 - Sep 2020\n\n* Created and marketed several popular products\n* Efficiently managed an inventory of 50-60 products\n* Shipped an average of 27 products monthly through FedEx\n\nThis is just an example so you can mold it to something that fits what you do. Remember to put in as many numbers/demonstrate how well you achieved something. Take a look at this [link](https://www.livecareer.com/resume-search/r/online-seller-9618f0d008e446f9af3f7626552aeeff) if you need any more help with adding any more descriptions for this role. I'll add some other links to help you out a bit.\n\n[https://www.themuse.com/advice/how-to-write-sales-resume-example](https://www.themuse.com/advice/how-to-write-sales-resume-example)\n\n[https://enhancv.com/blog/3-steps-to-write-a-killer-ecommerce-resume/](https://enhancv.com/blog/3-steps-to-write-a-killer-ecommerce-resume/)\n\n[https://resumeworded.com/first-login-home.php](https://resumeworded.com/first-login-home.php)\n\nIf you're not looking for a paying job right now and just want some work experience, find ways to volunteer. Many places are looking for virtual volunteers than can help out. You can look it up on Google for any opportunities or organizations so don't limit yourself to specific roles or areas. \n\nLook into your community library to see if there are any opportunities there or if there any resources there to help you. It's possible that they have a career guidance program or they can give you access to online programs that can teach you skills. My library is working with Linkedin to provide users free access to Lynda.\n\nThis is gonna be generic but, you're gonna need to stop beating yourself up. Yes, you've made mistakes and you're in a tough situation but beating yourself is not gonna help you. You need to focus on what you can do now to improve your situation. You're already taking the first step by getting an education. There are a ton of free resources online that you can use, keep searching for them even if it seems daunting to look for it. \n\nAs a previous comment mentioned, once you made a solid resume apply to any and every position that you think you can do. I would also look into freelancing websites like fivver or people per hour. There are also freelancing websites that will pay you to act as a virtual assistant or house sit for people but I can't remember what they're called.\n\nGood luck man, hopefully you can get some help from someone in the hiring process. Remember to post your resume in r/resumes so that even one or two people can have a look at it and provide some feedback.",
          "score": 2
        },
        {
          "body": "amazon hires literally everybody, if there's one near you. no resume, no interview. tim horton's might be similar. register at temp agencies. your typing skills are your in there. \n\n/r/resumes. don't sell your self short. you made money online. millions of people want to do that but havent figured out how. \n\ndr john bear's guide to distance learning might help you figur eout how to get some credentials. it helped me finish my degree so i could get a doctorate. i'm still a  bum. \n\nmy plan was: 1. work in amazon warehouse. 2. learn to scan used  books to sell to amazon\n3. write a book to self-publish on amazon. so far i've only done step 1. worked 10 weeks this summer, made 5k, then i went back to my usual gigs. more of my plan was to take that $5k and invest it in tesla stock, but i mostly missed that boat. but i still ended up making as much money this year as i ever have in a year, pulled myself out of a hole.\n\nyou weight issues might mean that you wouldn't last long at amazon, but it would be long enough you could list it on your resume.\n\nnormally a resume is mostly work experience and education, but it doesn;t have to be. you can do one that is a one page sumarry of your skills and objectives. at 22 i had no resume, almost no work experience.\ni worked as a dishwasher and janitor and gradually worked up to better jobs. i'm 60 now, a lawyer and small business owner, but my most fun job this year was 6 weeks washing dishes in a korean restaurant.",
          "score": 1
        },
        {
          "body": "If you ever write to a hiring manager, don't post an essay. People tend not to read things that are very long.",
          "score": -1
        }
      ]
    },
    {
      "title": "Who Am I? (Job Roles)",
      "body": "*My post is long so I highlighted the main questions in bold - if you just want to read that part.*\n\nI need help from everyone in what kind of job I do. I'm not sure exactly what to look for. **This is long but if anyone in marketing/SEO or web dev could take a moment to help me, it would make all the difference in my life.**\n\nI keep teetering back and forth between Front End Developer, SEO Manager, and Brand Marketing Manager. Yes, those are ALL very different, so here is some backstory.\n\nLet me tell you what I do, what part of my job I like, and help me define that role.\n\nFirst, I was a copywriter for almost 4 years. I became the senior copywriter, writing press releases, managing teams of writers, being in contact to get to know them a little (so we could write pieces on them and advise them), and managing internal communications. I wanted to do more than this because I thought our company website looked bad and I always saw ways to fix it, so even though I had my BA in English, I went to school to get an associate's in software development. My courses were in web dev, and I learned html/css/javascript/php/c#/sql/python. While I was in my last semester of classes, the CEO of the company passed away in a rather unfortunate way and the company went under, thus my employment ended.\n\nI went to an agency a few months after this and got a job as their copywriter and junior web dev. I did a little bit of both there. It was a small branding agency of 7/8 people and there was only 1 full-time dev plus a contract dev. I learned a lot that first year about development and loved what I did, but I got heavily involved with the branding process about a year in.\n\nFor those that don't know it, SEO is a huge part of building a website, but also a large part of a marketing strategy in general. Because I am technical and do coding, I became a very good SEO person. I pretty much ended up training my entire company how to do SEO properly since I became so immersed in it for a good year and a half after I moved there. I had LOTS of sites to try it out on and a lot of people that were asking me questions, so I always had to find answers and learn. SEO and some lite coding became my job. As I was not the full stack dev at the agency, I did most of the front-end coding work, looking at interfaces like navigation and forms, working with design on those, and coding those elements. I spent a lot of time with clients, sometimes working with them on their organic growth strategy, sometimes going over how the things we were doing were improving them organically, how the UIs of their applications were engaging users. If anything every went wrong on a website, I also was the person that had to fix it MOST of the time. The lead dev left and I became that person who did much of the work, but the contract dev did some of it. However, I often had to understand what he was doing since I had to manage his time and manage the web projects.\n\n**What I love about my job is that I have the skills to change anything on a website, Wordpress/Shopify/vanilla bootstrap - whatever. I also love SEO and it might be my favorite thing of all. BUT, I do work with people on branding too, since we are a branding agency. We do research, come up with names and the company journey together as a team. We come up with marketing campaigns and my focus is on the organic growth part such as competitor research and analysis. I build AND design landing pages, (based on the design of a site that a designer makes) decide what buttons to track, use Tag Manager to track them, strategize newsletter copy, manage all of our content people at the agency and check that they are up on their deadlines and are making content updates to websites for clients. I pull reports and go over them, connecting sites, newsletters, and ecomm platform with secondary data. I also write technical documents and draw up sitemaps. I write agency proposals and in 4 years, became the senior-most person at the agency.**\n\nAs much as I love my job, what I do gives me a lot of stress. Every day something doesn't go as planned and I always have to jump on calls with people or sit and help explain something. I'm always stretched too thin from not having enough people and there is not enough money to hire someone new to help me. What does my job most sound like? I have just over 8 years experience. I applied for brand management jobs asking for 2-3 years experience and was told they were looking for someone more senior (without an interview). I also applied to SEO manager and was told no (no interview), and even a junior strategist job and was told not have enough experience (no interview), even though I know I can do the job. I think my resume doesn't reflect what I do, and part of that is because it's got dev, branding and seo stuff in it. I think it's throwing people off. Just to see what happened, I even applied to a few entry level SEO jobs and left out everything except SEO, but just said I did SEO for 1-2 years, and I was emailed back and said they were going with more qualified candidates.\n\nHow do I go for a singular management role, or a highly specialized role? And I don't want to be a pure dev. I want to do either SEO or branding, or even something in marketing. **Any ideas on what role it might be called, and how to showcase that on a resume? Keep in mind I have \\~8 years in copywriting, development, SEO, and branding combined.**",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/reuy09/who_am_i_job_roles/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Has anybody here been rejected by Shopify after an interview? Would love to learn about your experience",
      "body": "",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/6gssxz/has_anybody_here_been_rejected_by_shopify_after/",
      "comments": [
        {
          "body": "You get a phone call on the day they tell you that you hear back by. This round its june 22 or june 24 I forget. They tell you things that you should improve on, and say to tell them what you improved on next time you apply.\n\nIf you get an offer you should hear back earlier (this week around, depending on the team)\n\n\nThis is for the intern process\n",
          "score": 5
        }
      ]
    },
    {
      "title": "I was rejected from on the fifth &amp; final round for a full stack software role and it stings",
      "body": "For context, I am a self taught SWE with a total of 6 years of experience. I was interviewing for a full stack role at a popular online therapy company, I won't say the name but its easy to guess as they've been sponsoring a bunch of YouTube creators.\n\nI went through a total of 5 interviews before being told by the recruiter that I am not a fit for this role which is hitting me hard a couple days later. I am writing this out really just to vent as well as let other applicants know what happens in these interviews.\n\nHere's a breakdown of the interviews:\n\n1. The first interview was a 30 minute call with the recruiter who had reached out to me on LinkedIn. I didn't apply, she came looking for me. She told me she was looking for a full stack developer who leaned towards frontend as they were looking for someone with React &amp; React Native experience as well as backend experience with PHP, Laravel &amp; Symfony components. Given this information, I thought I would be a perfect fit so I went ahead with interview process.\n2. The second interview was a 90 minute TestDome quiz which had 4-5 questions covering PHP, Javascript &amp; SQL. Scored 100% on PHP &amp; JavaScript and 88% on SQL. Nothing significant to note, just a straightforward test.\n3. The third interview was a 45 minute conversation with one of their software engineering managers, in my opinion the conversation went really well as he really just wanted to understand my past experiences and problem solving skills as a developer. He too was a self taught software engineer so there was a lot of synergy between the both of us.\n4. The fourth interview was the hardest as it was a 5 hour virtual onsite. Per the requirement document I was tasked with building a survey form with two types of questions radio (single answer) and checkboxes (multiple choice). I was required to seed the database with 6 questions that were a mix of radio / checkbox questions. I also needed to make it possible to add, edit, remove and reorder the existing questions. Lastly, I was also tasked with building a page for displaying the form results to investigate user happiness (for context one of the predefined questions was asking if they are happy). Given I had 4 hours of dev time, the requirements said it was okay to \"cut corners\" as long as it wasn't in the database schema setup. Personally, I felt 4 hours wasn't enough dev time for this as I was feeling rushed for most of the interview. At the end of my dev time I was then tasked with demoing the project &amp; the code itself to the 5 developers on the panel who then asked questions about my code decisions. I made the frontend look good and made the user experience easy as I used Laravel + Inertia React. Admittedly though my raw SQL skills weren't the best as I've typically relied on ORM's in the past.  However they made it a point to test my SQL abilities which I felt was a bit weird as I was under the impression this was a full stack role that leaned more towards frontend than backend so I spent more time focusing on the frontend than the backend. However as a last ditch effort to try to prove my raw SQL abilities I pulled up the database from a personal project that I work on the side. The project gets a couple thousand site visitors so I showed them how I use raw SQL to generate email reports about the project's insights. Admittedly this was very impromptu and I felt I didn't present it in the best light. I for sure thought I wouldn't be passed along to the next stage of the interview.\n5. Surprisingly, I got an email back from the recruiter who told me that despite my SQL skills not being the sharpest, the developer panel was more impressed by the work on my personal project as they said it showed initiative &amp; ambition which is what they were looking for in this role.  They also felt I had the ability to get better at raw SQL if I was actually on the job as many of the developers in their org are also self taught. Given that, she told me the fifth &amp; final interview was about testing to see how well I understood their product and testing my ability to put on a project manager hat as a developer. They gave me a free trial for their product and I was tasked with finding 1-2 things I would improve on their product. The interview was 90 minutes long and required me to present my arguments in a Google Slide Deck. I basically pointed out that they could improve their onboarding flow by making their desktop design match their mobile design as well as improving one other small product feature. In this interview I presented to a total of 4 people, 2 were developers from the previous panel, one product designer and one clinical therapist as I mentioned they are a therapy app. I thought the interview went well but was emailed 24 hours later by the recruiter \"*The team was able to put their heads together to debrief in more depth after your final interview yesterday. Unfortunately, at this time, the team has decided not to move forward. I know this isn't the news we were hoping for and I'm sorry to have to share it with you*.\"\n\nI am upset that it took the company a total of 5 interviews (a total of 10 hours) for them to realize I wasn't a good fit especially after being led on by the other 4 interviews. This doesn't sting as much as it should though as I've had a very similar experience with Shopify where I went through 4 of their interviews and was rejected on the last one as well. With Shopify at least the recruiter had the decency to give me a phone call and give me feedback on the areas I could improve on. However with this company the recruiter just gave me a canned email response and didn't care to give me any feedback at all. Yes, I understand they don't HAVE to give feedback to their candidates but the fact that you took up 10 hours of my time after reaching out to me and don't have the decency to tell me what went wrong is absurd. This industry can be brutal sometimes and it sucks.",
      "subreddit": "cscareerquestions",
      "score": 690,
      "url": "https://reddit.com/r/cscareerquestions/comments/1bbemp9/i_was_rejected_from_on_the_fifth_final_round_for/",
      "comments": [
        {
          "body": "I went through a bunch of rounds for Uber a while back and the day of the last on-site they moved half my interviews to the next week and I was so tired and frustrated from grinding leetcode I failed them. It’s sad you can get so far but in the end it doesn’t even matter. I had to fall to lose it all but in the end it doesn’t even matter. It starts with one day. And I don’t know why.",
          "score": 330
        },
        {
          "body": "5 rounds? That is egregious lmao",
          "score": 549
        },
        {
          "body": "I would have stopped after the 3rd round.",
          "score": 116
        },
        {
          "body": "5 hour virtual onsite? Fuck that and fuck that company. We need to collectively not work through interview processes that waste our time as egregiously as this",
          "score": 58
        },
        {
          "body": "[deleted]",
          "score": 232
        }
      ]
    },
    {
      "title": "Zuckerberg says company will permanently shift tens of thousands of jobs to remote work",
      "body": "[The Verge](https://www.theverge.com/facebook/2020/5/21/21265699/facebook-remote-work-shift-workforce-permanent-covid-19-mark-zuckerberg-interview)\n\n&gt; “We need to do this in a way that’s thoughtful and responsible, so we’re going to do this in a measured way. But I think that it’s possible that over the next five to 10 years — maybe closer to 10 than five, but somewhere in that range — I think we could get to about half of the company working remotely permanently.”\n\n[CNBC](https://www.cnbc.com/2020/05/21/zuckerberg-50percent-of-facebook-employees-could-be-working-remotely.html)\n\n&gt; Zuckerberg announced that [big social media] is going to “aggressively” ramp up its hiring of remote workers, and the company is going to take a “measured approach” to opening up permanent remote work positions for existing employees. \n\n&gt; Employees who continue to work remotely and move to different regions will have their compensations adjusted for their new locations, Zuckerberg said citing that this is necessary for taxes and accounting. Employees will have to notify Facebook of their new locations by Jan. 1, 2021, he said. \n\n&gt; “We’ll adjust salary to your location at that point,” Zuckerberg said. “There’ll be severe ramifications for people who are not honest about this.”\n\nSaw Square, Twitter, and Shopify do this but this move is a lot bigger. Good for tech or pathway to more off-shoring and lower salaries?",
      "subreddit": "cscareerquestions",
      "score": 1089,
      "url": "https://reddit.com/r/cscareerquestions/comments/go1nw6/zuckerberg_says_company_will_permanently_shift/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 634
        },
        {
          "body": "[removed]",
          "score": 159
        },
        {
          "body": "I just realized every time a company says they're going permanently remote there's going to be 5 outsourcing-scare posts on this sub.",
          "score": 299
        },
        {
          "body": "While I think there is likely to be a big push from large tech companies towards remote working, I seriously doubt it'll be the end of the lavish Big N office in big cities throughout the world, nor do I think it'll be the huge push towards hiring people where the cost of living is cheap.\n\nIt's worth remembering that cities are often very eager to have big companies set up shop in their city, because it keeps the money in the city, and it keeps smart people there. IMO, this is a mixture of lowering salaries/costs, and (mostly) posturing to these cities that the big tech companies are prepared to leave en-masse if they aren't kept happy.\n\nFor this reason, I think that many of these companies will use remote working as a way to expand into different cities/countries, and to maintain their status wherever they set up shop. It'll be a nice perk for workers, but the offices will still be open and running like before.",
          "score": 83
        },
        {
          "body": "FB says when employees get hungry around lunch they should go to their kitchen and get food, rip food stipends. People-who-know-how-to-cook privilege smh",
          "score": 152
        },
        {
          "body": "All jobs are gonna be remote in the future, huh? I really would prefer to go somewhere in person if we’re being honest",
          "score": 83
        }
      ]
    },
    {
      "title": "Finally got a job after 8 months of self-teaching and you CAN too!",
      "body": " \n\nI just want to share my story and give you guys some encouragement and don't lose hope because I was on the same path. I started my first ever coding exposure on freecodecamp and Udemy, and I finally got a job as an entry-level full stack developer in Austin, Texas 8 months later.\n\nThe only courses I took on Udemy in order:  \n1/ The Web Developer Bootcamp by Colt Steele.  \n2/ The Modern Javascript Bootcamp also by Colt and Stephen Grider  \n3/ Modern React with Redux by Stephen Grider (2020 update)\n\nI started applying after I finished those 3 while also learning Computer Science theories like algorithms, data structures, some C++ &amp; blockchain coding .... on Udacity, Edx, Coursera and Udemy. I also have my own Shopify store and Travel blog on Wordpress.\n\nHere is my portfolio website for your reference 📷[www.lucaslu.dev](https://www.lucaslu.dev/?fbclid=IwAR2BoXOy7NFIOaMnkqHBfXwpnWELf0DkSgdL7N_LF3kAGyRDJvOLzpHwdpQ)\n\nYes most of the projects are from tutorials, but most employers don't know where you get them from because there are too many courses, and they don't have time to check. So DON'T be afraid to apply even if you don't have any projects of your own. Too many people scare off beginners by saying you have to start your own projects, contribute to open sources, grind coding challenges in Leetcode, start your own company blah blah ... I have never done any of them. Even though they may help, don't feel discouraged if you feel like they are too much beyond your ability.\n\nHow I got the job: I was applying every single day to job postings on Indeed and LinkedIn with a few different keywords: junior/entry-level/ intern frontend developer, web developer, software developer, software engineer ... I also looked at a few different cities I would be willing to relocate to if I got an offer. After like 100+ applications and 3 months later, I got like 3 interviews but no luck.  \nThen my friend suggested I look on Craiglist where he got his job. I was surprised people still using it. I literally applied to TWO jobs on Craiglist, and got a call for phone interview 2 days after. Then they asked me to create a form to capture customer information and autocomplete address using Google Map Api and a npm package to validate credit card number. I learned all of them from the 3 courses I mentioned above! I finished the assignment in 1 day after a lot of Googling lol and review some of my past codes. They asked me to come to the office to start next Monday. Hell yeah !!!\n\nSo if I can I know you CAN too. Keep trying and believe in your ability!",
      "subreddit": "cscareerquestions",
      "score": 1226,
      "url": "https://reddit.com/r/cscareerquestions/comments/gwq1xr/finally_got_a_job_after_8_months_of_selfteaching/",
      "comments": [
        {
          "body": "Getting a dev job on Craigslist is pretty badass",
          "score": 222
        },
        {
          "body": "Thank you! Very motivating",
          "score": 43
        },
        {
          "body": "&gt; Here is my portfolio website for your reference 📷www.lucaslu.dev\n\nThis looks phenomenal! Did you make this from a tutorial? If so, which one?",
          "score": 34
        },
        {
          "body": "lol here i am after 5 years of coding classes and none of the hundred jobs i applied to called me back",
          "score": 78
        },
        {
          "body": "[deleted]",
          "score": 41
        },
        {
          "body": "How much are they paying you.",
          "score": 16
        }
      ]
    },
    {
      "title": "25 YOE and in failure spiral",
      "body": "I've been in the field since the late 90's. I have kept pace. I have used a wide toolset and have some specializations, primarily front-end but can also work with Docker, Node, and stand up a LAMP or LEMP server and admin it if needed. I could go on but point is I have a good deal of experience in a wide ranging area. I have several stints at companies that go for 4-5 years. These were known companies in Silicon Valley and prior to that in Boston. I have recently moved back to the east coast.\n\nI have hired devs before and I know the first challenge is to get past the robots and recruiters. I have sent off ~50 applications and resumes - maybe 25% with cover letters, and I have yet to get a single recruiter interview. I'm not even getting many rejection replies and I expect 1 in 3 or 1 in 4 to get those.\n\nI just spent 12 months trying to launch my own e-commerce business after leaving my last job abruptly after a year. I suppose that could be perceptually problematic. I was unsuccessful but I learned the Shopify and BigCommerce API's so at least I got some good experience out of it.\n\nI don't feel like this is a sub where I need to post my outbound materials - they've been edited, reviewed, and I think they're okay. I am just sort of trying to get a temperature read - is this the new normal? Like what is the percentage of outbound apps and resumes after which I should get a response? I am applying for jobs in a similar salary range as I've been getting as a senior full stack web dev for the past decade (150k with equity), but also for jobs a couple levels down (will settle for 80-100k). I don't mind slumming if that's what it takes to make a buck, and I'm not a big salary addict. I just need a point of re-entry that keeps my lights on.\n\nCan anyone sort of share their experience in the current job market? Are there still any jobs? Are we entering some sort of dystopian world in which my whole skill set is of no value all of a sudden? I am willing to believe this is true but it is hard to accept at the same time. I am 50 years old. I guess this could affect it to?\n\nOpen to anyone who wants to tell me what they are seeing out there. It's the first time I've been blind to it in a while.",
      "subreddit": "cscareerquestions",
      "score": 328,
      "url": "https://reddit.com/r/cscareerquestions/comments/1d13jcy/25_yoe_and_in_failure_spiral/",
      "comments": [
        {
          "body": "If you’re 50, don’t say anything about your age and probably remove a lot of stuff from your resume if it’s identifying your age.  \n\nI would only keep the past 7-10 years worth of experience on there.  \n\nAnyways, I had a sad 1% callback rating.  Shit is still on hardcore mode.",
          "score": 434
        },
        {
          "body": "It's really bad. I have 14 years of experience, have applied to \\~100 jobs only to get zero interviews. I currently have a job at a toxic horrible company.\n\nFunny enough, one big bank reached out of the blue for an interview and I got a recruiter screen on Friday. I don't get it.\n\nBTW - I'm in Boston too. Maybe it's a Boston thing?",
          "score": 134
        },
        {
          "body": "Ageism really is a thing, I’m sorry but it’s true, for them it’s just that you can’t give everything to work like young people because of family and stuff. I’m worried that I would be in the same situation when I get older, maybe I would become a security guard or something.",
          "score": 115
        },
        {
          "body": "I empathize with your situation. Almost the same number of years of experience as you.\n\nJob1-Last year got laid off via 2 minutes zoom call. Worked in a Corporate for 4.5 years - top 10% performer with regular hikes and bonus and absolutely no issue but they decided to lay off people who were slightly higher paid and move the job to India/Philippines.\n\n10 weeks of unemployment.\n\nJob2- Next job was consulting job in a WITCH kind of company. Here I was making 20% less compared to my previous job. Here also client did cost cutting and within 10 months I was once again laid off. Client moving all the work to offshore (India).\n\n3 weeks of unemployment\n\nJob3- Found a new job, very low paying($115K). But it seems to be stable and good work life balance.\n\nWithin a year - I am earning almost 40% less than what I was earning. Keep learning new skills and have hope. As others mentioned just show the last 7 years of relevant experience. Have multiple resume specific to job. Linkedin, indeed etc...doesn't work - only the real friends can help.\n\nI often heard a comment that I am a slow developer. Yes - I think before I code. Coding has become easier than what it used to be 25 years back. But experienced people know which direction to go and they don't waste time. Only thing experienced folks should do - don't be scared of trying and learning new skills. Don't feel awkward if you are working with somebody who is your kid's age or somebody 20 years younger to you. Treat them as coworkers, talk less about your past and just do the work.",
          "score": 33
        },
        {
          "body": "12 years of experience, 8 in my last job. \n\nI've been out of a job for 3 months now. Sent about 60-70 applications, 5 interviews. 1 offer. \n\nFrom the 5 interviews, 2 of them were looking for unicorns they will probably never find. The job offer I did get was a contracting job that I will take because I need a job... \n\nI did notice that in the past couple of weeks I got a lot more recruiters contacting me then in the previous couple of months. So there seems to be a uptick, but in general the market is horrible right now.",
          "score": 26
        }
      ]
    },
    {
      "title": "Anyone interview for a Shopify internship?",
      "body": "Just wondering what kind of technical questions they might be asking",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/49x2d6/anyone_interview_for_a_shopify_internship/",
      "comments": [
        {
          "body": "I would check out glassdoor.com to see more responds posted up for this.",
          "score": 1
        }
      ]
    },
    {
      "title": "Shopify senior software engineer salary",
      "body": "Got a recruiter reach out for a senior or a staff SDE role at Shopify.\n\nAnyone working at Shopify or recently interviewed there can share the expected salary for a senior role in the USA?\n\nI have a few other interviews and I want to ensure I only interview at Shopify if they give a competitive offer. I have 10 years of experience. ",
      "subreddit": "cscareerquestions",
      "score": 37,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ppb22y/shopify_senior_software_engineer_salary/",
      "comments": [
        {
          "body": "Interviewed with them over the summer and for some reason remeber the top pay for Sr being around 250 but I can't find that in my email\n\nWeird interview process though, timed brain teasers, personality deep dive, and you need to be all in on the Ai kool-aid. I got asked multiple times about it.",
          "score": 46
        },
        {
          "body": "levels.fyi",
          "score": 30
        },
        {
          "body": "Senior 190-250 USD",
          "score": 3
        },
        {
          "body": "Senior at Shopify translates to junior/mid level at faang. Staff at Shopify is senior faang. Salaries are definitely lower I know two people who got a staff offer and they were both 400k-450k.",
          "score": 3
        }
      ]
    },
    {
      "title": "Companies That Allow Full Remote?",
      "body": "Which companies still allow full remote dev WFH for incoming employees?\n\nPrioritizing good WLB. It's okay if pay is not great.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1hyjvb2/companies_that_allow_full_remote/",
      "comments": [
        {
          "body": "If pay doesn't matter a lot and WLB does, look for well-established private companies which are not on a unicorn track, or public tech companies that are not part of bigtech (or on the edges of it.) \n\nAnecdotally, Zillow might qualify.  Atlassian doesn't qualify as well as it used to on WLB, but it is still remote-first.  Within Microsoft, GitHub is still remote, and has a decent reputation for WLB.",
          "score": 19
        },
        {
          "body": "Off the top of my head\n\nDropbox, Discord, Airbnb, Reddit, Stripe, Block, Pinterest",
          "score": 5
        },
        {
          "body": "Shopify, Gitlab. \nBoth Ruby shops.",
          "score": 3
        },
        {
          "body": "Mine does, what is your tech stack and yoe?",
          "score": 3
        },
        {
          "body": "Hubstop is full remote",
          "score": 3
        },
        {
          "body": "I work at Genesys and most of the people I work with WFH. I've never even been to our office in my city.",
          "score": 2
        },
        {
          "body": "Most of the jobs I found off LinkedIn and interviewed with my last search were full remote. If pay is not really a concern lots of the jobs seemed to have good WLB. Especially some non-profits that paid like 120k max for 5 YOE but had 25+ days of PTO and holidays.\n\nThough many others including the one I ended up with were around 140-175k. My job is quite chill and no on-call.\n\nI know there are some bigger and better paying names though that have full WFH like Airbnb, Square, Github, Atlassian, etc.  I also thought MSFT had some WFH teams? Is internal transfer possible?",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Insurance has lower pay (but it’s still excellent compared to what my friends not in tech make, it’s really all relative) but is slower paced and at least where I am there’s great work life balance",
          "score": 1
        }
      ]
    },
    {
      "title": "10 months unemployed, 6 years of experience",
      "body": "Background:  I took a voluntary severance package at my last company in May last year because I was ready to move on to new opportunities.  I've been looking for work since (as a senior front-end web developer), but had no luck.  Only a single application has reached the interview stage, in October, because a team lead there recommended me;  but my three-day coding project (building an entire website from scratch) was rejected for strange/silly reasons (like \"too many comments\" in reference to a single-line JSDoc briefly explaining what a particular function did, after they had told me to comment everything).  No other company has gotten back to me in my 10 months of looking.  Apps I've put in while working with recruiters have never gotten reviewed because companies have found whom they were looking for before they got to my app.  I have 5.5 years of experience, was UI lead at times at my last job, peer feedback was consistently that I was \"the most technically skilled person on the team\".  I have great references.  I do Angular, React, and Vue.js.  I'm even willing to start below normal market rates for senior front-end development.  But despite all of this, 10 months in, I have nothing.\n\nIs the market really that bad right now?  Should I give up on my career?  Has AI killed it off, or is it just a temporary slump?  Do I just not know how to look for jobs?  Should I be applying to full-stack roles as well, even though I'm inexperienced with back-end development?  Do I need to sell my house and move into a cramped downtown in some city somewhere and apply to in-person jobs?  I've very recently had to take a temporary position working on Wordpress and Shopify sites because the few remote front-end webdev positions I find online are non-responsive, and my year of saved expenses is running out.",
      "subreddit": "cscareerquestions",
      "score": 36,
      "url": "https://reddit.com/r/cscareerquestions/comments/1bukh19/10_months_unemployed_6_years_of_experience/",
      "comments": [
        {
          "body": "I have a graduate degree and 20 years of experience, I have less recruiters calling me from applying then normally when I am not looking and recruiters just reach out.\n\nJob market has been declining since December 2022 and went dead the summer of 2023, I have people \"been looking for a year and 10 month and I must have applied to thousands of jobs\"\n\nThe big debate we are having is if this the worst job market ever or was the great recession worst.\n\nIt's not the AI, if it was AI there would be a market for AI engineers. And UI would still need to be build.\n\nWe are still loosing jobs due to lay offs, so it will not recover over night.\n\nI don't think it's just the IT, any good paying office job is like this, is what I think.",
          "score": 43
        },
        {
          "body": "Everything in tech has become saturated, but front-end web development has been hit the hardest. Lots of people jumped on that train in 2021-2022. You're competing with too many people now and not just in this country. Companies have realized WFH is doable, which means cheaper labor in foreign countries.\n\nAI is likely not the answer right now, but who knows how much of the ***potential*** of AI is also influencing hiring decisions right now. All I'll say is that based on all the factors (saturation, outsourcing, AI hype), I'm not as bullish about the whole interest rates hopium.",
          "score": 21
        },
        {
          "body": "You may need to open up your job search to in person positions. There are not many fully remote jobs out there.",
          "score": 22
        },
        {
          "body": "I'm in a very similar spot for nearly as long. I wouldn't say \"give up\" but you may need to make concessions on your expectations for what you do for short term money (like, working in-office or taking a pay cut or rank cut) and/or you may simply have to look a few years ahead to your next UI dev role. \n\nI hope you don't need to do anything severe in the end - keep applying for UI dev roles too - but you may get more results in your job search with this strategy.\n\nIt's not **YOU**. This job market is crazy. Not every developer is the same kind of developer, and some extremely talented ones with very impressive qualifications are needed in a few places, but they feel like the market comes to them because there are so so few of them &amp; every company wishes their whole dev team was full of 10x people. (it saves money!) 90% of the people on this forum are not the 10x type, but the few who are love to dive-bomb into threads and tell you there isn't a hiring/staffing problem right now, there's just your attitude problem. Their experience aside, I was laid off because literally our dev team completely ran out of workstream that week with our last site launch on the calendar for a long time. And the layoff numbers from the big companies are not imaginary.\n\nIn the web UI field, companies need these developers in general but most of them are dealing with hiring freezes or budget lockups. So many large companies are sitting on sites that are 15+ years old and falling apart. They're getting used to kicking the can longer on development projects. It's bad for business for them, it's not great for us either. Something will turn in corporate finance with interest rates and then they'll complain about a dev shortage again, and we'll be working after having rode this out.",
          "score": 6
        },
        {
          "body": "Got laid off a month ago. Also a UI dev. I've gotten rejected for silly reasons.\n\n1. I completed the takehome. But I was rejected for \"asking too many questions,\" despite part of the assignment was chat/collaboration in this email thread.\n\n2. I spent 8 hours on a takehome. Wrote a beautiful fullstack application using Vue and Fastify with Prisma. They said they loved it. The second interview was a leetcode question that I didn't solve in time so obviously....rejected\n\nPoint is... people suck at interviewing.",
          "score": 9
        }
      ]
    },
    {
      "title": "Web Dev: Can Anyone Advise On What To Do After I Was Just Fired?I'm",
      "body": "So, today after a few weeks of steadily later clock out times at work and more and more complaints from my boss, he called me up a half hour into my drive home and let me know that they are closing down my department.\n\nA little backstory: about two years ago, I was in a bad place with my previous job and decided to take some YouTube and online web development courses. I was very lucky in that I really only had to get the basics before I was good *enough* to find a position. A year later I got in touch with a few recruiters and after moving cities to St. Louis Missouri in 2020 managed to lock down an in-house WebDev position working with Shopify for a local company.\n\nI was always pretty proud of nailing down the position because, to be honest with you, I definitely oversold myself during the interview, definitely went in there knowing less than I needed to, and somehow still manage to make it work for the last year. But I guess in the last week, my boss noticed that I have been turning things in slower than some of the freelance web developers of more experience that he's worked with , and decided that they would shift to using a local firm instead of paying me.\n\nI now have about a years worth experience working with liquid, HTML, CSS, Shopify apps etc, plus some experience from before all this where I worked with WordPress, but I’m not exactly a hard-core coder, and I have really mostly a passing understanding of JavaScript, although I will be brushing up on that, and I’m just kind of wondering what I should do next. From what I’m told, the job market right now is pretty good, and I do feel like my experience is going to help me especially if I manage to sell myself the way I did last time. I’ll be applying for unemployment next week but I guess this whole thing caught me kind of by surprise and I’m just wondering what you would recommend if anything. I also have a lot of copywriting and SEO experience but had a bad time making money with that which is why I switched. Ideally I'd like to stay in my lane but I'll admit I'm nervous.\n\nAm I screwed? Any ecomm devs want to weigh in?",
      "subreddit": "cscareerquestions",
      "score": 128,
      "url": "https://reddit.com/r/cscareerquestions/comments/qo0jf4/web_dev_can_anyone_advise_on_what_to_do_after_i/",
      "comments": [
        {
          "body": "I think that there might be a misunderstanding for what a standard “WebDev’s” skill set typically is. You listed platforms (i.e. Shopify and WordPress) and HTML and CSS as your experience but those are just smaller pieces of more important skills. As you begin to search for a new role, I think you will find that they will want you to have a much stronger understanding of JavaScript than just a passing one, even for a junior role. \n\nBeyond understanding an actual programming language (not trying to start a debate but CSS and HTML do not equal JavaScript) you will want to learn basic code practices and patterns. \n\nI would also recommend throwing your effort towards learning JavaScript and possibly a common front end framework such as React, Vue, Angular (probably not this). Your experience will definitely help you, but your skill set will hurt more right now. \n\nI am not saying this to harm, only to help you see how you can prevent it from happening again.",
          "score": 171
        },
        {
          "body": "I would recommend filing for unemployment immediately and not next week",
          "score": 107
        },
        {
          "body": "dive into javascript ASAP and file for unemployment. The odin project is a great resource",
          "score": 13
        },
        {
          "body": "I would probably dive into a JavaScript / web dev class on udemy. What were you doing for a year just using html and CSS?",
          "score": 32
        },
        {
          "body": "Were you fired or laid off? You mention they are closing the dept so I’m assuming lay-off and other people are getting laid off.  It sounds like they rather use contractors than you. If you’re full time, you prob cost more to your company. It sounds like your company just didn’t know how to communicate their expectations to your or groom you and their decision was basically a purely financial decision. So I think you shouldn’t have to beat yourself down. Your skill set is fine as long as you can solve problems. I’ve never got hired explicitly for the skills I knew but for my ability to solve problems in areas I didn’t know. Good employers hire you for your potential to build something and not your ability to tell them how many types of hammers you know how to use.",
          "score": 9
        },
        {
          "body": "I would not call a year and a half of winging it and overselling yourself \"experienced\".\n\nHave you considered being more humble, taking a junior role somewhere, and spending some time actually learning?",
          "score": 63
        }
      ]
    },
    {
      "title": "Did I did something wrong ?",
      "body": "Applied to a senior full stack SWE co-founder position today. In the job description they mentioned it’s equity only at 1-2% and said they should offer compensation in a few months. So I decided to apply as depending on if they were serious and if the circumstances made sense it would be something I would consider.\n\nAfter a few hours I got a message from the CEO to set up a day to have a technical interview with their head of engineering which would be a pair programming session of building a React with Typescript app. They wanted me have the build system and environment installed before the interview so we could dive right in.\n\nFor me I wasn’t ready to spend time on a technical interview until I hit more information about the current state of the company etc…\n\nAs currently it was just a work for free type of role due to it being equity only. So I politely explain I had a few questions before I do the technical interview to make sure it’s a good fit as to not waste anyone’s time.\n\nSo I listed off a few questions that weren’t answered in their job description or their site. Which I thought would be fair/understandable questions from anyone considering this type of role.\n\nI asked what stage of funding they were at to try and gauge if taking the position is worth the risk ?  To myself I’m wondering if they have seed and if so do the founders have skin in the game.\n\nOr if they are trying to secure their first round what’s their target evaluation in order to gauge what the potential 1-2% stake would be worth.\n\nAgain, I didn’t actually ask  these questions, but they questions I was hoping to get answered through the conversation.\n\nI also asked what kind of projects they saw me working on as the company website only explained they used AI to gather vitals from B2B platforms like Shopify, Hubspot, etc…\n\nSo would I be working on a single page admin portal or rebuilding their basic marketing website as their current one didn’t look great and looked like it was quickly built with a drag and drop editor. Again I didn’t say this I just was hoping to get this answered throughout the conversation.\n\nI also asked about their long term and short term vision/plans. Hoping to see what their high level goals where to see if it aligned with how much risk I was willing to take on.\n\nMy final question asked about what the expected salary would be once it did start and when he thought they would be able to provide comp, benefits, etc… as a few months was pretty vague.\n\nAnyways I pretty quickly received a response back from the CEO saying, “Quit wasting my time and do your homework.“\n\nTBH I was kind of taken back, but went back through the JD and their website.\n\nI had missed a link to a video explaining their “vision” it was just one line of text in the wall of text in their JD.\n\nI responded apologizing for missing the link to the video to their vision, but explained none of my other questions were answered on their site or in the JD and I was trying to get some more info to make sure it was a good fit as only taking equity comes with some risk.\n\nHis response was, “While I think it’s clever you programmed a bot to apply for jobs, you’re wasting my time as you clearly didn’t read my job description.\n\nI explained that these questions were not answered as I previously stated and they are all reasonable questions.\n\nI then said if someone is not asking these questions they probably wouldn’t be a good hire.\n\nHe responded “we just launched and this is an equity only position. Which means you clearly didn’t read the job description and are now just wasting my time.”\n\nI said thanks for responding the way you did, it was a huge red flag and the fact you taken these question so personally and have a super basic site the doesn’t go into any detail makes you and your compan suspect.\n\nHe responded Im not angry I sick of west coast arrogance. You clearly didn’t read the JD. The only thing you’re are right about is the red flags as you clearly are one. \n\nDid I ask questions I shouldn’t have or respond in correctly here?\n\n\n",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1c1vhvh/did_i_did_something_wrong/",
      "comments": [
        {
          "body": "Seems like a vaporware company with an asshole CEO. You asked reasonable questions and he was a dick. Forget about it and move on - it's not worth any headspace.",
          "score": 24
        },
        {
          "body": "I forgot he also said, “Don’t forget the name, you’ll be seeing it everywhere really soon!”\n\nThen blocked me on Linkedin.\n\nThe name of the company is [SQOR.ai](https://sqor.ai)\n\nSo watch out for these guys!",
          "score": 10
        },
        {
          "body": "Be glad he revealed his true personality so quickly. Company will probably fail anyway with a clown like him at the helm.",
          "score": 6
        },
        {
          "body": "I did a rough scan, I'd say the biggest thing you did wrong here is you tried to follow-up with him after he said\n  \n&gt; “Quit wasting my time and do your homework.“\n  \nwhat exactly are you trying to accomplish after that? you're not going to flip that no-offer into a offer, so just move on\n  \nall your rest remaining back and forth with him is just useless chatter/waste of time",
          "score": 2
        }
      ]
    },
    {
      "title": "SF Bay Area: Just got fired from job.",
      "body": "Hi,\n\nThe purpose of this post is to discuss about what just happened in my professional career and what I plan to do. And get any great inputs from smart people on the internet :)\n\nA couple of days ago when I got back from PTO I saw a meeting with my manager and HR. I sort of knew I going to be let go. I was placed on probation one month ago. The startup I was in had a bad quarter and management fired half of the e-comm team. And of the development team, my manager liked me the least. Working there was hell. Each day my manager would message me mean things on Slack such as this is not good enough and unacceptable. And that he is disappointed in me. Yelling at me at 3:30 PM and then telling me this needs to be completed EOD frequently.\n\nFor the past couple of months I been feeling so burnt out. Working at this startup has been so uninspiring. I am not even sure why I joined. The technology we use is basically a JavaScript React + NextJS app with Shopify and a content management system. No time is given to clean up any tech debt. Felt like the CEO is fursated the e-comm business isn't competitive with their competitors. As a result, shoving down random feature requests to the development team. And periodically having our feature development reverted. Any ways, just really burnt out because deadlines expectations were so unrealistic within a 40 hour work week. Things were so disorganized.\n\n&amp;#x200B;\n\nAnyways, just super burnt out and depressed. My lease for my apartment ends this month. Was thinking about taking a pause and moving back in with my parents for 2 months and just play video games.\n\nOne lesson I learned is I am never joining a startup ever again.",
      "subreddit": "cscareerquestions",
      "score": 232,
      "url": "https://reddit.com/r/cscareerquestions/comments/qmh2zu/sf_bay_area_just_got_fired_from_job/",
      "comments": [
        {
          "body": "If you find yourself in a difficult place in your life, we urge you to reach out to friends, family, and mental health professionals. Please check out the resources over at /r/depression, /r/anxiety, and /r/suicidewatch. Feel free to [contact the /r/CSCareerQuestions mods](https://www.reddit.com/message/compose?to=%2Fr%2Fcscareerquestions&amp;subject=&amp;message=) for more information or help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Sorry to hear you’ve been let go.\nI don’t think the lesson should be ‘never join a startup again’ it should be ‘always keep your CV updated and start applying for jobs whenever there’s a massive layoff’. \n\nFrankly it sounds like your previous company is going under anyways so I suspect you just avoided a possible pay reduction, late payments, then no salary, *then* losing your job anyway.",
          "score": 194
        },
        {
          "body": "I mean, there's usually another side to the story...\n\nBut holy crap that sounded like a disaster of a workplace. Abusive boss, lack of clear processes, incompetent management. Them firing you was a _favor_.",
          "score": 99
        },
        {
          "body": "One of the most successful people I know in tech was fired from several jobs.\n\nAnother was suffering in his role frustrated for years - got fired, then finally moved onto a different company where he's done amazing.\n\nHang in there, once the immediate emotions are gone you'll realize this probably was a good thing as we often don't realize how terrible our environments are until they forcibly change.",
          "score": 39
        },
        {
          "body": "It's difficult to shake off a toxic workplace like the one you were working at. If you can do what you said, it might not be a bad idea. Take enough time off so you can get yourself back emotionally to where you need to be.\n\nAside from playing video games, you might also want to learn a new technology such as a new language, DB, framework .. whatever you're interested in.  It'll do wonders to restore your confidence and get you back in the game for interviews.\n\nAnd yeah, startups can be a minefield.",
          "score": 17
        },
        {
          "body": "A lot of people will talk about people nowadays being snowflakes and not taking the \"hard love\" approach to management, but IMO there is zero excuse for any manager yelling at an employee. People years ago only dealt with it because a job was often viewed as a job for life, and a definition of you as a person. Nowadays, job hopping is the norm, and it's not uncommon to see people with a decade of experience and 6/7 roles on their resume/CV.\n\nPut it this way - if you were to be as mean to a random person on the street, what's the likelihood of them popping you in the jaw? If it's not 0%, then it's over the line. If it's over 50%, your position at said company is untenable. I've worked at toxic companies like this, and even in instances where a manager or director has said something truly dodgy HR will side with the company and will simply offer the lesser employee a way out to save face. At a startup you're doubly-fucked, because HR usually starts and ends with the founder, and they're often woefully unequipped to handle such a role.\n\nAs others have said, your gut is almost always right when it comes to things being off, and while it stings right now you'll have learned as valuable a lesson as you can possibly learn in working as a Software Engineer, and that's to evaluate your options at all times.\n\nThis goes against conventional wisdom, and some will probably reply to say that I'm wrong - but more often than not people outlive small companies/startups. If you have a manager that treats you like shit, tell them to stop. If they don't, tell the founder to make them stop. If they don't deal with it privately, make it known to the rest of the company that the founder isn't dealing with their shit. Future opportunities go both ways, and that manager that treated you like shit in the past might want a job at a company you're one day working at. Similarly, a company might treat you like shit, and you might join a new company that uses the previous company as a vendor. Both situations happened to me - my ex-manager didn't get the job, and the consultancy that took our clients from under our nose and let an entire office go found that their biggest success story had just put out a call to tender. You won't win every battle, but the software industry is weighted heavily towards the employer, so the worst thing you can do is take unnecessary shit.",
          "score": 12
        },
        {
          "body": "I think this is a blessing in disguise for you.  \n\n\nTake some time to spend with your family and enjoy the holidays. As mentioned, brush up your resume and start interviewing after the holidays.  \n\n\nIf people ask \"why did you leave your previous job?\" mention that you wanted to take a break and spend time with your family before pursuing your next opportunity. Mention that the company was not a good fit for you.",
          "score": 8
        }
      ]
    },
    {
      "title": "How important are side projects for getting internships?",
      "body": "I'm an incoming first-year CS student at the University of Waterloo, and my goal is to a SWE internship at low-FAANG/Big N level companies for summer 2026 (think Shopify/Amazon/Microsoft).\n\nI've heard a lot of advice thrown around about how side projects are essential for getting internships, especially if it's your first internship and you haven't had any prior experience. Still, I can't help but wonder if they truly matter, so I've compiled the following two questions to help answer my inquiries.\n\n1. Say you list whatever projects you've made, especially those that leverage the tech stack the company uses, in your resume. How much of an advantage will you have compared to someone who doesn't have any projects but states that they know the languages on their resume? Assuming both applicants have no work experience, specifically for internships.\n2. If the side projects have a significant impact on whether you're given an interview or not, will the recruiter open and look at the side project to determine whether it works, or will they only look at the tech stack as well as the functionality that you've provided on your resume?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1m6062j/how_important_are_side_projects_for_getting/",
      "comments": [
        {
          "body": "If you have nothing (no prior experience) it’s useful as a conversation piece to differentiate you from all other candidates.\n\nMost important is getting your foot in the door to interview and when you do to come off as passionate and easy to work with and eager to learn",
          "score": 2
        },
        {
          "body": "Bro how delusional are you? You're not getting any Big N or FAANG offers during your first co-op without internships or projects. You have NOTHING to offer.\n\nYou're not even gonna pass resume screening.",
          "score": 2
        },
        {
          "body": "I think projects are quite helpful for internships.  Group projects especially so, because they also help build and demonstrate soft skills.",
          "score": 1
        },
        {
          "body": "yeah... I'm from Waterloo CS myself and I can tell you it's important but you're probably not gonna get it as 1st year\n  \n3rd year or 4th year? maybe\n  \nyour competition is not other 1st year CS students, your competitions is global",
          "score": 1
        }
      ]
    },
    {
      "title": "How can I find new SWE role after lay off 7 months ago?",
      "body": "Unemployed for 7 months now.\n\nCan barely land an interview, and when I do l, I’m always told by recruiters that my interviews go well and they want to move on but they NEVER do and I get ghosted.\n\nStarted off my career straight out of college working at a big company for a little over 2 years.\n\nI also have experience working with a small team with 2 other developers on Shopify apps that have been deployed and being used today.\n\nI have built my own full stack mobile app that I am planning to deploy soon and is shown in my projects/public GitHub repo\n\nI have a portfolio website showing off my work.\n\nWhat do I have to do to be hired?\n\nThis is killing my mental",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/1kk96s7/how_can_i_find_new_swe_role_after_lay_off_7/",
      "comments": [
        {
          "body": "Honestly, it sounds like you've got some solid experience under your belt. To increase your chances of landing an interview, try tailoring your resume and online profiles to match the specific job requirements more closely. Also, make sure your portfolio website is showcasing your best work in a clear and concise way.\n\nOne thing that helped me when I was in a similar spot was using this AI tool that listens to the interview questions and suggests responses in real time. It's not a guaranteed fix, but it made me feel more confident. If you're interested, I can share it with you.\n\nJust remember that job searching can be a long and frustrating process, but don't give up! Keep pushing forward and focusing on your strengths. You've got this, and the right opportunity will come along when the time is right.",
          "score": 3
        },
        {
          "body": "Apply to everything and everywhere, don't be picky. When your unemployment gap gets too large, it's over. And then you gonna have to make a choice - Masters or career change. I was Mech Eng with 1 year gap and Masters + COVID boom saved me. IDK what would I do now. Maybe even consider working at AMZN warehouse and move to SWE somehow.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is it common to switch tech stacks a lot?",
      "body": "I currently work in a consultancy. I feel like I’m CONSTANTLY changing tech stacks and never have enough time to really learn any of them well. In my 2 years at this current company I have done the following (I’m listing frameworks to be dramatic because I’m whiney.)\n\nPython, Django, PHP, WordPress, Laravel, React, Vue, C#, .NET, Ruby, JavaScript, Shopify (LiquidJS), and Terraform (Including getting familiar with AWS services.)\n\nI’m leaving out things like MySQL/Postgres and CSS preprocesses because I feel they’re implied.\n\nWhile this all sounds great, it also means I’m spending SHOCKINGLY little time on any given technology.\n\nI’m over 3 YoE and I feel completely useless. I know I could pick up any of these and work in them, but i feel like my ability to interview for any specific one of them is dead in the water.\n\n\n\n\nAny recommendations? Is this normal? Is this as big of a problem as I’m making it out to be? Or am I just being worried over nothing? Do I just… pretend I used a technology my entire time at a job when interviewing?",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/1f278b0/is_it_common_to_switch_tech_stacks_a_lot/",
      "comments": [
        {
          "body": "That is totally normal for consulting. I know it sucks at the time, but people in other jobs are stagnant and may not go super deep either with the tickets they get. It really is a blessing to have experience with many different older and newer tech stacks even though you don't go super deep.",
          "score": 12
        },
        {
          "body": "[deleted]",
          "score": 22
        },
        {
          "body": "In embedded r&amp;d (automotive) we rarely made it to more than 2 years with the same stack. It was usually what the customer wanted. Mostly C or C++ with JavaScript later, and even embedded Java, OS was QNX, Linux, homemade, or Windows CE, Ui was all over the place, development environment all over the place... Then a few years of Python and autonomous driving / computer vision, Azure... \n\nFinally joined a large healthcare administration and insurance company writing enterprise data management software. All Microsoft stack happy as a clam till last month where management dropped a React projet on out lap and it's been LMAO from there. Three developers with over 100 years of experience among us trying to unravel UseEffect and so on. Never a dull day.\n\nFocus on learning concepts rather than languages or development environments.",
          "score": 6
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "It really depends.\n\nIn your early career, IMO, it's best to focus on a single tech stack and learn it really well. Learn where all the dark corners are, and all the standard ways of doing things. The benefit of this, is the next tech stack you learn for a one of project you'll have something that you can really compare.",
          "score": 1
        },
        {
          "body": "Much earlier in my career I worked for a large tech agency, not only was it normal that we'd be on a completely different tech stack each project, we were sold as if we were experts in those tech stacks (even when we had never touched it once) . Jumping from a Cold Fusion project, to Java Server Pages/Java Beans, to a ASP.net project all in a single year. And the clients were massive brands, including government agencies (like McDonald's, Department of Treasury Bureau of Engraving and Printing, or the USPS).",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "How I landed my first SWE job without CS degree &amp; bootcamp",
      "body": "Long time lurker, first time posting (using a new account) \n\nSome background: I do have a business degree from a state school. My first job out of college was in the digital media industry. I have some friends in the tech industry I consulted before making this decision.\n\n6 months ago, I quit my job as a video producer/editor to pursue software engineering. I had already been studying after work hours and weekends for about 4 months. I considered attending bootcamp, but by the time I left my job, I felt I was already far enough along that if I went to bootcamp I wouldn't be getting the most out of it. Not to mention the high cost and bad timing (quarantine), so I decided to keep going with self learning.\n\nI treated programming like my day job, studying and building projects from 9am - 8pm, and sometimes even on weekends. I used online resources such as freecodecamp, frontend masters, and scrimba to learning this stack:\n\nHTML/CSS/SCSS, JavaScript, React, Redux, Typescript, Node, Express, MongoDB, GraphQL, etc.\n\nI loved learning new technologies, but I loved building projects even more. That's when I was really able to learn and be comfortable with programming languages and frameworks. I found myself really immersed in the world of software engineering, exploring my creativity through coding.\n\nOne of my favorite projects I built was a dog breed quiz. The application fetched ten random images from a dog images API and generated multiple choice answers for players to choose. Points were calculated by the amount of correct answers and the time it took to complete the quiz. A scoreboard allowed players to see where players' dog breed knowledge stood. \n\nMy most recent project was one I was really proud of. I built an e-commerce site for my dog. I found this project really challenging because I took on learning GraphQL, TypeScript, SCSS, and Shopify's API. \n\nI showcased all 12 of my projects on my website portfolio. I knew that since I never had formal education in computer science, I needed to stand out somehow. \n\nThe job hunt started in late June. I was pretty discouraged since it didn't seem like there were many junior positions (compared to countless senior opportunities) due to Covid-19. I totally get it; onboarding and training junior programmers is tough!\n\n65 applications, 3 interviews later, I got a job as a front end software engineer! The interview process consisted of a phone screen, React technical interview, and a cultural interview with the CTO.\n\nThis journey has been stressful, yet fulfilling, and I can't wait to start my career in the tech industry. I've read a lot of posts here on this subreddit, and it has made me feel less alone and I thank you all for that :)\n\n\\*EDIT: Previously wrote 5 interviews, but actually had 3 interviews. 1 interview at a company I passed all three rounds. Counted that into the 5. My apologies.",
      "subreddit": "cscareerquestions",
      "score": 101,
      "url": "https://reddit.com/r/cscareerquestions/comments/ic5akb/how_i_landed_my_first_swe_job_without_cs_degree/",
      "comments": [
        {
          "body": "Thanks for sharing. Do you mind posting your portfolio? From your job hunt experience it seems like your projects are pretty impressive.",
          "score": 12
        },
        {
          "body": "I’m in similar shoes. I also went to school for business but also did mad projects, fullstack plus ML. I did get a job as fullstack and worked there for couple of years but the department closed. \nNow interviewing but I can never bypass those online coding exams. How did you fare in those?",
          "score": 6
        },
        {
          "body": "Wow 12 projects is insane, you finished that all and found a job in 6 months? Congrats and props for working so hard. Mind if I ask what was your interview prep like?",
          "score": 4
        },
        {
          "body": "5 interviews from 65 applications? That is absurd. Can you share what your resume looks like? Its very hard for someone who even has 1-2 years of work experience to get that high of a response rate.",
          "score": 23
        },
        {
          "body": "I think this totally reinforces that all you need to do is stand out through hard work. Congrats. Did you grind much leetcode or did you mostly go for front end type jobs, which I would assume has less leetcode?",
          "score": 8
        },
        {
          "body": "Congratulations!!! That’s awesome. It all pays off once you get that first job.\n\nWhat were some of the React questions they asked during the technical interview? Do you have any tips for the interview process?",
          "score": 3
        }
      ]
    },
    {
      "title": "Advice for a laid off Sr. Dev",
      "body": "I was recently laid off from a senior developer position. I’d been at the same company as a dev for 10 years — all the way from Jr. I’m looking for new positions, but most of them that are close to my current skill set require something like C#/.NET and React (so much places want React). Mostly I’m just behind on what employers are looking for.\n\nI’m planning to spend the next 6 weeks learning some new tech and training on some leetcode, for interviews.\n\nI am thinking to pursue C#/.NET and React. I’ve worked with and enjoyed both of these technologies before, but definitely need more learning to seriously apply for jobs.\n\nSo my question is, what skills would you recommend and what would you do?\n\nA little more background of me:\nDuring the last few years I worked with Angular (front end), lots of vanilla JS, Drupal CMS (so some PHP here and there) and also spent time with Shopify (which I don’t care to work with ever again). I also worked on a few Node.js+Express projects.\n\n_______\n\nThanks in advance everyone.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1bx3b0d/advice_for_a_laid_off_sr_dev/",
      "comments": [
        {
          "body": "You seem to have settled on technologies that are in demand, which is always a good start.\n\nHowever you don’t need to take 6 weeks to do some learning, you need to be actively applying and interviewing while you’re learning. Even if you knew these technologies well, it would probably take you at least 6 weeks to land a role.\n\nYou will get feedback from the interviews and be able to direct your focus at things you need to do to get a job instead of just playing around with some hobby React projects at home.",
          "score": 9
        },
        {
          "body": "&gt;I am thinking to pursue C#/.NET and React.\n\nThat sounds a little silly to me. I would apply for anything I have any experience with.\n\n&gt;what skills would you recommend and what would you do?\n\nLook at what's in demand in the areas you want to work? Wtf?",
          "score": -2
        }
      ]
    },
    {
      "title": "Interview Discussion - January 18, 2018",
      "body": "Please use this thread to have discussions about interviews, interviewing, and interview prep. Posts focusing solely on interviews created outside of this thread will probably be removed.\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Monday and Thursday at midnight PST**. Previous Interview Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Interview+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).\n",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/7r7ztr/interview_discussion_january_18_2018/",
      "comments": [
        {
          "body": "[deleted]",
          "score": -1
        },
        {
          "body": "Just got an interview schedules for tomorrow after today's job fair. Was totally not expecting it, and I'm totally ill prepared. Should I cram or rest up and hope for the best?",
          "score": -1
        },
        {
          "body": "I'm having my first host interview tomorrow for Google SWE internship. Any last minute tips? ",
          "score": 1
        },
        {
          "body": "Which hedge funds/prop shops do fall internships?",
          "score": 1
        },
        {
          "body": "I'm being ghosted, should I e-mail the recruiter?\n\nLong story short: Applied for a position, had a non-technical interview with recruiter, he e-mailed me two days later to proceed with the process, and copied the technical guy that would do the second interview.\n\nHe asked on the e-mail for the guy to contact me directly to set up the second interview and for me to send him a copy of my resume. So I did, but the guy never replied or contacted me.\n\nIt's been over a week, should I follow up directly with the guy? The recruiter? Let it go?",
          "score": 1
        }
      ]
    },
    {
      "title": "Navigating Career Paths: From Freelance &amp; No-Code Platforms to Full-Time Tech Roles",
      "body": "Hello r/cscareerquestions,  \nI'm in a bit of a unique position career-wise and am reaching out for guidance and perspectives on making a significant transition. After graduating from General Assembly's Full Stack Software Engineer program in 2018, I've largely worked as a part-time freelancer focusing on no-code platforms like Squarespace, Shopify, and Webflow (these are the platforms my clients have preferred). While these projects have allowed me to hone my design and development skills, they haven't offered much opportunity to apply the full extent of my coding training in a professional setting.  \nDespite this, I've stayed committed to learning and growing in the field, currently diving deep into Remix to find synergy with my Shopify clients, particularly as it relates to their Hydrogen platform. However, I'm at a crossroads:  \n**Freelance Web Designer &amp; Developer**: My freelance work spans a variety of clients and projects, where I've leveraged modern design tools and coding in HTML5, CSS3, and JavaScript, alongside extensive use of no-code platforms like Squarespace, Shopify, and Webflow.  \n   \n**Educational Support Role**: I've also been employed supporting students part-time in a nationwide coding boot-camp, helping them tackle coding challenges and understand complex concepts, which has been incredibly rewarding and has kept my coding skills sharp.  \nAt the same time, I've maintained a full-time job in an unrelated field for personal reasons. Now, as I look to transition fully into a tech career, I'm grappling with a few concerns:  \n**Experience Level**: With my background being a mix of no-code platform expertise and some coding projects, I'm unsure about where I fit on the experience spectrum. Does my work with no-code solutions and freelance projects position me beyond entry-level roles, or should I still be considering junior/developer positions?  \n**Role Suitability**: I'm torn between seeking traditional developer roles that would allow me to utilize and grow my coding skills more extensively and looking for a position that blends my current skill set of no-code development and direct client engagement. Do hybrid positions that cater to this mix of skills exist? If so, what should I be looking for?  \n**Transitioning Advice**: How can I best prepare for the job search and interview processes, especially in terms of presenting my somewhat unconventional experience in a way that resonates with potential employers?  \nI deeply appreciate any advice, insights, or shared experiences on how to navigate this transition, particularly from those who might have found themselves in a similar situation. How do you evaluate your experience level and find roles that truly fit your skillset?  \nThank you for taking the time to read and respond. Your guidance is invaluable to me as I embark on this journey.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1az04z0/navigating_career_paths_from_freelance_nocode/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Shopify Winter 2021 Internship",
      "body": "has anyone heard back from the 2021 winter intern program for shopify? if so lmk! :)",
      "subreddit": "cscareerquestions",
      "score": 11,
      "url": "https://reddit.com/r/cscareerquestions/comments/j14prh/shopify_winter_2021_internship/",
      "comments": [
        {
          "body": "Haven't heard back yet and was also under the impression that we'd hear something on a rolling basis. Not too hopeful anymore since now it's all up-to Oct 5th, you'd think they'd keep the last day just for rejections... oh well 🤞🏻\n\nEDIT: just got the email for the life-story interview!!!",
          "score": 7
        },
        {
          "body": ":D i'm waiting to hear back too. Best of luck :)",
          "score": 3
        },
        {
          "body": "Good luck that’s all I can say. They typically have 5000+ applicants for internships that take less than a hundred people.",
          "score": 3
        },
        {
          "body": "a shopify recruiter looked at my linkedin about 2 weeks ago, nothing since. I'm assuming they will start later this week or send all of them on the 5th . . .\n\neven though the email said it was a rolling basis so I thought they would've started sooner . . .\n\n&amp;#x200B;\n\nedit: FAT L.",
          "score": 3
        },
        {
          "body": "Also waiting to hear back. They said they were going to schedule life story interviews on a rolling basis, so I'm not holding my breath on a positive update come October.",
          "score": 3
        },
        {
          "body": "In the application confirmation letter I received, they stated that applicants will know whether they have moved to the first interview stage no later than October 5th. Do they typically accept/reject before this date? Or are they just going to roll out a bunch of decisions on the 5th?",
          "score": 2
        },
        {
          "body": "Same here, waiting. Fingers crossed,  I am not a CS degree candidate and looking to transition from academia to industry. One of the few programs that I am eligible for. :)\n\nBTW, anyone for data science intern position? Did you submit your own project or did you do the questions that they had?",
          "score": 2
        }
      ]
    },
    {
      "title": "Choosing between US and Canada job offer",
      "body": "Hi, I am a developer from Toronto with 2 yoe at startup. I recently passed interviews for two roles -  one at MS Redmond and another at Shopify. There is a couple of concerns choosing one .... If I'm trying to see from all different perspectives not just limited to total compensation\n\n1.  The role at MS is responsible for developing internal tools for their analysts and focuses more on FE, whereas the role at Shopify expected to work on core engineering, payments I think, and focuses on BE. The latter sounds more motivating to me.\n\n2. the team is quite small ~4 people at MS, and I'm responsible for pretty much the entire FE by myself from ui/ux til the end. Like DIY. It also seemed it's the first time for the hiring manager to hire externals throughout his ~20 years at MS... It reminds me of my internship at another major corporate where I was the first person worked for my manager. I personally experienced lack of mentorships and learnings back then.\n\n3. I became pretty defensive after I got my verbal offer rescinded a couple of months ago from another large tech company that was on my list. At that time, I tried negotiating and asked if I can get ~$2000 increase. Offer escinded right away.\n\n4. I currently have Shop offer in my hand in written with start date, which needs to be completed by the next week. For MS, I just finished discussing offer and am waiting for verbal offer. There will be background checks and etc which would take ~ a month or two. If I ditch Shop offer, I become highly vulnerable state based as no one know what can happen like #3\n\n5. Relocation from Toronto to Seattle. Technically no issues at all to land in the US alone. But it adds some complexity. Like visa, housing, banking, mortgages, etc, all basically from scatch since I barely know about life in the US. Also, my family and home won't move out of Toronto any time soon. If I were in Vancouver, I'd be less hesitant as I can cross the border by car and visit my family.\n\n6. Majority of people I came across on says definitely MS. I know it has far better reputation around the world and looks good on resume. However, as I mentioned in #2, I am concerned about limited career growth, learning, limited mentorship etc... In addition, internal transfer is as hard as like new hires.\n\n7. Both companies have a decent ratings on glassdoor.\n\n8. Pay is definitely higher in the US, no doubt. I also hear less tax, less COL.\n\nSorry it's long but I appreciate any insights you provide. It would help me make a decision",
      "subreddit": "cscareerquestions",
      "score": 18,
      "url": "https://reddit.com/r/cscareerquestions/comments/rz0zw0/choosing_between_us_and_canada_job_offer/",
      "comments": [
        {
          "body": "Disclaimer: I work at MS.\n\nBefore MS I worked at IBM. I haven't worked in a small tech company before.\n\nOf the two, MS offered far more mentorship opportunity and growth. MS puts a lot of value in growing engineers well, it is their primary source of senior and principal devs. Most are grown from junior devs and folks are rarely hired into these roles. As such, growing our devs to that level is one of the primary (and I really do mean primary) objectives of senior devs. We are highly incentived to help our juniors grow. \n\nOf all companies I've interviewed with or worked, the people at MS have been by far the best. I have been here 4 years and my #1 reason for staying is the people. Not just my coworkers, there is not a single person in my 500 person org that I have had a bad interaction with, everyone is genuinely good people and looking out for each other. That's not to say bad apples don't exist, but unlike many companies culture fit here tends to include being a *good person* and not just being an output machine.\n\nI will say that switching teams is pretty easy though. Yes you have to interview just like an external team. If you already know the hiring manager and they already want you then it's largely formality (though do give the interview your effort or the teammates might reject). Even if you don't these interviews are often easier and more relaxed. \n\nAnyway, rambling on now. Just wanted to give some MS insights.",
          "score": 18
        },
        {
          "body": "&gt; I became pretty defensive after I got my verbal offer rescinded a couple of months ago from another large tech company that was on my list. At that time, I tried negotiating and asked if I can get ~$2000 increase. Offer escinded right away.\n\nNow you kind of need to tell us which company",
          "score": 4
        },
        {
          "body": "Firstly i dont know how taxation will work since you am presuming you are A canadian citizen. But if its Seattle, Washington, I dont live there, but Washington is one of those states which doesnt have a State Tax.  But it rains a lot there. So if you do make a move it will be worth it. \n\nNow regarding mortgage normally the basic rule for US citizen is you earn say 65k a year (which is a min) and have a good credit rating from the credit bureaus which is Experian, TransUnion and Equifax. Which in a nut shell say everything is good then you might get approved for 150 to 200 k and the info I am giving might change as in am not a tax advisor or financial consultant but if you do plan to move dont get a mortgage yet, build a rental record by renting out a place where they probably might need a letter from your company and two pay stubs. \n\nWhile you build it, get a secured card, because i do not know how much weight it holds for US banks to verify a canadian citizen with their credit scores. Hence put in say like a 1000 dollars which will go into a savings account but against it you will get a card to use. After 8 months to a year they should turn it into a unsecured card and give your money back. \n\nMy suggestion speak to a TD rep in canada as it operates both in us and canada so they might have a better understanding of it. And sorry to say Canada has horrible cellphone plans. You might save money there also. \n\nI personally payed 500 usd to att to open an account and get a number and held it for 2 years to build credit. \n\nOnce thats out of the you can go for a mortgage or you can get your own LLC license and get a house on mortgage under the LLC and rent it out while living in there which pays your rent. \n\nAs for career wise, You need to ask your self where do you want to be. As the MS role will actually give you experience to become a decision maker in the future as its more in management and the know hows and a further increase in your role to any company because the invaluable experience you are going to get. You can tend to grow horizontal and vertical. \n\nWhile for shop it might be core, but you will work with product itself to make it better. Yes you will grow sideways but not vertically. Because if vertically is needed you need possibly to study on courses related to your subject and work in order to get it. \n\nUnfortunately many people in the world think lets this is my job and thats it but do not want to think from all angles. Let me put it this way, you walk in to buy a laptop or any given product in the market. The sales person is trained to sell you the product saying all the advantages of the product as in how good it is and they are successful in it but they are just like any other salesman. However a good salesman will first talk about whats bad about the product or what warranties are covered like right from the make and model of the device and how it is actually benefitting you in your daily lives. \n\nI personally am a follower of this quote “a jack of all trades is a master of none, but oftentimes better than a master of one.” I am a computer science graduate where my major was in programming but I worked in operations, administration, Technology, hr, customer service and in many different depts and in many hats except accounting. I just started my own company before I liquidated everything to move to usa and after 7 years i finally got a decent job which is good but i joined in because i believe my growth will be further in the company. And mds can possibly provide you that. \n\nFor reits i invest in fundrise which canada doesnt have and if they do the buy in price is high. My personal suggestion move to MDS. However it is your decision what and how you want it in life as in your career growth. Feel free to message me if needed.",
          "score": 4
        },
        {
          "body": "\n\nAsk Microsoft to give you an idea on what salary to expect. Let them know you need to make a decision. \n\nUnless the pay is jaw-droppingly high, I would lean towards taking the Shopify offer and staying near your family.\n\nShopify is a great company, growing fast and well positioned in the marketplace.  \n\nHave you looked at levels.FYI to get a sense of how your offer compares?\n\nIt’s uncommon for companies to revoke offers with no warning so don’t let one bad experience push you to jump to fast if you are not sure. On the other hand, Shopify will not wait a couple months so you do need to push Microsoft to get you salary numbers.",
          "score": 2
        },
        {
          "body": "&gt;...I tried negotiating and asked if I can get ~$2000 increase. Offer escinded right away.\n\nWhat large tech company would rescind $2000 difference?  I could kind of see it if it was $20K.  But not $2000.  The interview loop alone probably cost more than $2000, between scheduling and productivity hits.  Much more if external recruiters were involved.",
          "score": 1
        }
      ]
    },
    {
      "title": "Shopify case study interview",
      "body": "Has anyone gone through the case study interview at Shopify for solution architect role?\nI could only find info regarding the PM case study and it wouldn't be the same",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/168up5r/shopify_case_study_interview/",
      "comments": []
    },
    {
      "title": "Completed final interview and saw the job reposted on LinkedIn",
      "body": "Well, sadly just as the title says. \n\nI had 4 interviews for this job on LinkedIn over the last 4 weeks and everything went well. I had the final interview with 3 executives last Tuesday and saw on Friday the job was reposted.\n\nI was hoping to get a response next week, but now I’m not so sure and feel devastated. This feels worse than a rejection email lol. Has this happened to anyone? Am I reacting too soon? ",
      "subreddit": "jobs",
      "score": 8,
      "url": "https://reddit.com/r/jobs/comments/1iqif7c/completed_final_interview_and_saw_the_job/",
      "comments": [
        {
          "body": "As a recruiter who sees this regularly, you are unfortunately probably out of consideration.",
          "score": 18
        },
        {
          "body": "LinkedIn is really finicky imo. \n\nGive it a week more, maybe they will respond.",
          "score": 5
        },
        {
          "body": "It can also mean:\n- they had no intention to hire in the first place\n- they are on a hiring freeze\n- they are picky like all employers in this market and think they can keep looking for the unicorn they want\n- they haven't figured out the profile they actually need but are too lazy/stupid/stubborn to rewrite the job posting\n\nDon't jump to the conclusion that you're the reason you didn't get the job. It's tough out there. Don't beat yourself up.",
          "score": 5
        },
        {
          "body": "Update: the VP I interviewed with on Tuesday reposted the listing on their personal LinkedIn profile. I think it’s official I’m cooked 🫡 Hopefully they confirm their decision on Monday in an email :)",
          "score": 10
        },
        {
          "body": "This literally just happened to me for an HR generalist role. I had an awesome interview with the recruiter they were excited and they said they going to refer me. Then 2 days later I saw the job had been posted (not reposted) but just posted and I was like… that’s… odd I had already applied and interviewed… so just went ahead and messaged this on Friday:\n\nHey JohnDoe,\n\nI really appreciate the time you took to speak with me on Wednesday. I enjoyed our conversation—not just about the role, but also about your experience and insights. It was great to have such a genuine and engaging discussion, and I truly valued the opportunity to learn more about said Company.\n\nI know hiring is a process, and I appreciate the opportunity to be considered. Regardless of how things unfold, I’d love to stay in touch and keep the conversation going. Looking forward to crossing paths again.\n\nThanks again,\n\nYours, truly depressed (🤣🤣 I just put my name obviously).",
          "score": 5
        },
        {
          "body": "Job postings tend to repost automatically, especially for LinkedIn. They pick the amount of time they think it will take to fill a job and it reposts automatically periodically. \n\nDoesn’t make it a death sentence, but it always good to have backups either way.",
          "score": 4
        },
        {
          "body": "This is quite normal, and yes it feels bad. They want a different candidate, unfortunately. Just gotta move on. Has happened to me a couple of times. Sometimes I fully understood (still hurt), and other times I was baffled, because I felt I must have aced the interview.",
          "score": 3
        }
      ]
    },
    {
      "title": "How to prepare for the Infosys interview?",
      "body": "I have a interview schedule for the post of Shopify developer in Infosys, Is there anyone who have already given the interview for the same post?\n\nIf yes then can you please specify what all the interviewer asked?\n\nAlso from where I can prepare for the same? As there is very small library of questions for this post and also the question given on this is not very relevant.\n\nCan you all please help?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1gw4q7l/how_to_prepare_for_the_infosys_interview/",
      "comments": []
    },
    {
      "title": "Where to go from here?",
      "body": "I lost my job that was paying $40 an hour. It was prepping orders of stationary sold through Etsy and Shopify. I got laid off for a few weeks, then told I could return part time for $17 an hour. Obviously I said no, started applying to jobs, paid all bills for August and I’m currently on track to sell my car. ($480/month car payment) I replaced the windshield to the tune of $1100. Renewed my registration for $510 and now I’m BROKE. I’ve cut down on all unnecessary spending. I got a part time job at a grocery store because that was who called me back for an interview first. I don’t have a degree. I’ve worked mostly in restaurants and I’m just at a loss. I feel I did a really good job polishing my resume to really delve into the different aspects of each position I had. With some clever wording of course. 🤣 I didn’t serve customers. I provided exceptional customer service by anticipating needs and multi tasking in order to ensure an amazing dining experience. Bahahaha. But, I can’t realistically keep working 25 hours a week at just above minimum wage. I’ve applied for several jobs at local colleges that are primarily customer service based. (Admissions counselor, accounting technician (essentially assisting with connecting students with financial resources)) I’m stretching some of these applications because they said the ideal candidate would have a bachelors (which seems ridiculous to me.) but I’m definitely in a position where I need to figure out a way to feel confident in my ability to provide for myself. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1f33oab/where_to_go_from_here/",
      "comments": [
        {
          "body": "ETA: I also follow the job description carefully when drafting cover letters, research hiring managers, include keywords from the job description and I’ve been sending an email as a follow up the next day if I can find an accessible email. I’ve gotten one interview for the job I just started (restocking at a grocery store) and one email back saying the job posting will close 9/20/2024.",
          "score": 1
        }
      ]
    },
    {
      "title": "What to do?",
      "body": "this is a little long so I apologize. I work for a very small company. My department is about 8 people. When I first started (9 years ago), I began as essentially customer service, order entry, and my manager (who is also the CFO) told me I would have my own sales territory within a year and a half. Over the years, I did not become a full time sales rep, but more of a hybrid role with a few states in which I was the sales rep and then I was still in my role which I wear a variety of hats. I lost a few HUGE clients in 2021 due to mergers, and my manager agreed to split up our commissionable clients (we have a lot of house accounts no one gets paid on that I take care of), and for a solid year I asked him month after month about this. \n\nI also run our website, do all our customer marketing, I do our Shopify website stuff (all self taught). Finally in November I came to my boss and said in a positive spin that I was more than happy to do all these things, but this 2.5% pay increase each year just isn't cutting it with all the work I do for the company. I can barely pay my bills and my rent is 50% of my check (I did not say this to him but did let him know the median pay in our city). He told me I need to get a roommate and start making sacrifices. He also said I should get $25k and buy a house to build wealth. I said that sounds nice, but that could only be done with a pay increase. \n\nFast forward a week, he calls me back into his office, and he slides a paper in front of me. He has stripped all of my commissionable clients away from me. He averaged out my commissions over the past 5 years and just added it to my base. Sounds kind of nice at first except now I have no way to grow new business, or exceed what I was making, and I am BORED out of my mind now that I cannot sell. Since my boss is CFO I had no recourse and I can't go to HR since he is basically head of our company - our president got fired earlier in the year and we are not replacing him. Do I have ANY recourse here? My presumption is he's trying to get me to quit.\n\nSince November I have been searching DESPERATELY for a new job. I have a master's degree, but this doesn't seem to matter. I have reached out to head hunters, they haven't returned emails or calls. I have drained my network looking for jobs. I had an HR manager go through my resume and clean it up so it looks good and flows. I haven't even had an interview. I dread going to work everyday. \n\nAre job fairs even worth it at this stage? I have an MBA, my title is Client Success Advisor, but I have experience in sales, logistics, CRM management, I am really interested in tech and quick to catch on to new software. I have used tools to try to really personalize my cover letter to each job, but I'm just getting denied. Does anyone have any advice so I can stay sane in my current role?\n\nI am grateful I still have my job at the moment, but I'm fearful my days are numbered. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/192hulu/what_to_do/",
      "comments": []
    },
    {
      "title": "HELP: Coding Test + Challenge",
      "body": "So I'm going to be taking an HTML/CSS/JavaScript test in a few days. This is for a developer role. My first one ever.\n\nI'm good with HTML and CSS. I know a tiny bit of JavaScript, but never used it in a real project before.\n\nI come from a background that is strong in web design. The only time I have done front-end development was back in college and creating a TV display for my past job. \n\nOther than that I have used WordPress and Shopify which makes it really easy to create a website with almost no coding knowledge at all.\n\nI really want this job due to potential growth with this role and the work culture seems amazing.\n\nI'm also in a very desperate position where I need a job ASAP. Trust me, I applied to at least 400 jobs at this point and there hasn't been anything as promising as this one job.\n\nI heard of people cheating on code tests. I'm not supposed to cheat as the test says not to. My interviewer says the test is to see where my skills are at. And I'm afraid that I might not beat my competitors.\n\nBtw, I am hard-working and dedicated. I am willing to study and practice outside work hours just to be more competent. Does the hiring manager care at all for someone who does possess some experience and is dedicated to becoming better?\n\nAny thoughts?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/16c6sbc/help_coding_test_challenge/",
      "comments": [
        {
          "body": "Do the test legitimately. Answer the questions, do the tasks to the best of your ability. If you cheat, it'll just mean that in the job you'll be given tasks you're not able to complete. The screening is there, not to judge you. It's to make sure your code skills are at a level that fits in with an employer's needs and ability to train.\n\nOften, it doesn't matter if you have knowledge gaps. When I'm hiring juniors/entry level I want to see a good grasp of the fundamentals and that's about it. Everything from there can be built upon. If you were to cheat on my tests, I'd know before the interview was over, and I wouldn't even give you the chance.\n\nThat said, remember, code skill tests aren't closed-book tests unless they say they are. You're free to use reference websites. Google is your friend, ChatGPT is not. ChatGPT will lie to you and gaslight you like an abusive ex. You'll have access to reference while doing your job unless you're working in an airgapped environment like miltech.\n\nDon't sweat it. You got this!",
          "score": 1
        }
      ]
    },
    {
      "title": "(Mid-senior level) How did you conduct your latest job search once you had some experience?",
      "body": "I recently finished a contract job at a FAANG and decided not to extend due to the WLB of the team. My initial thought was to try to go to a different team but I would still have to work as a contractor and wouldn't be able to convert to FT until headcount opened up.\n\nSince the interview process is the same for an external candidate as for an internal contractor converting to FT, I've decided it made more sense to leave and spend the next couple months prepping, interviewing, and being more deliberate about my search now that I have some experience.\n\nFor previous job searches, I blasted out CVs and talked to linkedin recruiters til a few offers came in. Now that I have built up some technical experience, I want to focus more on other aspects of the job such as finding a good manager and team, decent WLB (\\~40 hours/week), and interesting work.\n\nI'm hoping if I do it right, I'll get a few offers and can have some leverage to negotiate.\n\nMy main questions are:\n\n* What has your strategy been? The job market seems hot, but wondering if there's a better way to sort through all the BS jobs and 3rd party recruiters.\n* What job sites do you frequent (besides the big ones, e.g. linkedin, indeed, glassdoor)?\n* What are some of your go-to questions when talking to recruiters/interviewing?\n* What other aspects of the job or team do you look for?\n\n\\--------------------------------------------------------------------------------------\n\nFurther situational details:\n\nI plan to grind leetcode and practice technical and behavioral interview questions. Then reach out to some recruiters to get back into the swing of interviewing.\n\nMost likely only open to FT positions and applying directly. I'm going to compile a list of companies that seem to fit what I'm looking for as well (Salesforce? Shopify?).\n\nI currently have 3 YOE in data engineering/science (5 YOE total in tech) and a master's in DS. Mainly worked in setting up AWS infra, Python, Airflow, e-commerce analytics. Previously worked for a startup, a mid-sized consulting company, and a giant legacy media company that was trying to catch up on the tech curve.",
      "subreddit": "cscareerquestions",
      "score": 11,
      "url": "https://reddit.com/r/cscareerquestions/comments/q2sdnh/midsenior_level_how_did_you_conduct_your_latest/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 10
        },
        {
          "body": "Used a Recuiter from a staffing agency.\n\nRight from the start I gave my salary range, what tech I wanted and where I wanted to be located. Had like 3-4 of these Recuiter’s just constantly handing me job descriptions and asking if I wanted to interview. No need to go online and apply. \n\n\nI did apply and get a job outside the Recuiter, so take my advise with a grain of salt.",
          "score": 4
        },
        {
          "body": "You have to figure out the fine art of dealing with recruiters, who are trying to rip you off, without getting ripped off.\n\nUsed correctly recruiters are brilliant.  Recruiters are professionals and if you deal with them well they can hook you up with a brilliant gig.  \n\nThey're professional middlemen after all, it's their job to know everyone in town.",
          "score": 3
        },
        {
          "body": "Hey man, I'm in a pretty similar situation to you as well and have been wondering as well. My thoughts were the following \n\n\\- Spending time on Linkedin looking for hiring managers for companies/positions you really want to work for, and send them an email with the position and a short explanation of why you want to work for them. \n\n\\- Look to get referrals from your previous contacts that are now working in bigger companies.\n\nCurious to hear more thoughts on this from anyone else.",
          "score": 1
        },
        {
          "body": "&gt;  The job market seems hot,\n\nWhy do you say this? You also need to define what you mean by \"hot\". To me, \"hot\" means you send out 5 resumes and then you get 5 job offers, and all the interviews are one round formalities. In other words, no competition between candidates.\n\nI haven't job searched in about 2 years, so I don't exactly know how the market is today, but I really doubt it's \"hot\" according to my definition.\n\n&gt; What are some of your go-to questions when talking to recruiters/interviewing?\n\nI always ask \"How many people have you interviewed for this job so far\". If they answer something like \"Too many to count\", then I just hang up the phone. If they rejected 500 people before me, chances are they will reject me too, and I'd rather just not waste my time. What I'd like to hear is \"You're the second person we interviewed\", or \"You're the first person we've interviewed\". If the number is somewhere in the middle, like I'm the 5th or something like that, I follow up with \"Please explain to me why you rejected the last person you interviewed\". If they give a dumb answer like \"they were just not a cultural fit\", then I ask them to clarify what they mean by \"cultural fit\".\n\nAnother question I ask is \"Why is this your interview process\". \n\n&gt; What other aspects of the job or team do you look for?\n\nI'm not a goldilocks kind of person. I can work anywhere, as long as the salary is right.",
          "score": -7
        }
      ]
    },
    {
      "title": "Shopify Support Advisor Gauntlet Interview",
      "body": " Hi Everyone,\n\nI know there's tons of Shopify threads on here, and trust me, I've read through so many! But I was wondering if anyone had any advice, tips, or tricks to make it through the Gauntlet interview for the Support Advisor position (formerly known as the Guru position). I have my interview coming up very soon. I have already created a store for my application, but I will create another just to dive deeper into the platform. It seems like so few people actually get through this part of the interview process and I'm incredibly nervous; I really want this job! I have tons of customer service experience, but I feel like I have SO much to learn about the platform. I'm really not much of a tech person and feel like I'm faking my way through everything! Any advice is welcomed!\n\nThanks so much in advance. I hope you're all keeping safe and healthy.\n\n\\-A",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/kaulcs/shopify_support_advisor_gauntlet_interview/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "In the same boat at the moment, I have my gauntlet on Tuesday! How did you both get on? I have the stupidest question but when you answer the phone for the role play, how do you start? Haha like do you just say “hello” or do you give the whole “Shopify Customer Support, “name” speaking” type thing? It’s frying my brain haha",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview for a purchasing and receiving assistant.",
      "body": "I’ve had a hard time finding any information on this job. It seems that il be assisting in managing the inventory and online orders of an equestrian tack store. \nI am posting to see if anyone can give me guidance on what questions to ask. Here is the job description. \n\nThis is a fast-paced, desk-based position within our Purchasing &amp; Receiving Department. You’ll interact with vendors via phone and email, manage orders, and help ensure our inventory and shipping processes run smoothly. Attention to detail and strong multitasking skills are essential.\n\nKey Responsibilities:\n\nSupport the Purchasing Manager in placing and managing distributor orders\n\nCreate shipping labels for online orders fulfilled by our other stores. \n\nUse Google Suite (Docs, Sheets, Gmail, etc.) for day-to-day tasks\n\nLearn and work within systems such as QuickBooks, Thrive, Shopify, Point of Sale, and phone systems\n\nCollaborate with other departments as needed — we’re a team-first environment!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1mgx3su/interview_for_a_purchasing_and_receiving_assistant/",
      "comments": []
    },
    {
      "title": "I’m 17 and so underqualified for the job I got.",
      "body": "I’m 17, an high school student and an immigrant. Because of this I always had a hard time finding a job, so I just gave up. Last night i saw a post on fb, owner of this big company looking for a person who would manage they’re social media, write some short articles and stuff all in my mother language. i decided to reach out. went for what i thought.  would be a job interview today. it came out it was more of a “when can u come here to work” kind of conversation. \nwell, i got the job. \n\nand idk what to do now.\n\nI have to use this website shopify to sell stuff online to the other website that they have, and some other website that is in the language that they use in the country im from, and i barely know it, \nthe guy who hired me tried to explain it to me but i barely got the basics. and they said that’s only the beginning of my “chores”.\ni thought by managing social media’s and writing short articles they meant some instagram, fb, website articles, graphics design and stuff not whole hacker shit 😭  i honestly don’t know how will i do all of this shit \n\n\nhelp??????",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1ekzkgm/im_17_and_so_underqualified_for_the_job_i_got/",
      "comments": [
        {
          "body": "This sounds a bit shady, to be honest.",
          "score": 3
        },
        {
          "body": "Ask the person who hired you if either they or someone else can give you another run down of what to do, also ask if they have some kind of manual you can reference. Then do the job the best you can but whenever you run into anything you’re unsure about ask someone about it. Whenever you get a question answered write it down preferably in an easy to access and look through word document. Then you’ll slowly build up a quick to reference q and a",
          "score": 3
        },
        {
          "body": "17 is young you can learn any job you want just google good luck",
          "score": 2
        },
        {
          "body": "Do the job.",
          "score": -1
        }
      ]
    },
    {
      "title": "Landed an interview for a job I am completely underqualified for; what should I do and how should I prepare?",
      "body": "My market is quite niche.\n\nI am Japanese/English bilingual and have been working in the US for 2 years now after moving from Japan as a fresh grad.\n\nA startup-like company so no proper training or whatsoever and we are trying to expand online so all I learned being an inside sale is pretty much customer support, Shopify management (nothing crazy, adding/editing items and putting up banners mostly for discount) and launching products for Amazon FBA (nothing crazy either, we used an consultant).\n\nAll the software are old, we barely use MS Office, and a lot of manual labor.\n\nI did not lie on my resume, basically just the above and my desire to work in the entertainment industry.\n\nRecruiter got back to me with an interview at one of the biggest anime corporate in Japan, at their office here in LA. I saw their requirements/qualifications and damn, I honestly have no idea what they mean. On top of that, I need to utilize stuff like MS Suite, Telco, Slack, etc. which I have literally never used before.\n\nWhat's interesting is that they are not hiring on any platform (Linkedin, Indeed, etc.) but they specifically wanted to interview me, given they read my resume (again, nothing crazy) and told my recruiter they are interested (may not be true).\n\nI am freaking out but I am certain, at the same time scared, that it will be a instant no after the interview.\n\nWhat are some tips you guys would give me in this type of situation? I do want to ace the interview regardless of me getting the position, and it would be such a great experience working with them. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1g1hzhm/landed_an_interview_for_a_job_i_am_completely/",
      "comments": [
        {
          "body": "You won’t know until you interview",
          "score": 2
        }
      ]
    },
    {
      "title": "\"What Should I Be Doing or Feeling in This Situation??\" (Need Advice) I'm a college-graduate and I'm lost in my first, real-life job",
      "body": "**this is a longer post !**\n\nI just started a new job this week and I’m really having a hard time integrating and finding work to do. I would love if someone has advice or different POVs so I could understand better what might be going on. \n\nThis is my first real post-college-job. The guy who hired me was a client of mine and basically interviewed me during the service (I'm a hairstylist), then later let me know he would love to have me on his team and that we should schedule an interview. Long story short, I accepted the job, was super excited to start, and let him know that I have finished two internships (in social media, specifically) and that I would love to practice and learn more aspects of marketing. He assured me that would be fine and told me to wait a week or two for them to finish getting together some of the onboarding materials and adding me onto the payroll. \n\n**My work demeanor:** I am naturally a shy and reserved person, so going into new jobs or spaces with new people is very stressful for me. I have had some very bad experiences with managers in the past not finishing my training and then yelling at me for my lack of knowledge later, and have thus developed a more closed-off demeanor at work. Normally, I don't like speaking up much and I don't like being assertive. However, I have been doing the necessary work to change this and I felt confident going into this new job that I would be open, I would act confidently, and that I would speak up and be assertive to show my team members that I deserve to be here and that I am just as capable as them...and hopefully they would like me. The other 3 members of my team are all men (maybe early thirties-late thirties?), and I’m the only girl (mid-twenties). I believe this feeds into why I especially feel like I need to make a good impression and not have them look down on me. I want them to feel that they can give me projects to work on and that they can trust in my capabilities.\n\n**My job situation:** This position is entirely remote and I was hired on as part-time, as I’m still finishing up the last few weeks of school and have a graduation trip shortly after (the whole month of May). I will be increasing my hours dramatically in June, and as far as I’m aware, they’re aware of this (the one who hired me reiterated this in our meeting this week). The team I interact with is comprised of three managers, all tackling different components of marketing, and then there's me. I wasn't offered an official job role upon joining, I was just told I would *help* with marketing, and specifically help the marketing manager. The guy who hired me actually came to me yesterday and asked me what I want my role to be on my offer letter. I was a bit taken aback at first, but happily chose a role that would look good on my resume for my future career. In the offer letter I had to ask for him to send me, I read that my responsibilities would be to maintain the company's branding, but I'm not sure what that means for what kind of work they actually *expect* from me (I do recognize that might be lack of experience talking). \n\n**The predicament** *(somewhat long explanation)*: My past internships were in an area of marketing that I am not doing in this position. I am practicing and applying new things - things I’ve learned but never actually applied irl in a job setting - and have reached out to my partner/higher up (the marketing manager - not the guy who hired me) for open and honest questions about doing certain things. He has given me a little bit of direction, but has otherwise left me on my own to navigate work. I would not mind this, however I'm not sure if I'm there're better things I could be doing with my time. \n\nIn these past three days, I have been signed into their email software (which the marketing manager has been running) and their Shopify (most likely run by the one who hired me, the e-commerce manager). I am not aware of their projects at all minus the email campaigns I need to write for MWF. This work is very easy, so I quickly finish it and am often searching online for ideas of other things to do, as I want to increase my skills so I can clock in more hours and not be a waste to this company. I have consistently asked from my marketing manager if he has any projects he wants me to look at without much answer. I have been mostly left to, seemingly, do what I want. \n\nMy third day, yesterday, was the most discouraging and has me doubting if I’m even cut out for this; if they expect too much from my little experience. I have been consistently updating my manager these past two day of the ideas I have for email (considering I *just* joined and he was doing email before me, and I would love his input, suggestions, or feedback so I can better learn; I don't feel comfortable just *making* decisions for the email too, since I've only been working with them for *three* days and he even had to go over the software with me on my first day). At the end of each day, I have been giving him a very brief summary of things I worked on - I was told that I would be working closely with him, and I have assumed then - maybe incorrectly - that he would like to be aware of my plans. He never answers, and I don’t know if that’s good or bad; I am telling myself he's just busy. I have started wondering, though, if maybe I'm just wasting my time and don't need to be doing that.\n\nYesterday when I reached out letting him know I had time to take some projects off his shoulders, he gave me a 15 min task and ignored my asking him if he needed to check the email I’d created before publishing it. I had already finished the work he had given me, so I wasn't sure what to do next. \n\nAfter researching some things I could do with my time and just plain assuming he was busy, I then reached out to the social media manager - because again, I told myself I would reach out and be proactive and get work done, especially if no one was doing it to me - and let him know most of my marketing experience is in his department (thanks to past internships) and I would love to be of any help if he would need anything. He signed me into the two platforms that manage their socials, we chatted a little bit more, and then the conversation died when I offered him some ideas I had had for the social media. I was extremely embarrassed, thinking maybe I had stepped on his toes a little - he hadn’t asked for my input - when I had just wanted to prove I could be useful and could help with work.\n\nI logged off for the day letting the marketing manager know, again, what I was planning on working on today. Because I work at the salon on Fridays, I let him know that if there's anything he would like me to look at for him on Thursday (today), I could! He never answered me. I didn't think I was bothered by all of it - after all, I understand they're busy, they're all managers - but when my husband came home and asked me how my day was, I just started crying, explaining the situation. He was already aware that, over these past two days, I would finish the little work assignments they'd give me in under an hour or two, and that I was bored, and didn't know what to do, that I was lost on what I should be doing to help, so when I told him it had happened again, and that no one had gotten back to me when I asked them for more work, he suggested I go to Reddit or another forum and ask for advice haha. \n\nSo here I am. \n\nI balled throughout our morning meeting today - video off and mic off haha - because all three of them were talking about marketing efforts and goals and accomplishments and it was going so fast that I didn't even have the confidence to ask what all 15 of the things were that they were discussing, and at the same time, I wished so desperately that they would tell me what it was they were talking about and tell me something specific to do to help them achieve that goal. I feel ignored and nonexistent, but at the same time, there is this pressure to be doing work. Work on what? I honestly don't know. I am feeling hurt that I was onboarded and not even made aware of what they're doing, what their projects are, and even more hurt, that when I was asking to understand and asking for more projects from them, that I was getting shrugged off. \n\n**Now what?:** I don't know if they're just all used to working on all the projects themselves, because it's always just been them three and they're managers, and they have the experience to tackle everything and know what to work on. Maybe I'm incorrectly assuming that because I am freshly graduating, that I need to have them check to make sure my work is ok for the company. I personally feel like, if I'm in charge of branding, and this is my *third* day, that I should be collaborating with my marketing director, as he's been the one who has probably been doing most of the branding before I came along. I don't feel comfortable as a part-timer making the decisions or giving myself projects without my manager giving them at least a once-over or giving at least an ounce of feedback. But he doesn't, and he isn't, busy or not. \n\nI don't know if they think because I'm part-time they don't want to give me longer projects, or maybe they think I'm not going to be staying for very long, or maybe they think I'm not taking this seriously. I don't know if I'm bothering them, or if I offended anyone. I don't know if because of my constant communication or clarification questions they think I'm going to be bitchy and throw my opinions around or push-back or whatever. I don't know if this is just what it's like working in a remote environment, and I'm just not used to it. I don't know if my lack of experience is so apparent that they're questioning why I'm here and if I even have the ability to do what needs to be done. I don't know if I'm just overthinking this too, haha, this is only the first week, and I do tend to get extremely anxious and stressed out about situations like these. I'm just trying to tell myself that everyone is busy and I'm new and I have to learn and they have to get used to having a fourth person here and because I'm part-time maybe I *don't* need to know what the projects are, maybe I'm supposed to be doing these menial tasks and focusing on these menial tasks and not bothering them. I don't know. I've kind of just spiraled myself into self-doubt at this point haha and all I know is that I'm just absolutely *dreading* work next week. I'm terrified they expect me to fulfill a manager-like role when I don't even know how to perform on a regular employee level. For all I know, the main issue here is me: maybe I just need experience and need to fall on my face a bit to learn more. Maybe that's what's hurting me the most right now. \n\nI guess I just don't know what to do or what to make of this situation. I don't know if I should keep asking for projects to help with - which I really don't want to, because I don't want to be that kind of employee that is always asking for work and is never thinking proactively for themselves what they could do - or if I should just fill my time doing what I can - which is currently, designing email campaigns, and anything else I can think of for a few more hours. I am afraid of overstepping, assuming, or making mistakes I shouldn't be making. I wish I could be told what range of things they'd like me to look at, work on, etc so I could have options, so I could contribute to something that would help the company's marketing efforts, because I feel like making it a free-for-all for me is setting me up for failure when I feel like I don't know *anything.*\n\nI don't know if I should let the one who hired me know of the situation, or if it would make things worse - because he might start doubting my abilities too. I don't know. I plan on taking it easy this weekend and looking over some of the notes I took during the meeting - I tried writing down what sounded like important marketing efforts, so I can look into them during my work hours and maybe, just maybe, come up with something to help. I'm hoping to come back to work next week with a more positive and assertive attitude than I have now, because rn I just feel like curling up and staying in my corner and just kind of hiding away haha. \n\nAnyway. I know this was a lot, and I had a lot of emotional input here. I have felt defeated and discouraged all day today, so I hope that if the emotions were off-putting, that they can be overlooked. It was actually a little therapeutic to write this out haha. Any advice or perspectives would be appreciated. Thank you. ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1c1p3l3/what_should_i_be_doing_or_feeling_in_this/",
      "comments": [
        {
          "body": "Okay, first of all, you need to stop crying over this job. It's just a job, and from what it sounds like, it's a pretty damn easy one. Get your emotions under control and realize that you've got it pretty good.\n\n\nSmall businesses like this are often very disorganized, so this situation is pretty normal. Yes, it definitely sucks feeling like you're being ignored, but you are doing your job in good faith and are constantly looking for ways to help out. That's really all that you can do. If they choose not to use you to your full potential, that's on them.\n\n\nIf they're not going to give you things to do and not take an active interest in your professional development, then it might be time to stop asking permission and instead ask for forgiveness.\n\n\nDid you ever see the movie Erin Brockovic? If you haven't, go watch it tonight. It's a great movie based on a true story about a woman who was constantly underestimated and got sick of it, so she took her professional development into her own hands. At some point, you need to take responsibility for your own future.",
          "score": 1
        }
      ]
    },
    {
      "title": "Company I have been interviewing for asked to come in for a “work interview” what is this?",
      "body": " I applied for a Social Media Manager role for a luxury boutique and I was interviewed first by the marketing director and then came for a second interview to meet the owners. I was told this was the last interview.\n\nAfter, they reached out and called my references and everything went well and then after asked for a “working interview”\n\nWhat is that and is that a good sign or normal?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/15l2dqf/company_i_have_been_interviewing_for_asked_to/",
      "comments": [
        {
          "body": "Its a red flag. Is this paid? If not, its a bad sign of their lack of professionalism to ask you to do any work unpaid.",
          "score": 2
        },
        {
          "body": "Ask them. Ask how long it will be? What will be expected of you? Should you pack a lunch? Will you be compensated? \n\nI don’t think they’re trying to get free work from you because if I were them I wouldn’t let some one off the street come in and take over a client’s social media account.\n\nI’m guessing they just want to see that you can actually do the work. Social Media Management isn’t a degree you can get in college (I don’t think) so everyone with a social media account is technically a “social media manager”.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewed for job and they are looking for a completely different role than was posted",
      "body": "So I'm in the Ecommerce space, I've been in this sector for a while but I was working for a small company. A recruiter reached out to me and the following day I had another interview. The company basically hired them to do like mini interviews prior to the official one. \n\nAnyways the role was exactly in line with what I do, website management for Shopify and some other things according to the job description. I reviewed the job posting multiple times so I knew what I was getting into. Things were going smoothly over the phone ( although he made certain comments saying I look more like a junior etc kind of downplaying my experience, I'm an ecommerce manager)\n\nAfter answering all his questions he asks me if I had experience with firing, hiring and writing salary and budgets while managing the ecommerce team. NONE of which was in the job description most ecom managers never touch that stuff. So he says they had 8 people with similar skillsets like me that they had to turn down because they couldn't do those tasks as well.  I told him you guys aren't looking for an ecom manager but a director instead. He agreed and said yea that's more in line with what the hiring manager is looking for not ecommerce manager. I was bummed and upset because I was excited for the opportunity only for it to be completely different. He said that they've been trying to fill the position for 2 months and that they gave someone else an offer and I guess they turned it down.\n\nHe said that because I have a lot of experience he would get in contact with me for another role in the same company for a lower position. (lower pay nowhere near the original posted role)\n\nI don't understand why a job would do this ? Why mislabel a position and not post the correct position that your looking for ?  ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/17qy29q/interviewed_for_job_and_they_are_looking_for_a/",
      "comments": []
    },
    {
      "title": "Shopify Support Advisor role? The good, bad, and ugly?",
      "body": "I’ve been seeing a lot of available Support Advisor roles pop up online and am wondering what the job is ACTUALLY like, as I’ve been curious to apply. \n\nI’ve been searching online reviews and a lot of them are pretty unsavoury (like having to talk to three merchants at the same time via chats, the high possibility of being placed with a shitty team lead or supervisor, offering amazing benefits to make up for the fact that the job itself is garbage). \n\nI’d like to hear some more feedback from people who’ve worked in this role - and not the “omg the best company ever I’ll live and die here and the perks are amaaaaazing” type of people. Legit feedback about the day in and day out about the role, please!",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/lvtskh/shopify_support_advisor_role_the_good_bad_and_ugly/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Hey! I can't speak to Shopify specifically, but I'd say that simultaneous live chats in a customer support type role aren't out of the norm. I work in the same industry for a different company and 3 is the maximum we set.   \n\n\nAs for the team lead or supervisor, that's always a little bit of a luck of the draw. If you're lucky, you'll get to meet them during the hiring process and hopefully scope out whether or not you'd get along or if there are any flags from the way you interacted!   \n\n\nI know people who've worked at Shopify with amazing experiences and seen a ton of growth there, and some that really didn't enjoy it.",
          "score": 1
        },
        {
          "body": "This  is my dream job and I have an interview. I’m just worried that my background in Bartending isn’t going to cut it. I know I’m capable but clearly the difference is significant. I know they give 5 weeks of training and that is all I need. I am OBSESSED. I love Shopify and I won’t stop until I get the job. My skills are easily transferable, I just need the training. It sucks that the interviews aren’t going to allow for me to explain that, but I’ll keep reapplying and working towards it until I get it. I actually already have a good job, but I know what I want.",
          "score": 1
        },
        {
          "body": "I heard back from them a month later to complete the form, how long is the process of getting hired?",
          "score": 1
        }
      ]
    },
    {
      "title": "Update on \"When to walk away from an interview process?\"",
      "body": "[https://www.reddit.com/r/jobs/comments/d8yq24/when\\_to\\_walk\\_away\\_from\\_an\\_interview\\_process/](https://www.reddit.com/r/jobs/comments/d8yq24/when_to_walk_away_from_an_interview_process/)\n\nI went ahead and went to the 2nd interview. The owner and president were VERY impressed with the samples I put together for the second interview. Owner's son kept dogging me, trying to poke holes in my skills, etc... and it got contentious to the point where the owner and the president were arguing with the owner's son during the interview. It was very strange. They were trying to convince him about how my skills (deep technical webdev - actual JS/PHP programming) would help for their WordPress/Shopify sites (something only a fool would need convincing of, especially someone pretending to know what they're talking about).\n\nOwner's son soft-accused me of not actually knowing HTML and asked me to fix a Shopify website they had with broken HTML. I did it very easily. He sort of glossed over that and gave me a small project to do with Illustrator. I realized it was almost exactly like Photoshop and did what he asked. He awkwardly said \"Thank you much\", got flustered because he tripped over his words, and left the room.\n\nOver the course of me doing the activities that the son was trying to \"gotcha!\" me with, the owner (his dad) came into the room and told me something along the lines of \"I'm very impressed with you, and I am the owner of the company. Just take a deep breath and do the best you can with these projects\".\n\nAt the end of the interview, they told me they would be in touch with me soon with their decision. The president texted me on Friday saying they would be making me an offer and would discuss the details on Monday. \n\nHe then called me on Monday and told me some bullshit story about their sales manager resigning so that meant they wouldn't be able to hire me for some reason. After I already told my family and friends that I had received a job offer. Pretty shitty.\n\nAnyways, to me it seems obvious that the son went into full war mode against me being hired and eventually won out.\n\nAnyways, there's the whole story. Don't know if anyone cares but there it is.",
      "subreddit": "jobs",
      "score": 20,
      "url": "https://reddit.com/r/jobs/comments/dc0fro/update_on_when_to_walk_away_from_an_interview/",
      "comments": [
        {
          "body": "You dodged a bullet.  \n\nIt _does_ suck, but it’s clear this douche son would have made you miserable.",
          "score": 23
        },
        {
          "body": "send them a bill for the projects you completed for them. (fixing the website, etc.)",
          "score": 11
        },
        {
          "body": "Be glad you won't be working there. It would have been miserable.",
          "score": 6
        },
        {
          "body": "name and shame.",
          "score": 10
        },
        {
          "body": "Could you imagine working for people like that? The son sounds like an egomaniac. I hope next time you'll just leave if someone keeps egging you on like that during an interview. It shouldn't be that way and you should post on glassdoor.",
          "score": 5
        },
        {
          "body": "I count that as a win. Not worth going to a company like that.",
          "score": 4
        },
        {
          "body": "Sounds like the son of the company is going to steer it towards collapse. That kind of nonsense is how terrible decisions get repeatedly made. The Owner and President need to put their foot down when it comes to the son.\n\nIf the son was going to be someone OP would have worked under, then it is better not to work there.",
          "score": 3
        },
        {
          "body": "Sounds like they got free work out of you...",
          "score": 3
        },
        {
          "body": "Sounds like it's time for a Glassdoor review!",
          "score": 3
        }
      ]
    },
    {
      "title": "Shopify Support Advisor",
      "body": "I just finished my technical interview last Thursday. I got the reference collection email right after my technical interview on the same afternoon and the technical interview's recruiter said I would probably hear back within 1-3 business days. \n\nDoes anyone know what the hiring process is like for a support advisor at Shopify? Do my references must finish submitting their reference forms first before I could hear back from Shopify? Because up til now, two of my references have yet to submit their reference forms and it is about 1-3 business days after my technical interview already.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/osujq7/shopify_support_advisor/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Yep, you got the job and I'm sure you know by now. Congrats. When do you start?",
          "score": 1
        }
      ]
    },
    {
      "title": "Upcoming Interview at Shopify. Any advice?",
      "body": "Hi everyone,\n\nI have an upcoming interview at Shopify for a Procurement Operations Specialist position. For a bit of context, I’m about to graduate with an Honours Bachelor of Commerce, majoring in Supply Chain Management.\n\nGiven how challenging the job market is right now in Canada, especially for new grads, and how competitive the hiring process at Shopify can be, I was honestly a bit surprised (in a good way) to be invited to interview for this role.\n\nThankfully, I do have a decent amount of internship experience under my belt, along with a few individual projects I’ve worked on to help me stand out. Still, I’m anticipating it will be tough to compete for this full-time position as someone just starting out in their career, especially against more experienced candidates who have also applied.\n\nAny advice or insights to better prepare for the interview would be much appreciated!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1m1k0s0/upcoming_interview_at_shopify_any_advice/",
      "comments": [
        {
          "body": "Your supply chain management background and internship experience are exactly what they're looking for in a Procurement Operations Specialist, so stop selling yourself short. Yes, you might be competing against more experienced candidates, but companies like Shopify often prefer fresh talent who can grow with their systems rather than someone set in their ways from another company.\n\nFocus your preparation on understanding Shopify's business model inside and out, especially how procurement fits into their merchant ecosystem and growth strategy. They'll want to see that you can think strategically about vendor relationships, cost optimization, and process improvement, not just execute tasks. Practice common [procurement operations specialist interview questions](https://www.interviews.chat/questions/procurement-operations-specialist) around supplier evaluation, risk management, and cross-functional collaboration scenarios. Your internship experiences are gold here, so have specific examples ready that show how you've solved problems, improved processes, or managed stakeholder relationships. The fact that you got this interview means you're already competitive, so go in there and show them exactly why hiring a smart new grad who understands their business is better than settling for someone with more years but less hunger.",
          "score": 1
        }
      ]
    },
    {
      "title": "Shopify interview for Senior Financial Anlayst",
      "body": " Hi people, has anyone recently cleared senior financial analyst interview of Shopify? I heard there is going to be a case study round? Can anyone share tips on how to prep for it? I would really appreciate it. ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/16o23ir/shopify_interview_for_senior_financial_anlayst/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Shopify Life Story Interview",
      "body": "Hi everyone. I have a “Life Story” interview scheduled at Shopify for an account management role. Anyone have any experience with their interview process? Any tips? What kind of questions do they ask? Thank you in advance.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/oz9x55/shopify_life_story_interview/",
      "comments": []
    },
    {
      "title": "My frst Technical Interview went horribly, and I can’t stop thinking about it",
      "body": "I just had my first technical interview, and it went so badly that I can't shake it off. I was applying for a software engineering position (React &amp; Node), passed the HR interview, and studied so much to prepare, reviewed concepts for JavaScript, React, Node, everything. But when the actual interview came, I completely froze.\n\nWhen I started coding, the panopticon effect just hit me hardk nowing that the interviewer could see every thing i type. I barely made it through the first question. Then halfway through the second question I just  blanked. I couldn’t think, couldn’t solve it and the pressure made it worse. Eventually I just admitted I was too nervous to continue and apologized for any inconveniences before leaving the call.\n\nAs soon as it was over, I started crying a bit and shaking. I felt so embarrassed. I’ve worked on a freelance web app project before from Upwork and had a contractual role, but mainly in web development (Shopify), so I never had to do a live technical interview like this (I just showed them my portfolio and got hired). I know that firsts are supposed to be bad, but I didn’t think it would be this bad. And the worst part? Once I finally calmed down, I realized how to solve the second problem and it was simple. \n\n  \nNow, I’m doubting myself a lot. Do I even have what it takes for software engineering? How do I stop feeling like a complete failure? If anyone else has been through this, how did you get better at handling technical interviews? Any advice would really help right now.",
      "subreddit": "interviews",
      "score": 61,
      "url": "https://reddit.com/r/interviews/comments/1jo0dzs/my_frst_technical_interview_went_horribly_and_i/",
      "comments": [
        {
          "body": "I was in your shoes 8-9 months ago and read some guy comment on a similar post. I saved it so i am\nQuoting him\n\n“A lot of people saying things you need to hear right now about interviewing and stress levels and not losing hope. That's all good.\n\nI think you're taking this so poorly because you're missing something more fundamental.\n\nYour job is not your life. Interviewing for jobs is not your life. None of this shit is even real.\nYou'll have plenty more chances to do things better in the future. Sometimes you will do better. Sometimes you'll fuck them up. Maybe worse. Who cares?\n\nDrink some water, go outside for a while. There's a whole damn world and we all cram ourselves into laptop screens and grind our brains into dust with leetcode practice and raise our stress levels with worthless anxiety about the state of the job market.\n\nCall a friend, or a family member, get together and have some coffee (or tea if that's your thing).\nYou'll sleep tonight. You'll wake up tomorrow. You'll get more chances and make more choices and that's all there is to it.\n\nI was so stressed when all these layoffs were going down last year. No amount of worry changed anything. Fuck all that. Work hard when you have to, rest when you can. Its a marathon.\n\nIn 5 years you won't care about that interview.\n\ntl;dr - Take a break fam, life has ups and downs.”",
          "score": 59
        },
        {
          "body": "That's how it's goes for everyone.\n\n\nBecause of that advice is given that initially gives interview of companies which you won't join mostly so you will have interview experience.\n\nLearn from it , prepare Better.\n\nOnce you are confident then start applying to one you want .",
          "score": 18
        },
        {
          "body": "Get Propanalol",
          "score": 4
        },
        {
          "body": "Man this experience is worth its weight in gold. One, not all of them, but one of the biggest takeaways from this is you realized how to solve the problem. Now going forward rather you want it or not, you will have a nagging voice in your head saying “we’ve been here before, we can figure this one out too.” \n\nNo matter how many times you tell it “bro no this one is different I need help,” it will literally retort “naaaaw we got this.” \n\nJust don’t become the over confident worker who doesn’t take advice from people because of it. But for what you’re experiencing it’s going to work wonders for you. You’ll get better and better at the interviews.",
          "score": 5
        },
        {
          "body": "Its best time dive more into interviews, keep doing it, make it a practice.\nFailing it matters as it should drive you more to do better, youll never know youre killin it next time and some Hiring Managers are still sensible, they know when you struggle and help you out!",
          "score": 3
        },
        {
          "body": "Don’t beat yourself up. Seems this might be the first for you. It will get better in time when you go through more interviews. I was nervous myself but after 3rd first technical interview it started good to point where it started to get annoying lol.",
          "score": 2
        },
        {
          "body": "I’ve been coding over 25 years, 18+ of those “professionally.” I just recently majorly failed basic questions in a tech interview because I totally overthought things. I didn’t think the interviewer was asking such simple things so I assume he meant something deeper and was confused.\n\nIt’s all good. You’ll do better next time and hopefully won’t make the same mistakes. You got this!",
          "score": 2
        }
      ]
    },
    {
      "title": "How to prepare for the Infosys interview?",
      "body": "I have a interview schedule for the post of Shopify developer in Infosys, Is there anyone who have already given the interview for the same post?\n\nIf yes then can you please specify what all the interviewer asked?\n\nAlso from where I can prepare for the same? As there is very small library of questions for this post and also the question given on this is not very relevant.\n\nCan you all please help?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1gwdkc7/how_to_prepare_for_the_infosys_interview/",
      "comments": [
        {
          "body": "For an Infosys Shopify developer interview, focus on mastering Shopify's core concepts, including theme development, Liquid templating, and app creation. Brush up on your JavaScript, Ruby, and REST API skills, as these are crucial for Shopify development. Since there's limited information available for this specific role, prepare by diving deep into Shopify's documentation, building sample projects, and familiarizing yourself with Infosys' tech stack and company culture.\n\nBe ready to discuss your past projects, problem-solving approaches, and how you'd handle common Shopify development challenges. Practice explaining technical concepts clearly and be prepared to write code on the spot. If you're feeling unsure about your preparation, you might find [interview prep AI](http://interviews.chat) helpful. I'm on the team that created it, and it's designed to help with tricky interview questions for various tech roles, including Shopify development.",
          "score": 1
        }
      ]
    },
    {
      "title": "Graduating student looking for a job would love some advice!",
      "body": "Okay, nice people of this subreddit... I need advice! \n\nI am currently graduating (Just writing up my thesis). I am applying for remote jobs related to digital marketing and more specifically to SEO. I just got a standard \"we will continue with more suitable candidates\" email after my first interview.   \nIn my opinion, I have got decent internship experience - 6 months at BASF (largest chemical producer in the world), where I had very responsible tasks, it was not just watching and bringing coffee to my supervisor. There I was creating online stores (Shopify) and constantly working with people from all around the world. I am also familiar with SEO as a whole and got killer feedback in writing from BASF stating I performed very well.  \nSo in my eyes... I am a decent candidate for most positions. However, as I said I only got 1 interview so far.  \n\n\nI would love some advice from you guys. What can I do, where could I look and apply for decent positions. How do I land that entry level dream job? Is there a secret (or not so secret) path to getting hired ASAP? I really feel kind of lost here as to where do I apply. I am really not impressed with the offers on the job boards in my country. Any help would be appreciated!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/narikn/graduating_student_looking_for_a_job_would_love/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I like to start by saying that the job search is a weird sport where you have no idea who your competition are nor what is happening behind the scenes at a company. I too have been frustrated with knowing I could do the job but why am I not getting an interview etc.\n\nI suspect in the scenario you described they just had a limit on the number of candidates they could meet with and probably had a high number of good candidates, so had to choose to let some go from the process.\n\nRegarding advice, if the job boards have very little, try looking for companies that you like the look of and send a spontaneous application. This is how I got my first job, turned out that they were thinking about getting someone extra but hadn't go around to it yet. I saved them the hassle of advertising the position.\n\nLastly in this current market, you may go through a few rounds of rejection, try not to take it personally. Have as many applications on the go at once as you can find/handle so if one drops off you have the next one to focus on. Take a day off the hunt when you need it :)\n\nGood luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "Shopify interview",
      "body": "Has anyone recently completed a financial analyst interview at Shopify? I am doing the case study round shortly and looking for tips on how to prep for it. I would really appreciate it.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1dkd319/shopify_interview/",
      "comments": [
        {
          "body": "Hey! I can relate to the case study prep stress, definitely not the most relaxing way to spend your time! I built Interviews Chat (https://www.interviews.chat) to help people prepare for interviews, also for things like case studies. It can create some relevant questions based on your resume and the job description. But the real game-changer is the AI Copilot - during the actual interview (provided it's virtual), it can listen in and give you suggestions in real-time. Super helpful if you get stuck or need a little nudge in the right direction. Good luck with your Shopify interview!",
          "score": 1
        },
        {
          "body": "If you have completed the case study round, can you give advice and insight on how it went?",
          "score": 1
        },
        {
          "body": "I am going to have a coding interview for an eng manager role. Any idea how to prepare? What they might ask?",
          "score": 1
        }
      ]
    },
    {
      "title": "Shopify Coding exercise interview prep",
      "body": "Have digged far and wide but there is almost nothing i could find on the type of questions asked in the shopify coding exercise interview in the first round. Any advice/direction is very much appreciated.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/qxws22/shopify_coding_exercise_interview_prep/",
      "comments": [
        {
          "body": "Have you checked out Glassdoor for interviews?",
          "score": 1
        }
      ]
    },
    {
      "title": "Is Ultracode still undetectable?",
      "body": "Is Ultracode still undetectable? I care most about undetectability on Coderpad and Hackerrank specifically. I used to use Interview Coder and worked without any issues pretty much all summer until last month when I got called out during an interview with Shopify for “running a known unauthorized third party tool.” Now I am banned at Shopify.. Seems like Coderpad has patched Interview Coder and is gloating about it at the top of their home page. I saw Ultracode claims to have the enterprise grade interviewer licenses with CoderPad and Hackerrank to test and guarantee its still undetectable daily. Wanted to know if anyone here can vouch for Ultracode before I buy it cuz there’s no monthly plan so it's really expensive",
      "subreddit": "interviews",
      "score": 15,
      "url": "https://reddit.com/r/interviews/comments/1o8z5uu/is_ultracode_still_undetectable/",
      "comments": [
        {
          "body": "I got offers at amazon and microsoft with ultracode a couple weeks ago. Interviewed with it on coderpad, chime and hackerrank without any detection issues. My only compliant with ultracode is they offers two model modes: quick mode and reasoning mode. Reasoning mode is a bit slower but way more accurate but by default its get to quick mode to save money probably. Make sure to toggle on reasoning mode in settings if you expect to get leetcode hards for far better answers",
          "score": 19
        },
        {
          "body": "I bought Ultracode like a week ago and so far so good. I used it in an interview with Adobe (on Hackerrank) and have made it to the next round so seems undetectable as far as I can tell. Figured they wouldn't be inviting me for the final round if they caught it lol",
          "score": 13
        },
        {
          "body": "Interview coder was bound to get banned. They open sourced their codebase and went hella mainstream and put a huge target on their backs. Hotkeys are detectable and theirs are flagged by all the major platforms. Ultracode lets you pick your own hotkeys to bypass detection.",
          "score": 2
        },
        {
          "body": "I got an offer at a company that uses code signal with ultracode last week. I've heard code signal\nactually has the strict anti-cheating flags so if it works on code signal it definitely still works on\ncoderpad and hackerrank.",
          "score": 1
        },
        {
          "body": "It's undetectable but good luck using it in 6 months when all the top companies go back to in person interviews",
          "score": 1
        },
        {
          "body": "Were you able to get any offers with interview coder before it started getting detected? If so, why do you wanna keep spending money to cheat when its not working out for you?",
          "score": 1
        },
        {
          "body": "any update ?? I see that interviewcoder also released a pro version today, which is very similar to what ultracode is providing",
          "score": 1
        }
      ]
    },
    {
      "title": "Questions to ask SaaS startup",
      "body": "I’m interviewing for a SaaS startup. They have an app for the Shopify store. I’m always worried about the longevity of startups. \n\nWhat are some questions I can ask to vet the health and stability of tech startups?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/16b3bej/questions_to_ask_saas_startup/",
      "comments": []
    }
  ]
}