{
  "company": "slack",
  "post_count": 60,
  "exported_at": "2026-01-18T17:44:53.304Z",
  "posts": [
    {
      "title": "Clothing help",
      "body": "Hello!\n\nI have a job interview for a caregiver position. \n\nI do not own any slacks and do not have the money to buy any. I do have some nice \"church\" looking dresses (go to mid calf, modest necklines, etc) or I have jeans and a button up blouse. \n\nShould I wear the jeans and blouse or a dress?\nI'm not sure what would be more acceptable.\n\nTia.\n ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mpptul/clothing_help/",
      "comments": [
        {
          "body": "I would wear the dress for the interview. Good luck!!",
          "score": 2
        }
      ]
    },
    {
      "title": "I DON'T wanna be an asshole but I've had it with the new guy after 3 months",
      "body": "So my company is fully remote right now. Recently (3 months ag) my boss, a smart and chill guy hired 4 new Data Scientists.\n\nHe wanted capable junior DS persons who would be starting a role where at least 1 year prior DS experience was the minimum requirement.\n\nThis new guy S, from day 1 annoyed me.\n\nI was demoing some stuff I spent a couple of months working on and his commentary throughout my whole demo was saying things like, \"Oh yea, this looks easy\" or \"Nice work, yea I can definitely build something like this and fix those bugs you mentioned\".\n\nMy initial impression was that he was gonna be a hot-shot show-off and I was fine with that once he did his job. I knew once he started, he'd run into the same issues I did and learn to not prematurely say something is 'easy'.\n\nWell, he was put on a different project for the first 6 weeks and my friend had NOTHING but complaints about him.\n\nSaying his work ethic was horrible, how he'd disappear for entire days and then say, oh my slack wasn't working etc.\n\nMy colleague complained to the manager who gave him a stern warning and deducted pay for the missing days.\n\nI assumed he'd buck up after that, **however for the last month he's been assigned to work with me.**\n\nI have 3 other employees (2 from his batch that joined 3 months ago) who work under me.\n\nThis guy, wow it's ludicrous how annoying, inefficient, and how poor his communication has been.\n\nI ask for daily updates, not even a meeting every day, just a tiny update. I've gotten 2 in the last month.\n\nI called him Friday after getting no updates since Tuesday. His response was, \"Remember I told you slack doesn't send me notifications, so I didn't know I needed to update you. So yes, I'm still working on that API, i think I found a way to do it now, but getting the info I need is proving problematic\".\n\nMind you, he had a month to create a simple API that connected to a few a other APIs to collate, clean and standardize some data we needed. It should not take more than a day to do this.\n\nIt's been a month officially and he still has nothing to show expect ONE simply notebook of him using a similar API that someone already made. We can use that API but it's not free, so I asked him to make it for us.\n\nWhat do I do? I've sent him resources, tutorials, gave him instructions on how to do it. \n\nI don't get updates, I don't get questions......all i get is him snickering about how he's making good progress.\n\n&amp;#x200B;\n\nNow, it's partially my boss's fault for hiring him as my boss didn't want to do coding interviews. He said he trusted that someone who did a full CS master's Data Science degree would be capable enough.",
      "subreddit": "cscareerquestions",
      "score": 1837,
      "url": "https://reddit.com/r/cscareerquestions/comments/nork5y/i_dont_wanna_be_an_asshole_but_ive_had_it_with/",
      "comments": [
        {
          "body": "I would just start sending emails of hey this needs to be done on X day, and copying your manager. If he doesn't do it follow up on that email chain. Let him know that oh this is because your slack doesn't work right? We still need two things done a certain time to keep up with our Sprint / timeline.\n\nI'm not sure about you but our company has a 90-day trial period, maybe it's not too late? Just try to get everything in writing so your manager knows how much of a POS he is",
          "score": 1113
        },
        {
          "body": "Every time I get afraid of being fired for some silly mistake, I end up reading a story like this. lmao",
          "score": 977
        },
        {
          "body": "Why don't you ask him \"what else is left regarding the API you are building\"? If he cannot give you an answer, that means he hasn't done anything or does not know what to do.",
          "score": 351
        },
        {
          "body": "Have had SEVERAL people like this at my work.  Unfortunately, they let the contract go full term almost every single time.  \n\n\nFirst girl told me that she purposely enters bugs for job security.   \n\n  \nOne guy worked on one tiny project for his entire 6 month contract.    We ended up nuking that entire work that he did, as it didn't follow the rest of our standard.  \n\n\nOne guy told everyone his uncle had cancer and that he had to work at night so he could take care of him in the day.  Turns out, he was outsourcing his job and he was working another job at the same time.  \n\n\nAnother guy said he had experience, but couldn't do the simplest thing ever (for instance, declare a variable).  I'm not sure how my company manages to find such incompetence.\n\n  \nAnother one only got work done from the hours of midnight to 6 AM central.  It was clear he was getting help from overseas as he wasn't ever able to talk about what he did.  \n\n\nFinally, we had one guy that just completely coasted.  I thought we fired him, but I'm sure his short contract ran out and we just did not renew it.    \n\n\nOut of all of these, the only one that was let go was the one that was working at another company (pre covid), as he was literally found in the act by one of our recruiters.  The rest they let the contract expire first.",
          "score": 234
        },
        {
          "body": "He said his Slack notification is broken. From now on, all your communication with him should be via email until he tells you it's fixed. Document everything from when you spoke with him about a certain task and what response you got from him on which day at what time. When things blow up due to this guy's incompetence, share everything you documented with your manager so it doesn't look like it failed because you weren't doing your job. This is called CYA which I learned early in my career.",
          "score": 138
        },
        {
          "body": "I had a really bad new hire assigned to me a few years ago.  The guy didn’t show up for work many days (pre COVID), didn’t make progress on work except for what I did when I paired with him, didn’t ask questions or give updates on why he wasn’t making progress, I constantly saw him on his phone, etc.  I told my boss I spent more time trying to communicate with him and ramp him up than it would take to actually do his work and this had little chance of improving after two months.  He was a fresh grad from a good school but seemed low on motivation and ability.  This situation sounds very similar. Try communicating to your boss that ROI on time interacting with him is negative and looks like it always will be negative and you don’t want to continue.  This guy got passed to another mentor with the same results and was then fired.",
          "score": 110
        },
        {
          "body": "[deleted]",
          "score": 358
        }
      ]
    },
    {
      "title": "If you're mostly financially OK, would you quit if boss asks to come in 1 day a week 50 miles away?",
      "body": "Fully remote since pandemic, love it, now we have a WeWork office thats 50 miles away. We've had it for the past 1.5 years, but only people nearby came in, no one from my team. Mainly the \"business\" type people. \n\nNow on a new project spearheaded by an exec. He wants us to come in at least 1 day a week, on the days he has his 10AM sync meeting.\n\nI get no work done. At home, I have a nice dual monitor setup, my comfy office chair, no distractions. WeWork office is a cramped room with 10 shitty monitors and tables crammed into a tiny room. Plus we have around 3 larger and smaller conference rooms reserved for us but booked back-to-back. So constantly on the move, and its not as efficient to work out of my tiny laptop.\n\n&amp;#x200B;\n\nThere's no point to the meetings in person anyways. It's literally an 1.5 hr long sync/status meeting with this new boss evangelizing the project half the time and using business-school lingo (he's not as technical as old boss and old projects)\n\nAlso we just end up reviewing a doc or demo or presentation, or discussing something, and people in the meeting room just stay focused on their laptops. There is no brainstorming, in-depth wideboarding sessions - everyone is kinda doing their own thing or has their own domain. Can't this be done over Zoom or Slack as it was past 3+ years?\n\nI prefer communication over Slack since:\n\n1. There's a written document of everything, easy to search history\n2. Easy to explain things and break it down since people can read at their own pace (stuff can go over peoples heads or my head when we're discussing technical domain knowledge or jargon)\n3. Easy to share code snippets and logs  \n\n\nIt literally becomes a wasted day, so I get stressed as I have more work to catch up on the other days. Not to mention gas is wayy more expensive, wear and tear on the car, 2+ hrs stuck in commute, CLIMATE CHANGE.\n\nI'd be financially comfortable for at least 6 months, and financially ok for the next 9 months.\n\n&amp;#x200B;\n\nI don't like confrontation so I'm scared to just say \"NO\". Should I just resign? People would say to just coast, Leetcode, interview, etc... but I literally have no time to do that. I have 2 babies, the work itself is a lot and the new boss is a bit of a micromanager. I'd get maybe 1 hr after dinner when I'm drained to interview prep. I'd rather quit, devote 3 months to Leetcod'ing non-stop, then interview around.",
      "subreddit": "cscareerquestions",
      "score": 753,
      "url": "https://reddit.com/r/cscareerquestions/comments/12ga41h/if_youre_mostly_financially_ok_would_you_quit_if/",
      "comments": [
        {
          "body": "Do you have a technical manager, or is this exec the only boss? I'd just tell him that you aren't going to get any work done at the office, and that he's losing out on your productivity by making you commute. \n\nDepending on how that conversation goes, you have options. If it goes poorly, maybe brush up on your interview skills. \n\nAlso, you could just drive in for the sync meeting, and then leave immediately for home afterwards. Tell them you will get more done this way and see how they react. What I wouldn't do is put in more work on other days to try to make up for your lost productivity due to the commute.",
          "score": 279
        },
        {
          "body": "In your situation with 2 kids I'd take the safe route and look for other jobs while you're still working. The 1 hour after dinner may be your best option here. If you didn't have dependents I'd vote to take the risk, but 6 months of savings is too risky for that with kids - what if one has a medical emergency that costs you a fortune? \n\nBut to answer your question I wouldn't quit immediately. Personally I'd wait it out longer until it really really bothered me. One day with an hour commute isn't that bad, in my opinion",
          "score": 105
        },
        {
          "body": "i would just look for a new job simple. When you got an offer, if you want to stay but be remote, just say \"I am leaving if i dont work remote...\" stating your reasons",
          "score": 97
        },
        {
          "body": "Have you tried reasoning with your boss at all? I know you said you don’t like confrontation, but this is a situation where it pays to put on your big boy pants and have an adult conversation. \n\nYou could simply say that you’re not getting a ton of value from these meetings and that the commute is significant for you and you’d like to find a workaround. This could be that you do the meeting remotely, or it could be finding an easier time and taking the commute as part of your workday etc. Maybe you could also get it reduced down to every 2 weeks or even once a month. \n\nYou could also see if you can find ways to make the day more valuable to you. Have you raised the idea of doing brainstorming or having working sessions? I’m fully remote but to be honest with you, I’d love to be in a room with my coworkers every so often. If it’s a 50 mile drive imo once a week is way too often as it’s a waste of a day. But once a month would be pretty nice.",
          "score": 97
        }
      ]
    },
    {
      "title": "Applicants turn camera off",
      "body": "Hi, I've been interviewing quite a few people recently for a remote role and noticed most don't bother turning on their camera. It's a bit awkward but I decided to keep mine on anyway.\n\nIs this very common in your experience?\n\nI assume they might do it for bias reasons (definitely had women not wanting to get judged because of their appearance and I get that from what I've seen in our field) or just don't feel like it. I didn't push for it as I generally tend to have my team decide by themselves if they turn their camera on during meetings and glad to do as much as possible in Slack. But for a first time meeting people I still find it super hard to... bond with them and then later tell them apart. Or even hire someone without ever having seen their face once.\n\nLast time I interviewed people for my team a few years ago I didn't notice this, most just seemed to turn on the cam without having it explicitly stated.\n\nEDIT: \n\nFor the next rounds I'll definitely see that I explicitly state \"video call\". I was just surprised people don't do this by default but perhaps I'm just becoming boomer :). But there's a \"give a talk and we discuss\" round anyway, so I hope at least there they'll turn their cam on.\n\nI should probably add, this is for a very senior/scientific role, so we also have to meet customers at least virtually, pitch projects, give talks, hold webinars, perhaps go to a conference etc.\n\n",
      "subreddit": "cscareerquestions",
      "score": 460,
      "url": "https://reddit.com/r/cscareerquestions/comments/1cm6dwq/applicants_turn_camera_off/",
      "comments": [
        {
          "body": "1. I think you should make it explicit that its a video interview, some people may assume its a quick call.\n\n2. If its clear that its a video interview, candidates that refuse to turn on their camera should cease to be candidates. They may have valid reasons, but they could also be trying to do some identity fraud and thats not a risk you should entertain.",
          "score": 810
        },
        {
          "body": "After being burnt once by this all technical interviews are either in person or with the camera on and the screen being shared. \n\nI don't care what you look like, I do care about verifying that the person I'm speaking to is the applicant for the job.",
          "score": 186
        },
        {
          "body": "I'm not interviewing people remotely without them having their camera on. I'd ask them to turn it on and if they'd refuse, it would be a very short interview.\n\nCheck with your manager what their view is on this.",
          "score": 765
        },
        {
          "body": "I had an awkward situation a few years back when I was interviewing and the interviewer did not have his camera on while I did. Never said the reason why or attempted to turn it on. I stared at his name on Zoom for 30 min while talking to him. He also told me he was short on time and had something scheduled right after (not work related), and made it sound like the interview was poorly scheduled (honestly probably was, but that's not my fault). He would have been one of my team leads. No thanks, didn't follow up.",
          "score": 28
        }
      ]
    },
    {
      "title": "How to say \"no\" to working overtime (non production release) when its because your manager over-promised and over-scoped for the client?",
      "body": "At my current job for now 7 months, and already interviewing other places for many reasons. One unrelated (but now pushing to leave even more) thing is the **subtle, passive \"working overtime\" culture.**\n\nSo far, I've never had to really \"work overtime.\" I've worked more than 40 hours a week to knock something out on my own because I was in the zone, or in anticipation for being in part of the the following week. But never actually 'worked overtime' because it was required. Why? Because I've always gotten the work done, even in \"crunch time.\"\n\n**The problem is, this company has 'crunch time' every sprint it seems.** Why? because out manager over commits, doesn't use estimates/velocity/etc. So same shit, different week. Why? Because the new company clearly has a top-down culture of \"get it done quickly and get a lot done so we get paid by the client.\"\n\nI've brought up \"slowing down and estimating correctly\" but have pushback due to \"sometimes we just gotta work to get it out the door.\"\n\n\n---\n\nThe above is evident again when our director mentioned \"lets get this done, overtime is available for whomever needs it. We have a client we need to get this to, they are expecting it.\" \n\nI'm so sick of it. But this time, I'm not gonna get \"my assigned tasks\" done, because I had to help out another dev with their tasks since those were priority. And this will be the first time that I likely wont finish and will be asked \"you working this weekend to finish?\"\n\n---\n\n**TLDR: How should I/do I say no?**\n\nNow, I have plenty of experience saying no to PO/PMs at the BEGINNING of the sprint/planning phase. But I've never told a manager \"no. I'm not working overtime.\" This is a different topic entirely and basically being insubordinate to your manager. This isn't the same as trying to better the project trajectory. This is me saying 'im not gonna save your ass because you over-promised the client and over scoped'\n\nI already have one foot out the door, interviewing with companies that would pay me 40-60% more if they picked me (please god get me out of here). So I'm wondering if anyone else has been in this situation and how have you handled it? I wish i already had offers. Because then I'd just respond on slack with \"no\" or \"its the weekend. I have a family\"",
      "subreddit": "cscareerquestions",
      "score": 690,
      "url": "https://reddit.com/r/cscareerquestions/comments/lr349z/how_to_say_no_to_working_overtime_non_production/",
      "comments": [
        {
          "body": "&gt; \"you working this weekend to finish?\" \n\nSorry I have prior commitments.",
          "score": 332
        },
        {
          "body": "\"No.\"",
          "score": 503
        },
        {
          "body": "I think the best response is \"I was told to prioritize X, so that's what was completed. Weekends are time for me to spend with my family.\"",
          "score": 268
        },
        {
          "body": "The answer's already been given - it's **NO**.\n\nI've worked in consultancy, so I'm well-aware of this tactic, having witnessed it at almost every company I've ever worked at. For those that aren't aware of how stuff is run in small consultancies and agencies, the flow is usually this:\n\n* Many companies bid on a project, and more often than not, the lowest bid wins, and everyone knows this. It's all about pushing your luck, because being honest will mean you get zero work and have wasted seveal people-days on pitch prep.\n* A lot of project prep happens, usually with BA's, PM's, and someone from senior tech to go through the requirements.\n* The project comes in, and people start working on it. Often, things are unearthed that indicate that the work is far more complicated than you'd initially think - but the deadline is set.\n* The project is either done on time, or the company eats the extra cost. Sometimes this is small and factored into the bid where possible, and sometimes it's enough to tank a company.\n\nIMO, you don't need an actual reason to say no, but if you want to be tactful you could just say that you're busy, either spending time with your family, getting drunk in a bar, or doing whatever you like to do in your own free time.\n\nWith that being said, my policy on working late is always \"don't, unless it's to help someone that genuinely needs it\". If it's a director that over-promised I won't help, but if a PM needs something done to not get yelled at, or a fellow engineer is struggling with a problem that needs to be sorted/reviewed, I'll help out as much as I reasonably can. If there's one thing that consultancy can teach you, it's empathy, because everyone is an email or a phone call away from being yelled at by a client in the most brutal fashion. Sometimes it's someone being a dick, and sometimes it'll be someone threatening to ruin your personal credibility. I once had a junior PM break down in tears because a client threatened to publicly drag her name through the mud as being personally responsible for a release being delayed (due to a third-party booking problem, not even our fault). A lot of engineers on here like to say that they're \"not code monkeys\" and that \"they sell themselves as selling business problems\", and IMO this is ultimately the consultancy mindset, so it's how you should view any problem you face on the job. \n\nYou say that you have crunch time every sprint, but I think you need to dig into why this is the issue. Is the PM doing a poor job of implementing scrum? Are their hands being tied by senior-level management? Do they need the tech team to back them up to help improve the process? Going back to empathy, this problem might be a bit deeper than simply knowing how to say no to overtime.",
          "score": 52
        },
        {
          "body": "boat unused plate public reply whole salt rob fear puzzled\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "score": 236
        }
      ]
    },
    {
      "title": "Took 6 months to get a job w/ no internship, heres my 2 cents",
      "body": "Just as a disclaimer, this is not to brag but rather offer some advice for whomever may be in that dark place i was in a couple months ago. I was one of you, lurking this subreddit frequently  for any tips or leads on how to get closer to a job. \n\n1. Dont spend too much time on personal projects with hopes that it may supplement your work experience. As a new grad, i had a decent list of projects but it didn’t quite fill up my resume. I did a couple personal projects on my free time after graduating and filled the remainder of my resume. These were excellent talking points in interviews and gave interviewers subjects to question me with and determine my understanding. \n\n2. Leetcode is an excellent way of progressing towards your end goal, acing interviews and getting jobs. Once i started spending my days working on leetcode as “my job”, i became very confident in my ability to be able to perform in interviews. In fact, of the handful of interviews i had, all questions i received had either been completed on leetcode previously or i had solved something similar to it. No matter how stupid you may think it is, this is the reality. Any job you go for will ask you at least one whiteboard question to complete. You can help yourself with this aspect of the interview or leave it to luck.\n\n3. Have a professional presence online. Its not absolutely necessary, but it helps. The first step to this is with your resume. Yes, you have the standard black and white resume. But have you ever seen how good a little color on a resume looks? \n\n4. Imitate successful people around you. Successful being “have a job” or whatever you define success as. I saw a friend of mine who was quite successful. I saw his personal website and quite literally copied most of his ideas and implemented them my way. I used his resume format and color scheme as well because hey, hes got a job and hes my age/position. Hes definitely doing something right and his website and resume really stand out.\n\n5. Keep a cool head and be ready to talk to humans on the interview. I had a bunch of online coding tests that went nowhere, but out of the 2 in person interviews i had i scored on both, and i had a good feeling directly after the interview that i had gotten the job. This was because besides answering their questions well for the most part, the interview flowed like a conversation i would have with my friends, if they were asking me questions. You still want to keep it professional, however, its not an interrogation. You’re going to be working with these people everyday, and i believe the interviewers are more aware of this than the interviewees. If they cant talk to you normally, or you just dont have a likeable personality at the interview, they probably wont want to work with you.\n\n6. Keep a positive attitude. My god once i hit my 5th month jobless i would cry every night. I didnt have time during the day because i was “at work”. Which is basically the local coffee shop working leetcode questions untill the coffee shop closed. However, that little crying i did at night helped me release how i felt and then think positive and keep moving. Find a way to deal with the negativity and remove it out of your life so you can think positive! When you give into negativity, you slack, you give up, you become cynical and make bad decisions. Mentality is very important and keeping busy with something helps a lot. \n\nHopefully this is visible for the people that need it the most as these are the lessons i learned along the way. I think im set now. Just had my first month performance review and was told that im vastly over performing the usual expectations and the company is really happy with me. Just because i had no internships did not equate to how good of a software engineer i was. Things just didnt work out, i never had a good schedule and missed out on internship opportunities.\n\nJust keep pursuing your goals everyday. You will get it eventually!\n\nEDIT: currently at work, will be getting to replies soon when i have some free time.\nAlso i graduted from pretty much a no name school with honors, 3.6 gpa cumulative. More like ~3.9 major gpa which i was able to use.\n\nAlso i noticed theres some confusion on #1. I developed personal projects just to fill my resume up/ learn tech for myself. Most of my time was better spent on leetcode upping my algorithm skills. In my experience personal projects only carried me so far, and no one really looked at my github to see my other projects. Use it as resume filler and learning new tech for yourself.",
      "subreddit": "cscareerquestions",
      "score": 896,
      "url": "https://reddit.com/r/cscareerquestions/comments/e9jmcg/took_6_months_to_get_a_job_w_no_internship_heres/",
      "comments": [
        {
          "body": "Anymore advice you can give that expands on #6? I'm scraping by at a min wage job and I really need to get back into tech. Crying every night is currently a thing.",
          "score": 189
        },
        {
          "body": "goodbye reddit -- mass edited with https://redact.dev/",
          "score": 94
        },
        {
          "body": "Not sure what you mean by #1.  It sounds like doing personal projects worked out well for you.",
          "score": 142
        },
        {
          "body": "7. Take care of your health. Make sure to get some exercise and eat as healthfully as possible.",
          "score": 34
        },
        {
          "body": "\n&gt; These were excellent talking points in interviews and gave interviewers subjects to question me with and determine my understanding.\n\nPersonal projects are absolutely useful when you have no experience or internships. Interviewers want to know how much you know and if you have nothing for them to question you on, how are they going to figure that out?\n\n&gt;Any job you go for will ask you at least one whiteboard question to complete.\n\nThat not at all true. Many of my friends and I never got asked a single whiteboard question for the jobs we took but definitely expect whiteboard questions the more tech oriented a company is.",
          "score": 24
        },
        {
          "body": "I don't get #1. You say not to spend too much time on personal projects but then say they helped you during interviews? Not sure if it was a mis-type but I'd have to disagree. Personal projects are definitely beneficial especially if you have no work experience.\n\nI disagree with #2 as well. The two jobs I have held so far did not ask any leetcode questions. That more depends on the location and type of company you're applying to.",
          "score": 23
        }
      ]
    },
    {
      "title": "Got contacted for an on-site interview (summer internship) that's scheduled for tomorrow morning. My slacks and khakis don't fit. What do I show up in?",
      "body": "I have a pair of gray khakis that I can at least get on but are tight around the waist and seat (like super obviously).  About the best clothing I can do that fits is jeans and a polo.  This is a company I met through a career fair and I was wearing jeans and a sweater then, but I don't know if on-site will be nearly so lenient.  Will they be merciful on a college student or am I pretty much unpresentable?\n\nEDIT: Update just before interview, found a serviceable pair of khakis.  Didn't anticipate rain and now I'm soaked.\n\nEDIT 2: Interviewers in jeans and polos, doubt my attire mattered.",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/5si7kz/got_contacted_for_an_onsite_interview_summer/",
      "comments": [
        {
          "body": "Better to wear jeans and be confident than tight clothes that will prevent you from thinking about how 2 fizzbuzz.",
          "score": 11
        },
        {
          "body": "Where are you located? Stores are still open in all of the US at the moment.  Go get what you need now or really early tomorrow morning.\n\nIf you can't afford it you can go with jeans and a button down.  Slightly better than jeans and a polo.",
          "score": 3
        },
        {
          "body": "It really depends on the company. If it's Google or other company with that young feel they won't really care what you wear as long as you nail the questions. If it's an old company like those thaqt still require employees to always work with a dress shirt, professional appearance in the interview can definitely be one of their factors",
          "score": 2
        }
      ]
    },
    {
      "title": "I Went From Making $35k to $120k in 3 Years - AMA",
      "body": "## **Introduction / TL;DR**\nThis will be a (likely long) post discussing how I went from living paycheck to paycheck and going through a divorce to entering the IT field as a developer, and more than tripling my income in three years. AMA, if you want to read the story/journey, see below.\n\n## **Where I Started**\n### February 2015 - $35k:\n * I was a month from my 24th birthday.\n * I worked at a cell phone company doing sales part time, making about $35k a year (including commission) in a High CoL area.\n * I was living paycheck to paycheck, some payment arrangements here/there to make ends meet, and borrowed some from family to keep food in the house.\n * I was married, but going through a divorce after my ex had an affair and decided to stay with the guy. I found out about the affair the day before Thanksgiving in 2014 (about 2 months prior to this).\n * I decided to start life fresh and moved out of state, transferring with the company I was with and working at one of their call centers for again, about $35k a year (depending on bonuses), though this was full time at $35k a year instead of part time. This move was to a Low-Med CoL area.\n\n### August 2015 - $40k:\n * I enrolled in school at /r/WGU and started my Bachelors in Software Development. WGU, if you don't know, is an online school with accreditation that has a better rep than say, University of Phoenix or ITT Tech, but it's definitely not a top school by any means (sorry fellow alumni, but it's the truth). The classes were decent, but it's not the same as a traditional school IMO. However, it's what helped me get into the career field.\n * Around the same time I enrolled in school, my roommate in Idaho was able to help me get a position as a contractor for an international technology company, doing manual software testing of a web app. This was for $40k a year roughly. This was still in the same Low-Med CoL area.\n\n### August 2016 - $50k:\n * By August 2016, I was around half way through with my degree at /r/WGU. I started with 3 credits, needing around 123 total, but WGU let's you \"accelerate\" learning by testing out of classes as soon as you enroll in them. I was doing upwards of 30+ units a term at times.\n * I had helped found a slack group for WGU IT students to connect, since the school had little in offerings for students to collaborate together. The group was founded in April 2016 I believe, and we had over 1000 members within a year.\n * Through networking with students in the slack group and with some developers at my current position, I was able to get an interview and earn a position as a junior software engineer at the same international software company, but not as a contractor, as a full time employee.\n * This new role was a sweet $50k a year, first salary role, and it felt amazing. This was in the same Low-Med CoL area.\n\n### April 2017 - $70k:\n * By March of 2017, I graduated from /r/WGU with my Bachelors in Software Development, and had began looking for new-hire jobs.\n * I was able to find a local job, and moved into a SDET role at $70k a year, in the same Low-Med CoL area.\n * This role was great, and I really shined here. I was ecstatic to have double my income in two years, and the benefits with this company were fantastic.\n * I applied to and was accepted to the /r/OMSCS program from Georgia Tech, a school ranked top 10 in the nation, and the world, for computer science grad programs.\n * Though /r/WGU wasn't a great school, I was able to get in to OMSCS, and I planned to start Spring of 2018, taking Fall 2017 off.\n * Unfortunately, life calls sometimes, but I continued my journey onward...\n\n### November 2017 - $95k:\n * Around the end of 2017, I decided to make the move out of state again to be closer to family. The state I was living in was great, but I had a few friends, no family, and really felt like I needed to move on to somewhere new.\n * I worked with a staffing agency and was able to apply for a position close to family in a Medium CoL area.\n * After a few rounds of interviews, a flight out to the company, and some negotiation, I accepted an offer of $95k a year. To give an idea, the CoL difference was about $10k a year more here than my previous area, so this was still a significant raise.\n * Once I started in this new company, however, I found  the culture to be *VERY* opposite of what I had expected and been used to.\n * The company was basically the movie *Office Space* on steroids, and I realized I needed to find something else.\n * I got a bit depressed, upset, and hard on myself thinking this move was a complete mistake.\n\n### January/February 2018 - $120k:\n * In January 2018, I started at Georgia Tech in the /r/OMSCS program. So far, about 7 weeks in, it's going fantastic and I love the class I'm in, currently holding a 100% perfect grade.\n * At the end of 2017, I began interviewing with what I considered to be one of my unicorn companies.\n * After an intense, multi-round, few month process, I was given an offer for around $120k a year, with options, and amazing benefits.\n * The job is 100% remote, and for now I plan to stay in the same Medium-CoL area that I'm in now.\n\n## **Summary**\nIn February 2015, I considered my life to be at (or near) an all time low. I was depressed, barely able to make ends meet, and making about $35k a year working my ass off to make sales for commission. 3 years to the month later, I'm starting a position making over 3x's that amount, have been able to pay off a LOT of debt (still some to go), start and finish my bachelors degree, start my masters program, and live a MUCH happier life.    \n\n\nAll of this to say, follow your dreams, push on, when life throws you a curve, lean into it. Feel free to **AMA**, PM or comment below.",
      "subreddit": "cscareerquestions",
      "score": 546,
      "url": "https://reddit.com/r/cscareerquestions/comments/7y0oef/i_went_from_making_35k_to_120k_in_3_years_ama/",
      "comments": [
        {
          "body": "I've been around since you started slack - 7 classes left to go at WGU and just got my first job as a dev a little over two months ago. :) ",
          "score": 115
        },
        {
          "body": "what is your favorite fruit",
          "score": 74
        },
        {
          "body": "[deleted]",
          "score": 27
        },
        {
          "body": "That's insane! $120k after, what, 18 months in the industry? That's nuts!\n\nYou give me hope because I'm in a similar situation though a couple years older - I make ~42k in a semi-technical role (like a quarter of the job is being a bug monkey).\n\nIt's cool to know it's possible to get into OMSCS with it too! No questions...",
          "score": 53
        },
        {
          "body": "Any tips you have on interviewing for people that haven't ever worked in the industry? Also congrats! That's super exciting!!",
          "score": 15
        }
      ]
    },
    {
      "title": "What are the stages of the Slack internship application process (i.e. coding challenge? on-site interview? whiteboard interview?)?",
      "body": "",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/70sdsu/what_are_the_stages_of_the_slack_internship/",
      "comments": [
        {
          "body": "https://slack.engineering/a-walkthrough-guide-to-finding-an-engineering-job-at-slack-dc07dd7b0144",
          "score": 1
        },
        {
          "body": "Can anybody tell me how hard codility challenge will be?",
          "score": 1
        },
        {
          "body": "Did you do the slack bot challenge?\n",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone interviewed and got an offer from Slack?",
      "body": "I interviewed for an internship at Slack a few months ago and unfortunately did not make it through.\n\nTo improve my chances and also understand why i got rejected, if anyone got an internship offer at Slack, would they mind pm'ing me their code repo? (i had to make a slack-bot for tictactoe) ",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/5qj8ik/anyone_interviewed_and_got_an_offer_from_slack/",
      "comments": [
        {
          "body": "One of my friends got lucky as hell with Slack: they called her in for onsites, apparently liked her so much in her 4 behaviorals that they extended an offer to her without a technical. Don't know if she had a phone screen before. ",
          "score": 23
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "To anyone trying to get a job, have faith!!",
      "body": "About 2 years ago I decided to teach myself React.js and I sat down with a you tube tutorial into the syntax and how to write JS. Then once that had finished I was wondering what to do now? Like so many people who get to this stage and decide I have not really learned much and not really getting this, so I will give up. I think this is where a lot of self-taught devs drop off. You learn all the syntax and how to debug a syntax error and not really how to create something.   \n\n\nSo I decided to go to uDemy and learn how to make a [slack clone](https://slackclone-5f7d8.firebaseapp.com/).  That taught me so much about debugging, flex boxes and frustration. I built it and was proud of it. Now what next I am not job ready so let me try and build something else...   \n\n\nI decided to try my hand at React Native this was just before covid hit and I was furloughed from a job I hated. Which I was ecstatic about because it gave me time to code and cycle. I continued trying to make an app for my cricket club, which never materialised unfortunately. I continued playing around with RN and building silly apps that never got anywhere but I learned so much.   \n\n\nThen in December a recruiter had seen my Linkedin profile and decided to give me a call about a contract job, and said that they were keen to hire ASAP and I should have an interview the next day. He also told me the name of the company. He requested my CV and I sent it over with a link to various projects and my Github. Then I never heard back from him. I was ghosted by him.   \n\n\nI found the CEO on Linkedin and sent her a message with my CV and GitHub link and my story and being upfront and honest about this being my first job and I am keen to learn. I had a call with the CEO and the CTO that same day and got the job. I have been working at the company since January and I have been learning so much and improving each day. \n\n&amp;#x200B;\n\nSo for any devs trying to get a job:   \n\\- Don't give up  \n\\- Be relentless  \n\\- Always learn   \n\\- Publish your code on social media  \n\\- Write medium about what you are building  \n\n\nGood luck you can do it.   \nPS I am 36",
      "subreddit": "cscareerquestions",
      "score": 769,
      "url": "https://reddit.com/r/cscareerquestions/comments/nm8xut/to_anyone_trying_to_get_a_job_have_faith/",
      "comments": [
        {
          "body": "Instead of making a survivorship-bias type of post, I'll just go ahead and say congratulations. I know some of these types of threads can make some people bitter, but I'm happy to see people getting out of the hole that is job hunting. \n\nI applaud you for learning to do something by *doing*. Even if it was just a slack clone, there are so many people that just apply to these same jobs with an empty portfolio. I know some Boot Camps make you do similar projects as your \"final project\" when you graduate from there, so that already puts you somewhat up to par in that area.\n\nGood luck with your new job! Hope it works out!",
          "score": 200
        },
        {
          "body": "\"I found the CEO on Linkedin and sent her a message with my CV and GitHub link and my story and being upfront and honest about this being my first job and I am keen to learn. I had a call with the CEO and the CTO that same day and got the job\"\n\nBeside hard work this is the reason of your job success. Many people don't reach out to hiring managers.",
          "score": 95
        },
        {
          "body": "Can I see the source code of your slack clone?  \n\n\nPS: congrats!!!!",
          "score": 17
        },
        {
          "body": "[deleted]",
          "score": 8
        }
      ]
    },
    {
      "title": "Advice about internship interview With Slack",
      "body": "Hi, \nI have my Summer internship interview with Slack in the upcoming week. \n\nI want to know if anyone here interviewed with Slack?  How was the interview process and problems?\n\nThank you.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/42qr8d/advice_about_internship_interview_with_slack/",
      "comments": [
        {
          "body": "I haven't but you could [check them out on Glassdoor.](https://www.glassdoor.com/Overview/Working-at-Slack-EI_IE950758.11,16.htm)",
          "score": 2
        },
        {
          "body": "i haven't but you could check careercup, they have interview  questions for a lot of places",
          "score": 1
        },
        {
          "body": "30 minute interview to gauge your passion for slack / interests, no technical questions. coding challenge after",
          "score": 1
        }
      ]
    },
    {
      "title": "Slack channels for interviewing each other?",
      "body": "I know there are a ton of slack channels out there for frameworks, languages, etc. Are there any for practice interviewing? (Or discord)\n\nAnd if there aren't, we should totally make one!",
      "subreddit": "cscareerquestions",
      "score": 21,
      "url": "https://reddit.com/r/cscareerquestions/comments/4n7mtz/slack_channels_for_interviewing_each_other/",
      "comments": [
        {
          "body": "Do it on pramp.com, I have done about 10 interviews already",
          "score": 11
        },
        {
          "body": "Not to stray off topic too much, but whatever happened to that post where we were supposed to organize mock interviews with each other.",
          "score": 4
        },
        {
          "body": "Pramp is great, but I would also like something like what you're talking about. I think discord might be preferable because of the group chat channels.",
          "score": 2
        }
      ]
    },
    {
      "title": "600 applications, 9 months after graduating with a CS degree. Should I just give up?",
      "body": "Due to health issues I barely graduated with a 2.9 and no internships in college. I’ve been applying like crazy and get my resume reviewed a lot in discord/slack by people in the industry and I get mixed reactions between “seem reasonably good for a new grad” and “no internships good luck finding job.” \n\nWhat I’m currently doing is making a crud app with Node/React. It’s taking forever to finish because a majority of my time is trying to figure out design choices so it doesn’t look amateur without even having a complete idea of what I want it to be capable or look like. \n\nMy other project is a web scraper.\n\nMy 2 other projects are from school, a binary classifier and backend in JSP for a crud app (front end is barebones html). \n\nI’ve applied to probably 600 positions now and have recently been applying to only start ups. I’ve had 1 interview failed with a startup and 2 phone screens to which they never got back to me and later said they won’t be moving forward.\n\nAm I too dumb to get a job in software development?\n\nEdit: my resume https://imgur.com/gallery/bmVoyi2. Ignore the objective as I will be omitting it",
      "subreddit": "cscareerquestions",
      "score": 337,
      "url": "https://reddit.com/r/cscareerquestions/comments/ntaycv/600_applications_9_months_after_graduating_with_a/",
      "comments": [
        {
          "body": "Post redacted resume. \n\nYou could have the neatest projects in the world but if you can't properly convey what you actually did and what you know you'll be out of luck.",
          "score": 290
        },
        {
          "body": "Resume. Resume. Resume.\n\nYou can talk all you want about the jobs you've applied to, where you're applying, what skills you have. None of it matters. If you're not getting interviews after 600+ apps, the problem is your resume.\n\nYour 200th rejected application with no interview should've been a huge red flag that something is wrong. But better to notice later then never. What you need to do now is post your redacted resume here in this thread and over in r/EngineeringResumes where you can get some advice and fix your resume. Maybe even DM some people and read up on previous resume threads.\n\nSo no don't give up, at least don't give up just yet. Improve your resume, and try again. Once you have, let us know how it's going.",
          "score": 60
        },
        {
          "body": "Don't have any advice to give but im in the same situation bro. Currently working a shitty retail job 40 hours a week on top of doing projects and applying for jobs. Graduated a year ago and I don't see my position changing anytime soon. \"Go into CS you'll get a job ezpz\" they said... What a joke 🤣",
          "score": 115
        }
      ]
    },
    {
      "title": "Name and Shame: Samsara",
      "body": "Went through their interview process for a SWE position a couple weeks ago. Was ghosted, still haven’t heard back after emailing a couple times. Most of my interviewers and the recruiter there were incredibly unprofessional. The onsite had a coding + debugging + systems design + product demo + hiring manager round. I have done 15+ onsites over the past couple of years and this one was by far the worst interviewing experience. The interviewers acted like they didn’t care at all and weren’t engaged with the conversations, and some seemed like they were doing other work/ responding to slack messages during the interview and not paying attention. For such a successful company with smart engineers (lots of ex FAANG + MIT/Stanford/Berkeley grads), I am disappointed at how poorly they treat their candidates. Complete waste of my time. Can confirm the bad interview reviews from Glassdoor and Blind.",
      "subreddit": "cscareerquestions",
      "score": 720,
      "url": "https://reddit.com/r/cscareerquestions/comments/e1i32u/name_and_shame_samsara/",
      "comments": [
        {
          "body": "Sometimes you may find that the more ivy ex fang employees there are the more conceited, pompous they are.",
          "score": 438
        },
        {
          "body": "I can attest to this. Sounds like my experience. The hiring Manager seemed to be going through the motions and barely asked any questions. At the 30 min mark, she cur me off cause she had a meeting. The coding portion of the interview was done by someone working on their laptop and replying with “uh huh” to any question or comment I made. One other interviewer either seemed bored or Xanaxed out of their minds....! Was rejected the next day.",
          "score": 76
        },
        {
          "body": "Their hubris will be their downfall. This disrespectful behavior will eventually bite them back on their asses in the future.",
          "score": 41
        },
        {
          "body": "Fuck them. You deserve better.",
          "score": 84
        },
        {
          "body": "[deleted]",
          "score": 28
        }
      ]
    },
    {
      "title": "Just ended a recent job search as a pretty average mid-level developer. Here's how it went",
      "body": "## Overview\n\nLittle bit about me: I am a Software Engineer living in Boise, Idaho. Here’s my resume [on google drive](https://drive.google.com/file/d/1n_gQeO15QkA3p9q6Tpaz3T_yGCBxdfKx/view?usp=sharing). I previously worked at CPA Global working on enterprise java applications, with a good amount of AWS thrown into the mix. I started looking due to some issues with the remote DevOps team; I was essentially doing double duty due to the fact that the DevOps professional did not show up for (remote) work. That professional was in a different division than me and was friends with his boss, so he basically got away with everything while I picked up the slack. While I’m not adverse to doing work, it was frustrating seeing someone else collect a paycheck for my work.\n\nThere’s a lot of talk on here about career prospects from FAANG developers living in huge tech hubs. I’m not that guy. Don’t get me wrong, I’d love to be that guy. I’ve made it to the onsite round at FAANGs multiple times, but I never got it quite right.\n\nWhile I still obviously want to push myself in terms of my career, I had to be honest going into this job search: Going for a Big-N company was a pipe dream, and I should focus on more realistic prospects during my job search.\n\nI’d also like to take this time to apologize if it seems humblebraggy. I went back and forth whether to post this, and ultimately decided to post on the idea that more information is always better, even if said information is a bit annoying.\n\n## My Job Search Methodology\n\nDue to the small selection of roles locally, I decided to consider both local and 100% remote positions. I chose the shotgun approach. Every weekday, I would apply to as many jobs as I could for thirty minutes. If an application was taking longer than 5 minutes, I would abandon it. I altered between three websites: LinkedIn, Glassdoor, and Indeed.\n\n## Results\n\nI started my job search on May 11th 2020. I finished my search on July 2nd 2020. In this time I applied to 221 jobs. While I don’t have exact numbers in front of me, roughly 10% of those applications resulted in any kind of positive response. From there, my results were more positive. Ultimately, I received three offers (and withdrew from five prospects once I ended my search). These offers were:\n\n* A Government Contracting Company - Note the position was full time, but the company itself receives federal government contracts. I actually received a contingent offer about three weeks into my search, but it required me to go through government clearance. Because I didn’t view that as a guarantee (I smoked weed in college and was cited for minor in possession of alcohol by Ames PD), I kept looking\n* A Seattle based startup - This one was a bit disappointing. The job posting listed a much higher salary than what I ended up getting offered. Not like “low end of the range”, but like half as much as what was listed. I think there was some miscommunication. Either way, we couldn’t come to an agreement on compensation.\n* An LA based startup - This is the offer I ended up taking. Compensation was actually above what I was expecting, it seemed to have a good work/life balance, and it’s 100% remote so I can eventually move if I want to.\n\n## Salary\n\nSo usually salary posts here are humblebrags. I apologize if it comes off this way. I’m excited so it’s hard to write without a bit of that leaking over. While I’m really happy with the results, but they’re still not anything compared to big city or big-N salaries. Part of the reason I live in Boise (also it’s absolutely gorgeous) is to attempt to mitigate the non top-tier salary with a lower cost of living. Anyway:\n\nPrevious Job - 100k base, 6% 401k match, possible 10% bonus (was 3% last year, likely to be even lower this year), HSA health plan.\n\nNew Job - 140k base, 5% 401k match, no bonus, PPO health plan.\n\nI get there’s probably a lot of big city based developers giggling about how I can be excited about that, but you gotta realize it’s essentially a forty percent increase for me. That’s a big deal for me.\n\n## Some Observations\n\n* Only a small number of companies asked any coding questions, and most of those are things I would consider an “easy” level on leetcode. This was a bit of a disappointment as I’ve spent a lot of time grinding those types of problems. In the future, I plan to spend this time on coding projects.\n* There were a LOT of questions about AWS. I was able to answer them well (ironically due to the reason I was leaving my current position), but it’s still surprising how much interest there was in DevOps technologies considering I was going mostly for traditional developer positions.\n* There were a considerable amount of questions concerning application design and architecture. I like those vs leetcode style questions because I feel they much more accurately reflect skills required to be a successful developer.\n* My success was much higher in June than it was in May. I think that companies who were able to weather the pandemic have started hiring again, at least tepidly.\n* While I essentially only had a 1% application to offer rate, it was a lot easier to create a generic resume and shotgun it out than it would have been to research and pinpoint specific companies and tailor my resume. 9/10 would spam again.\n* The job search led to a LOT of phone screens and video interviews. If I wasn’t working remote due to covid 19, It would have been a lot more difficult to conduct these interviews\n\n## Final Thoughts\n\nI know I’m not top-tier and my approach was heavy handed, but I got a big raise in a relatively short matter of time during an economic downturn. I call this a win.",
      "subreddit": "cscareerquestions",
      "score": 379,
      "url": "https://reddit.com/r/cscareerquestions/comments/hodfy7/just_ended_a_recent_job_search_as_a_pretty/",
      "comments": [
        {
          "body": "Stop putting yourself down in your post 😠\n\nCongrats dude",
          "score": 250
        },
        {
          "body": "[deleted]",
          "score": 78
        },
        {
          "body": "$140K a year is pretty top tier!!",
          "score": 46
        },
        {
          "body": "Some firms have high initial offers and then low ball you when it gets serious. I saw this a lot when I used Hired.com.",
          "score": 34
        },
        {
          "body": "&gt; Only a small number of companies asked any coding questions, and most of  those are things I would consider an “easy” level on leetcode. This was  a bit of a disappointment as I’ve spent a lot of time grinding those  types of problems. In the future, I plan to spend this time on coding  projects. \n\nI like this",
          "score": 28
        }
      ]
    },
    {
      "title": "Didn't get a job cause i play video games...",
      "body": "Using a throw away since some of my family members know my Reddit account and i really don't know how to tell them that i blew the job interview.\n\nA little back story: I just graduated highschool and have been doing freelance web development with my friend since i was a junior. He does most of the backend were i do most of the frontend (I enjoy design and logic, so front-end seems to be a perfect fit for me) We have never made one customer unhappy, all of our projects have been good, and our customers are always satisfied (Not bragging) I also mess around with other technologies outside web development like C#, Python, Go, Java and many other languages. My Github is full of random projects that i have worked on and would consider myself extremely comfortable with HTML, CSS and JavaScript. My friend has just went off to university which leaves me unable to do freelance since i don't really know much about backend development and really i need to start working since i am fresh out of highschool. Plus the freelance gig was not paying well, but it put gas in my car and was enough for a highschool student. \n\nNow that we got some of the backstory out of the way, here is where the title comes into play. Since i was a pretty good front-end developer and had loads of programming experience (All real world experience and almost 0 CS knowledge) I decided to apply to a \"Front-end Web Developer\" position in my town. The salary they listed was great (50k starting), and they would give me some training if i needed it. I applied and got a call from them saying that i was just what they were looking for and they would love for me to come in for an interview. \n\nGreat! I finally had my interview! This is my chance! (I was wrong) I walked into the interview confident and ready to be asked questions, i shook hands with the interviewer and we talked for a bit. Everything was going well, he was looking through my Github then stopped suddenly and began to look rather worried. I didn't really think anything of it, but then he said these exact words: \"So, you are a gamer.... I see a project for a Runescape gold mining bot, is that correct?\" I told him all about the bot and how good it was at getting things done, and getting the maximum gold possible. He didn't like that at all...\n\nHe told me that i \"Would not fit in around here\" and that He was \"concerned about my gaming habits\" and how \"We can't have you lose focus to play video games, therefor slacking off within work hours\" I was shocked, to say the least. He told me that he would keep in touch, later that week i got an email stating that i didn't get the position. I don't know what to think of it, should i take down all the gaming related projects that i had on my Github before further interviews? Is this normal for employers to dislike engineers who game? I really don't know what to think...\n\nThanks for all the suggestions and comments in advance\n\nEDIT: The interviewer did not know my age until i was at the interview, however the person that actually called me (Not sure who she was) said that she *did* know i was fresh out of highschool and said she didn't think it would be a problem since i seemed to have the proper skills.",
      "subreddit": "cscareerquestions",
      "score": 241,
      "url": "https://reddit.com/r/cscareerquestions/comments/3s57el/didnt_get_a_job_cause_i_play_video_games/",
      "comments": [
        {
          "body": "I'm going to go out on a limb and say that he was grasping at straws for any reason not to hire you due to your age.\n\nI wouldn't be too discouraged, and would move on to a different company if I were you.",
          "score": 601
        },
        {
          "body": "This is not normal, consider it a dodged bullet.",
          "score": 214
        },
        {
          "body": "We've hired people who put game modding on their resumes.  I'd be more interested in discussing the ethics of facilitating violation of the  game TOS by making and using a bot.",
          "score": 155
        },
        {
          "body": "I would say it's abnormal. Many people game at my company. That guy is just a dick. Just shake it off and keep applying.",
          "score": 129
        },
        {
          "body": "You didn't blow the interview. \n\nHowever, your interviewer was right by saying you wouldn't fit in around there. I'm not sure what kind of person would be the right fit for a manager like that, but godspeed to them.\n\nKeep your head up, and don't let some weirdo get you down. What you do in your free time is your business, as long as it doesn't impact your working hours or quality of work. I probably would have asked you what other games you play to see if I can find common ground with you.",
          "score": 97
        },
        {
          "body": "Have you considered going to college? You probably wouldn't have to put up with crap like this if you had a degree.",
          "score": 61
        }
      ]
    },
    {
      "title": "My Recruiter colleague reported me to my boss",
      "body": "I sent a link for a LinkedIn job applicaton to my colleague who is a Recruiter and said: this is a fine company in case someone from your team was looking to change jobs...\n\nI sent that on company Slack as a DM to him. I think he could have told me to delete it and move on. Instead he reported it to my manager saying that he feels bad because he wasn't looking for a job change.\n\nThe timing couldn't be worse as I just came of a PIP which got cleared and I took a week off to rest, coming back to this issue. I know I shouldn't have used company Slack, but I think he made too big of a deal out of it?\n\nBefore my PIP I had a situation where I applied for an internal position in a different team. The interviews went great and I thought the position is definetly mine. I naively mentioned to colleagues from my team that I could be moving soon to a different team. I made sure to say nothing is official yet. In the end that manager didn't pick me, but my manager made that situation part of my PIP saying I shouldn't have told my current team members anything as it made them anxious about possible changes... \n\nDo I have a problem with proffessional communication at work...?\n\nEdit: Thank you everyone for comments and constructive criticism. I will be more carefull in the future. I am moving to a different role (got confirmed today) so I will be out of my current manager's hands. Thanks again!",
      "subreddit": "jobs",
      "score": 289,
      "url": "https://reddit.com/r/jobs/comments/1on8wdi/my_recruiter_colleague_reported_me_to_my_boss/",
      "comments": [
        {
          "body": "Never send job stuff on work emails or communication apps.... My brother works IT.  He told me most companies flagged web pages and emails where set for job searching.  Not porn site..... You will get immediately flagged for going to any job sites LinkedIn monster etc versus a porn site",
          "score": 311
        },
        {
          "body": "Yeah, kind of. You just need to be more careful about what you share at work. Keep job or transfer talks outside company channels. Learn from it and move on.",
          "score": 91
        },
        {
          "body": "Yes, your colleagues aren’t your friends…",
          "score": 448
        },
        {
          "body": "OP, you didn't learn after the first time. Keep your mouth shut.",
          "score": 124
        },
        {
          "body": "Honestly, it sounds like you’re someone who speaks openly and casually,maybe with good intentions but sometimes that doesn’t land well in a work setting, especially one that’s a bit rigid or cautious.\nSo to answer your question, \nI would say that you have a blind spot, not a big problem. You communicate like someone who assumes good faith, but you’re working in a place where people are reading between the lines more than they’re hearing your actual words.\n\nTake the Slack message, it probably felt harmless, even friendly. But because it was on a work tool, and because you're just coming off a PIP, it ended up triggering alarms. Your colleague might have overreacted, sure, but people don't always give the benefit of the doubt , especially around anything that smells like “recruiting” or “leaving.” And that’s just... corporate life sometimes.\nThe real take away from all these include: \nYou're not doing anything wildly inappropriate. You just need to be more intentional. Right now, especially post PIP, every message either builds trust or makes people uneasy. That’s unfair, maybe, but it’s the reality. And you can handle that.\n\nSo moving forward:\n1. Keep personal or casual messages off company channels.\n2. When in doubt, don’t share until something’s confirmed.\n3. Think about how your words might make someone else feel especially in a sensitive context.\n\nYou don’t need to become paranoid or fake. Just slow down a bit, read the room, and stay focused on doing solid work.\nCheers",
          "score": 38
        },
        {
          "body": "I world be worried that my company would put together a plan to push me out after this.",
          "score": 33
        },
        {
          "body": "Unprofessional behaviour from you on both counts. Be smarter",
          "score": 82
        }
      ]
    },
    {
      "title": "Hiring company asked me to do an 8 hours assignment and gives no feedback.",
      "body": "I applied to this company as an iOS developer. The initial interview with the recruiter was ok. Then they asked me to do an 8 hours assignment in Swift and SwiftUI.\n\nI was added to a private Slack chat and github with 2 developers from their company in case I have any questions.\n\nI completed all 3 requests in the assignment and a part of the bonus request. The developers in the Slack chat were not helpful. I asked 2 questions, and it took them almost a whole day to answer. By that time, I have decided the solution on my own.\n\nWhat pisses me off is that they give no feedback on my assignment. The recruiter even gave the bull crap because of company protocols, which do not allow her to say it. I wish I had told her to tell those dev that interviewing with them was a waste of time.\n\nEdit: the company is **Theoremone.**",
      "subreddit": "jobs",
      "score": 1117,
      "url": "https://reddit.com/r/jobs/comments/167nq6x/hiring_company_asked_me_to_do_an_8_hours/",
      "comments": [
        {
          "body": "You were brewdogged.\n\nYou solved their problem and now they don't have to hire you.\n\nIf you ever do \"assignments\" for free, make sure the company can't benefit from it.",
          "score": 681
        },
        {
          "body": "Walk away from these type of tests. They are using you!",
          "score": 122
        },
        {
          "body": "OMG OP I just quit a role that lasted 2 weeks with TheoremOne due to them being HORRENDOUS and mucking up everything. they promised my new manager i'd do things i didn't know i was expected to do, and then told me it was his fault and told him it was my fault. fuck theoremone. you dodged a bullet.\n\nedit to add: no test in my interview process, but i am a technical writer and provided my portfolio, which is standard. still, fuck theoremone.",
          "score": 101
        },
        {
          "body": "literally send them an invoice. not. even. kidding.",
          "score": 225
        },
        {
          "body": "Name and shame. But seriously, I think a lot of people have been through this, myself included. Was called in for an interview and they made me participate in daily scrum like I was already hired, gave me a feature to code and write tests for. I did it, got good feedback day of then ghosted. I was tempted to send them a bill for my time.",
          "score": 52
        }
      ]
    },
    {
      "title": "I have barley enough money for one generic interview/new hire outfit, what should I buy? I'm a very thin 32 male, waist around 28. I'm thinking blue skinny slacks, and a tight black T, brown leather belt, and white Adidas sneakers.",
      "body": "My job options are mostly fast food, mid high end restaurants and hotel lobbies.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1ay9gc0/i_have_barley_enough_money_for_one_generic/",
      "comments": [
        {
          "body": "try a polo",
          "score": 2
        },
        {
          "body": "I'd ask in the hospitality subreddits. They'll be able to offer more specific advice about what works in those industries. \n\nGL",
          "score": 1
        }
      ]
    },
    {
      "title": "After hundreds and hundreds of applications, I changed up my job search approach and started getting interviews, and then a job. Here's what I did.",
      "body": "This might not work for every industry, I'm in tech and my approach might not work as well in other sectors. \n\n  \nAfter getting laid off before Christmas, I first started applying to every job post I could find. If I could do a cover letter I would. (I used chatGPT to merge my standard letter with the JD and edited from there.)\n\n  \nI applied to a hundred jobs a week for 4 months. I got rejections, mostly generic, from about 30% of them, and nothing from the rest, outside of 6. These 6 were different for a reason - I knew somebody at the company, and I had reached out to them and asked them to put in my resume and/or put in a word for me. In 1 I got a personalized rejection saying they wanted domain expertise I didn't have. Fiar. The other 5 I had a call with the recruiter, and in 4 I interviewed with the hiring manager and beyound. I didn't get any of those jobs, but it did make me rethink my strategy. \n\n  \nI stopped applying to jobs unless I had or could make a personal connection. I went through my phone and texted every former coworker I had info for and asked them if their company was hiring and even if it wasn't could I get my resume in front of the dept head. I went on slack communities for my job function, and looked to see if the hiring manager for a job I was looking at was active, and if so messaged them there. I paid for the lowest tier of LinkedIn so I could message people I didn't know, and messaged hiring managers or people in the org related to a job posting. I tried to find the email format for the company and cold-emailed the hiring manager about the job. Only if they replied did I send an application. Sometimes they replied \"please just send in an application via the website\" but at least when applying I could note that I'd connected with the hiring manager and was applying at their suggested, and of course after applying I'd follow up and tell them I'd done so.\n\n  \nThis was all v. time intensive, and I went from 100 applications a week to &lt;10. But I ended up having calls with at least the recruiter with the majority of them. I started getting a couple of interviews a week rather than a couple of interviews a month. And in two months I had a job, which I love. \n\n  \nLike I said, maybe doesn't work for everyone, but a) recruiters everywhere are flooded with resumes, and if they have a handful of referrals that all look like great candidates on paper (and you can bet the probably do) they will NEVER even look at another resume. b) outside of potentially a few kinds of jobs, I bet every employer wants hires willing to hustle, which cold outreach often imples. I don't think hiring managers will respond to cold outreach negatively. \n\nBest of luck to you all! \n\nEdin.",
      "subreddit": "jobs",
      "score": 544,
      "url": "https://reddit.com/r/jobs/comments/1f6l4lg/after_hundreds_and_hundreds_of_applications_i/",
      "comments": [
        {
          "body": "All of the jobs I have gotten in the past 20 years was because someone reached out to me.",
          "score": 164
        },
        {
          "body": "Glad you found a strategy that worked! To be honest, it sounds like the general strategy recommended for the past decade or more, at least before the stratospheric rise of AI. \n\nYour first strategy seems like it would have the outcome you saw. If I got a generic application or an obviously Ai generated cover letter, I would not invest much time in the candidate. At my tech company, the recruiting department has been focused on detecting AI generated content and interview question answers for over a year. It’s no surprise to me that those applications ended up at the bottom of the candidate pile.",
          "score": 19
        },
        {
          "body": "People complain about LinkedIn not working but it's just knowing how to network. 5 /7 roles, I have gotten were all through LinkedIn. \n\nCongrats!",
          "score": 46
        },
        {
          "body": "Makes a lot of sense to me. In any critical career situation (like applying somewhere or a salary negociation) a \"passive strategy\" (i.e. just letting the facts speak and waiting for someone to react/reach out to you) seems to be suboptimal. For example, even if you made a lot more money than expected for your company or increased your productivity by an obvious amount, your boss will probably not offer you a huge salary raise unless you actively insist. With applications it seems to be similar, in addition to being qualified you need to insist on being recognised.",
          "score": 19
        },
        {
          "body": "Wow!! You definitely started thinking outside of the box. So happy that you found a job that you love. Thx for sharing!",
          "score": 9
        }
      ]
    },
    {
      "title": "Some of Y'all Need To Stop Bullshitting On Your Resumes",
      "body": "I'm not sure who needs to hear this, but blatantly lying on you resume isn't going to help you land a job.\n\nI just spent 45 minutes interviewing someone who had  XYZ on their resume in 6 different places.  Literally the first bullet point under the their last job was \"Managed implementation of XYZ\"\n\nMy first warm up question, the one designed to make the candidate feel at ease by getting them to talk about something familiar was \"So tell me about implementing XYZ and some of the challenges you faced\".  Crickets!  Then the candidate admitted they only really played a very minor part in the project and didn't know much about XYZ.\n\nI get that it's hard out there.  I get the temptation to put whatever it takes on your resume to get past the ATS and the Recruiters to an interview. But for fucks sake at least make it grounded in reality.\n\nMost of us will cut you some slack if you've exaggerated a little, shit we all do that, but when you can't answer simple questions about things you've put at the top of your resume - then you're not only wasting both our time, but you've likely stolen an opportunity from someone else too.",
      "subreddit": "interviews",
      "score": 2129,
      "url": "https://reddit.com/r/interviews/comments/1kb7fx1/some_of_yall_need_to_stop_bullshitting_on_your/",
      "comments": [
        {
          "body": "So what would have been an appropriate embellishment? Because everything on my resume is factual and I still can't get interviews.",
          "score": 586
        },
        {
          "body": "Some of yall really didn’t grow up learning to lie and it shows 🙄\n\nIf you want to lie, you have to commit to it. Believe it in your very cells to a delusional level. Practice the script and study the plot so well that you can recall what you ate with the team on day 20 of the imaginary project. \n\nYou can’t just slap on a lie in your cv and go ‘AHUHAHUHAHHUHHHH’ when they ask you questions about it in the interview!!! That's not lying, that's just pure idiocy.",
          "score": 210
        },
        {
          "body": "Lying is a two way street… i would argue 99% of job postings are extremely embellished..",
          "score": 140
        },
        {
          "body": "Not one to lie on a resume personally, however:\n\nSome of y'all need to stop using rounds of AI interviews, ghosting, and grow a spine.\n\nSome of y'all need to list a fucking salary range.\n\nSome of y'all need to stop bullshitting on industry expertise being a requirement when smart individuals can easily learn your not at all special industry.\n\nSome of y'all need to stop bullshitting on false hope when you have no intent of hiring anyone or already have an internal candidate selected.\n\nSome of y'all need to recognize there's a live human on the other end in a job market that tells them\ntheir life is worth nothing, and learn empathy and integrity.\n\nSee how that works?",
          "score": 264
        },
        {
          "body": "Companies lie on their job postings too though",
          "score": 138
        }
      ]
    },
    {
      "title": "Is it better to quit a job you hate before you have a breakdown or stay and endure until you can find a new one?",
      "body": "I was laid off December 31st, 2004 and took the first job that was offered to me in May 2025. After about 2 months I knew this wasn’t the right fit for me so I started applying elsewhere. No one was interested in me for months but I’m finally getting interviews.  \n\nAs time has gone on I have become more and more miserable. I wear my heart on my sleeve and can’t fake it anymore. I don’t have new job lined up yet but I can’t take it anymore. \n\nThings came to a head with my boss today and I’m preparing for the worst. I didn’t want to quit given how long it took me to find this job, but I’m wondering if I should’ve left weeks ago and saved myself the mental struggle. \n\nFor reference, I’ve done everything they’ve asked of me and they’ve been happy with what I’m doing, but I’ve definitely allowed my punctuality to slack off and have not been vigilant in asking for more work. I’m not innocent, but haven’t done anything seriously bad.\n\nWould it have been easier telling potential employers I walked away when I knew it wasn’t a good fit? Is it a bad look to have stayed at a job I was truly unhappy with just for a pay check? If I do get fired will this cause problems for me finding a new job? \n\nMy mind is in a tailspin. Basically I’m wondering if I’ve screwed myself over because I stayed at a job I was truly unhappy at. ",
      "subreddit": "jobs",
      "score": 21,
      "url": "https://reddit.com/r/jobs/comments/1oxg9lc/is_it_better_to_quit_a_job_you_hate_before_you/",
      "comments": [
        {
          "body": "You'll only truly understand that answer when you have no job and are close to being homeless.\n\n  \nStay at your job until you secure a new route. Or dont and understand the above statement.\n\nI did the innitial statement once...was a bad year.",
          "score": 34
        },
        {
          "body": "Stay and endure. We are in the worst job market since the Great Depression. I know VERY qualified people who haven’t been able to find anything for years now. Yes, years, plural. Do not quit without another signed offer.",
          "score": 11
        },
        {
          "body": "U meant 2024",
          "score": 8
        },
        {
          "body": "Job market is awful right now.. if u quit, unemployment benefits is unlikely.\nI would definitely line something else up first.\nDoesn’t look good on a resume if you’re looking to leave within a year of last job.",
          "score": 8
        },
        {
          "body": "Quiet quitting while looking for a new job is the move",
          "score": 7
        },
        {
          "body": "In the current U.S. job market, hang on as long as humanly possible",
          "score": 5
        },
        {
          "body": "I have two friends (married couple) who both quit their jobs this summer without backups and they are STRUGGLING. They can’t find work and they’re reaching the end of their savings. ",
          "score": 4
        },
        {
          "body": "Don’t quit the job. Go see a doctor and get on mental health disability. Then use that time to find something new",
          "score": 3
        },
        {
          "body": "Just look for a new job while you are in this one, and you’ll feel better and hopefully find something new. I definitely wouldn’t just let myself quit without having something lined up.",
          "score": 3
        },
        {
          "body": "I'll tell you what I was told- have a \"work\" version of yourself. Show up, be cordial, do your best work, keep your head down. Next, get a plan and transition your thinking that this is now a temporary position until you find your next job. Revamp your resume, assess job postings for keywords that you match,  and keep applying and researching. It's easier to deal with things when you detach yourself and remind yourself this is a transition phase.",
          "score": 3
        }
      ]
    },
    {
      "title": "\"Business casual\" interview attire question: suit or sport coat/slacks and/or tie",
      "body": "I've got an interview at a consumer-oriented sporting good company tomorrow for a mid-career position. I've already been through an interview cycle for a different position with this company, didn't get the job, but got called back for a better position. \n\nIn the email from the internal recruiter who has handled the scheduling, she stated, \"We are a casual workplace.\" I know this because when I've been there, most people are in jeans, button-down shirts, or sometimes t-shirts. She then notes, \"Feel free to dress in business casual attire.\"\n\nThat noted, would I be OK if I wore a navy Calvin Klein blazer, charcoal slacks, patterned shirt, black dress shoes, and no tie? \n\nI have a super-nice slim Banana Republic suit that I usually wear to interviews, but with the temperature expected to be 90+, and the explicit instructions, my instincts tell me that the suit would be a bad idea. \n\nI am agonizing over this. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/3jdkze/business_casual_interview_attire_question_suit_or/",
      "comments": [
        {
          "body": "The blazer/no tie combo should look sharp. Good luck",
          "score": 3
        },
        {
          "body": "I would still be conservative about it. Consider wearing your normal interview suit but slightly altered to be less formal. So lose the tie and and wear a shirt that maybe has a nice pattern etc.",
          "score": 2
        },
        {
          "body": "Business casual has many different definitions in today's business world. When I was younger (1980s) it was what you described but in the 90s it changed to jeans/khakis, polos and tennis shoes. Now it seems that it is determined by the culture you are going into. I would not go with what you've seen people wearing when you go in but I would consider what you suggested okay. The slacks and dress shoes are good. Black socks so you don't have that garish white/patterned break if your slacks ride up when you sit down. When interviewing potential employees I prefer a plain shirt since I can be distracted with patterns. Wear a plain tie, complimentary or contrasting to your shirt is fine just make sure it isn't a clip-on. Those things get wonky and can be distracting and they show you're too lazy to learn to tie a tie.\n\nIf it's going to be that warm, make sure to wear plenty of antiperspirant. There is nothing worse than walking into an interview with sweat rings under your arms when wearing a light colored dress shirt.\n\nGood luck!",
          "score": 1
        },
        {
          "body": "sports coat and tie",
          "score": 1
        },
        {
          "body": "I was interviewed by guys in shorts and t-shirts -- definitely on point with the slacks, dress shirt, no tie combo. I brought my sport coat with me but didn't have it on at any time during the interview. \n\n",
          "score": 1
        }
      ]
    },
    {
      "title": "I (finally) got a new job! Some advice for job seekers",
      "body": "Finally. I landed a new role. I am leaving my current job which I absolutely hated. My new job is in the marketing department at a great law firm in a big city. \n\nQuick stats: I am 26M. I only applied on LinkedIn or the company’s website.\n\n\nSome advice to those who are feeling demoralized by the job search:\n\n1. You must keep going. Any action is better than no action. \n2. Turn on the “Open to Work” section on LinkedIn. I set mine so that only recruiters can see it. This way, the “open to work” banner wasn’t on my LinkedIn profile picture. My current job wouldn’t have liked seeing that. Two recruiters reached out to me for jobs that turned into multiple rounds of interviews. Also: update your LinkedIn and make sure your job titles and dates match your resume. \n3. Tailor every single resume. Use ChatGPT. But look over it (of course) rather than just blindly submitting it to a job.\n4. Cut yourself some slack. The white collar job market is AWFUL. People far more qualified than me (and probably a lot of you) are struggling to land jobs across many different industries. Be nice to yourself. Not being able to land a job is NOT a negative reflection of your intelligence, capacity, or skill set. It is primarily a reflection of the god awful job market as well as sh*tty employers who will either ghost you or not care that you applied in the first place. It is currently, and unfortunately, very much so an employers market.\n5. A reference is better than 100 applications. I somehow landed my new job through LinkedIn without a reference, but I was always thinking about people I knew who may be able to refer me to a job. \n6. Stay organized. I kept an Excel sheet to track my applications. I tracked the company, job title, salary, if it was hybrid/remote/in person, where the job was located, contact person name (if applicable), date of application, and a drop down selection of rejected, no answer, interviewing, got the job, etc. \n7. Practice interviewing! Get good at it. Interviewing is hard and oftentimes awkward.  Prepare diligently for interviews. Research the company. Understand the job responsibilities to the best of your ability. Again: practice interviewing!\n8. I only applied to jobs that were posted within the last 24 hours. You can filter this on LinkedIn. I also bought LinkedIn premium. I liked being able to see who was viewing my profile but I don’t think it’s a necessity. \n9. Trust the process, keep going, and be patient. Your time will come. You wont be job searching or unemployed forever. This job market is extremely tough — you must be tougher. Believe in yourself.\n\nHopefully this helps even one person out there. If anyone wants advice, support, or to just talk through anything job related, feel free to DM me. \n\nGood luck out there. ",
      "subreddit": "jobs",
      "score": 263,
      "url": "https://reddit.com/r/jobs/comments/1jbe7fa/i_finally_got_a_new_job_some_advice_for_job/",
      "comments": [
        {
          "body": "Congrats! Always nice to see people landing roles to gain more hope for myself lol. Can I ask how long you were applying for?",
          "score": 21
        },
        {
          "body": "Congratulations! I’m sure well deserved",
          "score": 6
        },
        {
          "body": "In your job searching experience, do you think it matters what day of the week OR what time of the day you submit your resume?",
          "score": 7
        },
        {
          "body": "Congrats 👏 and, thank you 🙏 for taking the time to write this out. I am saving it as a reminder, to reference in times of frustration. ",
          "score": 4
        },
        {
          "body": "Congratulations! Thats amazing!",
          "score": 3
        },
        {
          "body": "Awesome.  Congrats!",
          "score": 3
        }
      ]
    },
    {
      "title": "[Article] The CEO of billion-dollar startup Slack starts every job interview with this question — and it reveals a lot about him",
      "body": "",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/48daoi/article_the_ceo_of_billiondollar_startup_slack/",
      "comments": []
    },
    {
      "title": "Tech company said they dress “pretty casual” and not to worry about dressing up for the interview unless I feel like it",
      "body": "Like a whole paragraph on being comfortable since I’m traveling for the interview. \n\nWhat would you wear to the interview? I’m female, by the way, and will not be wearing a dress or skirt. \n\nUsually I’d wear slacks, button down, jacket. Now I’m thinking sweater and jeans? Sweater and chinos?\n\nedit: thanks everyone, I’m gonna go with the suit. They did indicate that overdressing isn’t a problem so I think I’ll err on the side of overdressing\n\nEdit 2: I have no idea why everyone thinks this interview is in Seattle. It’s in Chicago. It is also not a startup. The pictures of the staff on their website indicate mostly older white men. \n\nI’m not gonna wear the suit.\n\nEdit 3: I was gonna wear chinos but it turned out I have put on some weight and they were a little too bootylicious. So I went with medium gray corduroy straight leg pants and a blue cable knit sweater with a fold over collar (somewhere between cowl neck and turtleneck). Also a thin black belt and really plain bordering on homely Clark’s black flats. \n\nNo one even blinked at what I was wearing and I immediately forgot about it once the interview started. I got the job and it’s amazing.",
      "subreddit": "jobs",
      "score": 182,
      "url": "https://reddit.com/r/jobs/comments/1036q50/tech_company_said_they_dress_pretty_casual_and/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "DO NOT WEAR A SUIT THIS TECH COMPANY INTERVIEW. \n\nFor the love of god, they sent you a whole paragraph saying it was unnecessary. You’ll be overdressed in slacks, a jacket and button up — in a good way. I would suggest contrasting (not matching) slacks and jacket, assuming these are more dressy/formal style. \n\nAlso, consider the weather and city culture. An Patagonia jacket is the equivalent of suiting in a Seattle tech company. \n\nHowever the role does matter — be formal for legal/accounting/finance roles within a tech company and more practical for a direct tech role like SDE. \n\nAlso, I would aim to wear practical shoes especially in Seattle. (I live in Seattle and retired all my business casual stuff when I moved here and I don’t even work at a tech company).",
          "score": 208
        },
        {
          "body": "I am a female at a tech company, other tech company employees have given great advice to not wear a suit!  I wore business casual, a nice shirt with a cardigan and slacks.  I was still overdressed.  I have heard from interviewers the those in suits give a bad impression that they won’t fit in.   Don’t do the suit!",
          "score": 84
        },
        {
          "body": "Good fitting dark jeans. White dress shirt. Blazer.",
          "score": 72
        },
        {
          "body": "I'd go with slacks, button down, and jacket. If you get the job, you can assess dressing down to jeans and sweater.",
          "score": 123
        },
        {
          "body": "My interview outfit is black ponte knit ankle pants, a cream sweater with black piping around the collar, and leopard print flats.",
          "score": 17
        },
        {
          "body": "I would advise against erring on the side of overdressing. The people who recommended a suit obviously have never interviewed for tech companies. I once wore a suit to an interview for a tech startup and while I subsequently got the job, they did mention that the first impression was \"this guy might not fit in our culture\"",
          "score": 39
        }
      ]
    },
    {
      "title": "Learn from my mistakes. I got a job, but it took me a year, 1100+ applications, and failing 11 final interviews. Here is what you don't do while job searching.",
      "body": "Sure, there are plenty of posts from people who applied to a job and got an offer 30 seconds later. Good for them. But if you're on this sub, you're probably running into more difficulty. I did. Job hunting these days is inherently pretty hard, but there are plenty of things I did wrong during my job hunt that could have saved me time and trouble. I'm a 35 year old in product marketing in the bay area, so this advice may or may not apply to you.\n\nMost of this advice is not new, you may have seen it elsewhere. Well, HEED MY WORDS! You should take that advice.\n\nHere are my don'ts of job hunting:\n\ne: Here's the real #1 piece of advice because someone brought it up in the comments: **Don't Not Have A Network.** The main reason I had such a hard time was I moved to a new city where I didn't have a professional relationship with ANYONE.  I think if you're applying without a friend on the inside, it reduces your odds by 80-90%, based on random factoids we've all seen that say 80% of jobs are never posted publicly. \n\nI went to networking events and coffee meetups and blah blah blah, but COVID put a stop to that before I could make much progress. The biggest piece of advice (by far) is just to have a friend who can get you a job. But if you're reading this, you would have done that already if you could have.\n\n**Don't try to get by without doing the standard \"best practice\" stuff.**\n\nI spent a while thinking I could get away without making a customized resume for different jobs. I also thought I would probably have the right keywords naturally, and that I didn't have to worry about that either. WRONG. I wasted many weeks submitting poorly optimized resumes and getting few interviews.\n\nWhat you should do is have at least one version of your resume customized for each job title you're applying to.  That means if you're applying for Sr. Widget Fiddler and Director of Widget Fiddling, you need 2 versions.\n\nKeyword optimize each resume version by copy-pasting 50+ job descriptions for that job's title into a tool like [Voyant Tools](https://voyant-tools.org/), which will spit out all the most common words and phrases. Find the most frequent ones that seem important and relevant, and work them into your resume, even if it seems weird to refer to yourself as a \"team player\" or \"entrepreneurial\".\n\n**Don't be bad at interviewing, not even a little bit bad.**\n\nBeing a good interviewee is a skill. Most of us aren't born with that skill, and most of us are rusty when it comes time to look for a job. I knew I wasn't great at interviewing, but I really didn't want to go through awkward practice interviews with friends, so I told myself people would understand why I was all nervous, and realize I was still super talented and experienced despite my 'rough edges'. WRONG. I blew it on a lot of interviews before admitting that I had to practice, a lot. I did a bunch of practice interviews, got feedback, and I even talked to an interview coach. The latter was expensive, but I think the dose of outside perspective really helped. YMMV.\n\nI practiced enough that I started getting to final rounds instead of washing out in the first couple rounds. It made a huge difference. Practice.\n\n**Don't wing it during the interview.**\n\nFor 'behavioral' questions (i.e. \"tell me about a time when...\" questions) everyone says you need to have multiple answers memorized for every major category of question. Ugh! So much work. Greatest weakness. Success story. Failure story. Conflict story. Collaboration story. YAWN. I thought I could come up with good answers on the spot. It's \"supposed to be a conversation\", right? WRONG. I blew it on a couple interviews before realizing I was coming across as both unprepared AND inexperienced.\n\nSit down and work out your bullet points for every answer, BEFORE you land an interview. Pain in the butt? Yes. But not as big a pain as getting an interview, blowing it, then ending up doing the work anyway.\n\n**Don't apply to old job listings.**\n\nIf it's still up, they're still hiring, right? WRONG. I have found that job listings are good for about as long as fresh bread. You mostly want to apply the day they're posted, 2-3 days is OK, 5 days is pushing it, beyond that, it's literal trash.  I started out applying to anything relevant that was less than a month old, and my app-to-interview yield was around 1%. Started applying to new listings exclusively, and my yield went to more like 3%. YMMV.\n\n**Don't apply to listings that aren't on the employer's own site.**\n\nIt's become disturbingly common for 3rd-party sites to steal and re-post job listings they have nothing to do with. You click on a link on LinkedIn or Indeed, and you end up on Neuvoo or some random BS. Don't submit any of your info on those sites. Very often the jobs are expired already, but these 3rd-party scammers are still re-posting them to steal your info. Even if they're not expired, there's no reason to think they actually send your application to the employer.\n\nIf you land somewhere unexpected, go to the employer's actual careers section on their site and find the listing yourself. Otherwise you're just giving your info to someone to sell, and the employer probably never sees it.   Please report these listings as you go.\n\n**Don't be too picky with job titles.**\n\nUnless your resume precisely \"fits the profile\" employers are looking for, you're going to have to apply a lot. I had to apply a lot. At first, I was exclusively applying to one title, because although I didn't \"fit the profile\" I didn't want to compromise. I ended up getting a really solid job with a different title, after I loosened my criteria JUST a tad.\n\nHave a serious talk with yourself about how many months you're willing to apply before broadening your search, and don't talk yourself out of good jobs because they have the \"wrong\" title.\n\n**Don't be too loose with companies you apply to.**\n\nAt a couple points in the process, I ended up with interviews at companies that I seriously didn't want to work for. I was playing the numbers game and I would apply to anything with the right title, even if I hadn't heard of the company. I figured if I got an interview, I would worry about the company later.\n\nDifficulty: If you are on unemployment, this can lead to a sticky situation - if you turn down an offer, you legally can't collect unemployment anymore in many places. It's also pretty hard to justify to yourself turning down ANY interview if you actually need the money.\n\nHave a loose idea of who the company is before applying, to avoid those awkward moments.\n\n**Don't stop applying until the ink is dry on your offer letter.**\n\nMy advice is to apply to every suitable listing as soon as it's posted, which could be as many as 10-30 per day depending on your field and geography. If things are going well, you'll also have interviews going on during any given week, which also put heavy demands on your mental energy and prep time.\n\nIt is tempting to stop applying for jobs if you are doing multiple interviews and they seem to be going well. You need the time, and one of them has to work out, right? WRONG. It happened to me multiple times - I'd get further along in an interview process, I'd be focusing on prep, and I'd let my application routine slip. Bad idea. If your application pipeline runs dry, it can be another 2-6 weeks before the interviews start flowing again. ABA - always be applying.\n\n**Don't get your hopes up. (maybe the most important tip.)**\n\nYour mental resilience to rejection and your self-regard are finite resources. They are resources you need to conserve to maintain your overall mental health and good job-hunting habits. Job hunting can burn through these resources like Joe Exotic through a bag of meth. Don't be like me and get emotionally invested in any given job before you get an offer. Don't start picking out all the stuff you're going to buy with the new salary. Don't start thinking of what doors are going to open up for you with this step in your career. Don't mentally pick out outfits for your new commute. Just don't.\n\nI consider myself a mentally tough person, so I should be able to handle the repeated rejection, right? WRONG. If you allow yourself to start caring about a job before you GET the job, you WILL be crushed to bits. Maybe not the first time, but after the 5th, or the 10th, it becomes hard to take.\n\nTo some of the newer job hunters I've seen on this sub: Caring about a job from the day you APPLY? Sheer lunacy. You shouldn't even remember where you applied by the time you go to bed that day.\n\nKeep in mind: It's a numbers game. It's not personal. You WILL get the right job eventually, **if you keep going**. You have to maintain faith in yourself, but hold no hope for any particular job.\n\nIn emotional terms, treat it less like a poker game, (where any hand can be a big deal) more like a slot machine (where you care zero until you finally win). No matter how tough you think you are, take care to maintain your mental state, especially during COVID where so many aspects of life are also wearing down our mental health.\n\n**Don't be afraid to be a try-hard.**\n\nThe role I finally got was based largely on a \"take home project\" used to demonstrate my working style. It was paid, also really long, the minimum suggested time was 10 hours. Usually I put 70% effort into trial projects, because I don't want to bust my ass for a throwaway, and I don't want to look desperate. My thinking is \"Well, we're all professionals, so as long as I mention a few of the right things, they'll know we're on the same level, right?\" WRONG.\n\nOn this one, I decided to go HAM on the project. All or nothing. I ended up putting over 20 hours into it, (the max time they suggested was 20) and came up with a total overkill amount of material, it was probably 20 pages worth, if not more. To give some idea, I spent like 4 hours just doing addressable market sizing, which everyone including me acknowledges is fairly pointless.\n\nPart of the project was also to see how we communicate about our work - they put me on their company slack, so I logged onto it pretty much every day to update them on my progress. It was firmly in try-hard weirdo territory. But it worked!\n\nSo I guess my lesson from this is, if you're going to bother with these projects, be the one who turns in the blue ribbon material.\n\nNB: *Be aware of \"free work\" scams where they try to get you to do the actual job without hiring you for the job. If it's pertinent to the actual job and it's more than an hour or two of work, it should be paid. Unpaid trial projects that don't relate to the actual business are OK, but you'll have to decide for yourself how much time you're willing to put in for free.*\n\n**Don't assume \\*\\*\\*anything\\*\\*\\* until it's final.**\n\nIn 3 instances, I got much further than I expected in a hiring process, and in one I was blindsided by a rejection where I thought I was a shoo-in. #1, they interviewed me for the role (up to the final round) even though the job called for an actual engineer and I have zero engineering experience.\n\nIn #2, I blew an interview and got rejected. I knew exactly how I blew it, I got the yips and did poorly. So I sent an email reply explaining what I SHOULD have said, and that I really believed in the company's mission, and that I realize I was a poor interviewee, but I was working on it - they actually gave me another shot and I made it to the final round.\n\nIn the last unexpected twist story, they actually scheduled a final interview, then CANCELLED IT. I have been rejected for about a million jobs, but I've never been cancelled on. They said that instead of an interview, they would just review my trial project. I couldn't imagine cancelling an interview with someone you intend to hire, so I assumed this 'review' was just a consolation prize and the job was going to someone else. On the day the cancelled interview was meant to take place, they offered me the job. Huh???? Later that day I rode to heck on a flying pig and bought a snowcone there. But I also got a job.\n\nOn the other side of things, I was told directly I was the top candidate for a role, the only one who was really qualified, but because of COVID they were putting the role on hold. OK cool, I figured I was a shoo-in once they actually hired for it. Well, they re-listed the job about 45 days later. They didn't reach out to me. I messaged them. They told me I wasn't even going to get a phone screen for it. WTF? They lied to my face for no reason whatsoever? Yep. They did.\n\nThe lesson: Do not assume anything! ANYTHING!",
      "subreddit": "jobs",
      "score": 449,
      "url": "https://reddit.com/r/jobs/comments/lhrr2s/learn_from_my_mistakes_i_got_a_job_but_it_took_me/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Honestly the prospect of having to fill in 1,100+ job applications genuinely depresses me just at the thought of it. Literal sinking depression.",
          "score": 141
        },
        {
          "body": "There's a bunch of good advice in here that I think is broadly applicable. I think a good note is like\n\n\"You're going to get rejected a lot, and even with a perfect performance and perfect take home you were going to get rejected anyways\"\n\nPeople have to remember 10/10 interview != job offer, equally 7/10 interview != rejected.  There's so much behind the scenes mechanics working and you basically just have to resign yourself to the fact that even with perfection you still might not be landing them.\n\nJust as an example, I was on a team that would unabashedly take significantly worse performing grads from \"x college\" (the 2 managers' alma) instead of perfect candidates from other schools. There's 7000 other examples of this same stuff happening every single day, sometimes you have to say fuck it and power on even though you know the cards aren't always in your favor",
          "score": 42
        },
        {
          "body": "Reading this just makes me want to kill myself lol",
          "score": 28
        },
        {
          "body": "This is really good, I appreciate the time you took you write this in hopes of helping people. You’re right I regards to mental resilience being a finite source. I felt alone in my job search, it’s been about 8 months now with only a handful of interviews. This makes me feel better and has definitely taught me new tips on what to do make my search more efficient. Congrats on the new role! I’m going to try and take your advice and step my game up, hopefully I land a role soon as well!",
          "score": 27
        },
        {
          "body": "Ugh. This is too relatable.\n\nI'm coming fresh off a very competitive internship with the DOE, graduated top of my class and have been working in customer service since I was 16. I had 2 manager positions by the age of 19. \n\n\n\nAnnnnnnnnnd last week I got turned down for a 12/hr (less than I was making managing a Wendy's) customer support job because \"another applicant had more experience.\"\n\nI'm pretty good with interviews and have made it to the 3rd interview 6 times. Still nothing. \n\nToday, I got an email (after my fourth interview with the company) that the company needs FIVE references by *Wednesday*. I sent 8 emails and now I'm praying that people are checking their inboxes. \n\nIt's crazy out there.",
          "score": 11
        },
        {
          "body": "It so sad that most have to do all this extra work for a grand total of 30k per year.",
          "score": 30
        },
        {
          "body": "[removed]",
          "score": 9
        }
      ]
    },
    {
      "title": "I give technical interviews for a Fortune 100 software company, when I ask \"do you have any questions?\" this is what I want to hear",
      "body": "Please take this with a grain of salt because I am a little less structured than a lot of other interviewers that want things done \"by the books\". But if you find yourself in an interview that is very conversational and open, PLEASE take the opportunity to ask the hard hitting questions:  \n\n\nExamples of good and honest questions:\n\n* What is a challenge your company overcame in 2021 and a challenge you look forward to in 2022?\n* How is the work life balance? (and depending on answer, do you often work over 50+ hr weeks?)\n* What does your company do to ensure new hires are connected with others? (especially if remote)\n* What are a few reasons you've stayed here so long? (if you can find their linkedin and they've been at the company a while)\n* Has your company chosen any directions to take that you don't agree with, what's an example and how did things change? \n* Are you happy with your yearly compensation bumps and bonuses?\n* In your opinion, what's the most convincing selling point to working here?\n* Mac/PC, Slack/Teams, Jira/Monday are all relevant as long as you have an opinion yourself\n\n&amp;#x200B;\n\nExamples of pre-canned questions I'm happy to answer but are very lackluster: \n\n* What does the typical day look like? \n* What characteristics do you think are most beneficial to this role?\n* What did you do before this?\n\n&amp;#x200B;\n\nBonus tips:\n\n* asking any question is better than asking no questions\n* a bold but good move is to ask if you can ask a few questions before you start.. particularly about org structure and where this person sits so you can tailor your responses to have better context within the company you are interviewing at\n* do not go off the cuff with questions if the person is a stick... if they are thoughtful, open and honest, have some slightly more meaningful or challenging questions to ask",
      "subreddit": "jobs",
      "score": 446,
      "url": "https://reddit.com/r/jobs/comments/qld1ja/i_give_technical_interviews_for_a_fortune_100/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "These are great! I always feel awkward after a Q is answered. Is it okay if I say something like \"that sounds great!\" after the interviewer answers. Are they looking for more commentary or follow up Q off of their answer usually?",
          "score": 63
        },
        {
          "body": "Recently interviewed for an internal position at my current company of 10yrs and was surprised by the amount of \"canned\" situational questions that were asked, such as describe a time you overcame a challenge or when did you go above and beyond for an account, etc. Etc.  Is this normal?  I've got 10yrs of of 6 month and yearly reviews on file...in my opinion they should know what I bring to the table.  Didn't help HR lady flat out told me she didn't look at my resume prior to the interview.",
          "score": 25
        },
        {
          "body": "I don't feel like I would be sincere if I asked those questions. Like I'd genuinely like to know things like: Do people feel comfortable using the corporate feedback channels? What's the process for handling bottom up communication? Can you provide an example of how the business empowered an employee to pursue an original idea or drive cultural change? If it's consulting / time and materials, how does the business model protect work life balance? Could a parent succeed there without a support system beyond paid childcare? Can you share examples of employees who changed roles and how the business supported them in pursuing their passion? Where is you're organizational inertia?",
          "score": 27
        },
        {
          "body": "We don't ask because we don't care. We are there to trade a piece of our life/labor for money. We don't give a shit about your company only how much you are going to pay us for allowing your company to exploit my labor for your financial gain. That is all",
          "score": 17
        },
        {
          "body": "One time I asked a very bold question and my manager told me that I got the job because of it lol\n\nIt was:\n\n“So if I was offered this job, what are some reasons why I should take it?”\n\nCaught both of them off guard but they seemed to love it lol",
          "score": 11
        },
        {
          "body": "I’m bookmarking the fuck outta this for future reference. Thanks!!",
          "score": 10
        },
        {
          "body": "I suffer from IBS and often ask about the bathroom situations. Generally I keep it pretty direct (obviously not including gruesome details) but usually employers seem out off by this. How would you phrase a question like this?",
          "score": 14
        }
      ]
    },
    {
      "title": "New job is a nightmare, thinking about quitting.",
      "body": "So I recently graduated in May and after months of so many applications and interviews, I finally got a job which I started this week. It's in the field I wanted to get into, however there are so many things that are not normal about this company and I'm thinking about getting out of this insane place sooner than later. \n\nFirst off, it's a full time 8-5 job. Smallish company, doing engineering. If we come in at 8:01 am, we literally are not able to clock in - like the system just won't let us. We have to go get in trouble by HR and management for being \"late\" and have to request to change it on our timesheet. \n\nOne of the weirdest things is a bell, just like high school. It goes off throughout the whole building at 8 am, 10 am for a short break, then at lunch at 12, then again at 5 pm when we can leave. It's so bizarre and makes me feel like a child. Also we're not allowed to have any food or drinks out. I had to hide the granola bar I needed to eat because I was starving. And I was so upset I had lunch in my car and noticed so many others did the same. It's so depressing. And the cherry on top was when HR pulled me to the side this morning and told me my fitted black slacks were \"too tight\" and that if the owners saw me they'd be \"very upset\" and that I should try to avoid seeing them today so I don't get in trouble. \n\nI also feel that covid isn't taken seriously because more than half of the employees don't wear masks even though HR told me in the interview that masks are mandatory. People have been coughing and not wearing masks, and no hand sanitizer is provided anywhere. It makes me so uncomfortable. They do nothing about it. No option for work from home either. \n\nOn top of all this, management treats employees in such an abusive and manipulative way. I've only been here a few days and already feel that I need to get out. It sucks because the actual work that I'm learning and doing is the direction I wanted to go. Idk if it's worth it. I guess I just need to hear it from others that this isn't normal and that I shouldn't feel like I'm letting an opportunity go.\n\nEdit: Some people are asking if this is out of the US...this is in California lol.",
      "subreddit": "jobs",
      "score": 285,
      "url": "https://reddit.com/r/jobs/comments/ipvzzd/new_job_is_a_nightmare_thinking_about_quitting/",
      "comments": [
        {
          "body": "The system locks you out if you're 1 minute late clocking in? You have to hide little snacks for sustenance until you can have lunch that you eat in your car? A bell?! An effing BELL, that tells you when to take a break, lunch, and go home?!?  \n\nGet out of there, and fast. You're an adult. Find a place that treats you like one. This place is micromanaging hell at its finest.",
          "score": 398
        },
        {
          "body": "Yeah this is not normal.",
          "score": 37
        },
        {
          "body": "Secure a new job and get out",
          "score": 55
        },
        {
          "body": "Get out for sure",
          "score": 28
        },
        {
          "body": "Definitely get out and also, not sure if it's the same in the US and UK but if employers aren't adhering to making the workplace safe by COVID standards, you can report them and they will be investigated.",
          "score": 28
        },
        {
          "body": "Sounds like a certain Japanese Tier 1 auto supplier I recently left...",
          "score": 74
        }
      ]
    },
    {
      "title": "How do I find an entry level minimum wage job? I am beyond frustrated.",
      "body": "I've been job hunting for the past 4 months. I've put out hundreds of applications, gone on 5 job interviews, and just had a phone screen the other day.\n\nThe first person I talked to on the phone screen said that she really liked my answers, and that someone else would be in contact to continue the interview process. Someone else did call me a couple days later, and asked me about my work history. I responded mostly describing what was on my resume, and I got an email a couple hours later saying I was no longer being considered.\n\nMy work history: I worked one customer service position for a year, and left about a year and a half ago. I've been in school since then.\n\nOne place I interviewed with said that they liked me, and that they would call me back about another interview. That was about 3 months ago.\n\nI've hunted on Craigslist, Indeed, and independent websites. I get about one call back for every 60 or so applications I put out and none of those have worked out. When I get an interview, I show up in slacks and a tie, and conduct myself professionally.\n\nI'm beyond frustrated. I'm not applying for supervisory positions or high end sales positions, I'm applying for entry level customer service positions. What am I doing wrong?",
      "subreddit": "jobs",
      "score": 175,
      "url": "https://reddit.com/r/jobs/comments/f0r9pe/how_do_i_find_an_entry_level_minimum_wage_job_i/",
      "comments": [
        {
          "body": "Honestly I find this surprising. Mostly because some positions always need to be filled due to high turnover rate. If your desperate, anywhere that serves food (restaurant, retirement home) are always looking for dishwashers because the job can suck ass especially if the restaurant is low class. \n\nYou didn’t make this clear in your other responses so I’m not sure if ur already doing this but you should definitely walk into places and hand in your resume (online applications are always bull). It also helps to scout a place out (this is only possible obviously if it’s a casual place to be at like coffee shop etc) and like go in, order something, and maybe casually ask employees what it’s like working there, and then (only if it feels natural) mention that your looking for a job.\n\nQualifications: Have had 3 different entry level jobs in the last 2 years obtained with 0 connections and very little experience (ive had so many due to a changing schedule). I am a girl though so it I think that might help with my job searches.\n\nEdit: I disagree with the volunteering thing. No entry level minimum wage job will care if you’ve volunteered unless it can be applied to job (like working concession). Which you already have customer service experience anyways so.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Have you tried construction companies? I know it might not be what you are looking for but it will likely pay better than minimum wage.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "There's only three factors at play here: \n1. the places you're applying to, which should be targeted to open positions in your area (places you drive past with 'now hiring' signs should be walked into and inquired about.) I assume you're doing that. \n2. Your resume. I assume you've utilized online resources and had other people read it and this is not the issue.\n3. Your interviews. Five is not really a sample size, but if there's any doubt you're not amazing at them you need to get brutally honest feedback from people in your life, watch videos and just perfect it.\nIf you are doing all of these right, all you can do is keep trying. I suspect something out of these three might be missing.",
          "score": 1
        },
        {
          "body": "Internships",
          "score": 1
        },
        {
          "body": "Guys, I have:\n\nA college degree\n\nA writing certificate\n\n4 years experience in medical records\n\n6 months management experience\n\nPassed a web development boot camp\n\nAnd I STILL can't get a career job.  In ANY field.  My job barely pays me enough to live on my own, much less save for retirement or even travel.\n\nAny advice I get means completely upending my life for a \"maybe,\" which, based on past experience blows up in my face.\n\nPeople practically scream at me to NETWORK!  NETWORK!  NETWORK!  But when I ask where you go or who to talk to, they say: Idk.\n\nOr: That first job is all important but impossible to get. And I have no idea how I got mine.  It fell into my lap because I was in the right place at the right time.\n\nAt this point, I don't care what the hell I do. As long as I can make a career out of it.  I really will do anything.\n\nWhat I CAN'T do is work hard, upend my life and give up my health insurance for some vague \"maybe.\" I am tired of firing off dozens of applications, taking classes, and asking for help only to watch everyone else get picked for a job because they were in the right place at the right time or they had the charisma of Will Smith.\n\nI am fucking tired of being trapped in the \"you need experience to get experience\" loop.  EVERYONE SEEMS TO BE ABLE TO GET AROUND IT BUT ME!  I HAVE BEEN STUCK IN IT FOR 10 YEARS, AND NO ONE WILL HELP.\n\nI am trapped in a goddamn catch 22, willing to do anything but keep getting the short end of the stick.\n\nInternship?  Fine.  I work for my dad.  I'd intern in the afternoon for free.  Who will let me?  I don't know.\n\nVolunteer?  Same answer.\n\nWhat do I have to do to get a human being to look at my resume instead of it being deleted because it doesn't have the right keywords in a job description written by clueless headhunters who don't know anything about the job?  Camp out in their office?  Communicate in semaphore?  ESP?\n\nI'm fed up with the circular logic, non answers, and cliquisness.",
          "score": 1
        },
        {
          "body": "People saying the big box stores/ chain restaurants are always hiring can't say that because they don't know your local market. \n\nMy Aunt spent a year trying to get one of those jobs after she retired with no luck. She had a group interview with 11 other people to fill one part time position once even. \n\nMost of these stores are too busy to accept applications in person and require an online application.\n\nYour education may hold you back from those jobs if you have too much.\n\nYour best bets are Temp agencies (call them and see how they can help, you usually have to follow up frequently to get their attention) or call centres (even these jobs are becoming more frustrating for applications, with some requiring multiple stages of testing and interviews).\n\nNetworking is also very important. Do you know anyone who would recommend you for a job?",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "I've become a bad employee, how do I get out of this funk?",
      "body": "In 2020 one coworker left - like literally midday just walked out. My other co-worker retired at the end of 2021. I picked up the slack with the understanding that we'd eventually hire someone to help me in payables after we got another hand in our payroll dept. Except no, we didn't.\n\nMy manager would always acknowledge my huge workload, and I thought I had directly asked at some point for confirmation that we planned to hire someone else full-time, but looking back now I'm not positive I ever did. I know I've been saying I need help this whole time though. Over and over again. \n\nLast Oct. I didn't realize I was experiencing burnout. I heard we were hiring someone new for our admin and I was thrilled - finally I was going to get help! But then word got around about the new hire. She was hired for payroll, but we had already hired another payroll employee... She is very young, with just 2 YOE, but she does have an accounting degree. Oh, and her salary is about $12k more than mine. I have 17 YOE and a degree (although in an unrelated field).\n\nI wanted to quit that day. Something in me broke and suddenly I didn't care if my work didn't get done. I want to care, but I can't. I've been looking for work, I've had some interviews, but the market is trash and most jobs are posting salaries lower than I can accept.\n\nI've automated as many processes in my job as I can, but I'm so done trying to do anything for this company. If they acknowledge my efforts at all they act like it's a silly arts and crafts project that is just a waste of time.\n\nSome days I get literally nothing done, and I know I'm wasting time, and it just makes me more anxious about my reality. I don't know how to motivate myself to care again.",
      "subreddit": "jobs",
      "score": 25,
      "url": "https://reddit.com/r/jobs/comments/1n0qaa2/ive_become_a_bad_employee_how_do_i_get_out_of/",
      "comments": [
        {
          "body": "The big lesson here in my opinion is its better to work for yourself. The corporate world nowadays treat employees like tools and not people. If you are not able to work the first thing they will ask themselves is how to replace you, not “are you ok”. Im also stuck in corporate world currently but working on a way out. Hopefully run a successful small business one day",
          "score": 12
        },
        {
          "body": "Yup.  Classic burn-out.  There is no quick fix.  Try this...  get sick NOW.  Take one or two \"mental health\" days off.  They won't fix anything, just give you breathing room.  If you've gotten away with some unproductive days then you can manage your workload to f\\*ck them.  Do what you want, when you want.  If someone asks you about anything then shine 'em on until you quickly get it done.  Make this about what's best for you.  F\\*ck them.",
          "score": 9
        },
        {
          "body": "This sounds like classic burnout, and the sucky corporate environment doesn’t help. It’s sad that they hire new hands for higher salaries while not providing their existing, tried and true staff that same level of compensation. Sadly that’s not out of the ordinary and it’s a huge reason the average person changes jobs every few years either by moving up or moving on.\n\nMy first job was at Target as a team member in college, and even after college I stayed on for a few years and worked my way up to a salaried department manager (ETL was the position name). It’s one of my biggest regrets. My department around the holidays required me to work 80-90 hour weeks (60 the rest of the year) and, since I was internally promoted, I started at the base 65k ETL salary at my store. Less than two years into this position, the store hired on a new ETL who was a Nordstrom manager previously and they negotiated a 90k salary for themselves. That was my sign to do better for myself and I got out of retail. \n\nIt sounds like you need a change of pace, and to be part of a new team. Personally, I’d begin looking for something else, not just because of someone less experienced being hired on for significantly more, but because burn out is so hard to overcome once you’ve experienced it. They see that you *can* handle the workload, so why rush in finding some help? \n\nEven if conditions eventually improve, even if staffing needs are met tomorrow, the damage has already been done to *you*. You might temporarily feel some relief from the heavy workload, but in the long run that feeling and the fact that new colleagues are compensated more than you will stick with you.\n\nMaybe there is some magical way of overcoming this, but the only thing that’s ever worked for me personally is to change my job or work environment. \n\nAt least give yourself a little vacation or some time off. Get away to decompress and breathe and take your mind off of work for a bit.",
          "score": 2
        },
        {
          "body": "I feel you. I have been complaining of my workload for a year now and all the while I see other departments staff up. Ive been a one man show for 6 years now. Its partly my fault for being super man.",
          "score": 2
        },
        {
          "body": "Yeah I learned from last job, I was error free while others were slackers and they had constant errors, but they were favored so never fired. I took layoff offer since I was tired of literally getting screwed with barely a raise. She was the worst mgr ever to let ppl with constant errors stay, I believe they were just making lies about me, it's always the ppl getting mad when someone doesn't get errors to lie. So I'm like screw ya, I'm not being treated this way anymore 😆. They all acted like 5 yr old babies, I never got mentioned in meetings for everything I did, they literally needed to be named for just doing their daily work, quite pathetic being that needy. Hard lesson learned, don't be the best apparently 😂. And don't let someone take advantage of you too long anyways. I'd suggest looking for a job while keeping that one, never get overworked else you'll feel miserable and could possibly die, my BP was like 200 at that time when Dr kept saying you're gonna get a stroke and finally it's getting close to normal. It's not worth jeopardizing health over a bad job",
          "score": 1
        },
        {
          "body": "Probably time to move on to new opportunities.",
          "score": 1
        }
      ]
    },
    {
      "title": "Need a new job or something!",
      "body": "I have worked at my current job for a little over a year. Do not get me wrong I love my boss and co workers, however the pay is barely livable anymore. Luckily, I live with my boyfriend who has been able to pick up my slack. I am currently pursing a masters degree (MBA with a 4.0) and have my BA. I have been applying to job since June of this year… I had one scheduled interview and an hour before I was supposed to be there they called and informed me an offer letter had been accepted. I have been applying to everything at this point not just in my field anymore. I’ve applied to entry level and still no bites, just continuing rejections. \nI can come keep up with this lack of pay I am receiving and the company is newer so I know I will not be able to ask for a raise. \nWhat websites seem more legit when applying for jobs? Should I start calling or emailing places I am applying or will I appear desperate? Legit any advice I can get I am willing to take.\nMy boyfriend suggested I go back to bartending/serving for an increase an income; to me that just feels like a step back and bad for a resume? \nI know the job market is horrible right now but f@!!!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1pch9tj/need_a_new_job_or_something/",
      "comments": [
        {
          "body": "Bartending while pursuing your mba wouldn’t look and at a resume at all. People work those type of jobs while going to school (yes even grad school) \n\nWhat type of field are you looking to get into? Or what type of role?",
          "score": 1
        }
      ]
    },
    {
      "title": "Final interview tomorrow, have some questions",
      "body": "I have a final interview tomorrow for an outside sales role in the construction space…. My first two interviews were virtually with the recruiter in mid July, 3rd interview virtually with the regional sales GM in late July….  There was some delay due to a vacation but my final interview is tomorrow on site with the sales GM and the CFO. \nI unfortunately lost my previous role on 7/11 and have not mentioned that I am recently unemployed. Should I mention it now? I didn’t want to come off too desperate initially. I feel like I should have in the beginning of the process and am wondering if a month discrepancy in a background check for employment verification would raise alarm bells pending I get an offer? I was let go from that role for performance (after almost 2yrs). While I do take some ownership of some misalignments, I disagree with my manager and didn’t align with the company….\nAlso, wildly unrelated…. I am so torn between dress shirt and tie with slacks or full blown suit…. It’s like 90 degrees but don’t want to look too casual. What to wear? First question a bit more important, thanks in advance ",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1mtckdl/final_interview_tomorrow_have_some_questions/",
      "comments": [
        {
          "body": "Unless in the 3rd interview they ask why are you leaving i would not share.  You do have to be prepared with a statement about why your employment ended.  Sounds like you have some good nuggets there.  Can't remember if you said you'd be at a construction site. If so, no need for suit.",
          "score": 1
        },
        {
          "body": "I would not mention you left your job but be honest if they offer you on your background check. I got termed from a job and during the interview told my company “it wasn’t a good fit for me” and they didn’t ask any details about it. For you it’s a little different but if they ask I’d just say unfortunately things came to an end and it wasn’t a good fit. \n\nFor the suit, I’d go no tie but everything else. I work in finance and I was over dressed with no tie! Good luck!!",
          "score": 1
        },
        {
          "body": "Yeah, best to be upfront. You can mention in passing how your previous role ended and focus on what you learned or how you're applying it in the future. For the dress code, go with a dress shirt, tie, and slacks; it's balanced and won't be too much given the heat. Good luck tomorrow!",
          "score": 1
        },
        {
          "body": "You don’t need to bring up your unemployment now; it’s normal to have a gap between roles, and a month's break isn’t going to raise red flags, especially since background checks care more about start/end dates than exact days. If it comes up, just be honest and frame it as a learning experience, but don’t volunteer it last minute. \n\nFor attire, go with the full suit even if it’s hot, final onsite with senior leadership is worth the extra effort, and it shows you’re taking it seriously.",
          "score": 1
        }
      ]
    },
    {
      "title": "Tips for feeling out attitude toward flex/vacation without looking like a bad candidate?",
      "body": "I am a very hard worker who is good at my job and good at managing up/down. Senior director level. Non-technical tech worker.\n\nBut work-life balance and travel are both very important to me. I'm very good at doing my job within the actual hours and advocating when that's not possible. I also really valuable being trusted rather than surveilled.\n\nI am currently underpaid by a good 40k and part of the reason I'm still here is because my company is so good above the above (and tbh I've built up trust ofc).\n\nIt's time to move on for career reasons but I think I might die if I have to work 9-6 again not going to lie.\n\n**In an interview context,** how do you suss out things like \"is this a 9-5 job or 8-6?\" \"Am I going to get slacks if I'm not online at 9:05?\" \"how weird are you about dentist appointments?\" \"When you say remote, am I allowed to work from my parents'? From Europe for a few days?\" \"Do you have summer fridays?\" \"What's the PTO/days off look like and are you going to be weird when I use it?\" \"What are your thoughts on the sanctity of weekends?\"\n\nObviously I can do my own research in terms of glassdoor and how many times they mention work-life-balance on the website and benefits on paper but when it comes to direct communication with the org/recruiter.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1pf1yzq/tips_for_feeling_out_attitude_toward_flexvacation/",
      "comments": []
    },
    {
      "title": "How I Got a Dream Job in Under a Month (Online Apps are BS)",
      "body": "Hey all, I’ve seen all the posts here about people trying to find a job as a recent grad and figured I would share my experience in hopes of helping.\n\nI had an obligation after graduation (May 2025) that ended in mid-September, so that is when my search started. I first relocated to an area that had a lot of companies working in my field. Initially I started the way a lot of people do - applying online, writing cover letters, and hoping to hear something back. This path netted 3 introductory interviews, two of which I went to second round, and from that I got one offer that didn’t exactly align with my interests/skillset. \n\nAbout three weeks into my job hunt, I realized the online applications were bullshit and changed my approach. I donned my sport coat and slacks, printed resume copies, and went knocking on doors one Friday afternoon. I did not go in looking for a specific position, and many of these companies did not have open positions listed. I did research beforehand on places that would align with my skills/interests and had two outcomes from each location: 1) I would speak with a receptionist and leave a resume or 2) the receptionist would call in someone to talk to me.\n\nTwo companies showed significant interest and reached out to me later that day to move forward. By the end of the following week, I had another offer on the table with a 15% increase on top of my asking salary. The other organization, however, did work that I was really interested in, so I called them and let them know (respectfully) that I had another offer on the table and wanted to respect them and their time. I let them know that my asking salary had changed due to my other offer, and I had an offer letter in my inbox in less than 24 hours.\n\nChange your strategy, be aggressive, and try to stand out. For me, all it took was to take the initiative to show up in person. Companies are not posting all of their open positions or needs, so when you show up and say “I like what you do and I want to be a part of it,” it impresses.\n\nTLDR: I changed my job search strategy and got a job that I actually want in a week and a half. Don’t get stagnant.\n\n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1oaufkc/how_i_got_a_dream_job_in_under_a_month_online/",
      "comments": [
        {
          "body": "Great job.\n\nBeing willing to move to where the jobs are, and get out there with your resume and meet companies is important in finding a good job.\n\nFollow-up is also very important.",
          "score": 3
        },
        {
          "body": "I'll take Things That Never Happened for $200, Alex.",
          "score": 2
        },
        {
          "body": "This is actually pretty smart. You showed initiative, courage, persistence - all things that companies want in \\*any\\* employee. You also likely showed that you have good communicative skill, but they probably looked at you as someone who had a problem and got off their ass to solve it instead of being passive about the whole process. That tells employers that this is what they can expect if you encounter a challenge on the job. Well played. And good luck moving forward.",
          "score": 1
        }
      ]
    },
    {
      "title": "Last interview question",
      "body": "So I had an interview yesterday. I had to schedule it later in the day since I was still working at my current job. I go to the interview and I didn’t particularly feel like the interview was my best but I dont think it went bad untilllll; my interviewers last question. \n\nBefore the interview ended she asked if she could ask me a personal question and she didn’t mean offense. I’m curious so I say yes ask. “ I just have to ask, why didn’t you show up to this interview dressed business professional?” I was floored. I’ve never had an interviewer ask me why I was dressed a certain way. For the record I was dressed business casual. I had just left my office so i unfortunately wasn’t able to just go home and change. It felt like the air has changed. I no longer felt confident and bumbled my words explaining I had just left my office and hadn’t had time to change. I actually looked down at my outfit. I thought maybe my blouse had pulled down exposing cleavage or maybe it had a stain. I didn’t see anything on my outfit that stood out. I was in heels and dark pants, was it the pants? Probably. I usually wear slacks but I forgot to grab them when I left to work and no time to change meant I had to go in what I was wearing. The way she asked youd’ve thought I was in a graphic tee and shorts. \n\nAfter that, the interview ended. I felt humiliated and uncomfortable. Later on I read the companies reviews on Glassdoor and saw many posts expressing how bad the management was and how it’s best to avoid working there. I didn’t hear a call back from them after this. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1p2mrzi/last_interview_question/",
      "comments": [
        {
          "body": "So, yeah. Not the job for you. And not them. Next!",
          "score": 1
        }
      ]
    },
    {
      "title": "Unemployed nurse, now overqualified for non-nursing jobs. Running out of time before I can't afford my rent. Your advice, please!",
      "body": "Hello, I'm new to the sub, but I'm glad I found it! I will try to keep my post concise. I really appreciate any advice.\n\n&amp;#x200B;\n\nI am 26. I have a bachelor's degree in nursing and have been working full time as an RN for 4 years in various healthcare settings. I am currently unemployed. My previous job was at a large dialysis clinic in one of the worst areas of my city. The clinic was chronically, absurdly understaffed. The patients were literally uncontrollable at times. The clinic lacked leadership and communication from management. Much of the staff just didn't care much anymore, and the ones that did were going crazy trying to pick up the slack and do their best. After just 9 months at this clinic, I developed severe depression and anxiety. I took a 1 month leave of absence and voluntarily attended a 2 week outpatient day program at a local hospital. I quit as soon as my LOA was over. I didn't give them 2 weeks notice. I fully understand the consequences of having done this. I had been actively looking for other jobs for about 3 months when I quit, but did not have a job lined up before quitting. I decided I would rather work an entry level job than continue working at that clinic because my sanity was worth more than my very nice paychecks.\n\n&amp;#x200B;\n\nFast forward 2 months, and I am finding that I am not even being considered for non-nursing jobs, most likely because I am overqualified (according to my dad). What complicates things is that I am pretty burned out with nursing altogether. At this time, I am really not interested in direct patient care. I have applied to the very few jobs in my area that don't involve patient care, such as insurance company nurse jobs, but none have worked out, even though my multiple interviews went well. I look often for these types of jobs, but they are very few and far between. I just feel I need a break from nursing for a while to regain my confidence and resiliency.\n\n&amp;#x200B;\n\nWhen at my previous job, my boyfriend was making about half of what I made, so I paid the majority of the household bills and rent. We don't have enough income to pay our bills with just his income. My parents have gifted us a good amount of money over the past 2 months to help us, and I know they would continue to if needed. Obviously that's not what I want though. I want a full time job. I have done the math, and to pay our bills without help, I would need to make somewhere around $15/hour.  When you narrow the search down, there are really very few jobs in my area that pay close to this, are full time, are something I can physically do, and don't require a specific certification or education.\n\n&amp;#x200B;\n\nI have unsuccessfully applied for about 5 overnight bakery jobs (no experience required), watch battery technician, entry level furniture refinisher, medical equipment warehouse technician, inventory lead at a local candy store, entry level dental lab technician, entry level insurance claims processor.\n\n&amp;#x200B;\n\nI'm just at a loss of what to do anymore.\n\nShould I apply to jobs I know pay too little and try to work overtime? Any suggestions for companies that will not disqualify me for being overqualified?\n\n&amp;#x200B;\n\nTL;DR\n\nUnemployed burnt out nurse, overqualified for non-nursing jobs. Where should I look?\n\n&amp;#x200B;\n\n&amp;#x200B;",
      "subreddit": "jobs",
      "score": 270,
      "url": "https://reddit.com/r/jobs/comments/a4ora7/unemployed_nurse_now_overqualified_for_nonnursing/",
      "comments": [
        {
          "body": "I don’t think it’s a matter of you being overqualified. They probably see your work history and think you’ll just be a part-timer until you find a job in your field. So why waste time training you for you to turn around and leave. \n\nTwo thing, you can mention in the cover letter that you’re looking to change career paths. True or not, you’re at least explaining the switch. Or, apply for jobs that wouldn’t care too much about your history. Retail, server, etc.",
          "score": 160
        },
        {
          "body": "There are more industries in nursing that are a better fit, sorry to push nursing as you said you were burnt out of a toxic workplace but you have less horrible options in the field. Case management for patients is an option that involves coordination of care without direct patient care. Home health RN is also a slower change of pace for a 1:1 ratio and predictability of their needs. I think your BSN/RN license is too valuable to neglect in a competitive job hunt if you seek a wage of $15 or greater.",
          "score": 165
        },
        {
          "body": "I gotta say, you really should be going back to bedside nursing. You can earn in 2x 12hr shifts what a full time 15/hr employee would make all week. Once you are in in a hospital system, it will be easier to cross train to case management, infection control, or (what I would do if I were an RN) PICC line team. ",
          "score": 46
        },
        {
          "body": "Perhaps you could find a job as a primary caregiver for somebody with disabilities? Your nursing experience would be super transferable! I see a lot of job postings for 1-on-1 care that might be up your alley because it looks like you’re tired of being overworked and under-appreciated. ",
          "score": 29
        },
        {
          "body": "Since  you are in a crunch, you should just contact your local nursing agencies and with your experience they could probably find you placement quickly.  It will give you a chance to start earning a paycheck quickly and maybe find a better fit in specialization.",
          "score": 20
        },
        {
          "body": "School nurse seems a perfect fit.  No real patient care, per se.  Good hours and likely good pay.",
          "score": 16
        },
        {
          "body": "Are you burnt out of nursing, or just burnt out from a shitty job? Since money is an issue, I'd say give nursing another try - if after the 2nd-3rd time you still feel like nursing isn't for you, then you should look into other options. ",
          "score": 45
        },
        {
          "body": "What about working as a research nurse? Good pay and decent hours. ",
          "score": 16
        }
      ]
    },
    {
      "title": "What do I wear to a Dental Assistant interview?",
      "body": "I just got off the phone with a dental office regarding a dental assistant position. All she asked me was to tell her about myself. How long ago did my dental assisting class end. And if I understand sterilization and infection control, how to set up and breakdown rooms. She then asked for me to go next Tuesday at 9am. \n\nI asked her if there’s anything specific i should wear or know ahead of time and \rshe said i’m not going to have you jump in or anything so just whatever you’d wear to a regular interview. This is just to know a little bit more about you and for you to meet the girls.\n\nThis is my first \"actual\" in person interview. I've never had a job before but just finished a dental assisting class about three weeks ago. I've already gone to observe a office and they asked me to wear scrubs to fit in. But for this what do i wear? Black slacks, cardigan ? What shoes? I really don't want to buy new shoes. I have white sambas is that fine? Where can I find petite slacks in person? Old navy?\n\nAlso for reference on me: I'm 22 years old and 4'10. About the office: They are all female. The owner is a little older and the rest of the staff looks young. They make funny instagram reels lol. Also I looked up the office hours and on Tuesday they asked me to go at 9am but they don't open till 11am, is that normal? Also I live in chicagoland area and the weather right now is very bipolar",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1mv1nkx/what_do_i_wear_to_a_dental_assistant_interview/",
      "comments": [
        {
          "body": "omg also do i bring a tote bag? a purse? nothing? do i print out my resume? bring a notebook?",
          "score": 2
        },
        {
          "body": "Congratulations on getting an interview! The start time could be they open at 11am for patients but they want you to come in at 9am to meet the team without 'distraction' of also dealing with patients - just my thought. \nFor shoes, I would say close- toed shoes, preferably not sneakers. Slacks and a cardigan will work just fine for an interview. Good luck!",
          "score": 2
        },
        {
          "body": "A nice outfit, black slacks, a nice shirt, think of first impression you would want to make with a date you really wanted to go out with for lunch. Generally an extra resume is a good idea, sometimes they can lose it or just not immediately have it.  A small notebook is also a good idea, sometimes they’ll start your right away, or just give you a lot of information.  I get nervous so I’m always writing notes.  A nice bag is fine, could be a tote or purse.  Again, think, someone has 30 seconds to look at you, what kind of impression do you want to make?  You’ll do great! ",
          "score": 2
        },
        {
          "body": "The whole office is women? And young? Dress cute.",
          "score": 1
        }
      ]
    },
    {
      "title": "in person interview",
      "body": "Hi,\n\nI have an in person interview at a grocery store near me on Thursday. I'm a female if it matters, I have a pair of slacks and a flattering blouse. Should I get dress shoes also or would that be over kill for my position? It's a cashier position. I might be over thinking it but I really need a job, no matter what job right now until I can get something else. I want to impress. The shoes are black and match the outfit, they are in good shape, would that be enough for business casual or do you all suggest the dress shoes?",
      "subreddit": "jobs",
      "score": 7,
      "url": "https://reddit.com/r/jobs/comments/1mcw0ix/in_person_interview/",
      "comments": [
        {
          "body": "[removed]",
          "score": 10
        },
        {
          "body": "Hope you get it!",
          "score": 2
        }
      ]
    },
    {
      "title": "Mock interview practice - any sane tool, Slack/ Discord channel, out there?",
      "body": "# Hey Job hunters,\n\nI am looking to do some mock interviews for New Grad Software Engineer/ Frontend Engineer.   \n  \nAre there any good mock interview products, resources, or communities that you can suggest? What has been your experience with these?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1njo0zv/mock_interview_practice_any_sane_tool_slack/",
      "comments": [
        {
          "body": "\n\n\n\nHi there! I’m building Interview Copilot ( https://interviewcopilot.me ) , a tool that lets you practice mock interviews using your target job description and even provides real-time AI suggestions during live interviews. Would you be interested in testing it and sharing feedback?",
          "score": 1
        },
        {
          "body": "What helped me most was weekly mocks with a buddy over Slack Huddles where we swapped interviewer/candidate. I used Beyz interview assistant to run timed rounds and jot feedback, and I pulled prompts from the IQB interview question bank so it felt varied. For FE, I’d do a 45‑min build like a searchable list with debounce and a quick test.",
          "score": 1
        }
      ]
    },
    {
      "title": "My company accidentally left the interview feedback public, should I let the candidate know? It's internal promotion and I work with them",
      "body": "I was looking for something in Slack today (for information I needed, wasn't snooping but happened to put in the right keyword) and found a temporary channel where HR and recruiting were discussing a role they are in the process of filling. I assume these channels are normally private but this one was not. One of the people they're interviewing is someone I work with currently. We haven't worked together for very long but have a positive relationship. The feedback they had was rough (and IMO not completely fair but probably other people who gave feedback have worked with him for longer than I have).  \nI told a personal friend, no work connection, about this work drama and she said to send my colleague the link. Now I'm torn- I don't want to kick a hornet nest at work, but also the feedback might be helpful for his career and I don't know what kind of feedback they'll give him as part of the interview process.  \nAlso, I definitely wouldn't send him the link; I'd invite him to a meeting to talk or something else where the company couldn't snoop and read!\n\n  \nEdit: Woah I went out of town for the 4th (American independence day) and came back and this post had blown up! I appreciate everyone's input but I won't be able to respond to each post. I heard the feedback loud and clear and won't mention anything to my colleague! I knew one person who was in this channel so I waited until we had a one on one meeting and mentioned it to them. They said they would take care of it; I assume everything is locked down but I haven't searched again.",
      "subreddit": "interviews",
      "score": 635,
      "url": "https://reddit.com/r/interviews/comments/1lorphq/my_company_accidentally_left_the_interview/",
      "comments": [
        {
          "body": "Stay the hell out of it",
          "score": 591
        },
        {
          "body": "I wouldn’t insert myself, but I can see how the information might be helpful. But I would pretend like it never happened.",
          "score": 47
        },
        {
          "body": "Would you like it if it were you? Would it feel helpful and compassionate and would you say, “gosh! Thank you so much! I had no idea!” I highly doubt it and it would be very easy for someone to misplace their disappointment with candid, vivid feedback that cuts and direct that squarely at the messenger. Don’t be that messenger. I’d be more apt to message one of the people in the chat and say, “I stumbled across this while keyword searching slack and I’d hate for anyone else to do the same.”",
          "score": 65
        },
        {
          "body": "stay out of it.\n\nif you mention the channel and they find it and open their mouth, hr will investigate and it will very quickly come out that you were in the channel first and youre likely both going to be fired.",
          "score": 59
        },
        {
          "body": "This should be reported to your compliance or privacy team as a breach for their assessment. The slack channel is likely not meant to be open, you should notify one of the people in the HR chat or your people leader so they can lock it down and report it. Do not tell your colleague.",
          "score": 41
        },
        {
          "body": "Your personal friend may have good intentions, but that idea is terrible. Don't touch this situation even with a ten foot pole.",
          "score": 17
        }
      ]
    },
    {
      "title": "Jeans are a complete no?",
      "body": "I need help! I (30F) am interviewing for a position at an elementary school cafeteria. Very literally a lunch lady. I have a pair of dark, clean, well fitted jeans with no holes. I was going to wear them with a nice blouse, and cream colored flats. I told my MIL that and she nearly fainted. I figured the job I’m applying for is not a fancy job at all. I don’t own slacks or black pants of any sort. My options are jeans or maybe a dress? Surely I can’t show up in leggings. Would a dress be equally as crazy? Help me! ",
      "subreddit": "interviews",
      "score": 25,
      "url": "https://reddit.com/r/interviews/comments/1lgpoo1/jeans_are_a_complete_no/",
      "comments": [
        {
          "body": "Honestly, of the jeans are dark and you wear a blouse and nice shoes, look professional and put together, and have no other things to wear, it will probably be ok.",
          "score": 59
        },
        {
          "body": "Even when I interviewed for retail, I always did black slacks or pencil skirt with a black blazer. If you want the job, put in the effort. Especially in this job market. It could make the difference between you and another applicant.",
          "score": 13
        },
        {
          "body": "Jeans might be okay for this job, but my mindset has always been given the option of being either overdressed or underdressed for a situation, I’ll take being overdressed 100 times out of 100.",
          "score": 29
        },
        {
          "body": "Jeans may be OK for this type of job, but why risk it? Wear trousers or a dress. ",
          "score": 9
        },
        {
          "body": "jeans are absoltuely fine for this kind of job, your MIL is just behind the times. i’m currently job searching and did 4 job interviews from which i got 3 offers and i went to all of them in (nice) jeans and a t-shirt. and they were for HR positions, and breaking into the field without prior experience. i think over-dressing can come off a little out of touch, if anything.",
          "score": 15
        },
        {
          "body": "I would say no to the jeans and invest in some nice fitting black slacks. It’s a staple that you can always use and go back to as well. As for the dress, it depends on what it looks like. There’s some very business casual dresses out there, or like a pencil skirt with a nice blouse type deal. All are good closet staples to have! And good luck on your interview!! 🫶🏼",
          "score": 13
        },
        {
          "body": "Personally working in retail I don’t mind as long as the outfit is clean, fashionable ( work in clothing retail ) and tidy.\nHowever- I’ve never myself dressed in anything less than slacks with nice shoes and a button up shirt",
          "score": 3
        },
        {
          "body": "Don't waste money on slacks you'll never wear again. All of mine are in storage bins, very out of fashion where I live. \n\nJeans or a dress should be fine. \n\nCheck out a few fashion/style YouTubers your age and see what they recommend.",
          "score": 3
        },
        {
          "body": "Your MIL is correct - jeans to an interview are a ‘no’. \n\nSpend the weekend at the thrift store or Marshall’s/TJ Maxx and find a pair of plain slacks. Black is best (because it goes with everything) but tan or dark blue works also.",
          "score": 17
        },
        {
          "body": "Rule of thumb is to dress one step up nicer than the job you're going for regularly dresses. Jeans aren't a step up from a uniform, which I'm guessing lunch lady will require. I agree with the other commenter about getting some black slacks. \n\nOr a simple black dress that you can use for any formal occasion including funerals. Like, don't just buy for the interview but definitely diversify your wardrobe if it's only jeans and leggings.",
          "score": 4
        }
      ]
    },
    {
      "title": "Interview - Suit or not when 100 Degrees",
      "body": "I have a job interview today. I typically always wear a suit to an interview, but today it's going to be over 100 degrees outside. Will I look weird showing up in a full suit? Should I just stick with something a bit lower key, like a dress shirt, slacks and a tie? I think the full suit may make me seem like a psychopath lol. \n\nUpdate: Wore the suit as many suggested and I'm glad I did. The entire panel was also in full suits. Thanks for the help everyone! ",
      "subreddit": "interviews",
      "score": 11,
      "url": "https://reddit.com/r/interviews/comments/1lj9iay/interview_suit_or_not_when_100_degrees/",
      "comments": [
        {
          "body": "If it's a job interview that normally would require a suit wear a suit. ",
          "score": 30
        },
        {
          "body": "Always dress to impress.  Even if the job ultimately doesn’t require that type of attire, it’s always great to show up looking your best.  Remember that you are your own brand, so represent it in the best manner every time.",
          "score": 11
        },
        {
          "body": "It depends if there is a long walk/commute into the office.  But if you are parking the car in their lot and walking to the lobby like going to a Trader Joe’s.  Then, a suit is fine.  But if you are going via subway and have to walk 9 blocks.  A dress shirt and tie is probably fine. ",
          "score": 8
        },
        {
          "body": "Bring a change of shirt or clothes so you can change after the interview",
          "score": 5
        },
        {
          "body": "Just make sure you don’t smell. That’s the end game",
          "score": 4
        },
        {
          "body": "Wear the suit. Just wait until right before you walk I side the building to put on the jacket and do everything you can to stay cool on the way there",
          "score": 3
        },
        {
          "body": "Suit!",
          "score": 2
        },
        {
          "body": "Your interview isn’t outside is it?   \n\nDress for the job you want.   If they take off their coats feel free to do the same.",
          "score": 2
        },
        {
          "body": "Wear the suit. Lose the tie. Button down shirt. It’s hot outdoors. Not indoors.",
          "score": 2
        }
      ]
    },
    {
      "title": "How bad did I screw myself?",
      "body": "Had a video interview today.  Working from home I woke up later than usual to ensure some extra sleep and took a shower about an hour before my 2pm  interview.  Got out and shaved and while doing so, clipped the bottom of my nose (the part that's parallel to the floor) with my razor, hard.  Blood was just gushing.\n\nIt was 30 minutes before my interview.  The bleeding didn't stop.  I didn't have a styptic pencil so I tried a baking soda/ salt slurry.   Didn't help.  Put a bandaid on it looked at myself in the mirror and was like, maybe I'll just own this.  Then noticed the blood soaked through the bandaid.  Tried constant pressure for 10 minutes, didn't stop.  \n\nFinally got dressed and logged in to Teams meeting (no video) 1 minute late and told the hiring manager I was going to have to reschedule, that my dog had scratched me and caused the injury and I was bleeding from the face.  Not sure why I lied, guess i felt like taking a shower before a 2pm interview seemed odd.  Cut me some slack,  I was frantic.  \n\nShe seemed a little awkward but said maybe we can reschedule for next week or after the holidays.  I thanked her and apologized again.  Didn't hear from the recruiter so I emailed her around 6pm.\n\nThis is for a mid-career position with a large financial corporation.  Base pay is 165k-185k, only about 10 applicants for the job per the recruiter, requies very specialized skills although it's not rocket surgery.\n\nKiss this one goodbye or is this recoverable?  I can't stop cringing.  It just sounds like such a ridiculous story.\n\nIt took 2 hours after I cut myself for the bleeding to stop.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p045t2/how_bad_did_i_screw_myself/",
      "comments": [
        {
          "body": "Truthfully, After the holidays doesn’t sound promising ??",
          "score": 8
        },
        {
          "body": "Slightly OT but definitely consider getting a routine blood panel soon. Most cuts usually clot much faster so you might have low platelets. \n\nI was in a similar situation and I pushed to have a blood panel done with my next doctor’s visit. Turns out I had lymphoma. \n\nPro tip: get your blood drawn once a year to help identify any potential health concerns.",
          "score": 3
        },
        {
          "body": "Why didn't you just do it with the camera off, stick some tissue on it? Or was it that bad? Anyway, you worry too much. I'm sure it was fine but now it sounds like you've got a badly trained dog that scratches you in the face. Lol... ",
          "score": 3
        },
        {
          "body": "Circle back after the holidays is the kiss of death",
          "score": 1
        },
        {
          "body": "Wow, sorry to hear. IMHO you're toast. View it as fate tho or wasn't meant to be.  Just try to move on and be grateful for the job you do have I suppose.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview with a company I just completed a contract job – attire",
      "body": "I previously worked through an agency and the job concluded last week. I saw and applied to a direct hire production planner job and messaged HR, I used to work in the department, so I figured why not give my old boss an fyi.\n\nAnyway, I have an interview next week. The office is casual, and the position is in the warehouse, so it’s very casual. I just saw them last week, do I wear a suit no tie or just go polo and slacks?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1pu4e5s/interview_with_a_company_i_just_completed_a/",
      "comments": [
        {
          "body": "I would go smart casual. It's dressier than they are and much dressier than the job requires, so I think it strikes a good balance between respectful but not silly since they already know you. I think a collared shirt and slacks sounds like a really good option. If they wear polo shirts, I would go for a button down. ",
          "score": 1
        },
        {
          "body": "I'd go polo, slacks, and nice shoes. The suit is massive overkill",
          "score": 1
        },
        {
          "body": "Honestly, for a warehouse role and considering you've recently seen them, polo and slacks should be fine. Just make sure everything's clean and polished. It keeps things casual yet professional, aligning with the vibe there.",
          "score": 1
        }
      ]
    },
    {
      "title": "Is it okay to bring a plain tote bag to a professional interview?",
      "body": "I’ve been getting mixed answers on google and I don’t want to give a bad first impression for an HR internship. \n\nSome say backpacks and sometimes tote backs are unprofessional to bring to interviews. However, I rely on public transportation and they don’t make big enough pockets in women’s slacks or blazers to keep my phone, wallet, and other important items. ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1ofxbx9/is_it_okay_to_bring_a_plain_tote_bag_to_a/",
      "comments": [
        {
          "body": "Hi, director level, I've hired zillions of people including interns. \n\nThere's no issue at all with a tote or even a backpack. Just keep both conservative and unremarkable, and you'll be fine.  Heck, I use both for work and I'm GenX!",
          "score": 7
        },
        {
          "body": "I’d say something clean, not-branded (as in not a university or similar), and bought rather than a freebie. I honestly don’t think I’d want to work for someone who wouldn’t hire me over a tote bag, but obviously if you need an internship that’s not necessarily your mindset. Also backpacks are definitely fine, assuming it’s fairly standard\n\nAlso, given it’s an internship, they should have slightly different expectations of you than a grown adult in full time employment. Make an effort of course, but you’ll be fine. Good luck!",
          "score": 5
        },
        {
          "body": "I’d aim for a classic fake-leather women’s laptop tote bag or something like that, so it looks fairly business-like, not a canvas tote. But in that case it’s perfectly fine!",
          "score": 2
        },
        {
          "body": "You can get a classic black conservative targus backpack for $40 and it will be fine and what everyone in IT is carrying around, so they will be used to seeing it.",
          "score": 2
        },
        {
          "body": "No problem; go for something neutral. When you get where you’re headed, place in a chair next to you instead of on the table.",
          "score": 1
        }
      ]
    },
    {
      "title": "The Hypocrisy in Today's Job Market Has Crossed All Boundaries.",
      "body": "We keep hearing this broken record: 'There's a terrible skills shortage! And the new generation doesn't want to work!'\n\nBut at the same time, real wages have been nearly stagnant for 50 years, while the cost of living has skyrocketed to a level most of us have never seen before.\n\nAt the same time, companies have gradually eliminated almost all forms of meaningful on-the-job training and mentorship. They expect you to show up fully prepared.\n\nNot to mention, the hiring process itself has turned into a five-stage ordeal, and it has become standard for recruiters to ghost you after months of interviews.\n\nOn top of all that, job requirements have reached absurd levels. A position that required only a bachelor's degree 30 years ago now demands a master's and 3 years of experience, all for an entry-level salary.\n\nAnd speaking of education, it has never been more of a financial burden. Universities are full of useless filler courses, designed specifically to extend your studies and sink you deeper into debt, all so you can get the piece of paper they demand.\n\nMeanwhile, you're expected to be available on Slack and email 24/7. And unpaid overtime isn't a bug in the system; it's an unspoken, core feature of the job.\n\nSo to sum it up: companies refuse to pay a living wage, offer no training, demand ridiculous qualifications for standard jobs, make you jump through hoops only to ghost you, and expect your entire life to revolve around work. And somehow, we're the ones who are supposed to feel like we're the problem?\n\nYeah, tell me again how this job market is 'healthy.' This is an absolute joke.",
      "subreddit": "interviews",
      "score": 69,
      "url": "https://reddit.com/r/interviews/comments/1ojiv0n/the_hypocrisy_in_todays_job_market_has_crossed/",
      "comments": [
        {
          "body": "Well said. I agree across the board",
          "score": 10
        },
        {
          "body": "I totally agree.\n\nI applied for a PT admin/office assistant job today on Indeed.  I answered several questions in the application.\nI then get a TEXT TO MY PERSONAL CEL PHONE AT 9:20PM disturbing me while Im enjoying my dinner with this message..\n\n\"Hi C....,Thanks for your interest in the Admin Assistant / Office Manager (Part-Time, Possibility of some Hybrid) with H L Services Inc.. The next step is for you to complete the assessment that I sent to your email address. If you have any questions, please feel free to reach me back.Thanks,(HR)\"\n\nI go look at the survey and these fukks want me to respond to a 45min Behavioral Assessment of 270 questions. 40 min IC Ability Survey 50 questions and 12 min Skill test 26 questions!!!\n\nThis makes me not want to even bother because they show such extreme disrespect texting at this hour, let alone texting is a red flag to me on how they handle business. \nThe survey did look legit but I just feel really turned off and there is no guarantee spending time on that will get me am interview.",
          "score": 6
        }
      ]
    },
    {
      "title": "How to navigate my cannabis dispensary retail experience with employers outside of the cannabis industry?",
      "body": "Location: Greater LA area, CA\n\nI have \\~3 years of cannabis retail experience as a Guest Experience Specialist, Admin Specialist, and Inventory Specialist (the first 2 are corpspeak for \"budtender\" and \"receptionist\"). I have also been a shift lead, and performed countless audits. All of this experience has been at a fully legal, higher-end, cannabis dispensary. Not some sketchy, rinky-dink, trap shop/warehouse. My dad called my shop \"The Apple store of weed\" if that helps paint a picture. \n\nI have many transferrable skills when it comes to hospitality, front desk work, inventory, management, etc.  \n  \nHowever, a few years ago I had an interview with a luxury apartment complex. First round was semi-open interviews. The interviewer loved me, and invited me to a 2nd zoom interview with his direct supervisor. They were both 30ish.\n\nThe follow-up interview couldn't have gone better! They let me know that I was one of the 6 candidates they were pushing through for the final interview, and that they would be selecting 3 to hire. I thought \"Wow, okay. I must have this in the bag!\".\n\nUntil it came time for the final zoom interview with THEIR manager, a boomer-aged woman. Interview with her also went great UNTIL she asked me about my cannabis job. I was up front, honest, and explained my job responsibilities and how they would transfer to the job I applied for. Her entire mood shifted. I was basically trying to salvage the interview after that. She heard \"cannabis dispensary\", and I could tell she immediately assumed we probably got high all day and did jack sh\\*t. For reference: I wore a nice dress shirt + slacks to each interview. I am the type of guy who cares about my looks. I always maintain decent hygiene, and keep myself groomed and well kempt. I do not look like a stereotypical \"stoner\" by any means. \n\nAs you can probably guess-- I didn't get the job.\n\nTL;DR: How should I go about my cannabis dispensary experience regarding interviews? Any sort of advice on how to navigate this for interview purposes would be extremely appreciated!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1pehwzk/how_to_navigate_my_cannabis_dispensary_retail/",
      "comments": [
        {
          "body": "Honestly, your dispensary experience offers solid skills. Focus on how these skills contribute to business goals—customer service excellence, inventory mgmt, sales growth. Use terms like \"regulated retail environment\" instead of \"cannabis\" to shift the focus. Always stress professionalism and compliance when addressing past work, it'll help bridge any gap the hiring manager might perceive.",
          "score": 2
        },
        {
          "body": "Instead of cannabis I say product. No one has ever asked me to elaborate so either they know it’s cannabis already or they don’t care",
          "score": 2
        },
        {
          "body": "Glorified sales associate, not that hard bro",
          "score": 0
        }
      ]
    },
    {
      "title": "PO looking for PM and POs to mock interview with",
      "body": "I’m a PO with 3yrs experience in product, predominantly in fintech and prior consulting experience.\n\nI am interviewing for PO/PM roles at the moment, looking for other PO/PMs to do mock interviews and mock cases with. Anyone here interested or know of any slack or other groups where I can find others to connect with for this?\n\nHoping to start doing mock interviews via Google Meet, Zoom or similar this week.  \n\nHappy to be flexible w time zones, I work fulltime in AEDT, so CEDT and GMT mornings or AEDT evenings work well for me. ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1ot0t5z/po_looking_for_pm_and_pos_to_mock_interview_with/",
      "comments": [
        {
          "body": "I've seen a lot of folks finding mock interview partners on LinkedIn groups specific to product roles or related Slack communities like 'Mind the Product'. Check out Meetup.com too - there are often events for POs/PMs where networking happens. Also, consider starting a thread here in r/productmanagement; you might find others with the same need.",
          "score": 1
        },
        {
          "body": "Honestly mock interviews with other PMs/POs is smart but finding people with time can be tough. I'd suggest trying Final Round AI's mock interview feature too - I used it when I was interviewing for PM roles and it's really good for practicing case studies and behavioral questions without having to coordinate schedules with people.",
          "score": 1
        }
      ]
    },
    {
      "title": "Always worth a double-check...",
      "body": "UK, software/web developer.\n\nBack in the early 2000s, I went for an interview at a small but ultimately very well known website. I had already got past the CV stage and was invited to the offices to meet them.\n\nI got on, I thought, really well with the owners/bosses and we chatted freely about all sorts of stuff after we'd gone thru the proper interview stuff.\n\nWent home really happy. \n\nNext morning, get an email from the recruitment company saying that it would be a no as they wanted someone to start sooner. WHAT?! I was only on a 4 week notice period!\n\nI went down the pub that lunchtime, slagged them off to my mates, went back to my desk a little squiffy and composed an email back to the recruitment girl.\n\nBasically is said something along the lines of \"..can I just double-check... although I have the all the skills, would be a great fit and they enjoyed seeing me, they are saying no due to not being able to start in 2 weeks?...\"\n\nShe replied saying \"Now that you've put it like that, it does seem odd. Let me call them\"\n\nShe did. She talked them round (using my email to her as a basis) and I was offered the job.\n\nSpent 9 excellent years there before deciding it was time to move on.\n\nThey were new to recruitment (as this was kinda a bit of a startup that had already gained traction), so eventually I cut them some slack!\n\nSometimes, it's worth a double check on reasons for a \"no\"...",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n8a2s3/always_worth_a_doublecheck/",
      "comments": [
        {
          "body": "Great story! Honestly, your persistence paid off big time. It's definitely a reminder to clarify and challenge those rejection reasons when they seem off. Sometimes the decision makers aren't perfect, especially in newer startups. Props for not just taking no for an answer!",
          "score": 2
        }
      ]
    },
    {
      "title": "is this outfit appropriate for an in-person interview?",
      "body": "posting the pics in the comments because this sub wont let me post. \n\ni just got invited to do an in-person final interview. this is for a marketing/communications role in the financial industry.\n\nthey told me to wear business casual or business professional. i want something that shows my personality, my style is very bright colors and im very social and bubbly. but i want to keep it professional.\n\nis this a good option? i would wear a black button down shirt underneath and black heels, hair in a low bun.\n\nsorry, im so nervous, i havent done an in-person interview in 6 years. thank you!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1nkffsc/is_this_outfit_appropriate_for_an_inperson/",
      "comments": [
        {
          "body": "okay i apparently cant post photos because this subreddit is ridiculous. its a women’s burgundy pants suit. a burgundy blazer and burgundy dress pants, like wine color",
          "score": 4
        },
        {
          "body": "I would say this is fine. Generally you only want to make things stand out for one reason and color is the reason you're choosing. If it was a basic black or gray suit it would be just fine so, yea I think you're good getting adventurous with a wine colored suit.",
          "score": 2
        },
        {
          "body": "This looks great! The black shirt and heels keep it professional, and a pop of color is totally fine in marketing. Just make sure it's not too loud, and you'll do awesome. Good luck!",
          "score": 2
        },
        {
          "body": "White shirt\nTie\nBlack slacks",
          "score": -4
        }
      ]
    },
    {
      "title": "Appropriate attire when interviewing for a promotion?",
      "body": "I have an interview coming up for a lead/senior role in my office and I’m looking for advice on how to dress for it.\nOur normal attire is completely casual, like jeans and t-shirts, including the other senior employees. My boss typically wears a polo with khakis, and his boss typically wears a dress shirt with slacks. \nI’m currently planning on wearing a collared shirt (not exactly a “dress shirt”) and no tie. Just wanted some opinions on whether I’m approaching this correctly ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oyrlkr/appropriate_attire_when_interviewing_for_a/",
      "comments": [
        {
          "body": "Wear a suit. You don’t have the job yet. Show them you take this seriously. They may not expect you to dress up, but they will respect that you understand the opportunity and value their time. My husband works at a hospital and wore a suit to his interview. When he began explaining his attention to detail, they stopped him and said it was already obvious from how he showed up. How you present yourself is part of the interview, even if most people don’t realize it.",
          "score": 2
        }
      ]
    },
    {
      "title": "Ladies..what are you wearing to your interviews?",
      "body": "I have my first interview in 15 years coming up. I’m leaning towards black slack, a white button up shirt and black pumps. Super basic. I’m having second thoughts. It’s for an admissions rep at a college. ",
      "subreddit": "interviews",
      "score": 8,
      "url": "https://reddit.com/r/interviews/comments/1mq6hfd/ladieswhat_are_you_wearing_to_your_interviews/",
      "comments": [
        {
          "body": "I recommend wearing blue. It’s less formal than black but professional and provides an uplifting mood.",
          "score": 8
        },
        {
          "body": "Black slacks with white button-up shirt will look like a waiter. I’d wear a blouse with some color in it and/or a blazer over the blouse.",
          "score": 3
        },
        {
          "body": "That is fine and very safe. It depends on the company but usually a nice pair of slacks (all colors) and a dress shirt  (plain or with a design and often a suit jacket, heels or a skirt. Sometimes I will wear a nice cashmere sweater (crew or cardigan) with a cute accessory like a pendent or scarf.",
          "score": 2
        },
        {
          "body": "I essentially wear the same thing but with a suit jacket. It was drilled into our heads in college that to be fully presentable, you must wear a suit to interviews. I'll wear small stud earrings and a simple necklace. I always try to stay on the classy side. ",
          "score": 2
        },
        {
          "body": "That sounds perfect. Pop of color if you want.",
          "score": 2
        },
        {
          "body": "My husband works at a college (administrative role) and normally he dresses somewhat causal, but occasionally he does public-facing events and for that, he wears the equivalent of a suit. So for an interview, I would wear a suit or something similar. Maybe just add a blazer to your planned outfit.",
          "score": 1
        },
        {
          "body": "I’m old school. I wear a black or navy suit with a pastel shirt. Even if I am on a video call.",
          "score": 1
        },
        {
          "body": "Don't do the white top. As someone else mentioned - it's very reminiscent of a waiter in this day and age. Def a solid color top but something other than white. \n\nBut yes to everything else. I've noted in other outfit posts - you want to look like an extremely boring wife of a conservative politician. That's it. That's the goal. Nothing fun or colorful or bright. Solid colors. Zero patterns. No prints. No boldness.",
          "score": 1
        }
      ]
    },
    {
      "title": "How do you not emotionally invest so much into each opportunity?",
      "body": "It’s been 8 months since I was laid off.  Part of the reason is, whenever I get a lead (fortunately I did have few interviews), I slack on my job search.  I still apply, but not as determined as before I get the interviews.\n\nI just got rejected from this company that took 3 MONTHS for an interview process.  The job seemed like a done deal, as it was referred by a friend inside and position was on her team.  I already knew few people inside.  I had another friend who was a good friend of hiring manager, and hiring manager was actually recommending me to other managers prior to this position.  But at the end, he ended up choosing someone else.\n\nI am over with this company.  I just can’t get over the regret that I feel like I wasted 3 months (actually longer because this was actually my 3rd time interviewing with this company, but it’s another story) with them.  I could have and should have continued doing job search full force in the mean time.\n\nAfter this experience, I got back onto job searching full throttle.  And fortunately I’m actually already getting some leads.  I’m trying to learn from last experience and trying to keep myself detached emotionally.  I’m trying not to get too excited.  I’m trying not to think and get excited about “what if I get this job?  What would it be like working with this company?”.  My family is all happy for me for every interview, and hype me up saying “you can do it!  you have everything they are looking for!”.  I appreciate their support, but the more support I get, the bigger the disappointment when I get rejected.  But still you need to show your enthusiasm going into an interview.  How can I celebrate each milestone (“I got an interview!”) but not feel discouraged even before the interview that I might get rejected again?  I’ve made it to few interviews til final stage, and seeing the rejection email after putting all that time/effort into is crushing every time.\n\nI see people say “once you apply for a position, or finish an interview, keep going and move on to next”.  I wish I could do that and not emotionally invest too much into each opportunity.\n\n",
      "subreddit": "interviews",
      "score": 26,
      "url": "https://reddit.com/r/interviews/comments/1moiaul/how_do_you_not_emotionally_invest_so_much_into/",
      "comments": [
        {
          "body": "I know what this feels like, I have practically given up, i cant even get myself to open Linkedin anymore, sometimes I think its the reason im so averse to applying, everytime I open Linkedin people are bragging and showing off and it seems Im the only one struggling while everyone is having a shiny career",
          "score": 8
        },
        {
          "body": "Bro if you can’t apply and move on, you’re gonna have a tough life. \n\nApply, keep applying, and if/when you’re contacted for an interview, begin your process of learning about the company and connecting the dots between how you can add value and do the core functions of the role.\n\nYour family hyping you up is great and all but be realistic… that doesn’t help you.",
          "score": 5
        },
        {
          "body": "You’re burning yourself by making each lead “the one”  \nFlip the mindset—every interview is just another rep in your pipeline  \nRun your search like sales: 10 active prospects, constant outreach, always lining up the next call so no single rejection feels fatal  \nWhen you get a lead, keep your app pace the same or higher  \nChannel the hype from family into fueling that pipeline instead of daydreams about one offer  \nDetach by overloading yourself with options—when you’ve got 5 irons in the fire, you won’t have time to romanticize 1\n\n[The NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some ruthless takes on staying mentally sharp and momentum-driven in job hunts worth a peek!",
          "score": 2
        },
        {
          "body": "Man, I feel this so hard. Job searching is basically a rollercoaster designed by sadists. 🎢 The trick isn’t to stop caring, it’s to care strategically. Celebrate landing an interview like “yes, I leveled up,” but mentally frame it as practice and exposure, not a guaranteed win. Keep multiple irons in the fire so no single opportunity can crush you, and build rituals for post-interview “decompression” (walk, treat yourself, rant to a friend) so rejection hits less like a sucker punch. Over time, your brain learns to get hyped without tying your self-worth to the outcome.",
          "score": 2
        },
        {
          "body": "The key is to treat interviews like dates rather than marriage proposals. You're both evaluating each other, and sometimes it's just not a mutual fit regardless of how perfect it seemed on paper. Keep your application pipeline so full that no single opportunity can derail your momentum. When your family gets excited about an interview, thank them but internally remind yourself that this is just one conversation among many you'll be having. The enthusiasm you show in interviews should come from genuine interest in the role, not from desperation or the fantasy of finally being done with job searching. Each rejection is just clearing the path to the right opportunity, but only if you keep moving forward consistently.\n\nI actually work on [assistant for interviews](http://interviews.chat), which helps people navigate those tricky interview moments and perform their best when the stakes feel high. It can be a useful tool for building confidence so you're not putting so much pressure on each individual opportunity.",
          "score": 1
        }
      ]
    },
    {
      "title": "Business Casual Attire",
      "body": "Anyone have recommendations for business causal outfits? I'm used to wearing suit and tie for previous interviews due to the position. I have an interview coming up where my friend says it should be business casual (She works there) and recommended a blazer, but I've never worn one. I have the following questions:\n\n* Is it just a suit jacket? Or are blazer's their own section at a store?\n* What color would be best? Solid vs. pattern? Texture (if I'm using that correctly, like tweed?)\n* Type of undershirt i.e. dress shirt vs. casual button down\n* Tie?\n* Type of pants i.e. nice jeans, chinos, slacks?\n* Shoes? Do they need to be dress or could a nice clean pair of sneakers work (i.e. white leather, etc.)\n* What colors would go together vs. clash?\n\nI'm sorry if these are terrible questions, but this job would be amazing and I want to make a good impression. Thank you!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1mrvje3/business_casual_attire/",
      "comments": [
        {
          "body": "It depends on the type of role that you’re in a room for, but I would assume that you’re going to need to dress up more for an interview than you would see in the office on the employees. For example, business attire at my company is completely different based on what role people are in. The sales guys wear slacks, button-down shirts, dress shoes, and have a suit jacket to throw on to meet customers. That’s their ‘business casual.’ \n\nBut the engineers will come into work in jeans and sneakers and a hoodie. You’ll also see VPs walking down the hall in jeans and sneakers and a button down shirt, if they don’t have Customer meetings that day.\n\nMy point being if you were coming in for an engineer interview, you should definitely not show up in jeans and a hoodie for the interview, even though that might be what you see in the office. You should always go a couple of levels up in the ‘business casual’ attire category. I would recommend you wear the same type of thing you wear at your previous interviews, just a little bit less formal. \n\nSlacks, dress shoes, button-down shirt, maybe a suit jacket, or stick to the slacks and dress shirt and nice shoes. That’s kind of middle of the road without looking like you’re trying too hard. \n\nAs a woman going into an interview, there would be no way I would wear an actual formal business suit, like a skirt and jacket, matching set, unless I was going into a executive level interview. In which case that would be the expected level of attire. Any other position, direct level or below, not the right look. Hopefully that makes sense.",
          "score": 3
        },
        {
          "body": "My personal take on this is that you should be one tick dressier than the people interviewing you. If they're a t-shirt and jeans sort of place, then wear a button down.  If they wear button downs, add a sport coat or blazer. If they wear blazers to interview people, you should be in a matching suit but maybe no tie. \n\nSubtlety to this: if they wear dark suits to work, do not make wear a tuxedo. \n\nSubtlety to that: unless your interview is with Jack Donaghy",
          "score": 3
        },
        {
          "body": "Blazers are their own thing. Check out Derek guy on Twitter for men’s style tips; he often discusses how a lot of guys get suit jacket and blazer confused. You’ve got the right idea wrt tweed but there’s also really lightweight wool and linen for summer, etc",
          "score": 1
        },
        {
          "body": "Wear what you're used to wearing but without a tie.\nI doubt anyone is going to have a problem with that get-up for an interview if the company is business casual.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview Attire Question",
      "body": "Hello everyone, \n\nI have a virtual interview in 4 days for an engineering position at a big military contractor. My current dilemma is that I am deployed and have no professional civilian attire (only got a polo and some slacks). Would it be a bad look to wear my military uniform to the interview. I don’t want to leave a bad impression on the hiring manager. What are my choices here? Should I send an email to the recruiter and hiring manager about my current situation? ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1n4z7cj/interview_attire_question/",
      "comments": [
        {
          "body": "Absolutely send an email to the recruiter and Hiring Manager. I have seen this happen before and the HM was notified ahead of time and no one cared whatsoever. The recruiter may even be able to guide you which will be more appropriate, the Polo shirt or uniform.",
          "score": 2
        },
        {
          "body": "A polo and slacks make the professional attire cut for a surprising majority of virtual interviews/jobs these days fwiw. Do you have dress uniform or just camo, etc?",
          "score": 1
        }
      ]
    },
    {
      "title": "First interview ever!",
      "body": "Hi all! I have my first interview ever tomorrow, and I’m slightly nervous. I just turned 17 (still in hs) so this would be for my first real job, and the interview is at Aeropostale. I’m pretty good at coming up with answers on the spot, but I’m just not sure what questions they’re going to ask me and I like to be prepared before. Is there anything I should say that would boost my chances of me getting hired? I’m also not really sure what to wear, I was told by family to wear business casual like slacks but I don’t own any… I was thinking maybe jeans that weren’t ripped and like a nice shirt? Any and all tips are appreciated!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1lwxkrf/first_interview_ever/",
      "comments": [
        {
          "body": "Nice clothes, no rips, no big logos (especially their direct competitors). Just say you’re excited for the opportunity. It’s a HS job, answers don’t matter. Just explain that you’re a team player and since it’s a clothing store can deal with fast paced environment.",
          "score": 1
        },
        {
          "body": "Yeah don’t worry too much! Unripped jeans and a nice shirt is the go to. Basically they will want to know your temperament/dealing with customers, teamwork, and whether you seem like a chill person to vibe with. You got this!",
          "score": 1
        }
      ]
    },
    {
      "title": "How should I speak to a position I left? I wont lie but I'm willing to be creative.",
      "body": "I've lost opportunities for bungling this question before. I'm an honest person and I don't find it acceptable to lie and can't really bring myself to do it. However I'm willing to be creative and give the most fitting answer that I think isn't going to get me eliminated. I'm honest, not stupid.  \n\nI have an interview coming up and I'm concerned that I will mess up if given the chance. I've said in the screening call that my previous employers values didn't align with my own, which is true, but I worked there for 4 years so if someone wants to pry into that I wouldn't blame them. \n\nIn a previous job interview situation where I'd made it to the 3rd round of interviews, taken a half day off of work to sit through multiple hours of interviews with multiple people, two of them were hung up on my answer when they asked why I'd left my previous position. \n\nI told them it was because the environment was not transparent (which is also true.) They were confused by what I meant when I said there was not enough transparency between upper management and the workers so I explained: \n\n\"Management was always talking about prioritizing transparency to make project planning and development easier but transparency was never achieved. In the 4 years I was there the entire division was restructured 4 times. Priorities were constantly changing and projects were extremely difficult to complete because of these conditions.\" \n\nAt first I was lied to when I was turned down but after some insistence with the HR person he did finally tell me that the two VPs I'd spoken with felt that I'd be signing up for more of the same and I'd be unhappy in their company. I don't think that's true, and they could have asked me about that directly, but they did not.  I have suspicions that it was the most convenient and easily believable reason to turn me down and something else, less than legally acceptable, about my person led them to saying no. But this is the information I have so I will go with it. \n\nWhen I explained to the HR manager why I really left my last position he suggested to avoid the question and say something like \"I really want to get into this space\" - which would work except that the position in question is two roles ago and I left it to take a contract position in the same city, which pays less than what I was making and has no opportunity to grow. which doesn't seem well reasoned without an explanation. \n\nThe real answer is my boss was a gaslighting covert narcissist who couldn't tell their ass from their elbows. They put me in charge of everything difficult about their job, and then had the nerve to tell me I could perform better ( I was consistently ranked a high performer though) all while simultaneously stealing credit for my work. \n\nWhen I did get a \"promotion\" after 3 years it turns out it was only to reach parity with the other members of my team, all of whom I had more experience, responsibility, and tenure than, and they each had a higher title and compensation (significantly higher, \\~20K a year) than me for at least 2 years. I tried to get transferred to another team but my boss wouldn't allow it, and knowing I was dissatisfied this lead them to retaliate. The spent the next months moving goal posts, claiming I was argumentative and didn't do as asked (untrue, I am an insanely hard worker and I take way too much pride in my work to slack, regardless of how I feel about my boss) until it all became way too much for my mental health so I left. \n\nI took the next decent opportunity that came my way and that was that. But the decent opportunity was a contract position with vague references to \"possibility to hire\" which turns out is untrue and actually against the companies internal hiring policy. \n\nSo I'm looking for work again, I'm at the end of an interview process and I'm confident I've crushed it up to this point. The last step is a series of interviews with members of the team I'd be joining, similar to the one that I mentioned at the beginning of my post where I used a lack of transparency as my reasoning and didn't get the job.  \n\nSo if anyone has advice to how you might speak to leaving the role previous to my contract, I would love to hear it. \n\nAnd if you have any suggestions for questions I could ask the members of the team, I'd be grateful for that as well. I'm clearly a little bit too naive and trusting... and I'd very much like to avoid any future toxic workplaces. \n\n ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1lpgqme/how_should_i_speak_to_a_position_i_left_i_wont/",
      "comments": [
        {
          "body": "Just say you left voluntarily to pursue a work environment or culture that better meets your long-term goals.",
          "score": 2
        }
      ]
    },
    {
      "title": "H&amp;M In Person Interview (First interview - Group interview)",
      "body": "Sharing my experience. I'm a mom, previous jobs were housekeeping, caregiving and part time baby sitting. So no retail experience at all just a lot of interacting with people/co workers.\n\nI went in for my in person interview. I applied online and got an email after a few days for the in person interview.\n\nI wore a short sleeve blouse, black slacks and black ballet flats.\n\nI came to the store 10 minutes before my interview time. I asked an employee where I need to go for the interview with the talent coordinator.\n\nI was directed into the break room. Waited a few minutes for other people interviewing. There were 5 of us that came. All of them had retail experience.\n\nWe filled out a form with our names and contact information. Then, we were informed that it will be a group interview.\n\nFrom there, the 2 talent coordinators introduced themselves and their hobbies. We did the same. For me, I said \"Hi everyone, I'm ______, and I'm a mom. My hobby is travelling and I'm mostly with my child. Exploring this and that.\n\nAfter, we were ask how we will approach a customer needing help or just a basic answer of how are you as a person during your previous jobs. Then, we were asked to go on the sales floor and look around. They gave us a few minutes and we were asked what do we think of the store like cashiers, fitting rooms etc everything in the store. I described everything I noticed. We went back to the break room and was given a form where you can pick 2 traits from the list and we were asked to explain one by one.\n\nDuring the start of the interview, I told them I was nervous lol. Then as the interview goes on I felt comfortable. It's like you are just talking to a friend. They even shared their experiences to us as well. One of them started as a sales advisor and is now a manager. After the interview, they told us that they will reach out within the week or next week.\n\nI made this post to share my experience because I did my research too and read about the interview questions but those didn't really help me and I'm still confused and nervous.\n\nOh by the way, I was the only one who wore a semi formal attire. Blouse, slacks and flats. The people that went in with me were wearing casual clothes so it doesn't really matter what you wear just be presentable. Don't wear ripped jeans of course. Just have fun. Not like me. Hope everyone gets hired. :)",
      "subreddit": "interviews",
      "score": 17,
      "url": "https://reddit.com/r/interviews/comments/1jfyvix/hm_in_person_interview_first_interview_group/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    }
  ]
}