{
  "company": "snap",
  "post_count": 62,
  "exported_at": "2026-01-18T17:44:53.305Z",
  "posts": [
    {
      "title": "Should I ignore the red flags or run away fast?",
      "body": " So I’ve been stuck in a dead end retail job for awhile now and recently finally found an opportunity for an in home sales job. My first meeting with the manager went well, however it’s been downhill from there. She outright blew me off for an interview, didn’t bother to cancel or reschedule just didn’t show up at all. I sent her multiple emails before and after and 2 days later she emailed me asking if I’m available tomorrow. I said yes and asked what time and didn’t get a reply until 4 in the morning, for an interview at 9 AM the same day. I interviewed with her and she didn’t even acknowledge blowing me off at all she just acted like it didn’t happen. \n\nFast forward to now. She hired me and I was desperate so I took the job. I just finished my first week and it’s been awful so far. I saw the way she talks to people (terrible) and she already snapped at me for asking a simple question (wanted to know how to track miles for expensing) and said “stop jumping ahead what the f*** is your problem” then apologized for cussing. She sent me on an appointment that nobody showed up for and turns out it was a cancellation and wasn’t even the right appoitment I was supposed to go to. No apology and didn’t answer my calls or texts while I was waiting for over an hour.\n\nShould I stick it out for the experience / resume or should I just look elsewhere ? Lastly I’d like to add I’d have to be moving an hour away for this position and it worries me moving for a job where I have to work for someone like this. Any advice would be greatly appreciated. Maybe I’m just being too sensitive about t",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ivb8fm/should_i_ignore_the_red_flags_or_run_away_fast/",
      "comments": [
        {
          "body": "Leave. It won't get any better.  I just quit my job too due to the same type of manager. It took me 2.5 years, a stomach ulcer, and many nights of mental anguish to finally see the damage that had been done. Don't wait and make the same mistake I did. Leave now while you still have your sanity.",
          "score": 2
        }
      ]
    },
    {
      "title": "Embedded L4 Interview with Snap Inc.",
      "body": "Hi everyone!\n\n I applied for an Embedded Software Engineer L4 with Snap and I had call with recruiter and then the next round is a live coding round on HackerRank. Can anyone share their experiences? Also is it fine If I can code in Python? Any contributions / experiences are welcome. \n\nThanks in Advance",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p0tbmu/embedded_l4_interview_with_snap_inc/",
      "comments": [
        {
          "body": "How'd it go?",
          "score": 1
        }
      ]
    },
    {
      "title": "Snap interview process",
      "body": "I’ve an upcoming interview with snapchat. Does anyone have any experience with Snap? How does the pattern look like for senior onsite interview?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o5wl2y/snap_interview_process/",
      "comments": []
    },
    {
      "title": "Why you left last job… how much do you need to divulge",
      "body": "I left a really good nursing gig in an ICU, worked very hard to get there and accomplished a lot there and was there a while so it’s staying on the resume. I left after I started having escalating anxiety, which ended in a severe SA which put me in a different ICU. I was diagnosed with ptsd after.\n\nI never know what to say when they ask why I left and why I’m switching careers. Back to hospitality. \n\nI had one interview where the manager kept pushing and pushing, “why would you leave such a good job” “why don’t you go back there if it was so great” (I was talking about all of the positives there were.) he kept pushing and it was getting extremely uncomfortable, I had given a generic answer “I just wanted a career change.” Finally I snapped, at this point I am not working for this restaurant… this interview is cruel and I started crying and shouted “because I couldn’t handle seeing people being tortured everyday.” \n\nSo I’m wondering what should I say next time that will suffice without over sharing and also be a legitimate reason for making such an odd career jump. \n\n",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/1kee9jo/why_you_left_last_job_how_much_do_you_need_to/",
      "comments": [
        {
          "body": "Career change is a perfectly fine answer. You just spoke to a dickhead of a hiring manager and that is unavoidable. Keep doing what you were doing.",
          "score": 4
        },
        {
          "body": "Next time someone is pushing like that, ask them back why are they not satisfied with a career change answer,  why do they want to know, is this something personal such as their loved one in nursing career, just keep asking them back. You're not getting that job anyway, so who cares.",
          "score": 2
        }
      ]
    },
    {
      "title": "My bosses snap back whenever I say “I can’t” help",
      "body": "So this isn’t really about leaving a job per se but nothing else fit. I was a stay at home mom for the majority of 15 yrs. I started searching this past September and finally found a cleaning job I thought was a good fit for me. At the interview they described a dream job! FLEXIBLE HOURS. START TIME 9:30. NO NIGHTS/WEEKENDS! FULL TIME HOURS IF NEEDED! UNDER THE TABLE PAY! NEVER GO MORE THAN 20 MINS AWAY! Everything I was looking for. I wanted to start part time and ease into full time. I need the under the table pay until I can work full time. I was made to believe  that this was a booming company with at least 5 employees plus hiring me and one other and that they had the work for me as soon as training finished ( 3 weeks later). Anyway—so I’ve been working for this company almost 5 months. I work 3.5 hrs one week and 7-8 hrs TOPS the other not by choice. There was only 2 other girls. One was new and already quit. I find out “under the table” is Venmo which isn’t under the table. I tell them I need cash and they agree. The first thing they weren’t happy about was when they gave me a house that was 35 mins away. I told them i couldnt go that far without gas money cuz it’s too far for only 3.5 hrs of work. They agreed to give me $10 Then a week later state they’re no longer willing to pay me cash. I said  that wouldn’t work for me and they already agreed. So they kept the cash. 3 weeks ago I asked for more hours. They didn’t have it to give me. I waited 2 weeks and then put up a post here on reddit about cleaning for myself in a local group. Less then 24 hrs later they were offering me more hours. They got one house during the week thats 42 mins away but made it clear they weren’t paying for the gas. I didnt say anything. Then they tried to give me an every other Sunday job cuz the woman who does it doesnt want it anymore. I cant do that. 1st i only get my sons on weekends and 2nd cuz they said no nights/weekends. Then my one boss asked me to fill in last Sunday for HER sunday job so i did to help out. She said it would take 2.5 hrs. I was there for 5 hrs and she only offered me an extra $5 for the extra time. Now shes trying to push this every weekend job on me after i said i couldnt do every other. This job is HER PERSONAL gig. I tell her i cant do it but if shes ever in a serious bind i dont mind helping out. She immediately throws out 4 dates which are all in the next month and a half that she needs me to help her. Then i get a text again today saying they’re not willing to pay me cash anymore cuz going to the bank cuts into their schedule. But shes willing to pay me cash on the weekend jobs cuz i dont think she wants her partner to know she even has that job. She made it clear to only talk to HER about it. I feel like theyre doing this cuz they know i need cash and this is a way to clap back when theyre annoyed with me. Idk what to do. Wawa exists and it costs nothing to pull money out of their ATM where i live and I’m sure they go there once a week at least. My fiance thinks i should quit but i dont wanna do that until I have something to replace this. I’ve been looking for months with no luck.  Sorry this was long. \n\nPs. They kept saying “we’re offering you these weekend jobs cuz you “need” the hours. No they’re trying to take advantage of me by giving me jobs they committed to and no longer want. And they didn’t offer it until after I put that post up. Idk if they saw it but it’s seems pretty “coincidental” less than 24 hrs after I posted it they are offering me more hrs and then they asked if I could work 5 days a week and I said I could do 4 for now and add more in a few weeks and then they told me they don’t even have the hrs to give me now lol ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jr0x6j/my_bosses_snap_back_whenever_i_say_i_cant_help/",
      "comments": [
        {
          "body": "Start your own cleaning business, advertise yourself on FB Market Place, Next Door neighbor, door to door.  People are looking for good house cleaners.   What State are you at?",
          "score": 3
        }
      ]
    },
    {
      "title": "I'm a new hire and I'm disappointed",
      "body": "I recently graduated and I am trying to move up in my field until I am accepted into grad school. With the job I am working currently, I make 2000 a month. It's not exactly bad but it isn't enough to support myself in a society that requires you to make 2.5-3 times the rent. \n\nI attended a job fair this week and got hired on the spot. When I was interviewed, I was given an estimate that people in the position that I applied for would be paid $35 an hour. I agreed to starting the job two weeks later so that I can give my current job a heads up that I will be working less hours to make space for this new job. I took a pay cut with this job just to attend orientation and to be told that they will pay me $21 an hour...\n\nThe job is a step up from what I'm doing now and it will at least get me an apartment. It's hard to find work these days but I can't help but be angry at how stretched that estimate was because tbh if I knew that I would actually be working for just $21 an hour then I honestly would not have taken it. \n\nMaybe I'm overreacting but I am seriously overwhelmed with that disappointment that I needed to vent out ASAP before I snap on someone with my misdirected anger. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1lqs0k0/im_a_new_hire_and_im_disappointed/",
      "comments": [
        {
          "body": "Yeah. That’s bogus.\nSorry that happened to you. ALWAYS get job offers in writing.",
          "score": 5
        },
        {
          "body": "Sounds like they took advantage of you  I'm sorry to hear about this, but take it as a lesson to never accept a job without a written offer.  If you know the amount up front,  you can possibly negotiate for more. My advice is stay put but keep looking for another job at the salary you desire.",
          "score": 2
        },
        {
          "body": "&gt;if I knew that I would actually be working for just $21 an hour then I honestly would not have taken it.\n\nAlways find out the budget of the role, first.\n\nAlways find out the compensation in writing before agreeing to it.",
          "score": 1
        }
      ]
    },
    {
      "title": "Just cancelled my Snap interview because I feel way too underprepared...mistake?",
      "body": "Got a Snap interview for full time but was only given 10 days to prepare RIGHT after finishing another internship. I had just gotten home to relax and I felt no desire to look at anything coding related. I also recently am recovering from a breakup so I really needed to take time to myself and just do things I love (while I love coding, I don't love doing countless hackerrank problems). Will cancelling this interview count against me if I ever apply again? \n\nAlso, as a side note, I'm kind of being turned off by the idea of being a code monkey at a large company and working on relatively insignificant things during the day...and judging by how Snap is doing lately I don't know if I'd really enjoy the work there.",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/6t8hyk/just_cancelled_my_snap_interview_because_i_feel/",
      "comments": [
        {
          "body": "This is when Imposter syndrome wins...you dont even give yourself the chance to interview with a great company because you think you werent good enough. They would not of asked you to interview with them if they didnt like what they see...",
          "score": 11
        },
        {
          "body": "It depends how it was cancelled.",
          "score": 3
        },
        {
          "body": "to be very cynical you may reschedule your snapchat interview at the same time as your other preferred one in the future and use snapchat as a leverage against your preferred employer. ",
          "score": 1
        }
      ]
    },
    {
      "title": "Snap Inc. New Grad interview",
      "body": "Has anyone interviewed with Snap Inc. for a new grad SWE role? I have a 1 hr hangouts interview scheduled in a couple of weeks. Any insights on the interview process will be appreciated. Thanks!",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/6vgr9u/snap_inc_new_grad_interview/",
      "comments": [
        {
          "body": "I did my first one last week and have a second one tomorrow. Standard coderpad interview. My question had one of those tricky solutions you either have seen before or can't reasonably figure out by yourself, which I wasn't a huge fan of. Kind of like that \"find the only integer in this list that occurs once instead of twice\" problem.",
          "score": 4
        },
        {
          "body": "I have. It was a pretty typical interview. Do the usual prep and get a good night's sleep and you'll be fine.",
          "score": 1
        }
      ]
    },
    {
      "title": "Has anyone done an onsite interview with Snap in NYC?",
      "body": "I have an onsite interview with Snap next week. Recruiter has told me the interview process is a coding project followed by a code review and some 1-on-1s.\n\nI have no idea what this project could be so I've been practicing by making board/card games and simple CRUD apps. Feel like I'm spreading myself thin here studying for anything.\n\nAnyone care to share their interview prompt? Glassdoor doesn't have much on Snap in NYC.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/6jm2e0/has_anyone_done_an_onsite_interview_with_snap_in/",
      "comments": [
        {
          "body": "That's strange. My interview process was not a \"project\": it was a standard \"multiple interviews in a day\" setup. Like one interviewer coming in after the other. ",
          "score": 3
        }
      ]
    },
    {
      "title": "Apple ICT4 Offer Eval, Is this a lowball?",
      "body": "Senior SWE with around 10 years of experience, most recently I was at Meta for 6.5 years as an L5 (promoted from L4 and worked as L5 for about 4.5 years). I quit late last year and have been interviewing, just received an offer for ICT4 at Apple in Cupertino in the Siri Org/Team (Siri Speech)\n\nThey presented me with a total TC of roughly 300K. It looks like around 75K in RSU's a year, with 220K in salary, and the 10% performance bonus.\n\nWhen I look at this package and check levels, it undercuts the average TC in the bay area by almost 80K (looks like bay area TC apple average is 382K). I have also been presented with an offer from Snap for 380K a year with 15K sign on bonus (200K TC, 180K in RSU's yearly). My TC at Meta in 2024 was around 460K. Not only is this offer a huge drop from their average, but it pales in comparison to my offer from Snap and and my TC at Meta. I plan to counter Apple with my Snap numbers and Meta TC.\n\nFeels like they aren't respecting my experience or even market, they set the bar so low I am not optimistic they will even be able to meaningfully come up to the bay area average. Curious folks thoughts here with any Apple salary negotiating experience or offer experience. Is this a lowball ICT4 offer? Is this a standard Apple negotiating tactic or are they just giving me a nice smack to the face? What chance do I have to get meaningful TC once I introduce Snap offer and Meta numbers?\n\n(please note this is a post for a friend - who didn’t have the karma needed to make their own post on this sub)",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1plsyo4/apple_ict4_offer_eval_is_this_a_lowball/",
      "comments": [
        {
          "body": "That does seem pretty low tbh with 6 1/2 years of meta behind you specifically imo. The base salary seems not too far off but RSUs seem low.",
          "score": 25
        },
        {
          "body": "Might be tough using your Meta comp as a counter since you no longer work there but good luck",
          "score": 24
        },
        {
          "body": "My offer was roughly the same. I have less YoE though and negotiated a sign-on. The average on Levels is likely skewed because the reporters are including refreshers. At ICT4 the average refresher is like 110k over 4 yrs -- and they are given every year. So on year 3 you're at like \\~380",
          "score": 15
        },
        {
          "body": "[deleted]",
          "score": 9
        },
        {
          "body": "Sounds low.\n\nI am amazed that you gave up $460k at Meta…",
          "score": 6
        },
        {
          "body": "Meta doesn't use L levels so I'm a bit skeptical about the these claims, it would be E4, E5 etc.\n\n$300k TC does feel on low end for Bay Area senior level however",
          "score": 3
        }
      ]
    },
    {
      "title": "Not motivated to find a job anymore. Help!",
      "body": "I've been unemployed for over a year and have roughly 7 years of experience as a SWE.\n\nI'm in no risk of losing my home or starving to death, but even though my financial obligations are light, it's still not a very fulfilling way to live without a regular source of income. Many people say they got into this career for the money. Well, the money isn't working as an incentive to get me to practice interviewing more. What would get me to snap out of it and get motivated again?\n\nAnd for the future, I also don't want my work rhythm at my future job to get screwed up because unemployment got me into a habit of sleeping and waking up very late.",
      "subreddit": "cscareerquestions",
      "score": 131,
      "url": "https://reddit.com/r/cscareerquestions/comments/13a7kqz/not_motivated_to_find_a_job_anymore_help/",
      "comments": [
        {
          "body": "I think the first step is to figure out why you’re so unmotivated… Are you just bored with tech? Do you have enough money saved that you could retire, so there’s no urgency? Are you perhaps depressed and aren’t really excited/motivated about anything?\n\nGiven your lack of financial strain, it sounds like you’re in a good spot to just spend time hashing out what you want out of this life. It doesn’t have to be a tech career. Figure out what makes life worth living (ie. what actually motivates you) and pursue it. \n\nThis sounds like a problem that only you (and perhaps with the help of a therapist) can solve.",
          "score": 91
        },
        {
          "body": "why not just be motivated to go to a bunch of free tech conferences, eat a bunch of free food, and make a bunch of cool friends who may give you a job?\n\nCommunity is an effective motivator",
          "score": 54
        },
        {
          "body": "Job hunting sucks and so does the fucking economy.",
          "score": 45
        },
        {
          "body": "Just take a contract job, the interview process is much easier.",
          "score": 12
        },
        {
          "body": "👋 I was laid off mid April and just received a job offer today. 3 YOE, took a small pay cut but I was WAY overpaid before (probably contributed to the financial situation of the company 😂). During my laid off time I considered not waking up the normal time but I had things to do. I cleaned out my closet, took my winter clothes and packed them, took out my summer clothes and washed and folded them, did spring cleaning in my room (jeez was it dusty) and each day when I thought “Okay what else do I have to do…” something always came. I rekindled some relationships I hadn’t kept up with, I started learning a new coding language, I was on the job search every day, I had to set up COBRA and file for unemployment, etc. I was able to keep somewhat regular schedule because I had shit to do. \n\nI’m sure after months of unemployment I might have run out but I think it’s more up to you and what you’re interested in. Get yourself a reason to get up early and schedule your day like it’s work, with a lunch hour and everything. It doesn’t have to be coding related, handy work around the house you’ve put off,  new hobby or an old one, old friends, new community, hell a friend of mine built a greenhouse with self watering plants a few years ago. There are so many things to do during the day you should try to fix your sleep by doing them!",
          "score": 10
        },
        {
          "body": "With 7OE you could also look into getting contracts, not just a full time job",
          "score": 21
        },
        {
          "body": "[deleted]",
          "score": 7
        }
      ]
    },
    {
      "title": "Interviewed for job at a top firm. Everything went amazing until I resisted giving my current compensation. Because of that, they may pass on me. Did I screw up?",
      "body": "**EDIT: Officially got the verdict. They're passing on me due to my resistance in divulging my salary. Their loss. On to the next one.**\n\nI interviewed at a top firm that is very selective in their hiring process and is known around the industry for being a challenging, fruitful place to work with some of the best of the best. My interview went amazingly well until HR asked me what my current comp was. Every negotiation article I have ever read, has stressed that you should not throw out a number first and let the other party go first. I stuck to that. She was a bit annoyed.\n\n---\n\n\nThe interview aside from that went well enough that they decided to bring in the senior manager even though he wasn't scheduled. He was one of the hardest interviews I have ever given, and it went really well. I was looking like a really good fit for the job and there was mutual respect between us.\n\nHe asked me \"So what is your current compensation?\"\n\nI said \"I'd rather see if the job is a good fit first, and discuss numbers later.\"\n\nHe said, \"We cannot move forward until we have your numbers.\"\n\nI said, \"I don't mean to be difficult, but I'd rather not give it.\"\n\nAt this point, he got really pissed off. He snapped \"You know what? You are being really difficult.\" and popped up out of his seat.\n\nI didn't say anything.\n\nHe said \"You're making a huge mistake.\" as he started walking out of the room.\n\nAt this point I started to feel a bit bullied and forced into giving my number. We had a bit more of a back and forth where he kept pushing and I kept resisting. Ultimately, I just ended up giving him the number - I had no idea why he was having such a huge reaction over this.\n\n\"I'll chalk this up to inexperience and won't hold it against you.\" he said.\n\nThis was all last week. This week I get a call from my recruiter and they said that the firm thought I was a really good fit, but my resistance with giving my number really annoyed them and put them on the fence...and now they are unsure whether to move forward with me.\n\n---\n\nI thought disclosure of my salary was my right? I didn't know that I would be pissing people off and potentially losing job offers by doing this. Did I mess up? My intention was to look out for myself in negotiating, it wasn't to burn bridges.\n",
      "subreddit": "cscareerquestions",
      "score": 88,
      "url": "https://reddit.com/r/cscareerquestions/comments/2wdv4n/interviewed_for_job_at_a_top_firm_everything_went/",
      "comments": [
        {
          "body": "That kind of bullying during an interview, about ANY subject,  is completely unacceptable, and speaks to a work environment that won't be a good fit for any intelligent candidate.\n\nI'm sorry you had that experience.\n\nAnd I think they owe you an apology, rather than the other way around.\n\nThe whole thing makes me very angry to read about.  I don't like bullies to begin with, much less bullies in a professional setting asking inappropriate questions.\n\nWhen you talk about this being a great company, are you saying that it's one of what's usually regarded as the major American tech companies?\n\nAmazon, Facebook, Google, Microsoft, etc.?\n\n*Edit - Seriously, bullying a kid who's barely stepped into the field, about one of the most sensitive professional topics, during a goddamned interview?  It's appalling.  It's goddamned appalling.*",
          "score": 221
        },
        {
          "body": "Put all the ideas of salary aside for a moment and focus on this: any place that has a guy who snaps on an interviewee is not a place you'd want to work. Don't beat yourself up, you dodged a bullet. This isn't the 1980's anymore, that sort of shit doesn't fly. ",
          "score": 104
        },
        {
          "body": "That would be a huge red flag to me in any professional setting. The dance over the numbers is part of the game in interviewing. They should know that, they should have experience with it. Calling you difficult and bullying is just handling it in a completely unprofessional manner.",
          "score": 42
        },
        {
          "body": "It is your right. I think releasing this information only serves their interests and not yours. ",
          "score": 27
        },
        {
          "body": "Wtf? This is absolutely unheard of. Extremely unprofessional, and like others said, a complete red flag. This gives off the impression that they're cheap as fuck, and care more about paying developers as little as possible than having good engineering.\n\nIf for whatever reason you still want to work for a company with shitty people like that, just give them whatever number you want. Don't be afraid to make up a salary higher than what you're making. ",
          "score": 16
        },
        {
          "body": "If that was their corporate representative's reaction to holding off a salary discussion do you think the maturity level of the supporting management is any better?\n\nWhat do you think your work day will look like?  Your working weekends?  Do you anticipate bonuses and raises going the same way?",
          "score": 15
        },
        {
          "body": "This is a throwaway right OP? I think you should name the company. If you don't post here please at least post it on Glassdoor it could really help other people.",
          "score": 25
        }
      ]
    },
    {
      "title": "What are some good de-escalation strategies to use when co-workers or higher ups are agitated during meetings?",
      "body": "My team has a deadline approaching on November 1st, so naturally it's a hectic time for us, especially management. I'm dreading stand ups with my team because the agitation of my CTO is palpable. These days he has a short fuse when team members ask what I believe to be reasonable clarifying questions. I'm very sensitive to shifts in mood, so to help de-escalate tensions I'd respond to questions I knew the answer to with a calm demeanor.  I have to also block out 30 minutes before my stand ups to meditate and relax beforehand (working with people who are short tempered is the reason why I started meditating after college). \n\nI understand I'm still a new engineer approaching my second month and don't have nearly as much responsibilities as my CTO does. I also feel his agitation is a result of his frustration with tasks being blocked because of his work. It caught me off guard after hearing how kind and sensitive the CTO was from 3 of the engineers I've interviewed with--heck the senior said that he's normally very level headed even under stress, and that his delegation skills are impeccable. \n\nOne day, one of the freelancers got fed up, and exclaimed he \"had enough of \\[the CTO\\] snapping at us like this,\" asserting if he's frustrated, \"delegate it to someone who can do it, but stand ups are  uncomfortable now, and it's unproductive for everyone. This is the last time I will be spoken to in this way.\"\n\nSomething needed to be said about the delegation and his temper for sure and I stand by what the freelancer did. In retrospect, it probably could've been approached differently on my end.  I will certainly bring this up in a retro which is the appropriate time for feedback.\n\nThanks to meditation and my current self care routine, I can asses risks and act accordingly in a calm, and swift manor. I don't think it's fair for me to assume that someone with more responsibilities than me has the time to do this. So far I've tried proposing solutions to problems that work up my team members, but that's becoming increasingly difficult.\n\nHave you had similar meeting experiences, and if so, how have you de-escalated them?\n\nEDIT: Reworded my third paragraph after a misunderstanding this in the comments (which was totally my fault). I just want to clarify that I don't think the freelancer was in the wrong here. What ended up happening afterwards was the stand up was cut short right before a mid level dev was about to chime in, and the behavior continued to happen. That's why I said I thought there could've been a different approach where more people could've spoken up about this, but the freelancer was in the right to call it out. It was just so unexpected after asking the engineers I've interviewed about leadership and the company culture. I started looking for new jobs on Wednesday just in case shit continues to hit the fan.\n\nAlso, with regard to meditation, the reason it's my go-to method is because I also dealt with anxiety and depression that stemmed from my last work experience where the culture was extremely toxic. I won't go into detail about it, but that's a coping mechanism I have to follow so I don't have meltdowns at work.\n\nEDIT 2: Added context about company culture expectations before joining.\n\nUpdate: Thanks everyone for the advice so far. I'm meeting with him Monday to discuss this. Mid level engineer reached out to me as well and scheduled a meeting with the CTO as well to discuss this. So done with this crap.\n\nUpdate 2: The CTO apologized. After meeting with him he agreed the way he’s been acting was uncalled for. We strategized ways to improve standup, which have been working great so far. Thank you all again for your advice and support!",
      "subreddit": "cscareerquestions",
      "score": 142,
      "url": "https://reddit.com/r/cscareerquestions/comments/q9ljy4/what_are_some_good_deescalation_strategies_to_use/",
      "comments": [
        {
          "body": "If you find yourself in a difficult place in your life, we urge you to reach out to friends, family, and mental health professionals. Please check out the resources over at /r/depression, /r/anxiety, and /r/suicidewatch. Feel free to [contact the /r/CSCareerQuestions mods](https://www.reddit.com/message/compose?to=%2Fr%2Fcscareerquestions&amp;subject=&amp;message=) for more information or help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "It sucks that you're in a position to feel like you need to diffuse your CTO's emotional reactions as a junior developer. This is a profound failure of leadership, and you shouldn't have to worry about this. But this is the reality you're in, and I understand your desire to keep things running smoothly.\n\nYour CTO is doing serious damage. Something needs to be done ASAP, and the retro might be too late to avoid losing people and momentum. I don't have a good sense of your org structure, but if you aren't reporting directly to the CTO, then I suggest talking to your own manager about your concerns and the unnecessary damage to morale you're seeing. ASAP. \n\nBut to answer the question you actually asked, I think it's important to realize that offering logical solutions to emotional reactions isn't super effective. It can serve as a way to re-calibrate, distract, or get back on task, but it doesn't resolve anything. People generally need to feel heard and understood. Acknowledging the challenges people are facing is incredibly powerful at times. But this is mostly going to be helpful for peers. You really shouldn't have to be coddle your CTO so he doesn't go off the handle. \n\nI think your CTO is the one who needs advice. I think you're actually handling things as best you possibly can, with the exception that you're putting up with more than you should.",
          "score": 96
        },
        {
          "body": "&gt; I have to also block out 30 minutes before my stand ups to meditate and relax beforehand\n\nCan you quit and find a new job? This all sounds miserable. Life is too short to be unhappy dealing with people like this.",
          "score": 49
        },
        {
          "body": "Why is the CTO attending stand ups? Stand ups  are for the immediate team to unblock each other , not an opportunity for upper management to micromanage employees. Your immediate manager should tell him/her to stop attending and trust his employees.",
          "score": 49
        },
        {
          "body": "I don’t know if I could have pulled this out as a junior engineer. But one of the famous techniques for diffusing a situation when you are at odds with someone is “feel, felt, found”. \n\n“I understand how you feel about $x (and repeat their objections) . I have felt that way too in the past. I have found $y in my experience”\n\nOr \n\n“Let’s take a step back for a minute.  Let’s think about our end goals (or what’s best for the project/customer) and work backwards from there. I’m sure we all want to accomplish the same thing.”  \n\nOf course that’s a lot easier once you have some sort of respect in the organization.\n\nIf tasks are being blocked by “his work” that’s the fundamental problem. He doesn’t know how to delegate or he doesn’t trust his team to be able to do the architectural/technical work. I’ve run into the same  problem before with my former CTO when he was trying to build the department. I volunteered to take on the technical tasks/research and promised I would get back to him with a proposal. Again that’s a lot easier to do with years of experience. He started leaning on me for “special projects” where he didn’t want to go through “the process” with project managers, sales, sprints, operations, dealing with trying to tease our requirements etc.",
          "score": 11
        },
        {
          "body": "&gt; I can asses risks and act accordingly in a calm, and swift manor. I don't think it's fair for me to assume that someone with more responsibilities than me has the time to do this.\n\nDisagree. Upper management should absolutely be able to assess risks and respond in a calm swift manner. That's a big part of their job.  I think your plan of looking for new jobs is a good one.",
          "score": 9
        },
        {
          "body": "Honestly, I don't blame your freelancer for speaking up like that. Props for also doing what you can to de-escalate.\n\nI'm a very passive aggressive person so I can make pointed remarks without needing to raise my voice or snap at people.\n\nRetro would be a good start. Also a 1:1 too if you have those.\n\nUpdate: I saw your edit and I had to give you a hug. Never let anyone make you feel less than and I'm sorry for pressuring you to engage in a conflict in this thread. I just wanted you to know that your feelings and coping mechanisms are valid. People in this industry can have severely low emotional intelligence, and therefore those of us who are more sensitive are gaslight into thinking we're in the wrong for feeling that way, and that we have to capitulate to that cold crap.",
          "score": 8
        }
      ]
    },
    {
      "title": "Anyone can to share their interview experience with Square and Snap?",
      "body": "Basically the title. Trying to prioritize what I should study. Almost done with CTCI and some LeetCode here and there.",
      "subreddit": "cscareerquestions",
      "score": 11,
      "url": "https://reddit.com/r/cscareerquestions/comments/6gc6n5/anyone_can_to_share_their_interview_experience/",
      "comments": [
        {
          "body": "For the internship interviews I did with them, their questions were on the medium-hard level of the leetcode spectrum. I think I recall square requiring compilable, running code via a HackerRank code editor  for the phone interviews.",
          "score": 4
        },
        {
          "body": "I just finished interviewing with Square a few weeks ago, so hopefully I can help a bit. Two technical phone interviews followed by a day of onsites. Mostly easy to medium problems.\n\nAll of my interviews consisted of an easy problem to start with, followed by a harder problem building upon the first one (e.g build something out in the first part, and expand upon it in the followup). Definitely less algorithms-based, but know your data structures and how to use them effectively. My harder interviews focused heavily on recursion and its relatives, like DP and backtracking.",
          "score": 2
        },
        {
          "body": "Snap asks a lot of Leetcode hards/medium-hards in general, but almost all of my friends who have interviewed there (me included) have received at least 1 backtracking question (a form of Word Break is the Hackerrank, then Sudoku Solver, Palindrome Partitioning, Combination Sum, etc. for phone interviews)\n\nPersonally I got Palindrome Partitioning and Best Meeting Point for my questions",
          "score": 2
        }
      ]
    },
    {
      "title": "Overachievers &amp; Under Performers ( I need to vent)",
      "body": "**Backstory**: I taught myself how to program with no programming background, studying over 12 hours a day at home and was lucky enough to land a job at a small **x company.** I was one of the first developers to start working there, and through enough time I was able to do the jobs of everyone at my work. This did not come without a cost though, I would program after work as well on my own time because to be frank I felt inadequate due to not having a degree. And when I say I would program after work I mean it, I mean I started building apps on my own with Haskell just to expand my thinking horizon and to be honest it carried over to work (Haskell is totally not related to my job but I think it can echo some of my determination to programming). Programming for a long time is a hobby and a job. With all of this being said, I don't want you to think I'm writing **unreadable super intelligent code,** I very much make sure it is readable and I am a very helpful person when asked for help, I think people can attest to that. I have become the workaholic due to the fact of feeling inadequate in this industry, when very well I know I am fully capable. It's a hard mental hurdle to get over.\n\n**Fast forward:** It's been over a year, and I am actually quite confident in my work, my learning has plateau'd at this company, and I can do much more than others in the 8 hours I work. Because of that I have become bitter because I grow suspicious that my co-workers are slacking off and they have similar pay(I've asked). I should mention we all **work from home,** recently a co-worker who I deem to be under performing fell \"ill\" for over a month and his story hasn't been completed. My supervisor then assigned me my under performing co-workers story. Little to my surprise, there has been no progress and I was able to finish his work in a matter of an afternoon. People at work also started picking up **easier stories,** while i'm stuck working on large ones. Once they are done their easy story, their day is essentially over. They also do 1 large commit at the end of week so there's no real way of tracking progress. My supervisor is a super nice guy and also works hard, he knows something is up with my co-workers but doesn't punish them.\n\nOne day I absolutely snapped, at a guy who took an entire week to change the \"font' of a page, and had the nerve to demo that font change at the weekly meeting. And more recently I snapped at that co-worker who's story I had to do because he took over a month and I completed it in a day (it was a simple CRUD controller), one that has been made dozens of times at work. I have seen things like this happen dozens and dozens of time again before I said anything, and no I am not exaggerating, this stuff goes unchecked.\n\nNeedless to say this industry has taken a toll on me, and its my own fault, I overworked myself in a company culture where nobody works hard. Part of why I feel this way is because I worked so hard to get my first job in the industry (over 3 months of interviewing and constant programming and reading). I see people coming in and just squandering their opportunity to learn the skills. To be honest, it hurts me to see that.\n\n**How I feel now**: I took a long thinking of my value as a person and in the industry and it made me quite depressed, I have truly become an asshole to work with, and to be honest I wouldn't want to work with myself. Also after some research it turns out I'm also grossly underpaid for the amount of work I supply, a 50% will bring me up to market. I spoke to my father about this issue.   What he told me really changed my view:\n\n1. I'm an idiot for working so hard and your **lazy** co-workers are not stupid, they are just doing what they should be doing. \n2. I'm not a manger and I tried to manage people and I'm wrong for that.\n3. Whether your co-workers are doing anything at all, is not your business. If they are slacking and you have to pick up their work. Don't try to do it quickly, it'll make them look bad and make you look like a smart ass.\n4. When you leave, doesn't matter how hard you worked. The company will still only see you as an employee. Your boss doesn't care how hard you work, they just expect it from you now.\n5. Sounds like your team doesn't respect talent and doesn't have what it takes to keep it\n6. take care of yourself first, and don't die for your company. If they don't punish laziness and don't reward hard work, why work so hard?\n7. they will take advantage of you if they can, no matter how nice they are on the surface.\n\nanother solid read: [http://startingdotneprogramming.blogspot.com/2013/04/i-knew-programmer-that-went-completely.html](http://startingdotneprogramming.blogspot.com/2013/04/i-knew-programmer-that-went-completely.html)\n\nthank you for reading, I just wanted to get this out and I am constantly working on personal life. I'm sure others have stories of feeling like this or having to deal with a co-worker like this. If you do please share.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*TL;DR: Take care of yourself, it's just a job at the end of the day.*",
      "subreddit": "cscareerquestions",
      "score": 464,
      "url": "https://reddit.com/r/cscareerquestions/comments/9k99ar/overachievers_under_performers_i_need_to_vent/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 247
        },
        {
          "body": "You need to jump early and often, if you're a better-than-average developer, which you sound like you are. Do not listen to people who claim numerous short stints will harm you. I was told that, yet I now make just about double what my friend makes, and that friend started at the same time as me at my first company.",
          "score": 189
        },
        {
          "body": "1, 4, and 6 are so important. I'm relatively new to the industry (been working for just over a year now) and I'm just now realizing importance of work-life balance. Working too hard will only result in burnout and resentment. Don't devote your life and soul to a company - the returns just aren't worth the investment. ",
          "score": 24
        },
        {
          "body": "Sounds to me like you need to move on.\n\nThere's 2 kinds of developers. Those that are wildly self motivated like yourself and spend a lot of free time honing their skills, then there's those that clock in, do some work, clock out and keep their work away from the rest of their life when possible.\n\nMost companies don't reward hard work if there's no promotions to be had. Even then, you're often better off going somewhere else if you want to keep climbing. You don't owe the company anything and vice versa, and to bust your ass for a company that likely doesn't *really* give a fuck about you is just dumb. This is not a criticism of you, but rather how companies see employees as disposable more often than not.\n\nAt the end of the day, i do what I'm told to do and nothing more. If there's nothing in it for me to work harder, then I won't. I don't blame your coworkers, most likely aren't passionate about programming the same way you are and are just looking to make a decent living to fund activities they're actually passionate about, and getting angry at them for working less and getting the same pay as you is dumb. I don't give a fuck about programming on my free time. I'm in this industry to make a fair living and nothing more. ",
          "score": 66
        },
        {
          "body": "This is a great piece of introspection OP! I can relate to the sentiment.\n\n&gt;I'm not a manger and I tried to manage people and I'm wrong for that.\n\nI'll add that **even** if you were a manager or in a position of authority, it would still **not** be okay to snap at people for being slow/lazy/bad at the job unless harm is being done to others: At the end of the day, most people are trying their best to get by their days. And unfortunately, sometimes, doing your personal best is not enough. It's not a great feeling, I'm sure we've all been there at some point in life, but image how much worse you'd feel if someone who has power over you was yelling at you on top of that.\n\nThey are a lot of ways to convey firm expectations/disappointments while still remaining professional and cordial.",
          "score": 40
        }
      ]
    },
    {
      "title": "Data Science offer with 50% salary increase, here is how I did it",
      "body": "# First move\n\nAfter graduating in Maths, I wanted to do Data Science. I eventually joined a company doing credit risk analytics. However,\n\n* They used SAS instead of more versatile programming languages, like R and Python\n* I soon discovered analytical work is performed for the sake of compliance and advancing the political interests of clients.\n\nPerhaps this has to do with the credit risk industry being highly regulated and traditional. Moreover, the office culture wasn't the most pleasant. I felt increasingly demotivated in my work. (I wrote more details on this and on how I dealt with it in [another post](https://www.reddit.com/r/getdisciplined/comments/9tskxd/method_dealt_with_bad_job_experience_i_did_it_so/).) I also felt that the longer I stayed in this job, the harder it would be for me to leave.\n\n# The next step\n\nI received an offer to work at an AI startup through a personal connection. *Things will get better!* I thought (in hindsight, not really...). Few months in, I sensed that the company had no clear direction, and I was pushed to non-tecnical/management roles, which was not originally covered under my job description. I knew working in a startup often meant going beyond assigned roles to keep the company alive, but I also firmly knew what I wanted - to learn AI and implement AI models, which was one of the main reasons why I joined the start up in the first place. That's when I came up with an **11-hour work day**:\n\n* 8am - 11am self study\n* 11am - 7pm work\n* Repeat the next day until the weekend.\n\nI will be honest- there were days, even weeks when I lacked the energy and motivation to follow the schedule. But the thought of not learning what I wanted to learn pushed me into action.\n\nIf there is only one app that I could have on my computer, it would be this app called [Be Focused](https://itunes.apple.com/us/app/be-focused-focus-timer/id973130201?mt=8) (the free version is sufficient). Everytime before I start work, I set a 50-minute timer and dedicated **all my energy** to getting serious work done. Whenever I find attention wavering during this time period, I would look at the timer and tell myself \"xx minutes left, it would pass in a blink of an eye!\" and then return to work. Sure enough, the timer ends before I even realise it. Then I would take a 10-minute break and repeat the process.\n\n# Applying for jobs\n\nThe startup didn't work out in the end, and I found myself having to apply for job earlier than I expected. It was tough - the tech landscape in my country (not the US) is not well developed, and most companies are only willing to hire experienced Data Scientists (4-6 years). To cope with my lack of on-the-job experience, I highlighted my initiatives to self-learn, personal projects and online courses I have completed in my resume.\n\nI soon came to realise, reality doesn't follow a fairy tale-like storyline. **Just because I worked hard doesn't mean the universe will give me what I think I deserved.** A company I liked and applied to gave me a take-home assigment with a one-week deadline. I put in \\~15 hours of work to complete it and felt I was my best work. However, the company felt it was insufficient and implied I should have put in more effort in the assignement. Another company invited me for an onsite, where the interviewer rudely snapped at me for not being able to answer a technical question.\n\nBut then I got lucky - a recruiter from an analytics firm contacted me on LinkedIn and after few rounds of interviews, **they offered me a job as a Data Scientist with a 50% pay increase.**\n\n# My learning path\n\nI curated my learning path based on my background. I did a maths degree and have never been formally exposed to Python. Therefore, my learning path is mainly geared towards addressing my weakness in programming.\n\nIf you are like me - want to become a Data Scientist but lack the programming skills, I hope I can help you with the following tips:\n\n* Master command line first, and then python! I followed [Learn Python the Hard Way](https://learnpythonthehardway.org/), which sadly isn't free anymore. Alternatively, you can try [Learn Enough Command Line to Be Dangerous](https://www.learnenough.com/command-line-tutorial).\n* To learn Python: check out [this twitter thread](https://twitter.com/math_rachel/status/1058089708155166720), there are some awesome materials there!\n* Understanding object-oriented programming is very important, I neglected this and was *extremely lost* when trying to use tensorflow, keras or any advanced Machine Learning library. My favourite resouces on this are: [here](https://dziganto.github.io/classes/data%20science/linear%20regression/machine%20learning/object-oriented%20programming/python/Understanding-Object-Oriented-Programming-Through-Machine-Learning/), and [here](https://topoftheeastrock.wordpress.com/2016/03/23/machine-learning-object-oriented-programming/). This [ebook](https://python.swaroopch.com/oop.html) also rocks in giving an understanding on OOP.\n* Mastery in pandas and scikit-learn got me hired. For pandas, I replicated the highest-rated kaggle kernels that explore data using pandas. After I felt I had a decent grasp of the library, I started downloading interesting datasets and explored them on my own using pandas. For scikit-learn, I recommend *Introduction to Machine Learning with Python* ([book](https://www.amazon.com/Introduction-Machine-Learning-Python-Scientists-ebook/dp/B01M0LNE8C), [github repo](https://github.com/amueller/introduction_to_ml_with_python)).\n* Check out this 6-week computational bootcamp (part of the MS in Data Science program at the University of San Francisco) specifically designed as an introduction to data science programming for those who are not yet skilled programmers: [lesson syllabus](https://github.com/parrt/msds501)\n\n# I would like to hear your opinion on...\n\nI feel it is unfair for companies to give week-long assignments to candidates as part of their screening process. In my opinion, it's like doing \"free work\" for them, without the guarantee of being hired or paid. That's why I was reluctant to spend beyond 15 hours to complete the take-home assignment. I might have a one-sided view on this matter, so do let me know your thoughts on this.\n\n&amp;#x200B;\n\n**Also**, if you are from a non-programming background and trying to become a Data Scientist, how did you make up for the lack of programming knowledge or experience?",
      "subreddit": "cscareerquestions",
      "score": 352,
      "url": "https://reddit.com/r/cscareerquestions/comments/9tt0sj/data_science_offer_with_50_salary_increase_here/",
      "comments": [
        {
          "body": "&gt; I feel it is unfair for companies to give week-long assignments to candidates as part of their screening process. In my opinion, it's like doing \"free work\" for them, without the guarantee of being hired or paid. That's why I was reluctant to spend beyond 15 hours to complete the take-home assignment. I might have a one-sided view on this matter, so do let me know your thoughts on this.\n\nI totally entirely absolutely agree with this. To my recollection, the person who first suggested giving take-home assignments was Jeff Atwood in the Coding Horror blog, but he said *it should be a paid assignment that takes a day or two of work*.",
          "score": 43
        },
        {
          "body": "How long did you keep up your 11 hour work days for?",
          "score": 14
        },
        {
          "body": "This is exactly the reason why I went from Computer Science to a specialization in Statistics. After getting burned out from programming for two years I did a master ( while still working ) in statistical science. In my final year used my savings and quit my job to focus full time, got a prestigious internship and then went on to do a PhD in Data Analytics / Machine Learning. Never looked back since.\n\nEven with a master or PhD in CS you are still regarded as a dumb programmer unless you make upper management. While a management position is very laid back and well paid, it doesn't appeal to everyone and if you lack the networking skills not always available. Data Science on the other hand gives you so much more freedom, better pay and more respect for being a real specialist. Whether it's consulting or the actual job, people listen to you and respect you. It's a great field to get in to and there is more varied work available, I now work closely with medical experts on automated diagnostics and it's much more satisfactionary than the average programming gig.",
          "score": 69
        },
        {
          "body": "[deleted]",
          "score": 22
        },
        {
          "body": "[deleted]",
          "score": 21
        },
        {
          "body": "As a current CS student I have to ask, why is command line such a big deal? It was sort of taught in our introductory python course but never mandatory, what makes it such a powerful tool and why should I commit my break to becoming proficient with it?",
          "score": 14
        },
        {
          "body": "I'm so glad you went a step further and described your Python learning path. I just started learning Python, completely on my own from books and tutorials and I was starting to feel a bit flaky and losing motivation because I wasn't learning fast enough and I considered learning from books the fastest way to learn yet my classmates learned much more from videos and whatnot. I'm so glad to know that it will be quite valuable for me when I graduate. Thank you!",
          "score": 5
        }
      ]
    },
    {
      "title": "Why is the level of engineering at Snapchat so lauded?",
      "body": "There seem to be more posts about working at Snapchat recently. I know image recognition is an advanced topic in programming, and it really is disguised by the goofiness of putting dog noses and anime eyes on people, but beyond that isn't that problem mostly solved for them? What other big things are they working on that need a lot of help?",
      "subreddit": "cscareerquestions",
      "score": 186,
      "url": "https://reddit.com/r/cscareerquestions/comments/5ghvne/why_is_the_level_of_engineering_at_snapchat_so/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 197
        },
        {
          "body": "infrastructure is an overlooked challenge for basically any hugely popular thing",
          "score": 23
        },
        {
          "body": "Wish their engineers could fix the terrible Android app. ",
          "score": 32
        },
        {
          "body": "Snapchat is lauded more for its high compensation and viral product than for its engineering prowess, which is still great but not necessarily better than other top tech companies.",
          "score": 26
        },
        {
          "body": "Note that I'll be joining them full time after graduation so take this as you will. \n\nSnap in it's current form is able to give their developers huge amounts of ownership. Additionally they do solve some very difficult and unsolved engineering problems, which is especially cool when that added benefit of impact is added. Furthermore, snap is an incredibly plesent place to work. The office is on one of the coolest beaches in LA, and when I was interviewing everyone was enjoyable in a way you don't always experience at every company you interview at.\n\nSome of these technical problems include load balancing all of the image upload traffic they get. Doing deep learning for image classification local on device for memories so those who want to keep their images private from snaps servers can benefit from that classifier. New forms of advertising and experimentation in that space, and various technical challenges relating to augmented reality (still all powered locally on your device, which is where the key technical challenges come from).\n\nAdditionally, go on LinkedIn and see who many of the senior executives that they added to the company roster over the past 6 months. At least from what I saw I was very impressed. \n\nLastly, their compensation is very competitive. ",
          "score": 51
        },
        {
          "body": "Companies get mentioned a lot when they hire a lot (or market their hiring a lot); that's about all you can gather from it.",
          "score": 8
        },
        {
          "body": "the company is lauded mainly because they pay very above average for the LA area",
          "score": 23
        }
      ]
    },
    {
      "title": "Resume Advice Thread - November 22, 2016",
      "body": "Please use this thread to ask for resume advice and critiques. You should read our [Resume FAQ](https://www.reddit.com/r/cscareerquestions/wiki/faq_resumes) and implement any changes from that before you ask for more advice.\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Tuesday and Saturday at midnight PST**. Previous Resume Advice Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Resume+Advice+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all). \n",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/5e9m7v/resume_advice_thread_november_22_2016/",
      "comments": [
        {
          "body": "Looking for summer internships! [Resume](https://drive.google.com/file/d/0B-bcGhyx-2BbWDFlYUFBWXlkTnc/view?usp=sharing) ",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Hey guys! I'm a Junior, with 1 year left after spring. Can you help me with my resume?\n\n[My resume](https://drive.google.com/file/d/0B6ZXWVT-c9FYNVN6WkM0MkszcjA/view?usp=sharing)",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Do you have any warmups you like to do to get your brain going?",
      "body": "Despite being an engineer for about 10 years now, I absolutely suck at all phone interviews. I feel like my brain just takes too long to snap out of the anxiety and actually start solving things. And I also have to keep some code samples printed out within eyeshot to also just get my mind going. Seriously, without it being asked to write code from a blank page feels like asking me to design a warp drive. Its like I forget what this \"code\" you speak of is until i snap out of it. I just don't do well in interview pressure",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/17gkhlq/do_you_have_any_warmups_you_like_to_do_to_get/",
      "comments": [
        {
          "body": "The shot of adrenaline when they paste the question into coderpad usually does it for me.",
          "score": 6
        },
        {
          "body": "I do a LeetCode problem or two every night or so during my job hunt. That keeps my mind primed for \"interview mode\".",
          "score": 4
        },
        {
          "body": "write down key points on a notepad and have it within eyeshot. it'll give you something to fall back on if you start to blank out.",
          "score": 1
        },
        {
          "body": "You need to practice solving hard problems. Easier said than done, but it really helps. Also to get my brain going I just use caffeine.",
          "score": 1
        },
        {
          "body": "I like to play a few games of sudoku before work. kind of a mental exercise without being directly related to the work I have to do all day anyway",
          "score": 1
        }
      ]
    },
    {
      "title": "How to answer this question asked by Snapchat and Dropbox",
      "body": "I've gotten asked this algorithm/problem-solving question by Snap and Dropbox. In both scenarios, I felt like my answer was lacking, and I'm wondering if there are any senior engineers in this thread who might have a more robust answer to this question:\n\n&amp;#x200B;\n\nGiven a list of files and their contents (file1 -&gt; \"aaa\", file2 -&gt; \"b\", file3 -&gt; \"b\", file4 -&gt; \"aaa\"), return output grouped by files with identical contents, so: \\[\\[file1, file4\\], \\[file2, file3\\]\\]. It's similar to this leetcode question [https://leetcode.com/problems/find-duplicate-file-in-system/](https://leetcode.com/problems/find-duplicate-file-in-system/) However the actual coding in this problem is quite trivial. The more difficult part were the layers of complexity that could be added to it. My approach for the problem was as follows:\n\n1. Read each file, compute a hash, and store that as a key in hashmap along with a list of file names as the value. Of course the bottle neck here is opening files, which could each be GB.\n2. I suggested to first group files by their size, and only perform reads on files with the same size (this would reduce number of reads).\n3. Interviewer then asked what if each file is the same size? I suggested to read the first 10% of the file, but that number was arbitrary. My interviewer mentioned you could read each file a \"block\" at a time, though I'm not entirely sure what that means.\n4. He also asked how can we guarantee accuracy. For example, if there are a million files, even your hashmap could be a bottleneck and you could end up with collisions. I wasn't sure how to answer this part, but apparently the answer was that you can't get around reading the files while computing the results to truly guarantee accuracy.\n\nI feel like there are a lot of other optimizations I could've made to this problem. My interviewer mentioned you could also account for file headers and skip the first few lines of each file when performing a read, and account for file formats. Overall it was a difficult question with lots of what-ifs. Would appreciate if anyone in this thread could add on to my approach above and suggest better ways of optimizing/answering this question? It seems to be a pretty popular one...",
      "subreddit": "cscareerquestions",
      "score": 36,
      "url": "https://reddit.com/r/cscareerquestions/comments/jhob3n/how_to_answer_this_question_asked_by_snapchat_and/",
      "comments": [
        {
          "body": "For 3, I think block here is referring to file system blocks. This is how the hardware stores data. Each file occupies a certain number of \"blocks\" in the disk, and you can compare blocks to check if two files are the same.\n\nFor 4, that is correct. There is no perfect hash function that guarantees no collision. As a result, even when two files have the same hash, you \"must\" read them and compare to make sure they are actually the same if you want 0 tolerance for error. However, you can definitely optimize the hash function to minimize number brute force comparisons by first checking hash on size, file type, then raw data by blocks, etc.",
          "score": 11
        },
        {
          "body": "The first step is clarification questions. In general, you shouldn't try to solve the problem before clarifying requirements.\n\nHow large are the file sizes? How many files are there? Are the files on disk? Available over the network? Is this a finite list or does the list continue to grow? Do we know anything about the distribution of files? Will there be many duplicates or very few?\n\nThis matters because the answers changes how the question is answered. If the file sizes are small and there's a small number of files... read them all into memory and you're basically done. If a single file cannot be stored into memory, then the entire problem changes. If there's trillions of files, then you need a distributed network of computers. If the list continues to grow you need an online algorithm.\n\n&gt; Overall it was a difficult question with lots of what-ifs.\n\nThis honestly sounds like a system design problem. There are a lot of what-ifs and depending on the answers from clarification questions, you'll design completely different things because you'll have to solve different sub-problems.\n\nSystem design questions have multiple purposes. One of them is to see how well you work with a team (team being how you interact with your \"teammate\", the interviewer), how you handle open ended problems, your ability to discover problems/bottlenecks and propose solutions, etc.\n\nThe worst case of this problem probably turns into some kind of ETL/map reduce. Or even worse, you may need to design an entire system just to solve this problem.\n\nIf you're a junior dev, I don't think this problem is quite fair. But for mid-level and above system design problems are fair game.",
          "score": 10
        },
        {
          "body": "Dropbox loves asking this question because this was an actual problem they had to solve when building out their application. You can read their blog to understand more about [Magic Pocket](https://dropbox.tech/infrastructure/inside-the-magic-pocket), their file storage infrastructure.  \n\n\nWhen files are broken down into blocks (chunks of data), they will usually have a some meta data stored in the [file signature](https://en.wikipedia.org/wiki/List_of_file_signatures) that you can use to determine what type of file it is as well as the name of the file, size, date created, etc. You can then hash this and use it as a unique identifier.  \n\n\nTo solve the collision problem, you would compute the [checksum](https://en.wikipedia.org/wiki/Checksum) of the file already stored in the hashmap to check to see if it is indeed the same file.",
          "score": 12
        }
      ]
    },
    {
      "title": "Daily Chat Thread - July 23, 2021",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/opx0m9/daily_chat_thread_july_23_2021/",
      "comments": [
        {
          "body": "What's the story with companies that have large layoff rounds and then immediately turn to hiring?\n\nEarlier this week I got a reachout from another company like this (this time New Relic), but just in April they laid off something like 7%. Is this all so they can show layoffs to stockholders? What do they gain by laying off so many and then hiring new people?",
          "score": 2
        },
        {
          "body": "Has anyone ever done a software engineering interview for Slack? I was told there won’t be any LeetCode type problem solving.",
          "score": 1
        },
        {
          "body": "has anyone ever used a buffer reader? never went over that in school and couldnt answer the interview question",
          "score": 1
        },
        {
          "body": "how bad is a first job as SRE when i rlly want to be a pure dev (like SDE/SWE)",
          "score": 1
        },
        {
          "body": "What is the difficulty of an Apple contractor interview(or fang   \ncontractor interviews)? As compared to full time employee of Apple?  At   \nthis point I'd say myinterviewing skills aren't up to par for a full   \ntime employee interview at Apple, but I've been hit up for interviewing   \nfor a contractor position, and not sure what to expect.",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Snapchat",
      "body": "I recently received an offer for full-time from Snapchat (Snap Inc.), and I was wondering if anyone here has had any experiences with negotiating with them.\n\n1. How much is the average/normal compensation package that Snapchat offers for new graduates? I've looked on Glassdoor, which lists 132K base, but the statistics don't discriminate between different experience levels (e.g. new grad vs 4 years).\n\n2. How likely is Snapchat to increase from their initial offer? Has anyone had any anecdotal experience with negotiating with them?\n\n3. Any advice on negotiating? I currently don't have any offers but I'm also interviewing at other places, so if they get back to me I may be able to leverage that.\n\nThanks in advance!",
      "subreddit": "cscareerquestions",
      "score": 78,
      "url": "https://reddit.com/r/cscareerquestions/comments/5bhu8q/snapchat/",
      "comments": [
        {
          "body": "&gt; Any advice on negotiating? I currently don't have any offers\n\nGet another offer. It's the single best form of leverage for a new grad. When you already have a job, you can use your current job as leverage.",
          "score": 56
        },
        {
          "body": "My new grad offer is:\n\n* 120k base\n* 322k stock vesting over 4 years w 1 year cliff (backloaded 10/20/30/40 vesting)\n* 10k signing\n* Annual equity refreshes\n\nPotential for an annual cash performance bonus (not set in stone yet). I am also interested in negotiating. Not accounting for risk this is better than the rest of my offers, though. Will share my experience after I attempt to negotiate.",
          "score": 15
        },
        {
          "body": "[deleted]",
          "score": 34
        },
        {
          "body": "Got a new grad offer. It's the same as one of the other posts here:\n\n120k base\n322k stock (10/20/30/40% over 4 years)\n10k signing\n\nI don't know if they give other packages, but if they do, mine is probably on the higher end.\n\nI tried to negotiate with slightly higher offers from other companies. Got my signing doubled to 20k but they wouldn't budge on anything else. They care a lot about long-term commitment (hence the backloaded vesting schedule) - I would find something to talk about along those lines, but don't get your hopes up too much.",
          "score": 6
        },
        {
          "body": "Holy crap Snapchat pays you guys well. It makes me think maybe I should move out of here if I want good money as a \"new grad\" / entry level guy. Shieeet. ",
          "score": 6
        }
      ]
    },
    {
      "title": "Got an offer, have until the end of the day to decide, feeling so-so on it.",
      "body": "After interviewing four places, and getting two offers, I finally got one that was decent, it's nothing spectacular, good money, good facilities, good young company culture.  My snap judgement tells me the project manager I interviewed will be difficult to deal with in the workplace, and they aren't exactly using cutting edge technologies,  .NET mainly, and no source control as far as I could see. \n\nI'm currently employed, but due to weird workplace circumstances I'm stuck doing data entry, I have to get out of here ASAP.\n\nShould I wait it out, or should I accept the offer?  I know I have to do what's right for me, but I'm not even really sure what that is.",
      "subreddit": "cscareerquestions",
      "score": 36,
      "url": "https://reddit.com/r/cscareerquestions/comments/391aot/got_an_offer_have_until_the_end_of_the_day_to/",
      "comments": [
        {
          "body": "Nobody can answer this for you, but a couple thoughts. If you're doing data entry and given a chance to code somewhere else, obviously the coding experience is much more valuable. You say it's good money/facilities/culture, with a downside of a PM and .Net. I don't think .Net should be a huge concern (though I do think other skills are more valuable).\n\nOne item you didn't mention. You mention having until the end of day to decide. When were you given the offer? If it was today or even Friday, I'd view that as a flag. \n\nIf you \"have to get out of here ASAP\", this sounds like the easiest way to do so.",
          "score": 39
        },
        {
          "body": "No source control?  That's a bad sign if it's true and not just that they didn't mention it.",
          "score": 29
        },
        {
          "body": "There's lot's of interesting, exciting stuff going on with .NET. I don't understand the aversion to it in this sub. I don't want \"cutting edge tools\" because eventually, you lose an appendage when something is changed that negatively effects your work or product.\n\nIf you want \"cutting edge technologies,\" go find either a startup that's begging to be bought up by a big player, or a huge, well-funded company that can assume the risk and if necessary take on stewardship of the project (like Wal-Mart with node.js, or Facebook with some of the popular platforms they've forked to make them work in their environment).\n\nSource control is question #1 on The Joel Test. I'd guess that since they don't have source control, they're failing at least 3 other questions of that test as well.\n\nI'll probably catch flak for this, but I'll come out and say it anyway: at this point, source control is a basic, required tool in a professional software development environment. Just as a framing hammer is a basic, required tool for any professional carpenter. If I don't see those core tools, I assume they're not taking the job seriously.\n\nRecap:\n\n* Your gut feeling is that you won't get along with your PM\n* You're not a fan of the tech stack\n* No source control\n\nBalance your desperation to get out of your current job against the \"do I really think I can deal with coming to this place and dealing with this stuff every day\" factor. There *are* other jobs out there that better align with you.",
          "score": 17
        }
      ]
    },
    {
      "title": "I'm looking into industry research positions after my PhD in CS. Any advice on what skillsets I should focus on?",
      "body": "Hello all, I am a 3'rd year PhD student in CS and my research focuses on human-computer interaction. Thus far, my work has been centered on VR/AR interaction techniques and are very user-focused (user evaluations, user perception, qualitative surveys etc.). As I start to begin to think about industry research positions I think\\* I am noticing a higher demand in industry research centered on graphics and computer vision in comparison to HCI. For example, Snap recently dissolved their HCI dedicated research team last year and now they only have their computer vision research team. Or at Roblox research, they are graphics-focused; I actually applied for a research internship here and got the impression they were looking for people who publish at venues like SIGGRAPH where I publish at CHI and UIST) after my interview (I didn't get the position).\n\nI may have an opportunity in the upcoming year to do a more Computer Vision focused paper that I can publish at CVPR and my work is somewhat adjacent to CV work since it's augmented reality focused, so I think it could be a wise pivot to appeal to research teams that value this type of work. I will likely be in my program for 3 more years (6 years total), so is it wise to get a couple of computer vision papers under my belt to appeal to industry labs that seem like they're more CV or graphics focused?\n\nDisclaimer, I am not trying change my entire area to CV research since I'm already halfway through the program, but I am thinking that it may be wise to appeal to this seemingly high demand in CV for the industry job market.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1c7baha/im_looking_into_industry_research_positions_after/",
      "comments": [
        {
          "body": "There's some overlap, whether warranted or not. I have an MSCS and PhD in HCI and have done both graphics and HCI work. Graphics as in CV for autonomous driving and stranger things like eye tracking (epic fun). HCI as in the usual theoretical stuff, clinics, surveys, storyboarding, experiment design, etc. \n\nYou should be able to bake some CV into your own research, which should give you enough background to be helpful. At the end of the day HCI involves a lot of visual stuff and knowing how to map those into CV or use CV to sort things out will be useful.\n\nIndustry doesn't care about research as much as we'd like. My HCI group was nuked so I'm back playing MSCS guy. Pays the bills.",
          "score": 1
        }
      ]
    },
    {
      "title": "Why do fairly mediocre people get job offers so easily whilst many talented people end up jobless for months?",
      "body": "Recently, place I work for has made 25 people redundant. I’ve seen several of those colleagues.  with very average CVs and personalities (not super charismatic) be snapped up within 2 weeks of looking for jobs whilst many other colleagues  in the same field with amazing CVs have struggled for over a year or two to get a new role despite having way more qualifications or years of experience or certifications or achievement track record in their jobs. \n\nI know it’s case dependent but what would mainly be driving this contrast? Are those with extremely good CVs considered a high flight risk to hire/overqualified or over the budget on expected salary or is it just a case that the mediocre candidates are just better connected to influential people so get priority?\n\nIt can’t be interview performance in this case as many of the high achiever examples I mention don’t even get through to interview stage..",
      "subreddit": "jobs",
      "score": 1417,
      "url": "https://reddit.com/r/jobs/comments/1mei1j0/why_do_fairly_mediocre_people_get_job_offers_so/",
      "comments": [
        {
          "body": "you would be surprised how crappy some peoples resumes are",
          "score": 821
        },
        {
          "body": "[deleted]",
          "score": 356
        },
        {
          "body": "I have seen it . I know for myself a managerer straight up told me that they didn't want to hire someone who could take their place. Which I  could quite easily but was not my intention . Lol",
          "score": 129
        },
        {
          "body": "I had a friend at my crappy retail job who got fired after stealing. His next job? At a background checking agency. I interviewed there and didn't get the job. It was at this time that I learned that the system is RIGGED.",
          "score": 278
        },
        {
          "body": "&gt; Why do fairly mediocre people get job offers so easily whilst many talented people end up jobless for months?\n\n\nConnections, nepotism, high social skills, etc",
          "score": 134
        }
      ]
    },
    {
      "title": "Snap Ads Product Manager Interview",
      "body": "I’ve got a PM video interview coming up at Snap (specifically for their Ads Ranking team) and was wondering if anyone has tips or has gone through the process recently?\n\nWhat was the first screening interview like, what kinds of questions to expect?  \nAnything I should brush up on around ads, monetization, or Snap’s ecosystem - how technical do they expect a PM to be? I have some AI related work in managing MLEs, and have some knowledge of the ML models used at my previous jobs, as well as a decent end-to-end idea of the overall pipeline.\n\nHas anyone been through their interview process? I'm not able to find anything related to Snap PM roles.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jvsd8d/snap_ads_product_manager_interview/",
      "comments": [
        {
          "body": "how did it go?",
          "score": 1
        }
      ]
    },
    {
      "title": "Nervous about starting my job next week.",
      "body": "Hello everyone!\n\nI recently got hired to a new job, and I’m thrilled about it. However, I’m also a bit nervous about how I’ll perform.\n\nYou see, I haven’t had a job in a couple of years. The reasons for this are that I was still in high school, and I’ve been focusing on other things in my life, such as college. In the past few years, I’ve only had two jobs: one in fast food and one in retail.\n\nThe reason I’m mainly nervous is because of my experience in the fast food job. I lost my temper and got fired for it. I was ashamed of myself, and I still am. I was 17 at the time, and I don’t like looking back at it. I’m worried that I might feel the same way again.\n\nThe retail job was different. I was let go, but I didn’t do anything wrong. I wasn’t sure why I was let go, but I’m still a bit concerned about it.\n\nI’m 20 now, and I don’t have those same angry feelings as before. I’ve gotten the help I need, but I’m still worried that I might snap. I’ve been looking for jobs for months, but I had no luck until a couple of days ago. I finally got an interview and was hired.\n\nI’m happy that I’m hired, and I want to start fresh and be a better person. However, I’m still nervous about how I’ll act and behave at work.\n\nI know it’s normal to feel annoyed with customers or employees at work, but you shouldn’t show it. It’s not appropriate. Yelling and losing your temper during work time is definitely not appropriate either. I want to maintain a respectful and healthy attitude.\n\nI’m young and still learning, but I want to grow and change. ",
      "subreddit": "jobs",
      "score": 9,
      "url": "https://reddit.com/r/jobs/comments/1lmwna4/nervous_about_starting_my_job_next_week/",
      "comments": [
        {
          "body": "You're gonna have alot of jobs in life broski until you find and see what your good at doing. You gotta find that mojo. Sometimes you go through a few jobs looking for it. Don't sweat the small shit. Just breathe....learn the job and ask questions. Learn everything about the job that you can even if you dont like it. It'll make it alot easier to deal with. You'll be that much more effective at the job. Best of luck to you.",
          "score": 3
        },
        {
          "body": "Only time will tell how you'll do in this job. The employer must have seen something in you to take you on. Maybe you have matured enough to bite back the anger. I wish you well.",
          "score": 3
        },
        {
          "body": "You’re already ahead by being self-aware and wanting to grow. Everyone makes mistakes at 17 - you’re not that kid anymore. New job, clean slate. Stay grounded, ask questions, take breaks when you need to reset. One day at a time. You got this.",
          "score": 3
        }
      ]
    },
    {
      "title": "After a 14 Month Struggle, I Was Ready to Give It All Up. Today, I Received a Life-Changing Offer Letter.",
      "body": "**TL/DR:** I've been out of work for over a year, living out of my car, and was recently denied SNAP. My savings almost depleted, a kind colleague and an ex-VP reached out, giving me a lifeline and re-instilling my sense of self-worth. An interview materialized within a matter of hours, and I was extended an offer letter for 2x what I was making in early 2024.\n\n\n\nAfter 138 applications, I'd stopped counting the number of rejections, and gave up completely on trying to follow-up on ghosted applications or interviews. It's no surprise to anyone else that has been struggling this year, that this current job market is a brutal one. The unemployment rate is at a four-year high of 4.6%, and as many of us have depleted our savings, the current administration seemingly takes pleasure in cruelly making food assistance even more difficult to obtain. \n\nSomewhere around May, I was told that my SNAP benefits would be ending, as I no longer qualified. Even though I'd been living in my car since September prior, the fact I was enrolled in part-time college coursework disqualified me. Apparently part of the new qualification set is that you're not allowed to better yourself. When you have next to nothing left, $185 a month for food really does make a difference. I tried to appeal, but the powers that be pushed me further downward with a three-month sanction before I could re-apply. \n\nlate 2024 and all of 2025 has been the second worst period of my life. First place goes to 2000, the year my brother died of a massive stroke, and my Dad was diagnosed with thyroid cancer. On top of that, he'd just been laid off from his job, after having worked there since the early 1970s. 2024 handed me not only a divorce, but the dissolution of my job. I was to be spun off after a corporate carve out, and \"promoted\" into a \"compensation neutral\" role. After reluctantly accepting and trying to find something else in the meantime, I was told a further restructuring would be taking place due to massive sales losses. In other words, I would be losing my job, and was laid off. \n\nI can't even begin to tell you how many hours I spent this year, sitting at this very computer, contending with my mental health, and wondering if I even had a future, let alone a near-future. I'd been laid off before, with 2008 having also proven difficult. There was something eerily different about this time around though. The lack of hope. The feeling of external politics just continually blacking out the daylight. Friends and family going through similar experiences of either losing jobs, or having merit increases frozen while also taking on more work from management with the expectation to outperform prior productivity.\n\nLast week, I received a message on LinkedIn of all places, from a colleague. LinkedIn. The one site I'd come to recognize as absolutely unreliable and useless in terms of job searching and applying. They indicated a role had opened up in my original department, and they felt I would be the ideal candidate for it. Senior level, and definitely with more responsibilities, but I had all the core skillsets, and even some outside of the role that would really help me to excel. I wasn't sure at first. You know how it is... Month after month of searching without result destroys your self-confidence. Self opinion leaves the chat. You wonder what's wrong with you, and why no one deems you good enough to interview, let alone be contacted for an initial screening call. \n\nSo I thought, \"What the hell have I got to lose at this point. Everything else has been an abysmal failure.\" The only solid interview I'd had in November turned into a voicemail, indicating a hiring freeze had taken effect, that the requisition had been rescinded, and to have a happy holiday. So I thanked my colleague for reaching out, braced myself with a cup of affordable and horrible-tasting coffee, and applied just as the role became active on the company career page. \n\nLess than 24-hours later, I received a direct call from the divisional VP of my previous pre-disastrous carveout role, and he was recollecting how impressed he was with me in my time there, and that he'd reach out to the hiring manager for the role. The next morning at 9AM, I had an invite to interview directly with the hiring manager and team. Recruiter screening bypassed, directly on to the good stuff. For the first time in more than 14 months, I felt a glimmer of hope. Someone had turned the pilot light back on. \n\nThe panel interview was comfortable, and my answers to technical questions were met with the engineer head-nod of approval. I literally felt the sense of confidence and self-worth flooding back into my consciousness as we talked further, and I became excited, sharing my experiences and how I really could accomplish great things in this role. This morning, I opened up my e-mail to an offer letter. Nearly twice the amount in compensation as my previous role with the same company. Profit sharing. Full benefits. Medical insurance. I can finally have these bilateral 12mm and 18mm kidney stones obliterated and removed without going into medical debt. I can finally feel healthy again. I can have a room to sleep in again. It sounds simple, but to me, it's life changing at this point.\n\nMy life has seemingly changed for the better in an instant. I've been reminded that even through a rough period in my life, there were people out there thinking about me. I did work that made a strong enough impact that it left a positive impression. I'm feeling beyond thankful. I'm feeling genuine happiness and relief for the first time in more than a year. Thanks for reading.",
      "subreddit": "jobs",
      "score": 730,
      "url": "https://reddit.com/r/jobs/comments/1poxk1s/after_a_14_month_struggle_i_was_ready_to_give_it/",
      "comments": [
        {
          "body": "A big hearty congrads!  I've been there myself- tho not as a long as u.  I had a good cry afterwards.  No joke.  It was brutal.\n\nNever forget- to pass on the generosity to others as you yourself have received.",
          "score": 111
        },
        {
          "body": "Congratulations!!!  This was refreshing",
          "score": 30
        },
        {
          "body": "You deserve this. Breathe, and move forward with your life.",
          "score": 24
        },
        {
          "body": "Good for and I am happy for you.\n\nLong time ago it learned to live below my means along with saving and investing.\n\nFirst time i got laid off was a 20, then again at 42 and then a few months shy of 60 I was forced out due to a reorganization.\n\n Now I'm  4 years into retirement.",
          "score": 27
        },
        {
          "body": "Congratulations. This is why you don't jerk over co-workers on your way out. They know your work and they know you.",
          "score": 17
        },
        {
          "body": "Huge congratulations to you! Take a moment to congratulate yourself for all you have went through because you have survived!",
          "score": 17
        },
        {
          "body": "Congrats, I’m so happy for you. I’m so sorry you had to go through all of that; it’s so awful how much people are struggling to find jobs just to have a roof over their head. It shouldn’t be this way! I hope this just leads you to the best years of your life and a new beginning!",
          "score": 9
        }
      ]
    },
    {
      "title": "I was fired yesterday",
      "body": "I was fired yesterday.  \n\n\\*Edited to add context\\*\n\nSorry if I come across as rambling. I'm very upset.\n\nI don’t know what to do. I feel like my entire world is currently shattering.  \n\nI left my perfect work from home job in June 2025 that I was with for almost 4 years. The company is going through a lot of restructuring and layoffs, I was afraid of losing my job, so I took a job in my small town at a law office.  It was a drop in pay, but the attorney seemed amazing and she promised she would get me where I needed to be.  During my interview I told her my plans of attending college to get my bachelors degree, she said with this job would come with a lot of downtime to be able to get my college work done.  \n\nFast forward to now, I had been with her for 8 months and everything was going great….until we had lunch around the holidays and I was excited to tell her I was starting the process finally to take college classes.  The following Monday she came to me and told me how shocking it was to hear that and that she needed time to recover, but is happy for me. We had a long talk, and she also told me that she wants me to step back from Paralegal work (I JUST got my paralegal certificate to get a raise) and she wants me to focus on administration tasks. She wrote up a “legal assistant tasks” and I asked her if it’s because I’m not meeting expectations - she laughed and said “No, you’re doing great! I’m not good at delegating legal stuff so I can do that and this is just so you know what I want you to do.” \n\nI also asked her when I can expect a raise. My insurance through the market place raised to almost $1,200 for 2026 (I didn’t tell her this) \n\nShe responded that within the next 6 months I should not expect a raise.  After that, maybe but it won’t be substantial.  \n\n \n\nOverall, we left the conversation on a good note.  \n\nSince then, she has been cold, distant, and very direct. I thought it was in my head and she wa just being very direct, but it’s gotten increasingly worse.  I just opened my email and she has emails waiting for me to see right away tomorrow morning that sa “Ally, I thought you’d take the initiative and do this. But you haven’t. Please get this done” and “this wasn’t done so I sent it. “ \n\nA lot of emails saying “moving forward you need to make sure this is happening” and these are things that are just simply not my fault. I do A LOT.  I went into the legal field with no experience. I took the initiative to get my certificate, get my notary, update internal processes….up into this point I have gotten all positive feedback. This is all coming from out of the blue. She’s treating me like crap, snapping at me….and I’m just miserable.  I can’t stop crying. She’s been like this for weeks and it’s now becoming very obvious of how she’s treating me.  \n\nI don’t know what to do. I feel like a fool for leaving my job. I’m in a small rural town and would have to travel over an hour to work. The job market sucks.  My husband makes good money, I think we would be okay with just his income but I don’t want a gap in my resume.   \n\nAnd all of a sudden since I told her I want to go to school she’s been putting really weird tasks on me (grunt work) to take up my time….almost like she’s sabotaging me getting my degree.  \n\nI don’t even know if she’s upset because of that.  She’s just being….horrible.  I could do 10 things correct and she will focus on one flaw and use that to lecture me.\n\nWe had a Christmas lunch on 12/18 where my boss gave me a bonus and told me how happy she was with me, this is when I told her an update on getting my degree (something we discussed during my interview) \n\nOn 12/29 she said she wrote up a “Legal Assistant Task Sheet” and I asked her directly if this is because I’m missing anything, she said no, she just wants to put it in one place. We had an impromptu meeting and I asked her directly again if she has any feedback for me, she said “no you’re doing amazing!” \n\n1/5/26 - ONE WEEK LATER. Starts sending me corrective feedback emails, being cold and direct and very negative in the office.  I requested her to sit down for a meeting with me today, to which she said “I already planned to sit you down for a meeting” \n\nWhen we met I brought her the task sheet, highlighting things I do, processes I invented since starting and things that need more collaboration on.  Since starting 8 months ago, I have created forms, contracts, internal systems, Facebook page with a following, created a Google business page, etc. you name it, I did it.  She chose to take the things I created and used them as a weapon to micromanage me.  \n\nAnyway, we sat down and she said she is terminating me and said I’m “not proficient” in my role and “missing things” \n\nI asked her why I am just now hearing about this. I asked her why the shift overnight has happened. She said she didn’t realize how much I was missing until after she made the task sheet - but it was after the task list was created that she told me (multiple times) I was doing great. \n\nHer reason for firing me? Because I forgot to add the cause number to a couple files.  I told her in the grand scheme of things - that is a small error and something she should bring to me so I can fix. Even the most perfect people make mistakes.  Coming back from two back to back holidays and getting an influx of calls of people wanting divorces, I was busy last week. Busy as hell.  I asked her more for examples and she said “just a lot of small things.” But could not give me ANY EXAMPLES.  \n\nI’m angry. I’m hurt. I feel completely used. She already hired my replacement.  I left my dream job of 4 years and took a chance of this snake of a person.  \n\nI took a video of my termination.  I know she’s going to try to fight my unemployment claim. I just….i don’t know what to do with myself. I can’t relax.  I can’t stop crying. I feel like I’m at blame, that I’m incompetent even though I know I’m not the problem.  I have worked so hard on my career, I feel like it’s all completely crumbled.",
      "subreddit": "jobs",
      "score": 215,
      "url": "https://reddit.com/r/jobs/comments/1qfd8k1/i_was_fired_yesterday/",
      "comments": [
        {
          "body": "Oh the old bait and switch. I'm so sorry OP.\n\nI've been in the legal field for over 20 years and have definitely seen this happen before. She made you think she was on board with your plans, and then when they came to fruition, she did a 180.\n\nI think you should try to find something at a mid sized firm, as working for solo attorneys can be difficult. There are some who are gems, but people tend to not leave those jobs very often.\n\nI still remember the shock and hurt when this happened to me. It's not you, just an attorney who is a bad manager and doesn't know what she wants.\n\nYou will recover from this OP. You might encounter several bad bosses in your career, and just understand it's the nature of the business. Best of luck to you.",
          "score": 149
        },
        {
          "body": "Build a timeline of events immediately. Your old boss was building a case against you and she did a pretty good job of it. The unemployment claim will be contested by her, but the burden of proof is on the employer. \n\nDocument everything you can. If you still have the sheets you created, access them and take screenshots. Prepare yourself to go up against a lawyer. Your job is to prove that you had no notice of poor performance and were getting mixed signals. \n\nGood luck. And try not to let one shitty job in a small town define your self worth. The world is cruel enough sometimes, no need to be cruel to ourselves too.",
          "score": 70
        },
        {
          "body": "Don’t ever tell someone you’re going to start taking college classes. There’s employers who fire people for going to college because they think that the employee won’t be able to fulfill their job duties, or will get a better job upon earning their degree and leave them. Or she’s jealous because you’re trying to better yourself.",
          "score": 67
        },
        {
          "body": "All I'm going to say is that working for attorneys sucks. Also, there is a reason lawfirms are always looking for paraprofessionals in places like Indeed and Linked In and Simply Hired. \n\nYou can use that degree or certificate in other ways or you can change careers.",
          "score": 25
        },
        {
          "body": "What my wife did 40 years ago before I met her was to get a job at the university and work in a master's at the same time.\n\nThat way, she got reduced tuition and was allowed to go to class during the day and then made up the missed work hours.\n\nI would guess a lot of administrative type university jobs, you get your work done and then you have down time which can be used to do home work and study.",
          "score": 21
        },
        {
          "body": "The moment she told you that she\"needed time to recover\" when you told her news personal but otherwise good news should have been a red flag to you. \n\nNo manager ever should be shocked or upset about losing an employee to a better opportunity. If you feel like they will retaliate it 6 take it badly you should not work for them. \n\nClassic narcissistic injury retaliation. Not surprising at all from an attorney.",
          "score": 14
        }
      ]
    },
    {
      "title": "9 Snap Judgments Managers Make in Job Interviews",
      "body": "",
      "subreddit": "jobs",
      "score": 23,
      "url": "https://reddit.com/r/jobs/comments/jt6dx/9_snap_judgments_managers_make_in_job_interviews/",
      "comments": [
        {
          "body": "Interviews really are about good first impressions. I've been the interviewer on a few occasions, normally in a situation where I am just there for technical expertise. \n\nYou would be amazed at some of the snap judgments an interviewer will make. One guy did not get hired because of the color of his pants. A little bit of me died inside when discussing this candidate. \n\n",
          "score": 6
        },
        {
          "body": "You know, one can put this shoe on the other foot.  I bet I can come up with 9 snap judgements that interviewees make about potential employers too.  I don't care if you do make me a good offer - if you're a dick, I'm going to look elsewhere. &amp;#3232;\\_&amp;#3232;\n",
          "score": 3
        },
        {
          "body": "The first point annoys me. \n\nI consider a job opportunity a mutually beneficial business arrangement... not something that I should be thankful for. And I refuse to fake excitement before I know whether or not the job is a good fit.",
          "score": 3
        }
      ]
    },
    {
      "title": "Another reason why older workers can't get hired (USA) ",
      "body": "If a person has credentials, and multi-industry work experience and is applying for jobs that are below their skills and income needs, and skates through the interview without revealing those credentials to get hired into a job that pays $14.00 per hour (I did), and has perfect attendance, never late, never absent and outperforms people, and is fired for bogus reasons in 30 days....\n\nIt could be because the company learns of that person's credentials and experience and knows that IF the individual wants to move up because $14.00 per hour isn't enough pay, and the company wants to promote a young workforce, they might have to get rid of that individual to avoid an age discrimination lawsuit. \n\nMany middle-aged people are content becoming a place holder and not moving up. I couldn't afford to coast on min wage while living in my car and exist like that without money for dental, health, and vision and a place to live. I never got married and I don't have family to provide me a safety net. \n\nI'm told frequently by others to \"just work minimum wage\" jobs but they fail to ignore my needs for a place to live, transportation needs, and health, dental and vision. Working low wage jobs that had no intention to have me move up has resulted in my circumstances today. \n\nSo, how do I \"work my way out of my poverty that I've been pushed down into\" if no one will give me a chance? On a side note, I was raised in a very religious home where I was expected to get married and have children which I never did. My car isn't in condition to drive for uber or door dash. I have no help from social service. All the churches just hand out pamphlets to run to food pantries and enroll in SNAP &amp; Medicaid which doesn't provide a cash income for me to pay my bills. \n\nPeople entering the workforce are having trouble getting hired. Temp agencies won't hire me. I'm blocked from earning a living. I'm in my 50s. I'm begging now while trying to look for work in a begging state. And in this begging state I'm unable to get work. What do I do to get an income?\n\n",
      "subreddit": "jobs",
      "score": 41,
      "url": "https://reddit.com/r/jobs/comments/1en1oo2/another_reason_why_older_workers_cant_get_hired/",
      "comments": [
        {
          "body": "Need 20 years experience in your field and also be under 30. Welcome to the market.",
          "score": 32
        },
        {
          "body": "I feel like companies don't like hiring people over 35.",
          "score": 42
        },
        {
          "body": "long shot here, but have you looked at government work? The hiring process is a little odd, and when you do the application , your resume is attached, but you still have to answer every question, no matter how mundane. The government hires a lot , and I mean A LOT, of people over 50. My sister just got hired - at 52.  full benefits. Good luck.",
          "score": 14
        },
        {
          "body": "Fully agree, I’ve been told on Reddit to just work at a grocery store if I were to get fired but the amount of people I know who got laid off and can’t even get hired at grocery stores because of qualifications is pretty high. The entry level place holder jobs are rare now, like you said even if you hide your credentials employers can still find them if they want to. The idea of losing my job terrifies especially with lay offs happening right now.",
          "score": 6
        }
      ]
    },
    {
      "title": "Secured a job!",
      "body": "After 16 months of grueling and extensive job search I finally was able to secure a job as an assistant to the manager at a tax recovery service! \n\nI lost my job back in July of 2024 due to a misunderstanding between me and management and I immediately started looking for a job, got unemployment, and snap benefits while I looked for a job. I applied to hundreds of jobs and only secured four interviews, my most promising interview was back in July of this year about a year after I lost my job and while I was hired and trained as a canvasser both me and lead felt the job wasn't for me so I was laid off. I couldn't understand why I was having such a hard time finding a job, I had a year and six months of retail experience with some management work, and 11 months of clerical work experience, I have a high school diploma and my resume was ran through an advisor multiple times to clean it up and yet I rarely got a response from retail and clerical job postings. \n\nI gave up and in August I turned back to the place that had helped me multiple times, the non-profit organization that helped me secure two jobs in 2020 and 2023. After speaking with a caseworker I was invited to orientation on August 8th and the following month on September 8th I followed up with the caseworker who had me come in, fill out paperwork and did assessments, I kept in touch with her and my advisor. On Tuesday, I received a message from my advisor that she spoke with an employer who needed help and was interested in my experience. \n\nYesterday, I received a phone call from the manager and we spoke a little about where my mindset was and my clerical experience, didn't really feel like an interview but more like he already made up his mind about hiring me so we agreed to have a meet and greet today at 11am between my manager, advisor, and myself! I am excited to get this ball rolling and start on my new journey, I will be able to start work November 10th once I meet my manager today. \n\nI do plan to return to school but probably not until I turn 24 when fafsa doesn't require my parent to be on my case until then I plan to hang on onto this job!",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1oqtvcv/secured_a_job/",
      "comments": [
        {
          "body": "Congratulations and good luck to you",
          "score": 2
        },
        {
          "body": "Good for you but maybe this post shouldve been written in your diary 😂",
          "score": 1
        }
      ]
    },
    {
      "title": "How do I not let the job market get to my head?",
      "body": "A bit about myself; I'm a 25 year old who graduated in nov2023 with a bachelors in comp sci, with an interest in a cybersecurity career. I currently have a part-time job on the weekends that's stable and give me okay money.\n\nI did work for a small business owned by a dad of a good friend of mine for a couple months after that. However there was zero technical interview (heck he didn't look at my resume until after he hired me). He just sort of slapped the title \"security analyst\" on me and asked me to work on improving the security of the company's systems.\n\nThis part isn't super relevant to my post so I won't go too much into it, but I decided to leave the company after being able to accomplish too little. **I don't regret this decision, and I had thought about it for a lot of time before deciding to speak up to him. It really just wasn't a good place for me to work at.**\n\nAnyway, right now I'm working on my resume to become a SOC analyst, and also working on other certs at the side. However, I tend to umm... overthink and worry about the future. Almost every day I hear about how bad the job market is for Gen Z. Most of the time it's from people who just say how bad it is without offering any hope or optimism for the sake of engagement.\n\nI know that it's somewhat true that getting employed (especially as a graduate with experience equating to approximately entry level) has been rough in recent years. But when I actually try to sit down and get stuff done to become a better candidate, these thoughts really burn me out. My brain is constantly filled with thoughts like:\n\n* how long will I be stuck in this shitty part-time job?\n* how long till my dad snaps at me for going without a real job for so long?\n* am I building the right skills?\n* should I switch careers to something that I don't want but might get me hired sooner?\n* etc.\n\nI really wish I could just shut off those thoughts and focus on getting work done, but there's always those lingering thoughts about 👻 **THE JOB MARKET** 👻 that really really weighs me down. It's sort of like incel blackpill ideology but for jobs. I know that I can't just turn the economy around overnight and suddenly we're all in a utopia. All I can do is work on my resume to get more qualified and make employers wanna hire me. That's the way it's always been.\n\nDoes anyone have any tips for me on how to deal with these thoughts? I just get so overwhelmed constantly worrying about this, and it doesn't help a bit.\n\nedit: im not living in america btw, thought i'd mention that",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1noaiqs/how_do_i_not_let_the_job_market_get_to_my_head/",
      "comments": [
        {
          "body": "What you're going through is, unfortunately, pretty universal. The market is pretty rough, it can feel like you need to be perfect to get anywhere, and every day without a job offer feels more hopeless.\n\nI spent a good 6 months feeling like this recently; trying to work on projects/skills/certs but feeling aimless and like I was wasting my time. I ended up not really getting anywhere. However, I realized I felt the exact same way a few times while I was in college. I felt like I would never get an internship (\"market is bad, it's too competitive, etc.), any skills I developed felt useless compared to real work experience, and I felt like getting my CS degree was a waste of time and money. Fast forward a year and after trudging through some side projects, reworking my resume, and applying, with no success, I ended up getting a decent internship. Then I doomered about that internship not giving me a return offer and how it was too far from the field I was looking for (it was Operational Technology), but I kept applying and ended up getting multiple job offers in my main field (software dev).\n\nI took one and worked it for 3 years until being laid off early this year, and that's when that recent 6 month doomer phase kicked in again. Only recently, after a newly revised resume and targeted applying have I started getting interviews. I had to stop worrying about the future and take little steps to improve my chances, but so far it's paying off.\n\nGetting too doomer about things will always put you in a worse position than if you had believed, even just a little bit, and did what you could to keep moving toward your goals. This market is tough, but there *are* still jobs out there and they aren't *all* looking for unicorn candidates with dozens of years of experience and all the certs under the sun. You *will* make progress in your career if you don't give up, it may just take a bit to get there. Cybersecurity ain't going anywhere, and neither are the many other fields in many other industries. Eventually an entry-level position (or even entry-mid with growth potential) will find you, if you keep digging for it.",
          "score": 2
        }
      ]
    },
    {
      "title": "Live DTLA desperate for work",
      "body": "Got laid off 2 months ago and I’ve been applying to everything possible.  This is insane, I’ve never seen the unemployment pool so over saturated.\nTypically if I get a face to face interview I get the fucking job, I’ve been on SEVEN interviews.  Usually they have been ending on “we have a few more interviews but we will contact you” like WHAT!?  The best candidate is right fucking here…\nDemoralized as fuck. Rent was paid up until now but I was fully expecting to be working within a month\nI want to fucking work I want to bust my ass for minimum wage fucking LET ME LIVE. I’m fucking done. I thought just scraping by was bad but not being able to buy a can of soda I’m literally worthless. No worries though snap re ups in 2 days\nStill gotta steal catfood though ughhh and litter fuck..\n\nYea I have vices and I waste money sometimes but it’s only after my bills are paid and I always try to live within my means which is why I dumped my car for a scooter.\n\nI have 5 years in the cannabis industry. I can outgrow your favorite cultivator but finding someone to give you a chance is near impossible it seems. I grow better shit than 85% of big canna but do they wanna adhere to my strict sops hell naw but that’s what it takes.\n\nThe rest of my xp is all construction from top to bottom. Roofing, framing, demo, tiling, waterproofing etc…I could literally build an entire house alone if you gave me enough time and money. \n\nI’m a hard working person, I was raised on it.  My father told me over and over to never half ass your work and I fucking live by it.  Turns out being the hardest working person in the room makes you the biggest target and threat, my dad left that part out but I get why.  He was a navy guy, retired 26 year master chief.  I’m proud of pops, his work ethic makes sense but it comes with a cost.\n\nThis is rambling and venting at this point, I’ve just had it, I’m at my wits end and needed to vent about this horrible job market. Thanks ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1mefytu/live_dtla_desperate_for_work/",
      "comments": []
    },
    {
      "title": "I have a final interview tomorrow and am having major brain fog even though I need to study and retain info. How do I snap out of this ASAP?",
      "body": "Basically, title - I’m feeling like I can’t focus, and I’m honestly feeling somewhat shaky too. I’ve tried to eat and hydrate and I’m still exhausted. It’s after 8 PM where I live so I don’t want to drink an energy drink, but I feel like I might have to because I feel so off. Please help!!\n\nETA: yes I am nervous about the interview even though I know if I learn this info I will most likely nail it. I honestly just feel off and it’s really difficult to explain",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/t96hj1/i_have_a_final_interview_tomorrow_and_am_having/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Have you been trying to focus too long or are you too nervous? It might help to go for a walk/run or get another kind of workout in to focus on something totally different for a while.",
          "score": 1
        }
      ]
    },
    {
      "title": "Really beginning to feel scared today. Yet another rejection for a position I’m more than qualified for.",
      "body": "I am a very qualified candidate with a clean record, performed highly in my last role, and look good on paper for the jobs I’m applying for. Today marks three months since I quit a job that was destroying me inside. In this time, I’ve applied to at least like 50-75 jobs, resulting in 7 final round interviews. Ive left most of them feeling like it went well. The answers I gave during these interviews were for the most part clear concise and applicable, following the STAR format to a tee. I’m confident of that because of how few probing questions my answers seem to provoke. This morning I opened my email to see that, yet again, I have not been selected to fill the role I most recently interviewed for. I genuinely do not know why I’m not getting offers. Based on past experience, I know the difference between when an interview went well and when it went poorly. But now, I am just so confused about what I’m not providing. For the first time today, I’m really feeling scared that I won’t get a job with the salary and benefits I need.\n\nEdit: Also, I wanted to run this past anyone who reads this post. Obviously, when you quit a job it’s going to be the elephant in the room when you begin interviewing for a new one. When asked why I left my old company, I reply with a brief history of my time spent there that basically culminates with “My ambition was to learn a new part of the business after performing well in the same department/same role for 2.5 years. However, it became apparent this was not going to happen in a manner that aligned with my own personal and professional goals, and I did not believe I was going to make much more progress in my current role. Therefore, I decided to explore opportunities outside of the company.” This is an honest accurate answer, but I have suspicion that it is not being received well. Does anyone have any feedback on this?\n\nEdit: This is an unbelievably supportive sub! I am first time poster, but your well measured advice and encouragement has completely snapped me out of my pity party today. Thank you so much everyone.",
      "subreddit": "jobs",
      "score": 362,
      "url": "https://reddit.com/r/jobs/comments/bayl3y/really_beginning_to_feel_scared_today_yet_another/",
      "comments": [
        {
          "body": "Honestly, the fact that you've been in 7 final round interviews indicates that you're a really really strong candidate and it's only a matter of time before you get an offer. Weak candidates do not consistently get to that stage. You *will* get something soon.\n\nI know that's not easy to hear when you don't have the offer - but you're so close. When it comes down to final interviews, it's really just picking between two or three really awesome candidates so you're likely just being beaten by a hair. \n\nI'd keep practicing your interviews so you can boost your confidence and hopefully fine tune your examples to really push you over the edge.",
          "score": 402
        },
        {
          "body": "Keep on trucking. I applied for over 550 positions in the past 2.5 months resulting in 9 final onsites and finally 2 offers.\n\nIt's a numbers game. You'll get there.",
          "score": 89
        },
        {
          "body": "I have been in your position and so have many others. I struggled last year in finding a job and probably applied to a whole more jobs than you.  Getting 7 final round interviews is extremely good and I can tell you are must be a great candidate.  You just need to keep going at it and a job will finally click.  Trust me.   It will be a much better job than the others ones you got rejected at.  Just keep going and don't let the rejections affect you.  That's normal and happens to everyone.  Maybe a little bit of advice on the interview process - don't sound so rehearsed when you are doing the STAR thing.  Try to go that extra step and bond with the interviewer, smile more, try to click with them.  Make yourself a good person to be around.  Ask questions that are out of the box and maybe suggest ways you could potentially improve what they are doing currently.",
          "score": 32
        }
      ]
    },
    {
      "title": "Are you kidding me?  Assessments!",
      "body": "Was laid of 08/18/2025 due to a 10% reduction in force.  Gave 7 years of my life to that company.  Have been trying to hold everything together.  Have applied to thousands of jobs. \n\nSo sick and tired of having to correct my incorrectly parsed resume on company websites.  Almost like manually entering your damn resume EACH AND EVERY TIME!\n\nSo sick and tired of not knowing, \"hey, is my resume gonna reach human eyes or not\".\n\nSo sick and tired of the rejection letters.  Can't even get a damn interview!\n\nAnd what really frosts my shorts (lol), these damn assessment tests.\n\nThe one below wants me to spend 82 minutes of my time so they MIGHT interview me.\n\nScrew you, you pieces of shit.\n\nhttps://preview.redd.it/r2tm5enz5v0g1.png?width=1150&amp;format=png&amp;auto=webp&amp;s=4c6c0b9384aee6926b3b4403fdb26c7de7f82f7a\n\nWhen you have a job, you don't really know/stay informed on how bad the job market is.  It is brutal out here!  It breaks my heart when I hear how many folks have been unemployed for months, if not years.  It's very scary knowing that might be me as well.\n\nUC barely covers my mortgage.  All other expenses are eating through my savings.  I'm so damn lucky that I was chosen for RESEA.  Yay! (Sarcasm) A federal mandate that forces folks on UC to participate in job seeking help.  Okay, I setup the 1st appointment, met with my case worker.  Nice guy, but I received no help.  They gave me a link for PA Careerlink.  Logged in to see that I could apply for jobs there as well.  But, guess what!  All shitty local jobs.  Attended my 2nd mandated appointment (Resume Building Class).  Not one speck of help!  The woman who conducted the class, did not know that you could get AI to help build cover letters and resumes.  Rest of the class started asking ME for help.  I gladly helped them but could not shake the thought of, why I was mandated to attend that class.  What a waste of time!  I'm sure all laid off folks are spending their time, searching for work and doing everything they can to keep the lights on and food on the table.  We're already unbelievably stressed.  Why add more?  Why force us to travel to a Careerlink office, spending gas and time?\n\nThen, just last week, UC contacts me and asks why I missed the RESEA appointments.  I said what?  I did not miss them.  I provided proof.  Apparently I was supposed to set up an appointment prior to 9/29.  Mine was on 10/7.  Due to a technical issue on PA Careerlink, I couldn't see correspondence they sent me on 9/8.  So, my 1st appointment was on 10/7 (8 days after 9/29).  Now these pieces of shit (UC) are stating that I owe them a weeks worth of unemployment.  Are you kidding me?  \n\nIt just NEVER ends!\n\nI am so sick and tired of government bureaucracy!\n\nGovernment shutdown.  Economic disparity!  No EBT for November and possibly more.  Our healthcare premiums doubling, tripling, maybe even quadrupling.  No one cares!\n\nHow the hell did we get here!  42 million Americans can't afford food.  Millions unemployed!\n\nI'm getting tired!  Tired of it all.  I can see now how some folks can just snap or give up, or both!\n\n\n\n\n\n",
      "subreddit": "jobs",
      "score": 15,
      "url": "https://reddit.com/r/jobs/comments/1ovdal8/are_you_kidding_me_assessments/",
      "comments": [
        {
          "body": "It really never ends…I feel this. I can’t get ANYTHING right now, it feels like sabotage across the board.",
          "score": 6
        },
        {
          "body": "Same thing happened to me - 7 years, laid off in July.\n\nBeen sending out resumes every day\n\nI get rejections sometimes a minute later - I'm positive it's AI. Some a day later.\n\nThere were a couple jobs that the job description was literally my resume including the obscure software - I thought I was at least guaranteed an interview - rejected.  \n\nIt's just ridiculous now.",
          "score": 5
        },
        {
          "body": "You're not alone. Sadly, there's a lot of our here dealing with the same BS. It's especially annoying getting an interview with someone you are more qualified than....I wonder why he didn't want to hire his replacement, lol.\n\n\nGood luck and keep the faith something has to happen. It's Christmas, right?",
          "score": 1
        },
        {
          "body": "How did we get here? (i) Supreme Court decision in Citizens United characterizing corporations as persons; (ii) no term limits for sentors/reps.; (ii) No requirement for senate/rep to balance the budget; (iv) Vast Presidential immunity; (v) a sizeable amount of the population who cares more about banning transgenders from sports than the tarrifs. If we don't fix these problems, the American experiment will fail (I still hold hope and will fight for this). For those affluent folks (shout out to my neighbors) who think that things don't effect them, just remember that we live in a connected world.",
          "score": 1
        }
      ]
    },
    {
      "title": "Got a job offer after four months",
      "body": "Wanted to share because I relied on this sub for support after taking some really hard blows during this job hunt. \n\nI was let go from my previous position back at the beginning of February and after exhausting the job market in my small city I decided to take a leap of faith. I needed a big change, so I broke my lease and started arranging a move to a much bigger city where my siblings and their families live using part of a cashed-out 401k (I wanted to avoid the tariff damage so I pulled my money just before the first big announcement.) I spent every weekend in March driving 3.5 hours and crashing on my sister’s couch so I could do in-person interviews and apartment hunt. There were several places where I’d bend over back-wards to do third and fourth round interviews that still ended in rejections, and I’d struggle to sleep at night because I’d be wondering if I was making the right call or heading towards disaster. \n\nA week after my sister moved to a new apartment I got an approval for an application on a place I had looked at just down the street and I signed the lease. Incidentally, the ceiling in the apartment I was living in collapsed due to an ignored leak that I’d been calling maintenance about for months- so I was able to break my lease without having to pay a fine or sublease. I was pulling my dog and an over-stuffed uhaul down to my new apartment when I got a call. One of the companies I’d interviewed with wanted to offer me a dream position at a $10k salary increase from what I was making before with excellent healthcare, schedule, benefits, and structured career advancement. \n\nI had to pull off the side of the highway and cry for a bit after I got off the phone because the immense relief I felt was overwhelming. After all the struggle it didn’t seem possible for things to all just snap into place that easily. I almost feel a sort of survivor’s guilt because I’ve seen so many posts from incredibly funny, smart and talented people who have been on the hunt for much longer than I have and worked much harder with less results. If you’re one of those people, then know I am sending you the best of luck and I hope you find the same or even more success than I did. Keep going, and you will get there! \n\nThat’s all, just wanted to spread some hope and positivity. \n",
      "subreddit": "jobs",
      "score": 59,
      "url": "https://reddit.com/r/jobs/comments/1k5p2qt/got_a_job_offer_after_four_months/",
      "comments": [
        {
          "body": "Congratulations and thanks for sharing your story!\n\nI was laid off in November, got an offer in April after multiple interviews that averaged 3-4 rounds. It's tough out there. Hang in there people!",
          "score": 7
        },
        {
          "body": "Wow! Talk about resilience! Congratulations!",
          "score": 5
        },
        {
          "body": "Congrats!! Thanks for sharing. It was inspiring to read. I left a stable job for a not so stable fun job with big rewards. I took a gamble and so far it hasn't paid off. I am back to looking. Been rejected multiple times from some that really hurt. I know something is coming. It is a matter of time.",
          "score": 3
        },
        {
          "body": "Congrats!",
          "score": 3
        },
        {
          "body": "Happy for you",
          "score": 3
        },
        {
          "body": "Congrats 🎉🎉🎉",
          "score": 3
        },
        {
          "body": "Congrats OP! I wish you a fresh start and much happiness and success ahead!",
          "score": 2
        }
      ]
    },
    {
      "title": "What am I lacking?",
      "body": "Hi, so I do adjust my resume slightly to fit the job I apply for, but I'm not sure what to do because I know my resume is nowhere near perfect. I've had another gap of employment due to setting moral boundries and dealing with a unrealistic standard for employees \"absenteeism\". I've applied to over 100 jobs since December, went in person, got second interviews, followed up, and still nothing. (Advice for interviews would be great too if that's availble to yall.)\n\nIt's quite disheartening. Especially, since I've had to sell sentimental belongings afford the cost of living. I'm doing my best to stay afloat by going to food shelves and no unnecessary spending. I plan on reapplying for snap for the time being, but that's beside the point. Any direction for my resume and advice for interviews is appreciated.\n\nTldr: I've been job hunting for almost 5 months. Please give any advice for interviews and/or my resume. Thank you.",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/1jqo2wx/what_am_i_lacking/",
      "comments": [
        {
          "body": "1. A current job\n\n2. A recent job where you lasted more than a few months\n\nYour big issue is you need to communicate reliability in your interviews. You need to show that you’ll walk on the job and be productive and easy to manage on day 1. This is going to be tough because your work history shows the opposite, that you get jobs and quit them for similar jobs very quickly, sometimes with long gaps in between.",
          "score": 4
        },
        {
          "body": "Unfortunately, you won't be able to do much with your resume beyond lying, which will backfire. It sounds like you have had interviews, so focus there. You must sell yourself as reliable, committed to being punctual, and hard-working. DO NOT say anything negative about your former employers  like this: \"setting moral boundries and dealing with a unrealistic standard for employees \"absenteeism.\" Come up with another reason for not being employed.",
          "score": 3
        },
        {
          "body": "One thing is, you want to make bullet points that consist of accomplishments rather than responsibilities. People hire based on narratives, you want to construct a narrative that fits with the narrative they have for who they're hiring. \n\nI would also try to get to know other autistic people in your area, who might be able to connect you with opportunities or give you more personalized advice. \n\n\"due to setting moral boundries and dealing with a unrealistic standard for employees 'absenteeism'\"\n\nI'm also on the spectrum, I want you to know this comes off as worrying. It makes it sound like you called out all the time, that you just left for hours at a time. It makes it sound like you had unreasonable moral boundaries like \"I won't work with anyone who wears leather.\" \n\nYou are getting lots of interviews, which is great! Something you are saying in those interviews is sabotaging you. Maybe post some sample answers you've given to questions. \n\nYou want to keep responses on why you left brief, positive. I would recommend looking into DBT therapy principles, applying some of those, and framing your previous history as because of health or personal issues.",
          "score": 3
        },
        {
          "body": "I'll try not to be to harsh, but my first impression of you is of someone I wouldn't hire. \n\nThe definition of absenteeism is the practice of regularly staying away from work or school without good reason. I'm curious what those unrealistic standards were of your employer that made you set a boundary. Like maybe I am misunderstanding, but you need to show up for work. You can't just come and go as you please without consequences. \n\nYou also haven't held a job more than a year. Which ok, moving jobs is sometimes needed, but usually due to a move or career advancement. You seem to just bouncing around for the sake of bouncing around.   \n  \nYour  bullet points are as basic as can be. Like an event captain who delivered experiences at an event. No way, would have never had thought that.   \n  \nI think your best bet is to...  \n  \n1.) Google job resumes and templates and redo the organization and flow of yours. No where on google will you find one laid out like yours.  \n2.) Remove jobs and lie about how long you were there. Ensure your references know they are references so the can back up your story.  \n3.) When you look at 1, look how they formatted and talked about their bullet points. Emphasize projects, goals, and objectives, not basic tasks  \n4.) A lot of job screening is with computers. Ensure you are using keywords from posting in your resume.   \n5.) Based on current resume, you are applying to labor intensive jobs at retail places (resturants, coffee, events). Dont be afraid to walk it in person. May not be normal in today's society, but you'll stand out and at least ensure they received it.",
          "score": 2
        },
        {
          "body": "Like others - I will try not to sound too harsh and i'll try not to repeat the other very good advice others have said, so I'll just add:\n\n1. Your resume needs to be one page; with your experience and level, anything beyond one page is too much\n\n2. You need to clean up your skills. In no way should \"crisis intervention\" and \"barista\" be listed as skills on the same resume. (I would also say \"barista\" is a past job title and not really a skill; additionally \"crisis intervention\" is a HUGE skill to claim to have and you should ensure you're able to back that up with education and/or credentials)\n\n3. List your education last. You don't have a degree from an Ivy, so put it on the bottom",
          "score": 2
        },
        {
          "body": "Here are some accomplishments you could mention as a barista, since I mentioned that. Don't say \"prioritizing customer service\" say that you had 10 regular customers who knew you by name. Talk about specific cleanliness standards you kept up, say what the store's sanitation score was, say what specific standards you cleaned to. You want to differentiate yourself and create a narrative. \n\nIt's okay to embellish a little.",
          "score": 1
        }
      ]
    },
    {
      "title": "So I finally got a real job. And to be honest, it's bullshit.",
      "body": "Don't get me wrong, it's a wonderful company to work for and the people there are great. This isn't a complaint against the company or folks that it employs.\n\nInstead, this is a complaint against the situation in general. I know it's hard out there, and for a solid year and a half after graduating college I honestly looked for a job. For 20-30 hours per week I looked for a 'real' job; that is, one that employed my skills and interests. Sure, I could work at McDonalds or at a shitty sales job, but then I got an offer as a part time at a place I might actually enjoy working at. which I both accepted and am grateful for.\n\nBut I still looked for full-time, \"big-boy\" employment. Now, another company offered me a temp position, because they had lots of meetings to attend to this past spring, and they even acquired a small company. As such, they needed some extra help. So I started helping out removing staples and scanning 600 documents a day. I can't complain; they pay well, and again, everyone is super nice.\n\nOver the last week I was interviewed for, offered, and accepted a full time position with a title and responsibilities. I am grateful for this, but it still nags me that it couldn't be done without one thing.\n\nI know the owner. I have for 15 years or so. We're family friends. I would never have been offered a temp/intern position without this fact. I'm eternally appreciative of the opportunity, and nothing will detract from this.\n\nBut what kind of bullshit is this, that today, the only job one can get that is even somewhat consummate with his experience and education,  is one in which he is family friends with the owner? I'm so bent that I applied to, and interviewed with, dozens of other potential employers, when I could have just asked my old friend and got a job in a snap.\n\nThe other posters on here aren't blowing smoke. It's all about who you know. Trust me, I wish it wasn't, but that's the way it is now.\n",
      "subreddit": "jobs",
      "score": 242,
      "url": "https://reddit.com/r/jobs/comments/6hs43b/so_i_finally_got_a_real_job_and_to_be_honest_its/",
      "comments": [
        {
          "body": "When I was in college and someone told me \"It's not what you know it's who you know\" I thought they were saying that it's okay if you're not top of your class, you can still get a job through your network.\n\nNow, I know that it means it really doesn't matter what your grades are, that even if you have &gt;3.8 you still need to network to get that good job.",
          "score": 70
        },
        {
          "body": "It's not entirely true: the problem is, right now you've got nothing to offer over anyone else, so who you know is a big enough factor to make a difference.\n\nBut ten years down the track, if you've specialised in a career, picked some good supporting skills to develop, and you can put a good resume / career profile together that stands you apart from the pack, who you know doesn't matter so much--it might help, but you can get by fine without it. I get approached on LinkedIn about once or twice a week for job positions--I don't know anyone at the companies, it's my experience and skills that they're looking for.",
          "score": 90
        },
        {
          "body": "\"But what kind of bullshit is this, that today, the only job one can get that is even somewhat consummate with his experience and education, is one in which he is family friends with the owner? I'm so bent that I applied to, and interviewed with, dozens of other potential employers, when I could have just asked my old friend and got a job in a snap.\" \n\nLiterally every person I know who has a great career was personally handed that first great position - often completely unrelated to their major - by a family friend. Yes, it is bullshit. Frankly it's horrible. It's not that that's unfair, but 90% of us do not have that. (I wish you no ill.) \n\nWhat's worse, if you're not hustling to make those \"friends\" yourself in your own college networks or internships, you're completely fucked. This is on top of still likely needing the degree to impress them and *some* experience, but...yeah. You have to be the sort of person powerful are literally willing to look at and give a chance even to get desired experience. \n\n",
          "score": 28
        },
        {
          "body": "&gt; It's all about who you know.\n\nGlad I know Javascript, PHP, HTML and CSS.",
          "score": 11
        },
        {
          "body": "&gt;The other posters on here aren't blowing smoke. It's all about who you know. Trust me, I wish it wasn't, but that's the way it is now.\n\nEh, I only partially agree with this. Networking can get you an interview but it rarely guarantees you a job. ",
          "score": 23
        }
      ]
    },
    {
      "title": "advice please",
      "body": "So my fiance and i were both interviewed, trained and hired by someone at one of multiple locations of a specific shop. We were told by three different people, two identifying as being in authority, told us the shop we would be working at was lacking people and had tons of available hours. The big boss finally ran a meeting where we met him the first time after days of waiting to hear about our schedule, where he told us in the meeting he guarantees at least 50. He then tells me the schedule starts sunday. Schedule comes out, me and my fiance have 32 hours combined. There was a girl in the meeting stating she needs her 40. the schedule comes out, she has 48 and we have 32 combined. We keep getting snapped at and blamed for believing our “hiring managers” for 5 days straight. I told him we have a 5 month old infant and bills that need to be paid and need clarification on the hours we will be working. He will not give a straight answer, just keeps saying it will be difficult and he will try his best. i find this very disrespectful like he has no respect for us being adults with bills and a baby like our time means nothing to him.\nWe really want this job. I even offered to work part time and my fiance works full time elsewhere and he responses “I’ll give you both as much as I can” which is not clarification nor reassurance. I’m incredibly stressed. We have due dates for bills and don’t have the time to wait weeks to see how the schedules come out. I find this so unprofessional.\nand why are we being blamed for people promising us stuff and not the one that promised these things? He seems very hostile and a co worker i mentioned in the beginning started arguing so he turned off the chat. I’m incredibly frustrated but we really want this specific job. We just don’t know how to word our concerns or feelings without sound disrespectful and he seems very easy to piss off. any advice?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1meojpd/advice_please/",
      "comments": []
    },
    {
      "title": "Laid off in Jan 2025. Job searching fatigued!",
      "body": "***Ok, this is a long post, so please bear with me.*** \n\nI was part of the massive layoffs at USAID back in January. I started as an Administrative Assistant, then got promoted to Program Assistant, and in 2023, I took on an Analyst role in one of the Global Health sector's teams. I'm a native Portuguese speaker and hold an Associate's Degree in Communications. My professional background focuses on Operations and Management, with some HR support, primarily for HQ staff. However, my most recent team provided substantial mission-focused support, which even gave me the opportunity to facilitate travel for on-site support. I was happily employed and not looking to leave for another job at all when I was laid off due to Executive orders. \n\nFast forwarding to today: I had a part-time job as a cashier at a grocery store even before the layoff, I have been collecting unemployment, and I got approved for SNAP benefits. So, on the financial side, things haven't been that bad, and I know how incredibly blessed I am.  Some days, I don't even feel like myself. I'm in therapy weekly, and that has been extremely helpful.  DC is known for having numerous job opportunities, but it still feels like I can't reach any of them.\n\n*What worries me is feeling like I'm \"forgetting my skills\" and having way too much free time on my hands because nothing I do seems to fill the void of not having a full-time schedule like I used to. I've been applying for multiple positions. Although I'm no longer considered entry-level, I've decided to be flexible and apply for those as well. I haven't gotten a single interview, and it's making me feel anxious, worried, and even desperate.*  \n\nI'm considering transferring my skills to the Cybersecurity world (obtaining certifications) because the International Development field is pretty much \"dead\"; many nonprofits have shut down programs. \n\n  \nHave others who were laid off or have been job searching had similar experiences? ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1l201oo/laid_off_in_jan_2025_job_searching_fatigued/",
      "comments": [
        {
          "body": "I was an assistant too, for different agency, not as well-funded as USAID. I got laid off in Sep 2024. I've experienced the same \"forgetting skills\" feeling. In my case, I can fall back to my specialty, which is in IT. With so much political changes and uncertainty, but I choose to be hopeful, that new opportunity will come around. For that is the reason, I pick myself up in the morning, can't afford to give up.",
          "score": 1
        }
      ]
    },
    {
      "title": "Do I call a job a third time if I’ve still gotten no answer?",
      "body": "Hey so I’m struggling to find a job right now. I’ve applied to a bunch of places, but live in a college town where jobs get snatched up at the snap of a finger. \n\nI’m currently waiting on one job for a department store to see if I can score an interview— I went in person to give them a resume about 3 weeks ago and applied online the same day, called 2 weeks ago only to hear their hiring manager wasn’t on shift until the following Monday, and called this Monday only to have to leave a message because she was in a meeting. \n\nI’ve still gotten no response. I’ve applied elsewhere of course but I REALLY want this job. It’s something I can see myself managing, but I don’t know what to do. Would it be appropriate for me to call again? ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1ktrsy5/do_i_call_a_job_a_third_time_if_ive_still_gotten/",
      "comments": [
        {
          "body": "Keep calling or visiting. They will either like your initiative or get annoyed with you. If you don’t, someone else may show up at the right time and get your job. Waiting does not work.",
          "score": 3
        }
      ]
    },
    {
      "title": "Quit my job but I can’t tell if it was a mistake",
      "body": "So a few weeks back I found out that a few people that were under me (and that I trained) were moving up to a position that I have been working towards for a few months now. I’ve been working here a little over a year now and it’s the first job I got out of college. As soon as I found out I held a meeting with my boss and lead and was told “promotions are based off of what we need not merit”. The conversation stopped there for me because this wasn’t in line with what they have been telling me for months. \n\nThen I started to think about all of the shit my boss has put me through like working 60+ hour weeks, leaving me to handle workloads that require 3 people, denying PTO for no good reason, using threats to “keep me in line”, using me as a scapegoat for others mistakes, and so much more. I’ll also add that I have never been written up, my performance reviews are great, I have never been tardy, and I have only called off when I had covid.\n\nSo the entire situation was a huge slap in my face and something inside me just snapped. It kind of feels like I wasted a year on this place and got nothing in return except broken confidence and a strained relationship with family and friends. \n\nI put in my two weeks after thinking about it for a week and my boss then came back around and said “well we were gonna have a meeting with you next week to tell you that your promotion was approved”. I may be in the wrong for thinking this but if it was genuine then I truly should’ve gotten promoted first.\n\nBut now that I’m in my exit phase, I can’t help but feel like I regret leaving because I sincerely love my team that I work with. It’s hard to imagine finding a place with young coworkers like this who I’ve genuinely connected with. I only say this because as I continue to interview, majority of the teams are nowhere near my age.\n\nEdit: Thank you for everyone essentially confirming why I finally quit in the first place! I definitely am not going to go back on my word because this place ultimately has ruined my perception of what I deserve. That being said I’ve been on the job hunt for months prior to all of this happening and I still haven’t had luck. That is really the only reason I feel like quitting on a whim was a mistake..I’m not sure how long it’ll be until I find another job.",
      "subreddit": "jobs",
      "score": 42,
      "url": "https://reddit.com/r/jobs/comments/10skcoy/quit_my_job_but_i_cant_tell_if_it_was_a_mistake/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Sounds like your boss is a manipulator and they would have bled you out before eventually showing you the door.",
          "score": 67
        },
        {
          "body": "Honestly I don’t believe your boss saying that you were having a promotion. He probably realized he screwed up when you said you were leaving and is attempting you to stay by saying that there was a “promotion” when there really isn’t one as a way to guilt trip you.",
          "score": 50
        },
        {
          "body": "Never regret quitting a toxic job.",
          "score": 25
        },
        {
          "body": "All of these comments are accurate.  \n\n1. Never take a retention offer for a variety of reasons. The aspects you don’t like about the job will still exist, but now your coworkers and superiors may see you as less dedicated and therefore less deserving of investment (future raises, promotions).  \n2. They knew your worth and what they valued you at before you put your notice in. Often, if you’re really apt in your position, they don’t want to promote you for that reason alone. They’d rather keep you doing what you already do well for cheap.\n3. After knowing both the first and second points, you can’t unknow them if you choose to stay. Most importantly with choosing to stay, likely YOU will feel resentment toward them and it will eventually affect every aspect of your life even outside of work, mentally and even physically. You may become complacent and stagnant in your growth by their design or your own demoralization.  \n  \nThis is the first job you got out of college. Give yourself a chance to use the credentials you worked so hard for to work for you now! Take the experience from this position, and land a better one. Don’t accept a position’s first compensation offer. Believe in yourself.  \nSomeone once told me companies are rocking the 24/24 strategy. Hire 24 year olds at 24k and work them until burn out. Rinse and repeat.  \nIn the end, this is just business. They’re looking out for their own bottom dollar so you look out for yours too. Be professional during your final 2 weeks and don’t lose your integrity because you’ve now seen they don’t have any. You’re above this job. Glad you’ve finally noticed!",
          "score": 35
        },
        {
          "body": "&gt;my boss then came back around and said “well we were gonna have a meeting with you next week to tell you that your promotion was approved”. I may be in the wrong for thinking this but if it was genuine then I truly should’ve gotten promoted first\n\nYeah, that was not genuine. Your gut feeling was right.",
          "score": 15
        },
        {
          "body": "Walk out and don't look back. You'll find something better.",
          "score": 12
        },
        {
          "body": "Promotions aren’t based on merit 🚩",
          "score": 11
        },
        {
          "body": "I’d rather be unemployed than stay at a toxic workplace. You can always find another job, I know it sounds cringey but your mental and physical health is more important than a paycheck.",
          "score": 7
        },
        {
          "body": "&gt;my boss then came back around and said “well we were gonna have a meeting with you next week to tell you that your promotion was approved”. \n\nGaslighting. If that didn't come up in the meeting it was never the plan. Had they sent a meeting request? They lied to you for months about merit promotions, implying you didn't deserve one, then the moment you quit they were about to promote you? Bullshit. \n\n&gt;I sincerely love my team that I work with. It’s hard to imagine finding a place with young coworkers like this who I’ve genuinely connected with.\n\nYou will never hear from them again after you leave.",
          "score": 8
        }
      ]
    },
    {
      "title": "3 months in - about to quit",
      "body": "This is gonna be long but I really need some advise. \n\nIn December 2023, I was let go from a very high paying job because of budget cuts. Got unemployment, exhausted my benefits, father helped me for 5 months, then I was hired on this last December with a temporary staffing agency. I’m a recruiter by the way. \n\nSo during the interview, she didn’t really let on that I would have a big role in bringing in business (selling candidates to clients in order to get new job orders).  We talked about her role since she bought the business (it’s a franchise) and how she is 100% sales. I mentioned that I do not envy her and talked about how sales is not my strong point. It creates a great deal of anxiety for me, I don’t like it, I’m not good at it and I don’t want to do it. I didn’t go to school for an HR degree so I can be a sales person. The quota the company sets for each person in the office is unreachable. But the bottom line is, I DO NOT WANT TO DO SALES. \n\nSo we have a morning and afternoon meeting and at every meeting, she wants to know how many sales calls I’ve done. It’s always not a good feeling because I have to tell her I only made 5 or 6 calls and then she wants to know why I didn’t do more so I give her some bullshit reason why. But honestly it’s because the anxiety is too much. \n\nSo this is 1 reason I’m about to quit. The 2nd reason is because I recently had a day where I underperformed compared to my usual.  I’m always very on top of things, but on this day, I wasn’t. Her demeanor has completely changed to the point where I feel uncomfortable being there. I’m getting the cold shoulder from her for 1 bad day I had. Forget the days I worked for free over the weekend or after work. Forget the nights I spent texting with her to brainstorm ideas. Now I’m a horrible employee because I had 1 bad day. \n\nI’m about 2 seconds away from texting her and telling her I’m not doing these sales calls anymore. She will fire me. But not until she hires someone else. But then I can draw unemployment again. In Texas, you can be fired and get unemployment for any reason as long as it’s not because of misconduct. \n\nI need advice. I cannot deal with this woman for very long. I’m not sleeping well and I constantly feel like I’m gonna snap.  She barely pays me a livable wage. It’s definitely not enough to put up with her disrespect and unprofessional attitude. ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1j2z2r5/3_months_in_about_to_quit/",
      "comments": [
        {
          "body": "If you're a recruiter, consider posting this in r/recruiting . They might give you a lot more industry-specific advice.\n\nBut overall, I think we all know the market is fucking rough right now. But obviously your mental health is important. Do you have savings? Imagine your self for 20 seconds that you already made the decision and got fired. Really think about it. How do you feel? Was it a bad call, or was it the right move?\n\nIs there anything you can do to temporarily improve the situation while you look for a different job (to secure it before jumping ship)?",
          "score": 1
        },
        {
          "body": "Be upfront, tell her you were not interested in sales, and you are not interested in continuing sales, and you are not willing to continue with the sales calls, as that was not what you were hired for. If she gives any shit to you that makes the workplace hostile, quit. You can still get unemployment if you quit because of a hostile workplace.",
          "score": 0
        }
      ]
    },
    {
      "title": "I applied to about 60 jobs over the weekend after getting a soul-crushing rejection.",
      "body": "I started at 8 AM on Saturday and didn't stop until Sunday night. That's about 32 hours with almost no breaks. Last week, I had reached the final round for my dream job.\n\nI did three interviews, a skills assessment, and even had coffee with the team lead. They told me I was a \"perfect fit for their culture\" and that I was \"technically very strong.\"Then I got the generic rejection email saying they \"have decided to move forward with another candidate whose qualifications better meet their needs at this time.\" No feedback, no explanation, even though I sent a very polite follow-up asking for any constructive criticism. So I snapped.\n\nI literally applied to every single job related to my field that I came across, tailored cover letters for about 30 of them, and used every job board you can imagine. And now I already have two phone screenings scheduled. Sometimes, when you're really backed into a corner, it's quantity, not quality, that gets the job done.\n\nEdit: I will briefly tell you what I did, maybe I can help someone in my same situation.\n\n\n\nI started by tailoring my resume for most similar jobs and made organized folders, each containing a professional, ATS-system-compatible resume. Of course, AI helped me, but just take assistance from it and write things in your own style, this is the most important thing, and the name of the site is [resumekit](https://resumekit.interviewhammer.com/) .\n\n\n\nI started by compiling the sites I will apply on: Indeed, Glassdoor, LinkedIn, but by typing a job in the search and selecting the \"posts\" tab, not \"jobs.\"I practiced for interview questions with r/ChatGPT and r/interviewhammer  helped me in answering the questions.\n\nThank you for your advice in the comments, I will add it to my notes, and thank you for the encouragement.",
      "subreddit": "interviews",
      "score": 1308,
      "url": "https://reddit.com/r/interviews/comments/1n50yl7/i_applied_to_about_60_jobs_over_the_weekend_after/",
      "comments": [
        {
          "body": "Ngl rage applying is how I got my last job.",
          "score": 73
        },
        {
          "body": "Good for you. Whoever ends up hiring you is gonna get a ferocious bulldog 😤",
          "score": 126
        },
        {
          "body": "I also got a soul crushing rejection on Friday! We will find something better!",
          "score": 46
        },
        {
          "body": "It's numbers game,plain and simple. I just stop counting the \"hard decision given the strength you demonstrated\" and have applied to every job that fits my profile",
          "score": 51
        },
        {
          "body": "I experienced basically the same thing recently. And yeah, I’m at the point where I’m sending out ~100 applications per week. \n\nCan I ask you, are you getting requests for phone screenings by email? Is that typically how the companies are reaching out first? \n\nA lot of these applications now are asking for permission to text, so I am curious how many companies are actually texting or calling for first contact rather than emailing. \n\nI’m on a vacation out of the country so I have my cell service on pause. I’m worried that I may be missing out on some opportunities if they aren’t emailing me.",
          "score": 15
        }
      ]
    },
    {
      "title": "I was honest that I didn't want the job, and the manager called me specifically to yell at me",
      "body": "About four months ago, I received an offer that looked great on paper. A recruiter from this company contacted me; I didn't apply. But honestly, I wasn't very interested, and after the first call, my gut told me this place wasn't for me. So I decided not to proceed and didn't send the documents they requested.\n\nAnyway, fast forward to this morning, I suddenly got a call from one of the managers there. He said he was calling because my file was incomplete and wanted to know what happened. I was honestly very surprised. I thought they had moved on from this after I stopped responding to the recruiter and didn't send my documents for months.\n\nAgainst my better judgment, I called him back, telling myself to be professional and not burn bridges. As soon as I spoke to him, he immediately asked why I hadn't sent the documents. I gave a polite and vague response, telling him I had a personal issue that made me miss the deadline. He didn't buy it at all and kept pushing, saying things like, 'No, there must be something else. Did our recruiter say something that upset you?'. He was so insistent that I finally just gave it to him straight. I told him that besides missing the deadline, I honestly didn't see myself as the right fit for the job, and that there were surely other candidates more passionate about the field than I was.\n\nAnd that's when he completely flipped. He told me my opinion was worthless, accused me of making things up, and said he regretted ever seeing my CV. Then he laid into me, telling me I was 'wasted talent' and that I should be 'lucky they even graced me with a call'. After some more of this, he told me he would blacklist me in the entire industry and that I would never find a job in this field again. He even started listing their partner companies from which I was now supposedly banned, before slamming the phone down on me.  \n  \n Edit: thanks to people for the replies. I really appreciate everyone’s input. I am scared to say the company's or the guy's name since he seems to be too quick to snap and retaliate. I am considering filing a complaint, but I am unsure if it’s worth it.\n\nAs for my reason for turning down their offer, I truly didn’t feel like I fit the job at all, and I started searching for another [suitable job](https://www.reddit.com/r/InterviewCoderPro/comments/1nyr5ts/a_friendly_reminder_that_job_hopping_is_how_you/) for me. I have actually been searching for a suitable job for many months. And I did actually miss the deadline for applications. To those saying I should have declined more “formally and politely” if there’s no application to look at, they shouldn’t even have been an offer or call, and it doesn’t excuse how this man talked down to me.",
      "subreddit": "interviews",
      "score": 205,
      "url": "https://reddit.com/r/interviews/comments/1o6k1di/i_was_honest_that_i_didnt_want_the_job_and_the/",
      "comments": [
        {
          "body": "\"Then he laid into me,\"  LMAO hilarious.  anyway, you dont owe these turkeys anything and fuck that guy.  Lesson learned, better to not answer the phone.  I know this is less of an option if you are looking for work.",
          "score": 51
        },
        {
          "body": "Why didn’t you express the lack of interest instead of going silent? They probably turned away the next best candidate with no response from you that you aren’t pursuing? \nThe bridge was already burned before they called you.",
          "score": 138
        },
        {
          "body": "Sounds like you dodged a bullet there. If I was you - leave a review about it on Glassdoor or something. That is so inappropriate on so many levels and it's a good thing you decided to not pursue that.",
          "score": 15
        },
        {
          "body": "i would have just said “oh i decided the job wasn’t the right fit and stopped the process. Apologies for not communicating that better at the time. That’s on me not your recruiter they were fine. Anyway, i have a meeting, good luck to you and the firm”\n\nthen hang up",
          "score": 14
        },
        {
          "body": "He wanted you to tell him it was the recruiter fault, properly so they could not pay for part or all of the service.",
          "score": 8
        },
        {
          "body": "What is wrong with him. Nobgrace at all in handling a rejection when he probably rejects multiple candidates every time with no reason at all.",
          "score": 14
        },
        {
          "body": "lol, I have been in a few similar situations (not exactly the same) and a \"Brother, you called ME\" usually shuts them up",
          "score": 12
        }
      ]
    },
    {
      "title": "My interview anxiety is so bad I literally hung up mid-interview. How do I stop sabotaging myself?",
      "body": "Hi everyone, I'm looking for new strategies to manage SEVERE interview anxiety. \n\nThis isn't just being a bit nervous before it starts, I'm talking about completely debilitating panic, trembling, stomach issues the day of (sorry if that's TMI), obsessing over nothing except the interview for days before and even after, everything you can imagine.\n\n It got so bad that during a Zoom interview a few months back, I panicked so hard when they asked me something that I couldn't come up with an answer fast enough, so I literally just disconnected and never reached out again. My brain goes totally blank and I can't snap myself out of it to form a coherent response. I just end up rambling a bunch of nonsense that makes no sense.\n\nI'm seeing a therapist and working on this, but I've been out of work for 4 months now and financially I really NEED to land something quickly. I've also been on several different antidepressants and anti-anxiety medications but none of them actually seem to make a difference.\n\nI've tried telling myself that it really IS just a normal conversation, and I've done the \"what's the worst/best case scenario\" exercise, but I just can't internalize it or actually believe it.\n\nIt feels like I'll never be mentally ready to nail an interview where I'm completely relaxed, self-assured and competent. So any advice, techniques, or suggestions would be incredibly helpful. Thanks so much, and please keep the comments supportive.",
      "subreddit": "interviews",
      "score": 77,
      "url": "https://reddit.com/r/interviews/comments/1osr3tf/my_interview_anxiety_is_so_bad_i_literally_hung/",
      "comments": [
        {
          "body": "I usually approach interviews with the mindset that I’m there to have a conversation about a job opportunity and to learn about the company, i.e., not just to be interviewed. I also like to think that the recruiter is on my side and that they want me to succeed. If they’re interviewing you, it means they already find you an interesting candidate so well done on landing interviews! And super well done on exposing yourself to a situation you find stressful. You’ve got this!\n\nWould it help to ease the atmosphere if you told the recruiter that the interview means a lot to you and that you’re really nervous about doing well? You can also frame it as something you are working on as companies usually ask about biggest strengths/weaknesses. If you freeze up during a question, could you ask if you can get back to them in writing to better formulate your thoughts? I find that in a lot of interviews they ask more or less the same questions so you can also prep by writing down your answers to questions they are likely to ask.",
          "score": 19
        },
        {
          "body": "I feel your pain, I've had the same issue. Anxiety meds just made me foggy and lose my train of thought during interviews, which made it worse.\n\nWhat helped me was writing out responses to common questions (behavioral, situational, \"why should we hire you\") and putting them on foam boards from Walmart. I'd place them strategically behind my laptop so when they ask something, I act like I'm thinking but I'm actually reading my cheat sheet to jog my memory.\n\nI also used interview simulation sites like Chatvisor to practice mock interviews and review how I came across. Did it over and over until I felt comfortable with my answers and didn't blank as much.\n\nYou're not alone in this. Keep working at it.",
          "score": 19
        },
        {
          "body": "I’m exactly the same! I find it helps a little if I feel prepared so I tend to go through the person specification on the application and write down scenarios that show I have skills/experience in those areas. I still get really anxious though. Hoping someone can offer advice here./",
          "score": 4
        },
        {
          "body": "In terms of preparation, here is my warm advice. Try Interviewly.me for practice, as it simulates real-life interviews. Just paste the job link, job description or upload your resume, and it will generate tailored questions to the role (behavioral, technical, situational, etc).\n\nhttps://www.interviewly.me\n\nAnother great thing is that you'll get immediate feedback on each response during an interview session, with suggested example of an optimal answer (depending on the evaluation), as well as full analysis report of every completed interview. You will have performance analytics over time, to see where you're at with tech and soft skills, and what are your strenghts and development areas, as well as an option to choose a specific skill to practice and focus on.\n\nIt can contribuite a lot to building confidence around the position, unlock some questions you haven't thought about and guide you through your professional development. Basically, it helps both with short-term and long-term preparation, depending on what you need.\n\nI truly hope it helps! Let me know if you have any questions 🙂",
          "score": 4
        },
        {
          "body": "Completely understand, I’m neurodivergent. \n\nLavender pills, its a natural over the counter herbal supplement. It calms the nerves and you get flower flavored burps (LOL).",
          "score": 4
        },
        {
          "body": "You have to practice interviewing. Get comfortable talking about yourself! Plan as much as you can. Also, when you don’t know, try your best but also admit that you don’t know and how you will find the answer. Make it conversational. Just relax! \n\nI know it’s hard when we’ve conditioned in the negative for so long. But breathe. It will take time for your brain to adjust.\n\nSource: suffering from negative thinking and social anxiety and currently rewiring my brain. It’s hard but you literally have to keep exposing yourself, pray, and keep saying positive thoughts over and over.",
          "score": 3
        },
        {
          "body": "Try approaching every interview as practice, that’s it, and that you’re not expecting anything out of it. I think part of the anxiety is you’re overthinking on how to show off the best parts of yourself and seem perfect (that’s how it was for me anyway) to get the role; but if you see the interview as something with 0 stakes you have nothing to lose taking it OR getting rejected. It’s not easy but you got this!",
          "score": 2
        },
        {
          "body": "The more you practice, the easier it will be. Keep showing up to those interviews, but you can't give up half way through.",
          "score": 2
        },
        {
          "body": "Shift your mindset and stop seeking their approval. You don't need anything from them, you're there because they need you and your expertise.",
          "score": 2
        },
        {
          "body": "Do you drink coffee? Quit if you do, it does not help anxiety at all.",
          "score": 2
        }
      ]
    },
    {
      "title": "An important interview tip for beginners",
      "body": "Don't blow your interview, learn how to actively listen.\n\nYou will be doing most of the talking during an interview so it's important to practice what you're going to say and how you're going to say it, *but* it's just as important to practice how you listen. \n\nI've had so many candidates recently who are very articulate, but when I talk, their facade drops and their unprofessionalism comes through. Their body language changes, their eyes glaze over, during virtual interviews I can tell they're on their phone, clicking through what's on their screen, etc. I'm like wow, I just sat here listening to you talk about yourself for 40 minutes but you can't focus what I'm saying for two minutes?\n\nThe last candidate I passed on gave great answers and had great energy as he was speaking. I can tell he had put a lot of work preparing his answers and presentation. But when I started to talk about the role and the company, he completely powered down. His eyes glazed over, staring off into space, put his head in his hand, and about a min into me speaking, his head was almost on the desk like he was so bored out of his mind. I thought maybe he wasn't feeling well but when it was his time to speak again, he snapped right back into perfect interview mode.\n",
      "subreddit": "interviews",
      "score": 160,
      "url": "https://reddit.com/r/interviews/comments/1lt6xyi/an_important_interview_tip_for_beginners/",
      "comments": [
        {
          "body": "This is such good advice. Thank you!!! How do you feel about people noting down what you say? I usually write with pen so I don’t have typing sounds and usually give a heads up at the beginning",
          "score": 18
        },
        {
          "body": "My thing is that most jobs just don’t have seem that interesting or meaningful, at least from the interview alone. To me a job is a job, I won’t give any less effort even if it pays less, I might not like it but I will give it my best",
          "score": 7
        },
        {
          "body": "As candidates, we don't care about the company, just the role. If your main competitor had given your candidates interviews and were willing to pay the same wage/salary, they'd be over there.\n\nBut thanks for this advice.",
          "score": 3
        },
        {
          "body": "I would also suggest you put a little more pep into your voice.",
          "score": 9
        },
        {
          "body": "Every interviewer is so different and looking for different things. I'm biased because I'm not a good talker but a good listener. I do think this is amazing advice. So often the interviewer will tell you exactly what they're looking for. Even the introverts often will tell you within the questions they ask. Being able to pivot and talk about the expertise, drive, and applicable experiences can turn around an interview.\n\nI will say as an introvert. I do put so much energy in not being myself and acting like I have energy. It's beyond exhausting. I am sure I've gotten glazed eyes. 40 minutes straight is a long time to be on after preparing and the nerves leading up.",
          "score": 3
        },
        {
          "body": "I obviously wasn't there and don't know the person you interviewed, but I will say that as an autistic person it's really easy to remember to mask and seem neurotypical when I talk but my resting face doesn't hold up the facade.",
          "score": 2
        }
      ]
    },
    {
      "title": "Don’t think I’ll be able to pass the coding assessment due to being drained",
      "body": "I’ve been unemployed for almost a year. I’ve been grinding trying to make laughable amount of money until I get a decent job. I feel miserable only having enough to afford the necessities. I lost weight intentionally, but now I’m losing weight because I can’t afford to eat as much. I only eat 1-2 meals a day. I eat the same thing every day since it’s cheap to get in bulk. I’m tired and depressed. I have no energy to go back and practice how to code again and be able to perform exceptionally well while three people are watching me on the screen. I’ve been so close to snapping. I’m tired and depressed. I don’t think any job wants me because now the competition is crazy due to all the lay offs. There have been so many times where they say they like me, but someone just has a tiny bit more experience. \n\nI have no energy or life in me anymore. I just don’t have the energy to learn how to code well enough to do it under pressure infront of people watching me. I almost want to cancel the interview so I don’t embarrass myself. ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1opk81e/dont_think_ill_be_able_to_pass_the_coding/",
      "comments": [
        {
          "body": "Do not cancel the interview out of fear of embarrassment. You will get over an embarrassing interview but you will not get over the regret of not even trying. Even if you can do the bare minimum review maybe just looking at the tagged questions solutions for the company just do what you can and definitely attend the interview. Maybe look into SWE adjacent jobs like business analytics or IT related roles if you feel like really can’t code anymore. In terms of being drained I am feeling the same exact way but the difference between the ppl who make it and those who don’t is who gives up on their goals when they reach this low point. You got this",
          "score": 1
        }
      ]
    },
    {
      "title": "How the hell do you stand out when 3000 people apply to the same job?",
      "body": "I’m losing my mind. This morning I saw a new grad SDE role pop up on LinkedIn, literally just posted. I clicked it 15 minutes later and it already had 126 applicants. Last week I saw a post where someone said their Amazon application showed over 3000 applicants. I don’t even know what to feel anymore.\n\nIt’s like… how is this a fair game? You spend months tweaking your resume, practicing DSA, prepping for behavioral, and the moment a job goes live, it’s already flooded with people. You don’t even know if a human will read your resume. You get ghosted before you can even lose an interview.\n\nAt this point it’s not even about how good you are. Everyone has projects. Everyone can grind Leetcode. Everyone’s using ChatGPT. It’s not a skill gap, it’s a f\\*\\*king algorithmic slaughter. And the worst part is even if you do get an interview, you still have to go through 4-5 rounds where they expect you to sound like a perfect human with the best stories ever. No stumbles, no filler words, just crisp logic and charisma.\n\nI swear, technicals are the easy part. You can brute force Leetcode. But behavioral? You either sound confident and structured or like a nervous wreck with a rehearsed script. No in between. I was so fed up I started googling tools just to help me get my act together, saw an ad for something called AMA Interview, something like [https://amainterview.ai/](https://amainterview.ai/), apparently it’s some AI that mimics a real interviewer and hits you with behavioral questions based on the actual JD. Like what?? Now we’re training with bots to survive interviews with humans? Wild times. But honestly, the idea kinda stuck with me, almost like doing Leetcode for soft skills. Might give it a go if it saves me from bombing another round.\n\nThis job market is hell. If anyone else is trying to prep for interviews and losing their sanity, let’s talk. I feel like I’m one bad rejection away from snapping.",
      "subreddit": "interviews",
      "score": 25,
      "url": "https://reddit.com/r/interviews/comments/1knmq2y/how_the_hell_do_you_stand_out_when_3000_people/",
      "comments": [
        {
          "body": "Here’s my piece of advice. If you see a job on LinkedIn, immediately go to that company’s website and confirm it’s a real position. Apply directly through the company portal. You have better odds and you can usually add a cover letter.",
          "score": 9
        },
        {
          "body": "Wondering that too myself..I've been trying to change jobs for months and no luck..I get interviews but then crickets..",
          "score": 5
        },
        {
          "body": "Know there are a lot of completely unqualified applicants and you’re likely better than all but a few of them, and more appropriate for the job fit (location, availability, commute, enthusiasm, specific background) than those you actually compete against.\n\nWin this. Be the best. It’s not that hard for some of us and either you’re that person or this advice doesn’t hurt you because you weren’t that person to begin with. Confidence helps, and if you are that person, I’m trying to impress how this might work for you. I embody it, I have never had trouble finding work.",
          "score": 3
        },
        {
          "body": "It’s time for many to face a hard truth: **a large portion of the population is being frozen out of the job market.**\n\nWe’ve reached a critical point where some job postings receive **over 3,000 applicants**—a clear sign that something is fundamentally broken. When companies only interview the “top 1%” based on AI filters, keyword matching, or prestige-biased assumptions, **strong and capable candidates never even get seen.**\n\nOlder workers, career changers, people with non-traditional paths, or those without a flawless resume are being locked out before they ever get a chance to prove themselves. And with recruiters spending just **6–8 seconds** scanning a resume—if it even reaches human eyes—your application can vanish into the void without a trace.\n\nIts amazing to see that job today are no longer about skills and very few people have learned this. As long as ATS systems are present, this will be able to weed out candidates who aren't suitable. Companies will continue to **“plug-and-play” hires** who require no training.  \nAnd while many think there are still \"ghost jobs\" most companies will only collect your resume for future planning. \n\nThe harsh reality today is this \n\n* You'll never get off welfare.\n* You'll remain stuck in poverty.\n* You'll never experience the safety, stability, or freedom that a reliable job can provide.\n\nas AI continues to automate roles and make entire industries obsolete, this problem will only grow. More people will be displaced. More will lose hope. More lives will be lost.\n\nSome will leave their home countries, desperate to find opportunity elsewhere. Others may spiral into despair. The consequences are already here—and they’re only deepening. We are now seeing signs of a broader systemic failure in the Western world:\n\n* Rising **mass unemployment**\n* A **cost of living crisis**\n* Widespread **housing and food insecurity**\n* Rapid **digitization of money** and increased financial surveillance\n\nIt’s no wonder that many believe we’re heading toward a centralized, global system that prioritizes control over opportunity.\n\n**One World Government... here we come.**",
          "score": 2
        },
        {
          "body": "I run a job search engine and have found that your likely hood of getting an interview increases when you apply as soon as possible on companies websites. Recruiters filters applications as they come. Some recruiters wait for certain number of days or at a certain number. Thats what my search engine also does, cut the noise",
          "score": 1
        },
        {
          "body": "The majority of people who apply to a lot of those easy apply jobs aren’t qualified and apply to anything outside of their scope of expertise/ live in India or abroad and more than likely have zero chance if it’s not a larger entity with full remote opportunities. \n\nA lot of smaller and mid size businesses that are not remote go out of their way to weed out employees that are over a 40min to hour+ commute to the office if in office/ hybrid.\n\nThere is still insane competition/ the market is genuinely cooked but it’s a numbers game and you just have to be aware that we are all replaceable and in most interviews it boils down to soft skills/ who will the team/ dep/ office get along with better as many individuals are capable of doing the same role.",
          "score": 1
        },
        {
          "body": "Make your resume better. Those numbers are fake, not all of them are actual applicants. They click on the apply button but they may not have applied, or they would have been not qualified at all.",
          "score": 1
        }
      ]
    },
    {
      "title": "They wanted me to explain my entire 5 year career plan on a whiteboard",
      "body": "\n\nSo I had a final round interview today for what I thought was a normal operations role. Nothing fancy. During the last part of the interview they bring me into a small meeting room with a giant whiteboard. The hiring manager hands me a marker and says something like show us your 5 year career plan in detail. Not a high level summary. We want step by step milestones and what each year will look like. I kinda laugh because I think he is joking, but nope. Everyone sits down like it is a high stakes presentation.\n\n\n\nI start writing. Year 1 build skills. Year 2 take on bigger projects. Suddenly they stop me and ask what specific technical certification I plan to get in year 3. I say Im not sure yet, depends on what the role needs. They look at each other like I have confessed to a crime. Manager says if you dont have a roadmap you might not be leadership material. Then one guy adds maybe you should come back when you have more self awareness. At that point I just freeze. I can plan projects but planning my entire adult life like a sprint board is kinda nuts.\n\n\n\nThe kicker. They end the interview and say if I can update the board into a proper timeline with KPIs and quarterly goals, I can send them a picture. Basically homework. I walked out, texted a friend to pick me up because I wasnt wasting another second thinking about Q3 of 2029. These companies want Lego employees they can snap into a perfect mold. Im just trying to find a job where I can work, learn stuff, and not have to predict the future like a wizard.\n\n",
      "subreddit": "interviews",
      "score": 109,
      "url": "https://reddit.com/r/interviews/comments/1oub2vn/they_wanted_me_to_explain_my_entire_5_year_career/",
      "comments": [
        {
          "body": "You went in for an operations role, and not to pitch a five-year IPO roadmap of your life.\n\nThe fact that they expected you to whip out KPIs and quarterly milestones for your own existence is wild. Like sorry, I didn’t realize I needed a Gantt chart for my twenties.\n\nYou handled it better than most would’ve. Honestly, walking out was the right call. They don’t want people who grow, they want robots who follow a preset template.You dodged a nightmare. Better to find a place that values actual work and curiosity.",
          "score": 24
        },
        {
          "body": "They basically trapped you in a Chinese finger puzzle? Because every company out there has a completely different type of career path plan that you kinda have to learn as you get into the job. Plus, you have to also consider the fact of that not everyone’s career is completely linear. There are a lot of other options that are satellite roles that you can expand into completely different functions leveraging the role that you started out with. \n\nSo they were basically just looking for a reason to tear you down at the last minute, that’s what it sounds like to me. \n\nNext time when you get asked a similar question like that, I would ask them back specifically what they were looking for. Development or climbing the specific leadership chain and what you’re looking for for in the promotions? Because they said career path, but you were talking about career development which is connected and related, but they chose to only look at what they asked you in a linear fashion. And of course, that flustered you because they were being way too specific and narrow minded. Like I said they were looking for something to tear you down over. \n\nYeah, don’t do that BS homework assignment that they threw out on the way out the door. It’s like they were trying to throw you a bone implying that if you begged and pleaded and provided them with this free work product, they might give you another chance. No thanks, jerks, I don’t work for free. Somehow, it’s always these types to expect people to do hours worth of work for free and it almost never actually gets you anywhere when you do that. They’re just trying to collect a bunch of work product that they don’t have to pay their contractors for.\n\nI’m sorry they were such jerks to you. That is unnecessary and rude of them.  I’m glad that you walked out and didn’t do their stupid homework assignment.",
          "score": 12
        },
        {
          "body": "\\&gt;Y1: $\n\n\\&gt;Y2: $$\n\n\\&gt;Y3: $$$\n\n\\&gt;Y4: $$$$\n\n\\&gt;Y5: $$$$$",
          "score": 11
        },
        {
          "body": "Hooo boy, you are far more patient and nicer than I am. I would’ve stood up and started out writing the first year plan as a nice box with the letters KMFA certification and stopped so they could whisper and then ask me what it meant. \n\n“Kiss my fuggin ass”, mic drop the marker, and stroll on out of there. Perhaps follow it up with a “Have the day you deserve, chucklefucks!” on the way out.",
          "score": 8
        },
        {
          "body": "I would not have faulted you if you slowly drew a middle finger in a connect-the-dots fashion. ",
          "score": 7
        },
        {
          "body": "You dodged a bullet. But my answer would have been “I make detailed plans for projects. I don’t make plans for me, because once I write down a plan and try to follow it I am blinding myself to any unexpected opportunities that might pop up along the way, and that’s bad for business.”",
          "score": 5
        },
        {
          "body": "These companies are truly arrogantly insane! God I hate every single I’ve of them! Hope they all burn in hr hell",
          "score": 5
        },
        {
          "body": "Or they were looking for you to create the game plan for the position without paying you to do so. You were right to bail, I probably would've just tossed the marker to someone and said \"I'm out\".",
          "score": 5
        }
      ]
    },
    {
      "title": "Got the offer!",
      "body": "Had my second round interview for a contract to hire staff internal audit position yesterday with the internal audit manager and vice president of internal audit. It was two separate interviews with the two different people. The first person was much more conversational and asked real interview questions like \"tell me about a time you improved a process\", smashed all these. The second person was more senior than the first and when asked about why I left my last job, I gave the truth \"I was in an accident two years ago that left me with a serious injury and I wasn't able to keep up with my senior title, so they let me go at the beginning of August.\" I had been coached to tell my story a little bit differently so it didn't seem like I can't do the job, but this is the answer that I have given every time, so it's more rehearsed. This guy later asked what my goals were 2 years from now, and where I wanted to be professionally. 2 years is a short timeline, so I answered realistically and said I would hope to be a senior internal auditor within 2 years. Now, because I had said earlier that I couldn't handle being a senior at my old job due to my injury so they let me go, he snapped back and said \"you just said you couldn't handle being a senior.\" I was like \"....yeah, I was in a major accident and couldn't immediately go back to doing the same job I was doing before, I don't think anyone expected me to be able to perform such a job after my accident, that doesn't mean in two years I won't still be able to perform that job. Obviously I'll have to learn new techniques to manage my deficits, but that is an ongoing process and never ends.\" \n\nAnyways, today I received the news that they extended the offer! I'm ecstatic right now. I obviously still have to perform at the given job, but I love audit and accounting and would do my best anyways. Just wanted to share with you all, because I love this community! Don't give up hope! I've been through too many interviews to count and was not doing well in any of them, but one finally stuck!",
      "subreddit": "interviews",
      "score": 144,
      "url": "https://reddit.com/r/interviews/comments/1nkjvst/got_the_offer/",
      "comments": [
        {
          "body": "Congrats! Wishing you all the best in your new job ✨🙏✨I’m hoping for an offer soon🤞",
          "score": 6
        },
        {
          "body": "Congrats 🎉",
          "score": 3
        },
        {
          "body": "Congratulations and best wishes for your success!",
          "score": 3
        },
        {
          "body": "congrats man! you’ll crush this job i know it! hoping i can get this job i just interviewed for as well",
          "score": 3
        },
        {
          "body": "Great news!",
          "score": 3
        },
        {
          "body": "Congrats. I like good stories. Sometimes I think about unsubscribing because it's just negative posts. \n\nI haven't interviewed in over a decade so I'm probably overthinking it.",
          "score": 3
        },
        {
          "body": "Love this! I have my final round of interview today for an internal auditor role and I really hope to get it!!",
          "score": 3
        },
        {
          "body": "Congrats! Proof that being honest, prepared, and persistent really does pay off in the long run.",
          "score": 2
        },
        {
          "body": "Congrats",
          "score": 2
        }
      ]
    },
    {
      "title": "Some more encouragement and a bit of reassurance too!",
      "body": "Just wanted to announce that after a way too long stint of unemployment and 10 interviews, I finally got my ideal job yesterday. Just wanted to share to help some people out as I’ve been through this awful process and come out the other side.\n\nNow I’m mostly using this post not just to announce my success but also to provide some reassurance to the chronic “google after the interview” club! Cos I was so guilty of that when awaiting my news. \n\nFirstly don’t pay attention to too many guides on google. My interview touched on a couple of “red flags” and I still got the job! Obviously YMMV but as examples of my experience:\n\n1) the FIRST thing I saw in a guide was “the interview lasted a significant amount of time”. Well mine was an entire 25 minutes under the scheduled time!\n\n2) They used impersonal language such as “we’ll let everyone know on X day” and “the ideal candidate will”. Rather than say “you will do X in this role. I’ve had 2 interviews where they did the direct approach (which I took as a green flag) and of course didn’t get those.\n\n3) Similar point to 2 but I wanted to also point out that them saying “we’ll let you know” is NOT a failure and can just mean exactly that. Life isn’t a movie and they may well not just snap you up on the spot and have plenty of other factors to consider and candidates to interview. \n\n4) Bonus point here but I got lost and showed up to the wrong building at first. I got nervous giggles and admitted to this straight away haha \n\nSo yeah it can be done and wanted to offer the advice, the most helpful thing to do rather than obsessing over the “signs” is just to think on your answers themselves, your demeanor, and how you can best improve them. I’m sure I missed out some of the other “red flags” that aren’t so if anyone thinks of any, I’m happy to share my experience of how that panned out for me. ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1oocex2/some_more_encouragement_and_a_bit_of_reassurance/",
      "comments": [
        {
          "body": "Congrats on the job! Yeah, obsessing over \"red flags\" is often blown out of proportion. Interviews can be unpredictable and don't always follow the script. Focusing on improving your answers and staying calm is key. That's where the real prep makes a difference.",
          "score": 2
        }
      ]
    },
    {
      "title": "The interview from Hell",
      "body": "I had the interview from hell this last Monday. Interview #4. The first 3 were on Google meet with various team members based in the NYC office- and they were so good! Like extremely good and hopeful to the point that it felt like this next one would seal the deal and I’d get an offer! \nThis one was in person, in the LA office. I Parked and said my little affirmations before I got out of the car like “THE UNIVERSE IS RIGGED FOR YOUR SUCCESS! You’re powerful and strong” lolol no less than 30 seconds since I’m out of the car and am waiting to be let into the building an unhoused man with a large pitbull starts screaming at me “NOBODY WANTS YOU!”\n“With your blonde looking dirty ass ain’t nobody want you!”\n\nThe door to the office building was broken, I couldn’t get buzzed in. I also got no directions as far as like what unit/ or how to hit the key code to reach the front desk/ no one gave me a direct contact either. So the interviewer?? came down and got me and didn’t even shake my hand or introduce herself. She seemed really annoyed that she even had to get me and spent a few mins making sure the door buzzer was broken…\n\nThe man was still out there yelling while she let me in- fun! I wasn’t even 100% sure who she was like oh are you who’s interviewing me?? We walked into the conference room and at that point I’m like okay, this is who I’m interviewing with (since she literally hasn’t properly introduced herself downstairs or in the elevator) so we sit down and I hand her a copy of my resume and she begins skimming it frantically while I tell her “yeah so I met with the VP and MGMT last week” and then met with COO a few days later- and then she cuts me off/ snaps “you met with COO already?!”\n\nThen she’s like “okay so tell me what you do again? You work for your family?” I then explain- give her my shpeil. She then asks me “yeah but like what does your website do exactly? What does you day to day look like?” So I explain. I tell her I consider myself a creative generalist. And she’s like “yeah well like, what does that even mean?” I explain again.\n\nThen she puts me on the spot and asks me for what I think the day to day of this job is? I tell her the details of the role have been pretty ambiguous- I haven’t received a formal description but from what I gathered, this role directly supports the LA sales team on every campaign and project from A-Z. Then she grills me and says I should be asking way more questions. She continues to drone on in the most toxic of ways. Bashing her current team, complains about what the people who left the roles did wrong.\nShe prefaces everything with “not trying to throw so and so under the bus” and then very much throws them. She back peddles here and there and acts like she’s a good boss by saying “whoever ends up in this role will be supported” like sure? There was nothing I could say or do that would have made her like me. Her tone was condescending, and contrarian. She was even disagreeable when I agreed with points she was making. She decided she did not like me before I even got there.\n\nIf it hadn’t been for my friend who recommended me I would’ve walked out after she first offended me within the first 5 mins and said let’s not waste anymore of each other’s time. But I didn’t want to make myself or my friend look bad.\n\nI think this woman was mad I was even there, and that I came recommended from NY team, I think she has someone else she wants in the role and was trying to scare me away. I’m still upset about how much she offended me and that I wasn’t able to clap back, because naturally- you’re not at all prepared to be combative in an interview setting.\n\nRadio silence ever since! Tell me what your next move would be? I have nothing to lose.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1nkir0d/the_interview_from_hell/",
      "comments": [
        {
          "body": "Don’t say anything. You don’t want to work there anyway right?",
          "score": 1
        }
      ]
    },
    {
      "title": "How do you prepare for an interview? Would you read webpages online to prepare?",
      "body": "Hey everyone! I resigned from my job about 3 months ago and have been preparing for interviews lately. To brush up on my knowledge, I’ve been reading a lot of articles online. But honestly, just reading hasn’t been super effective for me—I tend to forget most of it as soon as I close the tab.\n\nThat’s why I created a browser extension called [SnapQuizX](https://snapquizx.com/). It turns any web page into interactive quizzes to help reinforce what you’ve learned and improve retention. Do you also spend time reading online to prep for interviews? Would you use something like this to help lock in the knowledge?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n16rwj/how_do_you_prepare_for_an_interview_would_you/",
      "comments": [
        {
          "body": "Honestly, interactive quizzes sound like a great idea for retention! I’ve seen folks use flashcards for similar purposes and it seems effective for reinforcing concepts. Besides your extension, try implementing some review sessions by teaching someone else—explaining things out loud can really cement your understanding.",
          "score": 2
        }
      ]
    },
    {
      "title": "Advice for interviewing",
      "body": "I was unemployed for about 6 months in 2023-2024 and interviewed probably 50 times before landing a job (some successful and some unsuccessful) and now I’ve had the opportunity to participate in interviews from the other side. I wanted to share some tips for anyone struggling in interviews. \n\n**1. The questions YOU ask are almost more important than the ones they ask. If you finish up the interview and you don’t have any questions prepped, you’re missing out on your opportunity to turn the narrative around.**\n\nI recommend asking unique questions that give you an opportunity to talk more about your strengths. For example here are some questions I’ve asked that have had really positive reactions. \n\n- if you could snap your fingers and fix one problem right now, what would it be and why: this gives you some insight into the managers priorities, issues in the company, AND gives you the opportunity to follow up and explain why you can fix that problem. Instantly shifting the manager’s view of you as the solution to their problem. \n\n- thinking back to other [insert job title] you’ve worked with in the past, what differentiated the ones who were good from the ones who were really great? - this gives you some insight into what the manager or team values and what they’ll expect from you. Also gives you the opportunity to explain why you’re one of the great ones. \n\n- is there anything about my background or qualifications that make you hesitant to move forward with me as a candidate? I’d love to address any concerns or questions you might have, to ensure both that you’re getting the right candidate for this role, but also that I’ve represented myself as well as possible. - this one has always received positive reactions. Sometimes they say no, they don’t have anything to ask (maybe they’re caught off guard or feel uncomfortable saying) but sometimes they do ask questions about one of your previous responses or something on your resume that they had reservations about. This gives you an extra chance to address that in person before they just dismiss you because of something small. \n\n**2. Prepare some stories or examples** that you can recite smoothly from memory for common questions like your experience problem solving, disagreements with coworkers or management, dealing with heavy workloads, creating something new or impactful etc. just have some ready in your back pocket because they always ask questions like that and they want to see examples.. NOT just you saying “oh yea, I can do that and I’ve done it before in another role”\n\n**3. Do your research.**\n You don’t need to know the company inside and out, but I saw a perfect interview completely RUINED because a woman asked what we do here. You should already know that. And at the very least, don’t ask about it. \n\nI could go on forever but don’t want this post to be unbearable. Ask me anything if you want tips or have questions about interviewing!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1jpw3e3/advice_for_interviewing/",
      "comments": [
        {
          "body": "Yeah, knowing the job you are interviewing for AND what the company actually does is incredibly important. \n\nI actually find one of the MOST important questions you can ask is what THEY like most about working there. Everytime I have asked that question in an interview it tells me 2 things instantly. \n1. The quality of the company. Bullshit answers are easy to see, and it tends to kind of break walls a bit. \n2. If they are even considering you. If they aren’t they will give you short nothing answers, if they do want to hire you or at least strongly considering it, they usually give more open and longer responses.",
          "score": 1
        }
      ]
    },
    {
      "title": "Dealing with Anxiety Before / During Interview (Software Engineer)",
      "body": "I typically get some anxiety right before I have an interview. For a long time I had a fear of interviews and I would just cancel them/ postpone them indefinitely. So I am making progress by actually going into these interviews. However, before an interview and sometimes during I find myself thinking \"Man I can't wait for this to be over\" or \"I don't even care if I get this , I just want this to be over\". Obviously I want to do well on the interview but in the moment I just want it to be done with. I'm also noticing I get some brain fog right before my interview. Like it become difficult to think about relatively easy problems. I need some tips to snap myself out of it and get in the \"zone\". I have an interview with my dream company in one week and even if I fail I want to be able to tell myself that I did everything that I could to get this job. Has anyone experienced similar problem and if so, how did you overcome it? Any tips would be greatly appreciated.",
      "subreddit": "interviews",
      "score": 10,
      "url": "https://reddit.com/r/interviews/comments/r1cjvj/dealing_with_anxiety_before_during_interview/",
      "comments": [
        {
          "body": "I get the same way. Even if I study for every possible question I think I’ll be asked, I still go into an interview feeling like I’m about to pass out from the anxiety I’ve felt leading up to it. I get extreme imposter syndrome and let it take up too much mental space. I haven’t found a way to avoid it honestly.\n\nWhat I try to focus on to make it less unbearable is minimizing the company. There are other comparable companies out there, and if this interview doesn’t work out, at least it was good experience for the next one.\n\nI always end an interview asking the interviewer if they have any concerns with my qualifications. It’s an intimidating question to ask, but gives you the chance to redeem yourself if you didn’t explain yourself clearly or have the chance to elaborate on relevant skills for the role. \n\nLastly, I always plan to treat myself when the interview is over so I have something to look forward to and can reward myself for getting through it. \n\nHopefully someone else has better advice 😅",
          "score": 6
        },
        {
          "body": "I have experienced this brain fog in interviews. It’s really difficult to overcome. My last interview it sounded like English was a foreign language to me, making very basic vocabulary and grammar mistakes. I just wanted it to be over and needless to say, I didn’t get the job. I had little time to prepare for that last interview.\n\nFor the job I’m in now, I had a friend who has interviewing experience (in a completely different field) to do some mock interviews, start to finish. A horrible experience in itself, but it helped me notice where I go blank and struggle to express language. The practice of being in that horrible situation does help. So if you can, get some practice in, and face those uncomfortable feelings!",
          "score": 3
        },
        {
          "body": "A lot of the nerves before and during an interview stems from how we perceive the concept of an interview. The fear of making a mistake or not being prepared is something that haunts all of us. And many times, some of us even consider the interview to be a “do or die” situation, which adds unnecessary pressure. \r  \n\r  \nI think a mindset shift would greatly help you tackle your interview-related anxiety. The following are some thought-starters you could try to internalize: \r  \n\r\n\n1. Think of it as a 30-minute chat rather than a 30-minute exam. The more conversational you keep it, the more natural and seamless it will feel.   \n\r\n2. You are not the only one being interviewed. As much as the interview is a time for the HR to get to know you, it is for you to know the company and its people too. So ask relevant questions and learn more about who you may be working for.\r\n3. We all make mistakes. Don’t be too hard on yourself for it. Prepare as much as you can; and even if you don’t respond to a question effectively, it will be a learning experience for you so that the next time around, you can answer it well.",
          "score": 1
        }
      ]
    },
    {
      "title": "Am I Toast - Case Study Interview",
      "body": "I just completed an interview for a fantastic company and feel very small.\n\nGoing in for the first round with the recruiter, they said they hand selected my resume because it’s literally everything they’ve been looking for this role and another. So technically I’m now in the running for two. Since they’re both manager roles, they said the next round will be job fit/behavioural but they’ll start first with a case study. They said the team is made up of BAs and that both roles wouldn’t require me to do math or anything as that’s my teams job, but the case study is something they do for everyone. Totally fine. \n\nThey sent me the invite with some sample cases and I’ve spent hours reviewing BUT I’m not a math person. Regardless, studied, practised multiple scenarios and had notes of calculations ready. I was nervous, but felt very prepared until the interview really started. The person interviewing me was very nice but when they gave me the scenario I started freezing. I think I got through the first two questions okay… but then it was more and more math and imo simple math math but I was getting so nervous and the interviewer kept repeating the same questions to me regarding my thought process which started confusing me and made me begin to second guess myself. They were very nice though and didn’t rush me and at points where I felt stuck they gave me little prompts. When they finally asked for my thoughts on non math related questions my confidence snapped back into gear and I felt solid in those. I’m just kicking myself because I got so nervous and because I was freezing with my calculations, we ended up going almost 30 minutes past the interview time, which I thanked them for. They also still opened it up for a question for me at the end which they gave a really solid answer on and continuously said “you’ll be doing,” “you’re responsible for,” “your team does” statements but that could have just been them being nice. They thanked me for my time and wished me good luck but I feel like I messed it up. \n\nHas anyone else been in a similar situation that could share their advice or am I right with my gut feeling that my nerves lend me to bombing it. ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1kl57cn/am_i_toast_case_study_interview/",
      "comments": [
        {
          "body": "The fact that the interviewer was patient, offered prompts, and continued to use language suggesting you in the role is actually a good sign. They may be more interested in your problem-solving approach and how you handle stress than in perfect calculations.\n\nYour strong performance on the non-math questions is a big plus. Many roles prioritize soft skills and strategic thinking over pure numerical ability. The interviewers likely understand that real-world scenarios allow for more time and resources than a high-pressure interview setting. It's possible they were testing your ability to work through challenges and maintain composure as much as your math skills. Stay positive and focus on the aspects where you felt confident.\n\nI'm on the team that created [AI interview](http://interviews.chat) tool that offers real-time suggestions during online interviews, which could be useful if you face similar challenges in the future.",
          "score": 1
        }
      ]
    },
    {
      "title": "Job interviews",
      "body": "I recently went for a job interview. I was a little bit nervous but I kind of felt like my employer was making a big deal of it in front of the woman in HR. I'm an individual of 8 teaching experience, leadership in my last role, hold in the place together and a manager capacity for a couple months until my new manager turned up. I have a masters and I'm in the second year of my PhD. When you look on paper e g CV, experience, qualifications on credentials. In theory I was perfect for the job.\n\nI was told today that I was not successful. The individual who got the job was 18 months of work history, foundation degree in university and has no leadership qualities or experiences. Apparently the only reason she got a job was because they felt she interviewed better. There's also the question of performance reviews; since I started this job I'd only have a four week performance review because I hadn't had a manager since (I was looking after the place while we waited for someone else), I'd worked underneath me and I was working with one other staff member. Teach 9 subjects etc, quality assurance, dealing with referrals etc. My manager gave a review for the individual above who he'd known for 2 months and another colleague. He stated he would not give me one because I'd been there for 6 months and it would be unfair for him to say what I did before his arrival (but hadn't mentioned anything he had seen in the 2-month I was with him). Happily informs me that while I was looking after the center, Nobody has documented this and although he is he talked about the other two candidates, he would not say anything on my behalf, nor did he stop the interview process to go and find the information (instead making a snap decision on a process from start to finish less than a week). I'm the first aider and fire warden. I'm the go-to for all staff members. My manager to this point had been referring to me as number two.\n\nWhat went wrong?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/11fm9m7/job_interviews/",
      "comments": [
        {
          "body": "One of the interviews was my line manager.... The other was a lady from HR has never met. I understand what you're saying about vibes but to me it was a clear preference.",
          "score": 1
        }
      ]
    },
    {
      "title": "Hung up on a phone interview",
      "body": "Basically, I had a phone interview for this job that I was somewhat not interested in, after doing more research about the company. So already, I was not that interested in going into this interview, but I figured just get the interview over with and state how it's not a good fit for me later. While on the phone interview, the interviewer began to ask their questions, and everything was going pretty okay. \n\nThen he asked a question along the lines of \"how would do this....\", which I answered to the best of my abilities, but then he constantly would snap and say, \"no, no, no. I meant, would you feel comfortable doing....\" But like that's not what you asked. I answered the question that you asked. He then continued to belittle me through the phone, telling me how I picked the wrong major and that I wasn't going to make it. I wasn't going to just sit there and listen to this. \n\nSo I hung up, which is something that I don't try to do, but I couldn't finish the interview. \n\nDid I do the right thing? Is there ever a right circumstance to hang up on a phone interview/zoom interview? Is there a better way to handle a rude interviewer?\n\nI know that this interview was messed up, but it got me thinking about possibly going about this in a better and more professional way than what I did.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/of252e/hung_up_on_a_phone_interview/",
      "comments": [
        {
          "body": "Not only did you have a right to do so, but if I was the one in the call, I would have made it perfectly clear it wasn’t an issue with the phone, the connection or something else that could be misunderstood. I would have said ‘oh wow... You are extremely disrespectful. I don’t think I’m interested in this job anymore. Goodbye’ then hang up. That way, it really sends a message.",
          "score": 5
        },
        {
          "body": "If zoom call was being recorded then you should have said something like how they were a bad interviewer and don't know how to ask basic questions and you're no longer interested in the job just because of them.\n\nThey would think twice about repeating what they did on other calls.",
          "score": 3
        },
        {
          "body": "To be fair, I think I would have done the same thing! He sounds horrible and getting off the call asap was the best thing you could do!",
          "score": 2
        },
        {
          "body": "Don't worry about being unprofessional.  The interviewer was being very unprofessional and inappropriate insulting you like that.  I would consider reporting him to his supervisor.",
          "score": 1
        }
      ]
    },
    {
      "title": "Why do employers treat a 5-8 mintue phone interviews as a replacement for a lenghtly in-person interview?",
      "body": "I don't understand! An employer accidentally sent me an email in response to my interview, stating they weren't impressed. It's clear they meant to send it to their boss \\-\\_\\_\\_\\_\\-'. But the duration of that interview was less than 6 minutes, the questions given to me were so open ended that I had to specify them in relation to what I had on my resume, and they didn't respond back to anything I stated except with mouth noises, okays, and greats.\n\nIt's like I was talking to a wall. Yet that whole experience on their end was a done deal. Now I hate scripted  questions that sound like they came from a bot. How you can provide insight into a candidate's abilities through such a process???   During our fancy ass technology age nobody wants to meet face to face; what's next texting interviews... snap chat interviews?  Oh yeah a lot of people apply for the same position, but only those who generate interest get picked for the worst way to see if that pick was right. At least put some effort into the questions!!! Pretend you care about the person you're talking to! My  performance depends on your performance. FUCK\n\nOkay this is off my chest now.",
      "subreddit": "interviews",
      "score": 9,
      "url": "https://reddit.com/r/interviews/comments/8nle90/why_do_employers_treat_a_58_mintue_phone/",
      "comments": [
        {
          "body": "Really, when you are talking on those kinds of interviews. \n\nFocus on what you are looking to tell and let some of your personality show. It might just be a screening to see if you are worth moving to the next screen or your ability to think on your feet. \n\nI know in my company, booking a room for a face to face interview they charge our program money. So, spending money, time, and resources to have a face to face with every candidate might be a stretch. ",
          "score": 6
        },
        {
          "body": "This is all due to cost. ",
          "score": 2
        },
        {
          "body": "I had one yesterday and he just talked about the job and asked me about my resume.  Then, he asked me to come in for an interview. \n",
          "score": 1
        },
        {
          "body": "Sounds to me like the company told you everything you need to know about working for them.\n\nDon't forget you are interviewing them in a sense as well.\n\n",
          "score": 1
        },
        {
          "body": "Sounds like a very bad experience! As you say this is due to the volume of applicants companies now achieve. You really have to wow in some very difficult situations. The only thing to do is to try and predict the type of questions you will be asked and have some killer examples lined up. Number and figures to demonstrate your achievements will always have immediate impact if possible. ",
          "score": 1
        },
        {
          "body": "I once had a lady call and say \\- this will be a 15 minute phone interview. She was down to the last second. I felt like a truck had hit me.",
          "score": 1
        }
      ]
    }
  ]
}