{
  "company": "target",
  "post_count": 63,
  "exported_at": "2026-01-18T17:44:53.308Z",
  "posts": [
    {
      "title": "This industry is exhausting",
      "body": "I'm sure this isn't a unique post, but curious how others are managing the apparent requirements of career growth. I'm going through the process of searching for a new job as my current role is uninspiring. 6YoE, and over the past few months I've had to spend over a hundred hours:\n\n* Solving random, esoteric coding puzzles just to \"prove\" I can write code.\n* Documenting every major success (and failure) from the past five years of my career.\n* Prepping stories for each of these so I’m ready to answer even the weirdest behavioral questions.\n* Constantly tweaking my resume with buzzwords, metrics that sometimes don’t even make sense, and tailoring it for every role because they’re asking for hyper-specific experience that clearly isn’t necessary.\n* Completing 5+ hour take-home assignments, only to receive little more than a \"looks good\" in response.\n* Learning how to speak in that weird, overly polished \"interview language\" that I *never* use in my day-to-day.\n* Reviewing new design patterns, system design methodologies, and other technical concepts.\n* Researching each organization, hiring team, and the roles of the 6–10 people I meet during the interview process.\n\nMeanwhile, nobody in the process is an ally and there are constant snakes in the grass. I've had recruiters that:\n\n* Aggressively push for comp numbers up front so they can use them against me later.\n* Lie about target compensation, sometimes significantly.\n* Encourage me to embellish my resume.\n* Bait-and-switch me with unrelated roles just to get me on a call.\n* Bring me to the offer stage for one role, only to stall it while pitching me something completely different.\n\nAnd hiring companies that:\n\n* Demand complete buy-in to their vision and process but offer no reciprocal commitment to fairness.\n* Insist you know intricate details about their specific tech stacks or obscure JS frameworks, even when these are trivial to learn on the job.\n* Drag out the interview process by adding extra calls to \"meet the team.\"\n* Use the \"remote\" designation to justify lowball salary offers, framing them as \"competitive\" because you're up against candidates from LCOL areas—while pocketing savings on office costs.\n* Define \"competitive compensation\" however they want, then act shocked when candidates request market-rate pay for their area.\n\nAfter all this effort, I’m now realizing I still have to learn comp negotiation strategies to deal with lowballs. I’ve taken time off work, spent dozens of hours prepping, and then get offers that don’t even beat my current comp.\n\nAt this point, I’m starting to wonder if I’m falling behind my peers—whether it’s networking, building skills, or even just pay. Are sites like [levels.fyi](http://levels.fyi) actually accurate, or are those numbers inflated? Why am I grinding out interviews to get a $150k no-equity offer from a startup when it sure looks like everyone at a public tech company is making $300k?\n\n**This whole process is** ***exhausting***. I'm fortunate to not need a new job immediately, but this process has pushed me to the brink of a nervous breakdown. I'm starting to lose confidence in my desire to stay in the industry. How hard must I work to prove that I can do my job? Every stage of this process demands so much of your time - it feels like a full-time job.\n\nAm I missing career hacks or tools that could simplify this? Are there strong resources to make any part of this easier?\n\nI've come to realize I should be maintaining and building some of these skillsets as part of my regular work. But when you're already working 35–45 hours a week, how are you supposed to find time to keep up while also maintaining a lifestyle worth living?\n\n\\-----\n\n**tl;dr**: What techniques do you use to improve and maintain your interviewing skills, network, and career growth in a way that's sustainable? Happy to pay for services that others have found useful.",
      "subreddit": "cscareerquestions",
      "score": 821,
      "url": "https://reddit.com/r/cscareerquestions/comments/1h513ip/this_industry_is_exhausting/",
      "comments": [
        {
          "body": "My thought would be to zoom out a bit. You're talking about walking away from a chill job paying $150k because you find in uninspiring. We are very lucky to be in this profession.",
          "score": 598
        },
        {
          "body": "Sounds simple, but don't think about too much. Just prepare, do the interviews and see where you can improve. \n\nOveranalyzing it is worthless. No matter how many people say there's a formula at some point you reach terminal studying and prep and from there it's a coin flip in luck. \n\nVery rarely will you get a fair interview and that's just something to accept and try again and again. Unless there's a common failure point in your interviews need to just keep trying. \n\nBut I do empathize and agree the entire process is cringe. Answer is to be as greedy and cold as possible to the same recruiters once you have an offer to maximize salary and interest in role. \n\nIn no universe should you say anything other than \"I want market rate\" for pay, and if they ask if you have other offers play it by ear. I was cold rejected after a final interview because I said I was waiting for an offer from another company. Just be a scumbag same as them and say whatever they want to hear.",
          "score": 117
        },
        {
          "body": "&gt; Are sites like levels.fyi actually accurate, or are those numbers inflated? \n \nThose are accurate. The only part that is really inflated is the RSUs since some people like to say the current value of their RSUs vs the grant value. (For instance, I could be paid 75k worth of RSUs per year but because of inflation, my stock is now 3x it's grant value. So some people would say \"I get 225k RSU per year\". Fairly, you should say 75k in reporting TC but people like to say bigger numbers lol).\n\nAnd yes, 300k is a normal (I'd say skewing high for mid but whatever... this just might be cope since I'm not at 300k as a mid LOL) TC for big tech in the mid/senior level. \n\nThese huge TCs are what makes that exhaustion worth it. Normal people would kill to get jobs that pay this much. Unfortunately, some of that seeps into other undeserving companies (TC wise) which makes non-big-tech unnecessarily stressful too.",
          "score": 130
        },
        {
          "body": "&gt;Are sites like [levels.fyi](http://levels.fyi/) actually accurate, or are those numbers inflated? Why am I grinding out interviews to get a $150k no-equity offer from a startup when it sure looks like everyone at a public tech company is making $300k?\n\nThe process is exhausting because there's a lot of competition for those positions. While I do believe the numbers on [levels.fyi](http://levels.fyi), as someone else noted, there can be errors in reporting (one year vs vesting). Also, [levels.fyi](http://levels.fyi) probably skews data towards the higher end companies. There are tons of companies that need engineers, and some just do not pay at the level that [levels.fyi](http://levels.fyi) does. That comparison can make you feel bad. But it can also skew your perception of what \"normal\" is.\n\nIdeally, you'd land a job where your 9-5 is relevant to things you want to learn, so you wouldn't need to learn outside of work hours, but as new technology comes out, we're all likely needing to learn some extra. The \"worse\" your job is, the more learning on your own you'll need to do.",
          "score": 30
        },
        {
          "body": "After 10 years in the industry, I wanted to see how other professions are, so I talked to people from law, finance, medical, trades, real estate, and small business domains. I tried to find people making around the same money as I did, and boy oh boy, tech is one of the worst professions you can be in. High salary is achievable in our domain fairly quickly, but the vast majority of devs and engineers don’t make that kind of money, and the average isn’t really that good considering all the downsides.\n\t\n1.\tWe have the most absurd interviews; in no other profession have I found that people were getting assessed on things that weren’t an active part of their job. Some of them were very surprised when I explained to them about LeetCode.\n\t\n2.\tThis is by far the most important one for me: most of these professionals had a very high satisfaction rate with their work when compared to us engineers.\n\t\n3.\tWork-life balance is almost iffy in every domain; you can get fucked up if you are in the wrong place and coast along without doing anything in another. Tech is nothing special in this.\n\t\n4.\tAverage compensation is higher for us, but medicos, lawyers, and financiers can make absurd amounts of money—money that only a handful of us in tech will ever see. A larger percentage of people crossed a certain threshold in these domains than in tech.\n\t\n5.\tAlmost all the professionals have more human interaction in their day-to-day work than techies.\n\t\n6.\tI don’t have any concrete metrics on this, and a lot more research can go into this; I am stating this based on my own perception. Every professional from these domains felt less depressed and less brain-dead.\n\t\n7.\tWe have the highest rate of change in terms of skills. Basically, we tech people have to adapt a lot more to change than any other profession.\n\t\n8.\tMarketing, product, anything related to engineering (sales engineer, support engineer) are basically in the same boat as us—the boat sailing towards hell and doom.\n\t\n9.\tWe have one of the lowest barriers to entry in terms of credentials required, but a high time period to entry.\n\nI am actually doing independent research on this topic, trying to compare other professions and professionals with tech, and will publish this next year.",
          "score": 56
        },
        {
          "body": "It's always interesting to see someone talking about their alienation under this ultra competitive, ultra amoral mode of work. The answers are always \" you're lucky bro at least they pay you more for the mental anguish, we are lucky\" or some permeation of \"get a manual job and come back\" rather than addressing the issues that they brought up. We would be far more efficient and do much better for society if we critically looked at what these things, abhorrently lopsided interviews and such, do for the progress of the field and us as a people. But that may be too much for this crowd unfortunately",
          "score": 12
        }
      ]
    },
    {
      "title": "Confirmed: Recent layoffs are making it harder (for some) to get an SWE job",
      "body": "I’m on the hiring committee at my company for a senior position (5-8 YOE). We’ve been struggling to find the right fit - candidates either have great technical ability but subpar communication skills or vice-versa.\n\nWith all of the layoffs, we’ve been starting to target those who have announced they were affected on social media. I interviewed one of those candidates recently. This person was smart, eloquent, and sufficiently capable for the role. Taken as a “whole package”, they blow all of the other candidates we’ve interviewed out of the water.\n\nAdditionally, this person recently relocated to one of the main tech hubs specifically for their previous role and seems understandably eager to find a new job. I suspect that our mutual interests will align and we’ll hire this person.\n\nI’ve seen a good amount of conjecture in the community that this shift might occur, so I thought it would be valuable to confirm that yes, recently-laid off employees from large tech firms are likely to temporarily make it somewhat harder for others to find a job.\n\n(Source: Me. N = 1. Your mileage may vary. Best of luck to *everyone*!)\n\n---\n\nUPDATE (in the interest of transparency) - 12 hours after initial post creation\n\nI performed an interview today with another candidate that was laid off recently from Big Tech. This candidate talked a big game and impressed me with nice answers to my open-ended questions. However, they couldn't solve our straightforward coding exercise. (This exercise is not \"LeetCode\" in the slightest; it's actually very similar to day-to-day development work)\n\nI think these two candidates embody the sentiment expressed by a lot of you in the comments - Some of the laid off candidates will be truly *fantastic* while others are just good at interviewing and not at actually being software engineers.\n\nSo, I suppose the takeaway is that although the job hunt might be a little more difficult in the short-term, it's definitely not a lost cause. If you're good at what you do, you'll be able to land a job. You've got this; I'm rooting for you! :)",
      "subreddit": "cscareerquestions",
      "score": 1157,
      "url": "https://reddit.com/r/cscareerquestions/comments/z2omr9/confirmed_recent_layoffs_are_making_it_harder_for/",
      "comments": [
        {
          "body": "My co is also reaching out to people on linked in but not holding our breath. We can’t pay what the big guys pay. And these people will leave for higher comp when the market offered them something else. It’s such a small overlap of compatibility imo. All these layoffs only affect you if those/very similar companies are what you’re targeting.",
          "score": 266
        },
        {
          "body": "Fun Fact: We now get great candidates but can't hire them, since we have a freeze.",
          "score": 775
        },
        {
          "body": "I wonder if these types of candidates will ask for higher compensation, or if they will bolt as the economy improves. The latter is a risk for anyone.",
          "score": 386
        },
        {
          "body": "It ain’t called job “market” if it doesn’t get driven by supply and demand",
          "score": 49
        }
      ]
    },
    {
      "title": "Got another interview at target",
      "body": "So this would be my 3rd HireVue interview from target and honestly I have no type of positive energy that I would get the job honestly. I’ve always wanted to work at target and it’s been my go to place for shopping. I see myself working there but not with the constant denials from them. The first two interviews I’ve received was just a disaster with me constantly stuttering and repeating the same thing i said , not having the right answer, awkwardly looking at the camera and pressing the hide your face feature, or just overall clueless on what to say. It’s hard for me to focus and basically talking to myself, it’s always been like this since high school and I was never good with subjects that has to due with recording your face and voice.I have always been a shy anxious person. It’s always me overthinking an answer or forgetting everything in my head. The answers I provide are much better when it comes down to a in person interview but that’s not the case here. I have the time to relax and reflect on the work experiences I had yet when i start the recording everything seems to throw itself out my head as well with me closing off the question. I would appreciate any type of advice that would help me get through this situation, it will mean a lot to me. I need to able to grow into a more confident person",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/l8fh7c/got_another_interview_at_target/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Practice interviewing with friends and family. It's just nerves. Target sucks anyway I used to work for them but if you really want a job there try the warehouse.  You just have to have a pulse and show up for work",
          "score": 2
        }
      ]
    },
    {
      "title": "Interview with Target in the morning.",
      "body": "Just as a cashier, but still, never worked in a position I would be seen by people. Or in retail even, can anyone give me some pointers on how I should dress or act. The questions I might face, etc. \n\nI plan on wearing the nicest clothes I own (which arent the best though :( ) Khaki pants, black button up shirt, brown boots. ",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/iwfwe/interview_with_target_in_the_morning/",
      "comments": [
        {
          "body": "For a retail position, I was asked how I'd deal with difficult customers or if I was serving one customer but another needed my help etc. Obviously you just kiss ass and say the customer comes first, I'd work well in a team. Don't be nervous. Go in there like a boss! Your outfit sounds great!",
          "score": 3
        },
        {
          "body": "I had an interview for Target a couple of weeks ago (and got the job!).  Everyone at Target is required to wear khakis, so you should be fine with that.  Be upbeat (but don't fake it) and smile, immediately introduce yourself rather than allowing your interviewer to do it first.  Keep a little notebook and pen with you to take notes.  You will likely be interviewed by 3 different people...my interviews went really quickly because they said that they could \"just tell\" when people would be good for customer service.  So make a good first impression.  Have a few questions lined up for them (I usually write a few more than I need so that I can pick and choose to align with the direction and tone of the interview).\n\nIf I recall, they'll ask you a question about a time when you disagreed with someone; what role you take on when in a group; how flexible you are (just do something like relate an experience you had in school where a teacher made changes to an assignment mid-way through and how you adjusted or something).\n\nHope that helps!",
          "score": 3
        },
        {
          "body": "I've interviewed with Target for an internship position before (not the same position, so your questions might be different) and I remember them asking lots of scenario questions. Like, \"tell me about a time that you had to work in a group and things didn't go well\" or \"what would you do if you disagreed with something your manager said.\" Shit like that. Just think of times where you've had to help people or work as a team and find some examples of when things went good and bad.",
          "score": 2
        },
        {
          "body": "I work for them briefly quite a few years ago. Agree with them when they pretend to be better than Wal-Mart. You'll be fine.",
          "score": 1
        },
        {
          "body": "The clothes are more than fine for the interview.  They'll want to know that you're a hard worker and take intiative.  The'll probably want to hear of a few times you've showed these qualities.\n\nReally don't remember much else from MY interview process, it was like 5 years ago.",
          "score": 1
        },
        {
          "body": "Just answer with any cheesy answers an employer would want to hear.  Despite being extremely anti-social I managed to get a job there that was partly sales-floor.  Good luck, and may your inevitable team huddles not include any forced \"singing\".     ",
          "score": 1
        }
      ]
    },
    {
      "title": "Senior HFT/Quant Trading Engineer with 10+ YoE: Job Search Experience and Sankey in Late 2025",
      "body": "Sankey: https://i.imgur.com/0zOk1wv.png\n\nWanted to add a data point of my experience applying in late 2025 as a Senior with a well-defined domain expertise in quantitative and low latency trading. I was laid off ~1.5 months ago from my previous firm and worked with a specialized headhunter who focuses on placing prop trading SW and FPGA engineers. I didn't personally submit any applications—everything was handled by my HH. We applied to eight firms/quant funds in a targeted fashion. My HH's relationship with certain firms allowed me to bypass a few bureaucratic HR stages and get in front of hiring managers immediately.\n\nThis was my first time on the market as a Senior and my interview experience mostly aligned with how I chose to prepare. The mix of questions I encountered was roughly 9:1 domain-specific C++ to LeetCode-style DSA. There were a bunch of questions on deep C++ features, trading-specific minutiae (exchange protocols, executing a low latency strategy on a particular exchange), lock-free algo knowledge, etc. Ironically, the rounds that tripped me up the most _were_ LeetCode-style questions, so I regret not doing more than the 10-15 questions I practiced but overall my preparation was accurate.\n\nI withdrew from the interview process at three firms since I received a solid offer from a firm I liked (on a desk/team I liked as well). I anticipate I would've gotten another 1-2 offers had I seen those through to the end but I was satisfied.\n\n* Timeline from start of search to offer: 1 month\n* TC: ~$500K\n* Location: Chicago\n* Preparation: 10-15 LeetCode questions and implementing dozens of lock-free/high-performance data structures in C++. Reading a few intermediate to advanced C++ books to refresh (think Nicolai Josuttis, et al.). Playing around with some language features in the newer standards (C++23/26).",
      "subreddit": "cscareerquestions",
      "score": 353,
      "url": "https://reddit.com/r/cscareerquestions/comments/1oy3pl1/senior_hftquant_trading_engineer_with_10_yoe_job/",
      "comments": [
        {
          "body": "Mind sending your list of lock-free/high-performance data structures?",
          "score": 89
        },
        {
          "body": "Congratulations, from a fellow HFT C++ developer in CHI.\n\nThere's a chance we may know each other :)",
          "score": 39
        },
        {
          "body": "As soon as I read your title I was guessing 5 apps 5 interviews 5 offers. After clicking your image I wasnt disappointed\n\nBtw folks, this is your competition.\n\nEdit: I’m aware in this case he only applied to quant but had he applied to all the big tech then point still stands.",
          "score": 161
        }
      ]
    },
    {
      "title": "[Motivational Success Story] How I got a $170k job as an Asian male with 2.3 GPA from a public university",
      "body": "**Intro:**\n\nHey everyone,\n\nI've been seeing a lot of negative posts on here recently, and it kinda sucks since a lot of how I moved up has been partially due to the resources and inspiring stories I've seen on here. Like most of you, I have also been laid off early on as a direct result of covid-19 hiring freeze/workforce cut, but then I ended up with a very good role at a Big N company. With that said, I want to give back to this community and hopefully inspire/help some of you who are struggling to find jobs in this rough time by sharing a story of how I \"made\" it.\n\n**Background:**\n\nA brief background of myself is that I am a 23 year old asian male who graduated from a public university (it is quite reputable though) with a \\~2.3 GPA in CS. I also graduated a semester late due to failing one of my final upper-level class on my final year, which definitely hurt my job-hunting prospect a bit since it was difficult to explain this to my potential employers. Given my stats, it seemed like I had little to no chance of landing a role, let alone a role at a Big N company, and yet, here I am. With that said, here is my story and how I did it.\n\n**First Job-Hunt:**\n\nUnsurprisingly, job-hunting as a senior was quite difficult due to my low GPA compared to my peers. I also lacked the knowledge/skill-set/experience that a lot of companies were expecting new-grads to gain since I only had one relevant internship at a non-tech company. The first job I took was a contractor position where I was paid $25/hr, which was fairly comfortable given my cost of living. It was the only offer I received out of the countless applications I sent out during my senior year, and even that job was very hard for me to obtain. After doing well on the on-site interview, I was asked for my transcript and to complete a take-home coding assignment, I was almost ghosted due to my GPA, and I had to keep emailing the director in regards to the position. After many weeks of exchanging emails, he finally agreed to hire me as a temporary worker after seeing my take-home coding assignment (yes, those are actually worth doing if you really need the job).\n\n**Second Job-Hunt:**\n\nAs my contract was nearing the end, I went back on the job-hunt again. I had a conversation with my manager and he thought I did well enough to convert to full-time. However, when covid started happening, I knew I was at risk of being let go, and sure enough, it happened the day before my interview with my current company (not within my manager's control). Despite the bad timing, I didn't let it get to my head and performed well on the interview. This was also my only offer out of the hundreds of applications I sent out, and it's better than anything I thought I'd ever get, given my background. I didn't even bother negotiating as I was very happy with the 300% salary increase and it was already a very generous offer compared to the others at my level at the same company.\n\n**Steps I took:**\n\nFirst and foremost, I reviewed my data structures and algorithm. I went through a study guide that has since then been taken down (unfortunately), but the second best guide would be the Crack the Coding Interview. I read this mostly for the lessons it provided on each topics.\n\nEdit:  [https://workflowy.com/s/study-guide/RD5kZ682pWX5oxiE](https://workflowy.com/s/study-guide/RD5kZ682pWX5oxiE) is the link to the study guide, shoutout to u/throwinaway101010 for finding it!\n\nOnce I was brushed up on my DS+A, I started networking. I reached out to a lot of my friends, family friends, family friend coworkers, strangers on discord (shout out to CS Career Hackers) and recruiters. I asked them questions like what they look for in candidates, what do I need to improve on and if they can refer me. I used those feedback to improve myself to the point where I'm at right now. In fact, my current role came from a referral from a stranger on discord, so definitely try to leverage as much networking as you can, even if there's a slim chance of it working out!\n\nAnother important thing was to keep improving my resume. I listed my skills, work experience/accomplishments, education (no GPA lol), 2 side projects (one was a hackathon app and another was a game I created with my friends). I also asked many friends and strangers to review my resume and built up on the feedback they provided, and it eventually paid off as I got to the stage where more recruiters were giving me callbacks.\n\nFinally, I did a lot of mock interviews. I tried to schedule about 2-3 mock interviews a week, and slowly ramped up as my final interview was coming up. This only took about 1-2 hours a day, which wasn't much for me since it just meant 2-3 less games of league. Again, I mocked with as many of my relevant connections as I knew, as well as the people on discord. I built up on the feedback I received to improve my interviewing skills. I became better at communicating my thought process, handling edge cases, coming up with near-optimal solutions to problems I haven't seen before and asking clarifying questions. I am very grateful for their time as I felt this was my biggest contributing factor to how I did well for the interview. By the time I reached my on-site interview, it just felt like another mock interview at that point. I also reviewed the company values and came up with 5-6 stories prepared that demonstrated those values in a clear, concise manner. I highly recommend people do more mock interviews instead of just solo leetcode, as it'll give you exposure to how other people answer questions and what you're lacking in.\n\n**Conclusion:**\n\nPlease don't be discouraged when applying for jobs. I know how it felt, I was literally in that spot a couple months ago, but I never gave up. I kept improving myself and I achieved what I didn't think was possible for me in the past. There are companies that are still hiring new talents, you just have to keep looking.\n\nAlso, don't get obsessed over the Big N hype either (don't think that any job that isn't Big N is worthless). I wasn't primarily targeting Big N, but when I saw someone recruiting for it on discord, I just went for it. I was very much comfortable at my old job and content with the amount I was making, but the circumstance forced me to job hop, unfortunately.\n\nKeep moving forward, and don't get too let down by rejections, I've faced many rejections from companies I got call-backs from and I just brush if off and keep applying/trying.\n\nAlso, keep in mind that this is a marathon, not a sprint. As long as you consistently improve, you will eventually be where you want to be in due time, whether it's a position at a new company or a promotion at your current one.\n\nIn conclusion, if I, an Asian male with a 2.3 GPA at a public university, can land a job at a Big N company through perseverance , then I'm sure all of you can find something you'll be happy with by not giving up.\n\nThank you for reading,\n\nRoy\n\n**Note:**\n\nThe main reason behind my low GPA is mostly due to my inability to do well on exams, but I firmly believe that exam-taking holds no weight on how good of an employee the student will be. I did well on projects and assignments that were more relevant to real world work experience. However, that's a discussion for another time, lol.",
      "subreddit": "cscareerquestions",
      "score": 1667,
      "url": "https://reddit.com/r/cscareerquestions/comments/i03i39/motivational_success_story_how_i_got_a_170k_job/",
      "comments": [
        {
          "body": "Can i know in which city you're based? $170k is a very handsome salary for a 23 year old. Also, did you do a lot of leetcode or anything else?",
          "score": 245
        },
        {
          "body": "Congrats on coming to Amazon",
          "score": 69
        },
        {
          "body": "Congrats!\n\nHM here; from our mock interview, I could tell that you've really done your homework.\n\nWhile you present your story as a \"motivational success story\" I see it more as a testament to how much work you have to put in to achieve success.\n\nUnfortunately there are no shortcuts when it comes to understanding the good coding practices and concepts that interviewers are looking for.\n\nMay you have a long and successful CS career :)",
          "score": 122
        },
        {
          "body": "Hi congrats!\n\n1. Can you explain what your mock interviews were like?\n\n2. You said you “brushed up” on DS&amp;A but what does that mean? Did you do LeetCode or some Medium problems in CTCI?\n\n3. Any tips for getting past the resume screening phase when applying to Big N?",
          "score": 65
        },
        {
          "body": "Another day another 6 figure posting on r/cscareerquestions",
          "score": 111
        }
      ]
    },
    {
      "title": "Went From 90k to 140k by Managing Phone Screens Really Well",
      "body": "I am very fortunate to have gotten an offer for \\~140k (mostly all base, as is customary in Chicago), while I was just at \\~90k  TC (for those of you who are curious,  I am a 2019 grad and have been at the same company since then) - and I did not do any big LeetCode grind or anything like that (maybe 20 LeetCode easies and mediums total in a one month period).  However, one tactic I found really useful, was managing recruiter phone screens strategically.\n\n&amp;#x200B;\n\n1. I set up a system to weed out really poor recruiter outreach.  Most outreach is absolute shit - like roles that do not match with my experience at all, or have really poor compensation.  I simply stopped replying to to most bad recruiter outreach where the recruiter clearly did not make an effort (like sending me job descriptions asking for 7+ years of experience).  This was kind of brutal maybe, but I am not going to spend 30 mins every day replying to all the crap I get on LinkedIn DMs and email.  I spent about 15 hours creating email filters to weed out bad outreach and prioritize high quality outreach (this may have been a bit obsessive).  I asked for comp ranges typically before hopping on a call.\n2. When asked for comp expectations in the call, I would NOT talk about my current pay (it is actually illegal for recruiters to ask for it in Illinois).  When I was asked about expectations, I would very clearly mention the compensation range of companies I was talking to.  So I would say something like this: \"I have been talking to companies mostly in the 120-140k total compensation range, so I would like to target something in that range if we are going to move forward\".   Earlier in the process, these ranges were smaller, but as we went along, those numbers got bigger.  I think I started off talking to companies in the 100-110k range, and this tactic helped move that range up. This was transparent, and it seemed to work well for me (transparency can help - who would have thought).  As I went further along this process, I would let the recruiter calling me know if I had on-sites scheduled, or was approaching the pre-offer stage at other companies.  This made them seem to move faster and advocate for higher pay for me to whoever they were representing.  I even had one recruiter who, when he heard I was close to an offer, get back to me the same day after a phone screen with an expedited interview process involving a call with the VP engineering \\*the same day\\*.\n\n&amp;#x200B;\n\nJust thought I would share my experience.  I did not really do anything special for interviews or interview prep, but I think I managed those phone screens really well, and that is not something we talk about often on this sub IMO.  A lot of us could get disproportionately great results for the effort invested by being more mindful about key points in the process that we tend to not focus on/not like (particularly when you are asked about comp expectations).  This is an opinion formed from anecdotal observations and personal experience, so take it for what it's worth.  Also, luck played a huge role, of course.",
      "subreddit": "cscareerquestions",
      "score": 1475,
      "url": "https://reddit.com/r/cscareerquestions/comments/ldnkkw/went_from_90k_to_140k_by_managing_phone_screens/",
      "comments": [
        {
          "body": "imagine feeling bad about not responding to every recruiter on linkedin lmao",
          "score": 721
        },
        {
          "body": "[deleted]",
          "score": 79
        },
        {
          "body": "How's tech in the Chicago land area? Chicago is near the top choice for me to move to as far as cities are concerned, but I know it's not a primary or maybe even secondary tech hub",
          "score": 113
        },
        {
          "body": "Only works if you are past entry level which 90% of people here aren’t",
          "score": 114
        }
      ]
    },
    {
      "title": "Why are there so many crypto companies/jobs still?",
      "body": "Every day or two I get a recruiter asking me to interview for a defi startup or crypto trading company\n\nAnd I interviewed at one just for curiosity and the target salary range was surprisingly pretty solid… 180-220k base, with up to 20% bonus and 0.5% equity.\n\nEven assuming the bonus and equity are 0$, that’s still a hefty amount to pay for a supposedly dead industry\n\nWhere are these companies getting money? I thought crypto was a red flag these days",
      "subreddit": "cscareerquestions",
      "score": 519,
      "url": "https://reddit.com/r/cscareerquestions/comments/171ugo3/why_are_there_so_many_crypto_companiesjobs_still/",
      "comments": [
        {
          "body": "Soon: crypto LLM",
          "score": 469
        },
        {
          "body": "You also have to consider that any of these crypto/defi startups have to pay a premium if they want to attract any half-decent engineer. Everybody knows that most crypto use cases were just scams, and the startup will likely run out of money soon enough.\n\nSo yeah, 200k base but realisticaly it's more of a short term contract, hence the high salary.",
          "score": 385
        },
        {
          "body": "Crypto PM for two years. \n\nThere is a lot of scam projects, and then there is a projects that doesn’t make financially sense because they don’t solve a use case outside cryptos own small world. \n\nI’m in doubt if these serious projects are scams because sometimes they are so stupid. Take DEFI swapping places like Uniswap. They are highly financially inefficient. In order to offer users a swapping between two tokens without extremely negatively impacting the price you need 100 times more funding in the pool than the user is trading. If the user wants to sell $10,000 of tokens, then the pool needs to be worth $1,000,000. \n\nThan means that only high demand pools makes sense. I seen projects deciding to go for the low demand pools as their niche and get funding from a chain to build it. If you create 20 pools with $1,000,000 in each pool and it gets $10,000  (which is high for Los dørmand pools) worth of trade per day, and there is a 2% fee om swapping, then they will have a revenue 146,000 per year to pay those funding the pools, which is 0.73% return per year on the funding. \n\nThis model has no income for the developers, so they issue token, but as the value of a token that requires people to lend you money at 0,73% is at best questionable. Here it is that I get in doubt about if the devs are so dumb that they don’t see this or if they just want to dump their token on some suckers. \n\nI saw no wish in the space to solve any real use cases, only obsessing that this project is going to be a success because the code is cool or similar. No user ever chose their email provider based on the database it uses. \n\nI lean towards the stupidity over scam.",
          "score": 157
        },
        {
          "body": "Many of them received venture capital funding in 2022 and still have big piles of money left.\n\nAnd regardless of what you think of crypto, the engineering-side of things is not trivial and usually requires at least a handful of senior engineers familiar with some niche technologies. To get those engineers, they have no other choice but to offer relatively high pay.",
          "score": 21
        },
        {
          "body": "[deleted]",
          "score": 180
        }
      ]
    },
    {
      "title": "1.5 years unemployed, 1.5 years of (professional) experience. I finally got a great job offer. It doesn't feel real. Wanted to share some good news, my story, and what helped",
      "body": "Background: Mid 2022 bootcamp grad. Got a job as a mostly frontend developer for 65k. Was there for \\~1.5 years, after our big project, they laid off about 1/4 of the company.\n\nJust had an 8 round interview process, I thought there wasn't a chance. Got the call, they said it was an easy decision for them and I signed the offer for 115k today. I'm over the moon.\n\n\n\nSo what worked / didn't work\n\nApplying:\n\nHad 3 referrals, none turned into interviews. I think the value of referrals have gone down dramatically in the last couple of years and that a lot of companies stopped giving referral bonuses\n\nI didn't get a single entry / jr level interview. I think the no cs degree hurt for those roles, so many say 1-2 YoE so I thought I was a shoo-in, nah\n\nMy success rate fell sharply after 6 months unemployment. Success rate improved dramatically (only for mobile positions) after publishing a personal project (this was about a year into unemployment, I had a single interview in months 6-12 and it didn't go past hiring manager)\n\nNo interviews from linkedIn job apps, despite targeting same day postings\n\ngot 2 interviews from hiringcafe and an ai auto fill extension (simplify)\n\nI went in-person and dropped off a resume to two local companies that I saw had openings. One gave me an interview (50% success rate, you were right Grandpa)\n\nThe mobile position I got, came from linkedIn. I stumbled across the tech lead of a local company posting about the opening, there was no linkedIn job posting. I messaged him about my app and he said he tried it out, liked it and wanted to interview me.\n\nI think the other 2 or 3 came from hackernews, again, where I was talking directly to somebody technical about my app.\n\nI tried linkedin premium and messaged a ton of hiring managers / recruiters, nothing came from those\n\nI had 6 or 7 interviews in the last year and a half, all above my last role. Was definitely unprepared for the first few, feel I went from jr. to mid level while unemployed.\n\nBut yeah, highest success rate was finding local companies and contacting somebody who was technical (and part of the hiring process) about what I was working on\n\n  \nTechnical Interviews:  \nI was grinding leetcode for a bit but found it not to be worth while (past getting comfortable with mapping and array, obj, string manipulation). I did have some coding challenges but they weren't leetcode mediums or hards, either can you fetch data, format / display / style it or a leetcode easy to see if you can code (though I didn't interview at major companies).\n\n I did have two system designs interviews earlier on that I wasn't prepared for. And one later on that I knew was coming and spent a week cramming for. Did really well in that and moved to final round but didn't get job. My recent interview didn't have a strictly system design round but a lot of topics I had studied did come up in conversation and I'm glad I was able to talk on them\n\nAnother thing that was a huge help was I was MUCH less stressed about the recent interview. I thought I wasn't going to get it, was working as a bartender so had money coming in, might as well see where it goes and try to learn something. Most of the interviews I had when I was deep into unemployment, I would get 2-4 hours of sleep the night before because I was so stressed. Somehow, the night before this company's technical, I had planned on doing leetcode all night but I was strangely tired, thought I wasn't going to get the job anyways and didn't want to waste my night off doing coding problems. I ended up conking out hard way earlier than I typically go to bed and had the best nights rest I've had in two years. I truly don't know how it aligned that way but being well rested was way more valuable than a couple more leetcode problems\n\nBehavioral interviews:\n\nThe 3 companies I interviewed with - post releasing my app - were much more interested in my app than my previous role. They were all for mobile positions.\n\nI also started keeping an interview prep journal that had 6 star stories (and what questions they could be used in) as well as all other questions I've been asked in interviews (and had a separate tab for system design notes)\n\nI would often get a \"how's your week going\" question at the start of interviews. Early into unemployment, I thought, 'I don't want to waste their time', and just say something like, 'It's been a good week, have been looking forward to this interview.' and let them jump into it from there. After it happened a few times I realize they want to see if they can have an actual, casual conversation with you. So in these last few interviews, I always made a point to spend literally a minute, 2 max, chatting. Just something like an event that weekend I was excited for. The recent interview the guy had mentioned having a kid, the next interview I asked what his kid was dressing as for Halloween\n\nThe other thing that was a big help was the CEO really liked me. I really didn't understand the company's industry, so I spent a couple of hours with ai learning about it, making sure I knew some basic terminology, read articles about the company, and had actual, non fluff questions, about the company and the industry for the CEO. In the middle he mentioned being surprised by the questions\n\n\n\n65k -&gt; \\~27/hour -&gt; 115k   \nAgain, absolutely over the moon. Very excited, will be working hard to make sure I continue to grow and never go through such a grueling unemployment period\n\nTl;dr  \nTry talking to technical people directly. Look local. Have some system design knowledge. Build something with users. Be well rested and sociable. Be able to talk about the company, past being a developer. Good luck to those searching and be easy on yourself, it's hard out there.",
      "subreddit": "cscareerquestions",
      "score": 312,
      "url": "https://reddit.com/r/cscareerquestions/comments/1p3lq4x/15_years_unemployed_15_years_of_professional/",
      "comments": [
        {
          "body": "Congrats! Sounds like you worked hard for it!",
          "score": 52
        },
        {
          "body": "Thank you for your detailed post. And congratulations! BTW 8 rounds of interview is insane but glad you got it.",
          "score": 43
        },
        {
          "body": "Well done. As a bootcamp grad myself (2018), I love hearing about people beating the odds. \n\nSome things I want to highlight from your post, in case people don't read it all:\n\n&gt;Just had an 8 round interview process\n\nThis is insane, in any job market. If they aren't FAANG, they need to chill out with this.\n\n&gt;No interviews from linkedIn job apps, despite targeting same day postings\n\nGhost postings. LinkedIn lets this go unchecked. I've lost trust in them because of this.\n\n&gt;I tried linkedin premium and messaged a ton of hiring managers / recruiters, nothing came from those\n\nProof that paying for LinkedIn premium will not work, and that people can save themselves $60(?)/month.\n\n&gt;I was grinding leetcode for a bit but found it not to be worth while \n\nThis is how people burnout. Glad you recognized this after a while.\n\n&gt;I truly don't know how it aligned that way but being well rested was way more valuable than a couple more leetcode problems\n\n100%. Very underrated with all the chaos of today's market.\n\n&gt;Be well rested and sociable.\n\nKey word: *sociable*. A lot of people in this sub don't understand this.\n\nBest of luck in your new role. Glad it worked out.",
          "score": 16
        },
        {
          "body": "So so proud of you stranger! You’ll achieve many more amazing things",
          "score": 4
        },
        {
          "body": "Congratulations,  what did you do to prep for system design",
          "score": 3
        }
      ]
    },
    {
      "title": "Software Developer with 5 YoE getting lots of rejections, feeling defeated",
      "body": "I'm not sure if all these rejections I'm getting is due to market conditions, or because my resume sucks and I don't look as good as I thought on paper. Maybe it's just a combination of both things. I've been applying to jobs left and right and almost every time I get an email from a company it's a rejection email... I'm not tracking my applications but I think I've applied to at least 80 jobs and out of all these I've only gotten like 5 interviews max. Before I started this process I genuinely believed I'd be getting interviews even if they rejected me afterwards.\n\nI know lot of people here say this is a number game and you just have to grow a thicker skin and keep applying but getting all these rejections even when you feel you are a good fit for a position based on the description is absolutely soul crushing. I've applied to positions that I check almost all bullet points and I don't even get a first interview. Makes me wonder, what on earth are these companies looking for????\n\nThis morning I woke up and the first thing I saw on my phone was 3 rejections emails, this made me feel a bit down and I guess I just needed to take this out my chest because as I'm writing this I'm feeling better. Not all is lost tho, I have 2 interviews lined up today from some recruiters that reached out to me on LinkedIn, so there's some hope.\n\nI would appreciate if you guys could check my resume and give me your honest opinion and some advises to improve it. I've been told that my resume template is a bit boring and that I should avoid 2 pages but I don't know how to fit all my experience in just one page. Keep in mind that I'm based in LATAM and my target are remote positions with USA clients.\n\nResume: [https://drive.google.com/file/d/1xkPqR3QSB9ie7\\_4fCC\\_fDAGG1RVspQeu/view?usp=sharing](https://drive.google.com/file/d/1xkPqR3QSB9ie7_4fCC_fDAGG1RVspQeu/view?usp=sharing)\n\nThanks in advance!!\n\nedit: link\n\nedit2: Thanks everyone for their input. I've gotten lot of feedback about how having 4 jobs during a 5 years period could look bad on my resume. I'm thinking that I'll have to combine my first 2 jobs into one and made it look as if I worked with 2 different projects. Another thing lot of people have recommended is to shrink my resume to 1 page so I'll work on that too. Again thanks a lot guys.",
      "subreddit": "cscareerquestions",
      "score": 397,
      "url": "https://reddit.com/r/cscareerquestions/comments/14sak3t/software_developer_with_5_yoe_getting_lots_of/",
      "comments": [
        {
          "body": "A recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface .\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n&amp;#x200B;\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of r/reddit.com, who are the admins of the site: message [/u/reddit](https://www.reddit.com/u/reddit/): submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on [r/reddit](https://www.reddit.com/r/reddit/), such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at [r/ModCoord](https://www.reddit.com/r/ModCoord/) \\- but please don't pester mods you *don't* know by simply spamming their modmail.\n3. **Boycott** ***and*** **spread the word...to Reddit's competition!** Stay off Reddit as much as you can, instead, take to your favorite *non*\\-Reddit platform of choice and make some noise in support! \n\nhttps://discord.gg/cscareerhub\n\nhttps://programming.dev\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "&gt; Keep in mind that I'm based in LATAM and my target are remote positions with USA clients.\n\nSo you are simply facing incredibly stiff competition from all over the world. \n\nYour resume link doesn't work by the way.",
          "score": 553
        },
        {
          "body": "You’ve had 4 jobs in 5 years, and now looking for a 5th. Probably some percentage of places are getting scared off thinking you’ll leave after a year.\n\nBtw, your success ratio is higher than mine (I’ve got 4 YOE) so don’t get too down on yourself.",
          "score": 166
        },
        {
          "body": "[deleted]",
          "score": 110
        },
        {
          "body": "Tbh you are trying to get jobs against everyone in the world, are international AND had a lot of jobs in a small time frame, surely that is not helping you at all.",
          "score": 129
        },
        {
          "body": "5 interviews from 80 applications is an ok rate in the current market. Your resume clearly doesn't sparkle but it is getting you enough at-bats.\n\nTaking a look at your resume, it's bad. Trim to one page. Half as many bullets. Half as long bullets. Your first bullets here are all weak -- I need a clear explanation of what your role was and why it mattered to the business. Don't wrap lines unless you have something important to say. Communicate tersely and emphasize business value. One in particular to fix: you spent 3 lines on the node-based editor and I still have no idea what that is.\n\nIf you are aiming for remote positions in US, you must understand that the total number of postings of that nature shrunk by at least 10x in the past year, and there are very strong programmers willing to take big pay cuts to secure them. Expect it to be a uphill battle to get such a role.",
          "score": 76
        },
        {
          "body": "Get that on one page, and focus on the tech in which you are trying to get the next position.\n\n&amp;#x200B;\n\nStuff like that doesn't really tell much:\n\n&gt;\\- Developed and distributed guidelines for setting up VS Code with Prettier and ESLint to enforce code formatting and rules for maintaining code standards.  \n&gt;  \n&gt;\\- Improved code quality and consistency by reviewing code and providing feedback to team members.  \n&gt;  \n&gt;\\- Strengthened code quality and reliability by writing unit tests for the API application using Xunit.\n\nNo need for a whole paragraph, maybe mention it in tag,  like TDD, xUnit ...\n\nEverything reads like you are trying to reach some *imaginary* word count.\n\nSorry, but seeing that CV makes me question this:\n\n&gt;\\- Conducted interviews for candidates, resulting in the hiring of qualified developers for the team.",
          "score": 26
        },
        {
          "body": "You're not defeated, you have just been humbled. Many who have experienced high income and job hopping at will are now experiencing the real economy of regular people. Yeah, the same ones some folks say \"You should change careers if the pay is too low\" without knowing the full story.....they have mouths to feed and took any job they could find.",
          "score": 44
        }
      ]
    },
    {
      "title": "Had a one way video !nterview with a company. Recruiter told me they \"didn't like my look\". I'm a minority.",
      "body": "I'm a senior developer who lives out on the west coast. I've currently employed but I have been looking for work because my company's financials aren't doing so well. A few weeks ago a recruiter reached out to me about a remote job and it looked like it was a good opportunity. It was for a family run company that was located in rural Ohio who was just recently getting into the idea of remote workers.\n\nRecruiter was very open and honest and said this was an \"old school\" company. I thought I knew what that meant, but man there was a whole other side to that statement. So I had a few screening interviews with the recruiter and she told me that they wanted me to do a 1 way video !nterview (I have to format that word that way or else this post will be auto filtered out). \n\nFor those of you that are unfamiliar, these are one of those shitty \"audition\" type !nterviews where you get asked questions and record your answer to the camera. There is no other person on the other side, so you don't get to learn anything about the company culture or anything. I was told to dress up for it despite it being in my own house, which again was weird as hell. So I shaved, put on a nice shirt, and did this thing in my own home.\n\nRecruiter got back to me the next week and said they weren't going forward. She said the feedback was \"they didn't like your look or poise\". Not my technical skills or my experience.... my look. I should point out that I'm latino, and I have a latino name. This fucking INFURIATED me but I hid it from the recruiter. I looked up the town's demographics and it's 99% white and the county went 80% for a certain presidential candidate. I didn't even think about any of this until I got the news that I was denied because of my \"look and poise\".\n\nI know this topic can be uncomfortable, but it's something I felt I should share. I'm shocked that this kind of thing is still going on. I'm not going to name and shame them in case I decide to escalate this, but I had to share. Have you ever experienced anything like this? Is this kind of an unspoken thing that people still experience in the Midwest or elsewhere? I would never expected this coming from the West Coast.",
      "subreddit": "cscareerquestions",
      "score": 1472,
      "url": "https://reddit.com/r/cscareerquestions/comments/jsbmyq/had_a_one_way_video_nterview_with_a_company/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 776
        },
        {
          "body": "To all the people saying \"Do you really want to work at a company where they would treat you differently?\" etc. etc.\n\nNo, of course not. OP is not stupid, and those kinds of comments which are pointing out the obvious seem a bit insulting.\n\nBeing discriminated against is an incredibly shitty feeling. It's something you literally have no control over.\n\nSorry this happened to you OP. I don't know if there is any action you can take or not, but as someone suggested, try r/legaladvice",
          "score": 488
        },
        {
          "body": "&gt; (I have to format that word that way or else this post will be auto filtered out). \n\nWhat the fuck mods this is a shitty rule.",
          "score": 57
        },
        {
          "body": "I would recommend reporting to the company’s state’s Department of Labor or equivalent. I wouldn’t expect any response, but you’re probably not the only person they’re doing this to. If a DoL sees a pattern of behavior from a single company, they’re more likely to investigate",
          "score": 363
        },
        {
          "body": "That “one-way interview” was already a huge red flag. Glad you dodged that bullet.",
          "score": 29
        },
        {
          "body": "[removed]",
          "score": 224
        }
      ]
    },
    {
      "title": "Unpopular opinion: Unforced errors",
      "body": "The market is tough for inexperienced folks.  That is clear.  However, I can’t help but notice how many people are not really doing what it takes, even in good market, to secure a decent job (ignore 2021-2022, those were anomalously good years, and likely won’t happen again in the near future).\n\n\nWhat I’ve seen:\n\n1. Not searching for internships the summer/fall *before* the summer you want to intern.  I literally had someone ask me IRL a few days ago, about my company’s intern program that literally starts next week…. They were focusing on schoolwork apparently in their fall semester , and started looking in the spring.\n\n2. Not applying for new grad roles in the same timeline as above.  Why did you wait to graduate before you seriously started the job search?  \n\n3.  Not having projects on your resume (assuming no work xp) because you haven’t taken the right classes yet or some other excuse.  Seriously?\n\n4.  Applying to like 100 roles online, and thinking there’s enough.  I went to a top target, and I sent over 1000 apps, attended so many in-person and virtual events, cold DMed people on LinkedIn for informational interviews starting my freshman year.  I’m seeing folks who don’t have the benefit of a target school name literally doing less.\n\n5.  Missing scheduled calls, show up late, not do basic stuff.  I had a student schedule an info interview with me, no show, apologize, reschedule, and no show again.   I’ve had others who had reached out for a coffee chat, not even review my LinkedIn profile and ask questions like where I worked before.  Seriously?\n\n6.  Can’t code your way out of a box.  Yes, a wild amount of folks can’t implement something like a basic binary search.\n\n7.  Cheat on interviews with AI.  It’s so common.\n\n8.  Not have basic knowledge/understanding (for specific roles).  You’d be surprised how many candidates in AI/ML literally don’t know the difference between inference and training, or can’t even half-explain the bias-variance trade-off problem.\n\n\nDo the basic stuff right, and you’re already ahead of 95% of candidates.\n\n",
      "subreddit": "cscareerquestions",
      "score": 289,
      "url": "https://reddit.com/r/cscareerquestions/comments/1kgwxhp/unpopular_opinion_unforced_errors/",
      "comments": [
        {
          "body": "Yeah, people should be doing this stuff. But I also think that some people don't know about it- I myself didn't know some of these things when I was a student (like looking for an internship a full year beforehand). I just wasn't exposed to it. Some of these are purely a person's mistakes, some of them I think just aren't as common knowledge or people are unsure if it's appropriate (like cold messaging people on LinkedIn).",
          "score": 154
        },
        {
          "body": "The AI thing kills me. It’s so obvious so quickly.",
          "score": 55
        },
        {
          "body": "1. a year? most don't even open applications at that point\n2. Most cs courses are 90% theoretical and teach problem solving, graduating with a super basic project like a calendar app as your only real coding experience is pretty common -\n\nThe first 2 years on the job you learn to actually code in the real world  - unless the company is shit and not really looking for graduates but actually looking for more experienced devs they want to underpay\n\nthe rest I agree with",
          "score": 50
        },
        {
          "body": "\\9. Defeatism from lurking this sub too much.",
          "score": 30
        },
        {
          "body": "application volume is so important you really have to be thinking in the 1000's",
          "score": 24
        },
        {
          "body": "I feel like you're turning this into a binary. You can do most of the basic stuff right and still make the occasional mistake, it doesn't mean that you're not doing what it takes, it just means you screwed up a few times.\n\nFor #6, when I was job hunting I definitely choked on some very easy interview questions where I knew the answer, used the answer every single day while coding, just panicked momentarily. I also passed other technical interviews that were much harder.\n\nOr for #5, during my job search I forgot that an interview was scheduled for a Tuesday and not a Thursday. Beat myself up for the rest of the day about that one and had to get my partner to write the apology email because I was too ashamed to. (The recruiter was actually really understanding about it and I did progress to the next round. Meanwhile, maybe 3-4 recruiters for other companies ghosted me and I never heard a word from them....)\n\nEventually I did get a job, but I don't think it was because I did anything outstanding -- I happened to talk to the right person.",
          "score": 18
        },
        {
          "body": "None of this is incorrect about the job market as it is, but this is kind of coming across as elitist, and unless you are a decade deep into your career or have some in-demand specialization you are also lucky to simply have a job in the current climate.\n\nNot everyone had the luxury of focusing purely on academic achievement during school, some of us had to work manual jobs and survive. It used to be that internships and personal projects were good ways to get your foot in the door instead of bare minimums to get an interview, and this higher bar for literally no more pay (and in fact what appears to be a stagnation or even a contraction in wages) is part of what's enshittifying this industry. Especially when it really boils down to the fact that nobody wants to train juniors anymore far more than it has anything to do with incoming talent.",
          "score": 15
        },
        {
          "body": "Some of these points are really irrelevant and quite tone deaf because there will always be overachievers and those doing just enough. If everyone is an overachiever then there will be no overachiever. If everyone sends over 1000 apps then you would have to send over 2000 apps. We interviewed 12 candidates out of 500 for internship this year so it's really irrelevant if we get 1000 or 200 or 3000 apps, result is the same. The number of interviews or roles available doesn't scale with applicant effort. There's always going to be winners and losers but the market will dictate how many winners vs losers there are.\n\nThere are going to be those who gets ahead while doing less than those who do more. Posts like this might aim to motivate, but they often verge on blame. Not everyone has the same starting point, resources, or guidance. If the market is going to get worse then it's better to adapt to a changing world then just keep doing the same thing and expecting different result.",
          "score": 36
        }
      ]
    },
    {
      "title": "I feel like this industry is ruining my life.",
      "body": "Basically, I graduated with a CS degree and work as a full stack dev. Had the job for about a year. This job is toxic as hell. Basically, if you aren't obsessed with code every waking minute of your life and aren't a mid-level/senior-level developer by 7 months, your targeted on the stack rank curve. Sorry, I like having a life outside of my job.\n\nBut, since I am about to lose my first job soon (yes, PIP happened and as is common sense on here, that isn't fixable. No it isn't before someone jumps in and says work 80 hours a week to improve). Doesn't matter I have evidence I'm improving or I am doing just as much work point wise as other devs. I was also told I was no longer a junior developer after only after 7 months on the job. This was after they pretty much PIP and fired a junior developer after 5-6 months on the job.\n\nI have been applying out of this job and trying my best to leave. But, so far the interviews have been very difficult. One asked me a leetcode hard problem, another one asked me hyper specific stuff and I guess didn't like my answers, and the questions vary. \n\nI am doing my best to learn. I am making a new side project and practicing leetcode. I have applied to 200+ jobs.\n\nBut, I worked in another industry before this and I just wonder, what the hell am I even doing? \n\nLike, I never heard of a job that makes anyone study as hard as they do to even get an interview, let alone pass it. Nevermind, having to keep up with all this outside of work even if you have a job.\n\nIt is ruining my life. I am constantly stressed out with not getting a break from this work. It literally seems you don't have an option to just chill out because if you do, your manager then targets you for \"not being passionate enough\" and you lose your income.\n\nYes, I am fine with learning new stuff and get it is part of the industry. But, guess what? I would also like to spend time with my girlfriend, maybe watch a TV show after work, have time to work out, and do other things like socialize. It feels like this industry just expects you to forgo all that to even keep up with expectations.\n\nI'm literally willing to take a pay cut to just have a normal 40 hour job without all these insane expectations. Just enough to afford a small house and food on the table. Literally, I don't need the six figure salaries everyone on here seems obsessed about. What good is any of that if you have no life outside of work and you just die with a big bank account?\n\nWhere can I go to just have a normal 40 hour workweek and not all these insane expectations? Is this what I really have to look forward to in this industry? Toxic managers, toxic senior \"rockstar\" devs who look down on you if you have a life, and endless studying outside work?\n\nPlease tell me there are more options than this in this industry.",
      "subreddit": "cscareerquestions",
      "score": 927,
      "url": "https://reddit.com/r/cscareerquestions/comments/gidh92/i_feel_like_this_industry_is_ruining_my_life/",
      "comments": [
        {
          "body": "The fact that they are PIPing junior engineers out of the company in six months or so speaks volumes about the management.\n\nLet me guess, expectations are never clearly communicated? You’re left out of the loop on things then expected to know about it? There’s moving goal posts for projects, where whatever you do is never quite good enough or what was expected, even when you did exactly what was asked?",
          "score": 776
        },
        {
          "body": "Assuming US resident with US based employer. Location is relevant; I'd give someone different advice if they're competing exclusively in a San Francisco, Seattle, New York, Chicago, Austin, \"insert tech hub here\" job market. \n\nMany companies (not all companies) use PIPs exclusively as a device to fire someone for cause. In those cases, working ~80 hours won't save you anyway. \n\n&gt; I have been applying out of this job and trying my best to leave.\n\nSuggestion: Avoid talking about how much you hate your current employer if you can. To someone interviewing you, it makes it look as though you're running away from something. You want to present yourself as a candidate that's running *towards* the particular company/team/position.\n\n&gt; Where can I go to just have a normal 40 hour workweek and not all these insane expectations?\n\nJust ask about this stuff during interviews. I always ask how often people on the team(s) I'd be involved with at `Job+1` are working lengthier hours, or in a \"crunch time\" mode. Hand-wavy answers register as a red flag automatically. Optimizing for \"employers that aren't assholes\" isn't super tricky. It does mean you don't always get the most call-backs after interviews, and it may mean you don't get the absolute biggest pile of money out of all the offers you're considering.",
          "score": 211
        },
        {
          "body": "[deleted]",
          "score": 80
        },
        {
          "body": "&gt; Please tell me there are more options than this in this industry.\n\nThere are more options than this in this industry.\n\nyou might be in the wrong subindustry or wrong area. You did not include context of area in your post, so it sounds like you're probably working Rainforest Web Svc in Seattle with stack rank.\n\nFind a nicer place. There are many out there. I was not chill enough to work in Portland, where QoL and WLB is treasured more.",
          "score": 135
        },
        {
          "body": "If \"senior\" to them is under a year from fresh grad you need to get out.\n\nThat in itself is indicative of absurd burn rate, you are cattle to them. what the fuck is the guy sitting at 2 years a fucking ancient.",
          "score": 88
        }
      ]
    },
    {
      "title": "Has anyone discovered that they do not have imposter syndrome, and that they are a genuine imposter?",
      "body": "I'm curious to find out since I tend to only hear about people overcoming Imposter Syndrome, but never about those who were genuine imposters who left the field. What do these people move on to?\n\nEDIT:\n\nTo address some of the questions regarding what I meant by genuine imposter, I meant it by someone who lacks talent in software/coding and cannot perform at the same level as the average developer with similar amounts of time spent on training/learning. Once in a while, you come across something that might be considered as basic for professional engineers that you do not know which catches you off guard.\n\nHere are a few example scenarios to consider.\n\nScenario 1:\n\nYou claim to know a particular language, but google for syntax to use certain libraries.\n\nScenario 2:\n\nYou claim to a software engineer and have worked on several small personal projects, but fail on leetcode easy questions during an interview.\n\nScenario 3:\n\nYou claim to have experience in python. You have written scripts to scrape data from websites, make API calls, manipulate strings and store data in Lists and Dictionaries. One day, someone tells you to use a hashmap to store some data. But you didn't know what a hashmap was or haven't realised that dictionaries are simply hashmaps. You have always used dictionaries because \"it just works\" without knowing what goes on under the hood.\n\nScenario 4:\n\nYou claim to be an iOS mobile developer. You have written elementary CRUD apps by following tutorials/stackoverflow and published them on the app store but no one ever downloads them.  Your apps crash randomly due to memory leaks, but you do not know why. When you show your code base to other experienced software engineers, they discover you use an MVC architecture with a large Controller. Your code is functional but does not follow any particular Software Design Pattern and it has no unit testing set up.\n\nScenario 5:\n\nYou claim to be a data scientist. You have some experience with the commonly used python libraries (scikit-learn, tensorflow, pandas, numpy, seaborn, etc.) with the help of Google and Stack Overflow. You can perform Exploratory Data Analysis on the dataset. You build your models by simply calling the standard algorithms from libraries with some understanding of when to use them. You have gone through the ML courses on Coursera and DataCamp like everyone else. You do not have a PhD. You have not won any Silver/Gold medals in Kaggle competitions. You have not worked with Big Data tools like Hadoop, Hive, Spark. You have not written an ETL pipeline. (Some might argue that's not the job of a data scientist.) You rely on Google/StackOverflow for certain complicated SQL queries.\n\nScenario 6:\n\nYou claim to be a Machine Learning Engineer. You have used tensorflow, pytorch and deployed models to the cloud with docker containers. You have not coded backpropagation from scratch. You have not published any groundbreaking paper in top AI conferences. Your work is derivative in nature by taking current open-sourced State-of-the-art models and with little modification, train them on enterprise data.\n\nScenario 7:\n\nYou claim to be a Full Stack engineer. You have used html, css, javascript, react to put together a basic CRUD website on the frontend. However, you have always relied heavily on frontend frameworks like bootstrap, foundation, material-ui, tailwind and made changes from there. The attempted changes that you made are pretty much by trial and error based on targeting the class/id of the element but sometimes it doesn't work and you are unsure why. You rely on Google/StackOverflow on how to center a div. If you were to write the HTML/CSS/Javascript from scratch, you would have trouble creating a decent responsive website. Some elements are out of position or look too big when viewed on a mobile device and you take a long time to resolve them. You have not created a new, reusable frontend component of your own. (eg: a browser-based code editor) \n\nOn the backend, you have used node.js, flask, django, SQL &amp; NoSQL databases, S3, EC2 instances. You have dockerized your web app or used serverless to deploy them on several cloud providers. However, the application has been written in a monolithic architecture. You have trouble splitting it up into a microservices architecture while still maintaining security. When someone asks you to estimate the server costs for a new project, you have trouble answering them. You are unaware of the potential drawbacks and scalability issues of the system architecture you have chosen. You do not know if the REST API you have designed is any good but it works. You do not know how to setup a CI/CD pipeline with Kubernetes and Jenkins. You only know the few basic git commands: pull, commit, push, branch and have never used rebase. You do not know if the database design you have come up with is any good or if it is scalable.\n\n&amp;#x200B;\n\nI could go on with more examples but I think the post is long enough as it is. I'll be more specific about the different roles in the future if need be.",
      "subreddit": "cscareerquestions",
      "score": 752,
      "url": "https://reddit.com/r/cscareerquestions/comments/py0mxu/has_anyone_discovered_that_they_do_not_have/",
      "comments": [
        {
          "body": "I have seen real impostors in my last job. They are fucking assholes who kiss asses and throw everyone under the bus. Some got fired, some got promoted to management.",
          "score": 312
        },
        {
          "body": "I was a genuine imposter when I just started my job but not anymore. I had a guy in India on call that I would pay a couple bucks every time I got some work I couldn't do. True story.",
          "score": 272
        },
        {
          "body": "Usually genuine imposters can keep it up until they bite off more than they can chew. Look at Elizabeth Holmes.",
          "score": 341
        },
        {
          "body": "you outsource your work to some guy in India",
          "score": 285
        },
        {
          "body": "I dislike the way “impostor syndrome” is used in tech. I got told I had “impostor syndrome” when I was a fresh boot camp grad and worried about finding my first job. No, I was accurately assessing the situation, which was that my skills and experience level were not high enough for most employers to want me. I feel like the economic incentives on boot camps make this worse, where they have to justify their existence by pretending the inflated promises they made about how you’d get a job making 80-100k right out of boot camp were accurate, and so they give you bad career advice.  Combine this with “wish list” job postings that say they want an “entry level” engineer with 3-5 years of experience, and resumes being screened by recruiters who don’t know the difference between Java and JavaScript, and you’ve got a whole mess when it comes to the relationship between people’s skills and the jobs they can get. \n\nI don’t know what your situation is, OP. If you’re worried you’re “really an impostor” you should make a post about what you’re struggling with, what kind of job you have, what you feel you’re not qualified for, and we can help you figure out where to focus on improving. I don’t think there’s any point in feeling guilty about it unless you’ve deliberately lied or had some measurable negative impact on others. Even then, the only way through is forward—figuring out what sort of job you want and what you need to learn and do to get there.",
          "score": 129
        },
        {
          "body": "&gt;\tWhat do these people move on to?\n\nReddit mod.",
          "score": 210
        }
      ]
    },
    {
      "title": "The average CS graduate.",
      "body": "This is a repost from a few years ago. Although it wasn't written by me, it fits my situation perfectly and I could really use some realistic perspective on this.\n\n&amp;#x200B;\n\nI think being on this and the CSmajors subreddit constantly has warped my perspective immensely when it comes to comparing my own skill set to other \"average\" CS grads. Like, I'm unarguably one of the better students in my class (good GPA, one of the few people with projects outside of school, etc) but then I get on here and see people who've done what seems like 100X as much as me in 1/10th the time, go to target schools I either couldn't afford or couldn't get into and scoff at things that I had to really put my foot down to understand. I go to a normal state school (not in CA) with very few people who seem to see things from a similar perspective and most students don't really seem super concerned about potentially not having jobs (at least if I were to just judge them with the people who're on here being a standard).\n\nCan someone just slap me back to reality and give me some perspective on what's \"average\"? Meaning average compensation, skill sets, whether they have projects or not and how well they interview. I know it may seem like I'm trying to stroke my own ego but honestly it's more about stopping myself from freaking out (which I'm very prone to doing). Thanks for the help",
      "subreddit": "cscareerquestions",
      "score": 869,
      "url": "https://reddit.com/r/cscareerquestions/comments/mgiz4d/the_average_cs_graduate/",
      "comments": [
        {
          "body": "The problem is what they teach you in school vs what you get interviewed for vs what you do at work are all different. Sometimes hilariously different.\n\nYou could be a 2.0 student but be a leetcode savant. You could be a 4.0 student and not code if your life depended on it. I've seen both. Some are just naturally bad interviewers because of nervousness and need to work even harder. Interviews are hard if you have to also worry about not having a single offer yet.\n\nPeople seem to idolize FAANG's, but that isn't average. All I can say is don't worry about others and just focus on making yourself more hireable.",
          "score": 711
        },
        {
          "body": "[deleted]",
          "score": 918
        },
        {
          "body": "I went to a school that is ranked Top 50 for CS and probably 2/3 of students there never touched leetcode or did side projects and just got a normal 60-80k job somewhere. Only about 15-20% were the types who were hustling to get into big tech companies.\n\nLike, the top comment in this thread says that an average student gets a 100k job in HCOL but at my school which is right next to NYC, only the upper end students were getting 100k jobs in NYC (because it requires doing LC easies and lighter mediums to get into a company like JPM/Capital One) while others were getting 70-90k jobs in the city or simply had to find jobs somewhere else, because every interview in NYC requires whiteboarding/coding algorithms and your average student can't be bothered to do leetcode",
          "score": 163
        },
        {
          "body": "average is you graduate with a sub 3.0 to above 3.0 GPA and get a job at literally any old company as a web developer making anywhere from 50k-100k a year depending on location. That's literally where 90% of people end up when graduating and don't let the warped posts here convince you otherwise.",
          "score": 139
        }
      ]
    },
    {
      "title": "This is how I got a (potential) offer revoked: A learning lesson",
      "body": "I’m based in the Bay Area with 5 YOE. A couple of months ago, I interviewed for a role I wasn’t too excited about, but the pay was super compelling. In the first recruiter call, they asked for my salary expectations. I asked for their range, as an example here, let’s say they said $150K–$180K. I said, “That works, I’m looking for something above $150K.” I think this was my first mistake, more on that later.\n\nI am a person with low self esteem(or serious imposter syndrome) and when I say I nailed all 8 rounds, I really must believe that. The recruiter followed up the day after 8th round saying team is interested in extending an offer. Then on compensation expectations the recruiter said, “You mentioned $150K earlier.” I clarified that I was targeting the upper end based on my fit and experience. They responded with, “So $180K?” and I just said yes. It felt a bit like putting words in my mouth.\n\nNext day, I got an email saying that I have to wait for the offer decision as they are interviewing  other candidates. Haven’t heard back since. I don’t think I did anything fundamentally wrong or if I should have regrets but curious what others think.\n\nEdit: Just to clarify, in my mind I thought that’s how negotiations work. They will come back and say can’t do 180 but can do 170. But I guess not.",
      "subreddit": "cscareerquestions",
      "score": 362,
      "url": "https://reddit.com/r/cscareerquestions/comments/1khu4xq/this_is_how_i_got_a_potential_offer_revoked_a/",
      "comments": [
        {
          "body": "You are massively overthinking this.",
          "score": 874
        },
        {
          "body": "You did nothing wrong my man. Know your worth.",
          "score": 372
        },
        {
          "body": "If you wanted the high end of the salary band, then you made the right call, though asking for the absolute maximum is maybe a bit much.\n\nIf you wanted the job at any salary, then yeah that was a mistake. It's generally safer to say something flexible, especially in the initial conversation. You're in a stronger arguing position later. I usually just say it depends on the role/responsibilities, but the range sounds reasonable.\n\nThat said, if they're trying to pay you their minimum simply because you said it...that's not a great sign for the future. I don't want my company to give me the bare minimum. I want them to assess my worth and decide what I deserve.\n\nIf you think you nailed the interview, then 150k seems like a shit offer. Then again, employers are in control in this market.",
          "score": 126
        },
        {
          "body": "[deleted]",
          "score": 88
        },
        {
          "body": "You said above $150k. The recruiter pushed you to $180k. There are only two things I can think of going on here.\n\n1. The recruiter is a real piece of shit and is putting their thumb on the scale by pushing you to $180k so that they can tell the hiring manager you are expensive, making the candidate that the *recruiter* favors more likely to get the job.\n2. The recruiter is looking out for your best interest and doing you a favor - even if you don't get an offer. Sometimes the recruiter knows that salary will not be a factor in the final hiring decision. When I've hired, whenever there were high quality interviews, salary was the last thing I or anyone in the process cared about. Getting the call right on picking a high performer was all that mattered. Salary was only a factor when all of the candidates were meh and you didn't think getting a high performer was a likely outcome.\n\nThe reason for the dynamic in point 2 is simple. If you are a manager and hire a high performer, it makes what you deliver look good to your boss. In this scenario the boss will almost never care if the high performer's salary is high for the organization's salary bands or the salary is above market. It's the opposite. They will worry about retention if the salary is low. If you hire a mediocre performer, the boss will have questions. Being able to say that the person's salary is below market and you can't replace them without paying more can be satisfactory.",
          "score": 52
        },
        {
          "body": "If they also believe you nailed all 8 rounds then asking for top of pay band is totally justified. If the other candidates also nailed all 8 rounds it comes down to team fit more than who has the lowest salary expectation. If anything, send a follow up email saying how much you enjoyed working with everyone and think this would be a great fit for you. Otherwise it's out of your hands but you definitely did nothing wrong.",
          "score": 34
        }
      ]
    },
    {
      "title": "If you're a junior looking for your first position, READ THIS!",
      "body": "There are two reasons why companies hire juniors:\n\n1. They are a bad company and want to save money.\n2. They are a good company and want to build a strong, balanced team with seniors teaching juniors, and juniors keeping seniors stimulated.\n\nThe hard truth is that **company 2** (the good one—the only one worth working for) will **not** hire you for your skills.  \nLook at how far you've come since you started coding. Now, imagine how people who have been coding for 10 years must see you.  \nThey assume you know **nothing** and have to learn **everything**, and even if that's not 100% true, it's close enough.\n\n**So, build a Resume that shows your future employers that you are grounded in reality.**  \n**THIS IS SO IMPORTANT to understand**, or you'll end up playing poker at a blackjack table.\n\nHere's random advice in no particular order:\n\n\\- When applying, you need to show that you'll be the best **learner** they could hire, not necessarily the smartest or the hardest worker.\n\n\\- Make a laser-focused Resume that highlights a specific field (avoid generic terms like \"backend\"; consider something more specific like \"infra\" or \"SRE\")\n\n\\- You don't have to be GOOD at the fields you target, you just need to sincerely want to learn them.\n\n\\- That means that you WILL have to do multiple resumes to apply to different positions, like 2 or 3 to cover more offers. It's a pain I know but not as painful as trying to get the interviews with a CV too broadly scoped.\n\n\\- Never, ever say \"fullstack\" on your CV as a junior—it's basically a way of saying, \"I'm not really good at anything and willing to do whatever you pay me for\"\n\n\\- Show that you have a clear professional target/goal/dream in mind and are dedicated to reaching it.\n\n\\- Applying to their team means you see them as the best path to reach YOUR goals.\n\n\\- How I build my resume, from top to bottom:  \nStart with a clear scoped name, like \"Junior Python developer\" or \"Junior Devops/SRE\" or \"Front-end / React developer\"  \nA few lines about why you want to pursue this career path (your project)  \nName a few tech you're most comfortable with (your top 3, not everything you touched)\n\nYour professionals experience comes first and must take as much space as possible, it's the juiciest part for a recruiter.\n\nNext your personal project, it's better with links but not as juicy as professional experience.\n\nAt the very end, a few lines about school. Employers genuinely don't care about your school projects, everyone has some and it's in no way a good metric to evaluate your skills/motivation. They just want to know the name of your school, and the kind of diploma you got. Anything more will sound like filler bullshit\n\nHopefully this should make you look pragmatic and humble.  \nYour approach will also change— you know what you want, you target your searches better and get more replies per apply so your morale is higher.  \nRemember you’re not just looking for a position, you're looking for the best place to achieve your professional goals.  \nYou’re not asking for a favor; you are looking for a collaboration that is mutually beneficial: you don't look like you're here for the money.  \nThat’s exactly the kind of junior companies want to help grow (and keep).  \nEven if you don't believe any of it, fake it, nobody cares if you're genuine, they just want people who understand  \"the game\".\n\nObviously it's all very much from my own experience, it may not apply entirely to your situation, but a wise teacher once told me: \"every measurement is false, only the average is telling a truth\"  \nSo here's my contribution to the average.\n\nHope this helps!\n\nEdit: I did not empathize enough on the fact that this will not apply to everyone's situation so take everything with a grain of salt. I am based in Europe, there's obviously a cultural difference with US that I cannot fully grasp. That being said, those advices come from my first job as junior SRE for an US giant (100k+ employees) and I didn't have any diploma. The job was 100% legit and I got confirmation that my attitude during the recruiting process was what got me the job. (that was in 2021 tho, when the market was in a much better shape)  \n     \nI recommend reading the comment from [waprin](https://www.reddit.com/user/waprin/) which seems to reflect a very different POV that might better fit your own context (even if I don't relate with many stuff he said)\n\n ",
      "subreddit": "cscareerquestions",
      "score": 388,
      "url": "https://reddit.com/r/cscareerquestions/comments/1gm4oaw/if_youre_a_junior_looking_for_your_first_position/",
      "comments": [
        {
          "body": "Bad post, pretty classic example of the blind leading the blind on here.\n\nFull-stack is completely fine. Full-stack in today's parlance does not mean everything. Full-stack basically means you do web-dev/frontend, but won't be afraid of wrapping your head around a database schema or working with the node / rails / django / go code to move backend bits around. If you say you're \"frontend\" you might be typecast as a designer-type who mostly sticks to CSS and a little React. If you really don't like full-stack, you could alternatively say \"product enginneer\".\n\nNobody would seriously expect a \"full-stack\" engineer to do embedded programming or even machine learning so it's just a misnomer term that caught on for \"web dev who's not a CSS monkey\".\n\nBackend and infra/SRE aren't really the same thing, though there's a lot of overlap. Backend is someone who writes a database. Infra/SRE is someone who deploys it and makes sure it doesn't fall over.\n\nI would NOT self-describe as a Junior, even if it's true. You want to sell yourself as competent, junior undermines that.\n\nHonestly, the resume doesn't matter all that much. What's important is:\n\n1. Zero typos or any sort of sloppineess\n2. Highlight professional experience and education\n3. Try to highlight skills via projects that an interviewer can talk about\n4. Have a less-highlighted section with a big list of skills. It's dumb but both machines reading resumes and non-technical recruiters will look through this. Don't put anything on there you can't talk about but consider this the \"secondary\" resume, try to use smaller text\n\nBut really, resume is a small concern. Much bigger advice is:\n\n1. Realize it's the worst job market in 15 and perhaps 25 years and don't self-hate if you're struggling and hope it's yet another cycle (which it probably is)\n2. Lean into your school's help as much as possible.\n3. Interview prep as much as possible\n4. If all else fails, hustle, and realize it's a numbers game more than anything else. Hustle can come in a million ways, but things like, open source contributions, aggressively applying to roles, going to events, blogging, etc.\n\nSource: 15 yoe, including stints at Google, public Unicorns, startups, spouse is senior at Apple, was at Twitter, etc.",
          "score": 821
        },
        {
          "body": "Does anybody expect juniors to keep seniors stimulated? I've never heard that or indeed felt it in 25 YoE.",
          "score": 50
        },
        {
          "body": "Junior interview hires are a major vibe check with some competence screening sprinkled in. That was my experience as a junior, anyway. Just be cool, not a drag to be around, and willing to learn and also be willing to contribute.",
          "score": 45
        },
        {
          "body": "I feel like this post is dedicated to FAANG hiring, as outside of FAANG what's been said here doesn't make much sense.\n\n&gt;Make a laser-focused Resume that highlights a specific field (avoid generic terms like \"backend\"; consider something more specific like \"infra\" or \"SRE\")\n\nHow come backend is a generic term? You are suggesting that infra and SRE are better terms, but you do realize that backend engineering has nothing to do with infra and / or SRE?\n\n&gt;Never, ever say \"fullstack\" on your CV as a junior—it's basically a way of saying, \"I'm not really good at anything and willing to do whatever you pay me for\"\n\nSuch bad advice. Full stack as an engineering position has been around for ages and if you happen to look at job openings outside of FAANG, full stack engineering positions are not going away anytime soon. Also, calling the experienced full stack engineers out there mediocre engineers at best and / or jack of all trades is not a good outlook for you. I've worked with many full stack engineers in the past and you'll be quite surprised how much knowledge &amp; experience they've got.\n\n&gt;Show that you have a clear professional target/goal/dream in mind and are dedicated to reaching it.\n\nAs a matter of fact, juniors lack understanding of what different paths in software engineering do and / or mean, so expecting a junior to have a clear professional target from the get-go should not be really expected.\n\n&gt;Your professionals experience comes first and must take as much space as possible, it's the juiciest part for a recruiter. \n\nHow come juniors are expected to have professional experience? If a junior has a professional experience already, surely they are not juniors anymore?",
          "score": 12
        },
        {
          "body": "How many years of unemployment after graduating in Computer Science would it take for you to guess that companies would consider it a red flag / dealbreaker for a candidate no matter how targeted or polished their resume is?  e.g.  Let's say a candidate has been on the job search for hypothetically 5 years without success.\n\nIs omitting the graduation date in this case a viable strategy?  If not, is there some way to amend the resume in some other way?\n\nAnd if there's an alternative route to getting your foot in the door as a SWE no matter how late they are to getting work experience, which would that be?\n\nI'm asking since this advice seems to be aimed at recent graduates, and I don't see how any company would believe a candidate who has been inactive that long to be able to learn/ramp on time during the job.",
          "score": 22
        },
        {
          "body": "My professional experience is the juiciest part? Uhh how is that the case if I’m applying for a junior position?",
          "score": 19
        }
      ]
    },
    {
      "title": "Scored an interview at Target, not sure if I should mention the new job I have since I applied.",
      "body": "Hey guys! I just got an email today to come in for an interview. I was wondering if I should mention I have another job when they ask about schedules or something. It wasn’t mentioned on my application as I got this job after I applied to Target.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/cr2477/scored_an_interview_at_target_not_sure_if_i/",
      "comments": [
        {
          "body": "Which job do you want more? Or, do you want both?",
          "score": 1
        }
      ]
    },
    {
      "title": "Is it weird that the company won’t answer specifics on salary during interview? I asked for target salary and they went around the question and said it’s competitive?",
      "body": "Makes me seem like they are dragging me to the in person interviews to be low balled? \n\nI had this happen before, wasted a ton of time and money on attending an interview to be told it’s a low range. Maybe I’m just being paranoid? \n\nEdit: just Incase anybody else is in a similar situation and wondering about the outcome I’ll make sure to update this as the process continues. \n\nFinished interview- nothing too weird! They basically rebuilding their hr up, however no discussion of salary until offer letter. I probably won’t know if I got the job or not until a couple weeks but I’ll try and remember if I do I’ll update if the salary is low or high\n\nIt was a pretty low salary lol",
      "subreddit": "jobs",
      "score": 256,
      "url": "https://reddit.com/r/jobs/comments/az5xba/is_it_weird_that_the_company_wont_answer/",
      "comments": [
        {
          "body": "“I’m looking for something like [$75k plus bonus]. Are we in the same ballpark?”\n\nIt is normally not in your best interest to name a salary first; however, if you’re worried about wasting time to interview and they’re not sharing specifics, you’re going to need to throw something out there. ",
          "score": 255
        },
        {
          "body": "Competitive wage = what competition pays = everybody pays shit wages = shit wage.",
          "score": 80
        },
        {
          "body": "Walk away. If they aren't being up front in the interview they will be shit employers. Don't waste your time. ",
          "score": 108
        },
        {
          "body": "My advice - always establish your salary requirements.  If they're not giving you a solid answer forget them. They want to pay you less than minimum wage.  Maybe with commission.\n\n\"Competitive\" = \"barely anything with room for slight improvement\".",
          "score": 74
        },
        {
          "body": "In my experience, that has always been a red flag!",
          "score": 17
        }
      ]
    },
    {
      "title": "Inside Sales Rep interview: listing states “expected base hourly rate of $18.39-$20.43 and annual on-target earnings of $60,000.” Does this seem low for $60,000 to include everything or is the hourly additional?",
      "body": "Does this seem low? Does the $60,000 include the hourly, bonuses, and commissions in this description? Or would you think that the OTE does not include the hourly as this would seem very low. This is for a software company.\n\nJob listing states: that you would handle the full sales cycle from booking to close, and engagement. Also states: The specific hourly rate for the successful candidate will be determined based on permissible, non-discriminatory factors such as skills, experience, and geographic location.\n\nIm hoping that this OTE $60,000 is (bonuses + commission) if you hit your quota. Making your hourly rate additional. Hopefully this makes sense.\n\nAny thoughts?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1jxllp1/inside_sales_rep_interview_listing_states/",
      "comments": [
        {
          "body": "It means they have either trash commissions or you're not expected to have many sales. I avoid these sales jobs because its a glorified \"pick up the phone book and call till you get luck.\" I guarantee, they run through sales people as a means to build their own book of business without paying people much.",
          "score": 1
        }
      ]
    },
    {
      "title": "Can’t land a new job to save my life",
      "body": "I’ve been looking for a new job for almost a year now. I thought I was the problem, so I hired a career coach who helped me revamp my resume, cover letter, and even prepped me for interviews. I still can’t land a new job. \n\nNo matter what I do I’m met with endless rejection emails or post interview ghosting. If I’m lucky, they’ll hit me with the “we went with a candidate who has more education.” I have a bachelors in social work - why would they hire graduate level for entry level positions? I even got rejected from Target and a temp agency. I’m getting desperate; I’m not sure what to do anymore. I’m so burnt out and extremely unhappy it’s affecting my whole life. \n\nSorry for the long post - no one I know understands how frustrating job searching is right now. I hope something comes up soon even if it’s a temp position.",
      "subreddit": "jobs",
      "score": 590,
      "url": "https://reddit.com/r/jobs/comments/16kou5c/cant_land_a_new_job_to_save_my_life/",
      "comments": [
        {
          "body": "I’m in the same situation. I don’t know how many rejections I have had at this point and some interviews that have not made it to an offer. I have 8 years of experience and a Master’s degree. I don’t know what I’m doing wrong honestly. It’s really the job market",
          "score": 196
        },
        {
          "body": "Can’t find a job….”No one wants to work.” “Historically low unemployment rates.”  “There’s jobs everywhere.”\n\nThis is starting to feel like full-on Psych ops to me.  \nWe are being mentally manipulated.",
          "score": 208
        },
        {
          "body": "Nobody wants to hire anymore.",
          "score": 113
        },
        {
          "body": "It's a complex problem.\n\nThere is no such thing as job security, it's an illusion.\n\nThere are only temporary jobs, some may be very short, and some be longer, but there are no guarantees of any kind.\n\nThe moment online job search and job applying became possible, it started the death of job searching.\n\nBut if you physically go to any place to give a resume, they will demand you use their site with each very unique job application process, and fill out their forms.\n\nThen if they have a good hr and manager, you may get called/contacted for an interview.\n\nMaybe it's time to have us all start small businesses of some kind, because maybe jobs just need to go away for the majority of us.",
          "score": 40
        },
        {
          "body": "Same with me i can't find a job either . I hope we all find a job.",
          "score": 37
        },
        {
          "body": "The job market is the worst it’s been for 20 years ….. I do not say that lightly",
          "score": 199
        },
        {
          "body": "[removed]",
          "score": 34
        },
        {
          "body": "Same. I’ve applied to over 250 jobs. Either was ghosted or rejected. I have an interview this week, but I’m not holding my breath. I’m so burnt out. My health is suffering and I’m out of my savings. I can’t keep weight on because I’m constantly anxious or flat out panicking. I am dangerously close to losing my house if I can’t get work soon. My mental and physical health is deteriorating. I’ve applied to every job I’m qualified for. I 100% understand what you’re going through.",
          "score": 34
        }
      ]
    },
    {
      "title": "Was told that it’s a red flag after saying yes to “Are you interviewing with other companies?”",
      "body": "I thought everything was going well with this being on the final rounds of the hiring process. The hiring manager asked if I was interviewing elsewhere too to which I gave an honest answer saying yes I have been interviewing at a few other places but nothing is finalized yet. \n\nThey told me that was a red flag for them bc I wasn’t sure what I am looking for. This kind of got me thinking if I had been too honest about it but at the same time felt like them trying to avoid having any negotiations if I were to have an offer from another place.\n\nJust wanted to hear what you guys think about this bc honestly I am quite confused.\n\nUpdate: I will not be moving forward with this company. \n\nI definitely feel like I dodged a bullet. I even answered saying they are the top choice and gave them the reason as to why specifically their company.\n\nTo which they said I probably applied to those other companies for similar reasons as well and went on about how I might just pick the first job that gives me an offer and I didn’t really know where I want to be. This is despite being in the final rounds in the hiring process.\n\nI also have couple other places where I have a third interview and one with a final interview so I will be continuing that. The role is in tech sales and I have been strategically targeting companies with Saas model so definitely know what I am doing and where I want to be.\n\nUpdate 2: After the interview was done I had been second guessing myself wondering if I did something wrong. But now I feel reassured that I have taken the right approach, so I want to thank all of you for sharing your thoughts on this.",
      "subreddit": "jobs",
      "score": 859,
      "url": "https://reddit.com/r/jobs/comments/vjapkm/was_told_that_its_a_red_flag_after_saying_yes_to/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "It's a red flag for a company to think that you're only interviewing for them and them alone.",
          "score": 1169
        },
        {
          "body": "I tell companies I am interviewing elsewhere even if I'm not. This feedback is just silly and shows the hiring manager is inexperienced.",
          "score": 457
        },
        {
          "body": "Its a red flag to them, because they know they do not pay well.",
          "score": 231
        },
        {
          "body": "&gt;They told me that was a red flag for them bc I wasn’t sure what I am looking for. This kind of got me thinking if I had been too honest about it but at the same time felt like them trying to avoid having any negotiations if I were to have an offer from another place.\n\nLOL fuck these people.  You should ask them, are *you* interviewing other people for this role?  If so, why?  Do you not know what *you're* looking for?  \n\nRegardless, I think what you said is perfectly fine - it was honest, truthful and not insulting in the least.  Most people are interviewing at multiple places; if these people don't want to get it, then consider it their loss and just move on.",
          "score": 278
        }
      ]
    },
    {
      "title": "10 YoE. 4 months unemployed. 300+ applications. 10+ interviews. Finally, 3 offers. Here's what I learned 👇",
      "body": "The last time I was seriously looking for a job was back in 2020/21. My god..! So much has changed since then. The entire \"job searching\" thing has changed a lot in the last 3+ years. Terrible job market. AI. Tariffs, recession yada yada. But finally I got 3 offers, and I want to make a good faith recollection of everything I did right and wrong during this period. So it'll benefit someone. If you find this useful, pls upvote and share with friends. \n\n**Edit: someone pointed out that it's too long. I tried to compress it but it's getting tedious for me. I'd suggest to use chatgpt to summarise, if it's tl;dr**\n\n**Resume/CV**\nSo much has changed from the first resume 4 months ago to the final version which got me 7 interviews in 6 days. But if I were to summarise the key changes...\n\nTemplate:\nKeep it simple. No fancy templates. Don't fret too much about the ATS. Try to keep it one page. A summary section at the top, a decent formal passport size photo¶ (pls check footnote), your contact details, LinkedIn URL, then work history, education and skills. *references available upon request* at the bottom. That's it. Two column resumes are *absolutely fine*. I started out with a basic template from a CV writing website, paid 2$ for a one week subscription and downloaded the first draft in Word format. Then I edited the Word file for further iterations. For me, it's not worth going for monthly or annual subscriptions of these sites, but if you can afford, then it's alright I guess. \n\nContent:\nOnce your template and contact info are done, you need to work on the *actual content* that goes in your resume. So here's my piece of advice: stay original. Don't copy-paste. At the beginning, I used ChatGPT to write my career summary but I realised over time that it's not cutting it. I spent a couple of hours thinking deeply about how to summarise my career in 4 lines. It really paid off. \n\nWork history: it's best to be totally honest about it. Don't exaggerate. Coz eventually you'll get caught during the interview. STAR method is good but it may not suit every bullet point. Aim for STAR but don't tie yourself in knots over it. \n\nBut make sure every word in the summary, work history and education section is written by you (not chatgpt). Many people don't realise that everyone uses ChatGPT, including recruiters. In fact, early on when I shared my resume with a recruitment consultant, she said in 30 seconds *\"this looks like written by ChatGPT\"*. I think in the last couple of years, many recruiters and hiring managers have developed some sort of gag reflex when they see AI written resumes and cover letters. So tl:dr, it's a job you're going to be working for a few years. It's worth spending a couple of days fine tuning it. It's hardly one page. \n\nNow, the skills list is very important. Make sure you extract as many skills as possible relevant to your domain. I'd suggest to exaggerate a bit on this because this is mainly for the ATS. Stick to acronyms so that you can pack in as many skills as you can (yeah ATS is good at picking acronyms). Use ChatGPT to go through your resume and cover letter, and generate an elaborate skills list. If it generates 50+ skills, trim it down to 25 or 30 that suits you best. Break it down into subsections if needed. Usually hiring managers don't ask \"why did you put this on your skills list?\". But I'd suggest you be prepared if it ever happens.\n\n**Job search**\nHow I searched for jobs has massively changed along the way. I can write a whole thread about this but I'd try my best to summarise here. \n\nVolume vs tailored:\nMany people argue that it's better to tailor your application for each job instead of bulk application. I don't fully agree. \n\nWhat worked for me is this: do the preparation well. I created 5 rock-solid resumes, each targeting a particular sector or industry. I made sure that if a hiring manager reads my resume, he/she understands every single word in it. Trust me, if someone reads your resume and finds some *foreign* or *alien* words in it, they'll most likely not select you. Now, once you have a set of resumes ready to go, it's about volume. \n\nThis is how I did it: I'll apply in waves. I'll shortlist 20 to 30 jobs over the week. On the weekend, I'll apply all of them in bulk. Weekends are the best time to apply bcoz recruiters are most active on Monday mornings. Now, the wave method is because, it's the best way to make improvements on your resume. If you apply for 20 jobs this weekend and you get 2 calls, it means it is working. Next week make some slight changes, see if that number improves. Tl,dr: use job hunting as a process of constant improvement. \n\nUse these job aggregation sites (LinkedIn, indeed, monster etc) only for *filtering* jobs. But apply only on company career sites, even if the job has *easyApply* option. Because, if you get a rejection email from a human instead of a *no-reply* bot, you can ask for feedback. Oh yeah, you should. They've already rejected you. What have you got to lose? So go ahead and send a polite reply saying *\"thanks for letting me know, can you please give me some feedback?\"*. Many won't respond. Occasionally some might. One day I got an elaborate feedback on my resume, and most of what I've outlined here is based on that. God bless Ms Downes 🙏 (the recruiter who took time to give me feedback).\n\nAnother important thing to remember is to keep track of the companies which closely fit your domain. For instance, sometimes you'll find some odd-ball jobs from these big companies which do not have a well-established job title. But if you read the JD, you'll realise that most of it match your skill set. Go ahead and apply. Best part is that there won't be many applicants, as these jobs won't pop up in most people's search index. Less competition.\n\n**Cover letter**\nIn the era of GenAI, everyone knows that most cover letters are written by AI. So about 2 months ago I stopped uploading cover letters unless the company mandates uploading one. Earlier I used to tailor cover letters for each job. Off late, I stopped doing that. It also impacts on my volumes game. And tbh, I didn't see any negative impact after I stopped uploading cover letters. So it's upto you. If you have time and energy, go ahead. Otherwise, skip it. But if you see an *additional documents* section on the job application, it's best to upload *something* there (transcripts, certificates, reference letters etc).\n\n**Networking**\nThis is slightly overrated. Of course networking helps but many people don't know how to do it right. It's better to stick to your strengths. How I network is by attending career fairs, recruiting events and keeping track of uni and office alumni. Usually when I cold-call or reach out to someone on LinkedIn, I don't ask \"can you please refer me to this job?\". Never works. Instead, ask something along the lines of \"I saw this job, roughly 80% of the JD matches my skills, can I still go ahead and apply?\". It's better to test the waters instead of looking desperate. \n\nThat's all for now. I'll keep expanding on this thread as and when something pops up in my head. \n\nUntil then, good luck. Keep applying. Remember, this is just a phase. This too shall pass! Stay strong! 🙏\n\n**Edit: I have added a section about interviews.**\n\n**Interviews**\nUsually, most interviews follow the same format: initially a recruiter from HR will call you for initial screening (~10 mins), then they'll schedule a short introductory call with the hiring manager (~20 mins), finally there'll be a detailed *technical competency* interview (~60 mins) where, along with the hiring manager, there may be other people. Rarely, there'll be another round, usually with the director or HoD. Most of you may already know this.\n\nThis is how I prepare for the interviews: HR screening is simple. Just share personal details, nothing technical. If they ask for availability, don't say \"anytime\". Make sure the schedule works in your favour. Their main job is scheduling, so no advantage to you in making their job easier. Choose some convenient slots. \n\nNow, the initial round with the hiring manager is the most important part. This round, your main job is *listening*. Mostly the hiring manager will explain about the company, their team, what they're looking for etc. Take notes. When it's your turn, explain briefly about your background. Go chronologically backwards. Don't go indepth. Just briefly explain about your *skillset*. Now, when it's time for you to ask questions, *ask about the team members*, and their main skills. At every organisation, an opening arises because they have a gap in their skills, which they're trying to close. \n\nFor instance, let's say you're interviewing for a software developer position. This is a crude example bcoz I'm not from software background, so please don't roast me in comments. There are 5 developers in the team (python, java, cloud, ML etc). Now the Java guy has left, so that's the position they wanna fill. But in the JD they may not explicitly specify that they want a Java developer. It's your responsibility to find out what's the skill gap they're trying to close. So you can go well prepared for the next round.\n\nOnce they shortlist you for next round, this is how I do: if I have 3 days to go for the interview, day-1 I'll quickly refresh the technicals. Go through some common technical questions using ChatGPT. \n\nDay-2 is all about behavioural questions. There are some common behavioural questions (20+) which most hiring managers ask. If you're going to draw on your past experience, make sure you bring in a good variety of answers for each one. For instance, *tell me an example when you made a mistake in your past project and how did you address it?*, for which you use project X. *tell me an example when you had to go beyond your remit to solve an issue?*, for which you can use project Y. If you talk about the same projects for all questions, it may not look nice. Also, sometimes it's *perfectly fine* to bring in experience from your personal life to answer behavioural questions. \n\nOn day-3, walk through your JD line-by-line. Important thing is to flag the points in the JD which you don't have any experience. I'll explain later. \n\nOn the day of the interview, I totally relax and try to take my mind off of it. I talk to friends, family, make sure I have the outfit ready. And most importantly, I listen to podcast interviews (my choice is the Ezra Klein show). Podcasts are the best way to prepare for an interview. Watch how people talk. That's exactly how an interview should feel like. Be a good listener. When the hiring manager is talking, listen. Don't interrupt. When it's your turn, pause for a couple of seconds. Gather your thoughts. And speak confidently and calmly. Know when to start and stop talking. If the hiring manager is interrupting you, it means you're being overly verbose. The interview should feel like an organic, back and forth conversation, like podcasts. Also, watch out for how the guests on podcasts navigate difficult questions. If you don't know something, don't blabber. Navigate around it smartly. \n\nWhen it's time for you to ask, have some questions prepared in advance. And finally, when they're about to wrap up, ask for a closing statement. This is important. Go back to your JD, and say \"these XYZ areas - I can start contributing immediately. And these ABC areas - I can start to contribute after some training and mentoring\". Most people like that honesty, and they can also plan on where to deploy you after joining. \n\nAfter interview, it's good to wait for at least a week before sending a follow-up. \n\n¶ Some of you messaged me saying that adding photo is wrong advice. For me, it worked. I started getting more calls after I added a photo. But apparently, adding photos in resume is illegal in some regions (eg US, Canada). Please check your local laws",
      "subreddit": "jobs",
      "score": 377,
      "url": "https://reddit.com/r/jobs/comments/1o207yw/10_yoe_4_months_unemployed_300_applications_10/",
      "comments": [
        {
          "body": "Decent advice post, just not the photo on resume unless the job you’re applying to would normally require it. That was and still is taboo to include.",
          "score": 46
        },
        {
          "body": "👉🏼I’m heading into my 4th month next week. Thanks for the useful tips🙏",
          "score": 5
        },
        {
          "body": "Thank you for taking the time to write all of this. It is very helpful, as things have really changed.",
          "score": 8
        },
        {
          "body": "[removed]",
          "score": 16
        },
        {
          "body": "Can I dm you?",
          "score": 3
        },
        {
          "body": "Thank you for the detailed post. Can you elaborate on the skills list? What percent of your resume is skills? Would you include soft skills like time management or only technical skills like Microsoft office?",
          "score": 4
        }
      ]
    },
    {
      "title": "Does anyone ever get hired when they apply on Indeed?",
      "body": "Been out of work since December and my unemployment benefits are running out. Will be completely out in June. Coming down to the wire and have not found a job. Have had a couple interviews and a lot of rejection emails. My questions to the group and I would love someone to say yes I have. Does anyone ever actually get hired through indeed applying? It seems the website has targeted a lot of “job” that match my experience and qualifications but I am skeptical that the applications I have submitted will get further than someone’s email trash can. ",
      "subreddit": "jobs",
      "score": 676,
      "url": "https://reddit.com/r/jobs/comments/1jyboxx/does_anyone_ever_get_hired_when_they_apply_on/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 140
        },
        {
          "body": "I work in the security field and surprisingly I have gotten about 5 actual job offers from actually decent companies out of the maybe 30 applications i put in. I know not everybody wants to work in security, but if you can find a field where they have a shortage of workers it makes it pretty easy to get a job.",
          "score": 28
        },
        {
          "body": "Nobody gets hired.  But on the plus side, I have landed a few Indeed interviews.",
          "score": 107
        },
        {
          "body": "My last three jobs have been applied for on Indeed. \n\nDid a year at one, 2.5 at another and I'm 3 weeks into the new one.",
          "score": 24
        },
        {
          "body": "Yes, my past 3 jobs.",
          "score": 13
        },
        {
          "body": "I hire people off Indeed",
          "score": 12
        }
      ]
    },
    {
      "title": "Seriously Target, requiring an asynchronous interview!",
      "body": "No joke, applied because it's been way too long and I need some skills practice. So do the whole shebang and get an email with a link to complete a video interview.\n\nFAQ page - https://jobs.target.com/videointerviewing\n\nWhat has become of this job market? A retail position requires multiple interviews, technically! This entry level position should take 1 interview and 20-30 minutes to check personality fit for the position.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1gw7jtn/seriously_target_requiring_an_asynchronous/",
      "comments": [
        {
          "body": "Yikes. I remember when I was in HS or like 19 and applied to target and it was a regular interview. Didn't get the job, which I guess was for the best because they made you watch clearly illegal anti union videos which is messed up.\n\nThe sad part is, if you're desperate enough you will do it. I personally would refuse to do it until it meant I would be homeless if I didn't get the job.",
          "score": 2
        }
      ]
    },
    {
      "title": "Update: I got a 50% pay increase after resigning",
      "body": "Here’s a follow-up to my recent posts, linked below.\n\n\n\nInitially, I was prepping for an upcoming performance review, expecting a standard raise after a strong year: I hit 3x my quota and got a lot of positive feedback from management. My total compensation this year was $90k.\n\n\n\nAround the same time, a headhunter reached out on behalf of another small company. They offered me a sales role handling roughly $1.5M of their business, with a projected total compensation of $110-130k.\n\n\n\nThis led to a couple weeks of discreet interviews with the recruiter and other company staff. When they made a formal offer, I requested my annual review early to discuss a compensation boost. Surprisingly, my boss asked for a day to think it over—despite my request only matching last year’s raise. In the follow-up meeting, they said they’d reassess before year-end but couldn’t approve a raise now. I was shocked.\n\n\n\nMeanwhile, I was stalling the recruiter, which became its own saga fit for a dedicated thread. Eventually, the recruiter rescinded the offer the same day as my second review meeting. After some back-and-forth drama, I reconnected with the company directly, and they revived the offer. They agreed the recruiter was hasty as it had been less than 48 hours since receiving the final offer. I accepted, signed the agreement, and prepared my resignation. My boss was blindsided but supportive when I delivered the news.\n\n\n\nThe next day, things escalated. My direct manager wouldn’t accept my resignation, asking me to reconsider. I mentioned that I needed to make 50% more this year—and to my surprise, they came back with an offer of $130k. They admitted they hadn’t fully understood the seriousness of my request. The new offer included a base salary increase, biweekly commission payouts based on assumed annual sales to get me there, and 9% uncapped commission on anything above that target. Plus, they lifted territory restrictions, allowing me to sell anywhere.\n\n\n\nI know the common advice is never to accept a counteroffer, but I did. They initially undervalued me, but this is the highest pay I’ve ever received, and I don’t have to wait for quarterly commissions anymore. They even paid out all my outstanding commission upfront, giving me my biggest paycheck I've ever received. Between that and the other gestures, I feel they’re making a long-term commitment to me. Or maybe I just have Stockholm syndrome. Cheers.\n\n  \n1st post: [Annual review coming up, am I underpaid?](https://www.reddit.com/r/sales/s/sQXmiAEViY)\n\n2nd post: [What is the minimum increase you would take a new job for?](https://www.reddit.com/r/sales/comments/1g0xfb1/what_is_the_minimum_increase_you_would_take_a_new/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)",
      "subreddit": "jobs",
      "score": 614,
      "url": "https://reddit.com/r/jobs/comments/1gka7vx/update_i_got_a_50_pay_increase_after_resigning/",
      "comments": [
        {
          "body": "Don’t be surprised if they end up hiring someone to replace you for cheaper. Congrats on the raise but be cautious",
          "score": 560
        },
        {
          "body": "Your company is completely incompetent. I really hope it works out but you are not reading all the red flags.",
          "score": 38
        },
        {
          "body": "You really screwed over that other company giving them the run around and then accepting and renegging. 130K salary doesnt mean anything if they fire you next summer. Ive seen this before where they will offer whatever because they know they will replace you in roughly 6 months. Good luck.",
          "score": 97
        },
        {
          "body": "I hope it all works out at your current company. You’ve likely burnt a bridge with the other company by stalling to the point where they rescind a great offer, convincing them to revive the offer, and then declining it. Congrats on the raise.",
          "score": 20
        },
        {
          "body": "Sweet. Yeah, that seems like some stress for sure.",
          "score": 9
        }
      ]
    },
    {
      "title": "Can’t even get a job at Taco Bell",
      "body": "Edit: Sort of positive update, I have a couple interviews next week. One at a local feed store, one for a pet bather position, and one at a coffee shop. I'm excited to have something lined up. Think the good thought for me. Thanks for all the suggestions! \n\n\nI'm so tired. I was in the tech industry and have been laid off twice in the last three years, this time I've run out of unemployment. I was offered a federal position (remote) and then the incoming admin rescinded remote work and the position was eliminated. I was offered a state job and then rescinded due to a union issue (could actually only hire internally for the role). \n\nNow I'm applying everywhere including like McDonald's and Taco Bell and Target and Walmart and even though I've dumbed down my resume and removed my degree I can't land an interview. These are all places I interviewed at or had high school friends work at as a teenager and now I'm just auto rejected 10 years later despite being a much harder worker and more experienced than I was at 18.  \n\nI honestly don't know what to do at this point. The real rub is that I'm still on the hook for student loans while I'm about to be homeless. I've never been out of a job for longer than a couple weeks and now it's been seven months.  ",
      "subreddit": "jobs",
      "score": 348,
      "url": "https://reddit.com/r/jobs/comments/1iej8lk/cant_even_get_a_job_at_taco_bell/",
      "comments": [
        {
          "body": "I have a recommendation. This will only work for smaller businesses. Go directly to the company’s home page and find the “contact us” email address  and email them a resume and brief message. When i was looking for work, this is how I got my current job, I emailed 20-30 places like this. I got maybe 6 call backs and resulted in 2 offers. \n\nIts all a crap shoot. But i personally hate the automated applications and that why I took this approach. Because those process are bullshit in terms of getting recognized. “Heres who I am, heres what I can do for you, heres my resume” it cuts through the BS. \n\nHope this might help\n\nPs: my company did not have an ad out, nor were they actively looking. It was nothing more than pure luck on timing that when I emailed them",
          "score": 45
        },
        {
          "body": "Same bro your not alone, I’m on month 3 or coming up on it but I stay busy with art / then again don’t get discouraged even though we will.. sitting 🪑 doing much of nothing is excruciating; good luck man you’ll get through it",
          "score": 85
        },
        {
          "body": "I'm in the same boat, but with no degree. I don't understand the algorithm that filters applicants, but I've been applying at jobs I've expected to get for 6+ months with no response. It honestly might be the recent gap in employment that flags the system and puts your applicant below others. I miss the days you could walk in with a resume and fill out an applicant face to face.",
          "score": 49
        },
        {
          "body": "It’s not the most exciting job, but try Marshall’s or TJMaxx (one of those stores). Don’t put any degree at all on your resume. \n\nThose stores are usually always hiring, the pay will be lower end for retail but it’s something",
          "score": 43
        },
        {
          "body": "Recruiters and temp agencies!",
          "score": 14
        },
        {
          "body": "I'm in the same boat. I tried to get a job as a janitor, and they \"moved on with a different applicant\"\n\nIt's like, why am I even trying. What am I supposed to do?",
          "score": 13
        }
      ]
    },
    {
      "title": "My experience.",
      "body": "After 3 weeks of non-stop interviews (having between 1-4 a day), I landed a job with a nearly 50% pay increase.\n\nI submitted over 800 applications in less than 3 weeks.\n\nThe entire process, from the first application I sent to accepting the best offer, was about 1.5 months.\n\nRelevant facts:\n1. I have 4+ years in analytical roles.\n2. Obtained a bachelor's in a more technical business degree.\n\nI received 2 offers:\n1. Fully remote. Around 7% pay increase. I had to complete a case study and do 4 separate interviews. No references.\n2. Hybrid. Around 50% pay increase. 2 interviews. No case studies. Had a referral.\n\nI'll admit, I applied to many roles I was not fully qualified for. But you miss all the shots you don't take. I was most qualified for analyst/engineering roles, and tailored my resume to fit such.\n\nMy suggestions/observations:\n\n1. Reach out to your contacts for references right away. Requesting references should be the first resort, not last resort. I wish I would have reached out to the reference that helped me get my current job sooner. Had I done that, I could have saved myself 800 other applications and literally hundreds of hours of interviews and case studies.\n\n2. If you receive an offer, expect it to be at the very end or slightly below the proposed range. Ex: $90k - $120k range, expect $88k offer.\n\n3. I'm normally a huge advocate for negotiating salary. I absolutely did not this round. The market is rough. Negotiate at your own risk.\n\n4. Everybody wants fully remote work. There's less competition for hybrid roles. In my experience, hybrid also pays better because there's less competition.\n\n5. I've noticed that the most lucrative jobs required the least interviews and no case studies/unpaid work. The companies with whom I went through 4+ interviews with/did case studies for/presented projects for often paid less than what I was making and rejected me in the end anyways (often for somebody with more direct experience).\n\n6. Tailor your resume to a specific type of job you want, not individual roles posted. I was targeting analyst roles.\n\n7. Practice interviewing. People hire people they like to talk to. People who they think they'll get along with. Not just people who can do the job.\n\n8. Try to connect with your interviewers.\n\n9. Avoid Workday/ICIMS. I mainly focused on the Greenhouse ATS as they only require you to attach a resume and answer a few basic questions.\n\n10. Accept the \"just in case\" interviews. I interviewed for roles paying between $50k and $175k. Good interview practice, if anything.\n\n11. If you're still in college, please please please focus on getting internships. I had 5, and that helped me a lot when I first got out of school.\n\n12. Get lucky. People love to pretend like luck has nothing to do with it. I lucked the heck out. Sure, it was a combination of my interviewing skills, my resume, my experience, my cover letter, etc. etc..... but also I got the right reference for the right job at the right time.\n\n13. It's rough out there. You're valuable. I know it can be discouraging constantly getting rejections for roles you know you were qualified for. It's the market, not you most likely.",
      "subreddit": "jobs",
      "score": 520,
      "url": "https://reddit.com/r/jobs/comments/1ggle45/my_experience/",
      "comments": [
        {
          "body": "lol getting a job is a job in itself",
          "score": 183
        },
        {
          "body": "Exhibit ### of how blatantly and un-realistically competitive the modern world has become.",
          "score": 53
        },
        {
          "body": "So I just interviewed someone. I was her 6th!!!! Person to interview her at my company. I told the hiring manager this is ridiculous and she said it is now the norm.",
          "score": 26
        },
        {
          "body": "Perry the Sankey Chart?!?!",
          "score": 23
        },
        {
          "body": "While this is very impressive and well done, it’s sad af people have to apply to 800+ jobs to receive a measly two job offers.",
          "score": 18
        }
      ]
    },
    {
      "title": "Got a phone call interview for my dream position 2moro For a TCOM position at Target",
      "body": "So normally I’m good at job interviews but I’m shaking because really this job isn’t just something I want but NEED (fits within my college schedule, will help me pay off credit card debt, also pay for apartment, I can work on schoolwork at the same time while working.) \n\nSo my question is what should I be prepared for? What are some good sites to access to prepare myself. \n\nSome questions I usually fail at is why do you think you should work here? \n\nTypically when I get asked this question it starts off good but then mid sentence my fuse dies. \n\nSecond question is Explain a situation or time u had to go out of your way. \nIdk there is sooo many I can’t even remember I’m thinking about writing down some fake scenarios or something \n\nAnd lastly what are your weaknesses ? \nI always sit and think about this one long and hard nobody likes to criticize themselves. \n\nSo cmon guys help me this is also my very first corporate job and I had to fight tooth and nail to even secure an interview even THOUGH I HAD A REFERRAL FROM ONE OF THEIR BEST WORKERS? \n\nLegit spent the whole day as a contractor hunting down the hiring managers to find their emails and email them my cover letter because I applied 25 days ago and did not here nothing. \n\nBut yes guys hit me with it!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/ec8lkq/got_a_phone_call_interview_for_my_dream_position/",
      "comments": [
        {
          "body": "I would look at the corporate website and learn about their mission. The first question I cant really help you because I'm not familiar with the job position. For my weaknesses, I have mentioned that I'm really forgetful and then mention that I now make list of everything I need to do and cross off the things I need as we go.",
          "score": 2
        }
      ]
    },
    {
      "title": "Threw in the towel",
      "body": "After many months of being unemployed and trying to target my applications to jobs I would be over qualified for I gave up and just stooped to an entry level position. I went from white collar management to blue collar entry level.\n\nI have 20 years experience (including management), triple major graduate and working on a masters and interviewed with several companies all for them to BS me around. \n\nHad a company turn me down and then repost the Job lying to my face. Lots of ghost jobs. Had a hiring manager be extremely angry towards me bc of factors that technically would be illegal but would be difficult for me to prove. \n\nJust want to say for those of you who are going on 18 months - 2 years unemployed. I feel for you.\nI had to throw in the towel and get a job making poverty wages. I’m making less than half of what I made just a few years ago. \n\nMy advice is to sharpen that resume, network and learn new skills/ get an education. I had to get a new credit card and my credit score dropped into a whole lower tier bracket. I’m literally living off beans and rice. But I need the medical insurance to see a doctor and I guess some money is better than no money. I was getting by off contract work that was drying up fast by working for the rich. The guy I was working for lost $600,000+ just in the stock market since trump got in office. Politics matters if you’re trying to get a job. \n\nI asked the recruiter if the position was negotiable and they told me no. Before they could rescind the offer I accepted it. \nI will be taking this job but will continually be looking. ",
      "subreddit": "jobs",
      "score": 149,
      "url": "https://reddit.com/r/jobs/comments/1lks03s/threw_in_the_towel/",
      "comments": [
        {
          "body": "I think it is so disenguious to be telling people what they must do if they are unemployed is to go back to school and network while your telling us that with a master's and 20+ years of experience you are only finding jobs that pay you minimum wage. The solution is obviously to avoid the industry and schooling as a whole because the future of this field is already looking bad for veterans in the industry. \n\nMaybe the best advice is to find a new career like getting into the trades, finding a union job, etc.",
          "score": 158
        },
        {
          "body": "Hi. I think I can help. What I’m going to say sounds ridiculously simplistic. It’s exactly what you need to do to stop the rejection emails and get interviews. \n\nI’ll bet most of you have a  Skills section in your resume. I’ll also bet that the keywords in it are what you do and/or like best. This is an obsolete approach. \n\nInstead, your skills section is the hard and soft skills that are baked into the postings you apply to. \n\nHere’s how to fix it. This is exactly what I do, and it works. In fact, most of the people I help are in the same situation as you, and this alone gets them interviews.\n\n\n\n1.\t⁠Make sure your current Skills section is right before Experience.\n2.\t⁠Beneath Skills, create a “Technological Competencies” section heading This is your tech stack. \n3.\t⁠Find 3 postings that represent what  you’ve been applying to. Read through each and list each hard skill (project management, for instance) and soft skill (like collaboration) in the posting.  You don’t have to count occurrences. Just write the words. Make the words from each job a different font color.\n\nWhen you’re done with all 3, sort alphabetically. Now look for skills that occur in all 3 postings. If you have variations of a word (like budgeting and budget management), choose just one variation.\n\nIf you have less than 15, pull in some of the words that appear in 2 of the 3 postings.\n\n—You now have a master list. When you apply to a job, make a list of the hard and soft skills in the posting and adjust your master Skills list so it aligns. (save a copy first, though).\n\nBonus: Use job boards like Help Wanted sections. Instead of applying through the board, look up the job on the hiring company’s Careers page. Then, tailor your resume and apply through the company’s Careers page. \n\nHope this helps.",
          "score": 65
        },
        {
          "body": "I am also applying to jobs I am over qualified for, this is an atrocious time right now. \n\nHumbling to say the least.",
          "score": 21
        },
        {
          "body": "I'm in the same position. Keep trying💪🏾",
          "score": 7
        },
        {
          "body": "I’m going on 18 months of a job search with an MBA and 20 years experience. I am still working but travel from Florida to Baltimore to go into the office ONE DAY A WEEK. The same role I’m in pays  1/3 the salary in Florida. I might have to sell my house I bought in Florida in dec 2023 and move back to Baltimore just to continue to be employed. I’ll lose so much money as the market has dropped. This is the worse job market I have seen since 2008 and I still got a job back then",
          "score": 17
        },
        {
          "body": "Lost my job 2 years ago. Took over a year to find a job but took a half pay cut. Pays the bills but no savings with this job. However, this situation humbled me in a positive way. \n\nDuring this new job, I've met a good friend, just 1 new friend and things sparked to new business adventure. It might work but it might not but being a risk taker, I'll do it so i dont have to report to anyone anymore, i dont have to be afraid of getting laid off anymore. \n\nSo my advice is, do whatever it takes to get by. You just never know what happens next.",
          "score": 3
        }
      ]
    },
    {
      "title": "How early in the interview process can I ask for a company's compensation target for a role?",
      "body": "I'm potentially looking for a change, and have applied liberally to a lot of positions on LinkedIn. I've had a decent response rate with recruiters/companies reaching out to set up time to connect or interview with the team.\n\nSome recruiters are direct. They ask for my target comp range (and pro-tip: 80% of the time, if you redirect the question back to them and ask what their company's target range is for that role, they'll let you know). \n\nIn other cases, I speak with a recruiter... I then interview with someone on that team... and find out the salary/comp is where I am now, or in one case, 25% lower, for a role of the same title.\n\n**How early in the interview process can I ask for a company's compensation target for a role?**\n\nI don't want to waste my time or their time, but I understand asking that immediately upfront is a turn-off. \n\n**Where's the middleground?**",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/rzf4om/how_early_in_the_interview_process_can_i_ask_for/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Phone screen. No middle ground. Don't waste your time if they won't tell you from the get-go.",
          "score": 5
        },
        {
          "body": "When I was new to this I waited until the final interview. Now I'm upfront. First contact. I'm not wasting my time for a lowball offer.",
          "score": 2
        },
        {
          "body": "Ask for the range immediately, before the interview if possible. Then negotiate up after the offer is extended",
          "score": 1
        },
        {
          "body": "Email before interview or in the very first interview. If they won’t tell you a range then, that’s a red flag and you should move on.",
          "score": 1
        }
      ]
    },
    {
      "title": "Corporate salaries are actual garbage",
      "body": "I’ve been having the worst experiences with corporate salaries lately. I’ve found mid-level roles in NYC that require a bachelor’s degree and 3-5 years of experience, but companies are advertising $19/hour for analyst positions, which is almost the same as what Target pays for retail jobs. It’s not just a few bad employers, either. Entry-level corporate positions average around $43K nationally, but actual offers in major cities are well below that. Meanwhile, rent for basic apartments consumes half of those salaries before taxes.\n\nThe \"salary reset\" phenomenon is everywhere. Companies are rehiring for the same roles they filled last year but at 20% lower pay. They’ve realized people are desperate enough to accept whatever is offered. Job requirements keep growing while compensation stays flat or even decreases.\n\nThe interview process has become completely predatory. There are four to five rounds of interviews, followed by lowball offers or complete ghosting. Companies expect candidates to perform unpaid work during the process and then act like $35K is generous compensation.\n\nMost workers got 3.6% raises last year, but inflation ate away any gains. Only tech and healthcare are seeing decent wage growth while general corporate roles stagnate. Half of employees report struggling to cover basic expenses despite being employed full-time.\n\nThe math simply doesn’t work anymore. Corporate jobs that used to provide middle-class stability now barely cover survival costs. Companies have all the leverage and they’re using it to extract maximum value while paying minimum wages.\n\nThe whole promise of corporate employment providing financial security has become non-existent, but these employers continue operating like these are blessings rather than them exploiting you.",
      "subreddit": "jobs",
      "score": 209,
      "url": "https://reddit.com/r/jobs/comments/1no6x9b/corporate_salaries_are_actual_garbage/",
      "comments": [
        {
          "body": "wtf?  how are you expected to live on 42k in nyc?\n\nhave 4 other roommates in a 2 bedroom?\n\nthat is ridiculous.",
          "score": 104
        },
        {
          "body": "&gt;The whole promise of corporate employment providing financial security\n\nI must have missed that memo lol\n\n![gif](giphy|RYMw0vmoXGe9W)",
          "score": 26
        },
        {
          "body": "Couldn't agree more. It's an employers market with brutal unemployment and underemployment.\n\nI guess I got a decent job when I graduated 15-20 years ago. Because my I saw a job listing from my 1st company and they were hiring someone with 10-15 years experience for less than I made as an entry level with the same job... Adjusted for inflation.\n\nBasically companies pretend inflation isn't a thing, and at least Americans with their average 5th grade math skills don't understand it either. Definitely boomers can't understand. \"Minimum wage is 20$ an hour, you must be rich. When I was working 50 years ago I made 2$ an hour\"... \"Bitch, a house cost 3x your yearly minimum wage back then. Today it costs 10x minimum wage for a year.\"\n\nSame goes for companies. \"We raised salaries 10% in the last 10 years\" ... \"So you're providing less buying power than 10 years ago because inflation is way more during that time\"\n\nSame with the government. \"We've kept unemployment benefits the same for the last 18 years\" (at least in my state) ... \"You donkey! Does anything cost the same as back then? Even if you doubled it today, people would still be homeless\" (and research reveals my state has known about this for 30 years and done nothing, and it's gotten even worse since the unemployment benefits budget is in a deficit since COVID).",
          "score": 44
        },
        {
          "body": "I work at a large corporation in an engineering role and have noticed that target job grades for many existing roles appear to have been reduced.  Jobs that were previously manager roles and staffed by someone at a managerial job grades are now being posted as a supervisor level, etc.  I refer to this as job grade compression the same basic effect you are describing, reduced pay for the same job.",
          "score": 23
        },
        {
          "body": "At least in US, all part of billionaires’ plan to drain the middle class’s money in to their pockets.\n\nLayoffs + wage suppression at rehire (IF people get rehired) does the job nicely.",
          "score": 10
        },
        {
          "body": "Yep, this is a concerted effort across all white collar jobs.  Suppressing wages is happening and by design.  This is what people voted for.  They didn't realize it but when you let corporations run around unchecked this is the sort of stuff that happens.",
          "score": 74
        }
      ]
    },
    {
      "title": "Can I ask my interviewer what their targeted start date for the person selected for this position would be while asking them about the next steps to expect in the hiring process?",
      "body": "I would like to know what date range my potential employer has in mind to have the finalist from the interview start working in the position. Is this an acceptable question to ask?\n\nI am going into a Zoom interview soon and by digging through their HR website I found that the entire process would take at least 4 weeks. I'd like to be able to know if they have a targeted deadline as to when they would like to have the new hire begin working so that I can know how much time I have to save up money so that I can prepare myself to relocate to this city.",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/prv467/can_i_ask_my_interviewer_what_their_targeted/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Of course, there’s no problem in asking. I always ask what the next step would be when in an interview because some of them have a really long process.",
          "score": 3
        },
        {
          "body": "Yep! Not a problem at all and if they haven't said it to you by the end of the interview, won't hurt to ask just so you know what you're getting into.",
          "score": 2
        }
      ]
    },
    {
      "title": "Target asking hard interview questions",
      "body": "I did a virtual interview and they asked me like 3 questions in one. How the fuck is it this hard? I’m autistic and answered best I could I almost had to cut after that.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/q2vpxb/target_asking_hard_interview_questions/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "This is hard to post, tbh im about to give up and I’m really struggling to find a job and don’t know what I’m doing wrong",
      "body": "Hi everyone and for someone struggling like me, \n\nThis is kind of hard for me to post, but it’s 3am im lowkey down and I’ve been feeling really lost in my job search. I’m trying not to blame the market, but I’m honestly struggling and don’t know what I should be fixing first.\n\nI’m an international student just graduated. My background is in analytics and marketing (GA4, dashboards, CRM, Power BI), and at the same time I come from beauty and fashion and I’ve built TikTok and Instagram accounts with 50k+ followers and worked with beauty brands before.\n\nI really want to work in the beauty / fashion / consumer space, but I feel stuck because:\n\n\t•\tI don’t really have strong referrals or corporate connections\n\n\t•\tI’m shy and not great with rejection (especially coming from a beauty influencer background)\n\n\t•\tMy interview skills aren’t where they should be yet\n\nI know for sure I can do the work but I just feel lost on how to break in and how to position myself. I also don’t really want to go back to my hometown after graduation even tho my family are chill but i had some bullying and culture shock if i go back rn, and i will blame myself for not trying. I want to push myself and see what I can actually do.\n\nIf anyone here has:\n\n\t•\tA similar background (international student / analytics / creative / beauty)\n\n\t•\tAdvice on what roles I should realistically target\n\n\t•\tFeedback on my resume or interviews\n\nI will be really really really appreciate and grateful it. I’m also open to doing mock interviews or connecting with others who are going through the same thing.\n\nI really want the real advices because i watched too much tiktok and youtube but it seems really general. \n\nI’ll attach my resume below. Thank you for reading &lt;3",
      "subreddit": "jobs",
      "score": 77,
      "url": "https://reddit.com/r/jobs/comments/1q76ctj/this_is_hard_to_post_tbh_im_about_to_give_up_and/",
      "comments": [
        {
          "body": "Tbh your background is great and I'm sure you are skilled but it is likely just because you are an international student. There are plenty of people already with the right to work in the US who are in the beauty/fashion/creative spaces, there is little reason to go through the $$$ and legal processes to hire someone without the pre-existing right to work. Even with OPT, why would an employer choose someone who eventually needs support when they have plenty to choose from who don't?\n\nAssuming you are Vietnamese,  your only choices aren't \"find a job in the US\" and \"go back to hometown,\" you could find a role outside of your hometown in a city like Hanoi. Or, since you have some Mandarin proficiency, perhaps a city like Taipei (which, I have spent a lot of time in, English is also widely spoken to a point.) Bangkok is another possible option, you will still need to learn some Thai, but there are a lot of international jobs there.",
          "score": 40
        },
        {
          "body": "First of all, it’s the worst time in all of history to be an international candidate. Do you require sponsorship? \n\nSecond of all, working in beauty or fashion is highly desirable and extremely competitive. When you’re already starting at a disadvantage from being an international candidate, you’re in a very difficult situation.\n\nYou need to face the reality that you need to get a job ANYWHERE. You do not have the luxury of targeting a specific industry. I work in beauty, and it’s a business. The vast majority of people I’ve worked with don’t care about the industry we work in further than it being our job.",
          "score": 33
        },
        {
          "body": "im falling asleep so I’ll respond properly\n in the morning (not international but recent grad working in creative analytics) \n\nI would change things like “to identify upsell opportunities” to “and identified upsell opportunities”\n\nput the social media branding at the top of ur skills section or maybe even make it more prominent in ur resume \n\nwill respond more later but u have a great background and im sure great opportunities will come ur way",
          "score": 14
        },
        {
          "body": "As someone who is a CMO and frequently hires marketing analysts, I can say without a doubt that your resume looks like 99.9% of the ones I see. I have about a thousand applicants per role (this isn’t an exaggeration) and if the resume or CV doesn’t stand out in some way, it’s unlikely I’ll even remember the person. \n\nWe also don’t use any mainstream ATS systems or any AI, so it’s all manual, human review. I get about 30 out of the pile after recruiting handles the heavy lift. Make it standout like another commenter said by showcasing your design eye. \n\nAnd unlike another poster, your college doesn’t matter. Your projects matter more.",
          "score": 8
        },
        {
          "body": "Hey, I feel you on the struggle. (international student)+ trying to break into beauty/fashion is tough right now.\n\nYour background actually sounds pretty solid though. 50k+ followers and brand work is legit experience that most new grads don't have. The analytics + creative combo could work really well for roles like:\n\n\\- Social media analyst roles at beauty brands\n\n\\- Marketing analytics positions\n\n\\- Digital marketing coordinator spots\n\n\\- Even some product marketing assistant roles if you can show how you understand the customer\n\nFor the interview prep stuff... yeah that's a real blocker. But also - have you tried reaching out to alumni from your school who work in beauty? LinkedIn cold outreach sucks but sometimes people are surprisingly helpful. Also check if any of the brands you worked with before have openings - that existing relationship could help bypass the whole \"no network\" problem.",
          "score": 6
        },
        {
          "body": "I’m in data (data/analytics engineer, but I’m experienced enough to have worked with a vast variety of people in the data space). You’ve probably been told to quantify your achievements in your resume, which you definitely have. But it still reads as vague. ‘Insights into actionable client strategies’ could mean anything, doesn’t really tell me about your capabilities and every data/marketing professional will have that exact phrase written in their resume too. You’d need to be a bit more specific - maybe a specific instance or project. I like using CAR - Context, Action, Result. At the moment you’ve just got ‘Action’ and ‘Result’. \n\nHowever, understandably you are limited in space in terms of your resume so you’ve got to be a bit more strategic about it. I would also argue that the resume should be supplemented by an internet presence where you can go into more detail about your achievements. LinkedIn is a good place to start. Or whatever marketers tend to use. Which brings me to my next point … \n\nYou’ve also said that you’ve got a sizeable presence on social media but that info is added as an after thought. I’m not in marketing, but I would imagine that info is gold. I would make that more prominent. I imagine you would be tracking your own analytics for your social media and using that info to tailor your content. I would also add that info somewhere.",
          "score": 3
        }
      ]
    },
    {
      "title": "[RANT] Please don't set up an interview if you're going to disqualify me for work experience within 5 minutes",
      "body": "I've been applying to jobs for over a month now and I got a phone screening with a company. Pretty standard stuff as I've done this a handful of times already. I get on the Zoom call and the interviewer asks me to tell them about myself. I do that and then I get prepared to talk about how my experience can transfer over into this new job role.\n\nAt this point, this is when the interviewer says they can't meet my salary expectations. I say I understand, as I know that I haven't had all that much experience in SaaS sales (even though at my last B2B job I was on target to make 6 figures and this job was offering $55k less). Then he goes on to tell me that they're looking for someone with at least 1 year experience with no follow up.\n\nIt was silent for 30 seconds, as I assumed that he would continue on and say something else. No, that was it. He told me to apply in a year once I've gained experience and hung up. I'm sitting here so confused as we only had a discussion for 5 minutes MAX. Like......???????\n\nIf you've already made up your mind that I don't have enough experience then that's fine but don't schedule a call with me if you're planning on wasting my time. Like it's a waste of his too - why even bother at that point to even schedule anything? Did he not actually read my resume? Ugh, COVID job search has just been tough and I just feel like whining. Has this happened to anyone else? Am I just being a little bitch? Perhaps - I'm just annoyed.\n\nEDIT: Wow, thanks for all the wonderful comments, upvotes, and awards! Y’all give me the courage to keep going in this job search and I hope y’all get the jobs you’re looking for as well! 😭🥺🤧\n\nEDIT 2: I just wanna hop in and say thanks for the additional comments, upvotes, &amp; awards! I’m also upvoting all the comments because I want to let you all know that I appreciate your feedback/stories/critiques. It has given me a lot to think about and I definitely don’t feel as alone as I did before this search.\n\nAll we can do with experiences like these is to SHOVE THEM UP INTO OUR LESSON CONVERTOR. Thank you so much again - Reddit is cool.",
      "subreddit": "jobs",
      "score": 958,
      "url": "https://reddit.com/r/jobs/comments/mvkpbs/rant_please_dont_set_up_an_interview_if_youre/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nSitel Group is hosting an [AMA](https://www.reddit.com/r/jobs/comments/mvgh7a/sam_and_melissa_from_sitel_group_here_to_tell_you/) on r/jobs this Friday (2021-04-23) at 4:30 PM UTC. \nBe sure to check it out!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "This happened to me once a few years ago. I had just finished college and was searching for a better paying job. I applied to a job that listed an hourly rate of $18 - $20. The director called to do my phone screening and at the end of the call, he set up an in-person interview.\n\nSo I go to the interview and he asked the first question while looking at my resume. Before I could even finish my quick blurb about myself, he interrupted me and told me that I didn't have enough experience. He said that he had applicants who had 5 - 10 years of experience. I was shocked because this guy went over my resume during the phone screening and all of a sudden it was a problem?! Regardless, I did my best to explain why I was a good fit. \n\nHe quickly decided that I would be better suited in a different position and asked one of the team leads to take over the interview to talk to me about a different position. The new position paid $10/hr. I walked out of that room and immediately ripped up the crappy business cards they handed to me. When I went home, I saw the ad for the exact position and the listed rate was $12/hr. What a slap in the face to offer me something so low.\n\nI remember being super sad/angry during that time because I was extremely broke -- choosing between a little gas money or food for that week. I made the decision to spend my money on gas...and it was wasted on going to that useless interview.",
          "score": 285
        },
        {
          "body": "I've been to quite a few interviews where the recruiter asks if I have a certain skill or experience that I clearly do not have and then gets disappointed with my answer. From that point on I already know it was just a waste of time.",
          "score": 271
        },
        {
          "body": "Not quite the same thing, but I interviewed for basically a secretary position at a small finance company. The first question was about my 5-year goal/plan. After I finished answering they said they were looking for a 10-year commitment (which baffled me after really thinking about it). The interview ended immediately, but I definitely dodged a bullet there.",
          "score": 84
        },
        {
          "body": "Not exactly the same, but I once had an in-person interview where I was rejected before I made it back to the car. Literally the rejection email came in the two minutes it took me to walk through the (small) parking lot.\n\nI was so pissed. The email came from the assistant that had scheduled my interview, not the manager I had interviewed with. So either the manager had the assistant on speed dial, and the assistant is the quickest emailer known to man, or they knew who they wanted and were just interviewing other people for show. Thanks for wasting my time, assholes.",
          "score": 71
        }
      ]
    },
    {
      "title": "Received an email from Target for an interview today, couple hours later my application status is \"no longer considered\", wtf??",
      "body": "I was thrilled to see that Target sent me an email for me to schedule an interview online using their website. You log in to see your application status and what needs to be done. My application status said I needed schedule a job interview ONLINE (edited that in). I tried to do so but couldnt so I called HR at my target in regards to the problem. The hiring manager said they are experiencing high traffic and I should check back later online.\n\n\nLater: I check back only to see that my job application status has now been deemed \"no longer considered\" What the actual f? I want to call back about the situation what should I say?",
      "subreddit": "jobs",
      "score": 10,
      "url": "https://reddit.com/r/jobs/comments/cafvez/received_an_email_from_target_for_an_interview/",
      "comments": [
        {
          "body": "given the surrounding circumstances, it might be a blip in the matrix.  i'd call and say something like, \"i was invited to schedule an interview, but later the system indicated i was no longer under consideration.  i wanted to follow up because i'm definitely interested in interviewing, should i still be up for consideration.\"  let them take it from there.\n\ngiven what you've said, it sounds like it could definitely be some sort of glitch.",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "Probably just the software being wonky",
          "score": 1
        },
        {
          "body": "hey, i know this is an old thread but this actually happened to me today. how did everything end up ? could u give more details? i got an email saying i got an interview and to go to my candidate profile, i didn’t do that right away as i wasn’t home and wanted to do it on computer. then about 45 mins later i got an email saying “Hi i apologize as there was a system error with applications and interview schedules. Please be patient as we are correcting this issue.” i tried to call the HR number but it was after 5pm so no one answered .",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewer admitted their job was fake",
      "body": "A friend recently had an interview with a startup that openly admitted their job listing was for \"marketing\". They post job listings on LinkedIn (people automatically follow the page if they apply) and on job boards for SEO benefits.\n\nWhoever applies also ends up downloading the app or signing up which gives them a spike in downloads. They target roles that they know a lot of people will apply to e.g interns, fresh graduate roles, entry level.\n\nAfter looking into this I found out it's really common. I read an article that said 40% of companies post fake jobs.\n\nThe job market is tough and finding a job is hard enough already. Why do companies think it's okay to waste people's time?",
      "subreddit": "jobs",
      "score": 404,
      "url": "https://reddit.com/r/jobs/comments/1guyjos/interviewer_admitted_their_job_was_fake/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 278
        },
        {
          "body": "It’s not just the companies hiring that are wasting people’s time. I have had multiple recruiters reach out to me, set up a phone call, and then completely ghost me (even if I send a follow up “Are you still available for a call?” email). \n\nI’m not sure if it is a new level of laziness or cowardice, because I know the position hasn’t been filled, since it’s still posted in your damn profile!",
          "score": 53
        },
        {
          "body": "This is why I dont apply by forwarding links, and I do not follow the pages when applying on LinkedIn. If at all possible I try to apply directly to company websites by typing in their url and not clicking a link.",
          "score": 18
        }
      ]
    },
    {
      "title": "Anyone here work for Target? I have my final interview coming up and could use some advice.",
      "body": "Hi! I am interviewing for Distribution Team Leader. I interviewed last year but didn't have enough experience to answer their questions properly. This year I'm fairly confident, but I need some advice on how to spin my answers. \n\nIf they ask me a question such as my biggest weakness, the honest answer is that I sometimes come across with an abrasive tone when I speak. I have a very hard time hearing it when I do it, but I've been working hard to soften my tone and more carefully choose my words. However, I'm worried that an answer like this would disqualify me from a team/leadership position. Any advice?\n\nI'm also curious about what happens when they ask me about a time I disagreed with a manager on something. I have been very involved in a lot of decision making at my current job, and that sometimes entails disagreeing with management. I usually try to understand my managers reasoning for wanting something a certain way before stating my opinion, and then I state my opinion as an alternative idea so that I don't sound disrespectful. I also try to validate  my manager's ideas (ie say why it's a good idea) before I counter with my own. Unfortunately, the way my company works is the opinions of anyone non-management is almost always ignored, so when I do submit my ideas, nobody cares. They wait until their own ideas fail before using mine, which often succeed. I know that sounds arrogant, but it's true. :-( Any insight into whether or not they care if I succeeded of failed in changing someone's mind, or do they only care about my approach to the situation?",
      "subreddit": "jobs",
      "score": 14,
      "url": "https://reddit.com/r/jobs/comments/1ong4z/anyone_here_work_for_target_i_have_my_final/",
      "comments": [
        {
          "body": "I worked for Target in the past, but thats a silly weakness to tell them you have. Everyone knows that type of question is weak sauce, so just choose something mildly related and demonstrate how its not a problem",
          "score": 4
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "whatever weakness you give them, if you get the question, make sure you explain what you do and have done to work on improving it. This is the kind of answer they're looking for.",
          "score": 1
        },
        {
          "body": "I worked there as a cashier. Their motto was, as of summer 2012 'fast fun and friendly'",
          "score": 1
        }
      ]
    },
    {
      "title": "I landed a job in 30 days. Here’s what worked",
      "body": "I was impacted by a company wide layoff from a fintech org in May. I was very strategic and intentional about the whole job hunting process. I started applying on 7/22/25 and signed my offer letter on 8/22/25😄 In total, I applied to 80 jobs in that time frame. Here’s my formula:\n\nOnly applied to jobs that were posted in less than 24hrs, no exceptions. I also skipped jobs that required me to create an account or create a video during the application. \n\nAsked ChatGPT to create tailored resumes for each job based on job description. \n\nAsked ChatGPT to create role specific interview questions / cheat sheet in PDF form that I printed out. \n(Tell me about yourself, Why do you want to work for this company? questions for recruiter, STAR interview questions, my “wins”) \n\nIf the job required more than 3 rounds I politely declined. I had (2) 1 hour video interviews with the GM and hiring manager and one 30 min phone interview with the recruiter. I am aware that this is not the case for most jobs. You can decide what works best for your situation. \n\nThis is the most important step because it really works! \n\nI asked ChatGPT to create a mock offer letter to manifest the job I wanted. I included the start date, desired rate of pay, hiring manager’s name, signed and dated on 8/18, the day I interviewed with the hiring manager. The offer letter I created and the official one are almost identical.\n\nHope this helps! Good luck to everyone and feel free to AMA\n\nEdit to add: with this format, I was landing 4-5 interviews in a week. I couldn’t keep up. Lol\n\n\nUpdate: \n\nThanks for all the positive feedback! Although I did receive some skeptics as expected, I was disheartened to read that I was a “bot” or that I was fishing for “karma, attention or a pat on the back” This is what worked FOR ME. Results may vary. I am simply offering tips so that it could help someone on their journey. There are many different factors and job seeking is very nuanced, especially in today’s job market. But I did want to address a few things for context: \n\nI am in the United States. I work remote. I’m 38 years old. I have 6 YOE in customer success management, client success, account management, project management, in SaaS/Fintech. My last role was at a well known Fintech company. The offer I accepted was a mid level role in health tech. This field is competitive but with transferrable skills, not impossible to pivot or gain employment. The OTE (on target earnings) in my area for these roles range from $97,500-$130,000 USD depending on the company. My company offered me a 10% annual bonus and after negotiating, I received a 30% pay increase from my previous employer. \n\nI have no certifications. I do not know any program languages, and my undergraduate degree is in the social sciences. Prior to pivoting to Tech, I worked in Higher Ed. I said all that to say, with the right strategy and highlighting your transferrable skills, getting a tech job or any job you desire is possible. \n\n\nI personally don't like or use LinkedIn. \nIf a job app requires it, I skip it. I also don't like video interviews before talking to a human, but that’s just my personal preference. Only you know what your non-negotiables are. Get clear on what you want and what interview steps you're willing to take. My limit is 4 interviews. Some senior roles like VP or director may require a more lengthy process. \n\nI use ChatGPT but I tweak somethings to give it a humanistic approach. AI is a tool. It can be efficient and helped me tailor my resumes to align with the job descriptions and repetitive interview questions. The prompts I used were simplistic enough but effective. YOU DO NOT HAVE TO USE CHATGPT... Use Gemini or whatever AI tool you prefer, but try to use it. \n\nI am a big proponent of manifesting and writing down my goals. You don’t have to use a mock offer letter. It could be a job wishlist, checklist, or whatever you want to name it, but envision what your next role looks like. The culture, salary, benefits, etc. \n\nLastly, don't get discouraged if you're not getting 3-4 interviews a week like I mentioned in the OP. \nIt doesn't mean you're a failure. The job market is tough right now. The key is be INTENTIONAL. \nIf you can adjust your approach, figure out what works, and remain positive, you’ll start to see some progress. \n\n\nBest of luck to everyone!  \nI hope I answered your questions. ",
      "subreddit": "interviews",
      "score": 2537,
      "url": "https://reddit.com/r/interviews/comments/1mzeow1/i_landed_a_job_in_30_days_heres_what_worked/",
      "comments": [
        {
          "body": "Congratulations on your new job and thanks for sharing. The efficiency in a job market like this is another level. Can I please ask you to clarify the need/purpose of creating a mock job offer? How does it affect or help the outcome of your job applications? Thanks",
          "score": 130
        },
        {
          "body": "This means shit unless you provide context in what job you got and rate of pay. If you are in an in demand field with shit pay then no surprise. You are posting for attention and a pat on the back. I know this “strategy” will not work for major competitive jobs.",
          "score": 166
        },
        {
          "body": "I thought the whole “less than 24hrs” rarely works because jobs get renewed and it shows as if it’s a new one, no?",
          "score": 16
        },
        {
          "body": "It’s important to specify the position you were applying for, which role was this? 🤔",
          "score": 11
        }
      ]
    },
    {
      "title": "Y’all, this is the craziest Sh*t I have ever heard.",
      "body": "I went to my final interview for a telecommunications company that pays a base salary plus commission and I said “what’s the average commission check that your top performers earn on a recurring basis”? \n\nThe dude looked at me with a straight face and said “uh nobody has ever achieved targets, so zero” \n\nI said, “what do you mean?. They don’t get paid a percentage of each sale?” \n\nHe said “no, it’s only if you hit 35 a month. If you get any less than that, you don’t get sales for anything” \n\n\nI got up and walked out. ",
      "subreddit": "interviews",
      "score": 3884,
      "url": "https://reddit.com/r/interviews/comments/1opbf1c/yall_this_is_the_craziest_sht_i_have_ever_heard/",
      "comments": [
        {
          "body": "Fuuuuuck that.",
          "score": 332
        },
        {
          "body": "And now they will be told to lie to the next interviewee that asks that question.",
          "score": 197
        },
        {
          "body": "Thank God you asked. What a horse shit company. Curious what the base was?",
          "score": 170
        },
        {
          "body": "WOW, so no one has ever achieved the targets?  That sounds like they purposefully put them out of reach so they never have to pay.  Yep, a great company there...",
          "score": 103
        },
        {
          "body": "Then that’s not base plus commission, that’s more base plus bonus (that you can’t reach).",
          "score": 57
        },
        {
          "body": "If you hit the target they would raise it next month.",
          "score": 30
        }
      ]
    },
    {
      "title": "Target in person interview number 2",
      "body": "Hi guys I got offered a second in person interview at target, I would just like to know what occasionally happens what list of questions do they ask me ( if any ) and what should I expect when I interview with them in person since it will be different from the virtual one! ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1oqopxd/target_in_person_interview_number_2/",
      "comments": []
    },
    {
      "title": "Just interviewed for my dream job. Bombed first question about target compensation.",
      "body": "Some context: I worked as Account Executive in a particular sub-sector of the enterprise software industry for 5 years.  I closed the biggest deal in my company's history, and in December they ended up firing me to avoid paying me close to $400k in sales commissions.  For reasons that I won't get into, I didn't sue.  But, the experience gave me massive trust issues and now I won't even talk to an employer if they have fewer than 4 stars on Glassdoor.  Obviously Glassdoor isn't 100% trustworthy, and it's not the only resource I look at when evaluating a potential employer, but my point is I have zero interest in working for a company with questionable reputations anymore.\n\n&amp;nbsp;\n\nWith that out of the way, I began a new job last week, through a personal connection with someone I know there.  Very small, so small that it has no footprint on Glassdoor.  It's more centered around reselling other vendors' technology.  So not exactly a tech company so much as a tech broker / service provider.  Unlike my old job, instead of selling to C-level executives of massive companies, I'm usually selling to small companies of 4 to 10 employees.  This company I'm working for has a moderate turnover rate (LinkedIn reports 50 ex employees).  The biggest positive by far is that the base salary here is very competitive.  But the commission structure is highly questionable unless I consistently produce a high number of new clients per month.  My point is: I'm happy to be employed now, and I'm going to be giving it my best, but I'd still characterize my attitude toward this new employer as one of \"cautious optimism.\"\n\nDay 1 on the job, I finally heard back from a company I'd applied to: in fact, the one I was most excited about.  It's a true tech company and their platform is completely proprietary.  They are small but not too small, like 100ish employees.  All their reviews from both clients and employees are phenomenal.  Like, I literally cannot find a single critical one.  Their founder also founded another Fortune 500 tech company.  Many of their employees on LinkedIn came from high-paying positions at Amazon, Facebook, Google, etc.  And when I use LinkedIn to see how many employees LEFT the company?  Only 5 (remember, my current employer had 50 ex employees, and we're less than half the head count!).  All this to say: this company is green flags all around, from the top down.  So, when I heard from them day 1, I had mixed emotions of both excitement to have the opportunity, and frustration with the timing.  Still, I scheduled the phone screen interview and was excited to learn more.\n\nWhen it was time for the phone screen interview, he called me and the first question was about how soon I could begin working there.  I said potentially soon, but conceded immediately that I'd applied when I was still looking for a job, and that I'd just began a new one.  I quickly assured the interviewer that I wouldn't have taken the interview if I wasn't very interested.  He then asked point blank where my head was at in terms of target compensation.  And this is where I absolutely fucked up.  Unprepared for it to come up so early, I embellished my current base salary by about 30%.  Immediately, I detected a tone shift, and he goes, \"Oh... well, that'll probably be a deal breaker then.  Our base is just \\[something marginally lower than my real salary\\].\"  The rest of the call was a bit of a back and forth about me asking about the OTE, how often reps truly attain the OTE, and asking a few high-level questions about the target clients and industries of theirs.  I could tell the interviewer was not engaged because at no point in the interview did he ask me anything about my resume, my job history, or even very basic get to know you types of questions.  It seems that the moment I revealed that I was earning a higher base salary than they offered, that the interviewer saw me as a time waster / tire kicker. (Of course, the irony is that I now realize their commission structure is far superior to mine, to the point where the job would almost certainly pay way more than my existing one.)\n\nAbout 15-20 min in, he asked what a good next step would be.  I said I'd love to learn more.  He suggested alternatively that \"How about we connect on LinkedIn and stay connected in case anything ever changes.\"  I didn't want to seem pushy, so I agreed to that.  The rest of the day, he never sent me a LinkedIn request.  So, I sent him one with the message saying \"Great to meet you today!  Sending you an email right now.\"  Over email, I thanked him for his time, and clarified that I was indeed interested to learn more about the role if there was any info he could share.  Shortly thereafter, the recruiter accepted my LinkedIn invite and sent a dismissive reply saying \"Good to meet you too -- good luck in your new role!\"  I replied \"Thank you.  When you have a moment, I did want to run something by you.\"  Crickets.\n\nNow that everything's settled it's clear to me now that this other employer is be a far superior alternative to where I'm at now.  All my research indicates that -- factoring in the sales commission upside -- it's a place that makes a lot more sense for me.  I have a deep network of people within this industry sub-sector, many who'd be eager to learn about this offering.  And most importantly, all my research indicates that that my earnings potential at this other company are ~$45k higher than at the one I have now.  Not a small chunk of cash.\n\nBut now I'm in a not-so-good spot.  Maybe if we had a solid interview when he asked about my job history, successes, etc etc -- kinda got to know me -- and THEN we had an issue about pay?  That would be one thing.  But ... the interviewer knows only one thing about me, and that's that almost our entire convo was about compensation.  So he probably thinks: I'm a poor sales person and I want too much money.  A deadly combo.\n\nIs there any way to crawl out of this one?  I've thought about texting or calling the recruiter but ... frankly that sounds a tad pathetic/desperate and unlikely to help.  Especially since they've semi ghosted at this point.  Any pointers, feedback, criticism, ideas, etc -- I'm all ears.  Because right now I'm pretty much beating myself up about this.  The fact that I managed to basically talk the recruiter out of hiring me is ... well, embarrassing to say the least.",
      "subreddit": "interviews",
      "score": 11,
      "url": "https://reddit.com/r/interviews/comments/1k435no/just_interviewed_for_my_dream_job_bombed_first/",
      "comments": [
        {
          "body": "Honestly your first mistake was telling him you're looking to join right after taking a new job. Although there's nothing wrong with that as the candidate and its better to protect yourself rather than waiting for the perfect job, you telling him that basically put your character in the mud because even if the salary matched you would leave them too when a better offer came, atleast from their perspective.\n\nIn terms of the compensation, always give a range with the bottom of the range being the least you'd be fine taking and then the rest of the range is just a plus.",
          "score": 12
        },
        {
          "body": "Pay is a deal breaker. I'm shocked they didn't just end the interview there since it was such a big difference. ",
          "score": 8
        },
        {
          "body": "Just take this as a learning experience and try not to overthink or overshare in future calls. It’s not unusual for people to interview while already employed. Should’ve just said that you’re excited to start asap but need to give the standard 2 wk notice. \n\nAs for salary I always respond by asking what’s their range for this role or what’s their compensation structure. It gets them talking and I’m not forced to give a number first.\n\nIf you really want to have a shot as this role, go through LinkedIn and your network for any connections. Since the recruiter isn’t going to move forward with you. Dig around because sometimes the hiring manager will post about open roles themselves. It at least gives you a chance to open up a direct dialogue with them.",
          "score": 5
        },
        {
          "body": "It’s easy to overthink one misstep, but one awkward answer doesn’t define your value—take the lesson, prep better next time, and trust that the right role will stick because of who you are, not just what you say.",
          "score": 3
        },
        {
          "body": "You didn’t ruin your chances tbh. I believe if a company truly is interested in you, they would give you the opportunity to negotiate salary. The recruiter probably used you to fill their quota of candidates to call and simply put you in the pool. I firmly believe that if me quoting a salary expectation is enough for you to go cold on me immediately, then that’s a bad representation of the company and its employees.",
          "score": 1
        }
      ]
    },
    {
      "title": "Please celebrate with me. I got the job!",
      "body": "I decided to only apply to jobs that I was very qualified for and interested in. I committed to applying to 1 job every 2 weeks. I ended up doing this only 3 times. I had meticulously targeted CVs for each one. \n\nFor each opening, I got a recruiter interview.\n\nJob 1:  Recruiter said \"oh, they'll definitely want to talk to you...\". And then I got ghosted. No replies to email or phone calls. I hope she's okay.\n\nJohn 2: I sailed through the first 2 interviews, but blew the final one (\"to make sure you're a cultural fit\"), I was too nervous. **But I got the job!**\n\nJob 3 (my preference) : Got through to the 3rd interview round, but with 2 week gaps of silence and ghosting in between. With another offer in hand, I told them to choose and they said no. :(\n\nI'm telling you all this because I can't tell my co-workers yet.  \n",
      "subreddit": "interviews",
      "score": 1407,
      "url": "https://reddit.com/r/interviews/comments/1ll5yfc/please_celebrate_with_me_i_got_the_job/",
      "comments": [
        {
          "body": "Shows that you were much more intentional about your job search rather than “spraying and praying” job  applications - major congrats!",
          "score": 56
        },
        {
          "body": "Congratulations!",
          "score": 15
        },
        {
          "body": "You did your job search the right way.  I get bored when people complain that their 200 applications last month generated nothing — of course, because you can’t target 200 jobs a month.  Your pacing and strategy were spot on and I congratulate you!  Best wishes in the new role!",
          "score": 8
        },
        {
          "body": "Nice job~ congratulations!",
          "score": 7
        },
        {
          "body": "Congratulations 🎉 I know how it feels coz i also just got mine recently.",
          "score": 5
        },
        {
          "body": "Nice! Congrats! Hoping this is me next!",
          "score": 5
        },
        {
          "body": "Well done you\nI’m having a beer with you",
          "score": 3
        },
        {
          "body": "Congratulations. I drank a cup of coffee on your success. Cheers!",
          "score": 5
        }
      ]
    },
    {
      "title": "I finally got an offer after 7 months, 600+ applications, and 37 interviews",
      "body": "I wanted to share my job search journey in case it helps anyone else going through the grind.\n\nBack in October 2024, I was laid off from my role as a Software Engineering Director.  It was a tough hit—mentally, emotionally, and financially.  I had been in that company for years, led multiple teams, and suddenly found myself on the outside looking in.\n\nI started applying aggressively, targeting engineering manager and director roles.  Over the next several months:\n\n* I applied to 600+ jobs\n* Interviewed with 37 companies\n* Reached final rounds with 7\n* And in 6 of those, I was told I was a top 2 candidate... only to hear they picked someone else.\n\nThe rejection pattern was rough.  Sometimes I heard “We went with someone with more domain expertise.”  Other times, it was vague: “The team decided to go in a different direction.”  I started doubting myself.\n\nLast month, I decided to shift my strategy. Instead of focusing solely on engineering management, I started applying for senior/staff-level IC roles.  I still enjoy leadership, but I knew I could deliver value hands-on too. And finally—after 7 months—I got an offer for a Staff Software Engineer position.  I accepted.\n\n# 💡 Lessons Learned:\n\n1. Stay flexible.  I held onto my manager title too tightly at first.  Broadening my scope to IC roles opened up more opportunities.\n2. The market is brutal right now, especially for leadership roles.  Many qualified people are out there. Being good isn’t always enough—you need timing, luck, and alignment.\n3. Rejection isn’t always personal.  Sometimes it's about budget, internal candidates, or slight preferences that are out of your control.\n4. Iterate your approach.  When something’s not working, adjust. I rewrote my resume 5 times. Changed my job title targets. Practiced mock interviews regularly.\n5. Support systems matter.  Talking with other folks going through the same helped a lot. Venting, sharing advice, or just knowing you’re not alone makes a huge difference.\n\nTo anyone still grinding through the job search: **don’t give up**.  Your next opportunity is out there.  The process can be discouraging, but every application, every interview gets you closer.  Keep showing up. Keep learning.  Keep going.\n\nHappy to answer questions if you're in a similar boat. You’re not alone. 💪",
      "subreddit": "interviews",
      "score": 386,
      "url": "https://reddit.com/r/interviews/comments/1ko59e4/i_finally_got_an_offer_after_7_months_600/",
      "comments": [
        {
          "body": "Man must be mentally draining to reach final rounds 7 times. I just got rejected after final round today and I already feel like shit",
          "score": 10
        },
        {
          "body": "Congrats! But over 600 applications? That’s a lot, maybe even too many. Tools like auto-apply or easy apply might seem convenient, but they usually don’t work. In most cases, they just come across as spam, and many companies automatically filter them out.\n\nInstead, it’s important to tailor your resume to each job you apply for. When you find a role that genuinely matches your skills, first make sure the listing is legitimate. Then customize your resume to fit that specific position by including keywords from the job description, especially near the top of your resume.\n\nTen well-targeted applications like this are far more effective than sending out hundreds of generic ones.\n\nIf you want to learn how to do this the right way, I highly recommend this Reddit post. It’s free and very helpful:  \n👉 [4 Steps to Creating a Job-Winning Resume](https://www.reddit.com/r/resumereview/comments/1jsb9a8/4_steps_to_creating_a_jobwinning_resume_resume/)\n\nIf you are focused on finding remote jobs, this post is a must-read as well:  \n👉 [How I Landed Multiple Remote Job Offers](https://www.reddit.com/r/RemoteJobseekers/comments/1fdpeg2/how_i_landed_multiple_remote_job_offers_my_remote/)\n\nGood luck to everyone still looking for a job.",
          "score": 18
        },
        {
          "body": "Congrats!  It took me 9 months, hundreds of applications/rejections and 20+ interviews to get my new job.  It is rough out there.  Good luck to all still in the job hunt.",
          "score": 13
        },
        {
          "body": "Congratulations on your offer!!",
          "score": 3
        },
        {
          "body": "What’s the role of?",
          "score": 2
        },
        {
          "body": "What percentage of your applications were for remote roles verses onsite/hybrid? And then how many of the remote roles reached out for an interview?\n\nI would rather have a remote job, but sometimes it feels like I'm sending my resume into the abyss.",
          "score": 2
        }
      ]
    },
    {
      "title": "Weird salary conversation",
      "body": "I made it into interview stage with a large, well regarded company. The salary range that was listed for this senior role was wide, between 200-300k. In the screening interview, which was a one way recorded interview (I think these should be banned), they asked me what my salary expectations were so I noted 240-260k. \n\nLater, I got a call from the recruiter who said she wanted to follow up because my salary expectations were higher than what they were targeting. She asked I would instead be ok with 210-220 range. And then noted that she doesn’t want candidates to waste their time if they are looking for more than that. I kind of felt forced to say that I would accept less than I had said my expectations were for. So I said well my preference is for 240 but I don’t want to be left out of the process so I’ll entertain 220. She said so should I say you have a preference for 220 or 240?\n\nI’m so confused and left the call feeling a little pressured and duped. It’s illegal for hiring managers not to put salary ranges on job descriptions, but I guess the numbers are just for show? I can’t tell if she was legitimately trying to make sure I was aligned on their salary cap or if there was another motive.\n\nI don’t know, is this normal? ",
      "subreddit": "interviews",
      "score": 116,
      "url": "https://reddit.com/r/interviews/comments/1mxnr1m/weird_salary_conversation/",
      "comments": [
        {
          "body": "For the role described, I'd expect 240.  You guys are my top choice, so I have a little wiggle room, but of course, if another conversation comes in at the market rate, I have to do what's right for me.",
          "score": 58
        },
        {
          "body": "It seems odd that they would lose a candidate at this salary range over $20,000.  It's not like they're talking about entry level jobs where they have a really hard line in the Sand as far as how much the role is worth.",
          "score": 29
        },
        {
          "body": "This is totally just my guess but I feel like they are comparing ranges shared by other candidates and trying to get the best deal they can. And that they like you and are seriously considering you.\n\nI’d maintain a standpoint of something like “well 240 is really my goal, I’m very interested in this opportunity and would be willing to accept a bit less to work with you” or something like this. I’d also try to negotiate a 6-month performance and pay review. That is if you would be willing to take 220.\n\nGood luck!",
          "score": 16
        },
        {
          "body": "I keep ending up in a similar situation. They post  a massive range (~100k) and then ask me what my expectations are. I’ll come back with “I’m comfortable with the range but targeting the higher end”. The recruiter then says “well, the budget for this role is actually some number at the bottom of the range”. \n\nI feel like it’s false advertising putting some large range on the posting and then telling you some other number once you are in the interview.",
          "score": 7
        },
        {
          "body": "I’m not sure if it’s illegal or not. I have not scene it before. At that point of the process, at most I’ve been forced to name a number and that’s the last time the company brings it up.\n\nRecruiters from 3rd party firms get paid if you get hired. Companies want to pay as little as they can get away with. \n\nYou could say you’ll entertain 220. Other posts offer advice on how to word it. Would you be willing to renegotiate a higher amount after interviewing, getting the job, and walk away if they say no? \n\nOn their end they would have invested the same hours you put in the interviews times the number of people in the panels, paying their salary for that time. That’s not a trivial amount of money to reject someone for $20k/year.",
          "score": 4
        },
        {
          "body": "It may be a mixture of the job market and economy being heavy with applicants right now. Knowing they have the ball in their court, also risks of economy falling, they are shooting low and hope a great candidate will bite.  I live in a hcol and met with a few recruiters who have shared they were budgeted to hire on the low end.\n\nTypically companies would aim to hire at mid range, and offer more if you were a unicorn.",
          "score": 3
        },
        {
          "body": "I understand you are disappointed with suggested salary but not really duped if they communicated what they are willing to pay.  You can always choose to not proceed if it doesn’t meet your expectations.  Unless you have other prospect offers that will pay your required salary, I’d suggest to try to get an offer first and go from there (accept &amp; continue looking, etc.)",
          "score": 4
        },
        {
          "body": "I don’t think it’s normal, but I notice it happening more often lately. Companies are being cautious right now. I also had a situation where the recruiter are posting higher ranges but when I stated my number, they revealed that they are really seeking someone in the lower end of their range. This also happened to a friend of mine recently. \n\nIt feels deceptive, like they are trying to draw in candidates with more experience in order to talk you down salary-wise when they have you on the hook. Basically a bait and switch. ",
          "score": 4
        }
      ]
    },
    {
      "title": "Target HireVue Interview Questions 2024",
      "body": "Q1: Tell us why you are interested in the position and describe your relevant knowledge and experiences.\n\nQ2: Describe how you learn and adjust when an experience does not turn out as expected. Describe a situation, your actions, and the outcome.\n\nQ3: How do you work with people who have different perspectives than your own? Describe a situation, your actions, and the outcome.\n\nQ4: Describe how you have worked with another person to achieve a goal. Describe a situation, your actions, and the outcome.\n\nQ5: Imagine that you are on the sales floor and you see a guest who appears to need assistance. How do you proceed?\n\n\n\nQ6: Positions in Target Stores include guest service and product handling duties as essential functions of the job. These duties require the ability to:\n\n• Climb up and down ladders\n\n• Work a flexible work schedule (e.g., nights, weekends and holidays) and have regular attendance\n\n• Scan, handle and move merchandise efficiently and safely, including frequently lifting or moving\n\nmerchandise up to 40 pounds\n\n• Meet any state or local licensure and/or other legal requirements related to the position\n\nAre you able to fulfill all of these requirements (with reasonable accommodation, if necessary)? YES/NO\n\n",
      "subreddit": "interviews",
      "score": 134,
      "url": "https://reddit.com/r/interviews/comments/1eks99h/target_hirevue_interview_questions_2024/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "I just did an interview with them 5 minutes ago and these were exact! Thank you so much! (That was terrifying for no reason lol)",
          "score": 2
        },
        {
          "body": "Thanks sm",
          "score": 1
        },
        {
          "body": "Thank you",
          "score": 1
        },
        {
          "body": "Thank you, OP. I literally did 9 interviews with Target's 'HireVue' in late September 24' and can confirm all these questions were asked every time. With the help of this, I was able to land the job.^.&lt;",
          "score": 1
        },
        {
          "body": "The Canary Wharfian website's also has HireVue practice. It has 50+ actual interview questions and AI will suggest how to improve based on your answers, check it out",
          "score": 1
        },
        {
          "body": "remember to refer customers as guest in your interviews !! target loves that",
          "score": 1
        },
        {
          "body": "Are these the same questions used in interviews for Specialty Sales (Style, Tech, Beauty)?",
          "score": 1
        },
        {
          "body": ".",
          "score": 1
        }
      ]
    },
    {
      "title": "Confused about Target seasonal interview &amp; auto-rejection email",
      "body": "Hey everyone, l'm hoping someone can help me understand how Target's hiring process works.\nI applied for seasonal roles at a Target near me and completed my HireVue interview on Wednesday night last week. Last night (Monday) at midnight, I got an automated email saying I was no longer being considered, which freaked me out.\nI called HR/Guest Services today (Wednesday) and she said:\n• my interview was forwarded to the manager she told me \"honestly you're fine\"\n• if I don't get an email by the end of the day, I can call back to follow up\nNow I'm confused because:\n• the hirevue system still shows my application as \"Interview Received\"\n• the rejection email seems contradictory\n• I'm just trying to know if I'm actually still being considered\nHas anyone else experienced this with Target seasonal? Did the automated rejection email happen even though HR/manager was still reviewing your interview? I just want to know if I should keep waiting or if it really means I'm out.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p0vvmm/confused_about_target_seasonal_interview/",
      "comments": [
        {
          "body": "if u need help with the games, i've done them before and can help u",
          "score": 1
        },
        {
          "body": "if u need help with the games, i've done them before and can help u",
          "score": 1
        }
      ]
    },
    {
      "title": "Target Recorded Interview Length per response???",
      "body": "Hi everyone!!! I’m a high school student with a recorded interview tomorrow for target. I was wondering how long each of my responses should be?? There’s 6 questions but the last is a yes or no. ",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1o4vr83/target_recorded_interview_length_per_response/",
      "comments": [
        {
          "body": "I've been told 2-5 minutes. I can't make anything longer than 30 seconds myself. Ridiculous things come out of my mouth.",
          "score": 3
        },
        {
          "body": "Each response should ideally be between 45 seconds to 1.5 minutes. That’s long enough to explain your point clearly and show personality, but short enough to stay engaging. For simpler yes/no or straightforward questions, 30-40 seconds is plenty.",
          "score": 2
        },
        {
          "body": "It’s really not a big deal, just be confident and natural. Don’t sound like you’re reading from a script, give each answer your own little perspective. You’re a high school student, not a corporate executive, so relax and just be yourself.",
          "score": 1
        }
      ]
    },
    {
      "title": "TARGET VIRTUAL INTERVIEW QUESTIONS 07/2025",
      "body": "Here are the questions I was asked in order\n\n1. Tell us why you are interested in the position and describe your relevant knowledge and experiences.\n\n2. How do you use past experiences to improve your approach? Describe your actions and the outcome.\n\n3. Describe how you learn and adjust when an experience does not turn out as expected. Describe a situation, your actions, and the outcome.\n\n4. How do you work with people who have different perspectives than your own? Describe a situation, your actions, and the outcome.\n\n5. Describe how you have worked with another person to achieve a goal. Describe a situation, your actions, and the outcome.\n\n6. Positions in Target Stores include guest service and product handling duties as essential functions of the job. These duties require the ability to:\n• Climb up and down ladders\n• Work a flexible work schedule (e.g., nights, weekends and holidays) and have regular attendance\n• Scan, handle and move merchandise efficiently and safely, including frequently lifting or moving\nmerchandise up to 40 pounds\n• Meet any state or local licensure and/or other legal requirements related to the position\nAre you able to fulfill all of these requirements (with reasonable accommodation, if necessary)? YES/NO",
      "subreddit": "interviews",
      "score": 7,
      "url": "https://reddit.com/r/interviews/comments/1m7tcvp/target_virtual_interview_questions_072025/",
      "comments": []
    },
    {
      "title": "Is a \"Video interview\" from target legit or a red flag?",
      "body": "Asking because it feels like they're just going to reject me anyway. Thoughts?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ii3sql/is_a_video_interview_from_target_legit_or_a_red/",
      "comments": [
        {
          "body": "Red flag",
          "score": 1
        }
      ]
    },
    {
      "title": "After getting laid off: 300+ applications, 20+ company interviews, 1 offer.",
      "body": "I’m a data scientist, and I just got my first job after 1800+ applications, only to be laid off after just one month in the role. So I started applying again: another 300+ applications, interviews with 20+ companies, 2 final rounds, and finally 1 offer.\n\nI don’t want to sound pessimistic, but I’ve come to understand that in this job market, even landing an offer doesn’t mean it’s the end… just look at me.\n\n**Edit:** Thanks for everyone's support! It’s so real that traditional data scientist jobs can be replaced by AI, I thought I wouldn’t have to study again after graduation, but clearly, I was wrong.\n\nRegarding my applications, since I have a clear target role, I prefer using [Hiring Cafe](https://hiring.cafe/) to filter for specific positions like data scientist, instead of mass-applying through [Indeed](https://www.indeed.com/), [LinkedIn](https://www.linkedin.com/), or [Handshake](https://joinhandshake.com/).\n\nFor interview prep, I tried [AMA Interview](https://www.amainterview.ai/?utm_source=Reddit&amp;utm_medium=Reddit+Post&amp;utm_campaign=storytelling) too but I’m not a fan of practicing with an AI avatar lol, but their real interview question lists and question predictions based on resumes and roles are worth trying.\n\nAs for my resume, since I’m continuing to pursue a career as a data scientist in the tech industry, the general outline didn’t need major changes. I did customize by [ChatGPT](https://openai.com/index/chatgpt) for some versions for specific job descriptions where my original resume didn’t cover key requirements. That really helped increase my interview rate. **I tailored almost every resume for each application and only applied to roles that aligned with my experience and industry.** When I spent more time customizing my resume, my response rate improved significantly, unlike when I mass applied to over 1800 jobs and only got 23 interviews.",
      "subreddit": "interviews",
      "score": 341,
      "url": "https://reddit.com/r/interviews/comments/1kgieb2/after_getting_laid_off_300_applications_20/",
      "comments": [
        {
          "body": "I couldn’t agree with you more! Congratulations and hope this one works out well for you. :)",
          "score": 40
        },
        {
          "body": "Very data scientist of you to keep such track of these #s. Kudos. \n\nAs for an offer being “the end”, I think that holds true in many instances, a healthy amt of staying on your toes should be required; never get too comfortable anywhere you are.",
          "score": 14
        },
        {
          "body": "How do you apply? Were you tailoring for resume for each role and cover letter? Or using the same one? I’ve noticed a higher interview rate for me the more I customize my resume to fit the role using AI. But congrats for stay vigilant and determined. Glad you got an offer!\n\nI got laid off in February. About 50-60 applications. 10 interviews. 4 have reached final stages. Waiting for final decisions on them. For demand gen marketing manager. It’s a grind. I am done selling myself. ",
          "score": 12
        },
        {
          "body": "Nice, kinda in a similar boat as I got laid off recently",
          "score": 4
        },
        {
          "body": "I feel your pain. It's a really tough market out there. Some industries have a pot of gold at the end of the rainbow and some industries are just plain saturated.  Hang in there and don't give up!",
          "score": 4
        },
        {
          "body": "Same boat. My numbers look similar though I don’t have an offer",
          "score": 4
        },
        {
          "body": "Were you able to negotiate salary after receiving  your offer?\n\nCongratulations",
          "score": 3
        }
      ]
    },
    {
      "title": "Changing Target salary after phone interview",
      "body": "He asked what my target salary was and the number I said was too low. I called back and politely asked the talent acquisition person to simply change my answer for minimum salary requirements, from 50k to 60k\n\nHe acts all offended and says \"what made you change your mind\"\n\nI think they are very interested in me, but how bad is what I did? I don't see anything wrong with it. I'm not even hired yet, but I just wanted to change my answer in the event that they do hire me.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/cmsjbm/changing_target_salary_after_phone_interview/",
      "comments": [
        {
          "body": "From the other side, doing this does raise questions. It's not uncommon, but people will usually have a reason that caused them to up their answer (typically it comes up when benefits are discussed).\n\nMy questions to you from an outside perspective are:\n- how did you come up with the first number you gave?\n- what made you feel like that number was too low?\n- how did you land on $50 - $60k as a more agreeable target?\n\nLike I said, these things happen, but it's also common for the recruiter/HR to ask you what changed. Giving them reasoning behind the change helps them understand where you're coming from. Otherwise it can seem like you're looking for the company that will pay you the most versus a company that's the best overall fit.",
          "score": 2
        }
      ]
    },
    {
      "title": "I saw awful resumes: here's a checklist I compiled to avoid errors and land interviews",
      "body": "I made a post a while back about how I had to, because of work, read a lot of resumes whilst not being a recruiter weirdly. The formatting nightmares blew my mind though, bullet points jammed into numbered lists, random arrows, right-aligned text, and tables popping up out of nowhere. I knew resumes were tricky, but wow, people can mess them up bad. Folks started DMing me for advice, and since I had to figure this out for work anyway, I put together this list to help you craft a resume that gets past automated systems and lands your interviews.\n\nFirst of, and maybe the most important point I got from a recruiter. “Make it boring”. Don’t try to be fancy and unique. The goal here is to get pass their system (if they use one), and then get a callback when a recruiter looks over it. \n\n**1. Tailor to the Job**\n\n* Use the exact keywords from the job description (e.g., “project management”).\n* Try a word cloud tool like WordClouds to find key terms.\n* Most resumes miss 49% of needed keywords, don’t skip this step.\n\n**2. Keep Formatting Clean**\n\n* Stick to standard fonts (Arial, Calibri) and clear headings like “Work Experience.”\n* Skip images, tables, or headers/footers, automated systems sometimes choke on them.\n\n**3. Show Measurable Results**\n\n* Add numbers (e.g., “Boosted sales by 20%”). But don’t make them up of course. Be able to explain each point. \n* Use the “XYZ formula”: “Did X, achieved Y, by doing Z.”\n* Only 26% of resumes have 5+ metrics, so this can set you apart.\n\n**4. List Relevant Skills**\n\n* Include a “Skills” section with hard skills (e.g., “Python”) and soft skills (e.g., “leadership”).\n* Spell out acronyms (e.g., “CPA/Certified Public Accountant”).\n* Resumes often miss 40% of hard skills and 72% of soft skills.\n\n**5. Keep It Short**\n\n* Aim for 1–2 pages, 475–600 words. This range gets 2x more interviews.\n* Cut old jobs or fluff to stay relevant.\n* However, if you’re targeting c-suite positions (or high positions in general) then it’s normal to have more pages. \n\n**6. Proofread Like Crazy**\n\n* Typos or weird formatting can tank your score.\n* Read it backwards to catch mistakes and double check keywords.\n\n**7. Skip Personal Stuff**\n\n* No personal photos, marital status, or generic emails like [coolguy123@email.com](mailto:coolguy123@email.com).\n* Check country norms. For example, the UK prefers two-page CVs with no photos, while some EU countries may expect a photo (headshot, not a photo of you with your dog, although very cute).\n\n**8. Drop the Buzzwords**\n\n* Skip terms like “team player” or “detail-oriented” , 51% of resumes lean on these. These are term recruiters hear (read) 100 times a day, making your resume sound generic. \n* Use examples instead (e.g., “Led team to cut costs by 15%”).\n\n**9. Add a LinkedIn Link**\n\n\\* This step is inconclusive, and a big debate in the community. If you're not sure, just leave it out. However, this is how the was represented in the research. \n\n* Include a custom LinkedIn URL (e.g., linkedin.com/in/yourname).\n* Only 48% of resumes do this, but a solid profile boosts your odds.\n* Make sure it has a headshot and full work history. A bad LinkedIn can actually worsen your chances. So make sure its presentable.\n\n**10. Be Honest**\n\n* Don’t lie, recruiters will catch it.\n* Stick to real achievements that fit the job. \n\n**Why This Works**\n\n* Automated systems (used by 98% of big companies) ditch 70% of resumes. Keywords and clean formatting get you past the 80% score needed for a human to see it.\n* Recruiters skim in 6 seconds, metrics and clarity make you pop.\n* A sharp LinkedIn profile seals the deal.\n\n**Resources**\n\n* Purdue OWL for resume basics.\n* CareerOneStop for a full guide.\n* ResumeHelp for automated system tips.\n* TopResume for free critiques.\n* [cultivatedculture.com/resume-statistics](https://cultivatedculture.com/resume-statistics/) (specific numbers seen in the list have been taken from here) \n\nI may have left something out (feel free to ad please), but from talking to recruiters and doing research this is the crux of it. Also, don’t overthink it. Hit all of these targets and just start sending. A lot of people suffer from over polishing their resume. As I said in the beginning, keep it simple, readable, and “boring”. It is in the end just a piece of paper, just meant to get you to the next step. Not the end all and be all. ",
      "subreddit": "interviews",
      "score": 173,
      "url": "https://reddit.com/r/interviews/comments/1k65s38/i_saw_awful_resumes_heres_a_checklist_i_compiled/",
      "comments": [
        {
          "body": "Show Measurable Results - as someone who reads a lot of CVs while not being a recruiter, every time I see these %, I just assume they are made up. I would say they are not a factor in deciding whether a candidate is fit for the job or not. ",
          "score": 33
        },
        {
          "body": "[deleted]",
          "score": 14
        },
        {
          "body": "I agree to most of these points but each industry is different for a resume. For an IT side of things We do not want work experience to be scaled. We want that work experience to expand for IT Support or other candidates in IT as they are going to be doing more roles or experience than others. We will not hire someone who only has 5-6 bullet points for a IT position even if they listed their experience to match the role. If they left over things like they haven't worked on a domain server, setup active directory accounts etc this will be a deal breaker for example.\n\nSo its why each resume is different for each job department out there. Overall you do got some points. I never listed my LinkedIn profile as I don't do social media. I was on LinkedIn for years and it never benefited me at all except for getting recruiters to bother me to apply for ghost jobs. I also was told LinkedIn links is not a good idea at first.",
          "score": 7
        },
        {
          "body": "I don’t agree with a lot of the OP’s advice. What he thinks - one person out of over 8 billion is frankly not that important. Ironically a really basic fucked up CV could still interest someone. A hiring manager may want to know why the person has  been out of work so long and may like them as an individual and still want to offer them a position.\n\nIn your post I see an undercurrent of blaming the job candidate as if they don’t have their shit together. The things you mention are really petty and make you sound highly insecure. If there’s a dot that isn’t formatted in the right way or too many bullet points. Listen when jobs are plentiful employers don’t care that much, when they’re not, they do. They want yet another thing to blame the candidate for as it’s easy to do and ultimately shifts the focus off them for not hiring enough and not being able to retain employees.\n\nNot everybody’s written skills are perfect. Fact. Anyway, as you said you weren’t even a recruiter - excuse me you were doing their dirty work - the boring stuff - sifting through CVs for them. Your LinkedIn advice is outrageous and is a further sign of how superficial (fake) you want candidates to be and how vile and toxic the workplace is becoming!\n\nMate how many companies and recruiters have zero idea about what they’re doing?  Posts left unfilled for yonks, revolving doors, toxic management etc. Maybe you could spend time and energy instead giving these people some tips! There’s an abundance of info for jobseekers if they care to look for it.",
          "score": 6
        },
        {
          "body": "Could you please explain about the benefits of including LinkedIn link in the resume? All of the information in my LinkedIn profile is already included in my CV. Thanks",
          "score": 4
        },
        {
          "body": "I’ve had work experience (tutoring gigs, small companies, currently a data analyst at a small business) on my LinkedIn profile but many, if not all, do not have official pages and as a result do not have company logos or pictures on their profiles. Does that hurt my credibility/chances?",
          "score": 3
        }
      ]
    },
    {
      "title": "4 applications -&gt; 3 offers: targeted applications are more effective than mass applying",
      "body": "I once mass applied to over 1200 jobs without getting one offer, or even making it to the hiring manager round. But after I adjusted my resume, interview prep, and job application strategy, I received 3 offers after just 4 applications (no referrals, no networking, 1 was an internship with a return offer, and the other 2 were full-time roles).\n\n**My job searching journey you guys can see as reference:**\n\nStage 1: 1200+ applications → 9 interviews → 0 offers. Mass applying without customized resumes, no reviews, no targets, no interview prep...\n\nStage 2: 4 applications → 3 offers. Tailored resumes with job descriptions, prepared a 15 pages cheatsheet of phone screens, behavioral questions, case study thoughts, and polished it to the 5th version.\n\n**Lessons:**\n\nStop crazily mass applying: No review at all, just like a relentless job application machine without a brain → Targeted application is king. Otherwise, it’s just spam.\n\nPractice interviews smarter: I used to receive 9 interviews, but 8 stopped at the phone screen stage. Only 1 reached the hiring manager → Mocking and practicing interviews is sometimes even more important than applying. Otherwise, you waste those precious chances.\n\nStop applying to jobs posted 1 month ago: Proven to be a complete waste of time. Change the LinkedIn URL to filter jobs posted in the last 24 hours: change 86400 in the URL to 3600 (86400 = 24 hours, 3600 = 1 hour).\n\nCustomize your resume: For example, I used my data scientist resume to apply for business analyst roles, but the requirements are completely different. DS focuses more on data skills, while BA emphasizes business acumen alongside data.A highly relevant resume for one position is way, way, way more effective than applying to 100+ jobs.\n\n**Websites:**\n\nJob application website: [Handshake](https://joinhandshake.com/) (got 1 internship with return offer), [LinkedIn](http://linkedin.com) (got 2 offers)\n\nPractice &amp; mock on different interview rounds &amp; question prediction &amp; example answer: [AMA Interview](https://www.amainterview.ai/?utm_source=Reddit&amp;utm_medium=Reddit+Post&amp;utm_campaign=storytelling)\n\nResume customization &amp; combine answer example with my BG: [ChatGPT](https://chatgpt.com/)\n\n**According to this 8 month job search journey, I finally understand:**\n\nTargeted application: Tailor your resume based on job roles, or even the specific job description for positions at companies you're most interested in. It's most effective if you apply as early as possible.\n\nInterview question &amp; answer prediction: Use the job description and the company’s past interview question history to predict potential questions, then prepare your answers based on those.\n\nPrep smarter: Prepare 5–8 core stories that you can integrate into your interview answers. Build your own cheatsheet for phone screens and behavioral rounds. In most cases, technical or case study rounds don’t really differentiate candidates.",
      "subreddit": "interviews",
      "score": 205,
      "url": "https://reddit.com/r/interviews/comments/1k02sqc/4_applications_3_offers_targeted_applications_are/",
      "comments": [
        {
          "body": "people are a bit hostile in the comments but you’re right and even if this is “basic” resume advice, many people still don’t know to do this or they don’t understand how important it is. when i was in undergrad i met with the career services department and they taught me the customization techniques i still use today. i have always had great interview conversion rates and i know it’s because of this method. sure, if everyone does it, that would decrease the effectiveness but i know for a fact that most candidates do not.",
          "score": 34
        },
        {
          "body": "Yeah what happens when 50 other people are doing the same thing? It’s honestly just luck and how you interview at this point.",
          "score": 15
        },
        {
          "body": "This is basic stuff repeated over and over with no real substance.\n\n\nonly prepping interviews with ChatGPT one hour before, without any personal story and link to the interviewing roles. -- You had 9 interviews and did this, that'll get you nowhere... That was your issue ...",
          "score": 3
        },
        {
          "body": "Glad your hard/smart work paid off for you!",
          "score": 3
        },
        {
          "body": "Congrats, OP! \n\nSomething I’ve been wrestling with is the need to hyper customize a resume to the job description, in a listing that was posted within the last few hours maximum. How do you manage to customize your resume so quickly?",
          "score": 7
        },
        {
          "body": "Facts. Congratulations to you 👏",
          "score": 2
        },
        {
          "body": "How do you respond to questions where you don’t have the experience? That could be helpful",
          "score": 2
        },
        {
          "body": "As I keep commenting in this forum I can’t stress enough on using AI for skills. It sounds more professional and it’s how I got easy bites. I had 4 offers waiting after a month of interviews as a IT director because I used AI.\n\nAlso answering questions relating to your previous role is huge because company sees you understand the role and able to answer it from previous roles.\n\nI learned all this after 4 offers and 51 interviews in a month.",
          "score": 4
        },
        {
          "body": "OP, in you last sentence - technical and case study do not differentiate Candidates, so what make the difference?",
          "score": 4
        }
      ]
    },
    {
      "title": "Job market is still alive",
      "body": "I just wanted to let everyone who is looking know, that the job market is still alive. I just landed my dream role after 10 weeks of looking after a RIF.\n\nWhat I learned from the process:\n1. ATS optimization didn’t seem to matter - my resume scored barely 50% on ATS systems, but recruiters actually seem to read even low matches.\n2. Understanding my strengths (I.e. not just keywords) from recruiter’s PoW seemed to help - aligning resumes with the job descriptions was crucial. This targeted approach resulted in 3 interview loops from ~20 resumes sent.\n3. Be yourself in the interview - interviewers want to feel comfortable with a candidate in addition to ensuring they have the skillset. My recruiter provided feedback afterwards that this was a critical factor for selection. I went for a run before the interviews to get rid of all the nervous energy.\n4. Be patient - it took 4-6 weeks after resume submission before being contacted by recruiter for each of the 3 loops. Some might move faster of course.",
      "subreddit": "interviews",
      "score": 129,
      "url": "https://reddit.com/r/interviews/comments/1op6rmo/job_market_is_still_alive/",
      "comments": [
        {
          "body": "Thanks for the kind reminder! I’m part of a layoff that’s happening right now and would like to just continue working, so I’ve been constantly applying applying applying to a bunch of places. *Also note for other people job searching, the holidays are here so time will essentially be a bit slower. These recruiters/hiring managers are human too. Be patient and trust the process!",
          "score": 14
        },
        {
          "body": "Im glad that your recruiter provided a feedback. It's sad that most dont though. Sometimes, I even request for a feedback to understand where I need improvement and still get ignored.",
          "score": 9
        },
        {
          "body": "2 things I would avoid if possible. 1) LinkedIn application and 2) video interviews. I find company direct application gives better chance of getting your resume looked at - or LinkedIn directs to company’s application process. Recently I came onsite for the interviews with 2 different companies. I feel that i do better with in-person interview compared to video conferencing. You get to see the person and can express and communicate better. That’s just my experience. While I still wait for the offer letters, I felt confident at least one of them will offer me a job.",
          "score": 8
        },
        {
          "body": "I'm really happy for you! Just curious, which websites do you use to rate your resume?",
          "score": 4
        },
        {
          "body": "The kind of content we need!!!",
          "score": 3
        },
        {
          "body": "I have a friend that’s a recruiter. How did you work with the recruiter to understand your strengths? Could you elaborate with specifics?",
          "score": 2
        },
        {
          "body": "Congrats!!",
          "score": 2
        }
      ]
    },
    {
      "title": "Urgent ! I need help. I have interview today at 2 and prepare these questions. Can some help me with these questions. Please urgently. I work in reliance smart Bazar now.",
      "body": "Tell me about yourself/Can you walk me through your CV?\nWhat do you know about Lenskart as a brand?\nWhy do you want to work with Lenskart?\nHow do you approach a customer who has just entered the store?\nWhat is good customer service according to you?\nHow can you improve customer service in a retail store?\nHow would you handle an unhappy or dissatisfied customer?\nShare an example where you successfully convinced a customer to buy.\nHave you ever achieved or exceeded a sales target? How?",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1qdaojt/urgent_i_need_help_i_have_interview_today_at_2/",
      "comments": [
        {
          "body": "Talk about LAZY. Figure this shit out yourself.",
          "score": 5
        },
        {
          "body": "You could at the very least take the initiative to ask AI....",
          "score": 4
        },
        {
          "body": "Bro your interview is in like 4 hours and you're asking Reddit for help lmao, but here's a quick tip - for the Lenskart questions just mention their online-to-offline model and how they're disrupting eyewear retail, and for customer service stuff draw from your Smart Bazaar experience since retail is retail",
          "score": 2
        },
        {
          "body": "Honestly if you're this lazy to PREPARE for the job. You'll be even more lazy to KEEP the job. I don't like wishing bad things on people but I hope you honestly don't get the interview. That'll you wake up and teach you a thing or two",
          "score": 2
        },
        {
          "body": "How on earth did you even get an interview?",
          "score": 1
        },
        {
          "body": "So... any updates on how the interview went?",
          "score": 1
        }
      ]
    },
    {
      "title": "Got fired from my last job, need help with this conversation when brought up in interviews",
      "body": "I \\[M27\\] got recently fired in late November right before the holidays from my last role due to my “attendance”. I was in this role for about 9 months, and this was a small business with heavy startup culture. On site role 5 days a week.\n\nFor context, i had an accident 2 weeks prior to being let go, which prevented me from being in the office. Manager claimed he understood my situation and allowed me to WFH until my car was fixed. Mid way through, there was a meeting I needed to attend in person, and I expressed to my manager it would be hard for me to attend physically due to my situation and it would be best if I could join the meeting via teams. He insisted i “figure it out” since it was mandatory. I wasn’t happy with his response, but I did what i could to get to the meeting which included me borrowing someone else’s car. I was a few minutes late and expressed this issue to my manager, which he apparently understood and just told me to get in when i can.\n\nAfter this meeting, he changed his mind about me being able to WFH and told me that i had start coming in person immediately that next week. It confused me since previously he said I was okay to WFH due the accident, but I just said okay and made arrangements until I got my car back. Then a few days later they let me go.\n\nI feel like this issue was targeted, since I’ve seen others in the company get off the hook for way more outlandish issues. Nonetheless, I’m now on the market looking for a job. How do i navigate this conversation in interviews? Should I pretend to still be at this company since it was recent? Really weird situation to be in since it was such an abrupt in to an already short history with the company.",
      "subreddit": "interviews",
      "score": 39,
      "url": "https://reddit.com/r/interviews/comments/1puvos2/got_fired_from_my_last_job_need_help_with_this/",
      "comments": [
        {
          "body": "I had to explain a two year gap in my work history due to extended medical leave. “I suffered an injury and was off work for surgery and subsequent PT. I am now able to return work and am doing so without the need for accomodations.” \n\nThat was how I handled it. Not the exact situation but perhaps it will give you some ideas.",
          "score": 29
        },
        {
          "body": "Hiring manager here.\n\nDon’t pretend. Be earnest. \n\n“Due to an accident and subsequent  temporary transportation issues, my employment was, unfortunately, terminated before the situation was resolved. The issue has since been resolved, and I’m enthusiastic about returning to a professional, team-oriented work environment.”\n\nYou’re telling me, without using your words, that your boss may not have been fully acting in a supportive manner. There’s two sides to every story, sure, but for you, OP, I’d keep it short and vague as my example above. \n\nGood luck! \n\nOh, and be sure your transportation issue is resolved. If I were to hire you, I’d be watching you for a bit to be sure there are no attendance issues or regular call-ins.",
          "score": 54
        },
        {
          "body": "I know that song and dance.  There's no scarier words from a manager than \"let us know if you need any help\" because only once has it not preceded layoffs by a few weeks.",
          "score": 12
        },
        {
          "body": "Be honest- tell them you had an accident that made your ability to return to full time work nearly impossible and they were basically left with no choice but to replace you. Express that you understand their decision- and move on.",
          "score": 24
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "dont mention it, i dont know why prople tell you yo mention it\n\nif they dont ask, dont mention it",
          "score": 4
        },
        {
          "body": "Don't imagine that being terminated has left you with a black mark that can never be erased. There are bad bosses as well as bad employees.\n\nWhen I interviewed for my third job, the interviewer asked me what happened at the last place. I talked about the insane working hours, complete lack of documentation, feeble onboarding. It turned out I was the first of eleven other new employees laid off, all within six months -- to avoid paying the recruiter's fees.\n\nTurned out he'd been terminated from his last job too. And he hired me.\n\nIt worked out fine. I busted my butt to do a good job, and had a great time.\n\nBe straight with whoever you're interviewing with. There were challenges, termination was a surprise. Now you're looking for a new place to work. And life goes on. Good luck!",
          "score": 7
        },
        {
          "body": "Honestly just explain in a sentence or so something like \"Got fired for attendance because I was in a car wreck and they stopped approving my WFH while I was getting my car fixed\" and I think ABSOLUTELY EVERYONE will go \"Wow holy shit fuck your previous employer\".\n\nI cannot imagine anyone holding that against you who is not a bullet you want to dodge.",
          "score": 6
        }
      ]
    },
    {
      "title": "How to tell if your offer is a scam",
      "body": "I hate that this is even a thing, but scammers are rapidly taking advantage of people desperate for jobs by offering them fake jobs and then stealing their money. Here's some things to look out for that may indicate you're being scammed:\n\n* **The role you applied for is an early career role (typically role titles that end in Analyst, Administrator, or Coordinator)**\n   * Scammers know that folks early in their career are easier targets and there are tons of people applying for these types of roles, so their target pool is extremely wide. There are many, many legit analyst/admin/coordinator positions out there, but be advised that these are also the types of roles that are most common targets for scams.\n* **Your only interview(s) occurred over text, especially Signal or WhatsApp**.\n   * Legit companies aren't conducting interviews over text and certainly not over signal or whatsapp. They will be done by phone calls and video calls at a minimum.\n* **You are told that you can choose if you want to work full- or part-time.**\n   * With very few exceptions, companies don't allow employees to pick whether they're part- or full-time. That is determined prior to posting the role and accepting applications.\n* **You were offered the job after one interview**\n   * It's rare for a company to have an interview process that only consists of one interview. There are typically multiple rounds where you talk to many different people.\n* **You haven't physically seen anyone you've talked to**\n   * You should always have at least one video call with someone from the company to verify who they are. If you haven't had any video calls with someone from the company, that's a red flag. Make sure to ask to have a video call with someone before accepting any offers.\n* **You were offered a very high salary for an early career role**\n   * As much as everyone would love to be making 6 figures as an admin or coordinator, that just isn't realistic. Scammers will try to fool you by offering you an unbelievable \"salary\" to hook you.\n* **You're told that you will be paid daily or weekly.**\n   * Companies can have odd pay schedules sometimes, but most commonly companies are running payroll twice a month **or** every other week. It's unusual for a company to be paying you on a daily or weekly schedule.\n* **You are being asked to purchase your own equipment with a check that the company will send you**\n   * Companies will almost never send you money to purchase your own equipment. In most cases, companies will send you the equipment themselves. If a legit company wants you to purchase your own equipment, they will typically reimburse you after the fact as opposed to give you a check upfront.\n\nThis list isn't exhaustive, but if you have an \"offer\" that checks multiple of the above boxes then it's very likely that you're being scammed. You can always double check on r/Scams if you aren't sure.",
      "subreddit": "interviews",
      "score": 173,
      "url": "https://reddit.com/r/interviews/comments/1g480jv/how_to_tell_if_your_offer_is_a_scam/",
      "comments": [
        {
          "body": "Validate it physically exists is chief advice. ",
          "score": 34
        },
        {
          "body": "Here's an example of the intro to one I got today (and I seem to be seeing these at least once a week) -\n\n  \nXXXXXXXXXXXXX  11:32 AM\n\n# Mitsui &amp; Co. Recruitment Program\n\nWe are pleased to inform you that after evaluating your background, we believe you are a good fit for the Mitsui &amp; Co. group. We are currently looking for a talented individual for a position that supports both on-site and remote work. This position offers you a unique opportunity to participate in innovative projects, utilize your professional skills, and work with a dynamic team to drive the company forward.  \n  \nWe look forward to contacting you soon to discuss this exciting opportunity further.  \n  \nXXXXXXX  \nMitsui Group Recruitment\n\nHe has take the time to set up a LinkedIn profle that LOOKS legit, but I've had so many of these I know what will happen. Next steps will be telling me to set up a Telegram or WhatsApp meeting with the top guy at Mitsui. Then he tells me how great I did, welcome to the company, then telling me to buy the following items from them, give them my credit card or bank account #, they will immediately send me a check (they will, it will be bad.)\n\nThe first couple of times I got these I followed up, and once it got to the Telegram stage I said I'm an experienced manager as you've seen in my resume (which also says retired now) and no one does professional communications in Telegram, we can use email or phone. Never heard another word. Then a month later got an identical message, same company, same write up, but a woman this time with the same type of LinkedIn profile.\n\nThese are scams. Never use some protected identity app like Telegram or What's App for professional communication.",
          "score": 10
        },
        {
          "body": "Me reading this whilst sat waiting for an administrator interview that's just the one interview 😆🫣",
          "score": 7
        },
        {
          "body": "OMG. I’m so glad I found this message. I’m in the process of getting a remote Data Entry job from “Sharecare.com.” The company is legit but the 3 people (Director of HR, hiring manager, and Online Supervisor). They emailed me saying I’ve been selected. I didn’t apply and the job is NOT posted on the company website. Then i interviewed on Teams via chat with hiring manager. Then, I received an offer the next day. I texted Supervisor on Singal app today and his message sounds like AI translated. He ends his message with “Do you understand?” He asked how long I’ve been living in U.S. he will send me a check to buy equipment and the company will not require to take back the equipment after employment ends.",
          "score": 7
        },
        {
          "body": "Yes, exactly what occurred to me. The 'offer' is extended when you upload and complete a W2 for wages and provide a direct deposit financial institution. Thank you for exposing everyone to this type of fraud! I wish there was a way to catch and report them!",
          "score": 5
        },
        {
          "body": "I think one time they did a group interview without telling us where all candidates met and they asked if u want to work full or part time lol 😂",
          "score": 6
        },
        {
          "body": "This is such an important topic! It’s crazy how many scams are out there, especially targeting those of us just starting out. I had a friend who almost fell for one of those \"job offers\" where they wanted her to buy equipment upfront. Thankfully, she did her homework and did a video call with them, which quickly turned into a weird situation when they kept avoiding face time. Definitely keep your radars up, folks! One interview and a sky-high salary? Major red flags. Always trust your gut and don’t hesitate to ask for clarity!",
          "score": 5
        }
      ]
    },
    {
      "title": "Presentation for an interview to lead a target driven team",
      "body": "I'm feeling quite confident for the interview section, however I'm not really sure on how to bulk out my presentation. \n\nHas anyone any advice on some key concepts and \"buzz words\" I should be putting in a presentation about leading a target driven team? \n\nMany thanks in advance for any advice",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/96et3e/presentation_for_an_interview_to_lead_a_target/",
      "comments": []
    },
    {
      "title": "aced the interview, still rejected. companies waste so much time",
      "body": "i just interviewed for a role i was so excited about — better pay, more flexibility, an escape from my overworked/underpaid current job. i had two rounds that felt amazing. the manager and i really vibed (she even sent me a tv recommendation after??), and she told me i’d hear back in 1–2 weeks.\n\nit’s now been almost 4 weeks of silence. i tried not to get my hopes up but i was manifesting, visualizing myself getting this job, checking my inbox constantly. then today, in the middle of target, the ceo emails me that they “moved forward with another candidate.”\n\ni cried, then got pissed. no feedback, vague rejection, even though i was literally overqualified and felt like i nailed the interviews. it makes me question if something’s wrong with me or if bias played a role because everything else felt aligned. plus the whole process was so unorganized — slow scheduling, me having to follow up, etc.\n\nthe worst part is i slowed down at my current job because i really thought i’d be leaving. now i feel embarrassed for putting all my eggs in one basket. at least now i can stop obsessively checking my email and move on, but wow… it really sucks.",
      "subreddit": "interviews",
      "score": 85,
      "url": "https://reddit.com/r/interviews/comments/1oxggc3/aced_the_interview_still_rejected_companies_waste/",
      "comments": [
        {
          "body": "It could be a whole bunch of random reasons that you or they can't control so don't dwell on it too long. I had a great second interview with 2 people separately, they stayed way over time to answer my questions, we were light and even making jokes by the end and laughing. I literally checked all the possible boxes, more experience than they needed. Got a call with went with other people. It stung because it's so confusing but then figured it must be something stupid so why worry about it. Can't control what people think or decide. This just wasn't it and on to the next. Good luck!",
          "score": 22
        },
        {
          "body": "It happened to me too, only they asked for a presentation on how I would improve their site once I started. I worked on it the whole long weekend. I had a panel interview and the manager walked me out and was personable. A week later, I got rejected.\n\nI think they only wanted my ideas. They told me to email them my presentation before I got there so they'd be all \"set-up\" for my arrival.\n\nBullshit.",
          "score": 18
        },
        {
          "body": "I’m so sorry this happened to you, although feel like we are living the same life.. 🙁",
          "score": 9
        },
        {
          "body": "This was my experience yesterday. This shit is miserable.",
          "score": 7
        },
        {
          "body": "You were beaten out by another candidate. It happens. But might not be best idea to start coasting at your current job because an interview went well. Current job market and let's of good candidates on market should have made you understand its tough to get offers right now.",
          "score": 6
        },
        {
          "body": "Sadly, this is the interview process. I went through it 11 months before landing a job a few years ago. You always have to keep in mind that there could be a better candidate. Nothing ever a sure thing. Keep putting your best food forward. You’ll land a job you’ll enjoy. Good luck!",
          "score": 4
        },
        {
          "body": "Always assume there is no job.  Do your best, but don’t get your hopes up.  Maybe they have an internal candidate but they have to interview outside people.  They might really like you but they had already made their decision.",
          "score": 4
        },
        {
          "body": "That's awful that they didn't get back to you. \n\nI've been experiencing these awesome interviews only to get radio silence. It's brutal out there and not normal times.",
          "score": 4
        },
        {
          "body": "Is it time to turn to crime?",
          "score": 2
        }
      ]
    },
    {
      "title": "Tough Interview Question",
      "body": "Hi there,\n\nI have an interview next week, and the employer would like me to submit a video answering a few questions as well. One question includes the company's target salary range ($61K - $62K), and then states \"Please confirm that you are willing to work with this salary\".\n\nOverall, I'm having a hard time preparing for this question. I feel that it's been phrased in a way that makes negotiation seem risky or inappropriate - but I can't tell if that's \"part of the game\".\n\nI do find the pay to be fairly low (a ***significant*** pay cut from my previous position), and I would like the opportunity to negotiate a slightly higher pay if given the offer. I wouldn't ask for anything wild, but I am strongly qualified and have solid industry experience. Essentially, I really need a job - but I don't want to leave money on the table.\n\nThe trouble is, I'm afraid that being transparent this early in the interview process can cost me their consideration. The market is tough, and I've been looking for a while - so I would probably accept the offer if it really is their best. Companies seem to have all of the leverage these days, so I don't want them to write me off completely for wanting a bit more. Especially if they have candidates who are more willing to accept their original offer. However, I also understand that I'll have a ***tiny*** bit more leverage once an offer is made. I don't want to \"agree\" to their target salary too quickly, and leave money on the table. And I don't want to blindside them if I \"agree\" now, and then negotiate later on.\n\nSo the question is: Would I lose the opportunity for hinting at a little more? How would you navigate this?\n\nI've drafted a short response with hints toward negotiation - but I'm not sure if I'd be shooting myself in the foot by using it. My response would be submitted via video - so there is no opportunity for questions or dialogue with the employer.\n\nLet me know what you think:\n\n*\"Based on my current understanding of the position, I find the target salary to be acceptable. I'm eager to learn more about the role's expectations, and benefit packages - which would help me make my final determination. Should I be fortunate enough to receive an offer, I would look forward to a collaborative discussion about a compensation that feels fair and appropriate to both parties.\"*\n\nI'd love to hear your thoughts! Thanks in advance.\n\n\n\n\n\n***UPDATE (October 27, 2025) :\n\nI decided to record the HR video responses *after* my interview with the department leads. The leads seemed very friendly, genuine, and open to a collaborative and positive work environment. This made me feel safe to be a bit more honest in my HR video response. They also mentioned that the next (and final) step would be a reference request, not another interview. \n\nKnowing this, I felt that it was \"now or never\" to set my salary expectations.\nI essentially agreed to the \"high end\" of the salary range, and expressed a lot of excitement for the role. My response still came out a bit \"wordier\" than I had hoped... but that's just who I am, haha.\n\nI said something like,\n\n\"I am very excited about this opportunity, and feel grateful to be in consideration for the position. While I was initially searching for positions with a higher starting salary, I do feel strongly aligned with this role - and after speaking with the interview panel, I feel even more confident that I could be a compatible and resourceful addition to the team. With that said, yes - I would be willing to accept an offer at the high end of the targeted salary range, and in consideration with the total compensation package. Thanks very much.\"\n\nI think my response said \"I'm excited about this opportunity, so I won't negotiate (much) - but I would hope for your best offer\". So the ball is in their court. With the pay range being so small, I would have a hard time understanding an offer that was less than their top-of-range, especially if they considered me their best candidate. And maybe, if they truthfully have more wiggle room than they are letting on, they would offer me a higher salary to reciprocate my excitement? Or will include a semi-annual performance eval? Wishful thinking, but we'll see.\n\nOverall, my actual interview went very well. They mentioned that they have more interviews through the first week of November - and I would hear back around that time if I made it to the final round. Here's to hoping that I made a lasting impression.\n\nI will update again if I hear back either way! Going to keep applying for other jobs in the meantime.",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1ofhgfx/tough_interview_question/",
      "comments": [
        {
          "body": "Sorry.  That question is definitely there for a reason.  It's the early screener for folks that want/need more money.  Obviously you've made more before - the pay should make this role a complete non-starter for you unless your job's market niche got decimated and this is one of the few relevant roles currently open...",
          "score": 10
        },
        {
          "body": "Perhaps something like…”Yes, this is close to the pay range I would consider depending on benefits and the job demands.”",
          "score": 7
        },
        {
          "body": "They told you what they're willing to pay. The explicitly asked you to confirm that that's an acceptable range for you.\n\nThere is no negotiations.\n\nThat's what they'll offer and if you ask for more they'll remind you that you were dishonest in the interview and drop you.\n\nIt sucks but that's what they're willing to offer until they go four or five months not finding somebody willing to take it and they have to up the range that's the range.",
          "score": 6
        },
        {
          "body": "They think $1k is a range? That’s less than $20 a week. If you’re desperate, take the job while you keep looking. Tell them you’ll take $61492.50. They’ll definitely come back with more questions 🤣",
          "score": 6
        },
        {
          "body": "Pay negotiation isn’t really a thing anymore. If you won’t do it, there are 5 others that will",
          "score": 4
        },
        {
          "body": "The question is not tough. They are cheap. Move on if that’s not the market value.",
          "score": 3
        },
        {
          "body": "I agree with what the others have said so far. In today’s market, having that info up-front is usually there to save you and the company time of going through the motions if the proposed salary doesn’t work. \n\nIn short, if it’s something you’re willing to accept, answer yes, best of luck, and work to make up the difference in pay when the market is better and you have leverage at the company. (Uphill, I know). \n\nIf it’s not feasible for you, my recommendation would be to look elsewhere and focus your energies on a better fit. \n\nWere this 5 years ago, I’d understand playing the game of chicken and going through the motions in hopes of them falling in love with you and getting leverage to negotiate. As someone else said, if you’re not willing to, there’s likely several people who will and they’d rather focus their energy and time with candidates who have said “yes”.\n\nEven in my last role, when I was negotiating a salary increase, I checked the market and what I was making was more than the market rate at the time (only a bit over a year there). In short, if they wanted to replace me or if I left to find another job, they’d likely be able to do so cheaper and I’d likely be losing salary hopping jobs rather than saying. So that made negotiating hard. The market really sucks. :(",
          "score": 3
        },
        {
          "body": "I think you can be vague and your response is fair. The reality as others have stated is it’s an extremely tight market and negotiation is tough. Employers can get very skilled (overqualified) and employees for bargain rates because there are so few jobs. You have to decide if the salary is workable for you and presume maybe you can get a couple % above the range but they also may offer less than full. I recently got an offer at the midpoint of a $20k range after telling them I needed it to be at the very top. They came up 1.5% when I pushed back and said that was all they could do. I took the job, I had no leverage and it was clear they had other qualified candidates.",
          "score": 3
        },
        {
          "body": "Every interview screen I’ve had recently asks what my pay range would need to be. 3 times now the HR person has confirmed that if I had asked for outside of the upper limit that they would not have moved me forward. Very clear they don’t want to negotiate that.",
          "score": 3
        }
      ]
    },
    {
      "title": "Applying to fewer jobs can get you more interviews. Agree or disagree?",
      "body": "We all hear that a job search strategy is about quality over quantity, but what does that actually mean in real life? The idea is to stop mass-applying and instead focus your energy on a specific list of target companies.\n\nFor those who have made this switch, what changed when you stopped applying everywhere and focused on just 20-30 companies? Did you actually get more interviews?",
      "subreddit": "interviews",
      "score": 11,
      "url": "https://reddit.com/r/interviews/comments/1oojhq4/applying_to_fewer_jobs_can_get_you_more/",
      "comments": [
        {
          "body": "I don't see how you can get more interviews if you're applying for fewer jobs, just mathematically. But your ratio applied to interviewed is likely to increase if you only focus on roles where you'd be an obvious great fit. There's no magic to it, you're just wasting your own time less.",
          "score": 8
        },
        {
          "body": "It's a numbers game. \n\nYou should apply to jobs that you fit as closely to 100% as possible, but you shouldn't limit your focus to 20-30 companies. You're missing out on so many opportunities in the process and resting on the assumption that you're targeting the companies with the healthiest budget and outlook.\n\nMy husband was laid off in February and focused heavily on the best fit companies and roles at the beginning. This means his application rate was low (5 a week) and his phone screen rate was also low (I think 2-3 a month). By July, that method needed to shift. He ramped up his application rate to 20-30 a week, and he saw the phone screens also increase to more like 3-5 per week. \n\nFunny enough, the one company he was watching ended up in a hiring freeze. All of the opportunities where he was a final candidate were at companies that were never on his radar previously. \n\nLike I said, it's a numbers game today. You should't blindly apply to 200 open positions a day, but you shouldn't limit yourself to focus on \"quality\" over quantity.",
          "score": 5
        },
        {
          "body": "I get more quality by focusing longer on fewer applications and having a very individualized resume and over letter with a personal connection. If you’re in a position to be picky I’d mostly just do that. \n\nIf need a job I wouldn’t stop playing the numbers game. The job I have now is one I didn’t think I’d want because it sounded boring and posted salary was below my bounds but I thru a quick app at it and they came above range and it was one of the best cultures I’ve worked in.\n\nI prefer a hybrid approach. Go thru all the jobs I really want, pick a hand full to target closely, then mass apply to others that might be close",
          "score": 3
        },
        {
          "body": "As a Career Coach and a former recruiter - I would go with 20–30 companies startegies, providing  your education, skills, and experience align with their job requirements. This approach makes it much easier to thoroughly research each company, evaluate technical and cultural fit, and identify the key players in the organization—including the direct hiring manager and recruiters.\n\nMass applying is out, in my book.\n\nHope this helps!",
          "score": 2
        },
        {
          "body": "I don’t buy this theory, more submissions mean more chances for interviews.  It’s all about timing.  You need to be the first 10% of the submissions \n\nAlways keep on testing your resume for getting call backs from recruiters.  Ideally a good ratio is 5 call backs per 100 submissions \n\nI’ve had like 10 different variations for 3 different type of jobs",
          "score": 2
        },
        {
          "body": "Out of my whole job search before getting my directors job I had applied to 27 companies. Out of that 27 5 of them gave me offers including the one I am in today. \n\nThe focus is targeting your previous role experience, education, knowledge, skills, processes, and location is key to finding a perfect role. Those targets must meet the role at least 80% or better 90%",
          "score": 1
        },
        {
          "body": "Nah. \n\nThe job search is about quantity + follow up. Flood the field and content every hiring manager/HR rep. For each job application you should be contacting at least 1 person at the company.",
          "score": 1
        },
        {
          "body": "Anecdotal advice is not a reliable source.\n\n  \nThe job market is in the toilet.\n\n  \nLeveraging the absolute shit out of your network... yes, even reaching out to that prick you hate because he might be able to forward your resume to the recruiter/hiring manager...\n\nor absolute luck being spotted by a recruiter and being the first one to respond\n\nor making it through some garbage ATS filter and catching some self-important \"Talent Acquisition Rep\" on a good day...\n\n  \nBeyond that, it's hell out there. And has been for 3+ years now.",
          "score": 1
        },
        {
          "body": "Probably, I applied to three positions for which I was fully qualified and got interviews for all of them. Each progressed to a second round. I wasn’t selected for one because they required someone on-site, and I don’t live in that city. The second chose a “slightly better fit.” And I received an offer from the third.\n\nTotal time between my last job and the new one: 25 days. I was very fortunate. I only applied to roles where I met all the requirements, it just doesn’t make sense to do otherwise.",
          "score": 1
        },
        {
          "body": "Honestly, it depends on how you're defining quality. If you're just applying to fewer places but doing the same thing, nothing really changes.\n\nWhat actually makes the difference is when you treat those 20-30 companies like a targeted campaign: research each one, find people who work there, reach out for conversations, and then apply with a tailored application that shows you understand what they need. That's when the response rate goes up, because you're not just another resume, you're someone they've already had a connection with.",
          "score": 1
        }
      ]
    }
  ]
}