{
  "company": "tesla",
  "post_count": 66,
  "exported_at": "2026-01-18T17:44:53.310Z",
  "posts": [
    {
      "title": "What are the more normal companies a new grad should apply for?",
      "body": "I first tried all these amazing companies everybody on this sub seems to be shooting for. Got about 5 interviews, which is not bad, I didn't expect to hear back from some (for example Palantir, Uber, Tesla) but somehow they wanted to interview me, unfortunately I didn't pass all of the interviews.\n\nSo what are the more normal companies I should apply for where I would still be able to have a good experience or at least grow as a developer? I feel like I have been deluded by this sub a bit because I have only applied to these hot-name companies, and its apparent now that I'm not going to get a job there.\n\n",
      "subreddit": "cscareerquestions",
      "score": 60,
      "url": "https://reddit.com/r/cscareerquestions/comments/5bng0r/what_are_the_more_normal_companies_a_new_grad/",
      "comments": [
        {
          "body": "I don't know how relevant this still is, but I compiled all the places I applied to [almost a year ago](https://www.reddit.com/r/cscareerquestions/comments/468d0o/the_152_companies_i_applied_to_if_its_of_any_use/).",
          "score": 23
        },
        {
          "body": "You should check this link out: https://github.com/j-delaney/easy-application\n\nIt has a list of over 340 companies with really straight-forward applications. Also, could you share your interview experience with Uber? What sort of questions were asked? Was it the onsite stage? \n\nAll the best!",
          "score": 12
        },
        {
          "body": "Here's something I've been doing recently as someone who could possibly be looking for new work soon. \n\nCheck the Fortune 100 Best companies list. You can get started now as a new grad in your career, with a good company. I just took an offer from the first company that contacted me, turns out benefits are okay but well below the norm. \n\nFor instance, you'll see companies like pwc, Accenture, Capital One, EY, Edward Jones...all these companies you see on TV, they're all there. All great places to work, all have great mentorship programs for those coming straight out of college. Don't limit yourself to the Big 4. Go for the Big 100. ",
          "score": 25
        },
        {
          "body": "IBM hires tons of new grads, pays well, and has offices everywhere. It's a good place to start a career and plenty of people use it as a stepping stone to the hot-name companies.",
          "score": 28
        },
        {
          "body": "I'm in the same position as you. Nowadays, I've been filtering LinkedIn jobs to only show \"Entry-level\" jobs. I've also been filtering through Indeed and a few other job posting sites. At this point, you should expand away from the 'top' companies that you've been hearing all throughout your life and start looking at software companies of all sizes.",
          "score": 5
        }
      ]
    },
    {
      "title": "Technical Presentation for Tesla QA interview",
      "body": "",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1p4h3x7/technical_presentation_for_tesla_qa_interview/",
      "comments": []
    },
    {
      "title": "Data Engineer at Tesla",
      "body": "I’m in the interview process for a Data Engineer role at Tesla. I’ve already passed the initial screening and a one-hour interview, and I submitted the 90-minute technical assessment last week. \n\n\n\nHow long does it typically take for the team to review the assessment and decide on the next steps? The next stage will be panel interviews - any insights on what to expect in the 1:1 engineer interviews? Technical coding, behavioral questions, etc.?",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1i914p1/data_engineer_at_tesla/",
      "comments": [
        {
          "body": "The review process for technical assessments at Tesla can vary, but it typically takes about 1-2 weeks for the team to evaluate your submission and decide on next steps. Given that you submitted your assessment last week, you should expect to hear back soon. If you don't receive any communication within the next few days, it's perfectly acceptable to reach out to your recruiter for an update on the status of your application.\n\nFor the panel interviews, especially the 1:1 engineer interviews, be prepared for a mix of technical and behavioral questions. Tesla is known for its rigorous interview process, so expect in-depth technical discussions related to data engineering concepts, SQL, Python, and big data technologies. They may also present you with real-world scenarios to assess your problem-solving skills. Behavioral questions will likely focus on your past experiences, how you handle challenges, and your ability to work in a fast-paced, innovative environment. I'm on the team that created [AI interview practice](http://interviews.chat) tool that can help you prepare for tricky interview questions like these and boost your confidence for your Tesla interviews.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Tesla Open book/Open internet Test for Mechanical Engineer",
      "body": "I have cleared the first round of interview in Tesla (Bay area) and the next round is a 2.5 hours open book/Open internet test is what I have been told. This is a Mechanical engineer role. Has anyone attended one such test? Csn you give some advice regarding the same like test pattern, topics covered etc.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1h7ujzh/tesla_open_bookopen_internet_test_for_mechanical/",
      "comments": [
        {
          "body": "Open book/open internet tests for mechanical engineering roles at Tesla are designed to assess your problem-solving skills and ability to find and apply relevant information quickly. These tests often focus on real-world engineering challenges rather than rote memorization. You'll likely encounter questions related to mechanical design principles, materials science, thermodynamics, and possibly some specific Tesla-related topics like electric vehicle systems or battery technology.\n\nThe key to success in this type of test is to manage your time effectively and use your resources wisely. Don't get bogged down on any single question - if you're struggling, move on and come back to it later. Practice using search engines efficiently to find relevant information quickly. Also, familiarize yourself with Tesla's products and engineering philosophy beforehand. If you're worried about the test format, you might want to [interview with AI](http://interviews.chat). I'm on the team that developed it, and it's a tool designed to help people navigate tricky interview scenarios like this one.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Evidence of excellence to approve job offer?",
      "body": "I was wondering if anyone had to write evidence of excellence as the final stage of the interview process that has to get approved by upper management before HR can send out the job offer.\n\nThis is for a mechanical engineering position at Tesla. ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1g6z780/evidence_of_excellence_to_approve_job_offer/",
      "comments": []
    },
    {
      "title": "Name and Shame: Tesla",
      "body": "https://i.imgur.com/CjSuUP4.png\n\nThe guy put in his notice and quit his job because he had a Tesla offer and start date, then Tesla pulled the offer. They have tons of SWE job openings so why not slot him into another open SWE role?",
      "subreddit": "cscareerquestions",
      "score": 2737,
      "url": "https://reddit.com/r/cscareerquestions/comments/nlq44w/name_and_shame_tesla/",
      "comments": [
        {
          "body": "Post was automatically removed for a high number of reports:\r  \n\r\n\n&gt;1: This is spam\r  \n\r1: Post is low-effort\r  \n\r1: Name &amp; Shames are only for behavior that is blatantly unethical, illegal, or exceptionally shitty.\r  \n\r\r\n\nMy response to another user:\n\n&gt;While I understand where you are coming from, automatically removing posts that receive a high amount of reports significantly reduces the load of the moderators, and prevents certain dumpster fires from occurring. And while we wish to completely let the community decide what they want to see, we are limited in that regards with our efforts to somewhat steer the subreddit towards a general direction of on topic discussions. Posts such as memes, drama and posts mentioning 'top companies' often times will overshadow other questions and concerns, and is a grey line that we are actively trying to better define.\n\nI have reinstated the post, due to valid question of OP in the body, but let's try to refrain from posting substantial screencaps in the future, and avoid slightly clickbaity titles that provide little to no context.",
          "score": 1
        },
        {
          "body": "Things like this are what scare me out of job hopping. There's no repercussions for companies backing out of an offer before you start. I've had it happen once before. If a company gives a written offer and backs out, they really should be responsible for unemployment.",
          "score": 1289
        },
        {
          "body": "I just swapped jobs and I was having daily panic attacks before my start date because I was worried that something like this would happen or that I was straight up being scammed.  The offer I received was seemingly way too good but that almost worried me more than I was excited.  Turned out the HR person that I had been in contact with was sick and entirely unavailable for over a week through which I had no contact from anyone.  I almost always felt minutes away from rescinding my resignation and begging for my old job back, despite entirely hating the work (though the team was great, definitely do miss them ❤️).",
          "score": 167
        },
        {
          "body": "But what about all those instagram motivational posts on how Elon Musk would hire someone who didn't even go to school????",
          "score": 564
        },
        {
          "body": "A few years ago, Tesla gave me a 2 day take home challenge for a ML engineer role. After I did it, the recruiter said he thought I had more work experience and said I wouldn't be moving forward.",
          "score": 424
        },
        {
          "body": "I feel for the guy. I almost had something similar happen to me (interned in one team, came back as full time to a completely different team and org).  \n\n\n&gt;They have tons of SWE job openings so why not slot him into another open SWE role?\n\nAFAICT this depends on how hiring is structured inside of the company. In some companies (FB, Google) the philosophy is that when they hire a software engineer that person should be able to work in any software team in the company. So you have one big hiring pipeline supplying a big pool of teams and reorgs/moving headcount around rarely cause this kind of problem for the candidates.\n\nIt's also common to have multiple, non-interchangeable recruiting pipelines, sometimes down to the team level. That makes it way easier for managers to hire people with the specific skills they need, but it also means that transferring is harder and stuff like this happens.  \nKinda crummy that recruiting didn't get back and say \"sorry, but here is a different role\", who knows, maybe the recruiters were also let go.",
          "score": 145
        }
      ]
    },
    {
      "title": "Have a phone interview with Tesla for data sc internship. What to expect?",
      "body": "Hello\n\nI have been scheduled for an interview with Tesla for data science internship. I have been told that the interviewer prefers to give a take home coding test. So, if I am not going to be coding for 1 hour, what should I expect in the interview?\n\nAlso, how should I prepare for it?",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/5qspzo/have_a_phone_interview_with_tesla_for_data_sc/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "So, how did it go?\n",
          "score": 1
        },
        {
          "body": "Hii I got a call from Tesla for data science internship. Can any one of you please tell me what to be expected in the interview, how to prepare and whats the procedure be like?",
          "score": 1
        }
      ]
    },
    {
      "title": "Name and shame: OpenAI",
      "body": "Saw the Tesla post and thought I'd post about my experience with openAI.       \n\nHad a recruiter for OpenAI reach out about a role. Went throught their interview loop: \n1. They needed a week to create an interview loop. In the meantime, they weren't willing to answer any questions about how their profit-share equity works.       \n2. 4-8 hour unpaid take home assignment, creating a solution using the openAI APIs amongst other methods, then writing a paper of what methods were tried and why the openAI API was finally chosen.      \n3. 5-person panel interview         \nThe 5-person panel insterview is where things went astray. I was interviewing for a solutions role, but when I get to the panel interview, it a full stack software engineering interview?      \nSomehow, in the midst of the interview process, OpenAI decided that the job should be a full stack software engineering job, instead of a solutions engineering job.     \nNo communication prior to the 5 panel interview; no reimbursement for the time spent on the take home.      \nI realize openAI might be really interesting to work at, but the entire interview process really showed how immature their hiring process is. Expect it to be like interviewing at a startup, not a 500+ company worth 12B.         \n\nEdit: I don't know why everyone thinks OpenAI pays well.... most offers are 250+500, where the 500 is a profit share, not a regular vesting RSU. Heads up, even with the millions in ARR, OpenAI is not making any profit, not to mention the litany of litigation headed their way.",
      "subreddit": "cscareerquestions",
      "score": 2251,
      "url": "https://reddit.com/r/cscareerquestions/comments/15wf2w9/name_and_shame_openai/",
      "comments": [
        {
          "body": "Couple reports on this one. \n\nLeaving it up because yall are upvoting the heck out of it, and the highest voted comments ***are not*** to the tune of \"that wasn't exceptionally shitty, that's just normal job interview stuff\".",
          "score": 1
        },
        {
          "body": "I once interviewed for a manager job at a growing startup. The VP brought me into the office four times for a total of maybe 10-12 hours of  chats with him and interviews. At the end of it, he said to me, \"I realize now that at this stage in our growth, we should be hiring a director, not a manager, and you're not qualified for the director role\".\n\nAfter talking that long with him and other employees, I agreed completely on both points. I wish I could have billed him for my consulting time. Frustrating. \n\nI've subsequently met several people who worked under that VP at that startup and the company he went to next, and they all told me he is a giant yelling asshole, so bullet dodged, I guess.",
          "score": 818
        },
        {
          "body": "just a matter of time until someone mentions Canonical.",
          "score": 312
        },
        {
          "body": "Unfortunately, companies like Tesla and OpenAI (and other big tech companies) can afford to have these crazy interview processes.\n\nWhy? Because they have tens of thousands of applicants, many thousands of whom who would do anything to join these companies.\n\nIt's fucked up, but it is what it is.",
          "score": 460
        },
        {
          "body": "The job title bait and switch is so annoying and incompetent. I've had that one pulled on me as well. And it was a role I could do, just explicitly didn't want to, even pointed out in a cover letter, and still those time-wasters (not OpenAI) invited me.",
          "score": 54
        },
        {
          "body": "[deleted]",
          "score": 176
        }
      ]
    },
    {
      "title": "I blinked and am now \"deep\" into embedded. Should I embrace it?",
      "body": "I'm now starting my 3rd year of college. As a Freshman, I had a pretty generic CS resume. I managed to get an embedded swe role and got a return offer for that the next summer. The club I'm in has also become a huge part of my life where I've done a ton of embedded work. I've already accepted embedded for Tesla next spring. My resume is now stacked in the embedded world and I'm getting a pretty high interview rate for embedded roles (almost 1 in 10). Whereas I'm either getting auto-rejected from higher level or cloud based roles or I think my resume is too weak to apply. \n\nI have no AWS on my resume, never built an app, no react, the only thing web based thing is some Microsoft Graph work. I definitely enjoy embedded, but should I try to diversify now? What is salary and employment like compared between the two?",
      "subreddit": "cscareerquestions",
      "score": 127,
      "url": "https://reddit.com/r/cscareerquestions/comments/1naipdx/i_blinked_and_am_now_deep_into_embedded_should_i/",
      "comments": [
        {
          "body": "Embedded is fine. I work for one of the big tech companies and embedded is still under the same ladder as other SWEs.\n\nPeople will often say embedded pays less, but it's important to recognize that's a correlation, not a causation. Embedded jobs have a disproportionately higher positions in lower paying industries like defense and manufacturing. An embedded job at a tech company pays the same as other SWEs at tech companies.",
          "score": 172
        },
        {
          "body": "You’re not “deep” into anything lol you haven’t even started your first fulltime, non-internship role. You could do embedded now but have a long career in something else. Just keep things open and go with the flow.",
          "score": 26
        },
        {
          "body": "Embrace the void-, I mean the low-level world.\n\nIn a way, I kind of accidentally entered the embedded space.  Started with some personal projects I did in university and then I started to land actual roles.  I work a bit more at the surface level (lots of C++ &amp; Qt), but sometimes do low level work as well.  I studied CS, but funny enough, I ended up getting more interviews for hardware related roles than my peers with more hardware centric degrees. \n\n—-\n\n1. The pay is higher IMO\n2. You don’t have to stress about learning the latest web technologies\n3. While there might not be as many jobs available, you’re also competing with a lot less people too (multiple orders of magnitude less).  The pool of talent is also getting smaller (and older)\n4. Your coworkers may be on the older side.  That can be good for a mentorship, but also it can be hard to change some of their ways\n5. You may end up working with much older technology.  Which is cool, but also a pain at times.  Don’t ever be worried about feeling out of date honestly\n6. LLMs have a lot less training data on this subject (compared to web and mobile), so if you’re worried about AI, it’s a bit safer IMO\n\nMy only regret from University was not learning more about hardware.",
          "score": 52
        },
        {
          "body": "Bro said deep in embedded while still in college 😂😂\n\n3 years studying embedded in college doesn't mean deep in embedded. Deep in embedded is working in the embedded field for like a decade+ . You can move wherever you want",
          "score": 14
        },
        {
          "body": "Embrace it. Embedded systems are not going anywhere. I might be a bit biased but I went the other way. I’ve always enjoyed being in lower level closer to the hardware type systems. Had a couple jobs that were kinda close to this. However one time when I needed a new job I couldn’t find anything embedded, so i transitioned to .net development. I still scratch that embedded itch by playing around with self built home automation systems for myself.",
          "score": 10
        },
        {
          "body": "Embrace it. The world doesn’t need more web developers right now.",
          "score": 12
        },
        {
          "body": "I am the opposite, I somehow got a full stack research assistant role and am deep into full stack. I think that it’s not ideal to throw what you have out the window for full stack. Have not seen many roles that want both.",
          "score": 6
        },
        {
          "body": "You’re not deep into anything lol just keep doing it if you like it otherwise switch it up. Enjoyment and passion trump marginal pay differences 100% of the time.",
          "score": 4
        },
        {
          "body": "blink again",
          "score": 5
        }
      ]
    },
    {
      "title": "Tesla Phone Interview",
      "body": "Has anyone done the Tesla phone interview?\n\nI already had the initial phone screen with the recruiter, this call is with a senior manager in IT Ops.\n\nWhat should I expect?",
      "subreddit": "cscareerquestions",
      "score": 14,
      "url": "https://reddit.com/r/cscareerquestions/comments/5bdexk/tesla_phone_interview/",
      "comments": []
    },
    {
      "title": "Community college success story",
      "body": "Posted this on r/csMajors originally and it got way more attention than expected, so figured I’d also post here and maybe reach more people that used to be in a similar position as myself. Also note, I’m not going for SWE as a career, but cybersecurity :)\n\nI graduated from community college a bit over two years ago with an Associates degree in CS. I didn’t transfer and instead worked as a waitress because I had lost interest in the field. Someone contacted me about a contractor role, related to manual software testing. It paid $15/hr which was just a bit better than I was making at the time but that was enough for me to make that move.\n\nI had the chance to use my Python skills to automate some basic tasks and enjoyed it, but the job felt pretty dull overall. I started working on my CS Bachelor’s at an online no-name school because I wanted to get hired at the company I was working at. Through a bit of networking internally, I was offered a contract role as an analyst on the Info Security team unexpectedly. This was a year after I started my first corporate role.... I had no experience in the field but I became really passionate about learning and loved challenging myself. $25/hr was a huge jump for me, and when I graduated a few months later, I made a salary of $70k. I enjoyed my team and not so much my company, but I was comfortable. At 22, that’s not bad money!\n\nI decided to start grad school (at yet another online no-name school) because I wanted a stronger foundation in security. I never dedicated much time to applying to other roles, but figured there would be a small chance of ending up getting a nice internship since I’m a grad student with a few months of experience.\n\nTwo months after I submitted (and forgotten about) a security internship at Tesla and the whole interview process went by so quickly I couldn’t believe it. I was offered a Security Engineer internship at Tesla that paid $35/hr, more than my full-time role. I still haven’t completely processed it. I start in January.\n\nIn a panic, I started applying to summer internships because I’d be losing my job security (no pun intended). I think I applied to 70 within the past month. Last week I did my final interview for a pretty well-known tech company, for another Security Engineer internship. I was extended the offer today... $50/hr. And I still have interviews for two other companies next week.\n\nMoney was never really my motivator, it was my desire to find more challenges. I had no idea that I’d even be considered for a role at a highly respected company because of the non-traditional path I’ve taken, which was looked down upon by a few people along the way. But it is possible!",
      "subreddit": "cscareerquestions",
      "score": 423,
      "url": "https://reddit.com/r/cscareerquestions/comments/k6on1h/community_college_success_story/",
      "comments": [
        {
          "body": "That is amazing! Congratulations! I'm over here excited about getting my first dev job and I'm 24! I graduated with my bachelor's in CS in 2018 and have been doing IT Support since 2017. This summer I started doing some Web Development in my spare time and applied to a job (full-time) in September. I got the job offer last month! I'll be starting soon and my starting pay will be about $30/hr. Sorry for the long post, I'm happy for you but wanted to share my story too!",
          "score": 84
        },
        {
          "body": "My path was two years CC for an AS, two years at university for a BS, and wrapping up grad school for MS in Data Science. \n\nI’ve worked full time as a developer/engineer since 2016\n\nEdit: my first day of college I was 33",
          "score": 26
        },
        {
          "body": "1. I highly, highly, highly recommend starting at a community college over a 4 year university.  \n\n2. Congratulations it sounds like you’ve worked hard and are starting to reap the rewards.",
          "score": 49
        },
        {
          "body": "[deleted]",
          "score": 9
        },
        {
          "body": "Similar to my story, from $10/hr to $115k base + bonus (effectively over $125k total comp) in an LCOL  within a few years of leaving community college and continuously upgrading my education.",
          "score": 9
        }
      ]
    },
    {
      "title": "Do I still have a shot? Tesla Intern",
      "body": "Had an Interview with Tesla last Friday. Two rounds. \n\n1. First round Technical (45 mins): Medium Graph problem. Told the interviewer that I never solved a Graph problem before but I still managed to come close to a working solution through good communication, writing out my algorithm, thinking of edge cases. (Still not a working solution though)\n\n2. Second Round System Design with Hiring Manager (45 mins): I think I did well however towards the end of the design interview I made a really dumb small mistake. The recruiter basically gave me a hint which I completely ignored and started rambling about other stuff until he reminded me and I circled back.\n\nIn terms of strengths I will mention that it was a pretty niche role but I have a lot of experience in it at multiple FAANG-tier companies. However, none of the interviewers seemed interested in my resume at all tbh\n\nIf anyone has any insight at all into Tesla’s hiring criteria I would really appreciate it.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1na4a87/do_i_still_have_a_shot_tesla_intern/",
      "comments": [
        {
          "body": "&gt; The recruiter basically gave me a hint which I completely ignored and started rambling about other stuff until he reminded me and I circled back.\n\nFor an intern this would be a fairly big red flag to me if I'm giving active guidance that is entirely ignored.  TBH would probably be an immediate strong no-hire from me.  I expect mistakes and non-perfect design from interns but I also expect them to receive advice and feedback and correct themselves.",
          "score": 7
        },
        {
          "body": "If it were a couple years ago, I would say you would have a good shot. As of now, the current labor market landscape pretty much expects perfection. You never know though. I thought I didn’t do so well in my interviews, but managed to get the offer anyway. However, this was years ago and I understand that it’s very different from today’s labor market. Good luck and keep grinding. With your work experience you will land something decent.",
          "score": 4
        },
        {
          "body": "Personally I think team-dependent interview processes like Tesla or Apple aren’t really something you can ask on Reddit for information. \n\nUnless you name the team (not saying you should), I’ve found it to be very interviewer/team dependent because they don’t have a centralized process. I’ve passed rounds in team-dependent hiring big tech  where I legitimately would rate myself (fairly) a 2/10 in the technical aspect because the interviewer liked me. Or maybe they didn’t have a lot of viable candidates in the pipeline that did better. \n\nIf it’s centralized hiring like Google or Meta than yeah, there’s not much wiggle room.",
          "score": 2
        },
        {
          "body": "can you dm you resume?",
          "score": 1
        }
      ]
    },
    {
      "title": "Tesla Data Annotation Assessment",
      "body": "I know the job of Data Annotation isn’t ideal for some but in the interview it’s says there’s a 40 minute “sorting game” assessment. Any idea what that could possibly entail?\n\nEdit: grammar",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/15szag3/tesla_data_annotation_assessment/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Sr Technical Program Manager - Balance of Plant (electrical - energy business)",
      "body": "Hello, \n\nI am senior electrical engineer (substations) and have upcoming interview for TPM role at Tesla energy side of things - Balance of plant, charging infra. \n\nI need help can you please tell me : \n\nWhat are TPM’s day to responsibility’s ? \n\nWhat makes them stand out? \n\nWhat are some common problems issues they face? \n\nAlso any information that will help prepare better ? ",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1q6xdtu/sr_technical_program_manager_balance_of_plant/",
      "comments": [
        {
          "body": "&gt; Also any information that will help prepare better ?\n\nIf this is the sub you picked to ask this question, then, good luck with your interview.\n\nI'd start with getting the forum to ask these kinds of questions correct.  What made you think /r/cscareerquestions was right?",
          "score": 2
        }
      ]
    },
    {
      "title": "How are software jobs at car companies (Tesla, Rivian, Lucid)?",
      "body": "I'm a huge gearhead and if you asked me at age 15 what my dream job was I'd say designing cars. 11 years later I'm a Java/JavaScript Dev in Phoenix. I'm ok with my current job, but software development seems more relevant to car companies than ever. \n\nI've started a car website on the side, but I'm not done implementing it and it is more about how/when to buy certain cars than anything. \n\nAnyone work for any cool automotive companies? How is the interview process? Any major pros or cons?",
      "subreddit": "cscareerquestions",
      "score": 248,
      "url": "https://reddit.com/r/cscareerquestions/comments/av8wv8/how_are_software_jobs_at_car_companies_tesla/",
      "comments": [
        {
          "body": "Having Tesla on your resume probably will open many doors to future job opportunities. That just seems to be the nature of having a “celebrity” company name on your resume.",
          "score": 204
        },
        {
          "body": "Cruise Automation is a cool car company in my opinion. And is far more software intensive and modern than any traditional car company. Interview process was pretty standard for Seattle/Bay area. ",
          "score": 28
        },
        {
          "body": "[deleted]",
          "score": 137
        },
        {
          "body": "The usual companies (Ford, GM, Toyota, BMW, VWAG...) still have options, whether it means developing infotainment systems, digital gauges (look for Racelogic in that department) or building microsystems for ABS, diffs, monitorization... Those last are critical systems and code is strictier than usual!",
          "score": 36
        }
      ]
    },
    {
      "title": "Big N Discussion - April 14, 2019",
      "body": "Please use this thread to have discussions about the Big N and questions related to the Big N, such as which one offers the best doggy benefits, or how many companies are in the Big N *really*? Posts focusing solely on Big N created outside of this thread will probably be removed.\n\nThere is a top-level comment for each generally recognized Big N company; please post under the appropriate one. There's also an \"Other\" option for flexibility's sake, if you want to discuss a company here that you feel is sufficiently Big N-like (e.g. Uber, Airbnb, Dropbox, etc.).\n\nAbide by the rules, don't be a jerk.\n\nThis thread is posted each **Sunday and Wednesday at midnight PST**. Previous Big N Discussion threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Big+4+Discussion&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 13,
      "url": "https://reddit.com/r/cscareerquestions/comments/bd0adi/big_n_discussion_april_14_2019/",
      "comments": [
        {
          "body": "Company - **Microsoft**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 8
        },
        {
          "body": "Company - **Amazon**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 3
        }
      ]
    },
    {
      "title": "Has anyone ever gotten caught interviewing?",
      "body": "Wonder if any of you guys have ever been in a situation where your manager/co-workers/employer have gotten suspicious of you interviewing with another company? \n\nWhat happened and were you confronted?",
      "subreddit": "cscareerquestions",
      "score": 113,
      "url": "https://reddit.com/r/cscareerquestions/comments/6u8cp5/has_anyone_ever_gotten_caught_interviewing/",
      "comments": [
        {
          "body": "Opposite, actually. I \"caught\" one of the people who reported to me interviewing for other positions. He disappeared during the day a lot and just gave super vague responses about where he was.\n\nI sort of jokingly confronted him about it one day, at which point he said \"fuck it, you're a cool guy, here's the deal:\" and it opened a dialog about the issues he was having. Ultimately they were irreconcilable, as one major problem was he moved to another city and worked remote, but wasn't able to handle it.\n\nI offered to help him out and actually served as a reference for him, as it was truly the best thing for him, both personally and career-wise.",
          "score": 132
        },
        {
          "body": "* I \"caught\" an intern at an interview event where we were both there as candidates. \n\n* One of my interviewers turned out to be an ex colleague and close friend of my current manager. Which was a **awkward** as he told my manager that I had accepted an offer with his company before I resigned (but after acceptance, but still..  discretion please). ",
          "score": 59
        },
        {
          "body": "I ran into my boss (well 2 levels higher but he knew me) on the plane on the way back from an interview.  I dove into a seat like I was ducking sniper fire.  Still not sure if he spotted me.\n\nIn a different occurrence, I also ran into a co-worker at the airport waiting for the same flight.  I had specifically booked a later flight to avoid him (I knew he was travelling as well), but just my luck he had delayed his flight too.  He didn't care though, we ended up chatting about interviews on the flight and he didn't leak it to others.\n\nI fucking hate the San Jose airport",
          "score": 103
        },
        {
          "body": "In my previous job the owner of the small company got suspicious because I had a lot of 1-2 hour personal leave requests. He asked me if I was interviewing and I told him no and that I was working on getting a mortgage. A month later I resigned. It's not that big a deal; just say no.  ",
          "score": 128
        },
        {
          "body": "Yes! When the employer I interviewed at called my current company for references.\n\nOne morning I came into work and my boss flat out asked: \"Are you looking for work elsewhere?\"",
          "score": 34
        }
      ]
    },
    {
      "title": "Lessons learned from a graduating senior with over 1000 applications and four internships",
      "body": "Hey all, I just wanted to preface this by saying that I've been reading this sub for almost four years now so I wanted to share my experience and lessons learned to give back to the community.\n\nIn this post, I'm going to go through each year of my college experience, and some advice for people in that phase.\n\nI want to start by saying that I think I'm a pretty normal student. I'm not insanely smart or anything, I go to a decent state school but it definitely isn't an MIT or Stanford. I have an ok-ish GPA. I'm a white male from a relatively privileged background, so I certainly don't get any diversity points.\n\nDuring my freshman year of college, I decided I wanted to apply to some internships, largely because of what I read on this sub. I saw the high salaries posted, and decided that that was something I wanted. So I threw together a pretty shitty resume and shot of \\~100 applications. Having no experience, and being a freshman, I got a handful of automated coding challenges, but nothing more than that. I wound up working a normal summer job at a car dealership instead.\n\n**Lessons learned as a freshman:**\n\n* Apply to a bunch of places just to get the experience of writing a resume, sending out applications, doing a few coding challenges, and (probably) getting rejected.\n* Find something else to do. Work a normal job, or become a TA, or do some research with a professor.\n* Do not stress not having an internship as a freshman.\n\n&amp;#x200B;\n\nSophomore year I was determined not to have to return to the car dealership, so I set out to apply to as many places as possible, and as early as possible. I wound up having a decent amount of luck, making it to the final round of interviews at Google, and Akuna Capital, but not getting offers from either. Eventually, I wound up getting an offer from a big bank and accepted it. I also became a TA so I could make some money and have another resume point. I'm not sure how significant this actually is, I don't think I ever had an interviewer ask about my TA experience.\n\n**Lessons learned as a sophomore:**\n\n* Start applying as soon as possible, and apply to as many places as possible.\n* Sophomore year is borderline for whether a lot of companies will consider you, so if you really want to land an internship, you need to do whatever you can to give yourself the best shot possible.\n* Side projects are huge. As a sophomore, you probably don't have much experience. If you can knock out a cool project, this could give you something to talk about during interviews.\n\n&amp;#x200B;\n\nThe summer before my junior year I began working on my biggest [side project](https://www.techinternship.io). It's evolved a lot since then, but at the time I was just trying to build a web scraper that would let me know when an internship application was posted at a company I was interested in. I wound up using this to apply to companies as soon as they opened their applications and had a pretty decent response rate. I interviewed at \\~15 different companies and got offers from a few of them. I took my spring semester off and wound up doing two off-season internships and then a summer internship.\n\n**Lessons learned as a junior:**\n\n* Apply as early as possible and to as many places as possible.\n* Make sure your resume is super polished at this point. ([Here's a link to a repository of latex templates](https://www.overleaf.com/gallery/tagged/cv)).\n* If you can graduate early, and wind up with multiple offers as a junior, take a semester off from classes to do an extra internship instead.\n\n&amp;#x200B;\n\nSenior year is where I'm currently at. I had a great experience at one of my internships and am fairly confident I will return their full time. I'm still working on side projects and taking some more difficult classes without the pressure of maintaining my GPA.\n\n**Lessons learned as a senior:**\n\n* If you haven't had an internship yet or don't have a full-time offer lined up don't stress it too much. Some of my sophomore/junior advice could definitely apply to finding a new grad job.\n* If you have an offer lined up, take those hard classes you've been putting off since you don't have to worry about maintaining your GPA for recruiting anymore.\n\n&amp;#x200B;\n\n**General advice:**\n\n* Don't optimize for prestige. Prestige alone cannot make you happy or successful.\n* Don't optimize for high pay. Optimize for the learning experience and a place you'll actually enjoy working. For me, the internship where I learned the most and was happiest, and will likely be returning to full time, paid peanuts compared to what my other internships paid. I almost didn't accept it because of this. I'm glad I did.\n* There is a lot of randomness involved, and things outside of your control, so don't take anything personally.\n* Work on a side project. This has been the most helpful thing for me. I have one significant [side project](https://www.techinternship.io) that came up during most of my interviews. I think this project played a big part in getting an offer from Tesla. The stack I used for the site was almost identical to the stack used by the team I was being interviewed for.\n   * If you're not sure what side project to work on, find a problem or repetitive task that you yourself have, and find a way to automate it.\n* Take advantage of all avenues when applying. I got interviews from online applications, messaging people on LinkedIn, career fairs, and the HackerNews who's hiring thread. Unless you have an incredible profile, it really is a numbers game.\n* Rejection is normal. I've had some really disappointing rejections after interviewing at Facebook, Google, D.E. Shaw, PDT, Akuna Capital, and many others. Don't let it get to you. Even if you do well, you may still be rejected.\n\n&amp;#x200B;\n\n**Resources that have been helpful for me:**\n\n[Pramp](https://www.pramp.com/) (for practicing live interviews)\n\n[Leetcode](https://www.leetcode.com/) (for practicing algorithms questions)\n\n[Techinternship.io](https://www.techinternship.io/) (for finding, submitting, and tracking applications)\n\n[Overleaf CV Database](https://www.overleaf.com/gallery/tagged/cv) (for making a nice Latex resume)\n\n[HackerNews Who's Hiring Threads](https://news.ycombinator.com/) (Monthly threads for finding less common roles)\n\n&amp;#x200B;\n\nThis is just my experience, so do with it what you will. I hope it helps somebody!",
      "subreddit": "cscareerquestions",
      "score": 164,
      "url": "https://reddit.com/r/cscareerquestions/comments/iqtfeq/lessons_learned_from_a_graduating_senior_with/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 95
        },
        {
          "body": "this is some great advice, thank you for writing this up! however, I definitely think you're selling yourself short a little bit if you think you're a \"pretty normal student\" who was getting final round interview from places like Akuna and FAANG as a sophomore :/",
          "score": 44
        },
        {
          "body": "[deleted]",
          "score": 8
        }
      ]
    },
    {
      "title": "200+ Flashcards for ML Engineer Prep",
      "body": "I made 200+ flashcards to review everything from my years of ML research, classes, and independent study. Creating them helped me get ML Engineer offers from several companies in 2022 (including Google, Tesla, Samsung, Motional, UiPath, and TikTok). Questions are loosely based off Chip Huyen's ML Interviews Book.\n\nIf this sounds useful, please check them out here!\n\n[https://github.com/b7leung/MLE-Flashcards](https://github.com/b7leung/MLE-Flashcards)",
      "subreddit": "cscareerquestions",
      "score": 138,
      "url": "https://reddit.com/r/cscareerquestions/comments/w6ffem/200_flashcards_for_ml_engineer_prep/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 13
        },
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "Oh wow thank you ! saving this",
          "score": 3
        },
        {
          "body": "This is cool! Would you have anki deck of this too? Adding spaced repetition to this should be helpful imo",
          "score": 3
        },
        {
          "body": "One more for team Anki",
          "score": 1
        }
      ]
    },
    {
      "title": "New Grad Job Search 2: Electric Boogaloo",
      "body": "**TL;DR It's a lot harder this year.**\n\nLast year, I wrote a post detailing my new grad job search. Well, both offers I had ended up being rescinded due to COVID, and I knew I was going to go through the recruiting gauntlet again. I ended up deferring graduation, got an internship on pretty short notice (thanks to blatant nepotism), and started recruiting again at the start of August.\n\nNow that this year's recruiting cycle is starting to slow down and I've signed somewhere, I wrote this partially to give some insight as to the sheer difficulty of recruiting this year (**really, it's not you, it's the economy**), but mostly to reflect on this year, and to gather some of my thoughts.\n\n\n\nhttps://i.imgur.com/4pFk8jX.png\n\n&amp;nbsp;\n\n**Statistics:**\n\n* Companies applied to: 155\n* Responses: 30\n* Hackerranks/Online Assessments/CodeSignal: 27\n* Total Phone Interviews (initial and post-OA): 9\n* Onsites: 6\n* Total Offers: 3 (1 return)\n* Withdrawn Applications: 2\n\n&amp;nbsp;\n\n**Summary/Takeaways From my Experience:**\n\n* This post is really for the neurotic, /r/cscareerquestions dwelling, tech-hub or bust, TC or GTFO kind of person. If these don't apply to you, then this probably won't be too relevant, and I applaud your superior social awareness and mental stability.\n\n* **Recruiting is extra hard this year.**  I had a higher GPA, more internships, more coursework, more skills\n(well, you get the point - a stronger resume), but last year I had a near 30% response rate where as this year I\nwent down to 19%, a big chunk of which were CodeSignal requests, of which I would deem to be \"low-quality\"\nresponses.\n\n* The companies I applied to were also very similar\nin profile to the ones I applied to last year.\n\n* **Leetcode is pretty essential.** Note that I pretty much exclusively applied to Bay Area positions though (due\nto personal reasons). I was asked LC style questions in every interview, many of which were medium/hard\ndifficulty.\n* **DP does not come up nearly as often as you'd probably think.** All of the other \"standard\" topics (strings,\nlinked list, heaps, trees, intervals, greedy, sort, etc.) came up with pretty uniform distribution.\n* **Passing or acing an OA does NOT guarantee an interview.** The extent to which this held true was probably unique to this year and maybe\nnext year. I had a CodeSignal of 838 and finished pretty much every OA with all test cases passing and plenty of\ntime to spare, but I converted these into an actual interview less than half of the time. Last year, acing an OA\nalmost certainly let me advance to at least a phone screen.\n* **Virtual career fairs are garbage.**\n* **Take this post with a grain of salt.** This is what worked/didn't work for me, and luck probably played a\nhuge part in a lot of my outcomes.\n\n&amp;nbsp;\n\n**For context:**\n\n* I am Statistics major at CMU.\n* My response rate was likely lower than that of a typical CS student at CMU.\n\n* I had 3 internships and a programming instructor job as past experience.\n* I had not interned at FAANG or at any similar \"tiered\" companies before. Although I dislike this concept of tiering, in this regard, my most notable experience was interning at a certain big bank, so nothing crazy. I apologize for not specifying exactly what my experience is, but I want to make it a little bit more difficult for someone to find out who I am, and the real message I'm trying to get across here is that I didn't have some insane experience.\n\n* My GPA is OK (3.5). It was enough to pass pretty much any cutoff, but I don't think it was anything\neye-popping.\n* I did not use referrals for any application.\n\n&amp;nbsp;\n\n**The actual job search/preparation**\n\nI felt that despite the fact that I was getting noticeably less responses than last year, I still had a decent\n\"hit\" rate. However, this year, the obstacles I faced last year were exacerbated by the fact that there was a dramatic reduction in the number of openings and every opening was getting thousands of applicants. Last year,\nthere were so many openings that I couldn't apply fast enough; this year, I could go days or even weeks without\nseeing a new job posted. In addition, I had multiple onsites that were cancelled because headcount filled up -\neven though I had applied the day the job was posted and went through the process as fast as possible. This\nreally made me put in perspective how few slots there\nwere in comparison to applicants this year.\n\nMy preparation involved skimming CTCI (for behavioral only), grinding a lot of Leetcode, and reading the [Competitive Programmer's Handbook](https://cses.fi/book/book.pdf) for more \"exotic\" topics like\ngraphs, dynamic programming, greedy algorithms, obscure data structures, etc.. I did 260 questions on Leetcode\n(with a split of 93/146/20)\nover the course of 4 months. I believe that this was overkill; I was basically able to solve any\ntechnical question thrown at me during an interview with little trouble. The online assessments, however, were a\ndifferent beast. I think this year they were abnormally difficult, as often I was being given insane assessments\nthat were essentially 2-3 Leetcode hards in 80 minutes. Prior to this year, I really only encountered this level\nof OA with trading firms, but I was getting this level maybe half the time. Preparing this heavily\nhelped me a lot for this particular stage.\n\nHonestly, I think [the Blind 75 List](https://www.teamblind.com/article/New-Year-Gift---Curated-List-of-Top-75-LeetCode-Questions-to-Save-Your-Time-OaM1orEU) is enough to handle most of your preparation. Of the online assessments that I've\ntaken, the only one I failed to complete was DoorDash's, and of the phone screens and onsites I did not pass,\nthe only technical question I failed to answer was a sorting question because I had a brain fart and forgot the\nsyntax for writing custom comparators in Python. I also failed a non-trivial amount of behaviorals; essentially\nevery phone\nscreen that did not progress to an onsite was not because I could not answer the technical question. This was a\nlittle strange to me, because I usually have little problem with this stage, but I'll chalk that up to my social\nskills deteroriating from not seeing anyone in the past year, and a generally much higher candidate bar.\n\n&amp;nbsp;\n\nI began applying at the start of August and sent 155 applications. I applied to almost exclusively the Bay Area\n(around 5% NYC, 2% Seattle, 90% SF/Bay Area, and 3% other). I had a return offer to the startup (based in NYC)\nthat I was interning at, so I did not really bother applying to anywhere outside of the Bay Area because I was\nmore than willing to take this return offer.\n\nThis might seem contrary to a lot of what I see on the subreddit, **but I did not tailor my application to each\nlisting.** In fact, I didn't even have a cover letter; I'd submit a blank document if one was required. In my\nexperience, cover letters mattered more to smaller firms outside of tech-hubs, but when it came to jobs where\nthere were 2k+ applicants, I opted to shotgun.\n\n&amp;nbsp;\n\nLast year, I was interviewing almost everyday, and had interviews scheduled months in advanced. This year, I\nrarely had interviews and had a very open schedule; I used to get emails requesting an interview pretty much\neveryday and it was honestly quite discouraging to see that I would get an interview request maybe once a week.\n\nOf the questions I was asked, I actually ran into a pretty even split when it comes to topics covered. Last\nyear, I had been asked mostly tree and interval questions, but now it was pretty evenly distributed. The more\ninteresting thing is that I was asked 0 system-design this year - but maybe that's because it's harder to do\nthese questions virtually. I'm not entirely sure; it could just be a coincidence.\n\n\n&amp;nbsp;\n\n\nMy first onsite that wasn't cancelled was with Tesla. I'd actually like to give a special shoutout to\nTesla for giving me the worst technical interview\nexperience I've ever had. My interviewer came in 8 minutes late (to a 45 minute interview), didn't show his\nwebcam (probably not that big of a deal, but I personally think this helps to build some kind of relationship\nbecause I was interviewing to join this person's team and he would be my coworker), didn't say anything to\nintroduce himself or what he did or even address the fact that he was late,\nimmediately pasted a question onto CoderPad and said solve the question, and sat there in absolute silence.\nThere was no collaboration, no conversation, and no feedback. When I finished the question, he said\nthanks, failed to answer any questions I had, and hung up. I think I heard him talk for 30 seconds. I left with\nthe impression that he had 0 intention to hire me in the first place, but the experience was so jarring that I didn't even feel bad after getting the rejection email.\n\nI ended up with 3 offers (1 return, 2 unicorns). I'm not entirely sure I want to give out the names of\nthese because the rest of this post is kind of personal, and I'm not sure I want to make it that easy to doxx\nmyself. I'm sure someone will figure out who I am and what they are, but I'll leave it with, they were 200k\noffers, which felt pretty good since that was way better than anything I got last year.\n\n&amp;nbsp;\n\n**Reflecting on this entire experience**\n\n[This is not really relevant to the actual search, but if you're interested it's here because I keep gettign caught by automod here](https://www.reddit.com/r/csMajors/comments/kfyure/new_grad_job_search_2_electric_boogaloo/)",
      "subreddit": "cscareerquestions",
      "score": 71,
      "url": "https://reddit.com/r/cscareerquestions/comments/kfz5vr/new_grad_job_search_2_electric_boogaloo/",
      "comments": [
        {
          "body": "really glad u had a tldr",
          "score": 22
        },
        {
          "body": "A 20% response rate? Yeah the struggles fuckin real.",
          "score": 20
        },
        {
          "body": "To be fair mate, you go to the best school for CS in the states. In all likelihood, and I don't mean to denigrate your accomplishments, just seeing CMU on your resume probably catches the recruiters eye more so than folks who attend a no-name university.",
          "score": 11
        },
        {
          "body": "&gt; I did not use referrals for any application. \n\nWhy not? I was at CMU 2016-2018 and that was one thing that stood out to me as a major strength of being on campus was just ... how easy it was to get referrals.",
          "score": 5
        },
        {
          "body": "Nice TC dude!!!! Honestly, that’s awesome! I’m working towards those type of offers now. \n\nWhat location are you going to? Bay, Seattle, remote?",
          "score": 4
        },
        {
          "body": "\"Virtual Career Fairs\" sound like a shitshow.\n\nColor me boomer but jesus I hope online events don't become the norm post COVID. Remind me too much of lectures, bore me out of my skull",
          "score": 5
        },
        {
          "body": "First off congrats! How long did your recruiting lag into the school year, i.e how much time during the academic fall semester did you have to spend on recruiting? \n\nI'm starting to think about what courses to take next year as a senior, and am worried that new grad recruiting goes way beyond just the end of summer and the beginning of the fall. Do you have any advice about that?",
          "score": 3
        }
      ]
    },
    {
      "title": "Tesla Software Engineer Process",
      "body": "I think this is where one would ask this, but I got my interview in 2 days. I was just wondering if anyone's gone through the cycle and just any general tips for when the interview starts since I know the interview is very team dependent and this is my first interview. It's 60 min and seems to be both technical and behavioral according to the sheet I was sent. Thanks!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1itfqro/tesla_software_engineer_process/",
      "comments": [
        {
          "body": "Slave shop, not worth it.",
          "score": 20
        },
        {
          "body": "Have some morals. You should work at an ethical company like Meta, Amazon, or Palantir.",
          "score": 8
        },
        {
          "body": "Why would anyone willingly work for Elon?",
          "score": 19
        },
        {
          "body": "the technical is what it is, the behavioral is probably questions about who you voted for and stuff like \"if you see your boss intentionally step on a kitten, do you gasp and report it or do you high five the sadistic bastard?\"\n\nother fun topics to understand tesla's culture involve googling \"spacex sex abuse\" and also \"tesla sex abuse or harassment\" this will help you understand the style of coworkers you will be networking with and having them mentor you on the best entrapment, sorry i mean, best team building techniques.",
          "score": 4
        },
        {
          "body": "For everyone commenting: im well aware of the company Tesla is, but Im not in a position where I can joyfully pick and choose. Im mostly hoping that being able to intern here will open more doors for myself in FT recruiting.",
          "score": 4
        },
        {
          "body": "Don't work for that criminal elon",
          "score": 3
        },
        {
          "body": "i just knew this thread would be full of unhelpful \"answers\" complaining about Musk",
          "score": -4
        }
      ]
    },
    {
      "title": "Daily Chat Thread - April 23, 2025",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1k5sx7q/daily_chat_thread_april_23_2025/",
      "comments": [
        {
          "body": "Where do you guys usually look for jobs?\n\nWhat about reaching out to hiring managers (after applying)?  \n\n  \nI have 5 years of professional experience but im not getting any interest. I feel like indeed is just a bottomless pit where anyone and everyone sends an application. I want to change my approach",
          "score": 2
        },
        {
          "body": "I have 2 technical interviews coming up. I don't feel very confident / prepared for them. Can I just ask to drop out of the hiring process? Think it'll take me atleast 3 months to ramp up. I cant even binary search in my head.",
          "score": 1
        },
        {
          "body": "I'm a student graduating in 1 more year with Tesla summer internship. Is it worth it to take a SpaceX Fall internship and delay my graduation vs potential return offer?",
          "score": 1
        }
      ]
    },
    {
      "title": "What is the catch for CS Careers?",
      "body": "I always wondered. Every career has \"catch\" which is a drawback that repels people away from it. Teaching has low pay. Law is stressful, has long hours, no guarantees for job prospects unless you get into a good school. Medicine requires college, med school + residency and massive amounts of debt. However, each career has its pros which are the aspects that draw people into the career.\n\nI've always wondered what is the catch in software engineering and why isn't everyone and their grandma going into it? It just seems superior to all other professions right now when you factor in demand, work life balance, high pay, availability for remote work, stress, years of schooling, you can work in any city you want, doesn't require too much debt, you can wear whatever you want, opportunity to make \"big money\" for the ambitious, etc.\n\nI hate to admit this and I'm sure it is very disrespectful but every time I see ANY other career except software engineering, there is always some major unavoidable inconvenience (usually more than two) to which I think the solution is \"learn to code, get into software engineering and you won't deal with this BS\".\n\nA lot of people say things like \"Software Engineering isn't easy! Not everyone can be a software engineer!\" to which I always think \"Life as a Software Engineer is a comparatively very easy life in America.\" There are aspects of software engineering that suck but jobs for the most part inherently suck and software engineering sucks the least. It doesn't even require too much math or even good grades. My suspicion is that there's a large disconnect between how non-technical people perceive software engineering and how it actually is and if people somehow experienced life as a software engineer for say a month, they would get spoiled as employees and leave their industries.\n\n&amp;#x200B;\n\nWhat are your opinions?",
      "subreddit": "cscareerquestions",
      "score": 17,
      "url": "https://reddit.com/r/cscareerquestions/comments/b01x37/what_is_the_catch_for_cs_careers/",
      "comments": [
        {
          "body": "CS is a career of constant, frustrating problem solving.  Many people can't handle that.\n\nSure several other careers are oriented around problem solving but not on the constantly, hourly basis that you do in CS.",
          "score": 87
        },
        {
          "body": "Most people don't want to major in anything related to it.",
          "score": 43
        },
        {
          "body": "2am deployments. Long hours. Strict deadlines. Managers who tell you how long something is going to take but don't have any programming experience. Business people who makes promises that developers can't cash so you end up working 80 hour work weeks.\n\nIt ain't all rosy.",
          "score": 31
        },
        {
          "body": "You need to be constantly learning, or your skills will become outdated and you'll find it hard to get another job. You can also fall into the trap of becoming an [expert beginner](https://daedtech.com/how-developers-stop-learning-rise-of-the-expert-beginner/), and as time passes, you'll be underqualified for positions you're supposed to be at (e.g. senior developer), but overqualified/too far in for more junior positions.\n\n&gt; why isn't everyone and their grandma going into it\n\nMany people are. See India (schoolchildren will say they aspire to be a software engineer), current CS enrollment rates, and bootcamps. Whether people are actually good at it is another thing altogether. I'm personally not worried because I think the majority will only manage CRUD/website shop-level work at most, and be stuck on a particular tech stack. Otherwise SV would have outsourced all of its software engineering work a long time ago, not that it didn't try.",
          "score": 17
        },
        {
          "body": "Interviews.",
          "score": 39
        },
        {
          "body": "there's a lot of uncertainty and miscommunication that happens (between developers and  non technical management, even developers and other developers).  When you need to be extremely precise and make no assumptions, this can cause a ton of headaches.\n\nIf you work somewhere that uses agile as 2 week deadlines, you can feel a lot of pressure/stress if you run into a problem that is tricky.\n\n&amp;#x200B;\n\n&amp;#x200B;",
          "score": 11
        },
        {
          "body": "&gt; work life balance, high pay, availability for remote work, stress, years of schooling\n\nthat's not always true.\n\n&gt;I've always wondered what is the catch in software engineering and why isn't everyone and their grandma going into it?\n\nSitting in front of a computer all day, trying to solve abstract problems isn't for everyone.\n\n&gt;It doesn't even require too much math or even good grades. \n\nSure, its not *required*. Going to a top 14 law school isn't required to get a good job, going to a decent medical school isn't required (you can go to Caribbean medical school!) to become a doctor.\n\nTrying to skirt requirements and expectations often puts the odds of succeeding against you.",
          "score": 16
        }
      ]
    },
    {
      "title": "Is it this hard to get a data science internship?",
      "body": "I feel like my resume is lacking when competing against thousands of Masters students. Does anyone have any resume advice for me? The only reason I got Tesla is because I applied for an obscure internship, however the interviewers told me they need someone that will clean data and do prediction and forecasting models for the team.\n\nhttps://imgur.com/a/7e9z4Ng",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/15knzjn/is_it_this_hard_to_get_a_data_science_internship/",
      "comments": [
        {
          "body": "A recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface .\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n&amp;#x200B;\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of r/reddit.com, who are the admins of the site: message [/u/reddit](https://www.reddit.com/u/reddit/): submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on [r/reddit](https://www.reddit.com/r/reddit/), such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at [r/ModCoord](https://www.reddit.com/r/ModCoord/) \\- but please don't pester mods you *don't* know by simply spamming their modmail.\n3. **Boycott** ***and*** **spread the word...to Reddit's competition!** Stay off Reddit as much as you can, instead, take to your favorite *non*\\-Reddit platform of choice and make some noise in support! \n\nhttps://discord.gg/cscareerhub\n\nhttps://programming.dev\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Huh? You’re a sophomore and you’ve already had 4 related internships at some big names? It seems like things are going great - what’s the concern?",
          "score": 5
        }
      ]
    },
    {
      "title": "Delaying graduation for Tesla",
      "body": "I had an interview with a team at Tesla located in Nevada and did decent. The way my degree is structured, there is a 4-month academic term, then a 4-month coop and it keeps switching back and forth for a total of 6 coops and 8 academic terms to graduate. I have already done 2 coops and 4 academic terms (ending sophomore year). The things is, the team at Tesla wants me to do a longer position with them, the only length of time I can do bigger than a 4 month term is a 16 month term to be able to re-enter my degree at the right place.\n\nI'm an international student studying in Canada so it also adds complexity to my immigration situation. I'd have to keep taking a couple of online electives throughout most of my internship to maintain my student-status (would cost around 10k CAD) so I can still be eligible for a post-graduation work permit in Canada.  \nMy university isn't very well known so this might be a very good opportunity to climb the ladder since all my coops after Tesla could be at better companies. It would broaden my horizons since I've never been to any other countries except home and Canada and I would also learn a lot while making an ok amount of money (don't know how much yet). At the same time it's a significant amount of time and delays my graduation by a year (my degree is already 4 yr 8 mo long normally) + I would have to figure out a bunch of immigration headaches and might have to pay 10k to maintain full-time student status.  \n\n\nWould you take this opportunity and why?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/muxnt1/delaying_graduation_for_tesla/",
      "comments": [
        {
          "body": "&gt; the only length of time I can do bigger than a 4 month term is a 16 month term \n\nYou'll be getting paid a good amount at a company you want to work for for the whole 12 months, right?\n\nThen I don't see the problem beyond a few grand here and there and some extra paperwork (there's a good chance that Tesla has a $5250 employee reimbursement for accredited classes, so your classes may be free - ask your recruiter).",
          "score": 5
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "What does the longer term mean for your visa?\n\nSounds like they want a long term cheap intern ~~demon~~ slave.",
          "score": 3
        },
        {
          "body": "Oh, hey you! Still the attention-thirsty, approval-seeking half of a decent humblebragging ~~human~~ being.",
          "score": 3
        },
        {
          "body": "Hey so what did you decide? Any update?",
          "score": 2
        }
      ]
    },
    {
      "title": "Tesla interview help-offer approval stage",
      "body": "Hello everyone! Could anyone working or has worked at Tesla, or any Tesla recruiters, kindly shed some light on the offer approval process at Tesla? I would sincerely appreciate any insights you could provide!\n\nI applied for a mechanical engineer position at the cell development team. A month ago, I had a virtual onsite interview at Tesla (on June 2nd). Within 3 days, HR informed me I passed it and they would like to begin the process of getting an offer approved for me. This included compiling a detailed write-up along with three pieces of my 'evidence of excellence. A few days ago, my prospective manager indicated that my write-up had reached the Director's desk, but they not sure how quickly can get a response.\n\nIt's been almost a month since my onsite interview, and I'm still concerned about whether this process will result in a written offer. Is this stage of the process at Tesla typically this lengthy? Do you think my case is normal? I mean, after multiple rounds of interviews, it's a bit surprising they are still\n\"considering the funding and justification to bring a new engineer onboard.\" I must confess, this process is causing me a lot of anxiety. Tesla is my most dream company, and it would be quite disheartening to face rejection after making it this far in the process.\n\nI appreciate any information or advice you might have regarding what to expect at this stage. Thank you so much in advance!!",
      "subreddit": "jobs",
      "score": 11,
      "url": "https://reddit.com/r/jobs/comments/14o7j4j/tesla_interview_helpoffer_approval_stage/",
      "comments": [
        {
          "body": "Hey guys, I got my final offer on 7/31/23 and started working for Tesla on 08/21. Thank you all for the help and reply! I wish you the best of luck there!",
          "score": 2
        },
        {
          "body": "Hola a todos, tengo una pregunta. Tengo un conosido que es manager y me recomendó en un puesto de tesla que tiempo creen que tarden en responder?",
          "score": 1
        },
        {
          "body": "I’ve had similar experiences (and so have colleagues) in onboarding at final stages with Google, Apple, and Tesla.\n\nIt is not unusual, and the general process takes 1-3 months pending project ebb and flow.",
          "score": 1
        },
        {
          "body": "I’ve had similar experience as well. 2 months and still no updates. The recruiter is trying to patch me up with other teams. But I haven’t been explicitly told that my first offer is canceled. Don’t understand what’s happening specifically!",
          "score": 1
        }
      ]
    },
    {
      "title": "Tesla interview question",
      "body": "\nI recently had a virtual interview at Tesla for a Service Assistant role on August 9th. Initially, I was informed that I'd be interviewed by two people, but it turned out to be just one interview. The day after, I received an email from the recruiter mentioning that the interview went well and the hiring manager was impressed. They indicated that they wanted to move me forward in the process and expected to provide an update by August 14th.\n\nHowever, the update didn't come on that day. I followed up with an email on August 15th, but I didn't receive a response until August 22nd. The email explained that they were waiting for approvals and additional information before making a decision. They had initially mentioned that I'd hear back by August 25th, but I haven't received any communication since.\n\nIn essence, I'm confused about what \"approvals\" mean in this context. Are they waiting for approval to proceed with my application or to potentially arrange another interview with a different person? This situation seems like a waste of time considering the uncertainty.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1619tm2/tesla_interview_question/",
      "comments": [
        {
          "body": "It's the summer, dude. Everyone in corporate who has decision-making power is away. Expect more action after Labor Day.\n\nThis is a big deal to you, but seasonal slowness impacts all.",
          "score": 2
        },
        {
          "body": "Hi, I have a interview too, may I know what kind of questions they asked and did you hired btw?",
          "score": 1
        }
      ]
    },
    {
      "title": "I have a phone interview with Tesla tomorrow.",
      "body": "Any advice? I don’t have much experience either so not much leverage. This is my first interview in a while since Covid hit.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/syzh8w/i_have_a_phone_interview_with_tesla_tomorrow/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "What position did you interview for, and how did it go?",
          "score": 1
        }
      ]
    },
    {
      "title": "Tesla PM panel interview+presentation next week",
      "body": "Could anyone please provide tips on what to expect in terms of questions for the panel interview+presentation consist of a total 3 hrs. The position is Technical Project Manager",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/pqrfvw/tesla_pm_panel_interviewpresentation_next_week/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Can you share how the interview went?",
          "score": 1
        }
      ]
    },
    {
      "title": "Made it to Tesla’s final round… lost it because one engineer didn’t vibe with my code. Did I dodge a bullet or take one?",
      "body": "So after weeks of grinding prep, multiple panel interviews, and hours of studying, I actually made it to the **executive review stage** at Tesla. Everyone else apparently gave me a “yes” — except for one senior data engineer who thought my coding wasn’t “good enough.” Because of that one vote, the whole thing got shut down.\n\nIt stings. I was one step away from an offer, and now I’m back at square one. I know it’s part of the game, but it’s hard not to feel like I failed after getting that far.\n\nDid I dodge a bullet here — working somewhere where one person can veto everyone else’s support — or is this just how the tech world works?\n\n  \nAlso, any advice on how to shake off this *almost-made-it* feeling? It’s been sitting heavy.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1o9gjxf/made_it_to_teslas_final_round_lost_it_because_one/",
      "comments": [
        {
          "body": "Dodged a bullet.  I wouldn’t want to work for a bipolar ketamine addict worth $500 billion who doesn’t give a damn about the welfare of his workers.",
          "score": 50
        },
        {
          "body": "It was *Tesla.* Definitely dodged a bullet.",
          "score": 15
        },
        {
          "body": "I’m not in tech, but I’ve heard from many of my friends who are, that people outside of HR (senior engineers, Department managers, Vp, directors) will do this when they have a friend that they want to get into the position. \n\nGate keeping positions is very common which is why in California we see a lot of companies continue to hire similar people (who already have a friend in the company)  because the process allows for gate keeping like this.",
          "score": 10
        },
        {
          "body": "Been there done that. I decided long ago that If 8 ppl want you and one doesn’t and the company won’t hire you, you dodged a bullet.",
          "score": 3
        },
        {
          "body": "Depends, how do you feel about nazis?",
          "score": 4
        },
        {
          "body": "I worked in tech for several years and have interviewed at spaceX, Amazon, blue origin, meta and others. This is extremely common, especially these days.  During COVID tech companies were competing to hire as many engineers as they could. Now they're laying people off and what jobs they are hiring for are extremely competitive. The reality is there are probably dozens of well qualified engineers they can choose from for that one position so they will reject people for extremely trivial reasons.  I'm actually surprised they gave you a reason, in my experience they never did. They are looking for unicorns, people with immaculate backgrounds and qualifications.",
          "score": 2
        },
        {
          "body": "Tesla over works you for the pay. I don’t think you missed out on much. In my opinion it’s only good for your resume, not much for learning/making a lot of money",
          "score": 2
        }
      ]
    },
    {
      "title": "Still Listed on Tesla Job Content on Indeed in The Netherlands.....",
      "body": "Quoted:\n\nTesla is an Equal Opportunity / Affirmative Action employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, national origin, disability, protected veteran status, gender identity or any other factor protected by applicable federal, state or local laws.  \n  \nTesla is also committed to working with and providing reasonable accommodations to individuals with disabilities. Please let your recruiter know if you need an accommodation at any point during the interview process.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1jj6pqw/still_listed_on_tesla_job_content_on_indeed_in/",
      "comments": []
    },
    {
      "title": "I have an interview for sales manager at Tesla.",
      "body": "Is this a good time to be working for them? Would you?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1jtvwyo/i_have_an_interview_for_sales_manager_at_tesla/",
      "comments": [
        {
          "body": "As long as you get a salary and you're not 100% commission 😂",
          "score": 2
        },
        {
          "body": "Why me? Would YOU?",
          "score": 1
        },
        {
          "body": "Land the job first. Then you can think about this.",
          "score": 0
        },
        {
          "body": "I would 100% - you can decide if you want to stay there longer-term later on, but it sounds like a good opportunity as the job market right now is pretty harsh.",
          "score": 0
        },
        {
          "body": "Still a large company not going anywhere.",
          "score": -1
        }
      ]
    },
    {
      "title": "Tesla interview Oct 2023 - take home test",
      "body": "",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/17uhgfi/tesla_interview_oct_2023_take_home_test/",
      "comments": []
    },
    {
      "title": "Virtual presentation interview at Tesla next week",
      "body": "I am Applying for an engineering position and I received the list of attendees for my interview and they are all engineers and not managers. It’s interesting that I walk into presumably the final stage of interview and do not see a manager there, to asses me. I’m sure engineers will give a greater qualitative assessment of skills, but in my prior experience they do not have power to hire someone. I wonder if there are others who have experienced the same thing.",
      "subreddit": "jobs",
      "score": 11,
      "url": "https://reddit.com/r/jobs/comments/lt6ybx/virtual_presentation_interview_at_tesla_next_week/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I have mine next week! Any tips for the presentation? My panel is comprised of all engineers or TPMs (I am applying for a TPM position).",
          "score": 2
        },
        {
          "body": "Just curious how did the OP go on his panel interview.\nI have one scheduled for next week. Looking for some tips or insights.",
          "score": 2
        },
        {
          "body": "As a manager and having run an organization and established hiring, on-boarding and cultural aspects of the firm, I can say there is advantage to getting perspective from coworkers during the hiring process. While we probably wouldn't lead with it, it wasn't uncommon to have a back-end developer interview with a field of developers and work through some practical situations, or have an account manager meet with fellow account managers to assess team dynamic.\n\nThat being said, do you know for certain that this would be the final interview and that you wouldn't meet with the hiring manager prior to receiving an offer?",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview/Presentation with Tesla",
      "body": "Hi guys so next week i have a presentation and interview with tesla for a internship spot at there design studio in california and i was just wondering what are somethings i should know and or tactics before doing so?0\n\n I am 19 currently a student so i am very new to this and looking for any inputs and or help as far as interviews. \n\nthank you ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/3jwggw/interviewpresentation_with_tesla/",
      "comments": [
        {
          "body": "know **everything** about Musk, know **everything** about the companies he runs, especially the car company",
          "score": 1
        }
      ]
    },
    {
      "title": "How Does one Effectively Negotiate an Offer?",
      "body": "I am expecting a verbal offer from Tesla for a TPM role. I have 6 YOE as a TPM (3 years regular, 3 years as senior at a large tech company), two masters, and a couple relevant certifications. I am expecting them to come with a senior level TPM offer but I want to push it to a staff level. How should I go about structuring my argument to maximize my chances of this.\n\n  \nBackground: Interviewed with director for a staff TPM role, and got redirected to a manager under him in need of a TPM. The position for the manager was a senior TPM. He called me and said the director spoke highly of me and was interested in me. I came to visit on site and I think I was very well received after my interviews and presentation. I presented a case of a program I started from scratch and delivered KPIs I developed. Manager was very impressed and highly interested in me and during our casual conversations after he would say stuff like \"oh, I'll give you advice on those when the time comes\" implying that I already worked for him. The role itself has a lot of responsibilities but also no structure. I am expected to step in, organize learnings on his team, and drive closure to various things. Additionally, look for cost savings data (they loved my MBA degree), find potential savings gaps, and drive cost savings projects and develop KPIs. There are additional things to do as well, but overall the role is very open and very much what you make of it, which has me quite nervous. However, it's this general lack of structure that makes this role seem like a higher scope than a senior TPM, it is more of a staff TPM role where I need to take initiative, develop metrics, form connections, and create a win-win environment for everyone.\n\n  \nSide note: My friend from the same company also received a senior TPM offer from Tesla last year and managed to negotiate it to a staff level, so it is certainly possible.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1oa0xff/how_does_one_effectively_negotiate_an_offer/",
      "comments": []
    },
    {
      "title": "Tesla executive approval timeline for new hires",
      "body": "I have been interviewing at Tesla for the last 1.5 months and recently submitted my evidence of excellence to the HR on May 12th .  how long does it usually take to get the approval?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1kmfiol/tesla_executive_approval_timeline_for_new_hires/",
      "comments": []
    },
    {
      "title": "Tired, exhausted and disheartened  - 400+ Applications and not a single interview call.",
      "body": "Hey everyone, international student in the US for a MS in Mechanical Engineering, gonna graduate soon. I have decent projects and have been a TA for a course as well. As the title says, I have applied to more than 400 jobs, in companies both big and small - startups to Tesla, you name it. But not a single call for a 2nd round, or interview. I am at my breaking point, I am tired, tensed, anxious, exhausted and lastly but not the least- desperate. Idk what I am doing wrong, many of my batchmates from India have gotten calls for interviews, some even have internships. Idk what to do.",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/1c0zkkf/tired_exhausted_and_disheartened_400_applications/",
      "comments": [
        {
          "body": "Apply to your country instead of jobs in us. US companies have only so many visas allowed (they have to show special reasons as to why they have to hire you over all the other me degreed us citizens that apply for the same job-pretty much you’ll never get hired as the us has too many mes in contrast to job availability) and us government also makes it cost prohibitive to hire non us citizens over us citizens. You’re in a major that many us citizens have and need those jobs. I know it sucks but at least you got a us education.",
          "score": 2
        },
        {
          "body": "Youre going to have to apply in your native home country for gain experience before you are considered in the US\n\nYou are not competing against other recent grads; you are competing against other well qualified and experienced US citizens who are also struggling to find a job at the moment\n\nObviously keep applying in the US in the off-chance you get a reply, but youre going to have to apply in your home country to secure a job first.",
          "score": 1
        }
      ]
    },
    {
      "title": "School psychologist and underwriter looking for work",
      "body": "I am a finance expert with 7 years of experience. My girlfriend (27) has a bachelors in psych with 5 years of relevant experience in schools. I was denied a entry level job at Tesla the same day I interview (via email) would have been ja massive pay cut but good benefits. Today, my girl was denied(via email) a instructional aid position. LESS THAN A HOUR after interviewing. Her in person interview ended at 3:36pm and she was send a denial email at 4:30. \n\nWhat is going on? is anyone hiring? this was my 5th interview at Tesla. Are these job postings fake? we have wasted entire weeks going to interviews. next week my gf has 2 interviews before her class but she's debating not going because how swift this school district was to deny her. Any tips would be helpful",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1fkbuba/school_psychologist_and_underwriter_looking_for/",
      "comments": [
        {
          "body": "Job applications can be frustrating. Getting a quick no after an interview stings, especially after putting in so much effort. FYI, places like Tesla get tons of applications and often use automated systems, which can lead to fast rejections. \n\nEncourage your girlfriend to attend those upcoming interviews. They can be helpful for gaining experience and keeping momentum. You never know—the next one might be the perfect match. Remember, it’s often about the vibe and timing, not just the credentials. Feel free to share any feedback; it could spark some good chats and help refine your approach!",
          "score": 1
        }
      ]
    },
    {
      "title": "From $65K to $177K in 6 Years",
      "body": "Hey Fam,\n\nI wanted to share my journey over the last few years – how I went from being an overworked electrical engineer to landing jobs at some of the biggest companies (Tesla, Oil &amp; Gas, #1 Data Center company in the world). Hopefully, this inspires some of you and gives you a few tips on navigating the job market during this horrible time. \n\n**Year 1-3: Grind**  \nI started my career as an electrical engineer making $65K base with an extra $20K in overtime pay. I was putting in 60-hour weeks. I *loved* the work but *hated* the balance. I knew this wasn’t sustainable for me in the long run.\n\n**Year 3-5**  \nI began networking like crazy and made some great connections at an EV charging startup. I had zero experience in that specific area, but they took a chance on me, and I took a chance on them. My starting salary was $75K, not much of an increase, but the potential was there. After six months of hustling and showing my impact, I negotiated my salary up to $110K!\n\n**Year 5-6:**   \nReferred some friends to the company, and we were doing great... until we got bought out. Everyone was laid off except me and seven others. I saw the writing on the wall and decided it was time for a change. \n\nI spent hours tweaking my resume, networking, tracking and practicing my interview skills. Landed an interview with Tesla got the job at after 8 rounds of interviews. Offer was $145K plus stock options and great benefits. \n\n**Year: 6+ (2024+)**  \nOnly lasted one year at when they had layoffs, and I was back on the market. I targeted a new and exciting industry to me that I had no experience in. I submitted 78 applications had 5 interviews and two offers that took about 3 months of hard work. I ended up accepting an offer at the biggest fish in the sector, focusing on data centers. They offered me $165K and I negotiated that up to $177K, no stock, not the best benefits. \n\n**My Key Takeaways:**\n\n1. **Network Like Crazy** – Your network is your net worth. Make genuine connections.\n2. **Know Your Worth** – Always negotiate. If you don’t ask, you don’t get.\n3. **Keep Learning** – Every job has been a stepping stone to the next.\n4. **Adaptability is Everything** – Don’t be afraid to pivot.\n\nI’m sharing this because I want you all to know it’s possible. With hard work, dedication, and applying strategically, you can get where you want to be. I’m happy to help if anyone needs advice or tips. Drop a comment or DM me!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ezjxcs/from_65k_to_177k_in_6_years/",
      "comments": []
    },
    {
      "title": "Anxious About Interview Aftermath Due to Past Job Experience",
      "body": "Had a phone interview with SpaceX recently, felt it went pretty good. Thing is, I'm kinda stressing now because I used to work at Tesla about a year back. Left the place because the job wasn't really what I wanted for the long haul—I was aiming for something more in line with my past work experiences.\n\nI was the WH Lead back then, and even though the regional Supervisor was keen on keeping me around, my mind was already set. Plus, my direct WH Supervisor had quit before I even started the position, leaving me supervisor-less for almost my entire stint there (7 months), right up until my last week. Didn't have any beef with anyone, got along great with other departments. But I bailed when it felt like the place was starting to crumble—a concern I'd raised with upper management multiple times since most my staff were being fired.\n\nGave my two weeks, did the whole exit formalities, and peaced out. Now, I'm left wondering if they pinned any of the chaos that ensued post-me leaving on me, especially since the recruiter mentioned they'd be checking in with Tesla about my tenure.\n\nShould I be worried if I don't get any follow-up? Feels kinda unfair if this messes with my shot at SpaceX, especially since I feel as though I fit very well in this position I just applied for.\n\n&amp;#x200B;\n\nUpdate: They reached out for a second interview... :)",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1amd7c6/anxious_about_interview_aftermath_due_to_past_job/",
      "comments": [
        {
          "body": "Should have worked out a transfer. There's staff that work for both companies",
          "score": 1
        }
      ]
    },
    {
      "title": "Questions about Tesla Recruiting",
      "body": " I applied for a Spring 2024 internship @ Tesla. After about a month and a half I got an email saying they wanted to interview me. I did the interview (virtually), thought it went well. About 2 days later, I am told that I'm on the final round and I now need to get approved by higher-ups. Like 2 days later I get an offer. I'm confused because I read online that Tesla has multiple rounds of interviews (and they even fly people out) and I only had one. Has anyone else had this experience? ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/16tahfu/questions_about_tesla_recruiting/",
      "comments": [
        {
          "body": "I got a job offer from Tesla before. I went though 4 interviews for a coding position. This is back in 2020 and it was a full time position so I may be different from yours.",
          "score": 1
        },
        {
          "body": "I had my interview with the hiring manager on oct 5th and I still haven't gotten any reply yet. Do you think I should follow up or wait for a week more? Could you tell me how many days it took for them to reach back to you after the virtual interview? thanks!",
          "score": 1
        }
      ]
    },
    {
      "title": "Tesla CAE Structures and Durability Interview",
      "body": "UPDATE:\n\n11/11/2025 just completed my 2nd round of interview. The questions weren’t difficult per se, but definitely interesting questions.\n\nI feel like my experience is only an exception compared to what I have read online so far (I guess all those posts are a year ago and longer so things might be different now?) also this role only requires 3 rounds of interview and no take home written test. Is this common for Tesla now?\n\n————————————————-——————————\n\nHi guys,\n\nI have an upcoming 1st round of interview with Tesla for the CAE Structures and Durability role in the Fremont, CA location. I’d love to hear from someone who’s familiar with this role and can share some information. Anyone has some specific interview questions that they could potentially asked?\n\nSo far I have brushed up on the following:\n\n1. Difference between different numerical methods: FDM, FEM, and FVM.\n2. How newton raphson iterative method works.\n3. Overview of Shear locking, hour glassing and volume locking.\n4. Typical solid mechanics, stress-strain relationships.\n5. Composites material behaviors.\n\nWould questions on fatigue be asked since there’s \"durability\" in the title?\n\nBest regards\n\nP.S.: I wasn’t that nervous until I saw that everyone in that position has a PhD on LinkedIn 🥲.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1omyj8z/tesla_cae_structures_and_durability_interview/",
      "comments": [
        {
          "body": "Was your first round with a hiring manager? I actually have a scheduled first round interview for a CAE analyst occupation safety, crash role. How did yours go afterwards? Mine is in berlin btw!",
          "score": 1
        },
        {
          "body": "Hi OP, if you don't mind me asking, did you end up getting the role afterall? The position you interviewed for interests me as well, I was wondering if you would be able to elaborate a tad bit more on the questions they asked that were related to vibrations and fatigue? (in case I interview with them one day haha).\n\nNo worries if you don't feel comfortable giving out details!  Thanks.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "CAE engineer Interview with Tesla",
      "body": "Hello folks,\n\nDoes anyone ever had a interview with Tesla\nfor CAE engineer? I am\nHere to ask if who had interview before and can share some information? I was asked to bring a pen a paper during the interview for a few engineering fundamental questions. I would assume some questions about solid mechanic? mechanics of material? and some FEA questions. Anyone has some specific questions?  Thanks so much for helping.\n\nRegards \nLee",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1fcxyp7/cae_engineer_interview_with_tesla/",
      "comments": [
        {
          "body": "For a CAE engineer interview at Tesla, you can expect a mix of theoretical and practical questions. They'll likely focus on solid mechanics, mechanics of materials, and finite element analysis (FEA) as you've guessed. Be prepared to solve problems on the spot, explaining your thought process as you go. Some specific topics might include stress-strain relationships, beam theory, material properties, and FEA modeling techniques. They may also ask about your experience with specific CAE software packages and how you've applied them in previous projects.\n\nGiven Tesla's innovative approach, they might throw in some unconventional questions or scenarios to test your creative problem-solving skills. Be ready to think on your feet and apply your engineering knowledge to unique situations. It's a good idea to brush up on Tesla's current projects and technologies, as they may ask how you'd approach specific challenges they're facing. To feel more confident going in, you could try running through some practice questions with [interviews.chat](http://interviews.chat) It's a tool my team and I built to help people like you navigate tricky interview questions and hopefully ease some of the stress of the job search. Good luck with your interview!",
          "score": 1
        },
        {
          "body": "One of my friends interviewed before, They mostly asked about the Basics therody like what is FEm, and Fvm differences. concentrated on ug solid mechanics and All the best for your Interview.\n\nPlease share questions if possible.",
          "score": 1
        },
        {
          "body": "Hey! How did the interview go?",
          "score": 1
        },
        {
          "body": "Hey, how was your interview?",
          "score": 1
        }
      ]
    },
    {
      "title": "One job interview out of many unanswered applications ",
      "body": "Was told I did good in the first interview at tesla  and was slated to get a 2nd interview, but the 2nd individual didnt reach out to me before I was sent an email stating I've been passed in the interview process??\n\nAnybody else get strung along with no follow up ? Seems really weird they just say one thing and not Even follow up then receive an email like that.\nAlready demoralizing many applications don't seem to reach any live human",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ew0zsh/one_job_interview_out_of_many_unanswered/",
      "comments": [
        {
          "body": "Have you considered sending a follow-up email to the recruiter? It could show you're still interested and clarify what's going on. Keep throwing applications out there and reach out to folks in your network for tips. Staying persistent is key!",
          "score": 1
        }
      ]
    },
    {
      "title": "Parent being negative about me getting a job",
      "body": "I had an interview today that seemed to go okay, and while the interviewer seemed interested in me they did say they had other a few other interviews and I would hear back, which I figured anyways.\n\nWhen I told my father this, instead of being at least somewhat intrigued, he immediately began talking about how \"nothing in life is guaranteed\" and acting like I had been rejected because they didn't hire me right on the spot. He later began ranting about me being obsolete due to AI or that I should instead only be applying to Tesla or Amazon.\n\nI gotta admit this crushed my spirit a little. Has anyone else had this experience? It's awkward because I feel like he doesn't even want me to have a job, considering every time I bring up the idea he shoots it down. Don't parents usually want their kids to get a job anyways?\n",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1ctqgjq/parent_being_negative_about_me_getting_a_job/",
      "comments": [
        {
          "body": "My company will not allow us to hire on the spot and we are instructed to say we have other candidates whether we do or not.",
          "score": 4
        },
        {
          "body": "my parents are retired. they give me the typical boomer answer of not working hard enough. when I told them how many applications I put in, my father said called me a pathological lier. thanks for the support. when I have to put you in a home, know that it is because I am working so hard....",
          "score": 2
        },
        {
          "body": "Your parent is a fool. Take the first job you can get, especially young, as long as it's not a scam of some sort. Experience is king.",
          "score": 1
        }
      ]
    },
    {
      "title": "[US] Job Placement Agencies, are they scam?",
      "body": "I'm actively looking for jobs and so far got contacted by 3 different agencies and they are proposing they will place me in a job in 1-2 months. \n\nThey say I will be having interviews as short as 2 weeks after I pay some amount between $500-$1000. Somehow all of them are in contact with big companies like Tesla, P&amp;G, and Apple. \n\nAre they scams or worth giving a try? Do you guys have any experience with them?",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/15bie1d/us_job_placement_agencies_are_they_scam/",
      "comments": [
        {
          "body": "Absolute scams. You should not have to pay fees for a job.\n\nA friend of mine fell for a scam like this year ago. But it was like $100 , which she didn't have. She borrowed the money and all they did was hand her a book with job listing and none of them were valid.",
          "score": 4
        },
        {
          "body": "Scam, they would help you find a job, not steal your money.",
          "score": 1
        },
        {
          "body": "Easy for me to as I am employed,  but I wouldn't trust anyone that wants a fee. Employers should pay the fee.",
          "score": 1
        },
        {
          "body": "Have you seen this?:\n\n\n\nAround the 1:50 mark,\n\n\n\nhttps://m.youtube.com/watch?v=Kp_cTp0IFP4",
          "score": 1
        }
      ]
    },
    {
      "title": "I need help finding a career that I can study online and it’s high demand/good pay",
      "body": "I work 12 hr shifts with a commute of 1 hr and 20 min each going back and forth. I have my GED because I moved high schools so much and they lost my credits, so I got my GED. I have had assistant teaching jobs, helped clean hospitals, call center, food industry, at clothing shops, Amazon and I currently work at Tesla as a production associate but I’m interviewing for a quality tech job. I have a 2 yr old at home that my mom helps watch. I really wanted to go into nursing (labor and delivery) but I’ve heard horror stories about nursing and thought it probably wouldn’t be best with my schedule. I was really interested in a Ultrasound tech job but clinicals AND going to classes while working a full time job and taking care of my son seems impossible. Thought about HR but heard it’s hard to get into. Therapist seems great but requires a lot of schooling. Esthetician job actually sound really interesting but I know it can be a hit or miss. I want a job that’s going to pay well and is in high demand. I want something I can do online and work my own pace and not have to do clinicals on my off days. I’m stressed because nothing fits my schedule and I want to do better for myself and my family. I’m already exhausted and stressed. I’m not good with math at all but love reading, writing, history and I’m not bad at science. Any advice or recommendations on what path to choose?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/19477la/i_need_help_finding_a_career_that_i_can_study/",
      "comments": [
        {
          "body": "You should go on glassdoor or something similar and look for jobs with the highest starting pay, and then filter the list down from there based on what you think you'd be interested in and good at. This really isn't a question for reddit. You need to research this yourself.",
          "score": 2
        }
      ]
    },
    {
      "title": "Tesla TPM interview assessment",
      "body": "Need some guidance on the format of questions and difficulty level",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1j1dfhb/tesla_tpm_interview_assessment/",
      "comments": [
        {
          "body": "Tesla TPM interviews are known for being intense and fast-paced, reflecting their engineering-driven culture. Expect scenario-based questions focused on technical depth, end-to-end program execution, and how you navigate ambiguity. You may also face problem-solving assessments tied to real-world challenges. For solid prep, the TPM Interview Toolkit on [TPMAcademyAI.com](http://tpmacademyai.com/) offers frameworks that align well with Tesla’s expectations. Stay focused on clarity, ownership, and impact.",
          "score": 1
        },
        {
          "body": "how did the assessment go? what were some of the questions on it?",
          "score": 1
        },
        {
          "body": "true",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Second interview for Tesla Sales Advisor position. Any good questions to ask?",
      "body": "Title says it all. I do want to add that the recruiter from Tesla gave me her phone number to reach out to her with any questions I might have. I know I should come up with some for the general manager, but I do want to use my resources to their fullest. ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1io8sxn/second_interview_for_tesla_sales_advisor_position/",
      "comments": [
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Is there still any chance? （Tesla  intern interview）",
      "body": "I got interviewed with Tesla for Spring sde intern two weeks ago. And it’s now Christmas, still didn’t hear back from HR.\n\nI sent follow-up email and no reply for now.\n\nI have another classmate who interviewed a week ago, we have the same hr, and she received rejection letter last Sunday. \n\nI’m wondering if there’s still any chance for me😭😭",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1hlzu9a/is_there_still_any_chance_tesla_intern_interview/",
      "comments": [
        {
          "body": "We will cross the bridge when it comes! Enjoy your Christmas, spend time elsewhere, it should help you pass time!",
          "score": 1
        },
        {
          "body": "I’m sure you did your best, crossing fingers for you. Great if you get it, not your fault if you didn’t. Keep hustling!! Cheers",
          "score": 1
        },
        {
          "body": "No news is good news—stay hopeful! 🤞",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Controls Engineer interview at TESLA",
      "body": "I've an interview coming up at TESLA for powertrain team and have been asked to be ready with pen and paper. A little about myself - Have been working in the controls engg realm since 2.5 years now, have hands on exp in programming PLC, HMI and other 3rd party industrial devices such as robots.\n\n  \nWhat are the possible questions I can be asked here? Programming questions? ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1fhoc2a/controls_engineer_interview_at_tesla/",
      "comments": [
        {
          "body": "Since they specifically mentioned pen and paper, be ready for technical questions. Think back to your experience with PLCs, HMIs, and robots – they might throw some curveballs to see how you problem-solve on the spot. Brush up on your control systems fundamentals too, things like PID controllers and feedback loops. \n\nInterviews are tough, especially in a field as specific as yours. To feel more confident going in, you could try practicing with some mock technical questions – maybe even use them to get feedback on your thought process. That's actually something we focused on building at [interviews.chat](http://interviews.chat) – I'm part of the team, and we really wanted to make a tool that helps people like you navigate tricky interview questions and feel more prepared.",
          "score": 2
        },
        {
          "body": " For your Tesla interview with the Powertrain team, expect a mix of technical and problem-solving questions, given your background in controls engineering. You’ll likely be asked about control systems fundamentals, such as feedback loops, PID controllers, and how you've applied them in past projects. There could be programming questions where you might need to outline logic for PLCs, troubleshooting, or optimizing control systems.\n\n**If you're looking to practice your interviewing skills and get feedback on your answers, consider using TrueInterviewAI.** **You can enter your job title or description to get the most relevant questions, select the question and record your answer, and let the AI model analyze your responses. You'll receive a score, feedback, and targeted recommendations on different indicators to improve your performance. You’ll also receive recommendations on TrueInterviewAI’s unique 7 strategies to make your answers more authentic, relatable, and personable.**",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "When I did the interview with Tesla, I didn't get asked as many questions regarding programming. It was mostly centered around the process of taking a well-known plant (where the system identification phase and observer construction was already done), and being able to control the system, working with high hysteresis. \n\nA lot centered around linear and nonlinear control theories, but for the specific subteam I was interviewing under, they mainly prioritized the ability to take highly nonlinear systems and leveraging Hartman-Grobman theorem to construct a control system while working with heavy energy constraints.",
          "score": 1
        }
      ]
    },
    {
      "title": "Tesla Interview",
      "body": "Recently got through to my 2nd interview with Tesla, a technical supervising position. Has anyone gone through a similar interview recently? They asked for a technical presentation about a project or job in the past to describe, wasn’t really given much to go off of in terms of what they’re looking for with that. I  was also told this would be 3 hours long, any insight on what kinda questions they’re asking or what I definitely should avoid saying? I’d appreciate it ~\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1bld7o9/tesla_interview/",
      "comments": [
        {
          "body": "Bruv I had my first interview with them for an electrical engineer position a couple of days ago , and I made it to the second interview next week, feel like it will be more technical ? Can you give me some hints? What’s that second interview is about ? Also good luck for the rest of the process",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Tesla interview Codingame - Test Engineer",
      "body": " I'm interviewing for Tesla and I have to do a CodinGame assessment. I am applying for a test engineer position so I will be working on electrical, mechanical, and software tests. Does anyone have any experience with these online tests and what I should expect? I'm not sure how they are going to test the electrical and mechanical parts using CodinGame",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/13fnv38/tesla_interview_codingame_test_engineer/",
      "comments": [
        {
          "body": "Do share, what ended up happening?",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview with Tesla need help",
      "body": "Anyone had any Interviews with Tesla?\n\nHi all, I have an interview coming up for one of Tesla Design Engineering Internships.\nIt’s a Drive Inverter Mechanical Engineering Internship. \n\nThe interview could have technical questions based on **heat transfer, fluid mechanics, statics, dynamics, and structural mechanics and design.**\n\nCan anyone please let me know how to prepare for the technical part?\n\nThanks!",
      "subreddit": "interviews",
      "score": 8,
      "url": "https://reddit.com/r/interviews/comments/nuweud/interview_with_tesla_need_help/",
      "comments": [
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "Just bring up your unwavering love for Doge",
          "score": 1
        }
      ]
    },
    {
      "title": "Applied many roles, get interviews, but always rejected at the end",
      "body": "everyone,\n\nQuick question: Should I go back for a Master’s, take another Senior Technician role (even though I worry about getting stuck again), or keep holding out for Engineer roles even though the gap is getting bigger?\n\nI have a degree in Chemical Engineering and about 5 years of experience in the polymer and plastics industry outside the U.S.. When I moved here, I was really interested in the battery industry, so I started applying even for entry-level or technician roles just to get my foot in the door.\n\nI landed a Battery Technician (R&amp;D) role, but after a year I felt stuck — low pay, no growth, and no real path to become an Engineer. I decided to focus on Engineering roles. Over the past 8 months I:\n\nCustomized my resume and LinkedIn profile\n\nImproved my interview skills with free coaching and mentors\n\nLearned Python for Engineers, SQL, and earned certifications\n\nBuilt a stronger network on LinkedIn\n\n\nHere’s the problem:\n\nFor Engineer roles → most applications get rejected at the resume stage. A few times I got interviews, but once they asked about my last role and I said “Technician,” I never heard back.\n\nFor Technician roles → I get interviews, sometimes to the final panel, but then I’m told I’m “overqualified” or they went with “other candidates.”\n\n\nOne example: a Sr. Engineering Technician role (degree required, pay above $90k). I reached out to the hiring manager on LinkedIn — he said, “we need a technician, not an engineer.” Later, the recruiter put me through screening and interviews, and that same manager even told me, “don’t be disappointed if we’re late, your background is good.” A few weeks later, I still got the “unfortunately” email.\n\nEven at Tesla — I went through multiple stages, including a panel interview, and was even told “congratulations.” Later, I got the message that the role had already been filled.\n\nNow I’ve been unemployed for 8 months, and it’s tough. I do have a panel interview in the next 2 weeks for a Sr. R&amp;D Technician role in the battery industry (pay around $40–50/hr). It’s good money, but honestly I feel like giving up — every time I go through these long interviews, I lose money (since I drive Uber for income), I come back exhausted, and then I still end up with the same “unfortunately” email. Part of me is already thinking this will just be the same result.\n\nSo I’d love to hear from this community:\n\nCan I go to the next  panel in person interview ??? am so tired wasting time and got rejected after 3 to 4 hours panel \n\nIs it maybe a must going for Master’s degree the only best option?\n\nOr if I take another Senior Technician role, is there really a path to Engineer, or will I just stay stuck?\n\n\n\nI’m humble and open to any advice. Thank you for reading.\n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1o3nn1m/applied_many_roles_get_interviews_but_always/",
      "comments": []
    },
    {
      "title": "Engineering Technician, Testing, Optimus | Tesla Careers",
      "body": "Need help regarding the interview process or preparation",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1jdg4jr/engineering_technician_testing_optimus_tesla/",
      "comments": [
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "How should I respond when an interviewer asks about my previous employer?",
      "body": "I worked at Tesla for about 6 months, but left due to the toxic environment. I have absolutely no intentions of going back. Fast forward months later, I applied to Rivian, the EV Pickup Truck company for a similar role. I'm beginning the interview process with them next week starting with a scheduled phone call.\n\nI'm assuming they're going to ask about my experience at Tesla, why I was only there for 6 months, and if I've considered going back. I'm trying to brainstorm a good response but I'm struggling. I don't think saying 'toxic-environment' is very appropriate, given it could easily be interpreted the wrong way. Any suggestions would be greatly appreciated.",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1dlhck8/how_should_i_respond_when_an_interviewer_asks/",
      "comments": [
        {
          "body": "“I’m looking for a company that has values, a vision, and a mission that aligns with my own so that I can provide my best work with other equal-minded experts.”",
          "score": 10
        },
        {
          "body": "I would think about the things that were toxic and spin them. Were you micromanaged? Say something like “it just wasn’t the right fit for me. I really excel in roles where I have some autonomy in my work, it helps with my development and growth”.\n\nWhatever you do, don’t say anything negative about the company.\n\nI’ve gone as far as saying “I felt like I wasn’t able to give them my best self, which wasn’t fair to the company or to me, so I thought it best that we part ways”.",
          "score": 5
        },
        {
          "body": "Since Tesla has had a lot of layoffs, you can spin it off to say you knew it was coming and wanted to work at a more stable company. Although that does not describe rivian either!",
          "score": 5
        },
        {
          "body": "Role play with someone.  Start off by giving an answer that is just what you feel.  No sugar coating.  No smoothing.  Not politically correct.  Then work the answer(s) from there.  Record it.  Don’t memorize it, but internalize it.  When you are asked a similar question you will come across well.  My wife is a “corporate crisis communicator”….this is how we practiced for my interviews.",
          "score": 3
        },
        {
          "body": "I feel that I have a better chance of having my contributions rewarded  in a new start up... And I feel that I may help Rivian possibly avoid costly missteps that I bore witness  to  at my previous  employer... It is okay to say that there was very little  humanity evident  in the culture there.",
          "score": 2
        },
        {
          "body": "You can just be vague and say you’re looking for a new adventure.",
          "score": 2
        },
        {
          "body": "I am going to assume that the new firm knows about Tesla. Explain to the interviewer why you think this firm will be better - reviews, common talk, quality, work culture",
          "score": 1
        },
        {
          "body": "Say you signed an NDA",
          "score": 1
        },
        {
          "body": "\"Have you read much about the work environment at Tesla?  It's all true!\"",
          "score": 1
        },
        {
          "body": "Tell them you were part of layoffs. It's very believable since Elon is crazy.",
          "score": 0
        }
      ]
    },
    {
      "title": "I completed 2 super technical interviews for a Tesla Internship &amp; they asked me for a 3rd",
      "body": "I was told by the Tesla recruiter that there would only be 2 interviews and I think both of them went really well, but I was asked to do a 3rd interview with the hiring managar's boss. Is this a sign that I didn't do as good as I would have hoped for thr interviews?",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1dyjcrc/i_completed_2_super_technical_interviews_for_a/",
      "comments": [
        {
          "body": "I had 5 interviews and a 4 hour take home piece of work for Tesla.\n\n\nWish I didn't do it but I had come that far...\n\n\nI didn't get the job.\n\n\nFind out their process now upfront.\n\n\nGood luck.",
          "score": 5
        },
        {
          "body": "What exactly is technical they ask you?",
          "score": 2
        },
        {
          "body": "A third one typically means that you are in. And maybe a job offer. Why would they bother with a third interview if they didnt have in mind to hire you",
          "score": 1
        },
        {
          "body": "no you're still good. In my case, i went through 4 rounds of technical interview, then my final one of hiring manager, and was told he'll reach out to recruiter for next step, but its been a month already and nothing... You are still in the run, however is not guaranteed until you receive an offer.",
          "score": 1
        },
        {
          "body": "Bwahahahaha",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "tesla technical interview prep help??",
      "body": "if i'm doing a technical interview for an electrical test engineering internship at tesla, what should i be preparing? it's my first time ever doing a technical interview, and i'd really appreciate any tips to prepare (if not now then for the future)!! thanks :) ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/16ovn80/tesla_technical_interview_prep_help/",
      "comments": [
        {
          "body": "try [www.easymock.pro](http://www.easymock.pro) if you want peer-to-peer mock. they are free",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "I don’t work at Tesla, so I don’t know what’s involved in that role but here’s what I would prepare for:\n\n- Reading schematics\n- Basic electronics principles\n- Familiarity with basic electrical test equipment (DMM, Oscope, PSU, eLoad, sig gen, etc. Maybe even Spec An, power meter and VNA if the role has any RF) \n- Familiarity with communication protocols and how to debug them. RS232, 422, 485, CAN, Ethernet, USB, etc. \n- Familiarity with harnessing\n- Software tools. Linux, Python, maybe Labview if they use it?\n\n\nI interview people for a similar role and I give interviewees a mock situations where everything gets plugged in but it’s not working. And they have to work through it to narrow down the problem.",
          "score": 1
        },
        {
          "body": "What technical skills did you mention on your resume?",
          "score": 1
        }
      ]
    },
    {
      "title": "Tesla Interview Advice!!",
      "body": "Hi all\n\nI have an interview with Tesla for Cell Manufacturing Process Engineer. I have my technical interview soon and the next step would be a Panel interview and Presentation. If I get any advice on what type of questions they would ask or how the interview is like will be very helpful!\n\nThank you very much",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/qtk0uj/tesla_interview_advice/",
      "comments": [
        {
          "body": "In my interview the recruiter asked me: can you tell me something about Tesla that I don't know.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        },
        {
          "body": "You can check out websites such as Glassdoor for potential interview questions",
          "score": 1
        },
        {
          "body": "How was it?",
          "score": 1
        },
        {
          "body": "How was it?",
          "score": 1
        }
      ]
    },
    {
      "title": "Tesla engineer interview",
      "body": "Has anyone had a phone interview recently with Tesla? Are they mostly behavioral or both technical as well?",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/i8s3r2/tesla_engineer_interview/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 2
        },
        {
          "body": "I would second that, is anybody has any info.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "I love long interviews, but never have time to watch them. So I built a tool that watches them for me.",
      "body": "Lately I’ve been overwhelmed by the amount of great interviews and podcasts coming out — Lex Fridman, Diary of a CEO, Acquired, etc.\n\nI love this kind of content, but honestly… I just don’t have time to watch everything. Often I’m interested in just one *topic* or *takeaway*, not the full hour.\n\n[Summantica intarface](https://preview.redd.it/u0d3cinqw3uf1.png?width=2880&amp;format=png&amp;auto=webp&amp;s=df6a2772dcbdc1b6abdece58bcbd1a995853a578)\n\n  \nSo I started doing this little workflow for myself:  \n– I upload a video (or drop a YouTube link) into our internal chatbot.  \n– It gives me a **transcription with speaker separation (diarization)**.  \n– I then drop that transcript into ChatGPT, ask it to **summarize the main ideas**, and then start asking **specific questions** about certain parts.\n\nIt’s like having a friend who already watched the interview and can quickly explain the key points, or even discuss them with me.\n\nThis saved me *a ton* of time, so I decided to make it simpler — a small tool where you just paste a link or upload a file, and instantly get a summary + a chat to ask questions about it.\n\nIt’s called [**Summatica**](https://www.summatica.app) (free for now).\n\nCurious if anyone else here feels the same — drowning in good interviews but can’t keep up? Would love feedback or feature ideas from fellow interview nerds.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1o29lgh/i_love_long_interviews_but_never_have_time_to/",
      "comments": []
    },
    {
      "title": "Camera Image Quality Engineer at Tesla",
      "body": "Did anyone interview for this role? Any tips? What materials to study? Will there be coding? The recruiter and hiring manager are not sharing any of these information.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1gwmmr9/camera_image_quality_engineer_at_tesla/",
      "comments": [
        {
          "body": "You should expect questions related to image processing, computer vision, and camera sensor technology. There's a good chance you'll need to demonstrate your knowledge of image quality metrics, color science, and signal processing. As for coding, it's likely there will be some technical questions or even a coding exercise, possibly in Python or C++, given the nature of the role.\n\nTo prepare, brush up on your image processing algorithms, camera calibration techniques, and image quality assessment methods. Familiarize yourself with Tesla's camera systems and their applications in autonomous driving. Be ready to discuss your experience with image quality optimization and any relevant projects you've worked on. If you're feeling unsure about specific topics, consider using a tool like this [interview practice AI](http://interviews.chat) to practice answering tricky technical questions. I'm on the team that created it, and it's designed to help you navigate complex interview scenarios like this one.",
          "score": 1
        },
        {
          "body": "you can try past interview questions on - [www.pastinterviews.com](http://www.pastinterviews.com)",
          "score": 1
        }
      ]
    },
    {
      "title": "Supervisor interview",
      "body": "Has anyone had a third interview at tesla and then asked to stay in touch with recruitment for a series of questions to be prepared and later discussed ?How did it go?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/18677ex/supervisor_interview/",
      "comments": []
    },
    {
      "title": "[Engineering Job Interview] What is wrong with me...? Help",
      "body": " \n\nHi,\n\nI am a mechanical (undergrad) / civil (masters) student.\n\nUndergrad \\[Columbia University with 3.78 GPA\\] Masters: Stanford  \nResearch: with few historical winning records in research poster sessions (expo) + other projects\n\n  \n Recently, I have received several interview opportunities from companies such as Tesla battery and other renewable energy companies. However, all of these interviews ended after the first round. When asked about my project experience listed on my resume, I provided the following response (which I have tried to replicate as closely as possible): \n\n\\-------------------------------------------------------------------------------------------\n\nIn fall 2021, as a semester Machine Design course project, I designed and constructed a complex robot arm linkage system to rapidly respond to button signals and press them for points allowing my team to earn the highest point at first attempt.\n\nTo begin with, as a 4th year senior mechanical engineering student, the machine design class provided budget and base materials and I was responsible for designing the kinematics, manufacturing the designed model and setting up the Arduino control system for actuation.\n\nI initiated the project by firstly clearly defining the objectives and the procedures.\n\nBuilding upon designs from my teammates, I leveraged the laws of physics behind button pressing to find more efficient ways to decrease weight and increase rapidity to develop kinematics design. Further, through my own thinking strategies, I was able to initiate a fuse-circuit design to enhance motor-current safety, which allowed us to earn the highest point in just one attempt.\n\nThroughout, I successfully managed to successfully collaborate with teammates and more specifically build upon individual ideas to generate more mechanically and costly efficient ideas to design the product throughout the project. Through my skills of collaboration and time management planning, I was able to successfully finish the project at the earliest out of all and was pleased end the course with solid A.\n\n \\[I bet I said with more grammatical mistakes than this draft but must be very similar\\]\n\n\\-------------------------------------------------------------------------------------------\n\n Additionally, I am an international student. Do I need to use advanced vocabulary or certain technical terms to elaborate on my experience? I am not sure what I am doing wrong. Could you please help me?",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1214aog/engineering_job_interview_what_is_wrong_with_me/",
      "comments": [
        {
          "body": "There is nothing wrong with you, it is quite normal to have trouble proceeding in applications. Actually, congratulations for getting some interviews. That shows you have a resume that works for what it is designed.\n\nNext, I would learn a little about interviewing. The small things like your grammar are uncontrollable. Don't worry about this, it will be so small importance if you learn to be confident and just talk. Talk in stories. This happened, this is what I learned and how it relates to the question. Do NOT talk too long, DO mention unique skills or programs you learned.\n\nEven when you learn to interview, you will still receive rejections. Learn. Good luck!",
          "score": 3
        }
      ]
    }
  ]
}