{
  "company": "tiktok",
  "post_count": 64,
  "exported_at": "2026-01-18T17:44:53.310Z",
  "posts": [
    {
      "title": "What advice would you give someone starting their job search?",
      "body": "I've been working as a web developer for several years now and I feel like the landscape for finding jobs has completely changed.\n\nIt's way harder to get your first job nowadays.\n\nFrom my experience interviewing and hiring the main advice I give people starting out is:\n\n* Build real projects you can show off. Make something useful that solves a problem.\n* Apply to jobs even if you don't feel 100% qualified.\n* Intern at smaller companies since they're more open to hire new devs\n\nWhat other tips would you add?",
      "subreddit": "cscareerquestions",
      "score": 17,
      "url": "https://reddit.com/r/cscareerquestions/comments/1hywf93/what_advice_would_you_give_someone_starting_their/",
      "comments": [
        {
          "body": "Prepare for behaviour questions properly. \n\n60% of the people that I interview fail to properly address the behaviour questions. Usually, people fail by providing weak evidence for the skills that the interviewer is looking to assert. Candidates describe generic solutions, without proper measured results, like “I did X, and it turned out great!” (We don’t know what great means).\n\nEdit: Also, answer the questions using well defined phrases. A phrase that is easy to follow and covers everything: the situation, the solution and its implementation steps, and most importantly the results. Most people just jump back and forward between details, and repeat themselves 10 times in the phrase.",
          "score": 10
        },
        {
          "body": "My two cents:\n- get experience asap working on production level code either thru internship, contribute to open source projects or smaller startup job for like 6 months\n- be willing to relocate for your first job\n- don’t stay too long at a starter job: 6 months to a year max to get your foot in the industry. \n- Leetcode daily. Read high level system design books. Have an interview plan for your dream job",
          "score": 6
        },
        {
          "body": "Do mock interviews. You will most likely fail your first couple interviews, don’t get discouraged :)",
          "score": 4
        },
        {
          "body": "Leetcode and system design. Use your connections for referrals. Brute force applications, take breaks from applying and interviewing after facing multiple rejections. Restart the cycle after a few week break. Worked multiple times in my career.",
          "score": 5
        },
        {
          "body": "Going off a recent post from someone talking about their job hunting issues.\n\nCast a *wide* net, be willing to relocate. There's areas with lots of jobs, but lots of devs. Areas with few jobs despite having good CS schools nearby, and areas that need devs but have few good CS schools nearby.",
          "score": 3
        },
        {
          "body": "Knowing extra languages can be an advantage. For example, Tiktok (Bytedance) and Chinese (Worked for me in SG office, not sure about US)",
          "score": 5
        },
        {
          "body": "\"ask not what your ~~country~~ company could do for you, ask what you can do for your ~~country~~ company\" - John F Kennedy\n  \ntoo many people always think from \"me me me\" view that's why they're going nowhere and remains unemployed, once you think from hiring view a lot of things will make more sense\n  \nfor example, read your own resume and pretend you're HR/hiring manager, what would you see from a 10 second scan?\n  \nanother example, if you're not in the same timezone, are you communicating that in your emails with HR or are you simply assuming they know?\n  \nas a job candidate it's literally your job to make HR's lives easier",
          "score": 2
        }
      ]
    },
    {
      "title": "Tiktok site reliability technical interview",
      "body": "Im a second year software engineering student and I got past the preinterview phase and have my first technical interview next week. I have very little experience with technical interviews and leet code and just wondering what to expect and what to do specifically to give myself the best chances.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1m8mg0u/tiktok_site_reliability_technical_interview/",
      "comments": [
        {
          "body": "You'll likely encounter a mix of coding problems, system design questions, and infrastructure-related scenarios. The coding portion will probably focus on algorithms and data structures similar to LeetCode medium-level problems, but with a twist toward reliability and scalability concerns. You'll want to demonstrate not just that you can solve problems, but that you think about edge cases, failure modes, and how your solutions would perform at TikTok's massive scale. Since you're a second-year student, they're not expecting you to have years of production experience, but they do want to see logical thinking and a genuine interest in how systems work under pressure.\n\nYour best bet right now is to spend time on LeetCode focusing on problems involving arrays, strings, trees, and graphs, but also make sure you understand basic concepts like load balancing, monitoring, and what happens when servers fail. Practice explaining your thought process out loud as you code because the interview is as much about communication as it is about getting the right answer. It's good to practice common [site reliability engineer interview questions](https://www.interviews.chat/questions/site-reliability-engineer-sre) around incident response, system monitoring, and troubleshooting distributed systems. The reality is that one week isn't enough time to become a LeetCode expert, so focus on understanding fundamental patterns and being able to articulate your approach clearly rather than trying to memorize hundreds of solutions.",
          "score": 1
        }
      ]
    },
    {
      "title": "Reality of CS Students in this Subreddit",
      "body": "I have over the past few years tried to help 6 CS students more directly through Discord, etc. All of whom claimed to be grinding, etc and so forth. Here has been my thoughts on what I noticed of college students and new grads.\n\nPS: I have over a dozen of students who had DMed for help, etc as well but those have always been casual reddit chats since I don't care anymore.\n\n\n\nMy thoughts on the job market:\n\n1. Job market for new grads and interns this year looks significantly better than the past 2 years.\n\n2. Offshoring is a reality which cannot be ignored. Companies are growing talent abroad now and a lot of layoffs have had their jobs moved to offshore. Unlike the past, offshore infra and talent is there. Covid 'proved' remote work works and 'offshore' == 'remote work'. Talent does not magically get better or worse depending on where the individual is located. And paying top dollar in Canada means entirely different from paying dollar in US.\n\n3. There's just too many CS majors and CS curriculums overall have become easier so schools can make more money. And there's so many CS adjacent majors sprouting left and right on top like Information Science, Data Science, Artificial Intelligence, Human-Computer Interaction, Computational X, Computer Science + X, Information Systems, Informatics, Software Engineering, Business Information Management, etc.\n\nAnd then there's the fact a lot of Math, Physics, Statistics, Actuarial Science, etc students are minoring in CS as well. And Computer Engineering, Electrical Engineering, etc students all applying to CS jobs as well.\n\nThe supply of candidates is essentially infinite relative to demand for new grads.\n\n4. Resumes all look similar end of day due to Chatgpt. And honestly, what can you expect out of students. These are students, not working professionals. Truth is, the most differentiating factor is school name on a resume before any work experience.\n\n  \nThat said, at the same time, the talent and quality of new grads have significantly deteriorated. The median talent is on the floor (if there even is a floor). And a lot of them seems to be due to:\n\n1. Schools dumbing down curriculums + grade inflation (easier to graduate).\n\n2. Students doing bare minimum in school and just studying for the job interviews. Hence you see students here with 2.0 GPAs showing off the interviews they have gotten.\n\n3. CS is now really mainstream unlike in the way past in which programming was thought to be for nerds.\n\n4. Modern devices have abstracted away so much that students did not have to grow up having to deal with all sorts of bugs, frustrations, etc on the Internet.\n\n5. Chatgpt. It does homework, vibe coding, etc. Why bother spending the hours?\n\n6. There is a whole industry to min-maxing CS related job interviews. And the quality is really high as well. And a lot of information which in the past might have needed weeks of research is readily available within minutes now.\n\n7. TikTok brainwashing towards the world of instant gratifications. Students just don't want to deal with long frustrating grinds that go nowhere, etc.\n\n8. A lot of students going in claim to be 'passionate' in CS but really they are just majoring in it for the money or lifestyle they heard on TikTok, Youtube, etc. Now, I think 'passionate' is cringe but .. these students are all just really doing the bare minimum.\n\n  \n\\--------\n\nWhy am I saying this? Well.. while I do know Youtube is a bait, my direct experience with 6 CS students in this subreddit have largely been the same as the ones I found on Youtube.\n\nIn fact, I would argue the ones on Youtube look like god talent relative to most of the 6 CS students here in this subreddit I interacted on Discord.\n\nWhat Youtube videos you might ask? This is from Coding Jesus Youtube channel which is extremely baity and really there for him to advertise his own site but...\n\n[https://www.youtube.com/watch?v=Q0JMSFNGZmc](https://www.youtube.com/watch?v=Q0JMSFNGZmc)\n\n[https://www.youtube.com/watch?v=G6GjnVM\\_3yM](https://www.youtube.com/watch?v=G6GjnVM_3yM)\n\n[https://www.youtube.com/watch?v=s\\_ztBwg7Vls](https://www.youtube.com/watch?v=s_ztBwg7Vls)\n\nLet me just say ... most of the 6 CS students in this subreddit over the years I interacted on Discord... makes those candidates look like top talent.\n\nI have come to believe that we seriously need more gatekeeping in this field. Completely agree with Coding Jesus: [https://www.youtube.com/watch?v=KrboWpmD1pA](https://www.youtube.com/watch?v=KrboWpmD1pA)\n\n  \nOn the hiring side, most students are flat out garbage. But the problem is **student resumes despite how well done at aggregate will always look similar before actual work experience**. \n\nHence on the company side, the only way to filter is largely by school names at aggregate. And trust me when I say this, most students at \"top schools\" nowadays are flat out garbage as well. The difference being AT LEAST the students at top schools tend to be good at Leetcode. At least that bare minimum is done.\n\nThe worst part of all this is actual talent cannot be differentiated either from the rest as well. And with so much cheaters everywhere, it's just impossible to tell who is actually good from others.\n\n  \nIt has been frustrating and a huge waste of time trying to help some students here in this subreddit only to learn that they ddn't even bother to do the bare minimum. I'm sorry but if you cannot do a basic easy-medium Leetcode question and are screaming for how the world is unfair and what not claiming you have been grinding and doing everything... then you are not fit for this field. Get out.\n\nIt's been a huge waste of my time and a huge eye opening over the years how bad most CS students are lately when it comes to CS. And the best part? Every one of them at the start talked as if they thought differently of themselves.\n\n  \nBut ya.. just me rambling. Just wanted to share this. Also, good luck college students with the job market. I know it's rough. My only real advice to you is .... well, look into C++ if you are serious about software engineering and want to differentiate yourself from others. Totally agree with this recruiter as well: [https://www.youtube.com/watch?v=O1e4zNfyowA](https://www.youtube.com/watch?v=O1e4zNfyowA)\n\n\nNote: I still am helping one of them and plan to for the next few years (been helping for two years now). But no more after that. ",
      "subreddit": "cscareerquestions",
      "score": 503,
      "url": "https://reddit.com/r/cscareerquestions/comments/1oemgrv/reality_of_cs_students_in_this_subreddit/",
      "comments": [
        {
          "body": "The frustrating part is dealing with the inherently noisy application process. \n\nI’m ranting but I have internships, have done a couple hundred leetcode questions, have projects, went to a good school, but still don’t get interviews. I do C/C++ but still any posting in any niche is instantly flooded. I have strong fundamentals but if you don’t have the listed keywords or experience then your resume gets instantly trashed. \n\nSeems like its not only bad applicants but also companies aren’t doing a good job at screening.",
          "score": 65
        },
        {
          "body": "I've been doing in-person informal mentoring and interview coaching for 5yrs and been in corporate for decades. The majority of early career devs I've seen have def degraded in skill and understanding over the years regardless if they're bootcamp, new grad, or \"self taught\".\n\nI'll ask questions about projects on their resume, not even technical assessments, just a discussion on their experience in a no-stakes setting, and they can't talk about it without wanting to pull up search or AI.\n\nSometimes it's because they used AI and just accepted/copied what was given. Other times it seems it's because it's in their muscle memory: they get a question and, instead of listening to understand, they're listening to engineer a prompt. Instead of pulling from their pool of knowledge, they reach for the laptop. It can take 10-30 minutes to get the person into a frame of mind where they can remember and talk about their experiences instead of trying to give the \"right\" answer. At this point I'm thinking I need to make a meetup to help early career folks think like an engineer instead of a student. \n\nFwiw I've helped engineers from self taught to \"elite school\" grads, early career to sr staff (but haven't interviewed in a while). I'm involved in my local community and talk with other engineers about their new hires. I've only got my anecdata to go on but it's a significantly more informative pool than what most people get exposed to.",
          "score": 28
        },
        {
          "body": "Im glad i at least learned how to program before LLMs. I will say the ask for instant gratification applies to management as well and i need llms to keep up with my workload. But at least i know if the code is good or not. They particularly struggle with c++",
          "score": 68
        },
        {
          "body": "I’m a new grad that wasn’t able to secure any internships. Now I’m grinding leetcode daily and applying for jobs to no response. What else should I be doing? Most projects can just be vibe coded in a weekend and feel low value. I don’t see how I ever get hired because I’m fighting tooth and nail to not just be totally outclassed by ai. Christ I’ll work for free just to get experience and still can’t find anything.\n\nAlso does the c++ apply to new grads?\n\nI, like everyone in my position, enrolled in a master’s for another chance. Feels like sunk cost at this point.",
          "score": 121
        },
        {
          "body": "I released my first application on Commodore Q-Link back in 1987.  So, I'm what you call a seasoned developer.\n\nFrom what I see on reddit, I think there's a lot of confusion about the profession some of you have chosen. Or, more to the point, once you have your fancy degree what are people going to pay you to do?\n\nThe truth is, unless you're going into Academia, you're going to spend most of your time doing three things:\n\n1. Debug and Fix Legacy Code\n2. Modernize Legacy Code\n3. Create New Applications\n\nWe all get into this field because we want to do #3. But most of the actual demand is in #1, and most of the time customers are more interested in #2 than #3.\n\nIf you want to stand out to employers, then my advice would be to either build something impressive or fix something that's broken. Either one proves your worth.",
          "score": 17
        },
        {
          "body": "Someone can correct me if i’m wrong but I can’t imagine C++ proficiency being applicable to many new grad roles. \n\nOf course learning any lower level language is going to reinforce a lot of CS/OS fundamentals, but idk, I think that time instead used for  Leetcode/projects that apply to more roles would be better spent imo. \n\nA lot of CodingJesus and his C++ content applies to quant roles, which are what, a fraction of 1% of all new grads roles?",
          "score": 64
        }
      ]
    },
    {
      "title": "the most insane YC experience i have had in my life",
      "body": "i am a SWE living in the bay for like 2.5 yrs now. i never touched marketing or anything sale related at this point. 3 months ago i started a TikTok account where I make fun of bay area tech culture and i have a lot of viral videos. suddenly i get an email from the CEO of a YC 2020 batch company to LEAD THEIR MARKETING as a founding content creator LOL. fucking crazy.\n\napparently founder led marketing on linkedin gets them a lot of business and they wanted to double down on that. my interview consisted of making a viral linkedin post and then scaling a twitter account from 0-&gt;as many followers/impressions as possible\n\nlike ive never done marketing or anything seriously like that until like 2 weeks ago. and this interview was last month. they were offering me $40k MORE than my current SWE salary to work for them doing LinkedIn/Twitter growth full time. surreal.\n\ni got to the final round and ultimately they went with someone else but they said my writing style was strong they just wanted a different approach.\n\nIDK if i would have taken the job but i was so close to getting an offer my ego was a bit hurt at the end haha. but i am so proud i was able to get that far cuz at least this means i have the marketing chops needed to be a founder.\n\nanyways im still kind recovering from this, would have been a cool pivot though LOL",
      "subreddit": "cscareerquestions",
      "score": 194,
      "url": "https://reddit.com/r/cscareerquestions/comments/1oeep6s/the_most_insane_yc_experience_i_have_had_in_my/",
      "comments": [
        {
          "body": "Now you gotta make a post poking fun at them, it's your content niche after all",
          "score": 164
        },
        {
          "body": "Wait… did they just get you to grow their socials for free? I wonder if this is their strategy all along - just keep “interviewing” for free work",
          "score": 83
        },
        {
          "body": "Wanting you to join their marketing team might make sense; to *lead* their marketing team is crazy. But I worked for a YC-funded startup; based on the behavior of those founders, I can believe it.",
          "score": 17
        },
        {
          "body": "They made you work for free",
          "score": 17
        },
        {
          "body": "Nice post, quite different from the usual. Good work OP",
          "score": 23
        },
        {
          "body": "personally i wouldn't take a job like this, sounds like a trap job. didn't miss much",
          "score": 7
        }
      ]
    },
    {
      "title": "So, you've got an opportunity, what to expect (tech).",
      "body": "So you pushed the button, your resume got through the screen and you're selected to talk.  What happens next?\n\n  \nI'm not HR, I'm tech - what happens before you hit my desk I can speculate at, but I can tell you what happens from the moment you make my calendar.\n\n  \nI cannot speak to the world, but I've worked in a lot of organizations over my career, I've done (in the literal sense) hundreds of interviews - so I'll generalize, but don't take as gospel.  Everywhere is different and my experience isn't yours.\n\n  \n\\- First/second phone screen - I'm the resume checker.  You've literally handed me a piece of paper with a choose your own adventure of things to talk about, and I don't have an easy exit strategy for 45 minutes.  Guess what happens, I look for things I know, and ask you to talk about them.  In detail, until I know you actually know it better than me or you dont, and then I put a number next to it.   The topic may have been irrelevant, I don't care if you used to manage UUCP mail hubs or tiktok feeds - the problems are the same - it's how you dealt with them, learned, and matured that's important.\n\n\\- Deep dive (virtual on-site, etc) - same thing, but deeper, I will question your experience until I find something interesting to talk about (and the thing I find interesting \\_will\\_ be the thing you misunderstood).  And then I will talk about it.  Until you've proven you've done it, or you didn't (to me), and that's it.  You (the candidate) are looking for an entry level position managing (foo), there is a non-zero chance I'm on the RFC's for foo - so the difference between confidence and competence is paramount.  I'll take an eager under-informed learner over an over-confident prick any day.\n\nPeople often think the tech screen is what killed them - and it may well be - but true story - I've been interviewing people for more than 20 years - it's not my job, just a thing I have do do as a senior.  I have two \"entry-levels\" that blew me away, and I directed them to their appropriate departments, and they got jobs accordingly.   I have had hundreds of \"I'm smarter than you\" that couldn't learn when I asked them to drill deep, and then go deeper.  I don't care that you're smarter than me.  I care that you can understand when you're wrong, and learn.\n\n  \nAll of this has happens in 15 minutes, maybe 20.  I decided \"no\" within 20 minutes,  yes will take you to the length.  The last 25 minutes is just me confirming things and throwing you life-rafts.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1qevjeq/so_youve_got_an_opportunity_what_to_expect_tech/",
      "comments": [
        {
          "body": "I bet you're fun at parties ",
          "score": 3
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "I would not hire the type of person who makes a post like this.",
          "score": 1
        }
      ]
    },
    {
      "title": "Career advice",
      "body": "Hi, i would like some career advice from experienced professionals in this field.\nI am a career switcher who went for a SWE bootcamp, and i have successfully switched into a software engineering job. I wont go into much details about how i got the job but it took alot of effort, hardwork and discipline post-bootcamp to get myself job ready. The bootcamp mainly covers MERN stack as all other courses, and i went on to pick up a java course in youtube by myself. I was lucky to get a interview at my current company through a referral and the hiring manager seem to like my vibes. This job mainly works with java technogies and the hiring manager was willing to give me a chance and train me up in this area.  I am very grateful to be given this opportunity by the hiring manager and i am enjoying my work so far.\n\nHowever, i came to realise that the java technologies used here is quite old. The company is working with jsp and jbt and struts framework for the parts that i am handling, and also planning to onboard me to a java spring project. Other people are working using vb.net, and although the company has plans to move to angular on the frontend, that is just a plan with no solid deadline. As i went through the bootcamp on MERN stack, i am more proficient in javascript and also looking to advance my career in that area. I am also developing some personal hobby projects on the side in my free time so that i keep up my skills in JS/TS and react and stuff.\n\nSo i want to ask for advice on this: \nWill staying at this company for 3-4 years to gain experience as a software engineer harm my career progression as i am gaining experience in old technologies that nobody really uses? I am aware that most companies are working with popular technologies like react/angular/vue, JS/TS, springboot, python etc.\nMy aim of my career is obviously to get to a big tech company like TikTok as an individual contributor and not manager level, if possible FAANG level but i am not so confident of that at the moment. Im worried at this point that the experience and tools i learn here will not really be relevant to other companies and make career progression an issue. I am very thankful to have secured a job in this bad job market as a bootcamp grad, but this is just one of my small concerns.\n\nI would love to hear some insights, thanks",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1mt9skp/career_advice/",
      "comments": [
        {
          "body": "This is honestly absurd; you found a job as a boot camp grad in a market where almost no boot camp grads are getting hired, and you're worried the job will hurt your career prospects.  Be grateful that you found a job, and just put on your resume that you used Java; you don't need to go into details about how old it is.",
          "score": 24
        },
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "Java is pretty much the most used language for enterprise applications. 🤷🏻‍♂️",
          "score": 4
        },
        {
          "body": "If you don't already have a STEM degree, then you should get yourself a part time a BSc in CompSci degree (or \"a bridging Masters\" if you already have an unrelated degree). Study it part time while working full time at your current job. \n\nOnce you've finished your degree (or once you're past at least half way through it), then jump jobs to one with a more modern stack.",
          "score": 1
        },
        {
          "body": "So I know you said you won't go into it, and I really don't mean to pry, but you admitted to pulling off something even some senior software engineers can't do in 2025: getting a job. If there's even a lick of advice you could offer in these trying times 🙏✨",
          "score": 1
        }
      ]
    },
    {
      "title": "Help with my path pls",
      "body": "hey so my name is nath and im kinda studying computer science i say this cause it's not technicly computer science but more oriented to web development cause they taught me java, c++ for create web pages and to link them to data bases and stuff like that, its a technichal major tho it's not in any university anyway my point is than im about to finish my degree and i was looking for internships but my problem is i don't know what to look for, cause i've seen in tiktok that you need to know algorithms and stuff like that for the interviews but i haven't learn that but only programing. Plus i kinda wanna get into big tech so where can i start, Im from Peru tw. Anyway it'd be really helpfull if anyone can give me any guidance, thanks.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1n1stg2/help_with_my_path_pls/",
      "comments": [
        {
          "body": "What is the major?\n\nAlso, using Java and C++ for web development seems kind of weird unless you're referring to back end services. \n\nTo break into any major big tech you will need knowledge around datastructure and algorithms. Any way you can transition to computer science or do a masters in computer science?",
          "score": 2
        }
      ]
    },
    {
      "title": "Wow y'all were right... (Referrals)",
      "body": "As many of you know the summer 25 internship is coming to an end. The vast majority of ppl who have an internship lined up have probably had it secured for a while now and the closer we approach the summer, the harder it is for ppl without an internship to land one. \n\nAnyway here's where I enter. Im a Junior cs major at a t50 school, with an average/slightly below average gpa, and no past internship experience apart from personal projects on my resume(nothing to write home about). I started seriously applying on jan 1st applying to maybe 5-10 places as daily as I could. a variety of roles too (frontend,backend, fullstack, ML, and data science) for the most part id get ghosted, receive an automated follow up email 3 weeks later saying they went with another candidate, or if I was lucky get a aysnchronous hackerank coding assessment in which id get ghosted after. I try tweaking my resume a bit, test out different formats and even fluffing up a bit of my projects in an attempt to get any response. Obviously this is a common experience for many ppl here but I keep at it all the way from then till now with maybe only getting 3 actual 1:1 interviews. At this point summer Is approaching and I have no idea what I can really do on my end. \n\nI hear on reddit,tiktok and pretty much everywhere that one of the best ways to get your foot in the door is through a referral however, I had none. I tried reaching out to recruiters, but I barely got a response this late in the cycle. Anyway I happen to stumble on one of my childhood friends linkdin page and see that he got a recommendation from the chief officer of the company he intered at the summer before so I hit him up and ask him about it. He encourages me to send him an email. So I find his company email and send him a connect request pretty much stating that I was a good friend of the person he gave the recommendation to and asking if their company was still accepting interns attaching my resume and if we could schedule a time to call. Within 2 days he replies saying that \"any friend of (friends-name) is a friend of mine\", that I had a solid mix of skills on my resume, and that he was going to check if there are any project/internship openings for me to do. Fast forward to the call, I did some quick prep on reviewing my resume and the company. He was a super nice guy, asked me some questions about my resume, what the job entails, and just overall a chill conversation abt who I was and my skills. i didn't have to do any leetcode style technical interview and I essentially bypassed the whole \"traditional process in a sense\". So yeah I knew connections were important within the work force and adult life but holy shit this was one of those eye opener moments cause I didn't realize how powerful it could be.\n\nTLDR: average cs student struggles to land an internship let alone even hear back from companies but uses an unrealized connection to bypass the \"traditional\" interview process and land the job",
      "subreddit": "cscareerquestions",
      "score": 647,
      "url": "https://reddit.com/r/cscareerquestions/comments/1jy901d/wow_yall_were_right_referrals/",
      "comments": [
        {
          "body": "Unless it's a fortune 500 company, then it shouldn't be too hard to wow the hiring manager *if you can get your foot in the door*. It's like oh my god they're actually human and I can talk to them. Had you just applied online theyd never hear of you.",
          "score": 286
        },
        {
          "body": "In many decades of experience in the private sector my experience has been that employees' kids have a huge leg up on random applicants for securing internships.",
          "score": 55
        },
        {
          "body": "First job is the hardest to get. Almost all my other jobs have been because I knew someone.",
          "score": 74
        },
        {
          "body": "Did you ask your friend first whether you could name-drop him?",
          "score": 136
        },
        {
          "body": "Referrals are where it is at. Our department needs developers at nearly every level and we were told they pulled all outside links. Too much AI spam and candidates from places like North Korea. They would put in a role for a mid level developer and get over 2k applicants in like 5 hours. Nearly all of it was BS. \n\nCompanies need people but the hiring process is broken on both ends.",
          "score": 22
        },
        {
          "body": "[deleted]",
          "score": 44
        }
      ]
    },
    {
      "title": "Should I cancel my TikTok loop if I don’t want the SRE role anymore? I want to apply for SDE.",
      "body": "Hey guys,\n\nI was interviewing with TikTok for an SDE role, but halfway through the process the position got closed. The recruiter asked if I wanted to switch to an SRE role instead, and I said yes. I’m now at the final round.\n\nThing is, after looking more into what SREs actually do, I don’t think it’s for me — seems like there’s a lot of on-call and ops work. I’d still love to work at TikTok, just preferably as an SDE.\n\nWhat do you think I should do? Cancel the last round and be honest with the recruiter, or just go through with it, try to leave a good impression, and see if I can switch back to SDE later if I get the offer?",
      "subreddit": "cscareerquestions",
      "score": 86,
      "url": "https://reddit.com/r/cscareerquestions/comments/1omb5ze/should_i_cancel_my_tiktok_loop_if_i_dont_want_the/",
      "comments": [
        {
          "body": "You can worry about it after getting the offer.",
          "score": 161
        },
        {
          "body": "Engineers in general do a lot of ops and on-call work. Don’t view the title as much as what the job does.\n\nMy SDEs do ops and on call work. As a Director I do ops and on call work. If you take the position you never want to do those things, you will greatly limit yourself as to what roles you will do.",
          "score": 26
        },
        {
          "body": "The odds of you being able to switch back to SDE is virtually zero. That said, a job is better than no job if you’re a new grad. At worst, it’s free interview prep. At best, it’s a damn lucrative job. Keep the interview, get the offer, and decide if it makes sense to take it or keep looking.",
          "score": 111
        },
        {
          "body": "I got bait-and-switched into joining an SRE team at my first role out of school. I’m 3.5years in. \nI barely write any code, the occasional automation, but it’s mostly yaml config type stuff. Our on-call can be brutal and all of the things we own are critical so it can be stressful. It’s not friendly to early career, especially if it’s not the type of work you are interested in, and it has been a struggle. I was told that this experience with systems would be great for my future career opportunity so I went along with it. \n\nWhat I’ve found is that I’m missing out on a lot of traditional early career exposure. I don’t have much OOP experience and I don’t know much about writing or owning the destination services themselves. This has made it tough to change teams (I’ve gotten direct feedback that they want more code experience) and it means that to land another job I will have to be “creative” on my resume and when interviewing. In the current market, people want specific tech stack experience, not generalists. So yes I very much feel pigeon holed as a result of the bait and switch and it has impacted my career trajectory and my overall happiness in the industry. I don’t write code or build things: I put out fires, stare at dashboards, and debug kubernetes logs. I’ll spend an hour figuring out an esoteric 1 line yaml configuration change which could literally take down the entire business if it’s done wrong, and then a teammate will ask why it took me so long. I am expected to understand the entirety of our system as opposed to just my one vertical. It is not at all what I expected when I chose this career. \n\nI do not recommend taking an SRE job out of school. As others have said, it’s something people usually choose to get into later in their career, it assumes a lot of underlying knowledge, it’s high stakes, and it’s not the type of work everybody enjoys or excels at. I know the job market is hard and you take what you can get, but I’d definitely try to get on a different team, or take the job and immediately continue looking for something new before you get pigeon holed. Don’t let what happened to me happen to you.",
          "score": 18
        },
        {
          "body": "I had same experience at tiktok. Interviewed for sde, offered sre, accepted it. Regretted, moved to another company afrer few months. Thing is if you want to be sde then be sde. I do want to generalize what sre is and what other folks perceive. My experience was that i was being ops genie, writing some shell script and python to automate some repetitive stuff. Improving alarms and monitoring stack. Thats it. ",
          "score": 6
        }
      ]
    },
    {
      "title": "My job search with 1.5 YOE",
      "body": "This post is a summary of my job search experience in the current market. If these types of posts don't interest you, you can stop reading now.\n\nI've been working at Bezos Corp for a year and a half when I had a recruiter from G reach out on LinkedIn. I figured if I was interviewing there I should interview elsewhere as well, and so the grind began. I hit the Blind 75 LeetCode questions again (though I've still only completed 65 total LC questions lifetime).\n\n**Ghosted**: \\~20 companies I don't feel like listing\n\n**Rejected after applying**: DocuSign, Grand Rounds, Blink Health, Branch\n\n**Failed online assessment**: Axon, Ekata, Moloco\n\n**Phone screen**: G, MacroHard, TikTok (failed), Snap (failed), ZipRecruiter (failed)\n\n&amp;#x200B;\n\n**🎉 Offers 🎉** (greater Seattle area):\n\n**Big G** L3 \\[\\`135k base, 115k stock at 33/33/22/11, 15% target bonus, 5k sign on = 198k TC first year\\]\n\n**MacroHard** L60 \\[128k base, 130k stock with equal vest, 30k sign on over 2 years, 10% target bonus = 188k TC first year\\]\n\n&amp;#x200B;\n\nI'm planning on accepting G. Was hoping MacroHard would come in with an L61 offer and I'd be able to negotiate G but it doesn't look like that'll happen. I'm going to push MacroHard to see if they'll go higher but I'm not very confident they will so I don't expect these offers to change much.\n\n**Takeaways**:\n\n* **Don't count yourself out.** When I failed interviews at ZipRecruiter and OAs from companies I hadn't heard before, I almost cancelled my G interview because I thought there's no way I could pass.\n* **Have an active LinkedIn.** Both offers I got were initiated through a LinkedIn message from a recruiter. I always see people ask \"should I use LinkedIn???\" on here and I don't understand why you wouldn't. It takes 20 minutes to set up.\n* **The market is hot.** Try interviewing.\n* **It's draining to interview and continue your current job.** I think I would've been in trouble if I didn't get any offers and had to return to work. I was focusing more on interviews and found it very hard to focus on work once I passed HC at Big G (although it took another \\~2 months to get an offer).\n\nOverall I'm pretty happy with how things went. I think if I studied LC a little harder I could've got higher offers but I'm happy with 200k lol.",
      "subreddit": "cscareerquestions",
      "score": 481,
      "url": "https://reddit.com/r/cscareerquestions/comments/sznupz/my_job_search_with_15_yoe/",
      "comments": [
        {
          "body": "You miss all the shots you don't take.\n\nI've also started interviewing, most didn't even flinch when asked high base 200k+",
          "score": 105
        },
        {
          "body": "What is your current TC at Rainforest?",
          "score": 77
        },
        {
          "body": "Caveat: you're an engineer at a well reputed engineering firm. Yeah, it's gonna be easy for anyone working at a tech firm like Amazon/Microsoft/Google to get interviews just by having it on your resume already.\n\nMost of the posts I see here on /r/cscareerquestions are about getting their foot in the door and getting those interviews on the first place. You're already in the lobby and the whole buffet has been lined up in front of you.\n\nThat said, congrats on the offers.",
          "score": 472
        },
        {
          "body": "Macrohard 😂",
          "score": 18
        },
        {
          "body": "Im at exactly the same YOE and have just recently started on LC. Ive been applying to new jobs (Greater Boston) for about 8 months. No luck yet, but im constantly being contacted by recruiters on LinkedIn given my background and work experience. How experienced with LC would you say you are? I’ve only been using it for about 5 weeks and I found some of the easy problems to be really easy but others im totally clueless. \n\nI also feel exactly the same way, juggling interviews and my current job its exhausting",
          "score": 36
        }
      ]
    },
    {
      "title": "SWEs that started making over six figures as a new grad, where are you now",
      "body": "I see a lot of posts of people saying they break six figures after some years of experience. But there's also some people that join the top companies as a new grad. \n\nI am just curious, how has starting at the top companies affected your career growth and salary?",
      "subreddit": "cscareerquestions",
      "score": 77,
      "url": "https://reddit.com/r/cscareerquestions/comments/kxamvi/swes_that_started_making_over_six_figures_as_a/",
      "comments": [
        {
          "body": "I started out at a trading firm making six figures. I got lots of training and mentorship at my job, and I got to work on a lot of big impact projects since it was a smaller firm. Working there made me progress a lot, and made it trivial to get interviews anywhere else. \n\nThe pay, perks, and experience have made me extremely picky about job opportunities and allowed me to play hardball with companies while recruiting. I recently accepted a job offer for a big raise.\n\nThe money has also made my life outside of work better. I have a great apartment in the middle of the city. Pre-covid, I'd try out new bars and restaurants all the time without worrying about price and take 2-4 international vacations a year.",
          "score": 101
        },
        {
          "body": "Broke $500k TC last year, after 6 years at a FANG. I spend most of my money making terrible bets in the stock market.",
          "score": 124
        },
        {
          "body": "Nothing really. Definitely get looked at by more companies but still have the watch tons of algorithm tutorials in order to get interviews.",
          "score": 37
        },
        {
          "body": "Started at 105k in 2016. I will make around 350k this year (tc). Same company. Love my job too!",
          "score": 50
        },
        {
          "body": "So we are turning this subreddit into Blind as well? 🙂",
          "score": 23
        },
        {
          "body": "Changed careers due to burn out",
          "score": 19
        }
      ]
    },
    {
      "title": "The New grad experience in this job market.",
      "body": "If you've been reading up on this subreddit, then you probably know how tough the current job market is. I'd say that it's interesting to see the job market dynamic during the 2021 hiring craze to the 2023 crash. \n\nDuring the 2020-2021 graduating year, new grads were essentially guaranteed a job (you'd still need to apply to hundreds of jobs though). So I decided to take on more courses so I can graduate quicker, but I instead ended up fucking myself over by graduating during the worst time in 15 years. \n\nNow, a little background information on me, I'm living in a \"tech-hub,\" so the entire time I was in college everyone's been talking about how \"*easy*\" it'll be for me to find a job. So I know the problem isn't my area. I've always been a loner and I've always loved logic, math, and programming. So when people said that the world had a shortage of Software Engineers, I thought \"what luck! I'd make the perfect Software Engineer!\" More time passed on and I've been getting hit with reality checks. Firstly, programming isn't a \"loner\" jobs. It's very, very social. I can get past that, as long as I get the chance to program a lot. I'm also slightly frustrated with the tiktok posts that claim that Software Engineers can be paid six figures \"doing nothing.\" The entire point I chose Software Engineering was because I was under the impression that it was a highly valued and rare skill that would pay well to professionals like me. So needless to say, I was pissed off to see a surge of people who come into my field purely because they've been convinced that they could easily make money. \n\nHow about my personal skill-level? I'd like to think that I'm below-average, but I honestly don't know where I stand. I'm below-average for the standards *of this subreddit*. I have personal projects on my resume, I have two semester's worth of research experience -- which ended last may. I have skills ranging anywhere from simple threading to full-on machine learning -- yet I haven't gotten a single interview since last summer. \n\nHow do I feel and how do I cope? I'm honestly doing alright. I'm luckier than most people since I have my parents to support me while I'm job-searching. I've seen single mothers study with me and graduate alongside me in college so I know that people like them are more screwed than I am. And I know I can ride out this market, but it's just...*frustrating*. I've tried everything from privately messaging recruiters, going to career fairs, applying to *HUNDREDS* of jobs, rewriting my resume a bunch of times over, and even asking some of the people I know. I know that people say that this subreddit is \"bad for your mental health,\" but it's honestly the only thing that saved me from going insane. I'd rather know what's happening around me and be depressed instead of mindlessly applying for jobs without knowing why I'm getting rejected. It's not like I've been applying to remote work that pays six figures only. I've been applying to commuting jobs anywhere in the U.S.. I'm also willing to be paid minimum wage if it means I'll land my first SWE job. I would get an entry-level SWE job paying minimum wage in Alaska if I got an offer for it. \n\nI've seen others post sentiments like \"$20/hr is pure junk btw,\" so I know I'm lowballing myself. I've been paid $15 in my last job, and honestly, at this point I'm alright being paid $15 an hour as a entry level SWE. I love this field more than anything else, but I do have some doubts on whether I will be able to find a job or not. Any advice or any questions on my situation?",
      "subreddit": "cscareerquestions",
      "score": 85,
      "url": "https://reddit.com/r/cscareerquestions/comments/17a5k74/the_new_grad_experience_in_this_job_market/",
      "comments": [
        {
          "body": "If you find yourself in a difficult place in your life, we urge you to reach out to friends, family, and mental health professionals. Please check out the resources over at /r/depression, /r/anxiety, and /r/suicidewatch. Feel free to [contact the /r/CSCareerQuestions mods](https://www.reddit.com/message/compose?to=%2Fr%2Fcscareerquestions&amp;subject=&amp;message=) for more information or help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "R u a May 2023 grad cuz same and I’m going thru a similar struggle",
          "score": 65
        },
        {
          "body": "Sounds like a frustrating experience.\n\nThe number one good use of time for you right now would be building things. Applying isn’t working, and you have some breathing room financially, so I’d take the time and cut some code.\n\nDon’t think too hard about what to build, just find something you’re into and start writing. If it’s a game, make a game. If it’s a mobile app, make an app.\n\nGet into some discords or slacks with other builders and just talk about stuff. What you’re building, what they’re building. You’ll gain skill fast and make connections that are more likely to land you your first role than turning the crank on the ol’ application mill.",
          "score": 33
        },
        {
          "body": "Bruh I can't read all of this but if it makes you feel any better, there are jobs out there. I got a job fully remote ~90k",
          "score": 16
        },
        {
          "body": "It's basically a daily occurrence for someone to write a long post on /r/cscareerquestions claiming that they've revised their resume a hundred times so it must be perfect, but they still can't get interviews, and they're going crazy trying to figure out what the problem is.\n\nHere's the cheat sheet for figuring out what the problem is:\n\n1. Your resume probably sucks even after a hundred revisions. Post it.\n2. You're a non-citizen who needs visa sponsorship.\n3. You majored in IT or game design or something besides CS.\n4. You have no internships or noteworthy projects.\n5. You're being too picky about the jobs you apply to. E.g. only looking for remote work. Or only looking in one city. Or just aiming too high.\n\nMost of these problems have solutions. If your resume sucks you can revise it. If your credentials are weak (low GPA, no internships, weak projects, etc.) then you have to widen your search to include roles other than software engineering, like DevOps, QA, solutions engineer, DBA, IT, or whatever.\n\nThe market does suck but if you're not getting any interviews whatsoever you probably have a fixable problem.",
          "score": 4
        },
        {
          "body": "This subreddit can be an echo chamber of despair, but take a step back, you got this. Getting your foot in the door is always the hardest part, probably even harder with this economy, but it will get easier when there’s more experience. I think it’s hard when you’re starting out with everyone to not compare yourself, but at the end of the day, as long as you can support yourself and enjoy your job a little bit, you’ll be ok. \n\nSince you’re not getting an interview, get someone who has been in the industry to look it over. (I would take resume advice from this subreddit with a grain of salt). Add more key words in the resume from the job posting. (If there’s a skill on the listing, and you’ve dabbled in it, put in on your resume anyways.). Network, go to networking meetups, try to get a reference for a company. Go for small-medium companies as well, try different locations, defense, etc.",
          "score": 7
        }
      ]
    },
    {
      "title": "TikTok or try Bloomberg",
      "body": "I'm at a dilemma. I have just accepted a TikTok offer with 210k comp in the Bay. It's for a mobile team working on front facing products, and the team seems chill and more diverse.\n\nToday, a bloomberg recruiter got back to me after two weeks since my round1 interview with them, to schedule a power day (2 techs, 1 hr) and then a EM round after that. Is it worth trying out? I do plan on eventually living in NYC while I'm young. But I feel that TikTok will give more career growth.\n\nIf I choose TikTok, I will work around 2 years before trying to find a job in NYC.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1g932ls/tiktok_or_try_bloomberg/",
      "comments": [
        {
          "body": "Both are great companies. It’s a good problem to have. Can you ask extension from TikTok?",
          "score": 3
        },
        {
          "body": "Do you speak mandarin? I’ve heard tiktok can be tricky if not, and it’s important for moving up. You’ll also take a lot of meetings on Beijing time (again, just what I’ve heard from friends there)",
          "score": 3
        },
        {
          "body": "Since nobody has mentioned it, TikTok is currently on the verge of being banned in the US. While there is still a court battle to be fought, your job security there faces a clear existential threat that Bloomberg does not.",
          "score": 3
        },
        {
          "body": "If you want to live in nyc eventually interview with bloomberg and use your tiktok offer to negotiate a higher offer. They can get close to 200k and you’ll actually be able to enjoy your life with their chill environment and being young in nyc. While TikTok may be marginally more reputable given the scale and the fact that they are a true tech company I don’t think that’s worth slaving away in the bay. If this was G or F then i’d consider it but not TikTok.",
          "score": 2
        },
        {
          "body": "In this market, I would take what you have. Tell Bloomberg recrutier you accepted an offer and would be delighted to interview again later and would have moved forward if their process was faster. \n\n\nI've met recruiters outside of work who told me they lose so many good candidates because their bosses don't move quickly enough.",
          "score": 1
        },
        {
          "body": "Did you get the offer from Bloomberg?",
          "score": 1
        },
        {
          "body": "TikTok",
          "score": 1
        }
      ]
    },
    {
      "title": "Verbal Offer From TikTok This Past Week",
      "body": "Hi All,\n\nNot sure if this right place to ask this, but I've been in the interview pipeline for TikTok for the past 3 weeks, and I recently received a verbal offer before the court ruling. I have around 1 YOE at a F500 company. \n\n  \nThe question is, would you guys risk going to TikTok for higher growth/TC or remain at my current position which has been good wlb and alright pay? \n\n  \nJust wanted to hear your guys opinions, thank you to everyone in advance",
      "subreddit": "cscareerquestions",
      "score": 24,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ha2xjl/verbal_offer_from_tiktok_this_past_week/",
      "comments": [
        {
          "body": "1. You have a job now (with 1 year of experience) with good wlb and ok pay\n2. You are considering a position at TikTok which is [well known for](https://www.glassdoor.com/Reviews/TikTok-Software-Engineer-Reviews-EI_IE2230881.0,6_KO7,24.htm?filter.jobTitleFTS=Software+Engineer&amp;filter.iso3Language=eng&amp;filter.employmentStatus=REGULAR&amp;filter.employmentStatus=PART_TIME) a really bad wlb.  (Seriously, find one review that *doesn't* have work life balance in the cons)\n3. Dec 6 [US appeals court upholds TikTok law forcing its sale](https://www.reuters.com/legal/us-appeals-court-upholds-tiktok-law-forcing-its-sale-2024-12-06/) - its future in the US is uncertain.\n\nGiven these, do you *still* think that it would be a good idea to change jobs?  This really boils down to a question for you - how much do you value your work life balance compared and job stability compared to the possibility of making more money?",
          "score": 92
        },
        {
          "body": "Step 1: accept the offer, start ASAP, don’t quit current job \n\nStep 2: cash check for signing bonus before Bytedance shuts down TikTok US \n\nStep 3: ??? \n\nStep 4: profit",
          "score": 60
        },
        {
          "body": "Depends on the different in pay to me. And where you’re at in life. If you have a wife/husband/serious girlfriend/boyfriend and especially if you have kids wlb might be way more important than a single person.",
          "score": 7
        },
        {
          "body": "I’m not at TikTok but I have friends there and I also review a lot of resumes, some of which come from there. \n\nIf you’re at a stage in your life where you’re willing to sacrifice some potential WLB for growth, TikTok can be a great place to learn, and a way to continue transitioning either to top unicorns or big tech. \n\nThe scale that they operate in along with the regulatory challenges makes for an environment with a lot of learning opportunities and experiences that you’ll be able to add onto your resume and talk about going forward (actual problems owned and solved instead of just stuff like “implemented APIs in X that led to Y,” which I see in a lot of F500 SWE resumes).\n\nThere’s a good chance it’ll be long hours and stressful, but there are benefits too depending on what you’re looking for.",
          "score": 6
        },
        {
          "body": "If it does get banned, I imagine they will ask some US based employees to relocate to Singapore or to a European office.",
          "score": 4
        },
        {
          "body": "If growth and TC outweigh job security concerns for you, TikTok could be a great leap — just be aware of potential risks.",
          "score": 1
        }
      ]
    },
    {
      "title": "Need help deciding between 2 offers",
      "body": "Hi everyone, I have 2 new grad offers on the table, and I'm not sure which to go with. I already signed a TikTok iOS new grad offer last fall, but recently I got an offer from a medium-sized startup that specializes their product in AI (but has been around for 10 years). Both are based in South Bay Area, and the pay for both is about the same.\n\nTikTok (starting as new grad):  \n\\- Pros: More clout for resume, working on TikTok is cool to me  \n\\- Cons: Ban uncertainty, uses Objective-C and UIKit, 996 culture\n\nStartup: (starting as L2):\n\n\\- Pros of Startup: Better culture, more potential impact, uses Swift and SwiftUI, has staff engineers that are FAANG veterans\n\n\\- Cons: Less name brand for resume, AI is a bit sus to me, taking it = reneging TikTok\n\n",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1j4kiil/need_help_deciding_between_2_offers/",
      "comments": [
        {
          "body": "Take TikTok and continue interviewing",
          "score": 1
        }
      ]
    },
    {
      "title": "TikTok US from other big tech",
      "body": "Moving through final rounds of interviews at TikTok US and currently at FAANG in dc area. Given the potential ban at TikTok, would this be a terrible job move even at a significant total comp increase? \n",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/1d3x9c9/tiktok_us_from_other_big_tech/",
      "comments": [
        {
          "body": "The ban will be tied up in court for so long that I wouldn't worry.  You could easily get a few years out of it.",
          "score": 19
        },
        {
          "body": "It's hard to say. I was at a company that poached FAANG senior+ talent frequently. But when tech wasn't doing well in 2023, our stock didn't recover as well as the FAANG stocks did, so people i knew who came over from FAANG ended up making the same (or less) had they just stayed at their original FAANG roles. The point: total comp can be hard to predict when so much of our compensation is based on equity, and equity is based on something as fickle as markets.\n\nAlso 996 sounds like trash",
          "score": 16
        },
        {
          "body": "Makes me wonder why they are hiring given the looming ban",
          "score": 3
        },
        {
          "body": "FAANG and Chinese company work couldn't be farther from it if one tried. Completely different culture and work hours",
          "score": 4
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "How is the current Web Dev job market for a no cs degree applicant in 2023?",
      "body": "Hi so I went to a Fullstack webdev bootcamp in Jan of 2020, graduated in May(pretty much very beginning of covid). I was 19 at the time and didn't go to college but I had a bunch of random jobs ranging from cleaning to barbacking to deconstruction. \n\nAfter I graduated the bootcamp I applied to over 300 jobs between May and October of that same year and got no responses.(Easy apply on linked in, on website applications, indeed applications, ziprecruiter) The bootcamp I went to had a career services person to help you find a job and keep track of how you were doing and better your chances in the job market. They told me I wasn't pretty much the bottom of the barrel pick and by luck and persistence I would get an interview or even a job, due to covid destroying the job market and me not having a degree.  \n\nSo I stopped, I felt pretty defeated and kept strolling along in life until now in 2023. \n\nI'm 22, with a fiancé and two cute little cats, I work as a waiter and she's going to college for neuro science, while I've been trying to model and get acting gigs. I've been getting tiktoks for data analytics jobs and it has me wondering if I should try to pick up my skills and do web dev again.\n\nIs pursuing a career in web dev as a person with no degree and bootcamp experience worth trying again? I'd love any advice on other tech related job fields as well, thanks! :) \n\nALSO, I can send my portfolio and resume as well if anyone wants to see my experience.",
      "subreddit": "cscareerquestions",
      "score": 10,
      "url": "https://reddit.com/r/cscareerquestions/comments/129r210/how_is_the_current_web_dev_job_market_for_a_no_cs/",
      "comments": [
        {
          "body": "It's really tough out there right now. I have an Associate's in Computer Science and 6 years of experience, and after \\~200 applications I still don't have anything, although it should also be mentioned I work in a niche programming area (air-gapped .NET desktop applications, no web-based services), but not having a bachelor's degree is an auto-reject for most companies.   \n\n\nI still think it's possible, wait until the market picks up while working on your skills in the meantime. You'll land your first job, it will probably be low paying and suck (which is my case and why I'm trying to leave), but it will give you experience.",
          "score": 14
        },
        {
          "body": "It's definitely possible but giving up on your job search kind of screwed you over. For one thing, by now you would have gotten a tech job so you wouldn't have to worry about having no experience. Even if you needed to upskill, you could've had three years to work on projects or go   to college, which would make your resume a lot stronger.\n\nIn the short term you probably aren't getting a job. The market just isn't doing well, especially entry level positions. Your best shot is to brush up on your skills and work on projects or whatever so that when the market picks back up you can start applying to places nonstop.",
          "score": 20
        },
        {
          "body": "Anything is possible.\n\nBut, given previous track record. Unlikely.\n\nIt's difficult to pursue tech jobs without ANY higher education degrees and no experience.",
          "score": 9
        },
        {
          "body": "You can always try. I tell people, I did it, but it was a long grind, both in getting my foot in the door to the industry and in the kinds of jobs that I had to take initially. The pay was comparably very low. You'll likely have to work less desirable coding jobs for 2-3 years, unless you're in a hot market or can really wow people.",
          "score": 5
        },
        {
          "body": "Title is a little misleading. Market for someone with no cs related degree is tough. Market for someone with no college degree at all is even tougher, even those with unrelated degrees are ranked above you. Would consider getting in the field with QA, sales/solutions engineer positions. Maybe theyll have less competition\n\nEdited to remove IT",
          "score": 8
        },
        {
          "body": "It was a mistake to do a bootcamp before getting a degree. Most successful bootcampers already have some kind of degree plus professional work experience, but unfortunately you graduated from your bootcamp without either one, into a difficult job market.\n\nStill, you're really young, and you don't have much debt yet. Do a cheap associates, and then try the job search again -- if you still don't have any luck, then you can transfer credits to a bachelors degree program. Ideally you'd want to graduate around the same time as your fiance -- if your graduation dates are out of sync, then it'll be hard for either one of you to relocate for a work opportunity.",
          "score": 3
        },
        {
          "body": "It’s going to be tougher than when you tried in 2020",
          "score": 3
        },
        {
          "body": "Just a thought, what if you try to find some IT role or even a completely unrelated non-IT role at a company that also has SWE jobs. Keep sharpening your skills as you work there, then try to internally transfer to a more programming oriented job when the market picks up.\n\nObviously keep applying to programming roles, but maybe this is plan B or C.",
          "score": 2
        },
        {
          "body": "My portfolio and my github\n\n[https://github.com/kidpk](https://github.com/kidpk)\n\n[https://kidpk.github.io/portfo/](https://kidpk.github.io/portfo/)",
          "score": 1
        }
      ]
    },
    {
      "title": "Awful Interview Experience with ByteDance (TikTok)",
      "body": "This post is part rant and part warning to others who are considering working at ByteDance (the Chinese IT company that developed TikTok). The interview was with TikTok Japan.  \n  \nLast week I was approached by a recruiter working for ByteDance who told me that they were impressed by my work history and wanted to interview me for a manager vacancy they had in Tokyo.\n\nThe description of the job itself was somewhat vague but the pay package was attractive, so after a few friendly messages back and forth, I agreed to a casual chat online via Lark (which is basically ByteDance's version of Zoom or Teams).\n\nI then set about researching ByteDance and the culture there to see if I could find any red flags from current or previous employees. Long story short, I found quite a lot. The majority of the issues seemed to surround the corporate culture, which is primarily driven by unethical Chinese managers, with much of communication and documents being in Chinese and there being a strong '996' (work from 9 am to 9 pm 6 days a week) mentality at the company. I thought I would use the \"casual chat\" as an opportunity to see if what I had read online was true and whether the job was actually worth pursuing.\n\nSo... the interview. Surprise, surprise, the person interviewing me was Chinese. She was also 5 minutes late and didn't apologize. All in all, not a great start. She then preceded to spend 10 minutes introducing herself in a really thick Chinese accent. I could barely understand anything she was saying. It got worse when she started asking me questions. Although it had been described as a \"casual chat,\" I was trying to maintain a polite interview-like manner throughout, but I had to constantly say, \"I'm sorry, I don't understand the question\" and \"I can't really answer that properly because I didn't fully hear the question.\" I soon realized what everyone online had meant about the language barrier at ByteDance.  \n  \nIn short, it was the most uncomfortable and least professional interview I've ever had. ByteDance is clearly just a sweatshop offering good salaries. Their slogan is \"Always day one,\" and by that I assume they mean absolutely chaotic. Despite being approached by a recruiter at ByteDance, the whole attitude was \"So why do you want to work here?\" Ultimately, I sent a message a few hours later politely explaining that I had decided to withdraw from any future interviews. A message to which I have still received no response to (very professional). I'm sure there are people out there who have had good experiences with ByteDance, but I just wanted to put my experience out there for anyone in a similar situation as me in the future.\n\n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1pepwag/awful_interview_experience_with_bytedance_tiktok/",
      "comments": [
        {
          "body": "Are you sure it was legit? Those recruiters in my world that are impressed by my work experience are usually either scammers or fishing for my info.",
          "score": 10
        },
        {
          "body": "The tech field in America is full of people with heavy accents lol.  Every interview I’ve had, or every tech company I have worked with, they’ve always had people with accents. \n\nThe “why do you want the job” question is a classic. It doesn’t matter if they approached you.  Why would you take the interview if you’re not interested so they want to know that you are interested. Personally, I always research the company or the account that I am interviewing for to have some answer for it. \n\nMost big tech companies have a 24/7 culture so it’s pretty normal. And Japan is one of the biggest workaholic cultures soooo it’s pretty normal.",
          "score": 1
        },
        {
          "body": "Sorry, why do you want to work here, and you're made about being asked that? \n\nThat is the most basic ass interview question. Doesn't matter if you're new to the game or extremely senior. \n\nSo what if you were approached. You still need to convey interest and explain how you'd fit into the role.",
          "score": 0
        },
        {
          "body": "Bro you're soft af. I just had an interview at a global pharma company. Interviewer was late 15 minutes, then rescheduled saying she had an urgent thing to do. Then rescheduled again and again over the next 2 days like 6 times, each time about 30 minutes before we were supposed to have the interview. I'm not complaining. I learned to adjust. It just makes me less interested in the job.\n\nYour bitching is about shit that is trivial. If you don't like working hard with some language barriers for good pay then just duck out. Like how is any of this a \"surprise\"? You just sound stupid.",
          "score": -12
        }
      ]
    },
    {
      "title": "How to make job interview prep as addictive as TikTok and doom scrolling?",
      "body": "[leetiktok.com](http://leetiktok.com/)\n\nFound one way to make prepping for tech interviews as addictive as TikTok, IG Reels, YT shorts. Made an app for that\n\nU think its trash or ain't too bad?\n\nAnyway, any tips to actually be addicted to prepping for tech interviews?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ikshcf/how_to_make_job_interview_prep_as_addictive_as/",
      "comments": [
        {
          "body": "ChatGPT",
          "score": 2
        }
      ]
    },
    {
      "title": "My job search: how I got flooded with 6-fig job offers (1 YOE) without applying anywhere. An idiot-proof guide to making the job search unfair for other people.",
      "body": "While the title is technically true; I hired someone to send applications on my behalf - a data entry guy i found off upwork for $3 an hour. But more on that later. Here's a guide on how I did it.\n\nBackground about me: I came from a non-cs background, WITCH 1 YOE, 1.5 year sabatical to travel. If you can't use this method to get a job; it's your fault. You fail when you give up.\n\nAnd before you start making excuses about how you don't have the experience to get your foot in the door... Software is the EASIEST field to build up a resume in. Especially with ChatGPT.  With a few weeks of work, you can bang out an impressive resume with 2-3 solid tech projects.\n\n# Step 0a: Productize yourself.\n\nYou are a resource for these companies. They don't care about who you are. You need to make your resume seem like you were born for this position. Pick 5 job postings that are semi-related and mash the keywords together and make projects about that. I'm a data engineer so these were projects that show how good I am at Python, SQL, and ETL stuff. DON'T FIND GENERAL SOFTWARE ENGINEERING PROJECTS. You compete with WAY less people if you niche down. Even if you don't know what you want to do long term, just pick something and build yourself around that. It could be around LLM's, data engineering, embedded, anything. Just make sure you NICHE DOWN. Your projects should make it look like you were sent down from god just to perform this role. I promise you, this will be what makes your resume get picked up. People want to be confident that you can do the responsibilites of the job.Don't go into the interview saying stuff like \"uhh umm i guess i can build an API for you guys\". If API building is on the job description you better goddamn have experience building API's. It doesn't have to be pretty, get chatGPT to help you.\n\n# Step 0b: Write down what you want\n\nI came back and added this, but this is EXTREMELY important.\n\nThis might seem like something out of choosing beggars, but I promise if you follow this method, you will need this. You need to understand what you want from a job. Do you want the job to be remote. How much do you want to make? What do you want the team to look like (I didn't know this). Do you want a team that values autonomy? etc.\n\n# Step 1: Applying\n\nNow that you understand you are a resource to this employer, find a data entry person on a freelancer site (I used upwork). You can find people in the Phillipines or Pakistan who would be GRATEFUL to get $3 an hour sitting at home filling out forms. It's way better than making $10 a day carrying bricks. Seriously, I got 20 applicants 5 minutes after posting the job. Just make sure their English is decent and pick a random person with good reviews.  (See how the hiring process is? This is why you have to niche down). For upwork, turn the time tracker feature on.\n\nGive them a list of jobs that interest you and make sure they find more jobs like that. I gave my guy my linkedin account (Don't worry. They won't post porn on your linkedin). Make sure they put the jobs that they apply to in a google doc. Make sure you check a few of these jobs to make sure they are getting good fits. At the start, it won't be amazing matches, but you need to give them feedback. (200 applications doesn't mean anything if it's to director level embedded positions if you're a DE with 1 YOE). After they get trained and find your rhythm, congrats! Don't let  off the gas. Even if you're final stage interview with 20 companies. Don't stop until you have the offer letter.\n\nFor applying, you want to make it as easy as possible for them. I like the simplify chrome extension (it automates filling fields for job apps). That + someone who knows how to find and apply to jobs for you means infinite job interviews.\n\nFor the labor he did, I ended up paying him $300 total over 2 months with a $500 bonus from my first paycheck to incentivize him doing a good job. (He was working 3 hours every weekday). If you're a cheap bastard who doesn't want to invest in your own job search, good luck. I don't know what to tell you. Even if you're shit ass broke, drive uber or go work in an amazon warehouse. One hour there is worth 7 hours of the data entry person.\n\nA lot of people dont realize this, but filling out applications is the LOWEST ROI activity to do in your job search. You want to be perfecting your \"sales script\" for each interview. The faster you can train someone to find relevant jobs for you and apply, the better. I personally had him use a chrome extension (simplify) to autofill job applications that he found on Linkedin. Now on to the job application process. Or why you're shit at interviewing\n\n# Step 2: Passing interviews\n\nDO NOT RAWDOG THE INTERVIEWS I REPEAT DO NOT RAWDOG THE INTERVIEWS.\n\nYou MUST have a script for each interview you do. You cannot hesitate. You need to be confident why you were born for the job.\n\nInterviewing for jobs is like sales. It's a funnel. You have to date 100 girls before you find the one you want to marry. And if you marry the first girl you date, she's probably ugly and will abuse you. So don't let off the gas and KEEP INTERVIEWING.\n\nI interviewed at around 30 companies before I found the job I wanted. The interview process at companies is generally the same, but it varies from place to place. Here is the flow:\n\n\\- screening call (hr) - talk about why you were born for this position and why you like the company. You should pass this about 50% of the time.\n\n\\- hiring manager call - usually a bit more technical. you need to get chatgpt to act as a senior engineer and ask you things about your resume. You should be able to talk about tradeoffs and explain your projects well.\n\n\\- tech screen - this is where CTCI/leetcode/stratascratch comes in. I'm a DE so I needed to solve easy python alg questions and medium SQL questions. Also don't equate difficulty of the interview to quality of the company. Stop thinking this way. I've had so many ugly ass girls with shit personalities give me such a hard time while wife-material cuties made it easy to like them. JUST DO THE NUMBERS. On the other side of the coin; I had absolutely shit companies give me hard interviews while better ones gave me easier ones.\n\n\\- culture fit - just vibe with these people. if it wasn't meant to be, it wasn't meant to be. I was talking about tiktok during mine.\n\n\\- engineering manager interview - you are pretty much done here. Make sure you ask questions for stuff that's important to you. You've pretty much won the game at this point. Make sure this company is some company you want to work for. I've thrown interviews at this point because the culture was shit (you'll know when they talk)\n\n# Step 3:\n\nCongratz! Enjoy not being poor. But don't marry the first girl/guy/xe/xhem you date.\n\nEdit: This was a few months ago during the peak of layoffs. Many interviews were cancelled. You have to keep pushing",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1651xi5/my_job_search_how_i_got_flooded_with_6fig_job/",
      "comments": [
        {
          "body": "The grifter energy in this post is overwhelming. Was this whole post written with chatgpt?",
          "score": 47
        },
        {
          "body": "Here's my translated summary of what OP wrote:\n\n1. Hire somebody to send your applications for you. Which is basically like talking to recruiters.\n2. Only applies to people who like females. If you don't like females, you won't be able to do this step.\n3. Finished.",
          "score": 15
        },
        {
          "body": " What kind of shit are you on ? I think I need some too….",
          "score": 21
        },
        {
          "body": "If there are no metrics for your job search, I'm going to assume this is a troll post because it sort of sounds like one.",
          "score": 4
        },
        {
          "body": "+1 for the entertainment and lols",
          "score": 2
        }
      ]
    },
    {
      "title": "TikTok MLE Hiring Manager Round",
      "body": "Hey ya'll. I have a tiktok hiring manager round soon. Is there anything I should expect for the interview?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1gfh3m0/tiktok_mle_hiring_manager_round/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Little to no work at defense contractor",
      "body": "I joined a defense contractor last fall after graduating and since then, I've had a weird experience. \n\nWhen I joined my manager had lined up hourly allocations for me to split time between contract work and R&amp;D, but the contract work required clearance so I was spending ~50% on overhead. 2-3 weeks into the job, the R&amp;D project funding gets cut and I'm essentially 80% on overgead. I'm able to bother enough people frequently enough to get tictac tasks every few weeks but nothing consistent.\n\nClearance was granted, then my contract hours were marshalled for people to work on a higher priority project, leaving me SOL. In January, some folks left the company and I picked up some of their work leaving me at ~25%. Is this an experience other people have had with contractors?\n\nBefore the inevitable advice- I'm not just sitting around on TikTok throughout the day. I'm applying to other jobs, doing interview prep, and upskilling with Udemy just in case the company realizes that I'm currently dead weight. Every chance I get, I'm reaching out to people to get tasks and resources and calling out my efforts and lack of allocation to my manager.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ax8y57/little_to_no_work_at_defense_contractor/",
      "comments": [
        {
          "body": "I had a similar experience when I started. In my case, they were basically waiting for a new project to start up. Once that got rolling, I had lots to do, but it was mostly make-work for my first 4-6 months or so.",
          "score": 12
        },
        {
          "body": "&gt;*I'm applying to other jobs, doing interview prep, and upskilling with Udemy just in case the company realizes that I'm currently dead weight. Every chance I get, I'm reaching out to people to get tasks and resources and calling out my efforts and lack of allocation to my manager.*\n\nGreat initiative on your part. You're doing exactly what you should be doing during this lull time.",
          "score": 12
        },
        {
          "body": "It's very common in defense to be sitting on your hands if your new. 1. Get clearence 2. Funding for a project.",
          "score": 8
        },
        {
          "body": "My second job out of school, I was a government sub contractor.\n\nI started the position literally the same week everything shut down.\n\nWent from being an in-person position to remote.  I only stayed for a year and a half.\n\nI left for more money and because I felt I wasn’t learning anything.\n\nIt seems like the government sector is behind and moves slow.  Poor place to be for early career.  Little opportunity for growth and extremely slow to happen as well, plus lower-middle-of-the-pack pay.",
          "score": 2
        },
        {
          "body": "It's somewhat normal. You now have real experience on what working at a defense contractor is like, and you can comment on post where people try to say going into defense is a magic bullet that will solve all their problems.\n\nThe other thing to look out for is if the job description matches the real work. I seem to recall someone posted on this sub in the last year saying they were an integration engineer or system engineer, and it just meant doing documentation.\n\nGlad to hear you are studying, and hope work either becomes interesting/relevant, or you find something else that works out better.",
          "score": 2
        },
        {
          "body": "Keep doing what you're doing. But stop asking for more work. You're not gonna learn anything as a government contractor. They hire bottom of the barrel engineers (no offense, but this is well known). As long as they keep paying you, you can get better all on you're own.",
          "score": -5
        },
        {
          "body": "Yep. Waited 7 months for a project.\n\n\nMade the best of my time gaining two certs and upskilling LOTS.",
          "score": 1
        },
        {
          "body": "Yep. Waited 7 months for a project.\n\n\nMade the best of my time gaining two certs and upskilling LOTS.",
          "score": 1
        },
        {
          "body": "Are you getting paid while they’re busy landing contracts?",
          "score": 1
        }
      ]
    },
    {
      "title": "Flopped a job interview by opening my phone",
      "body": "Thought this was a funny story to share. I had a great 2nd round job interview and I thought it was my best interview I’ve ever had. I had great conversation with the interviewer and we agreed on everything. When he asked me for my availability on a certain date, I went to open the calendar in my phone to see what day that was. When I did, my TiKtok opened up and blasted, “EVERY KID WITH AUTISM“ over and over again so I naturally freaked out, yelled in a panic, and threw my phone.\n\nI did not hear back haha.\n\nNatural my family thought it was hilarious haha. Lessons were learned that day RIP.\n\nEDIT: I did ask if I could open my phone to check the calendar! My body did move on its own to toss my phone to the side. I did apologize to the interviewer and he laughed. It was not professional haha, that’s why lessons were learned that day. I’m also neurodivergent, so my feed is about managing life as a neurodivergent but now it’s mainly memes.\n\n  \nEDIT 2: GOT A JOB OFFER! Take that haters! 😎",
      "subreddit": "jobs",
      "score": 1517,
      "url": "https://reddit.com/r/jobs/comments/1iwk7hr/flopped_a_job_interview_by_opening_my_phone/",
      "comments": [
        {
          "body": "This is why I always turn off my audio when I'm not using it, and check it like a freak. ",
          "score": 611
        },
        {
          "body": "&gt;so I naturally freaked out, yelled in a panic, and threw my phone.\n\nAs one does. ![gif](emote|free_emotes_pack|joy)\n\nEdit: Some of these people got no chill. Link to that TikTok, pls. :)",
          "score": 218
        },
        {
          "body": "Commenting just to say yes that is very funny. And glad you have a great attitude about it. \n\nSince apparently the other commenters on here are judgmental perfect human beings who never make mistakes…",
          "score": 100
        },
        {
          "body": "Lmao while interviewing for a summer camp job I was asked what I would do to ensure safety at the pool and I rambled about sunscreen and how important it was....",
          "score": 40
        },
        {
          "body": "Hahaha just found the video on tiktok, that is pretty funny lol.",
          "score": 57
        },
        {
          "body": "Yea OP shit happens.\n\nI remember being in a meeting, my colleagues phone just quietly goes \"I'm pickle rick\".  I tried to keep a straight face because it was an important meeting and I was crying I was internally laughing so hard and my colleague saw the one tear and just started dieing laughing.  He got in shit for it, I did not.",
          "score": 23
        }
      ]
    },
    {
      "title": "TikTok Shop Strategy &amp; Analytics Associate Interview ",
      "body": "Has anyone interviewed for this position for the team in Seattle? / can provide insight into the interview process?\n\nTikTok Shop Strategy &amp; Analytics Associate Interview ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1fc8c3k/tiktok_shop_strategy_analytics_associate_interview/",
      "comments": []
    },
    {
      "title": "Live cases in TikTok S&amp;O interviews",
      "body": "Can anyone here please share their experience with TikTok S&amp;O interviews? I would love to know more about the format of the live cases - how similar / different are they to the classic consulting cases? And how can one differentiate themselves and nail it?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1d9y48i/live_cases_in_tiktok_so_interviews/",
      "comments": []
    },
    {
      "title": "Can someone tell me whats wrong with my resume?",
      "body": "I know my experience is all over the place, but I originally planned to go into book publishing only to be confronted with extreme challenges/competition and location issues. Since then I've been struggling to find my niche and have been applying to jobs that focus on my adobe cloud/web design knowledge or just general office assistant positions. I did have an issue with a job I got hired at about a year ago and ended up quitting on the spot and am starting to wonder if that is affecting my chances. I didn't include that because it was less than a month and we didn't part on good terms.\n\nI haven't gotten a single interview or call back except for a temp position that immediately rejected my resume after asking for a video interview. PLEASE HELP!!! I don't want to stay in this lab position forever.",
      "subreddit": "jobs",
      "score": 25,
      "url": "https://reddit.com/r/jobs/comments/1nrd1ej/can_someone_tell_me_whats_wrong_with_my_resume/",
      "comments": [
        {
          "body": "It reads like a wall of text. I would try to make it more concise and more achievement focused. “Wrote magazine that was read by X thousand students” or something like that",
          "score": 74
        },
        {
          "body": "I think it would be helpful to know what job you’re applying for. \n\nGo through and change some of those first words so that they aren’t the same, I see wrote and managed a few times. \n\nMake each bullet point shorter / more concise. \n\nPut all of this into one column. I would probably delete the fourth previous job if that doesn’t fit, or make it extremely shortened.",
          "score": 13
        },
        {
          "body": "theres some inconsistent tenses used and some bullet points are too wordy, some too vague, and some sound like daily checklist you write on a sticky note. also since youre applying to office assistant/coordinator type positions, have the most bullet points to the jobs most closely related to the position and the least bullet points in unrelated positions. I'd say the public library work and writers house position fit best, followed by the production tech.\n\ndo you live in a very blue or red area? i hate to say it but that can be affecting things. i live in a more red area and if i had your resume i would very much feel uneasy putting the cert and the pride center position on my resume. it sucks but there is just a higher chance for the person looking at it to favor the side who hates those things and would read them and roll their eyes. and they can very easily just pass it off as \"not a cultural fit\". also just implicit bias could factor in.\n\nsome of your skills are very wordy. and I'd err on the side of caution and stick to 1 column rather than having 2 columns.\n\nalso just purely imo, a good cover letter can help a lot when changing fields",
          "score": 12
        },
        {
          "body": "There are lot of black marks on it.",
          "score": 20
        },
        {
          "body": "It all feels overly vague.",
          "score": 9
        },
        {
          "body": "Poor grammar (inconsistent tenses) and no results of what you did. Reads more like a to-do list than a summary of impacts and accomplishments. \n\nI also suggest uploading to Gemini or ChatGPT. I wouldn't ask it to rewrite the whole thing since that will be obvious. \n\nFirst, do you best at adding actual results. % revenue or efficiency increases, things like that. \n\nThen give AI the job description you're applying to and ask it to \"proofread and critique my current resume, making suggestions to improve readability. Suggest word choices that would it make it a better fit for the following job listing without actually changing my experience or qualifications: [paste in job listing]\" \n\nI work for a big tech company, and this is more in line with how I use AI for important work, not just \"write this for me.\"",
          "score": 9
        },
        {
          "body": "Tailor your resume to the job you're looking for\n\nFor instance if looking for an IT job, it isn't necessary to list how you worked as a server in a restaurant (just a random example) \n\nIf you're looking for a standard office job that doesn't relate to your resume, you may want to take some of those things off. Or at least rewrite it so it relates to the office job you're looking for.",
          "score": 3
        }
      ]
    },
    {
      "title": "Finally got a software engineering job 1.5 years out of graduation! Wanted to share some of the things I did",
      "body": "Hey everyone! I’ve been sick of this job market ever since I graduated, having applied to at least 600 jobs (probably more), but I just received an email to start next month at a Fintech company as a software engineer! The hard work has finally paid off and this subreddit and a couple others have been very helpful, so I thought I’d make a post and give the rest of you guys some hope to not give up and keep getting those applications in because I was very close to doing a masters lol.\n\nI’ve written down below what I did and I know it’s all over the place but hopefully this can help some of you:\n\n* Started applying only to jobs posted within the past 48 hours and jobs that I strongly believed my skills and background complemented the most so I stopped applying to jobs where I only had half the requirements for example now I focused on jobs where it was very easy for a recruiter to see how great of a fit I was\n* Only used LinkedIn to find jobs and then applied directly on the company site\n* Used ChatGPT to review my resume against the job posting and see which keywords I’m missing, but that’s the only AI I used\n* Connected with the HR team on LinkedIn once I applied\n* Messaged like 10 people who had the same role either one year or two years ago to introduce myself and chat further but only one responded back and the response was very generic basically saying to know the company and the core values well for the interview but this allowed me to at least get my name out there somewhat and I also referenced this brief conversation during the interview to showcase my proactiveness which I think helped\n* My resume and cover letter were uploaded both as a PDF and as a DOC because some websites have formatting issues, and I didn’t want to risk it \n* Sent a thank you email after the interview, and was tempted to email a follow-up since I hadn’t heard back in a couple of weeks, but decided not to\n* For the behavioral portion of the interview, this [video](https://www.youtube.com/watch?v=fr-mwiyhZAo) was very helpful all the questions were a variant of these ones so I had at least two stories that I could bring up for each question\n* The resume template I used was from this [guy on TikTok](https://www.tiktok.com/@mynamemaaz/video/7581341964159782152). His other videos also helped me during the application process\n* The cover letter template I used was from this [Youtuber](https://www.youtube.com/watch?v=NUhDP30IRKk) and I tried adding my own spice to it because I didn’t want it sounding too generic\n\nSo these are the things that I did that I can think of right now, honestly it’s mostly a number’s game but thought it was worth sharing!",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1pz7hjr/finally_got_a_software_engineering_job_15_years/",
      "comments": []
    },
    {
      "title": "Rejected at TikTok after 4 full interviews + reference background check, do they consider for other positions after ?",
      "body": "It took 1 full month from the recruiter screening to the final hiring manager interview 4 rounds , background and reference check only to get a NO at the end :( is this normal ? My first time getting an interview at a tech giant . Ofcorse I’m grateful for the opportunity and felt like im progressing .. but the NO kinda shook me. Do they ever consider or reach out for a different open position? Or forget about you once rejected ? Thank you ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1e0xcvm/rejected_at_tiktok_after_4_full_interviews/",
      "comments": []
    },
    {
      "title": "Is it normal i feel like i wanna quit just after 3 weeks?",
      "body": "So i started a new job 3 weeks ago in a software company and every day feels like torture. Everyone around me is busy, confident, and talking in high-level technical terms I don’t understand. Meetings go on for hours and I can’t follow a single word.\n\nI came from a totally different background, so even the “simple” tasks my manager gives me are hard because my starting point is so far behind. I’m introverted and work best with clear, independent tasks but this role is all about talking to many people, asking questions, and constant collaboration. I don’t even know what to ask because I don’t understand the basics.\n\nIn my last job, I had someone training me step-by-step, so I could build a foundation. Here, I’ve been told to “just ask around” and figure it out. Being surrounded by work and conversations I don’t understand makes me feel useless, stupid, and anxious. I cry at home almost every night, and weekends are just me dreading Monday.\n\nEveryone keeps telling me “it’s normal” and “you should be grateful” but this feels way beyond normal new-job nerves. I want to quit but i also dpnt have any job lined up for me but i can’t imagine surviving here for months. I’m lost.",
      "subreddit": "jobs",
      "score": 75,
      "url": "https://reddit.com/r/jobs/comments/1mmdyf5/is_it_normal_i_feel_like_i_wanna_quit_just_after/",
      "comments": [
        {
          "body": "I’ve had jobs like this (so fragile and crying nights and weekends at the start). What I will say is it always gets better - and it can be quite empowering to stick it out and get through it.",
          "score": 21
        },
        {
          "body": "I’m so sorry you are going through this. It is happening to me too during my internship and I keep being compared to other interns to make matters worse. If I were you, I would try to survive one more month. Then see if you can survive another, if things keep getting harder, then start looking for a different job.",
          "score": 27
        },
        {
          "body": "Some good advice here, the technical knowledge may take time. In the meantime I recommend doubling down on being a great colleague and employee - particularly try to make a huge effort for regular and clear proactive communications with bosses and colleagues.",
          "score": 12
        },
        {
          "body": "Yeah it sucks, but it is normal. Communication and collaboration are a big part of the job and are also skills you have to learn.",
          "score": 8
        },
        {
          "body": "Don't give up. You will get there. It can take time to absorb something new but once you do it will be worth it.  Try and read some industry magazines , follow youtube channels and just try and learn the jargon. Follow the money flow. For example how do they make money. What do they sell/offer? What do they need to do to sell/market better? How does your role help them achieve that? Take care and good luck.",
          "score": 8
        },
        {
          "body": "Every journey starts with a first step.  You are learning and learning takes time.  Everyone feels like they are floundering in a new job, especially if you are starting a new career.  This is an environment where you are expected to be a self-starter.  That is the best skill you can develop for success.  Lots of introverts are self starters.  It feels uncomfortable now but it will get a little better each day.  Hang in there and good luck!!",
          "score": 13
        },
        {
          "body": "You’ve been given permission to ask around and you haven’t been doing it?",
          "score": 7
        },
        {
          "body": "What is your role?",
          "score": 6
        },
        {
          "body": "Hey there! You GOT a job in this crazy market - congratulations!  A new job always feels a bit like this these days, unfortunately. The days of formal training has been over for quite some time.  \n\nMy advice would be to power through until you figure it out. Keep a notebook and jot down terms so you can do a quick search when you get back to your desk - better yet, ask a colleague to a formal working lunch, or to a happy hour and ask them questions informally about how to navigate the company and be prepared with what you want to ask!  \n\nEvery workplace has its own jargon and acronyms.  Speak up!  Ask what they stand for if it’s integral to something required of you today.  Not knowing will just put you back further.  True story: I started a new job a few years ago and it was similar to this - people would continually use terms that I had zero clue about, but often, when I would ask in the meeting what they were, other people would then chime in with an “I was wondering too.” If you don’t ask, they assume you know. Just be sure to write it down so you don’t ask the same thing twice.\n\nOnce upon a time, people explained things, there were new hire classes, etc. However, I’ve had jobs in which it quickly became clear that my interviews were the only “training” I would ever get and it was all learn-on-the-job — and fast. Every time, I went back, dug in on my interview notes, did some research, and made a plan.  I was once handed a plane ticket on my first day and was told by my boss that she’d see me in two days at the destination, no instructions - I didn’t even know if hotels had been booked or the address of the foreign office. I held a meeting with my staff who’d done similar trips to get the details, and hounded my boss’s assistant for the travel arrangements.  But I did it, and that turned out to be one of the best jobs I’ve ever had in my entire life.\n\nThis isn’t school. This is the real world.  There is no hand-holding.  To be successful, and to better your mind-set, you need to quit defeating yourself by telling yourself you are introverted, and you can’t do this — and instead take a deep breath to re-set the frame.  This company believed in you. They are giving you a chance - a start!  You can be defeated and frustrated, or you can make a plan of how to navigate the situation.  If I were you, I’d decide to learn as much as humanly possible, would make some allies for future work references, would try to make some work friends to make it more bearable — and knowing you are introverted — find ways to best function when challenged with tasks that require multi-departmental collaboration.  Every time you exercise this, it will get easier (I know!).\n\nUse your weekends and evenings to re-set and relax.  If you are a gym-goer, don’t miss the gym and make it a priority to re-center yourself a little every day. Get outside for a walk. Read a book. Watch a movie. Whatever it is you do to re-set. \n\nEvery job will teach you something!  This one sounds like a challenge for you, but you haven’t mentioned hazing or toxic individuals or teams - so dig in.  Every job has a learning curve, some steeper than others.  Maybe you can figure out if there is a role at the company that is more your speed - but to find that, you need to learn more!\n\nAnd again, congratulations on finding the job!!  And good luck as you learn new skills and how to navigate new systems and your organization. You’ve got this!!",
          "score": 6
        },
        {
          "body": "I’m not sure why you are not investing in yourself. You should be spending weekends and evenings studying in this new field, not for forever, just until you can start to catch up. Watch some you tube videos and take cheap Coursera classes online. To help improve your specific knowledge SO you aren’t dreading going to work.",
          "score": 8
        }
      ]
    },
    {
      "title": "A different job search experience than I expected (Success Story)",
      "body": "I know the job market is brutal right now. Mass layoffs are real, and a lot of people are struggling. I’m not sharing this to gloat or invalidate anyone’s experience. I’m sharing because the online conversation can become such a doom spiral that it almost stopped me from trying at all. I hope this gives someone a bit more confidence to take a step they’ve been hesitating on.\n\n**Background Context**\n\n* 10 years work experience\n* 5 years project management experience\n\n**My Timeline**\n\nIn 2025, I really wanted to leave my full time, remote marketing agency job to pursue freelancing/consulting. But between Reddit threads and LinkedIn posts, it felt like everyone was screaming *“Don’t do it, you’re insane.”* Still, I couldn’t shake the feeling that I’m not built for a traditional 9-5 long term. I told myself: If I try and fail, I'll end up exactly where I started.\n\n  \nEarly-mid 2025: Researching and consuming a ton of content in my field. Learning from others. Started posting on TikTok. Felt cringe at first. Now have a whopping 5k followers 🤣 I'd like to grow this to an additional income stream but it's not my main focus.\n\nBehind the scenes, I worked on what I could: marketing materials, pitch decks, freelance platform profiles. I started seeing some traction, but my full-time job was so draining that it was pulling all my creative energy away from the thing I actually wanted to build.\n\nNovember 2025: Quit my full time job to go all in on this - with 0 clients. Most people said \"good for you\" while they hung on to their miserable jobs for dear life. I want to recognize my privilege here: I had a year of expenses saved, and I’m married. My husband and I agreed he’d cover the majority of expenses while I tried this. I know not everyone has this safety net, and I’m not pretending otherwise.\n\nDecember 2025: Went HAM reaching out to potential clients, freelance roles, networking, etc. The fear and self doubt were loud. Reddit didn’t help. But I kept going anyway.\n\nJanuary 2026: Landed a 1099 remote PM role at $85/Hr with a flexible schedule. Yes, I will have to pay my own taxes/healthcare, but after running the numbers, I will make more than I did in my full time job. \n\n**Lessons Learned**\n\nIf you’re trying to change your situation, clarity and visibility matter more than perfection.\n\nYou have to:\n\n* Get clear on what you’re offering and/or targeting\n* Make yourself visible\n* Be willing to feel uncomfortable\n\nThis market often requires a reframe, not just more applications.\n\n**Two real world examples...**\n\nExample 1: This girl on TikTok is constantly complaining about the job market and picks up freelancing gigs to support herself after 14 months unemployed. I commented, \"Have you ever thought about going ALL in on the freelancing, and stopping with the FT interviews?\" She goes \"well, building a business is unpaid labor.\" I am like bro, you are unpaid ANYWAY!?!? All that time she could've been building something else but instead she was dead set on fitting a square peg in a round hole and complaining on the internet in the process.\n\nExample 2: I have a college friend who's also been unemployed just as long. She calls herself an \"Entry-level/university recruiter\" (that's what she did for years before her layoff). She \"likes\" so many posts on LinkedIn about unemployment, lay offs, *'woe is me',* etc. but NEVER POSTS CONTENT HERSELF! First thing, the demand for entry-level job recruiters is very low, perhaps it's time to pivot? Secondly, she's missing a huge opportunity to share more about her approach to recruiting and her care for the candidate experience on a public platform, yet remains silent!\n\nI know these things are uncomfortable. But you know what's also uncomfortable? BEING BROKE! \n\n**Conclusion**\n\nI’m not saying this path works for everyone. Circumstances absolutely matter. But I also think it’s fair to say that Reddit and LinkedIn skew negative because people usually come here to vent. Folks who are doing fine aren’t typically writing posts about it. I felt compelled to share my perspective considering where I was a year ago and how unexpectedly quick this worked out for me.",
      "subreddit": "jobs",
      "score": 5,
      "url": "https://reddit.com/r/jobs/comments/1qc6wfw/a_different_job_search_experience_than_i_expected/",
      "comments": [
        {
          "body": "Agree completely that people use social media to vent about their difficulties instead of genuinely looking for help lol. Which is valid, I get that it's nice to vent and be frustrated, but that can't be the end of the journey.\n\nI posted something about a different approach to job hunting than the \"put out ten thousand applications a day and get lucky\" tactic by building and leveraging a network. People immediately downvoted me and were hella skeptical.\n\nI will say, it does sound like you went all in on being a content creator / freelance but then pivoted back to FT work anyways? Even if it's flexible I'm guessing it's technically a FT job.",
          "score": 1
        },
        {
          "body": "What do you post on Tik-tok? I was thinking of posting my experience with getting diagnosed with Autism on Instagram. But am unsure of what direction to go from.",
          "score": 1
        }
      ]
    },
    {
      "title": "Tiktok live Agency Operation Manager",
      "body": "Hi everyone,\nMy friend is gearing up for their third interview for the Live Agency Operation Manager role at TikTok, and this round is with the Team Leader.\nThey've passed the initial two rounds, which focused mainly on behavioral questions and basic platform knowledge. We're expecting this final interview to be highly strategic, focusing on leadership, operational excellence, and agency growth management.\n\nFor anyone who has experience in the TikTok Live ecosystem or has interviewed for a similar management/operations role:\n\n• What are the top 2-3 strategic questions they should be prepared to answer? (e.g., related to compliance, scaling, or agency incentive structures).\n• What leadership qualities does the Team Leader typically look for in this specific, high-growth environment?\n• Should they expect to discuss specific LIVE KPIs (like UV, GLR, or Watch Time) and how to influence them?\nAny insights, common pitfalls to avoid, or specific examples of successful strategies would be greatly appreciated.\nThanks in advance for the help!\"",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1p69e5b/tiktok_live_agency_operation_manager/",
      "comments": [
        {
          "body": "ChatGPT for the win!\n\n Here’s a strong, insider-caliber prep guide for a TikTok LIVE Agency Operation Manager – final round (Team Lead) interview. This is typically the most strategic and evaluative round, where they assess: Can this person run an agency portfolio at scale, improve KPIs, and lead creators toward predictable growth?\n\nBelow is exactly what they should expect and how to prepare with crisp, high-impact answers.\n\n⸻\n\n✅ Top 2–3 Strategic Questions They Should Be Ready For\n\n1. “How would you grow the performance of under-performing agencies?”\n\nThis is extremely common.\n\nWhat they’re looking for:\n\t•\tUnderstanding that TikTok Live agency performance = talent acquisition + talent activation + talent retention + monetization optimization.\n\t•\tA structured framework.\n\nA strong outline:\n\t•\tDiagnose: Audit GLR trends, UV, Watch Time, retention, content type, creator consistency; identify top-of-funnel vs mid-funnel vs monetization issues.\n\t•\tSegment: Separate agencies into tiers (high potential, stable, salvage).\n\t•\tIntervene: Create custom training, weekly data reviews, playbooks, incentive tweaks.\n\t•\tEmpower: Deliver tools, scripts, Live room best practices, seasonal strategies.\n\t•\tMeasure: Set 90-day KPI goals for each agency.\n\nThey LOVE frameworks.\n\n⸻\n\n2. “How would you create an incentive or compliance structure to ensure long-term agency health?”\n\nThey want to see that you understand:\n\t•\tAgencies respond to clear incentives.\n\t•\tCompliance isn’t just rules—it’s behavior shaping.\n\nInclude:\n\t•\tIncentive levers: Bonus for consistent Live hours, conversion rates, creator retention, quality score, low violation rates.\n\t•\tCompliance levers: Training, proactive checks, monthly compliance drill-downs, quick escalation path.\n\t•\tBalance: “Protect platform integrity while enabling growth.”\n\nHit those words and you’re golden.\n\n⸻\n\n3. “What KPIs would you focus on first if tasked with improving an agency portfolio in 60 days?”\n\nExpect UV, GMV, GLR, Watch Time, Creator Retention, Activation Rate.\n\nA strong answer:\n\t•\tShort-term: GLR (gross live revenue), active creator rate, hours streamed.\n\t•\tMid-term: Watch time, retention, conversion events (Gifts/Recharge behavior).\n\t•\tLong-term: Creator lifecycle metrics, sustainable content strategy.\n\nThey want someone who understands KPIs don’t improve equally—some move quickly, some don’t.\n\n⸻\n\n🚀 Leadership Qualities TikTok Team Leads Look For\n\nThese are extremely consistent across Ops roles:\n\n1. Data-first, but not data-blind\n\nThey love managers who:\n\t•\tCan interpret dashboards.\n\t•\tTurn insights into concrete steps for creators and agencies.\n\t•\tCan speak to ROI clearly.\n\nPhrase to incorporate:\n“I use data to diagnose, but people-focused operations to execute.”\n\n2. High-speed execution\n\nTikTok Live is a hyper-growth, high-chaos environment.\n\nThey want:\n\t•\tSomeone who moves fast with imperfect info.\n\t•\tSomeone who can prioritize aggressively.\n\nExpected phrase:\n“I bias toward action, test quickly, and optimize based on early signals.”\n\n3. Coaching &amp; relationship management\n\nYou’ll be managing agencies who manage creators.\n\nThe Team Lead wants:\n\t•\tDiplomacy\n\t•\tScalability\n\t•\tAbility to hold partners accountable without damaging the relationship\n\nPhrase to include:\n“I set transparent expectations and drive performance through ongoing enablement + accountability.”\n\n⸻\n\n📊 Should They Expect KPI Questions? 100% Yes.\n\nThey should be ready to discuss:\n\t•\tUV (Unique Viewers) → How to increase top-of-funnel awareness\n\t•\tGLR (Gross Live Revenue) → How to boost monetization\n\t•\tWatch Time / Retention → How to improve content quality\n\t•\tCreator Activation\n\t•\tCreator Retention\n\t•\tAverage Stream Duration\n\t•\tConversion to First Gift\n\nExpect scenario questions like:\n“If an agency’s GLR is flat but UV is rising, what’s happening?”\nCorrect interpretation:\n\t•\tGood discovery\n\t•\tPoor monetization\n\t•\tFix gift prompting, content direction, CTA timing, interactive features\n\nor:\n\n“Watch time drops suddenly—how do you diagnose?”\nLook at:\n\t•\tContent changes\n\t•\tStream timing\n\t•\tCompetition in same tag\n\t•\tTechnical issues\n\t•\tNew creators vs established\n\nShowing you understand the cause-and-effect chain is key.\n\n⸻\n\n❌ Common Pitfalls to Avoid\n\n1. Over-focusing on creators instead of agencies\n\nThis role is agency operations, meaning scalability &gt; individual talent focus.\n\n2. Talking about “creative ideas” without tying them to KPIs\n\nEvery idea must connect to:\n\t•\tHigher UV\n\t•\tHigher GLR\n\t•\tStronger retention\n\t•\tMore hours streamed\n\t•\tLower churn\n\n3. Ignoring compliance / safety\n\nTeam Leads always check that candidates prioritize platform integrity.\nNever present growth strategies that skirt rules.\n\n4. Saying “I’d wait for more data.”\n\nTikTok Live moves too fast.\nPhrase instead:\n“I’d take quick directional action, then refine when deeper data arrives.”\n\n⸻\n\n⭐ Example “Perfect Strategy Moment” to Reference\n\nYour friend can drop this during any answer:\n\n“I use a 3-part growth model—Acquire, Activate, Monetize.\nFor agencies, this means:\nAcquire more qualified creators,\nActivate them with playbooks and training,\nMonetize through content optimization and feature use.\nThis structure keeps my strategies scalable across dozens of partners.”\n\nThey will love this.\n\n⸻\n\nIf your friend wants, I can also create:\n\n✅ A mock interview with high-probability questions\n✅ Sample “perfect” answers\n✅ A cheat sheet for LIVE KPIs and how to move each one",
          "score": 1
        }
      ]
    },
    {
      "title": "Any one have success with Massive? ",
      "body": "https://usemassive.com/\n\nI found this website on TikTok that auto applies to jobs for you after you fill out a form and upload resume. \n\nHas anyone had any success with this website? I am trying a free trial apparently it’s going to auto apply to 50 jobs a week for me. I just don’t know if I should trust it or if it will actually lead to any interviews. \n\n",
      "subreddit": "jobs",
      "score": 12,
      "url": "https://reddit.com/r/jobs/comments/1cwsw44/any_one_have_success_with_massive/",
      "comments": [
        {
          "body": "Honestly, I wouldn't really recommend it. Even though I like the company I work for and don't have any problems there, I sometimes go to interviews just to try my luck. It helps me improve my self-promotion skills and maybe I'll get an offer that makes me think about switching companies. But since my work life is really busy and I spend 10 hours a day at my job, I don't have much time to apply for new ones. That's why I use tools like these now and then. I used to use Sonara, but it wasn’t that great. They didn’t apply to jobs that matched me well, and the number of applications was low. After Sonara shut down, I tried UseMassive for 3 months (they only sell 3-month memberships, which is silly). I had the same problems, though the jobs were better this time, but still few applications. Even with their most expensive package, it was only 5-7 applications a week. For the last 5 months, I’ve been using Wobo AI. So far, this one works the best for me. It finds the jobs I really want and they’re at amazing companies (I’ve applied to Tesla, SpaceX, Reddit, OpenAI, etc.). It also answers questions really well on my behalf. It seems like products are getting better as tech moves forward, and I’m curious to see what’ll happen in a few years.",
          "score": 11
        },
        {
          "body": "Spent $240+ on Massive and not a single interview after hundreds of applications. I recommend either JobCopilot or Sonara for automated job applications. I'm getting decent results (interviews) with JobCopilot right now.",
          "score": 7
        },
        {
          "body": "50 doesnt even seem like much for something thats automated.",
          "score": 3
        },
        {
          "body": "How did it go for you",
          "score": 2
        },
        {
          "body": "Keep us updated on your progress. Curious to see how many interviews you'd be able to get within your trial period and beyond.",
          "score": 2
        },
        {
          "body": "OP, any success?",
          "score": 2
        },
        {
          "body": "It’s decent depending on the types of roles you’re looking for.\n\nThe new email system it recently launched needs a lot of work. For those who aren’t aware, Massive now applies for you using a neuronmail.io address. Accessing that inbox requires you to log into Massive. You get notifications in your actual email when you receive particular types of messages in your neuronmail box (such as interview requests, confirmations, and rejections). However, this sucks for two reasons:  \n1.\tThe notification you receive in your real email is generic. It has no details on the message.  \n2.\tThe classification system is not good. My buddy missed an interview because an interview confirmation email that arrived in his neuronmail box wasn’t tagged as a confirmation email, meaning he didn’t get an email in his real address notifying him of this.",
          "score": 2
        },
        {
          "body": "Stay away from this (see [https://www.trustpilot.com/review/usemassive.com](https://www.trustpilot.com/review/usemassive.com) ), it's not worth. Job searching is not a numbers game, the hard part is not applying for 50 roles a week. The hard part is getting noticed by the hiring team/recruiter, invest your time and money in that instead of paying $297 for this...",
          "score": 2
        },
        {
          "body": "but you know what else is massive?",
          "score": 2
        }
      ]
    },
    {
      "title": "Advice for an “eSkill video interview”?",
      "body": "I applied to an office administrative type job last week and got an email today inviting me to the next step, which is a “brief preliminary interview using eSkill video interviewing tool.” I have to do it within the next few days. I’m allowed 10 minutes to complete each question. It says candidates are given interview questions and have to record responses on the video platform. It says I will only be able to click the link once, so I want to make sure I know somewhat what I’m getting into. \n\nI tried looking up eSkill job interviewing stuff online, but most of it was people saying they had to do Excel or similar tasks. I can’t tell if that’s what the description of mine is getting at, or if it will just be questions that I have to verbally record myself answering because I have also seen people online have to do that. It also said to make sure that my camera and microphone are working which makes me think I’ll have to talk, but I also think it makes sense to give me 10 minutes per question if it is a task-based interview. I’m wondering how I can prepare for that. I finished grad school so I think I’m pretty good at typing and technology generally, but I’m not too savvy with Excel. I’m worried it might ask me to do something I don’t know how to do and I can’t imagine just essentially telling the camera “I don’t know how to do this” would go over well.\n\nI’ve also seen videos on tikTok lately of people having to talk to an AI person for their interview. That honestly creeps me out and I don’t want to do that.\n\nI guess I’m just looking to see if anyone has ever had to use the eSkill video interview and any details you could provide about the job you were applying for and what it specifically had you do, or if you had to answer questions what kind of questions were there. I would much rather just have a zoom call with an actual person so I can have a back and forth conversation that’s not being saved somewhere, so I already feel more nervous than usual about this. I’m not really in a position where I can be picky about job interviews though so any help would be so appreciated.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1nhz5vg/advice_for_an_eskill_video_interview/",
      "comments": [
        {
          "body": "I once had an eSkills interview with an executive position, and it was essentially a one-way video call: they'd give you a prompt on the screen, and you'd have about a minute to think about it, and then you'd record it. My interview didn't involve any Excel tasks, just questions like, \"Tell me about a time when you handled a conflict of priorities\" or \"How did you handle a difficult client?\" I'd practiced with Beyz and prepared STAR stories so I could hear what I was saying. If you're treating it like a mock interview in your living room, keep your answers clear.",
          "score": 1
        }
      ]
    },
    {
      "title": "Does Prep AI actually work?",
      "body": "Ive been seeing the app heavily promoted on tiktok and youtube but you have to pay to use it. Wondering if anyone has had any success landing interviews with it? Im currently still employed and I don’t have much time dedicated to submitting job apps so their swiping system would be alot of help for me😅",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1m1gbsm/does_prep_ai_actually_work/",
      "comments": []
    },
    {
      "title": "Fashion Job Market",
      "body": "I feel like I'm at my breaking point, though knowing me ill probably be back up again acting like I'm fine despite being beyond tired. I feel like I've done everything possible, I've gone to online network events when I had the chance, I've gotten certificate to put myself ahead one of them being the LVMH Certificate,  created a personal website and portfolio showcasing my skills and past work, I've network through LinkedIn gaining a referral at versace but didn't get the job, I post frequently on LinkedIn showcasing my skills passion and recent and past projects, I've cold message via LinkedIn, email,  as well as Instagram and tiktok,  I've gotten my resume review a handful of times, joined  apps apps for insisting with the job search proccess introducing myself and skills in hopes of networking and gaining opportunities, created custom cover letters, deeply analyzing and understand various luxury brands values and brand DNA, practiced interview questions for hours incase one day I don't hear back, created multiple resumes for different roles show casing my versatility in roles and often emailed following back on certain jobs. I've gotten a mentor who said it herself I'm one of the most prepared people that she has worked with and I took all of the advice she had given me. And even after I sent her my resume and portfolio to look at she said it looked professionally done and that she was surprised and impressed. I've had well-known fashion brands stalk my LinkedIn for two weeks in a row but never reach out for an interview. This has happened over and over again.  It's been over a year since I started applying to jobs, I get sad, get back up, and start working again, but I've been through this cycle for so long that I honestly don't know what else to do differently. It also doesn't help that most people around me don't believe that I can get a job in the fashion industry. I always try to my fullest and I will continue to but I honestly don't know where to go from here ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1mt5dqz/fashion_job_market/",
      "comments": [
        {
          "body": "I think this is happening in all creative fields, amongst others. Opportunities are the hardest things to find. Other people with friends or family connections will slip into fantastic jobs because of who they know.\n\nI've experienced similar results in independent filmmaking. Despite moving Heaven and Earth and talking with people in the industry, I had no leverage to open a door of opportunity.\n\nIf it's any solace, the people working in any industry aren't necessarily the best. They are simply the people with family and friend connections or, more rarely, the right place at the right time. Some people work their butts off to get there, respectfully, but most people fall into great jobs through networking.\n\nAlso, no one wants to admit the human interaction part of life, but some people look better and have natural social skills that the majority of people don't have. How people perceive us will affect how they interact with us. Someone might be able to do the best job in the world, but if the gate keepers don't like any part of you, you're not getting in.\n\nCan you start your own fashion line? Do you know a social influencer who can wear your creations? Can you make garments yourself? Do you know someone who can? Are there any media events where someone could wear your creation? Are there any media or acting schools in your area where you can network to have people wear your clothing?\n\nWear your creations! Look for media events and walk in the background. Art gallery openings? Wear your outfits and have your friends wear your clothing! Any movies filming in your area looking for extras? Show up dressed in your best piece.\n\nCreativity with the pressure of a paycheck breeds stress. I try to work a no stress job to pay the bills and continue doing my creative endeavors outside of work.",
          "score": 2
        },
        {
          "body": "Did you intern or freelance?",
          "score": 1
        }
      ]
    },
    {
      "title": "Post-grad job hunt stats",
      "body": "I just started my job earlier this month and finally got around to making this chart for myself to visualize!\n\nContext: 21y/o, just graduated in May 2025, been applying here and there since October 2024\n\nI definitely was not as locked in as I could've been throughout my senior year and this past summer, but it all worked out in the end! \n\nDidn't write cover letters (for any of the ones I got interviews @), didn't reach out to recruiters/employees/HR like I was told I needed to all over tiktok. \nGOOD LUCK TO EVERYONE WHO'S JOB HUNTING RIGHT NOW!!! If I can do it so can you!\n\nhttps://preview.redd.it/bryimpy9h6qf1.png?width=2000&amp;format=png&amp;auto=webp&amp;s=301b701d5290ff9ff6b3c74e7966d639799de7e4\n\n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1nldyum/postgrad_job_hunt_stats/",
      "comments": [
        {
          "body": "What’s your industry? And is your job in your degree field?\n\nCongratulations on your offer! Best of luck to you.",
          "score": 1
        },
        {
          "body": "Nice. 100 applications for one offer is a really good ratio from my experience",
          "score": 1
        }
      ]
    },
    {
      "title": "Does Prep AI actually work?",
      "body": "Ive been seeing the app heavily promoted on tiktok and youtube but you have to pay to use it. Wondering if anyone has had any success landing interviews with it? Im currently still employed and I don’t have much time dedicated to submitting job apps so their swiping system would be alot of help for me😅",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1m1gbxo/does_prep_ai_actually_work/",
      "comments": [
        {
          "body": "I feel like those are all ads, seems so repetitive",
          "score": 3
        }
      ]
    },
    {
      "title": "What am I doing wrong?",
      "body": "I graduated college in May of 2023. Since then I have not been able to get an Interview or a job. I have applied to what feels like thousands of Jobs and have not heard back from any of them. \n\nI have a degree in Economics and have had 2 internships that can be best described under real estate or mortgage lending. I have had my resume looked over by multiple peers as well as some family members. Every time I apply I double-check to make sure the position is still available on the company website and I make sure to Apply on the company website. I use LinkedIn and Glassdoor primarily to find open positions, but like I said, I apply directly on the website. \n\nI have also tried to find the hiring managers and reach out to them, saying how excited I am to be considered, etc. I have also tried scheduling phone calls with them and talking with them for 10-15 minutes to potentially build rapport and get a referral. So far, even after the referrals, I have been rejected.\n\nMy most recent strategy was to stop applying altogether and just cold email companies I have found locally, attaching my resume and saying something along the lines of \"Here is my resume, let me know if I qualify for anything.\" (but more professionally obviously).\n\nI am seeking a job potentially in finance or Operations, however, at this point, I am getting desperate to get an interview anywhere. I am not sure what I am doing wrong, but I see a lot of videos on TikTok with people describing a similar situation to my own. Are my strategies flawed? What am I doing wrong?\n\nI might start resorting to literally walking into a company and handing them a physical resume even though they will probably just tell me to apply online. ",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/1j5e1dg/what_am_i_doing_wrong/",
      "comments": [
        {
          "body": "Sorry friend (going through the same thing).\n\n[https://www.theatlantic.com/ideas/archive/2025/02/jobs-unemployment-big-freeze/681831/](https://www.theatlantic.com/ideas/archive/2025/02/jobs-unemployment-big-freeze/681831/)",
          "score": 1
        },
        {
          "body": "hey i guess i can help u",
          "score": 1
        },
        {
          "body": "Okay, the cold emailing is a bad idea, and they’re not going to do the work of deciding what role is best for you unless you’re incredibly qualified and/or well-recommended. \n\nGo back to applying directly. Do you mean you’ve gotten zero interviews for thousands of applications? Are you looking for local, remote, or relocation jobs? What types of jobs have you been applying to? Can you post an anonymized resume to r/resumes for feedback? If you tag me, I’ll take a look.",
          "score": 1
        },
        {
          "body": "A degree in econ gives you a lot of options. I know, I have one. It's kind of how well you sell yourself. Ive always sold myself as a 'problem solver.' my first job out of my BA was as an DBA. I've since gotten much deeper into analytics and have worked in casino gambling, newspapers, and higher education. Many of those I graduated with work in banking, finance, and operations.\n\nOne problem you are facing is the market, in general. Further you are competing with data scientists. \n\nKeep your head up. The right opportunity will come along.",
          "score": 0
        }
      ]
    },
    {
      "title": "7-Months Unemployed... Let's Fix This! M27: Marketing, Videography, Audio, Graphic Design",
      "body": "I'll try to keep this intro brief - most recently, I worked a decent little job for a few years which didn't pay much, but taught me some valuable skills. Then the company stopped bothering to sell video (the making of which was my primary skill) and my hours plummeted, so I left. That was in July, and I've been looking for another job ever since.\n\nhttps://preview.redd.it/nbmgei046tje1.jpg?width=2387&amp;format=pjpg&amp;auto=webp&amp;s=a7fec8ed1ee78ea6023603cbb1f43908aa33c038\n\nHere are some questions, which hopefully the above will assist in getting answers for:\n\n\\- Any general resume comments or suggested upgrades are appreciated, of course!\n\n\\- This is more of a general question, so you can skip it or answer it generally: Why is my job search proving so ineffective? I've been applying to the few video and audio openings out there of course, but I'm also applying to anything marketing related, and occasionally some administration and other background tech roles, at least a dozen per week... And I have no doubts that I interview well. Still no dice. Does my resume not read like it should? I've been trying to work in the field as long as possible, despite graduating just before COVID in December 2019 (hiccups galore!).\n\n\\- Is the title \"Content Creator\" unappealing? It was never one I liked - I thought of myself as and performed duties more like those of a Videographer - but I didn't hate it until I was watching Central Park the other day and they made the joke \"So she hired a team of content creators... Basically a couple 20-somethings with phones.\" Is the title really perceived that badly? Should I change it to something else?\n\n\\- I've left off a chunk of my total work experience because I think of it as irrelevant - a couple months here and there of retail doesn't seem worth the page space anymore. Am I correct in thinking this?\n\n\\- I've been applying to mostly local jobs, but every so often I've also thrown out resumes to jobs based in NYC, as well as remote positions. I assume these are even more hyper-competitive than local jobs and even though I'm willing to move, I should probably still just stop wasting my time with them?\n\n\\- Will employers who ask about my now 7-month gap of unemployment frown upon my response being \"I've been looking this entire time, I just haven't had any luck\"? It's the only one I have that isn't exaggerating the little freelance work I've done or making up some kind of story.\n\nThank you in advance, I really look forward to correcting the flaws in my course forward and getting to a destination already!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1is2192/7months_unemployed_lets_fix_this_m27_marketing/",
      "comments": [
        {
          "body": "It sounds like you gained some great skills in your last role, but I get how tough it can be when the opportunities start to dry up. Looking at your resume, I see a few things that could be holding you back from landing interviews:\n\n✅ **Your summary needs more impact** – Right now, it doesn’t really *sell* you. Your resume should start with a strong pitch—who you are, what you bring to the table, and why you’re a great fit for the roles you’re targeting.\n\n✅ **Move education to the bottom** – Unless you’re a recent grad, your experience and skills matter way more than where you went to school. Employers care about what you can do, not just where you learned it.\n\n✅ **Refine your skills section** – Right now, there are too many. Try cutting it down to a maximum of 12 *relevant* skills that align with the jobs you’re applying for. That’ll help recruiters quickly see your key strengths without getting overwhelmed.\n\n✅ **Your first role has strong bullet points—apply that to the rest!** – Employers love seeing impact-driven statements that show what you achieved, not just what you did. If possible, add similar clarity and measurable results to your other roles.\n\nIf you want to dive deeper into making your resume stand out, I’m hosting a *free Resume Elevation Workshop* where I’ll break down exactly how to structure a resume that gets results. You can sign up here: [www.amcreativecoach.com/resume-elevation](www.amcreativecoach.com/resume-elevation).\n\nHope this helps—happy to provide more feedback if needed!",
          "score": 2
        },
        {
          "body": "If you got anywhere from posting this I’d love to hear about it. I’ve gone about a year and a half now. It’s really defeating. 23 years professionally employed Designer, CMS Developer, Marketing Manager etc. I literally worked on an historic presidential campaign five years ago and was on tv etc with ten years of making 250/hr and for the last couple of years I’ve been very very poor with no work and every time I get close it falls through to the point where if it wasn’t so damn depressing it would be comical",
          "score": 1
        }
      ]
    },
    {
      "title": "TikTok Interview Process",
      "body": "Hey Everyone, TLDR; \n\nI applied for an Analyst Position at TikTok and just wrapped up my 2nd Round Interview.\n\nThis position isn't really a technical role but still requires some knowledge and experience. \n\nI can't help but to think that the interview went \"mehh\", I wasn't able to articulate confidently at 2 of the questions that were asked. \n\nBut we ended on a good note with me showing my enthusiasm and motivated to join the team and they said that'd I would be an amazing fit culturally here. They also mentioned next steps to me would be an assessment with a panel interview(?) \n\nHow long do these processes usually take and when can I expect word back? And has anyone done anything similar? If so, please share. \n\nThank you!\n\nEDIT: \nThey got back to me a MONTH later.. I literally thought I got ghosted but nope! Had a panel assessment and they loved it! Now I'm moving to the final interview. Wish me luck! \n\nUpdate 2: Went through the Final Interview, 2 weeks.. nothing.. but recruiter finally got back to me saying they'd hope to meet with the team by the end of the week. Following week nothing, and I followed up, next week I was told they'd hope to meet with the team again.",
      "subreddit": "interviews",
      "score": 7,
      "url": "https://reddit.com/r/interviews/comments/1lpgxd3/tiktok_interview_process/",
      "comments": [
        {
          "body": "Hi, I am also interviewing for anti fraud data analyst role. I have passed the OA, and up for an interview I believe with a peer if not the manager. How many more can I expect, and what is up with the presentation? Since the HR said there won't be any live coding in this interview, I wonder how the queries will be that they'd be asking. Thanks!",
          "score": 2
        },
        {
          "body": "Typically you'll hear back within a week or two about the panel assessment, and the whole process from application to offer usually takes 4-6 weeks total. Panel interviews can feel intimidating since you're facing multiple people at once, but they're often more conversational and give you a chance to showcase different aspects of your experience. Since you're moving forward, use this time to reflect on those questions that threw you off and prepare stronger responses for similar scenarios. I'm actually on the team that built [interview AI](http://interviews.chat), and it's designed exactly for situations like this - helping people navigate those tricky questions that can catch you off guard and practice articulating responses more confidently before the big day.",
          "score": 1
        },
        {
          "body": "Hi, Did you end up hearing back? I also had my second round with the HM and I thought it went well. Mine ended with \"you will hear back from the recruiter on next steps\" usually when that happens, I am not moving forward. Usually when the HM likes me they tell me what the next steps are. Thanks for the help  :)",
          "score": 1
        },
        {
          "body": "How soon after your phone screen or first round did you hear back?",
          "score": 1
        },
        {
          "body": "Congrats. I've applied to a role too, I'm expecting it to move forward. But I'll save your post here. It's non tech role (business analyst)",
          "score": 1
        }
      ]
    },
    {
      "title": "TikTok Final Interview Process?",
      "body": "Hey Everyone,\n\nNot sure if you have seen a previous post of mine. But I completed my Final Interview round at TikTok on Monday! \n\nI'm anxious as heck because I really wsnt this job but have you ever had an interview and felt like you didn't do well? Or you couldn't tell if the interviewer liked you (or your answers?).. this is me currently.\n\nI would love to know:\n\nHow many finalists are there?\nHow long does it take for the employers to get back to you with a decision?\n\nI've heard stories of people being told they got the offer but never followed up with HR for the letter..\n\nThank you!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1mq3hwn/tiktok_final_interview_process/",
      "comments": [
        {
          "body": "Hey, which position did you apply for? I am also waiting on the second round as a data Analyst. Could use some help to know the process next.",
          "score": 2
        },
        {
          "body": "They typically bring 3-5 candidates to final rounds depending on the role, and their decision timeline can range anywhere from a few days to two weeks. Big tech companies like TikTok usually have pretty structured processes, so if they gave you a timeline, trust it. The stories about offer mix-ups happen but they're rare - most companies have solid systems in place. Since you can't control the waiting game, focus your energy on continuing to apply elsewhere and preparing for other opportunities. I'm actually on the team that built a [copilot for interviews](http://interviews.chat), and we created it specifically to help people navigate those tough final round questions and feel more confident going into high-stakes interviews like the one you just had.",
          "score": 1
        },
        {
          "body": "Any updates?",
          "score": 1
        }
      ]
    },
    {
      "title": "Does working in a contact centre full time suck?",
      "body": "I’ve been applying to customer service officer/contact centre type jobs bc I want to get into something that’s a step above retail/hospitality. I’ve been in food service/hospitality for 5 years while I was studying.\n\nI’ve got an interview in 4 days (first job I’ve heard back from in months of applying) for the contact centre at a Toyota &amp; Lexus dealership, the recruiter said it’s a small team of 4/5 in person plus a few people who work from home. Said it’s mostly inbound calls that it’s our job to redirect (about parts, sales, service etc), with some outbound calls to existing customers regarding services. \n\nIt’s full time, mon - fri standard office hours which is more than I’ve ever worked in a week before. When you search ‘contact centre’ on tiktok the consensus is that these kinds of jobs suck and are totally draining, which has me questioning if I should go forward with it. I’m worried that sitting in one room for a full day on the phone is going to be soul sucking after being used to a hospitality environment. \n\nDoes anyone have experience in a job similar to this (contact centre, but in a small team in person and not for something like tech support/insurance/banks) and have some insight they could share? Is it possible for this to be a somewhat enjoyable job or am I doomed to hate it in a couple months?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1j2ba4b/does_working_in_a_contact_centre_full_time_suck/",
      "comments": [
        {
          "body": "Sorry but Call centre jobs are horrible, especially inbound ones. I worked at one where you got a 2 minutes between each call and it was relentless back to back calls. If you had a difficult call you were just straight into the next one without being able to regroup. Until you’ve done it you don’t realise how tiring it is to be speaking on the phone all day everyday, then throw in the targets management expect you to hit and it’s super stressful. When I worked in one my mental health was the worst it had ever been, I was a drained husk of a human. Some people could hack it but I couldn’t.",
          "score": 3
        }
      ]
    },
    {
      "title": "Has anyone worked at TikTok/Bytedance corporate and can share their experience?",
      "body": "I’m currently interviewing with TikTok Shop and just finished my last interview today. They seem to really want me, but I’m starting to think it’s because they just want someone in the role vs me specifically. I’m expecting the pay to be really great (likely 40% more than my last role) and am getting anxious about what to do should I receive an offer.\n\nThe company is 5 days in office which would be about a 30 minute commute each way for me. The last interviewer said the team/company is moving really quickly and recently worked all weekend Memorial Day weekend to finish a doc… I’m starting to get cold feet and am not sure I want to jump headfirst into what seems like a complete mess of a company. Then again, I could work there for a little bit and cash out, while also getting some decent experience. Note that I’m currently unemployed and none of my other applications are moving forward right now. \n\nAny advice or personal stories others can share is greatly appreciated. ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1dancxh/has_anyone_worked_at_tiktokbytedance_corporate/",
      "comments": [
        {
          "body": "No other offers?  Something is better than nothing, and experience at a well-known company is usually a positive for managers reviewing resumes.  Additionally, even if it is a fast-paced workplace, typically that means you'll learn a ton, which will make you very valuable to future employers that could offer a better work culture if you decide you don't want Tik-Tok to be your long-term employer.",
          "score": 2
        },
        {
          "body": "Hi, Wondering if you got the offer and timing it took?",
          "score": 2
        },
        {
          "body": "Curious if you were offered the role? I am interviewing with TikTok Shop as well, and it is moving fast!",
          "score": 2
        },
        {
          "body": "It's your typical 996 workload. Due to the nature of TTS (24/7 shoppertainment), you are likely to work overtime even during the weekends. It's a dynamic workplace, so if you don't like learning new things every few months, it's going to be painful. But the pay+benefits are above market industry (although some say it's still not worth it).",
          "score": 1
        }
      ]
    },
    {
      "title": "TikTok Interview process - Post HRBP round",
      "body": "Completed 4 rounds of interview for a 2026 grad role at TikTok/Bytedance (final round was with HRBP) a month ago. \n\nTA did reach out to me 2 weeks later and provided me positive feedbacks for my past interviews and asked for my earliest availability for the role. However it has been another 2 weeks and no news! I’m starting to be scared that I might be ghosted because I heard the process moves fast in TikTok if you passed, would love to hear advices from people on the situation. ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oo32ac/tiktok_interview_process_post_hrbp_round/",
      "comments": [
        {
          "body": "Honestly, this is pretty common. Corporate processes can get delayed for tons of reasons, even if you do well. Since you already got positive feedback, I suggest a polite follow-up email to the TA, expressing continued interest and checking on any updates. It shows initiative and helps keep you on their radar.",
          "score": 2
        },
        {
          "body": "Is your final round included hiring manager + HRBP sessions? I was notified that I’ll have those two sessions scheduled but I’m not sure how to prepare",
          "score": 1
        }
      ]
    },
    {
      "title": "AVOID Tik Tok PM (2026 Start MS/BS)",
      "body": "AVOID don't even bother applying. i have never experienced a worse interview in my life. The interview was in full Chinese with no prior notice. The interviewer is insanely rude, disrespectful, and literally criticized everything I said.\n\nShe said my resume was not even pm experience related, even though in the summer, i was hired as a freaking pm intern at a top global company. SO TELL ME WHY did i get through resume screening TWO TIMES (bc i also got another interview for pm in another team)\n\nThen she asked me ONE question abt my summer pm experience and my team was 10 people and she asked why do you need 10 people to work on the project, thats so inefficient. LIKE BRO IDK BC THE COMPANY TEAM HAD 10 PEOPLE FOR IT??? and so i politely answered thats the company structure and it might seem inefficeint but it was a collective discussion and decision. AND SHE FREAKING SQUINTED HER EYEBROWS AND said i dont understand but ok..\n\nAfter asking ONE question, she literally said you are not what we are looking for, lets not waste each others time, do you have questions for me? And so i asked her what are you looking for and expecting from a college graduate? (BC SHE WAS GRILLING ME FOR NO REASON abt my pm experience and undermining it) And she said i don't expect u to have technical skills so soft skills. she didnt even ask me any soft skill or product sense questions??? at the end, she concluded with \"thank you even we talked a lot of bull shit (me asking her questions) at the end\".\n\nliterally wtf. worst interview ever, there was no mutual respect, i shouldn't even have prepared for this. I am withdrawing from all tiktok/byte dance related jobs. absolute waste of time.",
      "subreddit": "interviews",
      "score": 73,
      "url": "https://reddit.com/r/interviews/comments/1pv5yty/avoid_tik_tok_pm_2026_start_msbs/",
      "comments": [
        {
          "body": "I got through 2 rounds of interviewing back in March just for the next interviewer to say \"I didn't have the experience\" required. Wild.",
          "score": 29
        },
        {
          "body": "I’m gonna be honest. Internships for project management don’t really mean much unless you end up getting a job at the company you interned with. Project management is all about experience and 3 months doesn’t cut it unfortunately. Speaking as someone who has been in project management for 3 years now.\n\n\nAlso (and I’m not justifying her behavior, just explaining it) the reason she thought having 10 “PMs” on one project was weird is because it was. Real life projects rarely ever have THAT MANY PMs assigned to it. So saying you had to share that decision making position with 9 other people just reiterated the fact that as of right now you don’t have “real” PM experience. She wanted to hear that you’ve led projects on your own or maybe with one other person. \n\n\nI highly recommend looking into jobs for a project coordinator or engineer. Maybe even an APM position is the company skips the PC roles completely. Get some experience under your belt and then try again. Because unfortunately in this industry a college degree is not enough. You’ll still have to start from the bottom and learn/ work your way up.",
          "score": 13
        },
        {
          "body": "I'm sorry, but a resume bullet that says - \"SUMMER intern Project Manager\" for a PM position? That's like 3 months of experience with little to no actual responsibility compared to Full time employees who were presumably showing you the ropes.\n\nI imagine that's why the interviewer acted that way. They are probably looking for a lot more experience than 3 months as a Project coordinator and they should have caught it earlier.",
          "score": 8
        },
        {
          "body": "Why did you even apply to work for the brain rot company that is basically a weapon of war for the CCP to use against the U.S. that’s being converted now to a propaganda tool for a burgeoning facist regime? Why would you do that?",
          "score": 20
        },
        {
          "body": "Which region or country was this for ?",
          "score": 2
        }
      ]
    },
    {
      "title": "TikTok Interview Timeline",
      "body": "Anyone know how long to hear back from TikTok final round, it has been three weeks and I am unsure if I am getting ghosted",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1oih79g/tiktok_interview_timeline/",
      "comments": [
        {
          "body": "Last round is with HRBP?",
          "score": 1
        }
      ]
    },
    {
      "title": "Coding questions for TikTok security Engineer Interview",
      "body": "Hey ,  \nI’ve got a coding interview coming up for a Security Engineer (anti-automation) position at TikTok. I haven’t seen too many recent posts about what to expect in the coding round for this role. If you’ve been through it or have any tips about the kind of questions they ask (DSA, scripting). I always had code reviews but never coding so I'm not sure what to expect especially with TikTok.\n\nAny advice on the topics or problem styles they focus on would be really helpful.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1megvvk/coding_questions_for_tiktok_security_engineer/",
      "comments": [
        {
          "body": "Is there any update? How did the interview go?",
          "score": 1
        },
        {
          "body": "any updates?",
          "score": 1
        },
        {
          "body": "I also have the same interview from TikTok. I believe that no matter what, all applications (for the internship position at least) go with the standard CodeSignal GCA, meaning it’s more standardized across the board, not too sure about full time spots.",
          "score": 1
        },
        {
          "body": "Hey how did your interview go? What kind of questions were you asked?",
          "score": 1
        },
        {
          "body": "Hey is this for the 2026 Start (BS/MS)?",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview with TikTok went really well …. Until I accidentally brought up Kimmel",
      "body": "\n\nI just had my third and final interview with TikTok and it went REALLY well until the last minute when the hiring manager asked if I had one last question….. I didn’t but for some reason I felt like I needed to ask another question so I dumbly asked if the political climate for TikTok was causing change management in the company 🤦🏻‍♀️\n\nShe carefully answered and basically responded that TikTok was safe because they had a large enough audience and users. I responded with “ hey they tried to cancel Kimmel and there were enough people that took action and he was back on the air less than a week later” I was trying to make a point in parallel with her that the power of social media can supersede politics but I’m afraid she didn’t take it that way. She was dead silent and concluded the interview (we were going over 5 min regardless)\n\nTrying to write a thank you note for the interview….Do I apologize for bringing politics into the conversation or pretend that the last minute of the interview didn’t happen? \n\nUPDATE:\n\nDidn’t get the job as expected but that’s okay. Learned an important lesson and blessed to have other job interviews lined up. Thanks everyone for chiming in. Learned a lot especially from those that came out of TikTok - I dodged a bullet! \n\n\nP.s. I am pro free speech but it saddens me how many toxic people feel the need to insult someone when they write a post looking for advice over a mistake they made. Left or Right, kindness would make the world a better place.  For those that sent encouraging words, I thank you. ☺️ \n\n",
      "subreddit": "interviews",
      "score": 1624,
      "url": "https://reddit.com/r/interviews/comments/1nr815e/interview_with_tiktok_went_really_well_until_i/",
      "comments": [
        {
          "body": "That was certainly a… choice",
          "score": 547
        },
        {
          "body": "So like never ever bring up politics lol",
          "score": 239
        },
        {
          "body": "No, don't mention it in the thank you letter, it just brings more attention to it. It was a poor choice unfortunately.",
          "score": 551
        },
        {
          "body": "Just because you think certain thoughts, doesn’t mean it needs to be said out loud. A good lesson to learn",
          "score": 215
        },
        {
          "body": "I would say there’s never a dumb question.. but you might be cooked… Of all the questions you cold have asked… 😂",
          "score": 62
        },
        {
          "body": "This is a good example of how being too online is a negative for a person.",
          "score": 40
        },
        {
          "body": "Ouch 😬… we live and we learn moment.",
          "score": 30
        },
        {
          "body": "Why not ask the interviewer their religious preferences and then tell them how they are wrong.",
          "score": 26
        }
      ]
    },
    {
      "title": "After 1956 applications and countless rejections, I finally got 1 offer after learning this lesson",
      "body": "I started applying for jobs in March 2024 and finally landed a job today. It was common for me to prepare for interviews on the school shuttle bus or skip dinner to finish an assessment.\n\nMy long job search journey can be broken down into three phases:\n\n1️⃣ No Direction (March 2024 – August 2024) 1,300+ applications, 5 interview invitations from fake or small-sized companies. I even attended an information session where all the participants were old grandma and grandpa.\n\n2️⃣ Adjustment (September 2024 – October 2024) Stopped applying and reflected on my mistakes. Realized I had wasted time on ineffective efforts: no polished resumes, no refined interview skills. Created 6 versions of my resume tailored to different job roles.\n\n3️⃣ Apply! Practice! Refine! (November 2024 – March 2025) 500+ applications, 23 interviews. Polished my interview answers daily using ChatGPT until it achieved full memory. Visited mock interview websites more frequently than Tiktok. Revised my resume sentence by sentence. Even dreamed about practicing behavioral questions in my sleep. Finally, I made it.\n\nHere are the tools I used after adjusting my strategy, hope this helps someone struggling!\n\n✅ **Job Application Websites:**\n\n[**Indeed**](https://www.indeed.com/): Better for mid- and small-sized companies, ideal for students seeking internships or entry-level roles.\n\n[**Handshake**](https://joinhandshake.com/): Where I got my first internship. A reliable platform connected to universities with up-to-date job postings.\n\n[**LinkedIn**](https://www.linkedin.com/): More suitable for applying to larger companies than Indeed.\n\n✅ **Interview Preparation Websites:**\n\n[**Glassdoor**](https://www.glassdoor.com/index.htm): Offers real interview experiences and company reviews from past candidates and employees. Also provides job market insights worth reading.\n\n[**AMA Interview**](https://www.amainterview.ai/): Mock interviews with an AI avatar. Helped me refine my speaking speed, gestures, and answers through real-time feedback. I felt proud when I finally received a high score from my robot interview coach lol.\n\n✅ **Resume Revision Websites:**\n\n[**ChatGPT**](https://chatgpt.com/): Provides tailored resume suggestions based on job descriptions, work experience, and projects.\n\n[**DeepSeek**](https://www.deepseek.com/): Offers more detailed and comprehensive feedback than ChatGPT, though slightly slower in response time.\n\nI lost count of how many rejection letters I received, but they never stopped me from applying for the next job. The most valuable lesson I learned from my hundreds of sleepless nights is this: A smarter strategy is more important than the number of applications. Landing a job is becoming increasingly difficult. If you're struggling, know that it’s not your fault in this job market.\n\n1,956 applications, 1,900+ rejections, 28 interviews, 1 offer. If I can do it, so can you.",
      "subreddit": "interviews",
      "score": 2323,
      "url": "https://reddit.com/r/interviews/comments/1j9z4kx/after_1956_applications_and_countless_rejections/",
      "comments": [
        {
          "body": "Big Congrats!",
          "score": 95
        },
        {
          "body": "Thank you for the positivity. Needed to see this today.",
          "score": 62
        },
        {
          "body": "Thanks for sharing, OP! This is super helpful! One thing I noticed—the tools section was a bit hard to read, so I went ahead and adjusted it for better clarity. Hopefully, this makes it easier for more people to understand! 😊   \n \\- Job Application Websites:   \n ✅ ***Indeed***: Better for mid- and small-sized companies, ideal for students seeking internships or entry-level roles.   \n ✅ ***Handshake***: Where I got my first internship. A reliable platform connected to universities with up-to-date job postings.   \n ✅ ***LinkedIn***: More suitable for applying to larger companies than Indeed.   \n\\- Interview Preparation Websites:   \n ✅ ***Glassdoor***: Offers real interview experiences and company reviews from past candidates and employees. Also provides job market insights worth reading.   \n ✅ ***AMA Interview***: Mock interviews with an AI avatar. Helped me refine my speaking speed, gestures, and answers through real-time feedback. I felt proud when I finally received a high score from my robot interview coach lol.   \n\\- Resume Revision Websites:   \n ✅ ***ChatGPT***: Provides tailored resume suggestions based on job descriptions, work experience, and projects.  \n ✅ ***DeepSeek***: Offers more detailed and comprehensive feedback than ChatGPT, though slightly slower in response time.",
          "score": 29
        },
        {
          "body": "Resilience, willingness to try and learning from mistakes.\nThese skills are going to help you so much in your career. \n\nThey made a good hire, I am sure. \nEnjoy the feeling, well deserved!",
          "score": 20
        },
        {
          "body": "Congratulations...kudos to your hard work and dedication..",
          "score": 14
        },
        {
          "body": "I don't think I've read that many job descriptions..",
          "score": 14
        }
      ]
    },
    {
      "title": "First round of Tiktok DS Interview",
      "body": "Hey everyone,\n\nGot an email from TikTok’s HR to schedule my first-round interview for the 2026 New Grad (PhD) Data Scientist (Product) role. There wasn’t any OA before this, and they didn’t mention the interview format even after I asked.\n\nHas anyone here done the first-round DS new grad interview with TikTok?  \nWas it more technical (coding/stats/SQL), product-focused, or just behavioral?\n\nWould love to hear what to expect or how to prep. Any tips are appreciated! 🙏\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oveshj/first_round_of_tiktok_ds_interview/",
      "comments": [
        {
          "body": "I am not an expert in this field, but I will share my warm adice which can help you a lot during preparation. You can try Interviewly.me for practice, as it simulates real-life interviews. Just paste the job link, job description or upload your resume, and it will generate tailored questions to the role (behavioral, technical, situational, etc).\n\nhttps://www.interviewly.me\n\nAnother great thing is that you'll get immediate feedback on each response during an interview session, with suggested example of an optimal answer (depending on the evaluation), as well as full analysis report of every completed interview. You will have performance analytics over time, to see where you're at with tech and soft skills, and what are your strenghts and development areas, as well as an option to choose a specific skill to practice and focus on.\n\nIt can contribuite a lot to building confidence around the position, unlock some questions you haven't thought about and guide you through your professional development. Basically, it helps both with short-term and long-term preparation, depending on what you need.\n\nI truly hope it helps! Let me know if you have any questions 🙂",
          "score": 1
        }
      ]
    },
    {
      "title": "tiktok interview cancelled and stopped on the day",
      "body": "i went through the tiktok interview process, got through the first round and is scheduled for the second. AND on the day the recruiter cancelled the interview and also stopped my interviewing application process completely. Thhey said it was \"due to unforeseen circumstances\", like what..? are other people experiencing this too or any guesses why?",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1n8htjh/tiktok_interview_cancelled_and_stopped_on_the_day/",
      "comments": [
        {
          "body": "Yes. I was in the final round of the interview for the ML scientist Position. Passed the first two interviews. I was confident that I would grab it. But surprisingly, they sent an email and mentioned that there are some changes in their plan, and they cancelled my final round interview, which is really shocking!! Their email was vague with no clear reason. It feels like I wasted all of my time interviewing with this company.",
          "score": 1
        }
      ]
    },
    {
      "title": "Tiktok MLE interview",
      "body": "Hi all!\nI’m preparing for an upcoming TikTok Machine Learning Engineer interview and was wondering — for the video rounds, what coding platform do they use for live interviews? (For example, Amazon uses Amazon Chime.)\n\nAlso, if anyone has gone through the TikTok MLE interview recently, I’d really appreciate any tips or experiences you can share — especially for the technical rounds and what to expect in terms of ML questions.\n\nThanks in advance!\n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1koyaye/tiktok_mle_interview/",
      "comments": [
        {
          "body": "They use LeetCode for coding challenges live during the interview. It's a great platform, but if you're not familiar with it, make sure to take some time to get used to the interface and the types of problems they ask before the actual interview.\n\nFor the technical rounds, be prepared for questions that are more conceptual than just straightforward coding. Think about how you would approach solving complex ML problems in real-world scenarios. Practice whiteboarding exercises or work with a friend to simulate these conversations. If you want to more about the AI tool I used during my own tech interviews that helped me feel more confident, I can share it with you.\n\nYou got this! You've made it this far, and that's something to be proud of. Keep pushing forward, and don't hesitate to reach out if you need any further guidance or just someone to talk through your thoughts.",
          "score": 1
        }
      ]
    },
    {
      "title": "I think people don’t know how to interview prep",
      "body": "I’ve been thinking about how people prep for job interviews, and I wanna toss out some thoughts (and hear yours). Most folks just try to memorize answers to those usual questions like “tell me about yourself” or “what’s your biggest weakness?” I get it, it feels like a safe bet. But I’ve seen it crash and burn, and I’ve been there myself. When you only prep for specific questions, if the interviewer hits you with something weird or off-script, you’re toast. You freeze, fumble, or start rambleing. Not fun.\n\nLooking at the advice on any other platform like TikTok or IG, I think people don’t know how to practice. The majority is just “how to answer this or that” or “say this, not that.” It’s all about scripting answers, which doesn’t help when things go sideways. I think a better way is to learn frameworks, not just answers. Like, use STAR (Situation, Task, Action, Result), at least, for those “tell me about a time” questions, or have a way to sum up your skills quick. These let you roll with almost any question, even the random ones. It’s like a game plan, not a script.\n\nBut honestly, what’s probly even more important is getting good at basic communication. Interviews aren’t just about what you say, it’s how you say it. If you can’t talk clear or keep a convo going, you’re in trouble. Like how we do mock interviews. You can try Mindorah by going to mindorah.com. But google has a alternative also, called google warmup. Some other stuff I’ve tried before Mindorah that works very well:\n\n•  Make a presentation about anything (like a hobby or whatever) and show it to friends or family. Helps you practice talking smooth.\n\n•  Get into discussions with people. Like, civil ones, not shouting matches. It’s good for thinking on your feet.\n\n•  Do mock interviews, but tell your buddy to throw in some curveballs to keep you sharp.\n\nI just feel like a lot of us don’t know how to present ourselves. Being able to show who you are and why you’re a good fit takes practice, not just memorizing stuff.",
      "subreddit": "interviews",
      "score": 639,
      "url": "https://reddit.com/r/interviews/comments/1lh3wgy/i_think_people_dont_know_how_to_interview_prep/",
      "comments": [
        {
          "body": "Whenever I prep prep I end up with the jobs. I practice questions, review my resume and what’s on it, I research the company, and I google good questions to ask after the interview. This may sound weird but I practice my smiles as well. I’m not a person that emotes much but smiling a nice engaging smile throughout has always helped.",
          "score": 156
        },
        {
          "body": "People also underestimate the value of character and authenticity . When an interviewer comes across with out of the box answers, sometimes even good humour, it makes a big difference.",
          "score": 40
        },
        {
          "body": "Thank you for this. I have an interview I am prepping for (dream job!) I’m a nervous wreck right now but this explanation has been helpful. I have a week to prep so I will introduce these ideas. I’m currently doing a lot of mock interviews. 🤞🏻🤞🏻🤞🏻",
          "score": 24
        },
        {
          "body": "I’ve never prepped for an interview. I just tell the truth with a ton of eye contact and open body language. I’ve gotten every job I’ve been qualified for. I think a lot of people practice, and it shows. Employers aren’t looking for a performance; they’re looking for a performer. Know your capabilities, talents, and yourself. Confidence trumps so much.",
          "score": 9
        }
      ]
    },
    {
      "title": "tiktok video architecture interview",
      "body": "TikTok interview (Technical Operations engineer - Team video architecture) in a week and I was told to work on the following.  \n&gt; Basic skills in SDK, CDN, and RTC  \n&gt; Workflow, emergency procedures, and troubleshooting ideas  \n&gt; Responsible projects  \nWell, the recruiter approached me cause I have a cloud background. I don't know what type of questions I can expect. The weird part is I cannot find anyone working as a 'Technical Operations engineer' on LinkedIn or anywhere else. I cannot find interview information about this role. I am very skeptical.  \nHas anyone here been interviewed for the same role? Please share your experience and advice on preparation.   \nThank you!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1g14out/tiktok_video_architecture_interview/",
      "comments": [
        {
          "body": "The role of Technical Operations Engineer for TikTok's video architecture team sounds like a unique position that blends cloud expertise with video streaming technology. Given the specific areas they've asked you to focus on, expect questions about content delivery networks (CDNs), real-time communication (RTC) protocols, and software development kits (SDKs) related to video streaming. They'll likely probe your understanding of how these components work together to deliver a seamless video experience to millions of users. Be prepared to discuss troubleshooting scenarios, like how you'd handle a sudden spike in latency or a regional CDN outage.\n\nThis could be a newly created position or one with a unique title specific to TikTok. Use this to your advantage - ask thoughtful questions during the interview about the role's responsibilities and how it fits into their overall technical operations structure. This shows genuine interest and helps you gauge if the position aligns with your skills and career goals. If you're feeling underprepared, you might find [AI interview](http://interviews.chat) prep helpful for practicing responses to technical questions. I'm on the team that created it, and it's designed to help with tricky interview scenarios like this one.",
          "score": 2
        }
      ]
    },
    {
      "title": "Tiktok DE interview: Your experience &amp; what to expect",
      "body": "If you have interviewed at tiktok for data engineer role, what was your experience? What is their de role mostly like ? What's the python /sql split ? Are de technical interviews more like swe interviews ? Is ds&amp;a important for technical de tiktok interview ?\n\nExample of particular LC questions greatly appreciated 🙏\n\n\nInb4: glassdoor\n\n#dataengineer #DE #interview #tiktok #tech #faang #faanginterview",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1c1uhrf/tiktok_de_interview_your_experience_what_to_expect/",
      "comments": []
    },
    {
      "title": "Google job application status",
      "body": "I wonder if there are any \"signs\" I can infer from my Google application (and its status) that could give me an idea whether I will be shortlisted for the interview.\n\nI applied to one t&amp;s role (non-technical) for YouTube division and I really like that position.  I actually applied to it 3.5 years ago, 2 months before I started working at TikTok but I didn't pass the 1-2-1 senior stakeholder interview and wasn't shortlisted to the panel interview (however I passed to panel interview 2 years ago for another position but wasn't selected and it was an average interview performance from my side.\n\nI am not sure if my (failed) application from 2020 to that position I am applying now could affect my current application during resume / application screening process?\n\nI applied 6 days ago (in March) and yesterday the status of my application changed to \"updated xxx ago\" so now it's displayed as \"Submitted\" &amp; \"updated yesterday\". I know that some folks received a rejection email not long after the time related information on their application changed to \"updated\". Is there any general pattern behind this? When the rejections usually happen?\n\nIf I don't get a rejection within first 5-10 days, does it mean my chances of landing the interview increase? I also heard that Google now conducts pre-screens through so called \"hiring assessment\" and as far as i know, they send these HA relatively quickly after application is received. I haven't received any HA link nor any contact from Google yet ...\n\nUpdate 28.08.2024: I got an offer !!! but with relation to a different job application that I made in July (mid-level). For the original job application from the post above I had my 121 interview with the HM &amp; I got the overall positive feedback but they told me (via VC post interview feedback call) they had to raise the shortlisting bar due to overwhelming number of candidates and nuances decided that I was not shortlisted to the final interview stage.",
      "subreddit": "interviews",
      "score": 47,
      "url": "https://reddit.com/r/interviews/comments/1c0rpyb/google_job_application_status/",
      "comments": [
        {
          "body": "I've also applied for the same position, and I noticed that my status changed to \"submitted\" yesterday. Based on my past experience, whenever I've received a \"submitted\" status update, it typically indicates progression to the next stage. Unlike previous applications where I received immediate feedback, this one seems to be following a different pattern, which gives me a sense of optimism.",
          "score": 2
        },
        {
          "body": "I applied on 8/13, passed the assessment on 8/17 and now it’s stuck on assessment passed last month",
          "score": 3
        },
        {
          "body": "One question I have is, did your status change from submitted to in scheduling queue before or after hearing from a recruiter that they wanted to schedule an interview with you?\n\nI’m starting to think there’s no real way to figure out what the statuses mean in terms of your chances for interview. I applied for 3 non-tech roles. A few days later, I got an email from a recruiter saying they’re not moving forward on ONE of the applications. But the status for that application didn’t change from submitted to not proceeding until 4 days after I got that email. I’ve seen some people saying the status would change immediately, wasn’t the case for me. And I still have two other roles with a “submitted” status, and both have been updated several times. I would say one has been updated probably 5 times over the last week (the role that most closely aligns with my background), and the other one has been updated at least 3 times. I’m still waiting to see if I’m going to get an interview.\n\nEdit: A few minutes after writing this, I checked and the status of the second application I submitted changed to not proceeding. I haven’t received an email or anything on that one. Still one application left, really hoping I get an interview.",
          "score": 2
        },
        {
          "body": "Is it possible for your job status to go from “not proceeding” with emails from recruiters stating you were not selected to -&gt; a link for the hiring assessment?",
          "score": 2
        },
        {
          "body": "hi - my 2 applications are stuck at assessment passed! One for two months and another one for a week. I have no idea what to infer. I applied online. Had written a cover letter to the hiring manager on LinkedIn. But no reply.  Is there anyway I can get an update over the applications?  ",
          "score": 2
        }
      ]
    },
    {
      "title": "Anyone worked at Comcast (Freewheel) or SiriusXM? Thoughts?",
      "body": "Hey Everyone! TLDR; Update from my TikTok interview process, for those who don't know, I've given up on waiting for a decision offer from them. It's been more than a month since my final interview, and I've only held on this long because they got back to me a month later after my first round.. so I thought maybe there a slim chance they reach back out to me with the offer? \n\n  \nBut moving on.. I'm currently at the 1st Round (excl. screening) with Freewheel and so far I loved it! It is a Senior Role with decent salary + bonuses, and the recruiter mentioned that out of all the candidates, I seem to check all the boxes and showed the most passion. So I'm excited for this one. \n\n  \nOn the other hand, I've made an amazing impression on my first 2 rounds with SiriusXM and now I'm in the final round which will be a back-to-back interview with 2 Senior Directors. Another great role, lower salary, unknown benefits. The team seems great to work with, I'm just a little hesitant with the salary. \n\n  \nFor context: I currently make $75,000/yr (no bonuses). \n\nComcast Comp Range: $80K - $100K \n\nSiriusXM Comp Range: $53 - $89K\n\n  \nHas anyone worked or known someone who has been at these companies? If so, can you provide a little insight on Work/Life balance, culture, perks + benefits, etc. ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1nvubpf/anyone_worked_at_comcast_freewheel_or_siriusxm/",
      "comments": [
        {
          "body": "How has your FreeWheel interview process been?",
          "score": 2
        }
      ]
    },
    {
      "title": "Any advice for Data Analyst role at TikTok USDS?",
      "body": "\nAfter 5 months of applying, this is the biggest interview I’ve gotten, so I really want to prepare well. I’m looking for guidance on what to expect and how to prep effectively.\n\nKey things I’m trying to clarify:\n\t•\tWhat the recruiter screen is like — casual chat or partially technical\n\t•\tHow many rounds the full process typically includes\n\t•\tWhether technical rounds are live SQL/Python interviews, take-home assignments, or timed platform tests\n\t•\tHow advanced the SQL questions get (joins only vs. window functions, query optimization, large dataset logic, etc.)\n\t•\tWhether Python is tested — and if so, is it Pandas/data tasks or algo-style coding\n\t•\tWhether there’s a case study / analytics round (e.g., metric drop diagnosis, A/B test design, content insights)\n\t•\tWhether the final round is virtual or onsite\n\nAny insight or prep suggestions would be really appreciated. Thank you!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oovng4/any_advice_for_data_analyst_role_at_tiktok_usds/",
      "comments": [
        {
          "body": "Yeah, prep is key for these interviews. For the recruiter screen, expect a mix: mostly casual, maybe some light tech. Typically, you'll face 3-5 rounds: recruiter screen, tech assessments, possibly a case study. SQL can go deep, into window functions. Python, if tested, could focus on Pandas and basic algo tasks. Case studies are common, especially around metrics and A/B tests. Final rounds are increasingly virtual, but confirm with them.",
          "score": 2
        },
        {
          "body": "For my TikTok USDS DA interview, the recruiter screen was mostly fit with a couple light SQL basics and timeline stuff. I had 3 rounds after that: live SQL on a doc with window functions and CTEs, a Python round focused on pandas data wrangling and basic stats, and a case on metric drop diagnosis plus simple experiment design. No take home for me, all virtual, and SQL got into dense joins and partition-by logic. What helped me was redoing 20 min daily SQL drills out loud and keeping answers to 90 seconds using STAR. I ran timed mocks with Beyz coding assistant using prompts from the IQB interview question bank. Also practice explaining tradeoffs and how you’d validate data quality. Good luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "Tiktok Hiring manager interview round",
      "body": "Hello everyone, I am interviewing for TikTok New Grad Frontend Role. This is my first ever inteview, I would appreciate if any of you who has gone through the process share their experience. If not, if you have any guide which I should follow to ace it. Thank you so much in advance!",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1gpf867/tiktok_hiring_manager_interview_round/",
      "comments": [
        {
          "body": "They'll likely ask about your experience with frontend technologies like React, JavaScript, and CSS, as well as your understanding of web performance optimization and responsive design. Be prepared to discuss any relevant projects you've worked on, even if they're from school or personal endeavors. Showcase your passion for frontend development and your ability to learn quickly in a fast-paced environment.\n\nTo ace the interview, practice explaining your thought process clearly when solving coding problems or discussing technical concepts. Research TikTok's products and culture, and prepare questions that demonstrate your genuine interest in the company. If you're looking for extra support, check out this [interview prep AI](http://interviews.chat) to practice answering tricky interview questions. Full disclosure: I'm on the team that created it, it's a helpful tool for navigating job interviews, especially for new grads.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview at TikTok",
      "body": "Hii im a year one uni student currently went through 2 rounds of interview for TikTok.. status online just changed from \"interview ongoing\" to \"interview complete\" but lol i haven't heard any back yet its been a week.. is this normal for Tiktok? do you guys have any similar experiences? ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1cfauxt/interview_at_tiktok/",
      "comments": [
        {
          "body": "Mine still says interviewing lmao.",
          "score": 1
        },
        {
          "body": "Did you ever get a reply back?",
          "score": 1
        }
      ]
    },
    {
      "title": "arrived at a job interview without realising it was a job interview…",
      "body": "if you think your job interview went badly, mine probably went worse. \n\ni’m 16 and looking for my first job. i live in a small town so there’s not much to go off of, but a new wetherspoons is opening in my area early next year. i wasn’t going to apply, but my friend encouraged me to come to this ‘recruitment event’ they were holding later that evening (as in she told me in the afternoon and like an hour later i was at the interview). \nI thought it would just be like a drop off my CV situation and that it would only take like 5 mins. imagine my horror when i walk into the building (it was a church not a wetherspoons if that matters) and i see 5 separate interviews taking place, with a waiting area and all. proper interviews. i almost sh*t myself on the spot. i have never done an interview in my life and had not prepared AT ALL so when they called me for my interview (i only had 5ish minutes to wait so i didn’t even have time to prepare then) i had nothing to go off of. i completely forgot to even introduce myself at the beginning andduring the interview i had no clue what i was talking about - ive never even been to a spoons before - and my dad phoned me 3 TIMES and for some reason my phone wouldn’t turn off. the only thing i did know off of tiktok is that when they ask “do you have any questions for me?” you always ask a question, so i conjured up some rubbish about how a spoons is a different working experience to another pub??? as if i had previous experience, which the interviewer KNEW i don’t as she had my CV in front of her. \ni was so embarrassed. my friend who started the interview before me finished hers around the same time (mine was so short i had literally nothing to say, probably lasted like 10 mins total) and the first thing she says is “oh my god you’re so red” and the interviewer laughs behind me. i literally have never been so embarrassed in my life. \nbut low and behold, they were hiring 80 people (like i said it’s a new establishment) and i got the job!!! i start later this month. this is a tale to all those who worry about their job interview, it probably went better than you think!",
      "subreddit": "interviews",
      "score": 261,
      "url": "https://reddit.com/r/interviews/comments/1onr10v/arrived_at_a_job_interview_without_realising_it/",
      "comments": [
        {
          "body": "I always say. You can bomb so bad in an interview but in turn you did well. This is what happened. You didnt give any red flags. I know this is restaurant industry but still you did okay. Congrats",
          "score": 51
        },
        {
          "body": "Just add it to your list of lessons learned.  Everyone has blown interviews - welcome to the club. Learn from it and move on. Congratulations on the offer!",
          "score": 9
        },
        {
          "body": "omg this happened to me too 💀 walked into what i thought was just an \"info session\" for a campus job and suddenly they're asking me about my 5 year plan and strengths/weaknesses.",
          "score": 2
        },
        {
          "body": "I went to an interview while in university as co-op program arranged by the school and several companies. Got called for an interview. 1st question, interviewer says \"So do you know what we do at our company XYZ?\" , which reminded me i totally forgot to even check before going in. I replied with a big sight of defeat \"sorry sir, I got caught up with school, midterms and interviews. i totally forgot to do my homework. we can end the interview now if you want, i'd understand\". We still did the interview but that threw me off the whole time, like I knew i was wasting both of our time at this point.\n\nDid not get the job.",
          "score": 2
        },
        {
          "body": "Sometimes we look for people with no experience because you don't have bad habits we have to work out. We can just mold you initially to what we need. As long as you can answer questions and do an ok job showing you are actually thinking you got nothing to worry about.",
          "score": 2
        },
        {
          "body": "A successful tactic to prepare for job interviews is to practice by putting yourself out there and having job interviews. \n\nYou learned a ton with this experience and can be more confident when you go for an interview for a job you do want. The more interviews you do, the better you will get.",
          "score": 2
        },
        {
          "body": "You lost nothing, you gained interview experience. NBD.",
          "score": 2
        },
        {
          "body": "Congratulations! I’m glad things worked out for you. \n\nAs far as the phone thing - I have my phone set that even if I have my phone silenced, my husband’s number will come through. I did this because of the many times I forgot I had my phone on silent and he’d call me while I was out and ask me to get something and I never heard it. \n\nSo anyways, I was at an interview and I silenced my phone. My husband knew full well I was at an interview. However, he must’ve forgotten what the specific time was. So while I’m in the interview I get a text message from him and it makes noise. I was embarrassed of course, I explained why that one came through, they didn’t seem to be too bothered about it but ughhhh I felt like it seemed like I didn’t even care enough to silence my phone. \n\nWhy didn’t I just turn it off completely before going in? Well I’m a walking example of how you can simultaneously be relatively intelligent but also a complete moron lol",
          "score": 2
        }
      ]
    },
    {
      "title": "Nervous For Your Interview? Nail these 12 questions...",
      "body": "Job Interviews can be SUPER awkward, but they don't have to be!\n\nIf you're in your head about them, they can feel like an FBI level interrogation.\n\nDespite not committing any crimes (that you know of), and maintaining total clearance from the FBI's Most Wanted list (obviously), you wonder to yourself, \"why the heck am I still so nervous\"?\n\nAfter all, that TED talk you watched on sales clearly told you that the worst they can say is \"no\".\n\nWell, sometimes it seems like a quick no might just be the best thing to end your misery.\n\nThe **TRUTH** is... if you are lucky enough to secure any interview, you are **MEANT** to be there! **Congratulations**! Less than 20% of applicants ever even get to the interview stage of a job posting. There was something about you that stood out, and the interviewer wants to get to know you. In fact, they probably want to hire you so that they can move on to the next person and get their promotion.\n\nI understand that this sounds great, but sometimes it takes more than a motivational Reddit post from a stranger. So, here are some concrete strategies for you to use in order to nail your next interview, for real.\n\n**12 Questions You MUST Nail Cold:**\n\n**1. \"Tell me about yourself.\" -&gt;** Uh oh... (relax). Remember, this is YOUR story! This is a softball question really, but it's one of the most important. Prepare your personal elevator pitch beforehand , assuming this question will pop up. Make sure to cover things like: Where you started your professional career, what you've learned along the way, and why this role makes sense for you now. Learn into the ambition and consider framing your pitch towards why you and your background provide real value to the company. I love animals as much as the next person, but telling them about how fluffy your dog Max is just isn't going to cut it here.\n\n**2. \"Why do you want this job.\" -&gt;** PLEASE resist the urge to respond with, \"to get that money\". The interviewer knows that you have bills to pay, they understand that and have them too. Stick to describing your personal alignment and connect their company mission into your own career goals.\n\n**3. \"What's your greatest strength.\" -&gt;** Calm down gym bro, they're not asking what your 1 rep bench max is. Show the hiring manager why you are a perfect fit for this job, and how you will excel in the role you're applying for. Tie your response to the job description, and show proof when possible.\n\n**4. \"Tell me about a mistake you made.\" -&gt;** Ok, don't get too personal here... Do be real, describe a mistake which can be clearly understood and identifiable. Relate it to a career experience if possible, and focus on what you learned from it. Be humble, and make sure they can trust that you won't make the same mistake again.\n\n**5. \"How do you lead / inspire others.\" -&gt;** Not in a culty way tho... Focus on how you exhibit empathy, and have a bias towards ACTION! Share a win with the hiring manager that improved your influence.\n\n**6. \"Can you multitask?\" -&gt;** Is that a challenge? No, it's not. There's a difference between watching TikTok while working and being able to prioritize tasks and juggle complexity under pressure. The more positive real-world and positive career related examples you can give here, the better.\n\n**7. \"How do you handle stress/challenges?\" -&gt;** Now is not the time to bring up your drinking problem (or solution?). Think about times when you were resilient and pushed through. If you can provide examples of problem-solving under pressure, that's a huge plus.\n\n**8. \"Tell me about a goal you hit.\" -&gt;** 10x'ing your money at the casino unfortunately doesn't apply here. Instead, use SMART goals + measurable outcomes. The hiring manager likely wants to make sure you can make progress towards and successfully meet objectives.\n\n**9. \"How do you handle conflict.\" -&gt;** Unless you're applying at UFC, boxing matches probably aren't allowed in the office. Tell the hiring manager ways which you have stayed collaborative with others during tense times. Focus on your conflict resolution skills, opposed to blame and deflecting onto others.\n\n**10. \"What's your biggest weakness?\" -&gt;** Remember the hiring manager is not your therapist, don't overshare here. Instead, find professional situations where you are able to demonstrate clear growth. Bonus: Make it job-specific and safe.\n\n**11. \"Do you have any questions for us?\" -&gt;** If you don't ask any questions here you might as well not even show up in the first place. This question is just as much a test from the hiring manager as it is to dispel any nagging questions you may have. You should have researched the company beforehand. You know this question is coming. Ask about team goals and objectives, success metrics, company cultures, time lines, etc.\n\n**12. \"Anything else to add?\" -&gt;** Oh baby, it's time to close. Nail this one and give the hiring manager a good lasting impression of you. Reiterate your belief that you fit at the company, and show genuine enthusiasm for the role. Show gratitude to the interviewer for their time, and ask them about the next steps.\n\nAt the end of the day, preparation is everything! Doing mock interviews out loud can be another great way to practice and get in those reps. Review feedback from past interviews if you have it, and record yourself to analyze your speech patterns and cadence. It can be awkward, but if you get hired on the first go, you hopefully only have to do it once.\n\nOf course this was a part humorous take on a very real situation that causes anxiety for many, including myself! Remember, at the end of the day, the person sitting across from you is also human. They have the same insecurities, emotions, and family to go back home to as you probably do. Really all an interview is, is a hyper formal conversation. Really, the worst they can say is no. And every no can ultimately lead to a yes.\n\nBest of luck! Let me know some of your tips and learnings down below, if you'd be so kind.",
      "subreddit": "interviews",
      "score": 168,
      "url": "https://reddit.com/r/interviews/comments/1m2g1ed/nervous_for_your_interview_nail_these_12_questions/",
      "comments": [
        {
          "body": "\"Help me understand this work gap on your resume\"  \n\"Help me understand this career transition\"  \n\"Why are you leaving your current position?\"  \n\"Are you ok with the posted salary?\"",
          "score": 14
        },
        {
          "body": "And what sort of drugs do you suggest so we can convincingly pretend this isn't a soul-crushing dehumanizing experience we go through just to not starve to death homeless?",
          "score": 7
        },
        {
          "body": "I have a phone screen this afternoon and this was helpful not to overthink it. Thank you!",
          "score": 2
        },
        {
          "body": "this is solid—especially for first-timers—but let’s be real: most people don’t fail interviews because they didn’t prep 12 questions\n\nthey fail because they:\n\n* ramble with zero structure\n* don’t actually answer the *why us* question\n* sound like they copied their resume off ChatGPT\n\nwhat separates candidates isn’t perfect answers  \nit’s clarity  \nself-awareness  \nand actually giving a damn about the company’s problems\n\nmock interviews help  \nso does recording yourself  \nbut the real unlock?  \n**think like a hiring manager**  \nwhat would *you* need to hear to take a bet on someone in 45 min or less?\n\nthat’s your target\n\n[NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has cut-the-BS takes on interviewing sharp and human—worth a peek",
          "score": 3
        },
        {
          "body": "Reposted with a more accurate caption, sorry folks! 😃",
          "score": 1
        }
      ]
    },
    {
      "title": "Tiktok Live Agency Operation Manager",
      "body": "Hi everyone,\nMy friend is gearing up for their third interview for the Live Agency Operation Manager role at TikTok, and this round is with the Team Leader.\nThey've passed the initial two rounds, which focused mainly on behavioral questions and basic platform knowledge. We're expecting this final interview to be highly strategic, focusing on leadership, operational excellence, and agency growth management.\n\nFor anyone who has experience in the TikTok Live ecosystem or has interviewed for a similar management/operations role:\n\n• What are the top strategic questions they should be prepared to answer? (e.g., related to compliance, scaling, or agency incentive structures).\n• What leadership qualities does the Team Leader typically look for in this specific, high-growth environment?\n• Should they expect to discuss specific LIVE KPIs (like UV, GLR, or Watch Time) and how to influence them?\nAny insights, common pitfalls to avoid, or specific examples of successful strategies would be greatly appreciated.\nThanks in advance for the help!\"",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p69db5/tiktok_live_agency_operation_manager/",
      "comments": [
        {
          "body": "Sounds like they're in for a tough one. From what I've seen with similar roles, they'll probably get hit with scenarios about managing underperforming agencies and how to balance growth targets with compliance issues\n\n  \nThe KPI stuff is almost guaranteed - definitely brush up on how UV correlates with retention and what levers actually move GLR beyond just throwing more creators at it. Team leaders usually want to see you can think beyond the obvious metrics\n\n  \nOne thing that trips people up is when they ask about scaling - don't just talk about adding more agencies, they want to hear about quality control and maintaining standards while growing fast",
          "score": 2
        },
        {
          "body": "I’d have them ready to explain exactly how they’d grow agencies while staying compliant, and how they’d move UV, GLR, and watch time with specific levers like creator quality tiers, live programming cadence, and reviewer escalation paths. What helped me was drafting a 90 day plan and a simple KPI tree, then practicing leadership scenarios like coaching an underperforming agency owner and saying no to risky growth. I ran timed mocks with Beyz interview assistant using prompts from the IQB interview question bank, and kept behavioral answers in STAR and under 90 seconds. Team leads tend to want crisp decisions, clear guardrails, and a plan to inspect what you expect. Good luck to your friend!",
          "score": 1
        }
      ]
    },
    {
      "title": "tiktok: lost an offer due to not speaking a billion languages",
      "body": "Rant: Just going to say that I passed a recruiter call, exam, interview with the HM showcasing design work, another interview with another HM, and then an HR call. I ended up not getting the role because another candidate could speak, apparently, English, Korean, Japanese, and Chinese fluently. Languages was not something on the JD at all. This was an instant offer for them because the product was shipping in other Asian countries. I don't know. Like, why even make me go through this long, tiring process to only get passed over due to languages. \n\nTo make it worse, during the last call with HR, I was told that the city the HM told me I could work in wasn't a guarantee and they’d have to pull some strings because the role is mainly wanted in WA. The JD said it was offered in my city. They also lied about the salary on the JD and I got lowballed. So, why even accept to interview with me during this process if nothing was set in stone? ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1nwas31/tiktok_lost_an_offer_due_to_not_speaking_a/",
      "comments": [
        {
          "body": "I saw a lot of TT roles requiring Chinese although the roles had nothing to do with working/shipping internationally, I think it’s because half of their teams only speaks Chinese and they need people to accommodate",
          "score": 2
        },
        {
          "body": "Does all of this begin to make sense if we consider that they don’t actually need a speaker of these four languages at all, so much as a justification for an h1b visa for someone who happens to speak those four languages? And that the lowball and location change were them trying to shake you off?\n\nI have seen JDs where they put four language requirements on it before that didn’t seem realistically required/desired for the position or even findable unless you already have the person, and I’m pretty sure this is what was happening there 🤷‍♂️. \n\nEdit: your namesake speaks Japanese lol maybe this is on you /s",
          "score": -2
        }
      ]
    }
  ]
}