{
  "company": "unitedhealth",
  "post_count": 8,
  "exported_at": "2026-01-18T17:44:53.312Z",
  "posts": [
    {
      "title": "Unitedhealth Group",
      "body": "Does anyone have experience with the digital video interview with UnitedHealth Group for an internship position? I'm worried because I've never done anything like this before (recorded interview). Will there be any technical questions?",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/443fpl/unitedhealth_group/",
      "comments": [
        {
          "body": "I just took it today. No technical questions. Just basic questions to get to know you. Good luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "Microsoft Team scammers",
      "body": "So this just happened lol. This is not my first time meeting someone on Microsoft teams for an interview. These are clearly scams!! No Employer will want to do a text/chat interview. Also who emails someone at 1 in the morning for an interview at 8 or 9am on the same day. How would I wake up to see that? Then the dates changed for the interview. It said today and the next email said tomorrow. Look at the email as well. Who puts “ugh” in a professional email?? They should be ashamed of themselves for pretending to represent UnitedHealth. I’m so sick and tired of these people!!!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1ibb1bk/microsoft_team_scammers/",
      "comments": [
        {
          "body": "Thanks for sharing this. I'm putting together some content on \"safety in applying for jobs\" and this a is a good email to reference.\n\nFor those reading, and hoping this prevents some of the readers for falling for such a scam: here's my read of this email as an HR consultant about flags seen here.\n\nRed Flag:\n\n* Second sentence is an odd fragmented way to start\n* Second sentence \"our appropriate department\" is not anything we'd expect to see\n* \"You have the required qualifications to proceed\" is generic language that doesn't even fit boilerplate templates. \"To proceed\" is technically ending the sentence incorrectly. Proceed to what? Through the hiring process?\n* The position is both Full-Time and Part-Time available. Except, more and more states require benefits and pay to be posted/communicated on the job post. So which is it?\n* \"To know more about our company\" is grammatically incorrect\n* \"*Kindly* visit\" \"Kindly reply\" is a common term used from scammers\n* A good chance that link is a phish\n* You're being moved forward for positions that have little overlap (A Payroll Clerk and Medical Assistant are far different than CSR/Admin)\n* Job Location \"Online\" is not a thing here. It's \"remote\"\n* Hourly salary is not a thing\n* Inconsistent placement of $ sign\n* Interview time unrealistic AND not timezone stated\n* \"Swift response\" is trying to instill a sense of urgency that isn't needed\n* \"in this position\" - which one? You're interviewing me for a lot of potentials\n* \"Indicating your interest\" - wait, aren't you setting me up for an interview?\n* No personalized sign off (generic UHG signature)\n\nYellow flags:\n\n* Jack Williams is a rather generic \"American\" name. Yes, there are people named this, but odd.\n* Lots of grammatical issues such as putting a capital every comma",
          "score": 5
        },
        {
          "body": "$30/hour for a completely online position where you have complete control over your hours was a massive red flag.",
          "score": 2
        }
      ]
    },
    {
      "title": "All I see is interns at the elite of tech, what about those who didn’t intern there ?",
      "body": "I’d love to see where you did your internships, I always see the Facebook intern on YouTube but what about the rest ? \n\nWould love to hear from you !",
      "subreddit": "cscareerquestions",
      "score": 31,
      "url": "https://reddit.com/r/cscareerquestions/comments/dc47jg/all_i_see_is_interns_at_the_elite_of_tech_what/",
      "comments": [
        {
          "body": "[removed]",
          "score": 11
        },
        {
          "body": "[deleted]",
          "score": 16
        },
        {
          "body": "I had a couple different internships- one was at a small biotech firm and the other at an aerospace shop in San Diego (a medium-large one, not one of the giants like Boeing or Northrop Grumman).\n\nThe folks on this sub sometimes forget that there's hundreds of thousands of companies in the U.S that employ software engineers, not four. Having a big name on your resume is helpful, in the same way that going to Stanford instead of State U is helpful. But the vast majority of us didn't go to Stanford, and we're getting along just fine.",
          "score": 7
        },
        {
          "body": "I interned at a large healthcare company in the midwest. \n\nWhat would you want to know?",
          "score": 4
        },
        {
          "body": "Currently interning at a startup with 4 people total. It’s great cause even though it’s small and only been around for about 2 years, it’s very successful so far and I’m getting great experience in business and programming. No I don’t make nearly the amount the Facebook interns do, but I help make genuine decisions for a million dollar company and that’s pretty cool.",
          "score": 3
        },
        {
          "body": "I interned at an elite dot com in LA, but as a help desk intern. End up getting a job as a software dev in another company, didn’t even know how to code before. Did testing first then went coding.",
          "score": 2
        }
      ]
    },
    {
      "title": "UnitedHealth Group Technology Development Internship",
      "body": "Has anyone here interviewed for the UHG tech development internship?\n\nIf you have, what’s it like? What do they ask? I’m a freshman in college majoring in informatics (not CS) so I’ve only taken basic programming and math courses.\n\nDo they cover algorithms / data structures / any other topics freshmen don’t usually know? If so, how do you recommend I prepare? Even if they don’t ask about those, how would you recommend I prepare for the interview?\n\nI understand that some applicants had to complete an OA while others went straight to the interview following the hirevue recording. I didn’t have to complete an OA (which I’m not sure is a good thing or not) but they emailed me to schedule a 45 minute interview, so I’ll probably do that next week.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/y4es51/unitedhealth_group_technology_development/",
      "comments": [
        {
          "body": "Actually interested myself to have a followup as well.",
          "score": 2
        },
        {
          "body": "Cool to see this on here. I interned with them 5 years ago. I’m sure the process has changed but I had 1 chat on campus with a business person. All behavioral. Then hour long chat with someone more technical the next week. I wasn’t asked any DS or algorithm questions. Just talked about my experience",
          "score": 2
        }
      ]
    },
    {
      "title": "Does anyone have experience with UnitedHealth Group/Optum's TDP Internship?",
      "body": "I'm more specifically asking for their Minneapolis based office. I had an on campus interview last week and I'm now being asked to come in for a group interview. I'm not sure if this means a group of people interviews me or if it's going to be a group of students being interviewed together. \n\nI didn't get the best impressions of the program from my campus interview. The program sounds impressive, but not necessarily something I think I would enjoy doing. The interviewer described the program as a \"shark tank\" challenge where interns are split into groups and work on something to present to executives at the end of the summer. I'd much rather work on actual work in a more realistic and typical office environment like I did this past summer. Can anyone give some insight on this? Did I get the wrong impression or is this job just not for me?",
      "subreddit": "cscareerquestions",
      "score": 11,
      "url": "https://reddit.com/r/cscareerquestions/comments/74in1w/does_anyone_have_experience_with_unitedhealth/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "The program is very different depending on what team you are put on. For some teams the \"shark tank\" project is their main project. But it is usually a project that the company would like to continue working on depending on how much work you get done over the summer. Other teams are allowed to work on projects that are currently being developed by full time employees, and their shark tank project is just a side project for them.\n\nI was in the 100% shark tank project side of things. I would say that I gained a lot of experience not only in software development, but also presenting my work and making sure that my work has value to the company. My team's project was picked to be continued by the company and was transferred to full time employees after we left. \n\nOverall I think the program is pretty solid and I think that most of the other intern teams I worked with were pretty satisfied with the work they were doing. ",
          "score": 2
        },
        {
          "body": "I interned there over this past summer. \n\nThe thing to be wary of, is that it is just a vague \"technology\" program. The office that I interned at, they hired almost all CS majors, but not everyone was doing software work, like we would have thought. My placement wasn't explicitly software development related. Those of us in that placement didn't really get to do any software work, unless we reached out to get put on another project to work on in spare time. \n\nOther than that it was a cool place to work and lots of great people. It's better than nothing, but do not expect that you will get to work on software projects with experienced developers as mentors.\n\nHaha, the shark tank thing. It's just a thing they do every couple of weeks for your group to present your project. More so about practicing presentation skills than actually trying to get the \"sharks\" to buy in or whatever that show is about.",
          "score": 2
        },
        {
          "body": "A friend of mine interned there and he hated it. I don't remember which area he got placed in, but he said he didn't learn much and that his position was basically that of a business analyst even though it was supposed to be a software engineering position. ",
          "score": 2
        },
        {
          "body": "Does anyone know what the full-time offer looks like?",
          "score": 2
        },
        {
          "body": "Was an intern last summer. Now a  full-time TDPer. I enjoyed my experience as an intern. However, I didn't participate in any sort of shark tank as I was the sole intern on my team. Your experience will definitely depend on what team you end up on but overall I'd say its a great place to work! ",
          "score": 2
        },
        {
          "body": "Mileage may vary, I was in Minneapolis last summer and I'm probably gonna go back for full time next summer. I had an amazing time, but I know people who had a terrible time. It really comes down to placement, your project, and your manager. The \"shark tank\" presentation isn't what it sounds like, you will be working on a normal project the sharks are just there to gauge progress, totally non-competitive.\n\nJust like any big company there is a chance you'll end up not liking your team, and there's a chance you'll end up loving your team. Either way you'll gain a lot of the soft skills required to succeed in the professional world, and you'll get free rent for a summer.",
          "score": 1
        }
      ]
    },
    {
      "title": "Comparing Offers",
      "body": "Hi guys. Thanks to this community's help, I've gotten two offers for this summer which I'm pretty stoked about :) I was curious if anyone had any advice about which one was better, though. I thought it was pretty clear cut but after discussing with family I'm not as sure.\n\n&amp;nbsp;\n\n**Offer 1**\n\nCompany/Industry: UnitedHealth Group\n\nTitle: Software Engineering Intern\n\nLocation: Phoenix, AZ\n\nDuration: 10 weeks\n\nSalary: $26 an hour\n\nRelocation/Housing Stipend: Housing provided\n\nAdditional Info: Full time offer for returning interns is 75k + 10k bonus\n\n&amp;nbsp;\n\n**Offer 2**\n\nCompany/Industry: American Express\n\nTitle: Software Engineering Intern\n\nLocation: Glendale, Arizona\n\nDuration: 10 weeks\n\nSalary: $36 an hour\n\nRelocation/Housing Stipend: $5000\n\n&amp;nbsp;\n\n**Reasons for offer 1:**\n\n* Return offer, pretty much guaranteed I'd be able to work at offer 1 after graduation.\n*  Offer 1 is 10 miles away, offer 2 is 35. I could continue living at home for a few years if I worked full time there.\n* CoL (IDK, this is what my family said)\n\n&amp;nbsp;\n\nI was incredibly excited about how good offer 2 was, but now I'm not as sure...",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/9lj78j/comparing_offers/",
      "comments": [
        {
          "body": "Personally, the Amex offer seems like it'd be much better for your career long term.\n\nA \"pretty much guaranteed\" return offer to me isn't a marker of a company that values talent and ambition. Do you just want a cushy job? If so, then maybe take the UnitedHealth offer.\n\nBut not only is the Amex offer better on paper, it pays substantially better, and is a much better name (IMO) to have on your resume. You'd probably also have some great networking opportunities by working there.\n\nIt sounds like your family want you to take the worse offer just because it's closer to home. That's not a good reason to me, especially when the other offer is still in the same metro area. CoL would be \"lower\" if you lived at home because you wouldn't have to pay for your own place, but... would that make you happy? Would you rather have some more independence? Besides, the higher pay would probably offset that anyway.",
          "score": 3
        },
        {
          "body": "I’ve had friends work at AMEX, you’ll get a return offer there too, it’s not incredibly difficult if you just meet expectations. i’d do AMEX",
          "score": 2
        },
        {
          "body": "Can you share your American Express Interview Process.",
          "score": 2
        }
      ]
    },
    {
      "title": "Waiting to hear back from applying to UnitedHealth Group's TDP",
      "body": "Hi there, I'm an applicant that is currently waiting on word for a potential second interview for the Boston location. My question is if there is anything I can do to further demonstrate my desire to work for UHG? Anyone I could contact or what would strengthen my application?\n\nTo be totally honest, UHG's TDP would be my dream job. It would give me the opportunity to work on my development skills and make me a better developer. I know people who work in the TDP and hearing what they do and how they treat it makes me place it as my highest career goal.\n\nI am a web developer primarily, and I'm taking a udemy course in Java to learn more software development. I'm pushing myself to keep learning and building apps, so I can prove to myself that I'm doing what's needed to improve myself. I do not have a CS degree, so I'm aware that puts me behind the curve from other applicants, but I still build and try to learn as much as I can to make up for that.\n\nI hope that my questions are specific enough, and if you need more info, PM me.\n\n*Update: Coming up on the third week since I submitted my first round interview (recorded online interview). Any idea what this might mean?\n\n*Final Update: They rejected me.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/5xybmy/waiting_to_hear_back_from_applying_to/",
      "comments": [
        {
          "body": "You should also try for Cigna, Travelers and The Hartford, they all have the same program.",
          "score": 5
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "I received two job offers but I'm torn on which one to take...",
      "body": "So after several months of searching I finally landed two job offers. One job is at Unitedhealth Group for an adjustment representative position and the other is for a documentation processing position at a regional law firm that deals with foreclosure. \n\nBoth positions pay roughly the same and are about the same distance from where I live but PTO and benefits are way better at UHG. I was told the position at the law firm will be automated by software in about 6 months which would essentially cover all tasks of said job. My interviewer, who will also be my supervisor, told me I would be moved to a quality control analyst position after the automation took effect. The law firm seems way more chill and laid back, where at United I know it will likely be more stressful. The recruiter told me the position at United would be in a call center type of environment where calls would be monitored and rated. I would be on the phone 30-40% of the time and the rest would be spent working on adjustments. \n\nShould I go with the job at the law firm, or could I risk unemployment once the automation takes effect? I believe both are good jobs, however I'm unsure which one would be the best to take. I tend to be on the socially awkward side so I'm unsure how good of a fit I would be as an adjustment rep. I've had customer service jobs in the past but they've been hit and miss for me. Is there anyone out there who's had experience with adjustments or United in general? \n",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/19cgxq/i_received_two_job_offers_but_im_torn_on_which/",
      "comments": [
        {
          "body": "go for the benefits",
          "score": 2
        },
        {
          "body": "Law firm, the stress at the call center will not be worth it.",
          "score": 2
        },
        {
          "body": "Please take the law firm job. I worked at a call center for 2 years to get me through college and the hours/job/limitations/anal management made it a terrible experience",
          "score": 2
        }
      ]
    }
  ]
}