{
  "company": "visa",
  "post_count": 71,
  "exported_at": "2026-01-18T17:44:53.313Z",
  "posts": [
    {
      "title": "Just got offer 3 months after layoff",
      "body": "Applications: 600 - 700 (stopped keeping track around 450, just seemed like a waste of time)\n\nOA = online assessment\n\nI’ve got about 2 years of experience as a full-stack dev and I was laid off in May. The process was definitely tough, but a few things helped:\n\n* Make sure your resume is solid (I used the Tech Handbook layout).\n* Apply smart on LinkedIn — be early, target jobs that are actively reviewing, and filter by recent.\n* Practice behavioral questions and do LeetCode. Honestly, if you’re not willing to grind some LeetCode, you’re basically out of the running for a big chunk of companies.\n* Use AI to help prep for interviews \n\nI ended up landing my offer after a long take-home project (10–11 hours) and a final round where we dug deep into it.\n\nIf relocation is an option, it really opens up your opportunities (though I get that’s not feasible for everyone). And just as a note of encouragement: if you’re unemployed, try to limit your time on this subreddit — it can sometimes be rough on your mental health and skew how you view the market. \n\n\n\n**Offer: 130k, near boston, hybrid**\n\n  \n❌ Failed Early (Prescreen / Round 1 / OA)\n\n* **Suralink** – Round 1 (behavioral + technical) → **failed**\n* **Esper** – Round 1 → **failed**\n* **Iodine** – Round 1 passed → **failed OA**\n* **UKG** – **failed OA**\n* **Capital One** \\- **failed OA**\n* **Red Ventures** – **failed prescreen**\n* **Third Eye Software** – Prescreen → **they hired someone else**\n* **Koch** – **failed prescreen**\n\n# ❌ Advanced but Eventually Rejected\n\n* **Sahaj** – Round 1 passed → Take-home project → Round 2 pair programming → **failed**\n* **Visa** – OA → Round 1 passed → Round 2 final (3 × 1-hour interviews: system design, coding, build a feature) → **failed**\n\n# ✅ Offer\n\n* **Company that hired me** – Prescreen → Take-home project (\\~10 hours) → Final interview (1-hour deep dive on project) → **hired**\n\n# ⏳ Pending / Uncertain\n\n* **Raytheon** – Recruiter screen → Panel interview (not done yet, prob won't do). Pays \\~$40k less but in same area as the job I took, so really no point ",
      "subreddit": "cscareerquestions",
      "score": 245,
      "url": "https://reddit.com/r/cscareerquestions/comments/1n2xntz/just_got_offer_3_months_after_layoff/",
      "comments": [
        {
          "body": "10 hour take home project lol?",
          "score": 154
        },
        {
          "body": "I'd say 130k/year with 2 years of experience was worth the trouble. Congrats! Nice job!",
          "score": 34
        }
      ]
    },
    {
      "title": "Visa Inc. Interviews",
      "body": "Hi everyone! I have an upcoming 2nd round with visa as a project analyst, I do not have a lot of information regarding it other than that it will be an hour long. Does anyone have any experience of giving an interview with them? if yes, I would really appreciate insights &amp; tips! Thanks!!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1e97xds/visa_inc_interviews/",
      "comments": [
        {
          "body": "What role is it for?",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview rant: why even bother inviting me??",
      "body": "So I had an interview recently for a customer service role and honestly I left feeling super frustrated.\n\nRight at the very start, the interviewer asked about my visa status. Which btw, I had already put in my application and talked about during the screening call. Then they go, “we don’t really see long-term commitment from you” because of it. Like… why invite me in the first place if that was already a problem??\n\nI spent time prepping, took an hour to get there, and then basically got told the interview was pointless before it even started. At one point they even asked if I “wanted to proceed” since they didn’t see the point. And the tone throughout was just condescending and discouraging.\n\nI don’t mind rejection, but this just felt like a total waste of time and honestly really unprofessional. If my visa was going to be an issue, they could’ve told me that upfront instead of dragging me all the way in.",
      "subreddit": "interviews",
      "score": 20,
      "url": "https://reddit.com/r/interviews/comments/1msnrf0/interview_rant_why_even_bother_inviting_me/",
      "comments": [
        {
          "body": "Most likely they probably have someone in mind or maybe just something about you that they just didn’t like (not even something I would bother worrying about).  I had an interview once where I got on the phone with HR, she immediately asked the salary range I’m looking for, I provided my range.  She immediately said that I was out of their range which was a blatant lie because their range was in their job description.  We ended the call right there.  It was a total waste of my time.  \n\nIt just happens sometimes and it’s horrible.  I would try not to let it bother you.  I’m not really sure what you can do about it.  I would just move on.",
          "score": 5
        },
        {
          "body": "Honestly, you got rejected for something they didn’t talk about and which they probably didn’t notice until you showed up in person.",
          "score": 1
        },
        {
          "body": "It's crazy that you have to commit to a long-term commitment to do a job that won't commit to you. You don't even know what to say in the interview because half of the jobs want you to stick around for the rest of your life and the other half know that you're only going to be there for a couple of months",
          "score": 0
        },
        {
          "body": "Aren't you glad they didn't offer you a job?\n\nDid you ask them why they wasted your time?\n\nWhat are you going to feel in 60 days when you see the exact same ad again?",
          "score": 0
        }
      ]
    },
    {
      "title": "I have 7 years of professional experience as a software developer. Yesterday, I got rejected from my dream job",
      "body": "I share this for people starting and for letting them know that failure and rejection can also come for \"experienced\" developers.\n\nI have been working remotely for US companies since about 2 years ago, before that all my work was on local (Guatemala) companies. I started looking for relocation jobs at the end of August, because I really wanted to grow my career and also improve my quality of life. My first go to was New Zealand or where ever in Europe, since the visa sponsorship paperwork and so on is way easier than for US o Canada.\n\nGiven that I've worked in a little bit of everything in a lot of side projects, I applied to Python (6 years of experience), Data Engineering (2 years of experience) and React jobs (1.5 years of experience). I only received positive replies from 3 companies, one from Netherlands (React), one from NZ (Python) and one from Germany (Python/Django). By far the one that excited me the most was the Django one, since I worked with it for about 4 years and really loved the framework.\n\nThat company set a very open 7 steps hiring process, which included everything from code challenges, questions and pair programming. I really liked their openness and culture they seemed to have just by talking with the guys from the hiring process. I prepared as much as I could, given that I haven't worked with Django in the last year and a half at this point. I had 2 hours to complete the code challenge part, but I got a bit too nervous and miss understood the instructions for one question. That held me back and I almost didn't make it to the end with the other. In the end, I only finished 4 out of 5 challenges.\n\nAfter reviewing, they replied back saying they were not going forward with my applications given my performance on the challenge. The guy who was guiding me through the process was very kind and gave me general feedback about what I could have done better and what other key points I missed. It turned out I miss way more than I thought (around 4 key aspects), so it made sense for they not to choose me.\n\nStill, I am very disappointed on myself and it really, really sucks. I just wanted to share this with the community because failure and growing still comes even after you have been doing this for a while. I will go back to the training grounds and try to get better in order to land that dream job that allows me to relocate.\n\nBest of luck to everyone looking for that job.\n\nEdit: For clarification, I got rejected in the 4th step of the process and it was just one challenge with 5 different questions / tasks. I honestly don't feel like the company had a bad process, given that the things they looked for on the feedback were not there and it wasn't like \"you have to finish 5 out 5 and that's it\".\n\nThen, it wasn't just like \"You didn't make it, better luck next time\". The guy reviewing actually took the time to give deeper feedback with links and references on how to improve. In the end, I am by no means mad at the company, just a bit mad at my self lol.",
      "subreddit": "cscareerquestions",
      "score": 1426,
      "url": "https://reddit.com/r/cscareerquestions/comments/iycxd4/i_have_7_years_of_professional_experience_as_a/",
      "comments": [
        {
          "body": "Failure always happens, good luck in your next interview!!\n\nAnd somewhat relevent:-\n https://www.youtube.com/watch?v=t4A-Ml8YHyM",
          "score": 314
        },
        {
          "body": "Not getting an offer from my dream job was the best thing that ever happened to me.\n\nI had always wanted to work for a toy company.\n\nBack in February, I had applied to a very well-known toy company that I had a lot of strong childhood ties to. They flew me out for an in person, everyone I spoke to seemed to adore me, everyone telling me \"we look forward to working with you!\"I had no doubt in my mind that I was going to get the job and saying I was on cloud9 would be an understatement.\n\nWhile waiting for their offer to come through, I had another offer on the table from a cyber security company.  A product I barely understood and couldn't even begin to see the fun in. They wanted to hire me badly and I kept holding them off while I waited for the toy company offer I was sure I was going to get.\n\nEventually the cyber security CEO had a call with me and simply said, \"is it money? Give me a number and I'll do everything I can to make it happen\"\n\nI decided to give a salary demand that was my \"set for life\" amount and hope that they would either have to seriously consider it and get back to me (giving me more time to hold out for the toy company offer) or I'd make really good money and that'd be enough for me.\n\nA few moments after I sent that counter offer, I got a response from the toy company that they would not be continuing the interview process.\n\nThe cyber security company ended up giving me that \"set for life\" salary I requested, and the work has been anything but the bland and stressful work I had expected.\n\nIt is my ultimate dream job, who have treated my right since day once .My team I work with is amazing and we are a perfect balance of strengths, my manager lets me set my own hours and has utmost trust in me that I get work done. There isn't a minute of micro managing he's ever done. I'm constantly challenged in the exact ways I want to be challenged and am given enough breathing room to learn while I work.\n\nIt was losing what I thought was my dream job offer that landed in me in the dream job I didn't know I wanted.\n\nWhile it may not happen as fast for you as it did for me, this could easily be a moment where you don't know the best is yet to come, but it sounds like you already have that mindset!",
          "score": 344
        },
        {
          "body": "&gt;The guy who was guiding me through the process was very kind and gave me general feedback about what I could have done better and what other key points I missed.\n\nI wish every company did this without asking. Some of them aren't even kind enough to send a rejection mail.",
          "score": 58
        },
        {
          "body": "You don't know how much I dislike companies that do these coding interviews/challenges, they're so useless and won't tell you the true quality, capacity and experience of a developer.\n\nI've worked with \"developers\" that pass those tests with flying colors, but at the moment they have to code real life requirements, they hardly can manage, or they can hardly debug code that already exists.\n\nI'm in the process of finishing the cleaning of a library that was coded over the years by different developers, some days I want to cry, others I want to kill someone, and not because I'm the best developer in the world, I'm not even close, but I don't make 5 calls to a database in the same method, with the same query and 5 different connection objects, I do it once, store the result and reuse it 4 more times before disposing it. And these was coded by these developers that passed the coding tests... and I can keep going\n\nSo don't feel bad, you're not a bad developer, is just stupid what companies do, and to a point I understand them, we had an issue with a developer that we swear the person we interviewed over the phone was not the person that showed up to the office (since then the remote interview process changed)\n\nKeep looking, this is going to be a long and extenuating process, I have 20+ years of experience developing and is not easier for me than for you. Good luck!!",
          "score": 168
        },
        {
          "body": "After coding (and being a hiring manager on and off) for 20 years now, I feel very strongly that a good developer is someone who can communicate clearly, politely and honestly while completing coding tasks.  I do not feel that coding quickly or with cool tricks has anything to do with being “good”.   If a coder cannot work with teammates or rejects requirements or makes everyone else on the team feel like shit, they are not “good”.   No one gets to work in isolation and being a good programmer means being a good team player more than anything else.  \n\nI’m sorry you got rejected, but, seriously fuck them.",
          "score": 124
        },
        {
          "body": "I wouldn't wanna work for a company that makes it impossible to get the job. LeetCode question is  fine but 5 challenges and at the end get rejected,WTF?",
          "score": 70
        }
      ]
    },
    {
      "title": "As a hiring manager: I'm sorry I didn't get back to you.",
      "body": "From browsing this sub it seems there's a lot of people trying to land their first job in software development in here and a lot of people finding the market tough, frustrating and lonely. That feeling is only amplified when you spend time applying for an entry level role at a tech company and not hearing anything back. Perhaps an automated \"sorry you weren't successful\" email. But no reason, no feedback on your resume, nothing you can take away from the process to learn from. I've been there. I was a junior engineer once and trust me I do have an enormous amount of sympathy for you. \n\nBut I wanted to write this post to shed some light on _why_ you don't hear back from us, as a hiring manager. If only to offer you some consolation that sometimes it really isn't you, it's us.\n\nI recently opened a role for an entry level software engineer. When we hire for these roles we are looking for someone with a bachelors in computer science or related field _or equivalent experience_. That last part is on you to convince us you have equivalent experience. You also need the right to work in the country as we don't generally sponsor visas for entry level SWE roles. So anyway. I opened a role and posted it on LinkedIn. I had 850 applications. For 1 role. \n\nI believe this is fairly typical of big tech these days. \n\nWith my partners in the recruitment team we did our best to screen the applications. Screening 850 takes a lot of time so we do keyword searches for the city our office is in and for other related terms we think might bring this number down. \n\nWe screened 20 candidates, interviewed 12 for round 1, interviewed 4 for round 2, and hired 1. Because we only had 1 rec open. Our interview process takes about 3 weeks from screening, and during that time the role remains live. We had new applications come in while those 4 people were doing on site interviews. Unfortunately that meant many perfectly good applicants never even got into the interview stages. Along with the hundreds of other applications we did not get around to looking at. All these people. About 849 were rejected. I cannot write 849 personalized pieces of feedback. I feel bad about that, but it is what it is. \n\nWhat I want you to take away from this is that in the current market, there is a degree of luck. You need to apply early. You need to have the right arbitrary words in your resume. And you need to interview extremely extremely well. But ultimately, please don't take it personally if you get ghosted by a company you apply for. More often than not it isn't a reflection on your skills. Keep applying. Keep re-applying. Keep asking for feedback after you get rejected. And keep motivation. I wish I could end this apology with something more positive but I can't. Comment if you have any questions.",
      "subreddit": "cscareerquestions",
      "score": 525,
      "url": "https://reddit.com/r/cscareerquestions/comments/1et7q2g/as_a_hiring_manager_im_sorry_i_didnt_get_back_to/",
      "comments": [
        {
          "body": "The legitimate complaints I’m aware of are referring to the lack of following up while interviewing for a company. Being ghosted in the interview process. Some companies reach out months later, some never say anything after you’ve gone through rounds and you’re left wondering if it takes them that long for the interview process or if they just aren’t interested. \n\nThe bummer is when you’ve accepted another role but really wanted the other that ignored you for months and now want you. ",
          "score": 216
        },
        {
          "body": "I don't think anyone is complaining about not hearing back from a cold apply. However; in my search, which I'm nearing the 2-3 month mark, I have been ghosted by five interviews. Hiring managers just interview then you don't hear back for a week, then two, then three, etc. I have reached out too and they just keep moving the bar. \"Sorry, I was out for personal reasons\", \"Sorry, we thought we sent this\", \"We are still interviewing candidates and will get back to you next week.\" It is just frustrating because I have experience, I have a website, I have references, I have personal projects, I'm hoping to resuscitate and combine some open source projects here in the next few weeks, mainly because I think they would be useful and utilize, to me, a lot of interesting technology. You should have at-least written 11 thoughtful replies to those you did interview, give them a timeframe and please, stick to it.\n\nI am venting a little here but feedback is incredibly useful for anyone who you atleast spoke too, even if its just a phone screen. Right now I send off a lot of applications because I never know if someone will reach out, even if its for another position or a recruiter but talking to actual humans is probably the most reassuring part of the process. Even if a tech interview is a complete failure, just being given the opportunity is gratifying on some level.",
          "score": 120
        },
        {
          "body": "Why not take down the posting once you are no longer going to consider anyone who applies for it? That’s the part where people’s time is being wasted totally unnecessarily, there is virtually zero chance they even get an interview when they apply at that point.",
          "score": 145
        },
        {
          "body": "A story from my many applications: I was applying to a VP Eng position in a small firm.  (probably over my head, but.. \"When someone asks if you are a god. YOU SAY YES!\") no red flags.  Things seemed to be moving well, got along with interviewers etc.\n\nThen they went DEAD silent.\n\nAbout a week or two later I call the recruiter.  He'd been laid off, and the hand-off to handle me got messed up, though I don't think it was going anywhere.\n\nBut it gives you some of the strange reasons why you might get ghosted.",
          "score": 16
        },
        {
          "body": "&gt;interviewed 12 for round 1\n\nIs it hard to send a mail to 11 candidates letting them know that the position has been filled?",
          "score": 99
        },
        {
          "body": "Mirroring what everyone below said\n\n\nAlso, why isn’t your company sending out automated emails when the position has been filled. Personalized messages for the people you were interviewing in later stages\n\nJust seems strange that a software company would rely so heavily on manual input for a task that’s relatively automatable  ",
          "score": 37
        }
      ]
    },
    {
      "title": "I feel so defeated trying to get a software engineering job. Is it me or the market?",
      "body": "TL;DR: Barely getting interviews. When I do I get rejected. \n\nI graduated in 2023 with a degree in computer science. I have been working at a QA role as that was all I could get at the time. Since then I have started my journey to get my master's is Georgia techs OMSCS program. \n\nRecently I have been trying really hard to get a software engineering position as I want to actually write code and I could use a pay bump. \n\nUnfortunately I just keep getting rejected and it's really getting to me. There aren't many jobs getting posted that I'm qualified for (in Denver metro) and the majority I do apply to I either get rejected without an interview or never hear back. \n\nI'm writing this because recently I did manage to land a couple interviews. One of them with a small company was just a chill behavioural interview, mainly going over my resume. I also interviewed with Visa. I went through a phone screening, then take home coding assessment, then interview with hiring manager. \n\nI'm really just at a loss of what to do now. I thought the Visa job would have been great for me and aligned perfectly with my experience. \n\nIf you've read this far thanks for listening to me vent. Any advice would be very welcome.\n\nEdit: A little more insight into my resume/qualifications. I have a couple full stack web apps on my resume. These are personal passion projects and not just copy paste from a YouTube video. Additionally I have an AWS developer certificate and I had a software engineering internship in 2022. ",
      "subreddit": "cscareerquestions",
      "score": 196,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ihipje/i_feel_so_defeated_trying_to_get_a_software/",
      "comments": [
        {
          "body": "Both, probably. Limiting yourself to one area in this market is going to make things extra tough.",
          "score": 131
        },
        {
          "body": "Why didn’t you take the job bro. Engineering is one of those fields where experience &gt;&gt; grad school unless you wanna be a professor or work in r&amp;d",
          "score": 34
        },
        {
          "body": "Impressed you’re getting interviews with 1 year of experience.",
          "score": 12
        },
        {
          "body": "Once you get into QA it’s really hard to break out into a sw engineering role. Think about it, why hire you as a software engineer when there are so many experienced software engineers looking for a job already? You could try to improve your coding skills by contributing to small coding projects at your current place to get more experience and hopefully something will open up at your current place? Sorry , I know this isn’t really helping.",
          "score": 21
        },
        {
          "body": "It's a tough market out there. Just be persistent and keep pushing. You have the qualifications. You just need a break in. It's just a matter of time and energy.\n\nDoes your manager at your current job know you want to be more than QA? Internal hires are always easier to get.",
          "score": 13
        }
      ]
    },
    {
      "title": "About to quit my job without a new one lined up to take a 6-12 month gap year/career break in Japan with only 2.5 years engineering experience? Am I making a terrible decision?",
      "body": "Hey everyone,\n\nI'll save you all the specifics but basically I'm extremely burnt out from my job (software engineer, 2.5 years experience, large financial institution), mostly due to my team's work culture and feeling like I'm getting bullied/actually getting shouted at by some of the senior members of my team who've been at the company for decades. It's gotten to the point where it's really hurting my mental health and I'm sleeping terribly. I dread my morning standup everyday. I'm at a crossroads where I'm looking for a new job to escape this current toxic one, or spend 6-12 months working/traveling in Japan on a working holiday visa. This is something I've always wanted to do. I've learned a lot of Japanese over the years (almost conversational) specifically for this and have enough money to last me for the year or even longer. I'd put it off for another year or two to improve my career prospects but I'm not getting any younger and want to do this while I'm still 20 something. The only thing stopping me is the fear of getting a new job once I return to my home country (New Zealand)\n\n**My main question for you all is**, how much of a hit would I be taking by quitting my job without a new job lined up when I only have 2.5 years of experience as an engineer? How bad will a 6-12 month gap in my CV look? And how difficult will it be to find a job once I get back from traveling? While overseas I do plan to keep my skills up to date by regularly doing leetcode, personal coding projects, online certifications and even still applying for jobs just to get used to doing interviews and seeing how employable I am. I understand that a lot of us are struggling with the software job market right now so this might actually be the worst time to get up and leave when I should instead look for a new that's hopefully not so toxic while I still have my current one. But the longer I wait the more difficult it becomes to go on big trips like this when I could be tied down with family and relationship commitments once I get into my 30s.\n\nCurious to hear peoples thoughts! Am I about to make the worst decision of my life?\n\nEDIT: Thanks for all the responses everybody! Really appreciate it even if some of you are brutally honest and giving me a reality check haha.\n\nI was moving house the past day or two so didn't have much time to respond but I'm looking through all the comments and responding to your messages now.\n\nI want to clarify that while I'm in Japan I would mostly be volunteering at places like hostels, farms, schools etc across the country which would offer free accommodation in return for about 10-15 hours work per week. I'd then use my free time to explore these areas but also be spending some of my free time building up my coding skills and my portfolio so that I'm more employable when I return. I visited Tokyo for a couple weeks last year specifically because I wanted to get a feel for if I'd enjoy being here long term and I had a great time.\n\nOn top of this, while I am burnt out from my job, it's not just the burnout that makes me want to do this. I've always wanted to do this year in Japan since I was a little kid. Even if I was happy in my current job I think I'd still be considering this. Right now certainly isn't the best time to do it but I don't think there will be a good time to do it or even a better time to do it. I will be hurting my career somewhat my making this move. Maybe the industry gets better in a couple years, but then the older I get the more I'll be tied down with serious commitments like a relationship, family, mortgage and all those exciting things.",
      "subreddit": "cscareerquestions",
      "score": 142,
      "url": "https://reddit.com/r/cscareerquestions/comments/1i2ni1b/about_to_quit_my_job_without_a_new_one_lined_up/",
      "comments": [
        {
          "body": "U may or may not be fucked. We don’t know what this year entails",
          "score": 235
        },
        {
          "body": "&gt;Am I about to make the worst decision of my life?\n\nYou'll never know; maybe it will be the best decision of your life, because nothing is more important than mental health.\n\nPersonally, I made that decision last year for the exact same reason (burnout). I had 5 years of experience and took a career break. It was a good decision at that time; I traveled and enjoyed it mostly. Life is not only work and money, and we should seek new experiences; that was my mindset. I was confident in my skills and thought getting a new job would be easy at this level.\n\nNow looking back, I was wrong and should have been more careful, because the market is/was really bad. I didn't know that, because I was not actively looking for jobs for a long time and thought my qualifications would save me.\n\nI have been looking for a new job for the last 3 months with no results. I get interviews; I am actively applying; I am good technically, but struggling to find a job a little bit.\n\nLook, I am not saying that you shouldn't take a career break for your mental health, but if you aren't really confident in your abilities, are up to date with technologies, and have a solid portfolio of interesting projects, I would be more careful taking a career break. Especially for 1 year.\n\nI am saying skills and portfolio because part of the reason why I think I am struggling is that my skills are a bit outdated and my portfolio is nonexistent. Currently working on all of this, I am not desperate, but that's a lot of work, and the market is shit. \n\nPlease take my experience with a grain of salt, because markets and technologies might be different.",
          "score": 52
        },
        {
          "body": "Do you have the bank of Mommy and Daddy to support you if you can't find a job when you return?  I wouldn't do it if I had a chance of being homeless if my savings ran out.",
          "score": 25
        },
        {
          "body": "[removed]",
          "score": 121
        },
        {
          "body": "I did something similar. If you're confident in your general ability to gain employment then I wouldn't worry about it. Lots of employers will even find it admirable that you did some traveling, plus it's a fun talking point when you get back.\n\nI'd probably take some time while traveling to work on a side project though. You can use it to fill the gap on the resume until the title \"open source contributor\".",
          "score": 71
        },
        {
          "body": "Do this, start doing the bare minimum at your current job and start interviewing -&gt; get an offer -&gt; let them know you need some time off, maybe push the start date to 3 months later, quit your current job -&gt; spend 2 months in Japan to experience life, come back and start your new job.",
          "score": 17
        },
        {
          "body": "[removed]",
          "score": 36
        },
        {
          "body": "I understand why people are telling you to do it but they aren't the ones who will face the consequences if you can't find another job which is a real possibility.\n\nFirst thing first, you need to address the mental issues. You need to see a therapist and maybe a doctor.\n\nYou are just fleeing the problem and not addressing the issue, so yes, you are making a terrible decision.",
          "score": 57
        },
        {
          "body": "Good idea for your career? Absolutely not. Great life experience? Maybe. Just depends if the reward is worth the risk for you.",
          "score": 13
        },
        {
          "body": "Had a friend do the exact same thing to pursue streaming. That was 5yrs ago, and he still hasnt found a job yet, and never found success in streaming either.",
          "score": 37
        }
      ]
    },
    {
      "title": "Should I quit my Amazon London job to job hunt from Canada?",
      "body": "I graduated in July 2025 and moved to London for an SDE role at Amazon. A couple months in, my manager left, then Amazon did a 10% layoff (I survived), and now my manager’s manager is likely leaving too. There’s probably a reorg coming in the next two months.\n\nBeyond the work instability, I just don’t like living in London. It’s isolating and uninspiring, and I don’t see myself staying long term regardless of how the job goes.\n\nI’m a Canadian citizen, so I can work in the US on a TN visa without the H1B lottery. I’ve been applying to new grad roles in California and New York, but the window is closing since most programs want 2026 grads now. I’ve sent about 100 applications and gotten 2 interviews, neither of which converted.\n\nThe problem is the time zone. I work 10 to 6, then interview at 7pm their time. I’m exhausted by then and I know I’m not performing my best. If I moved back to Canada and lived with my parents, I could interview during normal hours, rested, with no financial pressure.\n\nBut my family says I should stay until I have an offer. And I’ve quit something early before (an internship with a bad situation) and ended up wasting the unstructured time.\n\nThe reorg will probably reset my progress anyway, and I don’t really care about getting promoted here since I just want to get to the US. But Amazon is still a decent learning environment, and leaving means giving up something that’s at least okay for something uncertain.\n\nFor those who’ve been in similar situations: is it worth quitting to job hunt full time, or should I tough it out until I have something lined up? How competitive is the junior market right now for someone with 6 months of Amazon experience?​​",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1q13cuy/should_i_quit_my_amazon_london_job_to_job_hunt/",
      "comments": [
        {
          "body": "No it’s not. Never quit your job before getting another in line unless it’s for serious health reasons.\n\nAlso layoffs, re-orgs, people leaving at the company is gonna be relatively common. I wouldn’t even call it instability.",
          "score": 34
        },
        {
          "body": "I was in a similar position to you when I was a fresh grad, decades ago. \n\nThe fact is you don't have a lot of experience. At this part of your career you need to build up experience and your skill set. \n\nRemember Amazon is a US employer too. Stay there three years, then ask for a transfer to US offices. Amazon has dedicated teams to transition people from different countries. I work for a F500. \n\nDon't quit, just keep trying your best and learn. If you get laid off, you'll get redundancy. \n\nIf you really want to leave, then leave when you find another grad role. Take the day for interview days, so you can be well prepared. \n\nThe job market everywhere (US, UK, Canada, Europe) is all pretty bad right now, with less employers hiring grads too.",
          "score": 13
        },
        {
          "body": "You’re going to quit your entry level CS job voluntarily in this economy!? My brother in Christ, unless you have family wealth, you hang tight until you find a replacement. Then make your move.",
          "score": 9
        },
        {
          "body": "Why don’t you just take PTO on the days you have interviews",
          "score": 5
        },
        {
          "body": "I was in the exact same situation as you. Work in Amazon but dislike the place I'm in. I also left London cause I felt the same there.\n\nI'd highly recommend staying, you won't regret it. Just the fact you have to interview when you're tired is not worth quitting, especially as a new grad in this insane job market. Nobody is stopping you from applying elsewhere, so you can always test out your opportunity while working and gaining experience, which will make you more valuable. Moreover 6 months is just way too short, most employers probably think you're not even giving it a shot. If you stay a couple years and get promoted to L5 you would be able to transfer to the US with no problem.",
          "score": 6
        },
        {
          "body": "You may be overestimating how easy it is to get a job in the US on a TN visa. They still prefer to hire Americans, and there's no shortage of qualified Americans in this market.\n\nTN also only applies for programmer analyst roles, not every development role.",
          "score": 5
        },
        {
          "body": "Kids these days don't understand the concept of paying your dues. It seems to be a generational thing (I say this as one of the older generation). \n\nStay. Put the work in and make the most of it.  People respect those who put the time in and did all the unsexy stuff while they built themselves up. \n\nIn the meantime while you are there join meetups, take up a hobby find some things to get you out and exploring your surroundings. 20 years later you don't want to regret not doing all those sightseeing trips you had the opportunity to.",
          "score": 6
        },
        {
          "body": "why do we get so many posts from people who just want to quit and dont understand the math of bills. is it cause mommy and daddy support you?",
          "score": 12
        },
        {
          "body": "Don't have much advice, but i would like to ask, is living in London really that bad ? I mean it's one of the most interesting cities in the world, why did you feel isolating?.",
          "score": 3
        }
      ]
    },
    {
      "title": "What kind of visa do I need for onsite interview in London?",
      "body": "I interviewed at a top 10 company last week and they are now inviting me for onsite interview in London.\nBut, I am from India and would require Visa to travel to London.\nThe recruiter just mentioned about sponsoring flight tickets and said nothing about Visa.\n\nHow should I ask recruiter that I need a Visa ?\n",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/5ck3d6/what_kind_of_visa_do_i_need_for_onsite_interview/",
      "comments": [
        {
          "body": "Ask your recruiter for assistance with getting the visa / call your nearest British Embassy and ask them what kind of visa to get.",
          "score": 5
        },
        {
          "body": "I'd be nervous that the British company isn't helping you with this.  \n\nCan you trust them for the whole process of getting a work visa if they accept you?",
          "score": 3
        },
        {
          "body": "What /u/JerMenKoO said.\n\nContact the embassy to figure out what kind of visa you need (probably it's the standard short-term visit visa, but it's better to double check).\n\nThen contact your recruiter and ask them to send you some kind of document confirming that you will be interviewing with them and that they will sponsor your flight tickets. The visa application requires stating the purpose of your visit, the details of your stay, the planned expenses and who will cover them, etc.",
          "score": 2
        }
      ]
    },
    {
      "title": "Are US companies not hiring international students?",
      "body": "I'm an international grad student about to complete my degree in spring. As is the case with every international student, I have racked up a bunch of student loans back in my country. The only sustainable way to pay it off would be to work in the US for a few years and then go back once the amount is reduced. Hence, I urgently need jobs. But almost every job description specifies that they will not sponsor a work visa. Even internships (they don't even consider that I can use my OPT to work for up to 3 years without sponsorship). Career fairs are no different. The representatives bluntly told me that their company policy bars them from considering international students for their positions. Why is this suddenly the case? I remember getting responses from companies in October 2022, and I've also been interviewed by companies back then, so this has to be a new development. Is this new policy here to stay? Is there any chance for us to wait this out? The timing of this development is so unfortunate is that its too late for me to maintain my F1 status by applying for a PhD, but I have no option of giving up as I will undoubtedly face financial ruin if I go back to my country without any sort of work experience.\n\nI have a GPA of 3.93 and my concentration is in ML. I've done a lot of projects involving ML but I have no industry experience. I've been looking for internships as a result, but without any luck. I am very confident in my knowledge of ML and I am sure I can tackle any questions in the technical round. But I'm not even getting a chance.",
      "subreddit": "cscareerquestions",
      "score": 227,
      "url": "https://reddit.com/r/cscareerquestions/comments/11dd3p0/are_us_companies_not_hiring_international_students/",
      "comments": [
        {
          "body": "It's likely a symptom of a bad job market. Because of that, the companies that do sponsorship, have their pick of experienced people who do need sponsorship. Nothing you can do but keep applying and hope to get lucky.",
          "score": 302
        },
        {
          "body": "Almost all my international friends can’t get jobs right now. Bad market. But it’s not impossible, I do have some friends with upcoming internships at top companies",
          "score": 139
        },
        {
          "body": "It's always been difficult for international students to find jobs in the US. Anecdotally, my international classmates had to apply to 10x as many positions as I did to find their first job.",
          "score": 184
        },
        {
          "body": "Just a bad market right now for you. There are too many options on the market and not enough jobs out there. You won't find anything for a while, at least overseas.",
          "score": 58
        },
        {
          "body": "| Why is this suddenly the case?\n\nIt’s always been the case. When I graduated, like 90% of jobs out there were closed to me (no exaggeration). Either there’s a disclaimer in the job posting that they don’t offer sponsorship, or recruiters hang up on you when they hear you’re an international student, or you get spammed by consulting companies with terrible working conditions that you don’t really want to work for. \n\nOf course, there’s the dreaded ‘do you need sponsorship now or in the future’ question, where your resume gets automatically filtered out by anyone not rich enough to have an immigration attorney on retainer. I can see in the comments that some people are advising you to bend the truth here - don’t. Listen to the immigration attorney you talked to at your uni, not reddit. If you make it to the final rounds, HR will need to know your immigration status. Employers hire with the intent for you to stay there indefinitely, to them it doesn’t matter you won’t need sponsorship for 3 years.\n\n| Is there any chance for us to wait this out?\nAlthough the current market is definitely affecting international students and workers (they can’t justify not being able to find an American worker when laying off so many people), this isn’t something you can wait out generally. The system is designed for you to fail. Even when the market gets better, the range of companies who sponsor will remain similar. FAANGs, rich non-tech companies, rich startups and rich universities should be your primary job searches.\n\nThere’s a combination of things you could try to maximize your chances and/or buy time:\n1. Apply for a PhD\n2. Apply for a second MS (be mindful of CPT and OPT here, there are special rules for the same level of education)\n3. Get in touch with your professors and see if they have work for you (TA, RA, their own company, a friend who’s hiring). This is especially important once the unemployment clock starts ticking on OPT\n4. Network\n5. Target anyone who might sponsor to play the odds, but spam applications without discrimination otherwise\n6. Look into certain consulting firms if you’re desperate enough to buy yourself time (I don’t recommend this one, but up to you)\n7. Immigrate to Canada if you qualify for the express entry visa (no joke, sometimes it’s faster to get Canadian citizenship and come back to the US on a TN visa)\n8. Won’t help you this year, but play the diversity visa lottery if you qualify\n9. Prepare for tech interviews!!! You’ll have to be 3 times as good to get half the chance, so once you get a chance show them what you’ve got\n\n\nPick and choose from above whatever makes sense for you.\n\nAlso, watch out for well-intentioned but clueless immigration advice. Some advice in this thread is harmful and/or illegal. On the other hand, there’s also been some excellent advice for job seekers generally, so try to incorporate that too.",
          "score": 25
        },
        {
          "body": "No, they are not hiring international students when there are plenty of seasoned US citizens/H1B approved people that needs a job and also qualifies.",
          "score": 142
        },
        {
          "body": "Former international student here, right now, the challenge is that the market is flooded with both US and H1B applicants. \n\nIf you're looking to stay in ML, FAANG is still a good option since a lot of them have shifted heavily towards AI. You could also broaden your skills towards other things like web development where you might have more options.\n\nFinally, ask for help on LinkedIn. You have better chances of finding something from people in your network",
          "score": 85
        },
        {
          "body": "The main problem is that a lot of sponsor visas are typically h1bs in this case. That means the government requires companies to showcase that they can't find local talent that satisfy their job posting in order to hire workers on a H1B. However, since all the layoffs are happening, it's practically impossible to justify this unless you have a PhD in an in demand area. It's just a matter of timing and shit show that is the tech sector rn.",
          "score": 83
        }
      ]
    },
    {
      "title": "Please share your VISA inc software intern telephonic interview experience?",
      "body": "If someone have given VISA inc telephonic interview recently, please share. ",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/5c4iqh/please_share_your_visa_inc_software_intern/",
      "comments": []
    },
    {
      "title": "I don't even want a top job at this point.",
      "body": "I'm out of grad school since the end of May. I majored in ECE in both of my degrees, and I didn't really take any algorithm classes. \n\nIt so happens that I did an 18-month full stack development internship at my University building a product for them. Wrote the backend in Django on my own, wrote parts of the Frontend in React, pretty much designed the database, wrote the models to create those tables, and wrote API endpoints for the frontend. \n\nI liked it enough to want to do it full-time. I look for web development jobs and bam! Apparently I need to know C# and .NET really well. I know that the concepts remain the same, they only differ in syntax and tools, so I like try to read some of it. But bam! Apparently every role I come across wants to do Java and Spring. \n\nIn the meanwhile, I created and deployed to Heroku two MERN personal projects. Wrote every single line of the Frontend and backend. I picked MERN because I had to have some experience in it for an interview. \n\nI suck balls at Leetcode style questions. I realised I don't have the aptitude for it, and as someone on a visa with money running out, I can't be wasting time grinding them out and not actually applying to jobs.\n\nSo my hope is companies who will actually take a look at my work and decide to give me an interview or even any shot. But yeah, after 800 applications, and constantly receiving an email that says they found a candidate who closely aligns with their needs better, I'm dead inside. \n\nI interviewed at a few places, ended with hiring freezes or role cancellations or just got ghosted.\n\nI don't know where to go from here. I can build out a full-stack application with a reasonable level of quality and confidence but I can't get an interview even though my life depends on it.\n\nI'm not even sure why I made this post except I feel defeated.",
      "subreddit": "cscareerquestions",
      "score": 804,
      "url": "https://reddit.com/r/cscareerquestions/comments/hjy7sz/i_dont_even_want_a_top_job_at_this_point/",
      "comments": [
        {
          "body": "Look for hiring surge tags on glass door.  \n\n\nUse LinkedIn search bar for actively hiring taglines and positions. Get in contact with the recruiters through connection requests.  \n\n\nCheck local state portals for IT openings.  \n\n\n [https://medium.com/p/876728af15d5](https://medium.com/p/876728af15d5)   \nMore in detail",
          "score": 329
        },
        {
          "body": "Your visa status could be a huge blocker. With the onset of new visa rules and the like, companies simply cannot hire people who needs future sponsorship. Risk is too great.",
          "score": 89
        },
        {
          "body": "[deleted]",
          "score": 226
        }
      ]
    },
    {
      "title": "US Visa Ban on Summer Internships 2021",
      "body": "Since the J1 and other summer visas are cancelled for this year, how will it affect overseas 2021 summer internship hiring? \nDoes it make sense to apply to US companies as an overseas student? What’s the best way to go about applying to Summer 2021 internships?\n\nEdit1: Current Indian Citizen studying at India, applying for summer internships 2021\n\nEdit 2: As many of the people here were petrified by Indians stealing their “US internships”, I do not want to do this. \nMy main concern was with a couple of friends willing to refer me, it was upto me to apply to the right locations at the right time so I get an interview at the least (yes, it depends on my profile as well. I know that).",
      "subreddit": "cscareerquestions",
      "score": 456,
      "url": "https://reddit.com/r/cscareerquestions/comments/hgx42t/us_visa_ban_on_summer_internships_2021/",
      "comments": [
        {
          "body": "Apply everywhere and expect nothing. Everything sucks right now and it's foolish to pretend otherwise.",
          "score": 502
        },
        {
          "body": "Well, the only thing left is interning at your country of citizenship. At least get some experience. Man, the CS folks who graduated and got their jobs prior to 2020 are so damn lucky.",
          "score": 114
        },
        {
          "body": "Bottom line is that there is a LOT of things up in the air right now.\n\nWe don't have a clue what's going on with this pandemic.  Generally, there are two groups.  One group wants to open up full steam ahead and another group wants to shut down again or maybe a partial shut down.\n\n------------------------------\n\nWe're seeing record spikes in cases, but at the same time, we're doing record tests.\n\nWe STILL don't know the death rate but it's looking like a number of factors involved.\n\nWe're in a grey zone because we've floated companies and most any company can self-float for a few weeks, but we're some 3 months in.\n\nWe have what could be a MASSIVE housing problem as millions haven't paid their rent/mortgage and coughing up ~3 months rent/mortgage after NOT working for a few months... just doesn't add up.\n\nOn top of that, if it's not a \"V\" recovery, then we're looking at a possible change in power that could drag things on for over a decade.\n\nYou can add on to that, all the American programmers that got fired/laid off and newly graduated, they now have to compete against people with senior level experience.\n\n----------------------\n\nWay too many factors, way too early to know.\n\nBest bet is to sharpen up ALL the skills you can.",
          "score": 23
        },
        {
          "body": "I would just apply outside US. This aint the only place you know. Also Europe, Australia, Canada are all great places to live",
          "score": 77
        },
        {
          "body": "I'm more interested in why this dude is being downvoted for every trivial comment.",
          "score": 134
        }
      ]
    },
    {
      "title": "Visa for job Interviews?",
      "body": "Hi! Does anyone know what US visa will I need for my onsite interview. And if Microsoft helps you in getting the visa?\n",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/6xgnxz/visa_for_job_interviews/",
      "comments": [
        {
          "body": "Check your country's immigration agreement with the US. Some countries do not require you to have a Visa as long as you stay in the US for less than 30 ~60 days",
          "score": 2
        },
        {
          "body": "I dont think Microsoft/any other company brings people from a different country for an interview! Way too expensive and unnecessary. Where did you hear that?",
          "score": 0
        },
        {
          "body": "You'll need a B1 (business) visa. Note that in practice you'll most likely get a B1/B2 (business/tourism), even if you apply for a B1. How likely it is that they'll actually give you one? That's a more interesting question, considering that your desire to work for an American company can be seen as immigration intentions. I would recommend you to search for travel/visa-related forums relevant to your country, they could give you an idea.",
          "score": 0
        }
      ]
    },
    {
      "title": "My Summer Internship Results",
      "body": "Hey all, I recently received an offer for a summer internship position and wanted to share some interesting stats I kept during the hunt. The whole search took around 2 months starting at the start of September. I made a Sankey diagram with my results below:\n\nhttps://imgur.com/a/kWYOkK9\n\nBackground: I go to a well known Canadian university and only applied to companies in California, NYC, Seattle, and the occasional trading firm in Chicago. I had three internships already (2 full stack, one IT); even so, it wasn't easy to get a response as I needed visa sponsorship and had a 2022 graduation date which got me auto-rejected from a few places.\n\nI did around 300 leetcode (but only 150 unique questions) and practised behavioural questions for a few hours. \n\nI personally used this list: https://www.teamblind.com/article/New-Year-Gift---Curated-List-of-Top-100-LeetCode-Questions-to-Save-Your-Time-OaM1orEU and added more questions to target my weak points (2D DP, Top sort, Patience sort, Graph theory, Tries, 2D Matrices). I also bought leetcode premium to practise company-specific questions. I usually tried to get an hour of leetcode after work during the week and around 3-4 hours a day during the weekends.\n\nMost companies I interviewed with lead with a leetcode easy then transition into 2-3 leetcode mediums - I only encountered one leetcode hard. In the end I received an offer for a relatively well known company in California!\n\nGood luck to everyone out there! It's not easy finding an internship but at the end of the day it's a big numbers game.",
      "subreddit": "cscareerquestions",
      "score": 506,
      "url": "https://reddit.com/r/cscareerquestions/comments/dp61t2/my_summer_internship_results/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 350
        },
        {
          "body": "Your sankey diagram is wrong; \"Applications\" should be the highest level. The way you have it, we have no way of knowing the proportionality of responses you got based on application type. This is problematic as the way you made the diagram, it's theoretically possible to say that all of your Code Challenge responses came from cold emails. Also, rejections should be further down as a sort of catch-all for the various points throughout each application process you were rejected. Sorry to be a dick, but this a bad way to represent data with a notoriously good medium (you can do some really awesome infographics with Sankey diagrams).\n\nCongrats on the internship!",
          "score": 66
        },
        {
          "body": "Wow. I'm almost in the exact same boat as you. Well-known Canadian university (hi, Waterloo!), 3 internships, and I went applying all over the US (mainly Cali and NY) requiring sponsorship. \n\nThe only difference is I'm graduating sooner in 2021, and that made my hit rate fairly high. Out of 50 applications on the job board and about 20 outside, I got  6 interviews and so far 3 offers (but I still have to finish 2 of the interview processes).\n\nNice job!",
          "score": 21
        }
      ]
    },
    {
      "title": "Do you need a visa to interview in the US if you're foreign?",
      "body": "I tried to search for this answer on the Internet, but only found articles related to the interview for the visa itself.\n\nIf it helps, I'm a Canadian citizen.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/56d02h/do_you_need_a_visa_to_interview_in_the_us_if/",
      "comments": [
        {
          "body": "No, not if you are from one of the countries in Visa Exempt/Waiver Program. \n\nWhen I interviewed in the US I got a signed letter from the company, just in case I get questioned, stating that I am there for an interview, for which I will not get paid and I will return to my home country after the interview. \n\nWhen I arrived in the US, the immigration officer asked for my reason to visit the US, I told him 'job interview', he said 'fine' and let me through, I never had to show my letter.\n\nIANAL though, so my answer is purely what I know from looking into it myself and my own experience. ",
          "score": 2
        },
        {
          "body": "I'm a Canadian citizen and I interviewed in NYC a few weeks ago. Customs let me through and put a stamp in my passport",
          "score": 2
        }
      ]
    },
    {
      "title": "While do I always fail hiring manager screening round?",
      "body": "Hey fellow dev,\n\nThe job search has been rough these past couple of months. Ever since the H1B visa tax changes, I’ve seen an uptick in interview requests, but landing offers is still proving to be a real challenge. Many companies have packed interview calendars, which makes scheduling and momentum tough. Out of all the interviews I’ve done, I’ve only made it to one on-site so far. In one case, an interviewer even called in sick mid-interview, so I had to reschedule.\n\nOne company had me go through three phone interviews. The recruiter later told me they’re considering down-leveling me because I don’t have experience with Java Spring—even though I’ve been solid on the technical side. They want one more phone round to “get more signal.”\n\nI’ve noticed a pattern: when the phone screen is purely technical, I tend to do well—about half the time I make it to the onsite. But I’ve never cleared a hiring manager screening round in my entire career. Ironically, I’ve passed hiring manager interviews during onsites, probably because they’ve already seen strong technical feedback by then.\n\nOver the past month, I’ve been working on STAR-formatting my past impact stories and aligning them with the usual “ideal corporate teammate” attributes. Still, I’m not sure if I’m hitting the mark.\n\nOne recent hiring manager screen was especially tricky. It was a 30-minute video call. The first half was standard—what I’ve worked on, what technologies I’ve used. Then came the curveball: “Is there anything you don’t like about your current company or would want to change?” I figured dodging it would tank the interview, so I answered honestly. I said that if I were to start a company, I’d invest more in engineering processes and development environment, since I currently spend about 20% of my time firefighting. He followed up by asking what I’ve done about it. For the record, I had raised concerns with my manager (who brushed them off). I told the interviewer that I’ve been pushing for simplification in all aspect.\n\nI’ve seen this pattern before—where the interviewer asks what language I prefer for the next step in the interview process (I said Python), and it feels like a setup to give me false hope. Maybe I’m reading too much into it, but these interviews are really tough when you’re not naturally social or charismatic.\n\nI guess I’m wondering: am I overthinking this? Or are hiring managers just extra picky right now? I’d love to hear how others have navigated this, especially if you’ve struggled with the same kind of behavioral hurdles.\n\nThanks for reading.\n\n\n\n------------------------------------\n\nI've been employed a lot. I have an internship follow by 4 full time positions.\n\n\n\n------------------------------------\n\nFor future Redditors... \nI just pass my first hiring manager screening in 2025. This year the job market is horrible so made me overthink.\n\n1. Simile and look at camera.\n2. Talk slower (don't be neverous).\n3. Don't over think. If you are trying to the best of your abilities and they still reject you it's okay.\n4. Bring a slide deck of projects to make communication easier.\n\n\n \n\n\n\n",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/1oxdjf3/while_do_i_always_fail_hiring_manager_screening/",
      "comments": [
        {
          "body": "Variance and small sample size could just make the data you have useless, but I’ll answer anyways. \n\nAs someone who fails 90% of onsites and who’s never failed a pre-onsite HM interview, they’re mostly vibe checks.\n\nI’d imagine you’re giving some signal that compels them to not want to work with you? And it’s probably something more simple than you’re thinking, like attitude/demeanor.",
          "score": 39
        },
        {
          "body": "Your answer to the question of \"what have you done about it\" seems kind of poor as it sounds like you just complained to your manager without taking any action yourself. A good answer would've been something like \"I added a billion unit tests so now I don't need to firefight anymore and we can push even more code\" or \"I created a bunch of automated processes so now I don't need to firefight\".",
          "score": 13
        },
        {
          "body": "You’re not supposed to answer those questions honestly lol. And if you do, make sure you are still sticking to STAR, and have a GOOD answer to what you did about it. \n\nI would talk about something that was a problem, and has been resolved by your effort or collective effort of the group that you contributed to. That question is not an opportunity to vent. I’m happy to share an example of what I’d say via DMs.",
          "score": 9
        },
        {
          "body": "Im a hiring manager.  DM me if you want to do a practice interview.",
          "score": 6
        },
        {
          "body": "The good news is you know which question you failed on. Reflect and find better answers for the next time it comes up. \n\nBig red flag I see is that you raised the *problem* with your manager, not a *proposed solution*. An ideal answer would be something like “I spend about 20% of my time firefighting and want to reduce that, so i looked at the most common areas where fires happen—mostly tech debt in this one legacy feature—so I asked to set aside some time in the next sprint to refactor that feature, add better monitoring, etc.  it’s been a little quieter since then, but there’s still plenty of areas that need similar treatment and I have to approach them but by bit”.  Or for more senior roles you need to tell a story about how you changed processes so the team could prioritize those areas better.",
          "score": 1
        },
        {
          "body": "Every time, you get better and better despite not realizing it. You’ve got this, and you’re doing the right thing by practicing!\n\nPersonally, I sometimes like to use new AI tools like Yoodli to create a question bank. I also record myself on voice memo on the phone and listen back.",
          "score": 1
        }
      ]
    },
    {
      "title": "Applied for internship and got selected for an interview but the company does not offer visa sponsorships. What now?",
      "body": "So I applied to a bunch of companies through my University and one of them called me for an interview this week. After I scheduled it, and looked up their info, I realized they don't offer visa sponsorships. Technically I don't need a sponsorship for an internship but will need one for a full time job. How should I approach this?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/9qhamz/applied_for_internship_and_got_selected_for_an/",
      "comments": [
        {
          "body": "They are offering you an internship, not a job.  Don't over think it.",
          "score": 3
        },
        {
          "body": "I know but like I know they will reject me when they see I'm an international. How should I break it to them?",
          "score": 1
        }
      ]
    },
    {
      "title": "Has anyone interned or interviewed at Visa inc?",
      "body": "So about three weeks ago I applied for a software engineering internship for Visa inc through their website, however I noticed on Glassdoor.com and some blog posts from previous Visa interns, that the majority of interns and new grads received interviews through university recruiters or career fairs. Visa doesn't recruit at my school though, and I was a little scared that my resume went into a black hole, so I went ahead and found a university recruiter on Linkedin and sent them an inmail yesterday. I'm skeptical that I'll receive a response though, and maybe I am being a bit impatient, however most people seemed to have heard back within two weeks, so I was wondering if anyone on here has interned at Visa and would like to share how they got an interview or the time frame it usually takes them to respond back? Any help would be appreciated :)",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/3vdg59/has_anyone_interned_or_interviewed_at_visa_inc/",
      "comments": []
    },
    {
      "title": "People under 5 YoE who managed to land a job in 2024, how did you do it?",
      "body": "I have a double masters degree in CS and DS from a reputed US university. I have a little over 3.5 years of professional work experience after graduation. I was laid off in January last year and haven’t been able to find a full time role ever since. Fortunately, a startup offered to let me volunteer as an MLE. I worked unpaid for about 4 months and have started getting paid for only an hour these past 2 months.  I’m struggling to make ends meet and am also in debt which is why I am trying to find a full time role. The problem is, in 2024, despite aggressively applying, I was only able to get one interview (via referral) which I did not clear. \n\nI don’t want history to repeat itself in 2025 which is why I’m turning to all of y’all amazing people for help. I’m not sure what I’m doing wrong. So here are my questions.\n\n1) How do yall apply? Do yall just tailor your resume for a particular role and spam apply for that role? Do yall tailor your resume for each and every job you apply to pass the ATS? If yes, how much time do you spend per application and how many applications do y’all send in a day?\n\n2) Is the issue my resume? Y’all will be able to see my resume in my post history. Are my skills and experience just not compatible with the current demands in tech?\n\n3) What’s the best course of action for me to move forward? I’ve been really stressed and my depression has resurfaced because of this. \n\nEDIT : For more context, I have a valid h1 visa that needs to be transferred to another company which would take about 2-3 weeks to process. Also I’m out of the country because I didn’t wanna overstay and become illegal. Wanna immigrate back into the country legally with a valid reputable job.",
      "subreddit": "cscareerquestions",
      "score": 38,
      "url": "https://reddit.com/r/cscareerquestions/comments/1i0p3yw/people_under_5_yoe_who_managed_to_land_a_job_in/",
      "comments": [
        {
          "body": "I think not adding your H1B situation in this post signifies you are not coming to terms with your situation. You have it though for lots of reasons but the H1B is probably top of the list. I’d rewrite this post to ask advice about overcoming that part specifically.",
          "score": 223
        },
        {
          "body": "I just shotgunned applications and got lucky tbh(I only applied to positions in nyc). 2 yoe and landed a job in nyc.",
          "score": 69
        },
        {
          "body": "Last year I was grinding LC and got a two different mid-level FAANG offers with about 4 YOE total. Three if you count the retention offer which I ended up taking. I applied directly in response to recruiter reach-outs and with referrals. Having a recruiter contact from the start helped a lot I think.\n\nI spent like 0 time on the application and did not tailor my resume. I work in ML infra (scheduling, compilers) which a lot of companies were/are hiring for mid 2024. In my niche “the market” is very good.\n\nThe roles are all in the Bay Area, where I am also based.",
          "score": 34
        },
        {
          "body": "When going through PiP (late October - late November), I immediately reached out to multiple recruiters from the past six months who had cold messaged me via LinkedIn. I always reject pleasantly and try to leave the door open, and most are happy to keep an open line of communication. Having ~2.5 years experience in a growing field (ml infra) and an updated LinkedIn definitely helped. Was able to land ~6 interviews from this (found one via apply). From there it's the classics: good communication, leetcode, having a narrative, system design. I had one offer. The key is that I always have that line of communication if everything goes south. I also try to stay interview ready-ish, so that I can ramp back up quickly if needed.\n\nThe job I took was a promotion, and came with a large salary/TC bump. I had at least one other recruiter that would have been open to me interviewing for a company I had previously rejected 6 months ago, and a former colleague at a large company who was willing to shoot my resume directly to the head of ML infra. One of the companies that rejected me was offering to have me do a quick interview with another team, at a down-leveling. So while I had only one offer, I felt pretty confident that other opportunities would come up.",
          "score": 10
        },
        {
          "body": "Applied to the state government. Today was actually my first day. Took an unfortunate pay cut, but beats unemployment.",
          "score": 5
        },
        {
          "body": "Peoples networks seem to be the biggest contributor. That'll be challenging for you not being in the same geographical area, you'll need to be creative. \n\nThe more you can tailor your experience (resume, cover letter, approach), the better chances you have of a response. The trick is knowing how much energy to spend and that can vary. Just start and a system will work itself out.",
          "score": 9
        },
        {
          "body": "Zero experience. First job out of college. Took a year, I graduated in 2023. I applied to over 300 jobs. Paid for resume software. Tailored my cover letter to each position and none of that mattered. In got zero interviews. What happened was the VP of Marketing for a company I worked at 10 years ago remembered me after seeing a post on LinkedIn and reached out because she had a position open on one of her teams. Networking is all that matters imo now with little or no job experience.",
          "score": 12
        }
      ]
    },
    {
      "title": "I have a return offer, but I don't know if I should accept it yet",
      "body": "Hello all, I apologize if the title comes off as snobby/snarky. I'm in a situation where I'm not sure what the best steps are to move forward and would like to hear feedback from this subreddit.\n\nI am a current junior at a fairly highly ranked school for CS. Last summer, I landed an internship with a mid-sized company with about \\~200 employees. Overall, the experience was good, and the company culture seemed nice--however, I wasn't a big fan of the location. It's in the midwest, and I lived in California (not Bay area) but go to school in the east coast. I became a bit depressed and lonely over the summer despite the work I did being enjoyable.\n\nI was given a return offer for the company next summer, but the deadline to sign it is on October 15th (6 days from now). Right now, I'm applying to some other companies and hoping to get something from a bigger company or something in a bigger city where I know at least some friends. I knew literally nobody last summer besides my roommate, and also had no car, so they had to take me anywhere I wanted to go.\n\nThe company is known for not having any layoffs with its employees having been working there for decades. Interns are also almost guaranteed a return full time offer. From what I've heard, the pay is pretty good given it's located in the midwest.\n\nHowever, I'm also in the process of getting invited to a few interviews and assessments with some bigger companies, but for sure not soon enough to get an offer by Oct. 15th. I'm not sure what the best path forward is. The internship was really enjoyable but I just became really lonely over the summer. I know this probably is a stupid reason to say no to an amazing offer that I'm grateful to have, and I absolutely don't mind going back *if* I have no other better options.\n\nThank you all in advance. I really appreciate it.\n\nEdit to add: Am a U.S. permanent resident and citizen so won't require sponsorship or visa.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1o2p0yz/i_have_a_return_offer_but_i_dont_know_if_i_should/",
      "comments": [
        {
          "body": "Take the offer",
          "score": 42
        },
        {
          "body": "Always take the offer. You can always tell them you got a better offer and can’t start later. I signed my internship return offer and kept applying, unsuccessfully — so for me, thank god I was smart enough to take the offer.\n\nIf and when you work there full-time life will be a lot different than as an intern you’ll officially live there and won’t be leaving in 6-10 weeks so you’ll have an incentive to meet more people and build relationships. It’s tough to do that in an internship.",
          "score": 34
        },
        {
          "body": "Take the job, get a bicycle, look for opportunities practice your social skills. It's not an unsolvable problem.",
          "score": 4
        },
        {
          "body": "Assuming US resident, with permanent work authorization, and US employers. Location/jurisdiction kinda matters.\n\nTake the offer. You can always renege on it later. You may burn the bridge with that specific employer, but there is no \"industry blacklist\". Majority of employment in the US is at-will; You can quit at any time, they can fire you at (practically) any time. FMLA and the like notwithstanding.\n\nAnd if you don't have permanent work authorization, super duper mega ultra take the offer. Nobody knows WTF with this administration as it relates to immigration.",
          "score": 2
        },
        {
          "body": "Midwest ain’t California but there’s good in every place. If it’s not a good fit then leave after 1-2yrs. Always take the offer and field backups, if they fall through you still have a job",
          "score": 2
        }
      ]
    },
    {
      "title": "It’s the contracting companies",
      "body": "Lot of talk about H1B visas. What scares me the most are contracting companies starting in America (think Revature) that adopt H1B visa contracting company practices (coaching people to pass interviews for positions they are not qualified for). What do y’all think? ",
      "subreddit": "cscareerquestions",
      "score": 136,
      "url": "https://reddit.com/r/cscareerquestions/comments/1hqqfdw/its_the_contracting_companies/",
      "comments": [
        {
          "body": "They are definitely an issue. Cognizant Technology Solutions was found liable for discrimination against non-South Asian and non-Indian employees.",
          "score": 126
        },
        {
          "body": "The H1-B reform I'd like to see is the prohibition of non-US based companies and third-party \"consulting companies\", aka body shops, from hiring H1-B'ers.",
          "score": 52
        },
        {
          "body": "Those are the main culprits behind h1b fraud",
          "score": 50
        },
        {
          "body": "If we can reform H1B to get rid of these scam companies, it would benefit everyone (including legit H1B employees).\n\nIf we also investigate companies where H1B workers exceed some percentage of total employees, between these two we'd cut down on 95% of all abuses.",
          "score": 39
        },
        {
          "body": "In France, where I’m based, it’s striking how many medium-to-large companies prefer hiring expensive software engineering (SWE) contractors rather than taking on full-time employees. The majority of these contractors don’t work independently; they’re employed by intermediary contracting firms. These firms often prioritize maximizing their own profits, paying software engineers as little as possible while charging companies exorbitant rates for their services.",
          "score": 11
        },
        {
          "body": "They should be investigated and prosecuted if they are in fact violating laws. H1B itself is not the problem.",
          "score": 29
        }
      ]
    },
    {
      "title": "VISA FTE (India) Interview questions for freshers",
      "body": "",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1oi9xr9/visa_fte_india_interview_questions_for_freshers/",
      "comments": []
    },
    {
      "title": "Visa Inc hiring manager interview ?",
      "body": "I cleared first 2 rounds of technical interview at Visa but however the last round (3rd) with the hiring manager was not good. Will I be rejected? Not heard from the HR in 2 days mostly before the HR would be calling within 2 days",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1f9lb4f/visa_inc_hiring_manager_interview/",
      "comments": [
        {
          "body": "What was your 2nd round like? Which position did you apply for?",
          "score": 1
        }
      ]
    },
    {
      "title": "How do I get a remote job as a non-US, non-EU software engineer",
      "body": "Probably already posted before but I am currently am unemployed. I am in Dubai and have worked here for 5 years. I am a SWE (MERN, frontend heavy, currently learning Go, NestJS and hopefully web3) and have 9 years of experience. I have mostly worked as a remote Dev and a year ago had to get a job onsite but I did not enjoy it.\n\nThe plan: I want out. I can't take this place anymore. I hate it. I want to go to EU through digital nomad visa and as long as I have 4,000 USD salary a month I'll leave happily. \n\nI know many people will say \"EU is not great either\". Please. I understand your perspective and I DO NOT wish this post to get side tracked into EU vs rest of the world. I just want to clear picture. Simply put I want to get a remote job that pay 4,000 USD. that's it. \n\nI am 30 years of age and I am originally from Pakistan. I am also work with DevOps (Git, CICD pipelines, docker, K8s, have worked with AWS) to an extent. \n\nI have given interviews in EU but keep failing in 2nd or 3rd steps for absolutely no reason at all or all the previous interviews going well and then failing in the last one because the interviewer is a mismatch.. \n\nIf someone can help out please let me know what I can do. I am learning more each day to keep up but if someone can help me with my plea.. I'll be grateful. Thanks!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1p4oe7g/how_do_i_get_a_remote_job_as_a_nonus_noneu/",
      "comments": [
        {
          "body": "I would ask in a middle east centric forum. You are going to get a ton of US teenagers acting like they know the answer here which is going to taint the answers",
          "score": 10
        },
        {
          "body": "Just get a job in crypto",
          "score": 1
        },
        {
          "body": "&gt; for absolutely no reason at all\n\n\nIf it happens once it's a fluke. If it happens consistently, while its possible you are right, id start asking myself questions instead of dismissing it.\n\n\nAre you failing the tech side? Ez just grind and prep harder.\n\n\nAre you failing behavioural? Ez, you can kinda prep for those too to a good extent, just read up on the internet how (star method etc.)\n\n\nYou probably wont get an answer but you can also ask their hr contact why, if it was related to your interview performance or bureaucracy. Msybe you require soonsorship and they can't be arsed ",
          "score": 1
        },
        {
          "body": "The interview process is brutal right now, especially for remote positions. Companies are getting hundreds of applications and being picky as hell.\n\nSince you're failing at later stages, it's probably interview performance rather than your skills. I'd recommend preparing with some mock interview tools. I've done the same - at least for someone like me who gets anxious a lot, they really help. There are multiple tools available; I tried Final Round AI's mock interview, and it's quite good.\n\nAlso try targeting smaller companies or startups - they're usually more flexible about location and less bureaucratic than big corps.",
          "score": 1
        },
        {
          "body": "&gt; Simply put I want to get a remote job that pay 4,000 USD. that's it.\n\nAww wouldn't that be nice. Nobody else wants the same thing that is already in those places.",
          "score": 1
        }
      ]
    },
    {
      "title": "Should I quit my masters",
      "body": "I did my bachelors in CS at a pretty solid school but wasn’t able to secure any internships during my undergrad, and after 6 months of applying to full time, and not getting a single interview, I decided to apply to masters programs. Of my acceptances USC was the best so I decided to commit.\n\nI’m about to finish up my first semester here, but I’m one of the 5-10 domestic students in both of my classes of 200. Nothing against international students, but it seems like 95% of people are here for the visa, and the program itself doesn’t provide much value for jobs. I heard a lot about “omg the Trojan alumni network” but ngl it’s not any better than any other T50, if not worse cuz it’s so oversaturated. money isn’t an issue but I feel like I’m repeating undergrad and wasting 2 years..",
      "subreddit": "cscareerquestions",
      "score": 82,
      "url": "https://reddit.com/r/cscareerquestions/comments/1mai8xh/should_i_quit_my_masters/",
      "comments": [
        {
          "body": "&gt; it seems like 95% of people are here for the US name it provides\n\nThey're literally all there for the OPT visa.\n\nOn dropping out, what would that achieve? You should apply to jobs and drop out if you find one, not just drop out for no reason.",
          "score": 110
        },
        {
          "body": "I dropped my masters for a job, and I don’t regret it because I needed the money. May go back sometime, but generally time in the field tends to outweigh the extra degree unless you’d like to do a research position or something highly specialized. I still hit senior in less than 4 years, though your mileage may vary.",
          "score": 19
        },
        {
          "body": "I have 2 masters degrees, I typically recommend no one gets their masters if they have to pay for it but you’re already enrolled so I will give you some additional advice instead. \n\nYou can apply for Graduate level internships which can help you get that resume experience and will have a smaller competitive pool compared to undergrad internships. You can and should get involved in research because that’s such a low bar to get involved in and will immediately add experience to resume and will be a good bonus if you get published and graduate level internships will like this. \n\nThere is a lot of good paying science based computer science jobs (especially in defense since you are domestic) that will see that as a big plus. Also I think finance also likes people with a more academic background since they do a lot of advanced mathematical analysis for trading strategies. \n\nSo if you just want to be building apps then maybe drop it? If you want to do something that requires at least a masters like ML/AI, data science or something more math focused then it could be worth it. \n\nIf you decide to stick with it you should apply to national labs for internships and you can probably get those internships pretty easily as a domestic graduate level student. But to “seal the deal” you should really get into research",
          "score": 14
        },
        {
          "body": "MS resets the clock. You are no longer 6 months unemployed. You are a student with a second chance. Apply to internships and beef up resume.",
          "score": 14
        },
        {
          "body": "If you’re not enjoying the program and don’t have an end goal in mind (eg, applying to PhD programs), then go ahead and drop it. Like you said, cs master programs are just cash cows for universities selling a dream to international students.",
          "score": 30
        },
        {
          "body": "The benefit of an MS in your situation is that you're counted as a student for FAANG hiring. This means you're more likely to at least get an interview callback. If you get an internship that is successful, you can probably convert that easily into a full time role and drop out of the MS program. \n\nIf you want something specialized (AI, PhD) there's value in sticking to grad school. Otherwise, yeah an MS is just a ticket to the US for Indian / Chinese / foreign students",
          "score": 13
        },
        {
          "body": "Unless you're actually hellbent on getting internships this time, the masters will be a waste.",
          "score": 5
        }
      ]
    },
    {
      "title": "On track for promotion but got laid off instead - On the verge of burning out.",
      "body": "tldr : Need advice on severance acceptance or other internal position but with no severance. \n\nexperience: 6years in the industry.\n\nHello y'all,    \nI just got the dreaded news that my position is impacted. I was already on the verge of burning out because I was on track for promo but \"because of org changes we don't know when exactly it'll happen\"\n\nSo I've started applying for internal positions well before this event but now with this news I got a decent severance package and due to my accrued PTO+ Years spent in this firm, i think overall I'll get almost 6months of pay. \n\nNow, i also have an option to pursue an internal position in an adjacent team which is basically a 1:1 mapping of my current role and I know that team works a lot and the work over there is mehh or at least not that interests me long term but also likely not be able to prep for interviews due to the expectations. \n\nI can basically pull some strings and have high confidence i can get that offer, but if they offer and regardless of whether i accept or reject i'll loose this severance package. \n\nIt's clear to me that 6month pay is much better than this internal position but i'm on H1b and have until March 2026 to find a job. if not I'm screwed or i'll have to think about changing to B1/B2 to buy time or joining a consulting firm which i want to avoid. \n\nWith this job market and all this VISA bs i'm not really sure if i can find a new job within March, but the thought of 6month severance without doing any work seems really sweet to recover mentally and get on the leetcode grind. \n\nWhat do you think is the better play? should i just pull my internal applications and get out with severance and try my luck outside? (Somewhat confident i'll find something in 6 months). Or take that internal position and be safe, loose that sweet severance work for some time and switch with position of power? \n\nI personally want to take severance but with this VISA limbo i'm super confused about what's better. \n\n  \nReally appreciate all your help/advice here. \n\n",
      "subreddit": "cscareerquestions",
      "score": 33,
      "url": "https://reddit.com/r/cscareerquestions/comments/1okk2oz/on_track_for_promotion_but_got_laid_off_instead/",
      "comments": [
        {
          "body": "Take an internal position. H1b is a huge issue tbh.\n\n\nIf you were a regular citizen, I would prob say 6 months if you were really burnt out and wanted a change but I would caution the hard job market. H1b, take an internal position if you can.",
          "score": 77
        },
        {
          "body": "The market isn't good, you're on a visa, and this administration is ostensibly hostile to foreign workers (and definitely to the unemployed ones). I feel like taking any offer you get is a no brainer...",
          "score": 41
        },
        {
          "body": "Which one would you prefer: 6 months to recover with a non zero chance of having to leave the country and never return? or play it safe and stay in the country but have to deal with burnout.",
          "score": 13
        },
        {
          "body": "This is a no brainer choice, but in opposite directions dependent on your status as a citizen. If you were a citizen the easy choice would be the severance, it’s interview season right now and people with 5+ years don’t struggle nearly as much as the rest are. But you can’t afford the non-zero chance that you don’t have a job ivy march, and that additional pressure will get to you during any prep you have for interviews and the like.\n\nDo what you have to do",
          "score": 4
        },
        {
          "body": "There’s only one question you need to ask yourself: are you ok with being kicked out of the country?\n\nIf yes, take the severance.\n\nIf no, take the internal position.",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "If the visa wasn't an issue it'd be a no brainer to take the severance, but in the long run keeping the job is more aligned. What I'm wondering though is that you're staying at the same company, how do you know you won't get laid off again? At which point would you get the same severance again or reduced?",
          "score": 1
        },
        {
          "body": "Internal position, 100%",
          "score": 1
        }
      ]
    },
    {
      "title": "Trump calls H-1B visas necessary to bring in 'certain talents' that he says the U.S. lacks.\nIn an interview with Fox News, Trump said that in some cases, \"You can’t take people off an unemployment, like an unemployment line, and say, 'I’m going to put you into a factory.'",
      "body": "",
      "subreddit": "jobs",
      "score": 495,
      "url": "https://reddit.com/r/jobs/comments/1ox91gb/trump_calls_h1b_visas_necessary_to_bring_in/",
      "comments": [
        {
          "body": "What a fucking joke of an administration. \n\nHey look guys, Trump took yer jobs too! \n\n\nWhoever thought American corpos were going to pay U.S. citizens the going rate vs. foreign labor was kidding themselves since day 1. You were all fools.\n\nAmerican corporations have always been able to use American labor. They just don't want to.",
          "score": 335
        },
        {
          "body": "lol guess his billionaire buddies got to him about cheap labor.",
          "score": 73
        },
        {
          "body": "Trump has never had a job in his life.\n\n\nTrump never acquired any marketable skills.\n\n\nHe has no idea what it's like to work.",
          "score": 78
        },
        {
          "body": "Trump says you can’t do exact thing that you can do.",
          "score": 76
        },
        {
          "body": "I have no idea what the real truth is here. But  3 things I do know:\n\n1. Some of the h1b via workers are on par or below some of the large pool of us workers who need a job. So the only correct way to finish the sentence the US does not have enough skilled workers is….”at the price point US companies want to pay”\n\n2. This country has always thrived on top scientific and intellectual talent coming here and immigrating. If h1bs lead to that then wonderful \n\n3. Nothing and I mean absolutely nothing Donald trump does anymore has any credibility. If Donald trump does it then it is almost certainly for selfish reasons of himself and his ever shrinking pool of fanatics",
          "score": 27
        }
      ]
    },
    {
      "title": "Visa inc Interview: Senior customer success Manger ",
      "body": "I have my 2nd interview coming up. Any idea what type of questions they will ask me? ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1hxujbs/visa_inc_interview_senior_customer_success_manger/",
      "comments": []
    },
    {
      "title": "Got a proforma job offer subject to last face to face interview. But don't have visa",
      "body": "The title says it all pretty much. I got through two rounds of interviews via (teams) and I thought the process was finalised. Today I got a proforma job offer subject to a face to face interview with the Director. I don't have visa, and don't think I can have it within the suggested timeline. The company offers visa sponsorship for the actual job, but this face to face interview insinuates they expect me to have one?.I'm afraid to loose the opportunity if I tell them that I don't have it, but I don't have any other choice except suggesting an online interview, or maybe postpone it to until I get a visa, which can take forever (tourism visa appointments are very rare).",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1fab28c/got_a_proforma_job_offer_subject_to_last_face_to/",
      "comments": []
    },
    {
      "title": "Help with Visa Inc. interview",
      "body": "Hi! Does anyone have any experience with live Excel tests in interviews for Visa Inc.? I am scheduled for one in the upcoming days and am very nervous. It's a 30 min interview and all I know is that it's a \"Round 1 excel/financial analysis task in real time\". I would appreciate any help!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1e26ild/help_with_visa_inc_interview/",
      "comments": []
    },
    {
      "title": "I'm letting go. I don't care anymore. I have reached a breaking point.",
      "body": "This is it, I think I have reached a point where I don't care anymore. I have decided to let go of the idea of finding a job.\n\nContext. I am a 28M with a Masters Degree in Mechanical Engineering, passed out in 2019 and worked for 1 year as a Mechanical Engineer before having to force my way into the IT/CS industry (quite reluctantly) back in 2020 right after the pandemic since my the time was running out after getting laid off due to the pandemic. Long story short, after being unemployed for the first time in life, I went through so much shit to get my first IT job as an ETL Developer/ Data Engineer. Hated the job, hated the work, hated the people, but somehow pushed through only to be let go after \"budget issues for contractors\", the most cliche shit ever. \n\nAfter working in such shitty corporate/ IT role for 2-3 years now, I find myself unemployed once again at the end of December, with only my shit experince behind me and nothing to look forward to in 2024. I have applied to around 1 Million jobs ( I know I'm exaggerating, but thats how it feels) and after *obsessing* over getting a full-time role for over *5 months* now and getting *rejected* for a FTE role after *7 grueling rounds of interviews*, it took me great strength to come back on my feet and start applying again. \n\nI am now extremelly tired, deeply frustrated and just outright *indifferent* to this whole process. The other day, I was speaking to a recruiter/ agent over the phone for a job. He was going to market me to his client and *I COMPLETELY LOST IT* and started *YELLING* at this person for asking me 1 million questions about my background and *borderline accusing* me of not having the right experience. I basically asked him to duck right off cuz bro I don't care anymore. You like me, you hire me, if not just get the eff outta my way. \n\nTo make things worse, I am on a H1B Visa and at the bare end of the pecking order of being considered for a role with the way the market is these days. \n\nI hope to find light at the end of the tunnel, but that tunnel seems perpetual for now. \n\nHere's to 2023 and all the shit I've been through this year. Cheers. 🍻",
      "subreddit": "jobs",
      "score": 344,
      "url": "https://reddit.com/r/jobs/comments/188hu5b/im_letting_go_i_dont_care_anymore_i_have_reached/",
      "comments": [
        {
          "body": "I feel you. I’m 26 with an M.A. Ive worked shit jobs for 4 years, constantly missing out on jobs that I am clearly qualified for. I am close to giving up.",
          "score": 113
        },
        {
          "body": "This has been a shit year for my wife and I as well, friend. Fuck this year. Enjoy one for me. 🍻",
          "score": 49
        },
        {
          "body": "7 rounds of interviews that's crazy. Did they have every senior person in the company interview you?\n\nI hear you man, it's stupid tough out there right now for most jobs. 2023 hasn't been that great for me either and I'm looking forward to better things in 2024. Wishing you better fortunes in 2024!",
          "score": 71
        },
        {
          "body": "Way too many experiences such as these for a supposedly great economy with record employment. I don’t buy what the government is telling us for a second",
          "score": 34
        },
        {
          "body": "You are at the perfect age and frustration level to start a railroad career. If you work 30 years, and retire at age 60. You get a full pension which is now about $6k a month for you and $3k a month for your spouse. And you can make the same as you would make as a mechanical engineer, which is close to $100k/year. They are hiring conductor all over the US. I wish i knew about it at your age. What area do you live in?",
          "score": 43
        },
        {
          "body": "Totally different field and a bit older at 31 but indeed, this year was horrendous for me as well as I wound up in the single worst job I’ve ever had with some of the most toxic Silicon Valley wannabe assholes I’ve ever had the misfortune of encountering. \n\nIt’s clear that you need a mental break. Not sure what your financial situation is but if you can afford it, give yourself a bit of a vacation to recharge before getting back to it.",
          "score": 20
        },
        {
          "body": "Same boat, yet I'm 59 years old. I think I'm going to just go back to college, rack up tons of student debt and die of old age, with lots of degrees under my belt. Wahaha, Come get your money now.",
          "score": 19
        }
      ]
    },
    {
      "title": "International job seekers in the US (the ones answering a sheepish \"Yes\" to the dreaded \"Would you now or in future be requiring visa sponsorship?\" questions), how many jobs did you apply to approximately before you started getting positive responses or interview calls?",
      "body": "You are really brave to be a part of this process, and I'm only about 10% saying this to make myself feel better.",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/n4g3cw/international_job_seekers_in_the_us_the_ones/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Job search is legitimately making me severely depressed.",
      "body": "Hi. I'm 23M. I feel quite depressed and worthless in life. I've been job hunting for like 6 months and it feels absolutely debilitating. Companies ghosting after initial interviews, final interviews; hundreds of applications with no response. Like how is the job market so awful? I'm not even an unqualified candidate. I'm an international student in USA who dropped out of a PhD program in engineering from a fairly prestigious university. I dropped out because I was being overworked like crazy to the point where my labmates accused my advisor of abusing my visa status. I quit because the stress was getting to me and I wanted an out. I didn't know I would regret leaving so much. I think my resume is good. I have a fairly wide knowledge base and good projects. And absolutely no company wants to hire me because I'm not the godsent perfect candidate who ticks everything. I recently applied to a company and while I had all the necessary qualifications for it; I went ahead for the extra mile, digged on the internet for a report an engineer who is already working for the company produced. I recreated that report from scratch in a day, which is to say I actually did the task the job was about , and I was still rejected. I feel so awful. I have seen resumes of people who got hired for the same jobs I applied to from a couple years ago and the projects and experience they have are straight up insulting. It's the equivalent of someone making box mac and cheese while candidates nowadays are expected to have worked at a michelin star restaurant and invented pixie dust tiramisu to even get an interview. It is so incredibly frustrating. I feel like I'm losing my identitiy in a sea of applications. Looking at linkedin or other jobs hurts my eyes and every second I spend on those websites I feel my eyes sinking further in. I regret coming over to USA- the constant rhetoric about how people like me are stealing jobs from the native citizen makes me want to disappear from this world. Like I'm sorry man- I did not know I'm committing a treacherous crime trying to improve the hand life gave me. I apologize for sounding bitter. I do not intend to offend anyone and I apologize to anyone I did. I just feel so detached from reality at this point.\n\n",
      "subreddit": "jobs",
      "score": 103,
      "url": "https://reddit.com/r/jobs/comments/1pyvfwu/job_search_is_legitimately_making_me_severely/",
      "comments": [
        {
          "body": "It sucks man. It is just a numbers game, and you have to keep pressing. I've been on the hiring side, and people sometimes hire for the most random reasons...\n\nMy boss wanted to hire one guy because they were from the same part of their country lol",
          "score": 13
        },
        {
          "body": "Life is hard. And even harder when you’re not native to a country you want to grow in. You will have to work 10 times harder than your peers to prove your worth.\nYour determination and resilience is what will make or break you. That’s the sad truth. \n\nTo get back on track I suggest getting back onto the PhD course esp as you say it’s prestigious. This holds a lot of weight when hiring and avoids the awks of “why did you leave?”. And hopefully buys you time for when the job market improves.\n\nFailing that. Look for specialist recruiters in your field. They’ll help do the leg work for you and have access to contacts not listed. \n\nKeep pushing forward",
          "score": 15
        },
        {
          "body": "Sounds kind of insane but have you tried growing your career back home, leaving the US behind?\n\nI was in a similar situation to you a long time ago and I go back and am literally swarmed with applications and job offers every time I job hop because to my folks back home I'm some \"hotshot from the US prestigious higher Ed system\" .\n\nThe healthcare, food, housing, jobs, saving money, child care, and vacations are all better here than in the States. Not to mention way safer and so much less bullshit disrupting daily life. They literally sat on their laurels for too long and let finance carve off too much meat that it disrupts society, and the only thing going for them is maintaining their cultural dominance to keep the starry eyed student money coming, it feels like a grift.\n\nAnyway try it out, I could've stayed in the US breaking my back with no respect for Maybe slightly more money, or I could come back and be seen and treated as some elite with much more respect, support, and resources for Probably the same amount of money. I left and it worked out well for me.\n\nThe only thing I miss in the States are my friends, professors, and niche foods like pulled pork.",
          "score": 3
        },
        {
          "body": "You will find a job, OP. I know you’re probably sick of hearing this, but you have to keep trying, it’s all you can do until the market gets better. Most are in the same boat. You’re not worthless and you matter. Chin up, and wishing you all the best 🤗🤗",
          "score": 2
        },
        {
          "body": "Well, not a student but an immigrant with a foreign degree, to say it’s shit a show is not even saying anything. The narrative of either stealing the jobs or having plentiful added makes me want to sign in the phychward. The unprofessionalism  of recruiters these days which I’d assume is a simple expansion of the world for me. The hiring situation had not changed for me in long 6 years I’ve been here, people treat you like you r a third world citizen regardless of your ethnicity or gender. \nI’m not sure what your options r mine r pretty much going back to a war and destruction or killing myself.\nIs this helpful? Def not. \nWhat I found out working for me unplugging from it completely for a bit then getting right in and or establishing some sort of schedule if you want to be consistent and keep a hand on the new postings and applying.\nThere is def nothing wrong with neither your resume nor skills.\nYou r fine your resume is def looking great! I know because im getting interviews with a generic resume for 100k postings with no edits just not moving forward, i guess my effing immigrant ass is too fond of myself:D\nTry to feel it out with your gut before applying, I kid you not you are getting  interviews. get very excited for your screening with a ear to ear smile and keep that pace thru the entire process(I noticed that helps with likability) \nGood luck buddy!\nIt’s a shitshow but you got it!",
          "score": 2
        }
      ]
    },
    {
      "title": "Will saying yes to eventual visa sponsorship lessen my chances of getting an interview/job? (Don’t need one now but I want to apply abroad through the same company eventually)",
      "body": "",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/refjjf/will_saying_yes_to_eventual_visa_sponsorship/",
      "comments": []
    },
    {
      "title": "Why are h-1b visas and h4 visas being given out if the current job interview process is long and complicated?",
      "body": "The point of visas is if the employer was unable to find people to fill the jobs they are looking for. \n\nSeveral jobs have hundreds of applicants many of whom have masters and doctorate degrees. You say all of them are unqualified or are you just being unbelievably picky? Why do we need to add more people to this list?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/cmsdpa/why_are_h1b_visas_and_h4_visas_being_given_out_if/",
      "comments": [
        {
          "body": "that’s what you think visas are for. Put yourself in the shoes of a large multinational corporation. It makes it much easier to recruit in poorer countries if they know there’s a chance that they will be able to transfer to a richer country and make a life changing amount of money. That’s a strong incentive to stay with a company and work hard. Additionally, having some churn moving about in a large company helps maintain consistency across locations",
          "score": 2
        },
        {
          "body": "Keep wages low. End of story.",
          "score": 2
        }
      ]
    },
    {
      "title": "Interviewing for a large company tomorrow but they don't sponsor visas, really need advice",
      "body": "So I got an interview for a large tech company in seattle. I'm from Toronto and the posting said that they don't sponsor visas for this position. I really want this position so is there any way around this like applying for the visa myself because I'm not sure how long it will take or whether I will get it. I also have a grandpa in San Fransico if that means anything. Really need some advice, thanks",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/8327lj/interviewing_for_a_large_company_tomorrow_but/",
      "comments": [
        {
          "body": "If you need them to sponsor your visa, they will not hire you. ",
          "score": 5
        }
      ]
    },
    {
      "title": "[Xpost/Norway][25F] been working 1.5 years in Asia, now need to find work in Norway to get a visa to join my (citizen) partner. How best should I go about this wrt CV contact details and interviews? (I have a degree from Australia and been working for international companies)",
      "body": "My partner has been staying and working in Singapore where I am a citizen, up until now we'd been pretty okay being here.\nBut he will most likely be retrenched at the end of the year and have to go back to Norway to look for work. We were planning on me working here a few years for corporate experience before attempting to migrate. Now it looks like we have to fast forward.\n\nI am trying to apply to migrate \"properly\" through work (and eventually apply for citizenship,) instead of taking the easy way out with a partner/marriage visa. To do this, the Immigration website says I will need a solid job offer.\n\nI tried to look at job sites and it seems like I'll have 2 main problems: \n1. I don't have a Norwegian address or phone number to put on my CV. Will I be penalized if I don't put it in? How upfront should I be about why I'm looking for work there in my application letters? What about during interviews? \n\n2. I'm still learning Norwegian (think beginner level but more random scope since I'm learning it from everywhere.) A lot of the job ads are in Norwegian and from my slow, slow translation they all require  \"fluency in Norwegian and English.\" My partner was dismissive of that point, he said companies just assume the Norwegian bit and add it in without thinking about it, they mean to focus on English fluency....but I don't think so :S\n\nWhat do you guys think? Any opinions are greatly appreciated :)",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/3buuh9/xpostnorway25f_been_working_15_years_in_asia_now/",
      "comments": [
        {
          "body": "What type of work do you do? It depends a bit on the sector. Some sectors, like IT or petrochemical enginering have it easier than others. I'm a foreigner in Norway and I think your partner is wrong on not having to speak Norwegian, it's pretty important.\n\nI don't think the Norwegian adress or phone number will be a problem though. ",
          "score": 2
        }
      ]
    },
    {
      "title": "Received a job offer, but my instincts say no",
      "body": "I got a job offer, it involves relocating to a different country. However, my gut instincts keep screaming no, even after deeply analyzing the pros &amp; cons.\n\nI'm a data analyst currently holding a comfy job, with 1-2 days at office and rest of the week remote. I've always wanted to move to the country I got the offer from, but it's for a consulting job at a boutique firm that is SUPER niche and specialized into only ONE service at one industry.\n\nNot only is it a job and career that I'm not after, it's 5 days in office, boring work (excel analysis + slides beautification) + higher workload than my current job.  \nThe good things: the company HQ seems very supportive (MNC with HQ at different country), pay is high (consulting + developed country), visa is sponsored, local office environment doesn't seem toxic.\n\nI thought of accepting it just as a stepping stone, but I have doubts whether I can even last a year. If I quit in 6 months, I'm afraid it'll just damage my resume.  \nThing is, I'm not THAT desperate to enter the country. I'm also not in desperate need of a higher pay. I still see possibilities for other visa sponsorships (have another first interview lined up).   \nI've talked to a current employee via LinkedIn, and even they are looking for a way out (monotonous job, no growth prospects).\n\nNow that I got the offer, every time I imagine starting work there I feel a big sense of dread instead of excitement of moving to my target country.  \nShould I drop the offer?",
      "subreddit": "jobs",
      "score": 11,
      "url": "https://reddit.com/r/jobs/comments/1oeolod/received_a_job_offer_but_my_instincts_say_no/",
      "comments": [
        {
          "body": "If you not sure don't do it! It won't damage your resume, it's just your decision for your life, no one else cares.  Also in third world country - make sure it's a legitimate job , make sure it's not a scam farm or any other slavery...",
          "score": 12
        },
        {
          "body": "Listen to your gut feeling that is all I have to say, it saved me more times than I can remember.",
          "score": 10
        },
        {
          "body": "I'm wondering whether there is another reason for your hesitation added to the other reasons: maybe you are not yet ready to make the leap. That is, while you could technically do it and make the move to another country and take on this job, you really are not ready to take such a step quite yet. And that's okay, as when you were interviewing, it wasn't real yet, but now it is, and your gut is making you have second thoughts. Doubt is perfectly normal, but this is more, and you have to pay attention.",
          "score": 5
        },
        {
          "body": "Then it’s a no go.",
          "score": 6
        },
        {
          "body": "I would go with my gut and pass. You can keep looking for jobs in the new country and hopefully find something better.",
          "score": 5
        },
        {
          "body": "Trust your instinct and don't go",
          "score": 2
        },
        {
          "body": "What I understood from your post is that, you are from a third world country looking to move out and you got an offer from a country that you want to move to.\n\nMy take is - the job market is tough especially for foreigners, you may not get this opportunity again. I'd say if you don't have any dependents or responsibilities back home, just take a leap of faith and move. You can always switch jobs once you land in. The first job in a new country is always a compromise.\n\nBut, if you think you can grab another offer or just want to stay in your home country, then it's your call. \n\nYou can DM me if you want to talk more. \nGood luck.",
          "score": 2
        },
        {
          "body": "Go with your gut",
          "score": 2
        },
        {
          "body": "Trust your gut!!",
          "score": 2
        }
      ]
    },
    {
      "title": "I got an interview call from visa (india). Need suggestions ",
      "body": "I have an upcoming interview for a software engineer role at VISA Inc. this week. Need some tips… \nAnybody who has recently interviewed at Visa?? \nAlso what all should I study before the interview ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1h4y1gr/i_got_an_interview_call_from_visa_india_need/",
      "comments": []
    },
    {
      "title": "How to ask about possible work sponsorship/visa issues in an interview?",
      "body": "I'm sorry if this has been asked many times; I couldn't find anything specifically about how to approach this in an interview. \n\nI'm living and working overseas. I have a year left on my visa; I've completed a master's degree here and have been working for over a year at a small tech start-up.\n\nNot only am I looking to move forward in my career, I will need a company to sponsor my work visa if I'm going to stay in the country past next year (my current employer is not large enough to do this). \n\nI know the ins and outs of work sponsorship and immigration in this country, but I'm not sure how to bring it up in interviews. I don't want to sound like I'm just looking for a way to stay in the country, and the subject seems delicate because sponsorship involves a minimum salary (most of the positions I'm looking at hover right around the required salary or are slightly above). At the same time, I want to be straightforward and know before things get too far, because I'm probably not going to consider roles where sponsorship isn't on the table at all.\n\nSo far, in mock interviews, I've been answering with something like, \"I'm interested in committing to a long-term role; would work sponsorship be an option after I've spent a significant amount of time working with the team? And if not, are there options for transferring to a branch in [my home country]?\"\n\nIs there a politer way to put this? Are there any hiring managers who have experience with interviewing foreign applicants?",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/20d42f/how_to_ask_about_possible_work_sponsorshipvisa/",
      "comments": [
        {
          "body": "It is going to be awkward but you will need to ask it.  What you stated sounds great. I went with something like: \"what is your policy on visa sponsorship, is this something you would consider? \"\n\nMy advice is be straight forward, If not you will waste time and effort, and then you will be disappointed when they turn you down only for the visa issue.  You probably will not get as many responses back, but does who will respond won't be a waste of time. \n\nNow, be straight forward during the interview, but do so to the hiring manager or person, preferably to them and not to HR. I think HR departments will turn you down immediately while hiring managers might give you the benefit of the interview, at least that was my experience most of the time. ",
          "score": 5
        }
      ]
    },
    {
      "title": "Non-EU job seeker trying to work in Europe (Belgium/NL). Stuck because of work permit. What’s the realistic path?",
      "body": "Hi everyone,\n\nI’m looking for some realistic advice from people who have been in a similar situation or who work in hiring/recruitment.\n\nI’m originally from Algeria, with 4+ years of experience in procurement / buying / project procurement in a large international company. Over the past months, I’ve been actively applying for roles in Belgium and the Netherlands and tailoring my CV carefully for each position.\n\nAfter many applications, I’ve managed to get a few screening calls and interviews, but they all end the same way: once the topic of work permit comes up, the HR starts getting disappointed.\n\nI even visited some interim onsite but they all require to apply online.\n\nHere is my situation: •\tI do not have an EU work permit •\tI hold a long-term Schengen tourist visa •\tI have close family living in Belgium, so I travel there frequently •\tOn my CV, I usually state that I’m in Belgium, and during interviews I explain that I’m originally from Algeria but come often to Belgium •\tRecruiters often seem interested at first, but once they realize I need sponsorship, they start bringing some excuses.\n\nI’m aware that a tourist visa does not equal the right to work, and I don’t want to mislead anyone. At the same time, if I clearly state “based in Algeria” on my CV, I honestly get zero callbacks, which makes the whole process feel like a dead end.\n\nMy questions are: •\tHow do non-EU candidates realistically get their first job in Europe? •\tAre there specific countries, visa types, or employer profiles that are more open to sponsorship?\n•\tAm I wasting time applying to normal LinkedIn roles without an existing permit?\n•\tWhat would you do differently if you were in my position?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1pppwz5/noneu_job_seeker_trying_to_work_in_europe/",
      "comments": [
        {
          "body": "You’re not doing anything wrong most roles in BE/NL quietly expect an existing work permit. Non EU hires usually get in through sponsor-friendly companies, shortage roles, or internal transfers. Applying to standard LinkedIn postings without targeting those employers is unfortunately very low-yield.",
          "score": 3
        },
        {
          "body": "You probleby wont make enough money to live in the netherlands.\n\nAnd as a non eu, non dutch speaking, getting a job is so much harder",
          "score": 3
        },
        {
          "body": "Employers only look to sponsor the visas of people with rare skills that are not easily found in their local market. Procurement, unfortunately, is not one of those.",
          "score": 2
        },
        {
          "body": "You're better off staying home.\n\nYou said you don't want to mislead anyone but you already do exactly that by stating your location as being in BE on your resume.",
          "score": 2
        },
        {
          "body": "You are misleading potential employers by implying you have a right to remain and work in the EU. This in turn reflects badly on you and your country.  \n\nIf you can’t get work in Algeria with firms that have an international network and opportunities for progression laterally or between partner companies you certainly won’t get employed in the EU. Try to rise up the ladder at home first.",
          "score": 2
        },
        {
          "body": "There needs to be a justifiable reason for a European country to sponsor the visa of someone from North Africa, with skills that could easily be found in their own country.",
          "score": 1
        },
        {
          "body": "search for countries that an easy oath to accept foreign worker like Germany",
          "score": 1
        },
        {
          "body": "Have you ever tried applying with a job seeker visa? You will most likely be eliminated in location-based filters, but you can look for a work in the country you apply to with a job seeker visa.",
          "score": 1
        },
        {
          "body": "I don't know ground level situation, but less calls are better than many calls and negative results. A zero is always better than a minus. Mention in your CV clearly, you need sponsorship, as you are from Algeria, and most important, how you can benefit the company. Perhaps a blunt mention in CV will save lot of time for both side and you will get some meaningful calls.",
          "score": 1
        },
        {
          "body": "How expats get their jobs in Europe? By applying from their home country, not lying in their resume or interviews and most importantly by doing all those legally and not on a tourist visa. \n\nMy advice is for you to go back and do everything as you are supposed to and not by finding holes to fit in the system.",
          "score": 1
        }
      ]
    },
    {
      "title": "Strategy to secure an offer in Europe as a Japanese by the end of March",
      "body": "Happy New Year, everyone!! This year, I really want to build my life in Europe for at least the next 3-5 years.\n\n**&lt;My background&gt;**\n\n28M, Japanese with 3+ years of working experience. I hold a master's degree from one of the top French business schools. I speak Japanese and English.\n\n* Business Analyst for A Big 4 firm for 1 year (PMO etc.)\n* Investment Advisor for a foreign government trade department for 2 years\n* Business Development Intern for a deeptech company (6 months)\n\nI would say my jobs are a mix of business development, account management and project management - but not like purely one.\n\n**&lt;Situation&gt;**\n\nI graduated from the business school in July, 2025, and then have been looking for a job in Europe. I am currently staying in London (I know it's one of the most expensive places).  \nSo far, I've been struggling to find a job. I had a final interview once, and a couple of other interviews, but not an offer - my CV has passed mostly only Japanese-related positions.  \n**Financially and to avoid a blank on my CV, I really need to find a job by the end of March 2026.**\n\nAround the end of Nov, I switched my strategy from applying for job postings on LinkedIn to cold outreach to Senior people/HR via LinkedIn. Some ppl are open to talk, but so far nothing concrete. I am also targeting / will target those countries and positions.  \nI like the UK, but I feel like even having a valid visa, being sponsored afterwards is super hard, or you don't even pass a screening if you're not British or a PR holder.\n\nTarget Markets:\n\n* **London** (but start moving away as it seems extremely competitive and visa sponsorship seems way tighter than most of EU countries)\n* **Germany** (somehow, I get more interviews there, and the visa is not too complicated)\n* **Paris** (My school is French and visa shouldn’t be an issue following that, but language is still huge)\n* **Netherlands, Belgium** (I know it's very competitive, but many English-speaking jobs)\n* **Lithuania** (the market is small, but English-speaking jobs at local tech companies, and it seems they have some privileges as Japanese in terms of visa)\n\nPositions:\n\n* Business Development / Sales\n* Account Management\n* Partnership Development\n* Marketing (my degree is marketing, but I don't really go for it as not much experience there)\n\n**&lt;Questions&gt;**  \nI really want to find a job here in Europe and build a life for at least the next 3-5 years.\n\n* Do you think it's a feasible timeline to have an offer by the end of March?\n* What do you think about the target market and positions?\n* Which do you weigh more - job postings or networking?\n* Any other advice is more than welcome!!\n* Or even should I move to one of the countries first to look for a job? (Not the UK)\n\nThank you for reading, and wish you all the best of 2026!!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1q0zy2p/strategy_to_secure_an_offer_in_europe_as_a/",
      "comments": [
        {
          "body": "I'm curious why you didn't study French while pursuing your master's degree in France.",
          "score": 1
        },
        {
          "body": "You could try applying to AGC Glass Europe in Belgium. It’s a Japanese company, and they really value someone who speaks Japanese. There is also Toyota Europe in Belgium.",
          "score": 1
        },
        {
          "body": "March is pretty tight, you’re relying on luck. The bigger countries (UK, Germany) are very competitive. You have some good qualifications so it’s not impossible, but it could go either way. Good luck. ",
          "score": 1
        },
        {
          "body": "You say you know English but write in some parts as if yours is not enough, i dont get it. If your English proficiency is a problem then why would you write it as if you know how to speak in professional level.",
          "score": 0
        },
        {
          "body": "Considering that even when I get an offer quickly, it still takes 2-3 month to get a job. This is from apply-ing to accepting an offer. The process is rarely quick and considering January is a year-end close in many places and audits, I expect it to be a slow month. Anyway, what I wanna say is that if you wanna get a job by March, you need to land one of the jobs you apply this week.",
          "score": 0
        }
      ]
    },
    {
      "title": "How did I get rejected from a position that I fit?",
      "body": "Hi ok so how? I am so sad and mad that I didn't get this internship that I needed so badly. If I got it my life would have been set. I just don't know how I didn't get it. \n\nI have the degree they want, my GPA is 4.0, I live in same zipcode of office, I go to the college they specifically recruit from, I don't need visa sponsorship, I can use excel very well, and the list goes on. I also asked appropriate questions during my interview to show I am interested in the company and sent thank you emails. \n\nI don't know how I could be any better. Did the accepted folks all have prior 2020 internships that I was unable to get due to pandemic?\n\nIf I cannot get that position I have no idea how I can get any of the others. Should I email hiring manager and ask what got me rejected?",
      "subreddit": "jobs",
      "score": 117,
      "url": "https://reddit.com/r/jobs/comments/r18n7n/how_did_i_get_rejected_from_a_position_that_i_fit/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "You could have been up against 20 other people with a good GPA and know excel. Those aren't exactly uncommon things, and then there is also the culture fit stuff too.\n\nSomething to keep in mind is that you could be a great match, but odds are there are plenty of others too.  Each job can get 200-300 people applying.  ~10% actually get screening calls from HR; maybe 5 actually get an interview.",
          "score": 127
        },
        {
          "body": "Whoa. Being qualified doesn't entitle you to a position. It just means you are eligible. That's just baseline, yeah, you can do what they are asking you to do.\n\nYou could have bombed the interview and not known it.\n\nYou don't know who else interviewed. Some whiz kid could've been your competition.\n\nSomebody else may have stated lower pay expectations.\n\nLots of factors.\n\nEDIT: It's not Match.com, it's Tinder.",
          "score": 247
        },
        {
          "body": "You may be perfectly qualified for a position, but the manager is still under no obligation to hire you. The manager may decide to hire someone who is less qualified, but whom she likes better.",
          "score": 153
        },
        {
          "body": "Sometimes, no matter how qualified someone is, it comes down to VIBE! If your vibe is off...or if the interviewer doesn't feel you (and your vibe) will fit in with their team, they won't hire you",
          "score": 86
        },
        {
          "body": "Sometimes the reason isn't that you did something wrong, it's just that someone else did something \"more right.\" I've been in this position many times and it is frustrating. It's not necessarily something you did, just that someone else had something that stuck out to this particular hiring team. Maybe they had volunteer experience. Maybe they had a previous internship. Maybe they included a really good recommendation letter. Maybe they had a random hobby in common with someone on the team and they hit it off really well. It could be any little thing.\n\nIt's hard not to get discouraged but keep applying. It sounds like you're a good candidate and you will be the right fit somewhere.",
          "score": 19
        }
      ]
    },
    {
      "title": "How good is migrate mate?",
      "body": "Has anyone here tried using Migrate Mate? They say they only list jobs that sponsor work visas (like H1B, green cards etc) and I’m wondering how reliable it is compared to the usual sites like LinkedIn or Indeed. If you've used it did you actually get interviews or offers? Curious if it’s just another job board or if it really helps for international applicants",
      "subreddit": "jobs",
      "score": 21,
      "url": "https://reddit.com/r/jobs/comments/1ojxerj/how_good_is_migrate_mate/",
      "comments": [
        {
          "body": "I used it while I was stressing on OPT and it helped me stay organized. Like ofc it’s not going to land the job for you, but if you use it right you can get a couple of good leads and one of them turned into a short term contract that kept me in status",
          "score": 10
        },
        {
          "body": "Depends on how you go about it honestly. If you’re expecting a guaranteed job, you’re gonna be disappointed no platform can promise that. But if you’re just looking for filtered listings where the companies are actually open to sponsoring, it’s super helpful and has actual listings that are still open not old dead ones",
          "score": 9
        }
      ]
    },
    {
      "title": "How are people actually getting remote contracts right now?",
      "body": "Hey Everyone,\n\nI’m trying to get an honest read on what’s actually working in the current market.\n\n  \nI’ve got \\~6 years in data analytics and 2 years in ESG sustainability work . I’m based outside the US/EU, so my goal is remote roles or contracts with no visa restrictions.\n\nI’ve been actively applying for about 10 months now!!  I’ve tried tailored CVs, cold emailing smaller startups, LinkedIn outreach, and some posting. I get occasional replies, but very little that turns into interviews or paid work.\n\nAt this point, I’m less interested in theory and more in reality. (and Yes I'm tired af)\n\n**What I’d really value hearing:**  \n→ Where did your last real opportunity come from (job, contract, referral, platform, cold reach)?  \n→ Are job applications still worth serious time, or mostly a numbers game now?  \n→ Is cold outreach to founders or hiring managers actually converting for anyone?  \n→ If you were aiming for remote work without visa constraints today, what would you focus on? What are the platforms are you applying for the remote contracts?\n\nNot looking for hustle slogans or generic advice. Just honest experiences from people who’ve been through it recently.\n\nThanks really appreciate it.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1qbku17/how_are_people_actually_getting_remote_contracts/",
      "comments": [
        {
          "body": "Thanks a lot for insights man! I do have around 8k followers on LinkedIn and I'm also posting on LinkedIn so I just gotta find a way to proper outreach. I do try not to salesy and keep my outreach 20-30.",
          "score": 1
        },
        {
          "body": "Well, if you are really good at ESG/sustainability, you should be able to find some good freelance projects through Growth For Impact.",
          "score": 1
        }
      ]
    },
    {
      "title": "Apple Job Offer",
      "body": "I finally got the verbal offer from my recruiter. All said and done but she mentioned that she can’t be releasing the offer since next year will be my last year of OPT. I already gave the recruiter with all these Immigration related details before even proceeding to interviews but after my first interview, the recruiter changed because the initial recruiter who took all the details of Immigration had to leave for vacation out of country. Now, can anyone please guide as how to talk and convince my recruiter with options so that she considers them and releases the offer.\n\nThe options that I have on mind\n\n1. I have asked my recruiter about the Day-1 CPT option, to which she replied that she doesn't know about it and will get back to me on this by Jan 5th since they are on break until then. But I am not sure if Apple would be accepting Day-1 CPT.\n2. I also told her that I was ready to move back to India if there is any position open under the Manager and the team and if my H1B gets picked this year then I can move back to US on H1B if not I will stay with Apple for an year and later they can sponsor me with L1 visa as well.\n3. If this position can be given to me on contractural basis for time being, I can continue working with Apple but with their preferred vendors payroll. I didn't yet ask her on this, but would like to know if it is viable.\n\nCan you suggest some other realistic chances that I can tell her regarding this. Appreciate your feedback in advance.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1puqcd0/apple_job_offer/",
      "comments": [
        {
          "body": "Oh, for some reason the options that I typed haven’t been displayed on the post. Will edit the post",
          "score": 1
        },
        {
          "body": "Did apple get back with the offer.",
          "score": 1
        }
      ]
    },
    {
      "title": "Got laid off - need advice!",
      "body": "On Friday I got laid off. I kinda saw it coming but it was still a shock and even though I’m updating my resume and reapplying I still think I’m in shock.\n\nI got laid off due to performance issue - as what the company says. I was contracted through an agency and they sent me a whole performance review doc that my (old) manager wrote. It was shocking and while reading, i do get that I wasn’t meeting the expectations- well they hired someone who just graduated from master’s and have barely even 2 yrs of experience in a 5yrs of experience internal role. \n\nReading the review some parts seemed very unfair and untrue (as in saying I wasn’t doing x task repeatedly, when in reality I DID and they know!). Even my agency was a bit shocked and questioning the report as I only worked less than three months and my role changed twice. And now seeing it, they just wanted to get rid of me and write more harshly. Already 4 people before me got fired.\n\nAs what is already done, i don’t want to think about it and move on as I don’t have a lot of time due to my visa. If I get an interview and asks me about why I only worked that short or quit (not gonna say I got fired🫠), how should I answer?",
      "subreddit": "jobs",
      "score": 10,
      "url": "https://reddit.com/r/jobs/comments/1qa7h76/got_laid_off_need_advice/",
      "comments": [
        {
          "body": "First, I’m really sorry this happened. Being laid off always messes with your head, even when you “see it coming.”\n\nFor interviews, keep it short, neutral, and professional. Don’t say you were fired, but don’t lie in a complicated way either. Something like:\n\n“It was a contract role and the expectations changed quickly. After a couple of role shifts, it became clear the position wasn’t a good fit for either side, so we decided to part ways.”\n\nOr:\n\n“The role evolved into something different from what I was initially hired for, and with such a short ramp-up time, it wasn’t set up for success.”\n\nThat tells the truth without blaming or oversharing.\n\nAlso, 3 months + role changed twice + hired underqualified for a senior role = that’s a company problem, not a you problem. Most experienced recruiters understand that contract placements fail all the time because of bad scoping.\n\nIf they push:\n\n“What I took from it is clarity on what kind of environment I work best in, and I’m being more intentional about that now.”\n\nCalm, reflective, forward-looking. That’s what they want to hear.\n\nAnd small Reddit reality: almost everyone who’s been in the workforce long enough has a “bad contract” story. You’re just getting yours early.",
          "score": 5
        },
        {
          "body": "If you're laid off you're okay for unemployment and it doesn't look bad when you're looking for other jobs (compared to being fired)\n\nI worked at a firm for 7 years, they decided to move me into a position tha tno one wanted that was doomed to fail and it did, and when they laid me off the boss said \"it's not entirely your fault...\"\n\nNone of it was my fault. I just signed my papers and left, I couldn't wait to get out of there.\n\nI'm still looking for a job but in interviews I do not look bad having been laid off so keep that in mind.",
          "score": 1
        }
      ]
    },
    {
      "title": "Hiring manager said HR would reach out next week, then visa question and silence. What should I do?",
      "body": "Hi everyone, I am looking for some perspective on a situation that has been weighing on me.\n\nI interviewed with my dream company for my dream role and had a conversation with the hiring manager. The interview went extremely well and it genuinely felt like a great fit on both sides. Toward the end, they mentioned that while the general wait time for candidates is two to three weeks, I could expect a call from HR the following week.\n\nThe next day, they emailed asking about my work authorization. I explained that I am on OPT, valid for three years, and would eventually require H1B sponsorship after that.\n\nAfter that, communication went quiet.\n\nA week later, I sent a polite and professional follow up asking about next steps. I received a generic response along the lines of, “We will let you know if we decide to move forward with the next round.” No HR call ever happened, and it has now been about a month.\n\nI fully understand that visa considerations can be a deciding factor, and I am trying not to take it personally. However, the sudden shift from being told to expect a call next week to silence has been difficult to process.\n\nAs an international student, the job market has been especially challenging, and I am now considering leaving the country since opportunities feel very limited right now. My dilemma is the following:\n\n* Would it be appropriate to send one final polite email asking if I am still under consideration?\n* Or is it better to assume this is a soft rejection and move on?\n* Has anyone been in a similar situation where things eventually worked out after a period of silence?\n\nI am not trying to pressure them. I am just looking for clarity so I can make an informed life decision. Any advice or shared experiences would really help. Thank you.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1q4axx4/hiring_manager_said_hr_would_reach_out_next_week/",
      "comments": [
        {
          "body": "Keep looking until you actually start somewhere.  Until then, nothing is guaranteed.  Good luck!",
          "score": 1
        },
        {
          "body": "I’d consider that a rejection. Hiring does slow around the holidays, but if you expected a call &gt;a month ago, it’s not happening. \n\nSorry. Visa is tough, especially right now.",
          "score": 1
        },
        {
          "body": "Move on.. it’s over",
          "score": 1
        }
      ]
    },
    {
      "title": "VISA Interview for SWE role(. NET developer)",
      "body": "VISA Inc Interview Preparation \nHey,\n\nI have my interview scheduled in 5 days.\nPlease provide inputs on how can I prepare in the last minute for the technical rounds and all!\nWhat are all concepts I need to focus on?\nEspecially for DSA and design questions?\n\nPlease share your interview experiences as well\n#interview #career #visa #sde #softwareengineer #swe ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1kvs7q1/visa_interview_for_swe_role_net_developer/",
      "comments": [
        {
          "body": "Five days is actually a solid window to sharpen your technical skills for Visa. Focus heavily on system design fundamentals like scalability, load balancing, database sharding, and caching strategies since Visa processes massive transaction volumes. For DSA, prioritize medium-level problems on arrays, strings, trees, and graphs - these come up frequently in their coding rounds. Since you're interviewing for a .NET role, make sure you can discuss C# specifics like garbage collection, async/await patterns, and LINQ operations fluently. Visa tends to ask about real-world scenarios, so think about how you'd handle payment processing challenges, data consistency, and security considerations.\n\nThe behavioral rounds at Visa often center around their core values and how you handle pressure situations, which makes sense given they're in the financial services space. Practice explaining your past projects with clear impact metrics and be ready to discuss how you've dealt with tight deadlines or system failures. They love candidates who can think about the bigger picture of how their code affects millions of users' financial transactions. Don't underestimate the importance of asking thoughtful questions about their tech stack and engineering culture.\n\nI'm actually on the team that built Interviews Chat, and it's designed exactly for situations like this where you need to quickly prepare for company-specific technical questions and practice articulating complex concepts under pressure.",
          "score": 2
        }
      ]
    },
    {
      "title": "Just got a job!!!",
      "body": "Hi guys! Would like to share a win today and saying that it’s possible!\n\nI’ve posted in this sub many times asking about interview tips and how to deal with last round rejections (that sure damn hurts). People keep saying that rejection is just a redirection and that a better job that’s meant for you will come along.\n\nOf course, I keep my head high and be hopeful, applying anywhere that would make sense and prepping like hell when it comes to interviews and case studies. And last week, I finally got a JOB!! \n\nAt the time, I was interviewing with two companies, and while the other company also wants me for the second round, their process took such a long time (almost 2-3 weeks in between rounds). But for this company, we really clicked, and I went through 3 rounds of interviews within 3 weeks (so basically once per week). I feel like if the company likes you, you could kinda feel it. Before the last round, I mentioned that I’m also interviewing with another place, but indefinitely prefer theirs. They ended up speeding through the whole process so that I could get an answer before the other interview at another company rolled around.\n\nI also gave a salary range to them, but since it’s my first big girl job, I wasn’t sure how much I could ask. I did some research online to find the best range for my position and give them that. And the company actually maxed out the range I gave them! Very surprising, but I’m super glad for it.\n\nThey’re also willing to sponsor my visa, which I am ETERNALLY grateful for. Many companies just rejected me off the bat just based on that. \n\nSo, I guess what I’m trying to say is that please keep on going! Good things can and will happen. It’s a combination of luck and preparation. I wish you guys all the best! ",
      "subreddit": "interviews",
      "score": 207,
      "url": "https://reddit.com/r/interviews/comments/1mk64y7/just_got_a_job/",
      "comments": [
        {
          "body": "My problem is I’ll feel like I vibe with the interviewers/recruiters/HR person, but then still won’t get the job. It just happened even though an HR rep reached out to ME. So now trusting my gut after an interview is difficult.",
          "score": 16
        },
        {
          "body": "hey congratulations, really glad for you. yes I agree with, if a company matches, they also try to make it easier and quick for the candidate, it depends usually but I agree with what you said",
          "score": 8
        },
        {
          "body": "Congratulations Girl!!!",
          "score": 2
        },
        {
          "body": "Congratulations!!!",
          "score": 2
        },
        {
          "body": "Love to hear it!!! Congrats 💖💖",
          "score": 2
        },
        {
          "body": "Great win - especially if they were willing to sponsor the visa. \n\nCongratulations!",
          "score": 2
        },
        {
          "body": "That is great news congratulations 😊",
          "score": 2
        },
        {
          "body": "Congrats 🍾🎈",
          "score": 2
        }
      ]
    },
    {
      "title": "Got the offer after 2 months of stress",
      "body": "What a ride. After almost two months of interviews, waiting, overthinking, and stressing out — finally got the offer from the company I’d been aiming for.\n\nI’d been applying nonstop to roles that offered visa sponsorship, and honestly, it was getting exhausting seeing rejection after rejection. But this one finally worked out — solid compensation and sponsorship, so it really feels like all that effort paid off.\n\nWhat helped was just staying consistent. Even after interviews that didn’t go great, I’d note what I could’ve done better and move on. Eventually things started to click.\n\nIf you’re stuck in the grind right now — keep going. You never know when things will finally fall into place.",
      "subreddit": "interviews",
      "score": 100,
      "url": "https://reddit.com/r/interviews/comments/1ogkfnk/got_the_offer_after_2_months_of_stress/",
      "comments": [
        {
          "body": "Yaaaay congrats!! \nDid you tailor each CV for the position? And did you use AI to improve your CV or to make it ATS friendly?",
          "score": 3
        },
        {
          "body": "&gt;What helped was just staying consistent. Even after interviews that didn’t go great, I’d note what I could’ve done better and move on. Eventually things started to click.\n\nStaying consistent is key to success of finding a job. Consistency as to applying for jobs, Go through interviews to best of your ability with good vibes, going in with a mindset you don't have the job until offer is in your hand, and repeat.\n\nThe more consistency the better for you to find that job you want. Its what worked for me even if it took months. The more rejection emails I get the more I move forward to other jobs I applied to. At the end i had 3-4 offers accept during a 4 month job search.",
          "score": 3
        },
        {
          "body": "Congratulations",
          "score": 2
        },
        {
          "body": "Congratulations !",
          "score": 2
        },
        {
          "body": "Congrats OP! Share your wisdom for us peasants",
          "score": 2
        }
      ]
    },
    {
      "title": "After final interview, no one replied to my thank you email. Is this normal or does it mean something?",
      "body": "UPDATE: I didn't get the job...\n\n\n\nI had a final interview this Wednesday. After several rounds of interviews, I finally got invited to fly out to their city for the final interview.\n\nI had coffee with teammates - had super fun, one of them even gave me handwritten notes of thank you for interviewing with them. Had lunch with directors. And I got starbucks giftcard from one of them for lunar new year. And had a final interview with directors&amp;VP including office tour. It was quite intense one and a half hour interview but I guess it went well. \n\nEverything looked like good signs until I sent out thank you email to HR and hiring manager and both of them don't reply.... Does this mean something? Or am I overthinking this? Please let me know.. \n\nThey told me I will hear back early next week but this weekend feels like forever 😭 Especially when my visa will expire soon so most likely this will be my chance... ",
      "subreddit": "interviews",
      "score": 42,
      "url": "https://reddit.com/r/interviews/comments/1iflbqt/after_final_interview_no_one_replied_to_my_thank/",
      "comments": [
        {
          "body": "I almost never get a reply for a thank you email.\n\nOne time I did, I ended up getting rejected.",
          "score": 82
        },
        {
          "body": "THEY wrote you a handwritten note and sent you a Starbucks GIFT CARD? Unheard of.",
          "score": 50
        },
        {
          "body": "As a hiring manager, I've never responded to a thank you email. It's not personal, it just avoids setting an expectation that I'm available to chat about the position further and that I'm able to provide updates on where we're at in the hiring process.",
          "score": 32
        },
        {
          "body": "You are just worrying too much. Have some patience. 😄",
          "score": 22
        },
        {
          "body": "You want them to thank you for you thanking them? Don’t overthink it!",
          "score": 16
        },
        {
          "body": "Means nothing.",
          "score": 12
        },
        {
          "body": "i never reply. means nothing.",
          "score": 9
        },
        {
          "body": "Yes, it is normal NOT to receive a response after a thank you email. \n\nFor me, the rationale is that there is nothing new to say until a hiring decision is made. At that point, you get the call (yay) or email (nay). If you’re offered the job, I will thank you for your email during our conversation.\n\nAs another commenter suggested, pull back on your expectations in the job search. Reset your expectations. \n\nJust go through the motions, apply, interview, thank you note, apply, interview … until you get the call with a job offer.\n\nI know it’s hard to keep emotions at bay during this process. I was the same way. But do try.",
          "score": 10
        },
        {
          "body": "I’ve never replied to one 🤷‍♂️",
          "score": 9
        }
      ]
    },
    {
      "title": "How I got a job offer after a 10-year gap and a forgotten name on my CV",
      "body": "Hey folks! Just wanted to drop an anecdote that might give some of you hope. If you're feeling like you're shouting into the void with every application... trust me, I was there too.\n\nI started applying last year with what I thought was a good CV. Design-wise, sure it looked nice. But substance? Meh. I kept refining it. Rewriting my cover letters. Tailoring everything like a mad seamstress. I even made English, French and German versions of it. I had an Excel tracker so detailed it could’ve been audited for ISO 17025 LOL 😭\n\n* Date of application\n* Company name\n* Job Description (that was linked to job ad so I can check it ang go back to it later on)\n* Contact person\n* Status (simple yes and no column just to check if the application has been received)\n* And finally: the heartbreak column... rejections in red, interviews in green. Most days were a sea of red and white (ghosted applications WAAAAH).\n\nOh, and the kicker? As the title already says, I have a 10-year employment gap. Not 1. Not 2. Ten. Yep. Double digits.\n\nI started applying seriously about 1.5 months ago. In my Excel sheet, I am now at 150+ submissions... I got one interview invite. Just one. But here’s where it gets good.\n\nLike any obsessive job hunter, I kept a file for every tailored application named \\[MyName\\]\\_CV\\_\\[Company\\] and \\[MyName\\]\\_CL\\_\\[Company\\] so I could review what I actually sent them. When I got the invite, I went back and saw that… I’d forgotten to put MY NAME on the actual CV. 😭 WTF\n\nStill. They invited me. So I decided: I’m going all in.  \nI researched the company like I was preparing for the freaking Apocalypse. LOL I went to Glassdoor, Kununu, Company site, and idk how many YouTube videos I watched. I even watched interview prep content until YouTube thought I was HR. HAHAHAHA My algorithm is so broken that it now shows 90% interview prep videos. I created a google doc of possible questions, recorded myself answering them, practiced so many times that I was suddenly dreaming about the freaking questions. I debated over headset vs. earbuds. (I chose headset. No regrets.)\n\nOne day before the interview, I set up and cleaned my desk, my background and tested audio and lighting. I had to McGyver some contraption for my webcam so it laid not on top of my monitor but close to where the conference window was set on my monitor. I cleaned my computer desktop and put a plain white background, disabled all alarms, that whole shebang.\n\nOn the interview day, there was a few minutes of panel intro. And then came the questions:\n\n1. Tell us about yourself\n2. Why should we hire you?\n3. What motivates you?\n4. What about that 10-year gap? What did you do during that time?\n5. How would you react to a difficult situation in the workplace.\n6. What makes you the best candidate for this position?\n7. Are you a team player or independent?\n8. How would friends &amp; family describe you?\n\nGuess what? ALL those questions were in my prep doc. When I was prepping, I kept revising them and timing myself for the answers (1-2 minutes per question... some 3mins where I had to explain more like my gap or something). Some questions were merged, some rephrased but I had an answer ready for everything! I was shaking and tried to calm myself by drinking water (prep a glass so you can drink while you are being interviewed - we don't want dry throat!). BUT!!!! I was still nervous haha I was actually so stiff and my teeth were clenched near the end of the interview. 😭 Boy was it so anxiety inducing.\n\nAnd then it was my turn to ask my own questions:\n\n1. What's the biggest challenge your team is facing right now? I would like to understand the priorities and how I can help.\n2. How would you describe your team culture?\n3. How diverse is your team? (I’m a foreigner, so this really mattered to me.) Bonus guys! They asked about my language skills, I said A2 in German but improving and explained how important communication and cultural integration is...and how eager I am to being fluent. They said: “We offer language courses. You’ll integrate just fine.” (Cue inner fist-pump. YAY)\n4. Did I answer all the questions you wanted to ask? – They said yes, but then immediately asked about my availability and salary expectations. Because I had already researched visa timelines and salary benchmarks and so I gave solid confident answers. Phew!\n\nI then emailed the recruiter after my interview (about 1hr give or take) to thank them and politely asked to extend the same message to the hiring team.\n\nBTS: I researched the people on that Interview schedule e-mail on LinkedIn. Found 2 of them and added them just after the interview. One accepted the invite immediately. Thanked them for accepting the invite and thanked them again for the chance of interview. The other accepted after 2 days. (a good sign? I would definitely say so!)\n\nThen came Friday.  \nAfter 4 days of stress, anxiety, and interrupted REM cycles, I got THE e-mail:\n\n&gt;After consultation with the department, we all realised that we found you to be super confident and positive! For this reason, we would like to employ you as \\[X position\\].\n\nI made it! Holy Molly! I cried reading that e-mail!!!!\n\nTo all of you still in the grind: DO 👏 NOT 👏 GIVE 👏 UP.\n\nIf someone with a 10-year gap, a forgotten name on a CV, and 149 rejections can make it, so can you.\n\nI'm rooting for you. Always.\n\nEDIT: added THE email excerpt. Idk why it disappeared. Hope it works now.\n\nEDIT2: u/ExtraAccident4002 asked for a list of my prep questions and here they are. I hope it helps people out there for their own preparations.\n\n* Tell me about yourself\n* Why do you want to work in our company?\n* Why should we hire you?\n* What are your strengths and weaknesses?\n* What motivates you in your work?\n* Where do you see yourself in the next 5 years?\n* What isn't written in your CV?\n* Do you know anything about our company?\n* Walk us through this employment gap.\n   * What did you do during those years?\n* Are you a team player or a solo player?\n* Are you more of a follower or a leader?\n* Why choose Germany instead of staying in \\[X country\\]?\n* How do you see yourself in the first 30 days of your job?\n* Tell us about a time\n   * when you solved a difficult problem in your workplace.\n   * when you failed at something.\n   * there was a disagreement/conflict in your workplace.\n   * you were successful.\n* How would your colleagues/friends/family describe you?\n* How would you manage a stressful situation?\n* Technical questions depending on job role.\n* How do you deal with confidentiality?\n* When is the earlies we can expect you to join?\n* What is your salary expectation?\n\nI am also adding the list of questions I listed that I wanted to ask.\n\n* What’s the biggest challenge your team is facing right now that you hope this new hire can help solve? I’d like to understand your priorities better and how I might contribute.\n* As a follow-up question, in your opinion, what is the difference between a candidate that is good for this role versus one that is excellent? (this was asked of me so I did not ask it)\n* What does a typical day or week look like for someone in this position? (was also explained in the introductions)\n* How do you support new team members during the first months here? Mentoring perhaps? (also in introductions and during q&amp;a)\n* How would you describe the company culture especially in your team?\n* As I am currently in the process of language and cultural integration, so I’m curious. Does the team already have a mini world map with pins for everyone’s nationalities? Or might I be the first to add a new one? (Rephrased this one a little bit because I wanted to test the waters first before asking too casually but there were some laughs. )\n* What would be the next steps going forward? (This was something I wanted to ask in my thank you email after the interview but it was answered during the end).",
      "subreddit": "interviews",
      "score": 271,
      "url": "https://reddit.com/r/interviews/comments/1l573xv/how_i_got_a_job_offer_after_a_10year_gap_and_a/",
      "comments": [
        {
          "body": "Congratulations!! I’ve spent the last 1 1/2 years looking for a new job (current job suuuuucks) and at times it feels like I’ll never find one. This definitely makes me feel better and I’ll be sure to double check that my name is on the CV!",
          "score": 12
        },
        {
          "body": "This is soooooo encouraging, congrats on the new job and that you for the positive message!",
          "score": 5
        },
        {
          "body": "What was the reason for your 10 year gap and how did you spin it? Congrats!",
          "score": 3
        },
        {
          "body": "how did you justify the gap ?",
          "score": 3
        },
        {
          "body": "Hey how did you appear confident in interview? Did you have many interviews before this one? Or did you record yourself and practice until you seem confident?",
          "score": 3
        },
        {
          "body": "Proud of you 😊. Nice touch on the LinkedIn adding! When do you start? ",
          "score": 3
        }
      ]
    },
    {
      "title": "Top Tips to Crack a Student Visa Interview",
      "body": "A student visa interview is vital to your chances of obtaining admission into the college or university of your dreams in Canada. Take a look at how you can do well in a student interview refer our blog for more information on making your dreams of studying in Canada - http://www.kananinternational.com/blog/top-tips-crack-student-visa-interview/\n\n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/6ct5vr/top_tips_to_crack_a_student_visa_interview/",
      "comments": []
    },
    {
      "title": "Got laid off - how should I answer in an interview?",
      "body": "On Friday I got laid off. I kinda saw it coming but it was still a shock and even though I’m updating my resume and reapplying I still think I’m in shock.\n\nI got laid off due to performance issue - as what the company says. I was contracted through an agency and they sent me a whole performance review doc that my (old) manager wrote. It was shocking and while reading, i do get that I wasn’t meeting the expectations- well they hired someone who just graduated from master’s and have barely even 2 yrs of experience in a 5yrs of experience internal role.\n\nReading the review some parts seemed very unfair and untrue (as in saying I wasn’t doing x task repeatedly, when in reality I DID and they know!). Even my agency was a bit shocked and questioning the report as I only worked less than three months and my role changed twice. And now seeing it, they just wanted to get rid of me and write more harshly. Already 4 people before me got fired.\n\nAs what is already done, i don’t want to think about it and move on as I don’t have a lot of time due to my visa. If I get an interview and asks me about why I only worked that short or quit (not gonna say I got fired🫠), how should I answer?",
      "subreddit": "interviews",
      "score": 7,
      "url": "https://reddit.com/r/interviews/comments/1qa7muf/got_laid_off_how_should_i_answer_in_an_interview/",
      "comments": [
        {
          "body": "If it was through a contract agency, all you have to say is that the contract ended. Contract jobs aren't permanent.",
          "score": 12
        },
        {
          "body": "Honestly just say it was a contract position that ended early due to restructuring or budget cuts - which is basically true since 4 other people got fired too. Don't get into the performance stuff at all, that's way too much detail and makes you look defensive\n\n  \nIf they push just say something like \"the role evolved differently than expected and it wasn't a good mutual fit\" and pivot to what you learned or how excited you are about their opportunity",
          "score": 5
        },
        {
          "body": "Contract positions end, that is their nature.\n\nSometimes they get extended, sometimes they end early.  \n\nYour contract ended.",
          "score": 4
        },
        {
          "body": "Good advice here already. Your contract ended. I’d also place that on my resume “(contract)” beside the job title.\n\nBut, in an interview, do not go into any of these details. None. Your contract ended. The end. Now tell me why you’re interested in this new position and how you intend to use your transferable skills…",
          "score": 1
        },
        {
          "body": "Keep it simple, factual, and non-defensive. You can say it was a short-term contract where the scope and expectations changed quickly, and it became clear the role wasn’t aligned with your experience level, so the engagement ended early. Don’t relitigate the review or criticize them, interviewers care more about how you explain it than the situation itself. If it helps, write out a one-sentence version and stick to it every time so nerves don’t pull you into overexplaining.",
          "score": 1
        },
        {
          "body": "Yeah, being in that situation is tough. In interviews, frame it as \"the role evolved into something different than initially presented\" and that you're looking for a position more aligned with your skills. Highlight the positive aspects of skill adaptability and what you've learned. Avoid getting bogged down in negativity, and keep the focus on your enthusiasm for future opportunities.",
          "score": 1
        },
        {
          "body": "When people are laid off the manager or the management try to get rid of people who they think are contributing less or is no need of him or her  in the future project or immediately. They are also under pressure of cost cutting. So they will start giving off the reason that your performance is suddenly lower and unexpected. So don't take it personally. \n\nFor the next interview just say you are affected by reorganization. And then say that this reorganisation  has redirected me to reconsider my next step and after consideration I feel that the new role is what I'm looking for.  \nDon't try to bring the performance issue and all that is what you are thinking but keep it in your heart.",
          "score": 1
        }
      ]
    },
    {
      "title": "I got the offer! Now I need advice on how to negotiate salary (first time doing this)",
      "body": "Hey everyone,\n\nI just got a full-time job offer after going through the interviews and selection day. The role is honestly something I’m really excited about — it’s right in my area of expertise, and I’d love to take it.\n\nThe only thing is, the salary came in on the lower end of the advertised range, and there was never any discussion about pay during the process. This is my first time negotiating salary for a university/public-sector type job, so I have no idea how much room there usually is to move within a grade or pay band.\n\nI’m planning to email HR to ask if there’s flexibility, but I’m not sure how direct I should be or how much to justify my request. Also, they mentioned earlier that someone would reach out about visa and relocation, but that wasn’t mentioned in the actual offer — should I bring that up in the same email or wait until later?\n\nAny advice or examples on how to word this properly (without sounding pushy) would be super helpful.\n\nThanks in advance — I really don’t want to screw this up.\n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1oj84ku/i_got_the_offer_now_i_need_advice_on_how_to/",
      "comments": [
        {
          "body": "You first need to get a clue of what similar roles are paying, otherwise this is just mindless aiming. \n\nWhat do similar roles pay, what’s the difference between the offer compared to that and then the range they had posted. \n\nFigure out your leverage and if you have any, build a response based on facts, leverage, and your capabilities to complete the duties if you’re already trained for them.",
          "score": 1
        },
        {
          "body": "What’s the job and what target salary did you tell them during the interviews/initial call?",
          "score": 1
        },
        {
          "body": "If they’re offering relocation and visa sponsorship you need to understand that that is a part of your whole package. So many companies wouldn’t offer that.\n\nMy suggestion would be to reach out trying to get an understanding of the full package? \n\nThank you so much for the offer I am very excited about the possibility of joining the company. The base salary appears a bit lower than the market but I would love to get a picture of the full package. Can you provide more details on the relocation package and visa sponsorship that were verbally offered? I was hoping for a base closer to X and would love to look at ways in which we can get there through base or other benefits.\n\nThis shows them you’re pragmatic and understand the bigger picture while still leaving the door open for salary negotiation",
          "score": 1
        }
      ]
    },
    {
      "title": "Intuit application",
      "body": "I'm interviewing at Intuit for SE - 1 position. I applied to a bunch of locations on the same day and I don't know which location I am interviewing for.\n\n  \nIs there a way to find out? IDK IF IT HELPS BUT MY RECRUITER SCREEN INTERVIEWER WAS AMERICAN. \n\nI also wasn't asked about my visa status or compensation in my recruiter screen. \n\n\n\nAny tips to find this out helps! Thank you!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1peh64a/intuit_application/",
      "comments": [
        {
          "body": "Same. She didn’t ask me anything about Visa Status or compensation",
          "score": 1
        },
        {
          "body": "I have the same question",
          "score": 1
        }
      ]
    },
    {
      "title": "What's actually happening?",
      "body": "I find myself in the weirdest predicament. I applied to the role and 1 week after they emailed me about my application and asked about my visa status (I will need a work visa). I responded, told them that I need to be sponsored, then they scheduled me an interview with my future manager. The interview went well and I can tell that she likes my past experiences. \n\nA week after, they emailed me that they want to contact immigration to clarify the visa process for me and I had a meeting with HR clarifying this process to me. In specific, they told me \"at this point, we would love to continue with you if we can sponsor you a visa\". I thought great! Then yesterday we had a meeting again, basically HR told me that immigration have clarified the steps needed and that the visa won't be an issue. They'll be passing this information to the future manager and \"if I'm her top pick, I'll be contacted for an offer\" and if I have any other question this week to let them know.\n\nThe difference in wording is odd and I noticed that they reposted the job posting 2 days before the last meeting. Is it just the process? Or am I being given false hope?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oqqafb/whats_actually_happening/",
      "comments": [
        {
          "body": "You reading too much into it, for me this is positive but continue applying for other roles.",
          "score": 2
        },
        {
          "body": "You are at this moment a bit of a hassle so they see whoever else applies if the other person can start you are no longer needed. Basically you are stalled!",
          "score": 1
        },
        {
          "body": "You didn't get the job, but they want to keep you open as an option. The manager will keep interviewing.",
          "score": 1
        },
        {
          "body": "What happened, I'm curious",
          "score": 1
        }
      ]
    },
    {
      "title": "Completed interviews with an organisation but recruiter said they have paused the interviews",
      "body": "Basically the title, I interviewed with a big fintech organisation for a Senior SDE role, I completed my interviews including the hiring manager round a couple of weeks ago. I followed up with the recruiter last week and got an update that the interviews were paused. \n\n  \nDoes this mean I am rejected, or do I still have a chance?\n\nFor context, I am on a time sensitive visa situation, so can I mention that as well to the recruiter?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1o3va4o/completed_interviews_with_an_organisation_but/",
      "comments": [
        {
          "body": "If they paused, it’s because things have changed and they aren’t sure they are going to hire anyone.  This being almost the end of the year they probably don’t have the budget. And if they do get the budget approved they won’t hire until after the holidays.\n\nYou can tell the recruiter, but it’s not going to change anything.",
          "score": 3
        },
        {
          "body": "Do you think they are interviewing you for YOUR benefit ?\n\n&gt;For context, I am on a time sensitive visa situation, so can I mention that as well to the recruiter?\n\nThey don't care of your situation, they care even less now that the hiring decision has been postponed.. Many reasons beyond your control.. Could be the approval or budget dried up, the new situation with Trump vs China has ramifications for everyone..\n\nYou're mind is best served MOVING ON, and not thinking about this, focus your energy and time on your next opportunity.. Dwelling on this will only cost you precious energy that you need for your job hunt.. If this opportunity surfaces again, GREAT; otherwise, no use dwelling on this with so little control for you..",
          "score": 1
        }
      ]
    },
    {
      "title": "Recruiter went silent after confirming offer approval — what should I do?",
      "body": "Hey everyone,  \nI’d like to get some perspective on my situation.\n\nI finished all my interviews with a company and was told they wanted to move forward with me. The recruiter confirmed I wouldn’t need visa sponsorship, asked about my start date, and said he was working on getting the offer approved. He even mentioned they’d extend the offer the following week.\n\nSince then — total silence.  \nHere’s a quick rundown:\n\n* **Oct 30:** Recruiter told me they want to move forward.\n* **Oct 31:** I confirmed I can start in 30 days and don’t need sponsorship (I’m an EU citizen).\n* **Nov 6:** He said he was waiting for final approval to send the offer and would schedule a meeting ASAP.\n* **Since then:** Nothing. I emailed him two days ago and sent a LinkedIn message yesterday. No reply.\n\nI’m thinking of sending this message next:\n\n&gt;Hi Recruiter,\n\n&gt;I wanted to follow up regarding the offer. It’s been a few days since our last exchange, and I haven’t received any update.\n\n&gt;I’m genuinely interested in joining the team and moving forward, but as things are time-sensitive with relocation planning, I might soon need to evaluate other options if there’s no clarity on timing.\n\n&gt;Could you please let me know where things stand on the approval process or when I can expect the offer letter?\n\n&gt;Best regards,\n\nWould you say this message is appropriately firm, or too strong?  \nAlso, how long would you wait before assuming the process is stalled and moving on?\n\nAppreciate any input from people who’ve been in similar situations — especially recruiters or HR folks who’ve seen this play out from the inside.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ovfmj6/recruiter_went_silent_after_confirming_offer/",
      "comments": [
        {
          "body": "Yesterday was a holiday m8. Give them until lunch tomorrow at least.",
          "score": 3
        },
        {
          "body": "That’s a perfect email. If they don’t email back, it is what it is unfortunately.",
          "score": 1
        },
        {
          "body": "30 days until start date is really long. They might have extended the offer to someone who could start in 2 weeks or Immediately unless that was their idea? \nin my own case I was waiting for an offer for 10 days and finally got it after 2 weeks. Later came to find they had extended to another candidate but they couldn't agree on salary so I was the runner up and got the offer.",
          "score": 1
        },
        {
          "body": "This just happened to me today. Had a verbal offer from a large AI governance company here in the US. For 3 weeks hiring manager and recruiter told me they are pushing for CFO approval. Ended up getting rescinded today due to Hiring Pause, that they are only approving AE roles right now. They will re-engage when things change on their end\n\nOP did you hear anything back",
          "score": 1
        },
        {
          "body": "Not sure if anyone is still interested, but here’s an update. I reached out to the recruiter a few times and got no response, so I escalated the issue all the way up to Trump. One of the team leads from my interviews (bless him) contacted HR on my behalf and explained the situation. The recruiter replied to me immediately after that. I’m supposed to receive my formal offer tomorrow.   \n  \nDesperate situations call for desperate measures, I guess.",
          "score": 1
        }
      ]
    },
    {
      "title": "MSFT SDE-2 INTERVIEW STILL NO REPLY",
      "body": "Hello everyone i was on h1b grace period and one of my interviews was with MSFT for sde 2. the final loop took place in first week of November and i had told the recruiter about my urgency. they told me that they will let me know asap. If its an outright reject recruiter told me that they will let me know within 2-3 business days of the interview and today its 9-10 business days after the interview. Still no reply . I wrote a follow up email last week  reminding her of the time frame that i have last 4-5 days left in my grace period(I had a backup plan of going on b2 so i went ahead and applied b2 visa). still no reply. what should i do? Application is still visible as (interview scheduled and all) no progress on that tracker either. should i email them again ? is it a good sign because she had told me she will tell immediately if i wasn't selected?",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1p00fcf/msft_sde2_interview_still_no_reply/",
      "comments": [
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "did you get any updates?",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview to check \"fit with the team\" – what should I prepare for?",
      "body": "Over the last couple of weeks I got through an HR screening and an interview with managers asking technical questions for a job. Tomorrow is the final interview and they want to check my fit with the team and delve deeper into my experience. \n\nThe job is in accounts payable, but I have only accounts receivable experience. Nevertheless, the feedback from the managers was that I come across as someone who is knowledgeable about the process and derives energy from solving problems, and I asked good questions that further demonstrated interest. \n\nI'm wondering what to expect and how to leverage the good feedback I have received. I'm an immigrant in an EU country and my current visa is expiring soon, and thus the stakes are quite high. I absolutely need this job and can't afford to be blindsided by a question. ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1ovh12u/interview_to_check_fit_with_the_team_what_should/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Give a concrete example of a time in which you showed collaboration. Preferably you give two examples of how you showed you’re a team player, a difficult time for the team and a time in which you managed and celebrated a team success. \n\nIf the company has their values listed somewhere then look them up, think about how your own values align with them and give examples of how you demonstrated those in previous jobs and teams. \n\nDo a DISC assessment, find out your type and explain how you can add value to a team based on that (again, give examples).\n\nDon’t just talk about yourself though, ask the interviewer questions as well. Just generally make sure you come across as nice, like-able and easy to work with.",
          "score": 1
        }
      ]
    },
    {
      "title": "Got an offer but more onsites coming up — should I accept now or wait?",
      "body": "I got laid off sometime ago and have been actively interviewing since. I just received an offer from one of the companies (let’s call it Company A). The pay is decent but it’s not my ideal role or company.\n\nThe issue is, I still have a couple on-sites scheduled next week with companies I really want to work for. Unfortunately, Company A isn’t willing to wait that long for me to make a decision.\n\nI’m on an visa, so the transfer and processing will take a bit anyway. Should I:\n\n1. Accept Company A’s offer (just to stay safe) and then move on if I get something better later?\n\n2. Or pass on it and risk being jobless if the other ones don’t work out?\n\nWould like some advice  on what folks  would do in this situation especially anyone who’s been through something similar on a visa?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1opgre8/got_an_offer_but_more_onsites_coming_up_should_i/",
      "comments": [
        {
          "body": "Accept. I read the title only. The rest of what you said does not matter. It is a bloodbath out there.",
          "score": 2
        }
      ]
    },
    {
      "title": "I got interview bombed 3 weeks after my application then radio silence",
      "body": "They called me 3 weeks after i applied.\nGot in a chat with the recruiter \"to get to know me\"  after that i received an email setting me up for a interview 3 days after. The day comes and the North American director of TA is present in the interview, she presented herself and took over the interview telling that found my resume \"refreshing\" (yes those were her words) after everything she told me to expect an email from the department manager. A day after i receive an email from the director of the department saying she wants to conduct the interview and got me an invite for said interview, it was the next day. This interview is really technical and specific after she asked me about my biggest professional challenge and i don't even remembered my answer i just went with a constant one that is common on the department, honestly i thought i butcher it. Not even an hour after got an email from the HR manager, said he got a good feedback and wants me back for a 3rd interview. The interview is set 3 days after. \nIn the interview he tells me they actually wants to ship me overseas to another location (not the one i applied to) on the same position and that's why the regional directors were conducting the previous interviews. He lays everything on the table and yes i accept i told him if they want to move the application to the new location that was more than ok for me. He then proceeds to tell me all the requirements and says \"well that's what you will need if we decided to go for your application\" like what.\nHe says goodbye with a \"I'm going to send the interview review and if everything is ok someone will contact you, will try to do it quickly because of time that takes processing the work visa\" \n\nIt's been 3 days of silence and I'm honestly losing my mind.\n\n\nEdit: just received the email with the offer it's not that bad actually so yeah i took it. Someone mentioned the salary and hear me out it's not low by any means but it's kinda leaning towards it. Also they provide housing and all paid expenses, 4 meals a day so yeah not perfect and have a shit ton of work to do but well at least it's better than my actual job :) see you after i sign my contract ",
      "subreddit": "interviews",
      "score": 7,
      "url": "https://reddit.com/r/interviews/comments/1nooacp/i_got_interview_bombed_3_weeks_after_my/",
      "comments": [
        {
          "body": "Don't give up hope. I just had the same thing done to me and one month later I received an email with an offer. I started the full time, permanent position yesterday.",
          "score": 7
        },
        {
          "body": "It sounds like they’re going to eventually offer you the job but potentially low ball you on salary. \n\nThat whole “you’re perfect, let’s move quickly, oh wait, we want you for another position, oh now that you’ve said yes we will contact you if we determine you’re good enough” - that whole thing is like love bombing lol. They came on strong, then changed position, then negged you at the end. It’s a classic move. \n\nJust keep looking and you will likely hear from these people eventually. But don’t accept a lowball offer.",
          "score": 3
        },
        {
          "body": "It’s only 3 days - could be any number of things like work getting in the middle and tying up managers or HR being typically slow. I wouldn’t sweat it for at least a week. If a full week goes by then send a polite thank you email stating you’re still interested in what they have to offer.",
          "score": 2
        },
        {
          "body": "That waiting period is the worst. Try to distract yourself and remember HR processes can drag on. A follow-up email in a few days wouldn’t hurt if you don’t hear back. Hope you get good news soon!",
          "score": 2
        }
      ]
    },
    {
      "title": "Advice on recovering from getting rejected after the last round",
      "body": "I know this has been asked a lot, but I had just been through a long process of interview at my dream company. It took a month and a half with many rounds, but I just received the news today that, for the last round, I did very well in every way, but they went with the other person. From the feedback, they did a little bit better in one of the soft skills (that I could easily develop).\n\nI'm an international in the country I'm currently living in, and getting this job would help me get my visa on track (finally). Well, I didn't get it, and it hit me really hard. I have to start over again.\n\nI just need to hear from someone that it'll be okay and more opportunities will come in the future. If anyone has been through that, can you tell me some uplifting stories or say some kind words? \n\n",
      "subreddit": "interviews",
      "score": 9,
      "url": "https://reddit.com/r/interviews/comments/1kqynir/advice_on_recovering_from_getting_rejected_after/",
      "comments": [
        {
          "body": "I’ve been through this. Rejection doesn’t mean you’re not good enough sometimes it’s just a small difference. You made it far, and that skill can be improved.",
          "score": 7
        },
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "It’s brutal to come so close and miss, but if you were runner-up at your dream company, that means you're already good enough—and the next “yes” might only be one interview away.",
          "score": 3
        },
        {
          "body": "I’ve been in the final rounds of four different places, one of which I thought I was seriously going to get (met the President of the company and their right hand people) to only be rejected three weeks later from all four. \n\nI’ll say this, which has helped me keep my chin up: rejection is just redirection. \n\nSomething will land eventually because everything happens for a reason. Sometimes, it’ll come when you least expect it. \n\nGood luck on your search. It is a rough market there, but you are meant to do great things!",
          "score": 3
        },
        {
          "body": "Last step rejection is brutal, been rejected there a couple of times now. All you can do is try to introspect what you did right and wrong, as to what might have gotten you rejected. Maybe getting some feedback is helpful from them unless they ghost you.\n\nRejection is part and parcel of the game, you need to pick yourself up, a great opportunity is right around the corner.",
          "score": 3
        },
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "Something similar happened to me and I'm also an international seeing everyone else get jobs while I stay motionless everyday from rejections so all the kind words of encouragement here are really helpful!",
          "score": 2
        },
        {
          "body": "It feels horrible but the kicker is: Normally those \"it's just that the other person was better at skill XYZ\" aren't necessarily true. It was simply the recruiter/worker's vibe which matched a bit better and they use any excuse to reject an extremely qualified person.\n\nOn the bright side: Normally companies may also consider you post-rejection for a different role at a later stage. Expand your network into this company so that maybe your dream company can contact you yet.\n\nAs poopy as it may feel, keep going. There's more than just that company out there and, one rejection can be a blessing in disguise. You got this!",
          "score": 2
        }
      ]
    },
    {
      "title": "Can I ask hr for second chance of interview at TikTok",
      "body": "Ok this is maybe a dumb question, but hear me out.\n\nAfter applying so many jobs at TikTok, I finally got an interview. Even though I heard their recruiter might ghost you but I still got it. Anyway I prepared for two days and did a lot of research about this role which I really like. I don't know why but I just so nervous that I didn't think I perform well....(yeah I am pretty mad at myself). The hr just asked two behavior questions and some general questions like my visa, work permit, location etc.. Today, I got the rejection email. This is something I expected, but still sad. Can I reach out to hr to have second chance? Or there is no need since I need visa sponsorship in the future. Btw if anyone have suggestions on TikTok interviews in general, would be really appreciate!!",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1o1yy9e/can_i_ask_hr_for_second_chance_of_interview_at/",
      "comments": [
        {
          "body": "If the rejection was because of a visa issue, it’s probably final since that’s a company-wide policy thing. But if it was more about the interview itself, like a behavioral answer or nerves, it’s fine to reach out. Sometimes when recruiters see genuine interest and effort, they’ll flag your profile for future roles or give feedback so you understand the reason behind the rejection.",
          "score": 2
        },
        {
          "body": "NO, don't reach out. Tik tok does not need to give second chances. They are massively popular and tons of people want to work there.",
          "score": 1
        },
        {
          "body": "Can you tell me the role and the team?",
          "score": 1
        },
        {
          "body": "Can you tell me the role and the team?",
          "score": 1
        },
        {
          "body": "Can I DM you?",
          "score": 1
        }
      ]
    },
    {
      "title": "Lost interview opportunity soon after they knew I’m on F1 OPT",
      "body": "Hey everyone,\nI’m a master’s student in a STEM program and recently ran into a situation that I’m not sure how to handle next time.\n\nThe company I interviewed with clearly stated in the job description that they don’t offer visa sponsorship, but they didn’t mention anything about whether they accept candidates on OPT/CPT.\n\nSo when I got invited to the second round of interviews, I mentioned my visa status in my reply email. (I probably should’ve asked during the first interview, but I forgot, so I decided to bring it up once they moved me to the next step.) Then I was immediately told that candidates with my visa type aren’t eligible for the role.\n\nDid I do the right thing by bringing this up before the second interview? Or should I have just ignored it and treated the interview as practice?\n\nI’ve also been rejected a few times after selecting “Yes” to the question “Do you now or will you in the future require sponsorship?” on job applications.\n\nSo what’s the best strategy for international students like us?\nAnd for any hiring managers or HR folks here — would you consider someone who can legally work in the U.S. for up to three years on OPT? I mean, policies and visa rules can always change, so even if a company doesn’t currently hire OPT holders, that might not stay the same forever.\n\nWould love to hear others’ experiences or advice 🙏",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1ocs83t/lost_interview_opportunity_soon_after_they_knew/",
      "comments": [
        {
          "body": "Technically you lied in your application. You do need sponsorship now or in the future. They’re not wrong to reject you. As for the rules and policies yes they always change but current reality is nobody wants to sponsor. That doesn’t mean you can lie in your application. Companies can blacklist you for that reason.",
          "score": 5
        },
        {
          "body": "If it’s an e-verified company then I guess there shouldn’t be any issue in hiring and opt guy ,unless explicitly stated company policies around it , I guess trying to progress in an interview is a better approach cuz at then end if you can really score good marks with the hiring team , they can vouch for you to the very end of hiring decision.",
          "score": 2
        }
      ]
    },
    {
      "title": "Matlab/simulink",
      "body": "I’m a recent MSEE graduate. I’m aware that experience matters most while trying to find a job. In my case all the experience I have is working under my professor in university. \n\nWhile applying I try to change my resume as much as I can to match the job role but the things which I did interms of projects, experience I don’t change them much so that I don’t have to worry during interview.\n\n\nWhat’s concerning for me is I’m only getting screening calls and not they are not going to interview level. \n\nThey ask experience, education, visa and that’s it. I’m used for seeing rejections daily but are there people out who are still successful getting jobs at entry level positions as EE graduate related to signal processing or image processing.\n\n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1omyof9/matlabsimulink/",
      "comments": []
    },
    {
      "title": "Any one else struggling to land interviews?",
      "body": "Hi \n\nI'm a Software Engineer with over 10 years of experience living in the Netherlands. I'm currently employed on a contract basis which expires next year. I'm trying to make a switch but I'm failing miserably. \n\nOver the past 5 months, I've applied for nearly 200+ vacancies. \n\nSo far I received 2 interview opportunities. \nThe first one I cleared all technical rounds but they chose another candidate. (Maybe because of my salary expectation of 90k)\n\nThe second I failed the leetcode test. \n\nApart from these 2, I didn't get a single interview opportunity. I'm surprised that the job market is very hard.\n\nAre others also facing similar situations? \n\nMore details:\n- I'm working on a dependent visa\n- I'm looking for a salary of 85k. Not sure if it is too much. I've set this based on peer's salary\n- I can't speak Dutch yet. I'm learning. \n- Key skills: Java, Spring, Microservices, Azure/GCP\n- My current project ends this year. So not possible for extending my contract. ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1odd28b/any_one_else_struggling_to_land_interviews/",
      "comments": []
    },
    {
      "title": "Need Interview Tips: 6th Attempt Tomorrow",
      "body": "It’s my 6th month of job hunting. \nAnd last 3 months have been okay ish. \nI’ve been getting interview calls. \n\nInterviewed at 5 places so far. \nI am unable to get past the screening rounds. \n\nHere’s how it went \n\nInterview 1 : I was over prepared (over preparation is what we do for every interview - it’s gives me confidence) but my performance in the screening interview was bad. He asked me what were the KPIs in my previous job. I fumbled. \nI didn’t see that coming. \n\n\nInterview 2 : \nHad great chances. They liked me. But were not sponsoring visa for this role so got rejected. \n\nInterview 3: \nSame thing - were not sponsoring \n\nInterview 4: \nI may have been seen as an under confident. \nI find it difficult to hold good conversation with a stranger. I’m unable to transfer good vibes. I really want to be likable but I can’t have a casual conversation with diff cultural Bg in the first go. I will be amazing once we get to know each other.\n\nBut I do prepare for smalls talks as well. It works!\n\nInterview 5:  \nThis was a dream company. \nThe role was perfect. \nI fucked up the impact/key metrics of a project they asked me. Said too high. \nAlso must have felt underconfident at the start of the interview. \n\n\n\nI have a 6th one tomorrow. \nAny tips/suggetions to navigate this?\n ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o5q6je/need_interview_tips_6th_attempt_tomorrow/",
      "comments": [
        {
          "body": "It sounds like you’re really close. Most of what you described isn’t about skill gaps, it’s about pressure and comfort level in the conversation. Try slowing down a little in the screening round and treat it more like a chat than a test.\n\nFor the questions on KPIs or impact, focus on one simple number or example that shows what changed because of your work. You don’t need to memorize a script, just show that you understand the results of what you did. You’ve already learned from each try, so you’ll go in stronger this time.",
          "score": 1
        }
      ]
    }
  ]
}