{
  "company": "walmart",
  "post_count": 70,
  "exported_at": "2026-01-18T17:44:53.315Z",
  "posts": [
    {
      "title": "An account of a successful job search for an Experienced Engineer",
      "body": "\\[Edit: RIP Inbox and comments on a throwaway account. Sorry, didn't expect this response and didn't realize I need to check my throwaway account too. The most frequently asked question seems to be: what coaching service did I use? I used Interview Kickstart ([https://InterviewKickstart.com](https://InterviewKickstart.com)). I didn't mention it earlier because I didn't want to be mistaken as someone advertizing for them. But if you are an experienced engineer and can afford it, they are a goldmine. I can attest they are very sincere group of people, in it for the right reasons, despite whatever your views may be about the interview process. I will review interview kickstart later. Happy to answer more on DMs only. See replies to specific comments below\\]\n\n====== Original Post follows =========\n\nI will be joining Google in Mountain View as a Senior Software Engineer, a little before Thanksgiving! And I more than tripled my yearly comp. WHOA!\n\nIn this sub, I have been a long-time lurker, and am grateful for many insightful comments. I wanted to create a short account of how my job search went, in the hopes that it may help someone.\n\n(Throwaway because I’m a moderator of a couple of subs in a completely orthogonal domain (pornography) and I don’t want this post to affect that image. Yes, porn. Now get over it and read this one, which is no less exciting!)\n\n**My Profile:**\n\nLocation: Texas\n\nDegree: Bachelors in Electronics Engineering from a top 100 college in US. Never done Algorithms/DS in college.\n\nWork: Software (I got into programming when in college and then a friend of mine hired me to do a little project for her. It rolled from there)\n\nExperience: coming up to 11 years, mostly full-stack work in Python and Java. I'm old.\n\nCurrent workplace: A small company you have never heard of\n\nTotal Compensation: $100k approx. (Yes, that is sufficient to live in Texas in your own house!)\n\nGoal: Get into one of the top tier companies as a software engineer. I was okay to move to Bay Area to get that brand I never had on the resume. Not sure why I wanted a brand; I just wanted it.\n\nJob Search started: November 2018. I thought I will prepare during the few holiday weeks and apply when the new year starts. Boy was I wrong.\n\n**First attempt**\n\nPractice in Nov and Dec 2018: About 50 problems on Leetcode, mostly easy, some medium. Some mock interviews with friends.\n\ncompanies interviewed at in Jan 2019: Apple, Amazon, eBay, Atlassian, Walmart Labs, Microsoft (I got all interviews via friends).\n\nI failed ALL of them. Like ALL. Every one of them. Some on phone, some later. Walmart Labs, Atlassian were the two where I went onsite and failed.\n\nThere is probably nothing more depressing to realize that you’ve spent 9 years and are still not good enough for a tier-1 company. I was that guy.\n\nI was about to give up, when my girlfriend encouraged me to prepare even more and try again. I thought she was being ridiculous - who prepares for interviews at all? But after a few months of her nudging me, a lot o beers, porn and frustration, I figured I should at least try once again.\n\n**Second attempt**\n\nPractice from April 2019 through August 2019: Nearly 250 carefully curated problems in Algos and Systems Design, done in a proper way with repetitions etc. I also found and paid for a coaching class to help me keep pace and support me.\n\nCompanies interviewed at (approximately in order) in July and August 2019:\n\n&amp;#x200B;\n\n* Microsoft (a different org from last time). ==&gt; OFFER! Didn’t take it because it was lower than other offers\n* Amazon Alexa team (they don’t have a moratorium) ==&gt; Didn’t make it again. The phone screen had a question too specific in a domain I have never worked in (embedded software). I thought Alexa was more of a distributed system behind the scene but looks like that part is more or less an application on top of AWS. Interesting parts are in Hardware and ML.\n* LinkedIn ==&gt; Senior Engineer OFFER! They are separate from Microsoft even today. This was a harder interview than I had expected. I got a DP problem, a Graph problem, a Tree problem, and two Systems Design questions.\n* Facebook ==&gt; L5 offer! I had told them that I have an LI offer, so they moved fast. One of the hardest interviews I had. One of the interviewers asked me 3 coding questions in one interview! THREE! Questions weren’t hard, but they expected me to code fast. I feel that speed was very unrealistic to expect, but hey it’s an interview - what can you say? They also asked Systems Design and Behavioral questions. Trees and Graphs were popular here too.\n* Google ==&gt; L5 offer! I started this one before Facebook, but the offer came thru only later. Google is painfully slow. They took what felt like forever, in scheduling the interview, getting to the HC, in team matching, compensation and then closing. Got TWO DP questions. TWO!\n\nNew compensation: $310k total. 165k base, 25k (15%) yearly bonus and rest in equity. 5k sign-on bonus (after negotiation), which I’m not counting. FB and LinkedIn came close, but I really wanted Google.\n\n**Advice for fellow seekers**\n\n&amp;#x200B;\n\n1. Don’t hate the process. It’s not in your hands to change it and often not in your interviewers’ hands either. Embrace it. If you want to change it, then get inside the system first and then change it. Wish me luck.\n2. Practice the right set of problems. Don’t just blindly grind Leetcode. It will take you forever, even if you can keep motivation.\n3. Work on your communication skills. I thought I communicated well, but only when I was forced to work on it with the coach, that I realized mine was nowhere near acceptable quality.\n4. Repeat the problems you’ve done again. Yes, repeat. Just write code again. There is some sort of magic there, which improves your retention and recall of other newer problems too.\n5. Know that getting and setting up interviews is as much work as actually appearing for them. I mostly got them through friends and connections I found on LinkedIn. Also, there is just no good way to take time off of work and not raise suspicions. In my case, I had to travel which made it worse. I tried to bundle as many interviews as I could, including phone-screens. Though one advantage of being in Texas was the timezone difference. It’s lunch time when the day is starting on west coast, so Phone screens were slightly easier to schedule.\n6. You WILL feel like giving up. A lot of times. Don’t. Just don’t. I had a group of (remote) people in the coaching class which helped me keep motivation. Find your friends. Or your enemies. Whatever floats your boat to get you off your butt to get back and work.\n7. Do mock interviews with people who know how to give feedback. Find whatever means necessary to find such people. Don’t just do them with other fellow seekers.\n8. Not all roles at top tier companies are created equal. I wanted to crack into the coveted SE role which is usually the highest paid and I could, but it was hard and took me a while. Given that only brand was my goal, I could have just considered other discounted roles at same companies e.g. frontend engineering, solutions engineering, support engineering, project management etc. Pay is going to be less than SE in these roles, but they are a bit easier to get in.\n\n**Tl;dr:** Practice pays. Start early. Keep on going. I realize that preparing to get into top tier companies is the single most impactful thing I have done for my future. Except porn, of course ;-)",
      "subreddit": "cscareerquestions",
      "score": 227,
      "url": "https://reddit.com/r/cscareerquestions/comments/dg31pc/an_account_of_a_successful_job_search_for_an/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 129
        },
        {
          "body": "How did you get past the flaky recruiters in Microsoft? Was it blind luck? Some say they liked their recruiters and some say they were horrible in keeping in touch. Some report a good experience and some report a really terrible one. A company this big needs to \"smooth out\" the quality some more. \n\nMS tends to use outsourced suppliers for recruiting, but in my experience they are the complete opposite of the interviewing experience. That is, MS's interviews are great but their recruiters are so spotty and lacking good communication skills. None of them ever freaking reply at my emails or phone calls.\n\nEven if you're already set up for interviews they tend to suck (the recruiters, not the interviewers). I knew someone interviewing at MS and was supposed to meet with the recruiter at 7:30, so he can go over things that are gonna happen with him on that day. He arrived at the recruitment building at 7:15, and the recruiter didn't even show up until 8:40. After talking to him for a short time, the recruiter said that he had the interview at 9 at the other side of campus.\n\nI don't know why Microsoft doesn't use more internal staff for job recruiting like the other big bois. Their chop shop recruiters with the \"v-\" emails are too inconsistent in quality. Gotta smooth that shit out, man. The bad ones really give MS a bad look.",
          "score": 13
        },
        {
          "body": "&gt;Nearly 250 carefully curated problems in Algos and Systems Design, done in a proper way with repetitions etc.\n\nwhere did you get the problems from? and you just repeated them to make sure you fully understood them? anything else?\n\n&gt;One of the interviewers asked me 3 coding questions in one interview! THREE! Questions weren’t hard, but they expected me to code fast. I feel that speed was very unrealistic to expect\n\n3 questions in a 45(?)min interview is insane, were they all medium difficulty then? you basically need to have seen the problems beforehand, how else are you going to solve each one in 10-15mins each lol",
          "score": 25
        },
        {
          "body": "&gt;companies interviewed at in Jan 2019: Apple, Amazon, eBay, Atlassian, Walmart Labs, Microsoft **(I got all interviews via friends).** \n\nKey point",
          "score": 22
        },
        {
          "body": "Man, FUCK that.",
          "score": 32
        },
        {
          "body": "What coaching class did you sign up for if you don’t mind me asking?",
          "score": 20
        },
        {
          "body": "Wow, this process is so incredibly broken. COACHING for something that you've been doing for almost 11 years?",
          "score": 37
        },
        {
          "body": "[deleted]",
          "score": 7
        }
      ]
    },
    {
      "title": "Walmart interview ",
      "body": "I have a interview at a Walmart coming up, any advice on what to wear to it?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1e1qzx5/walmart_interview/",
      "comments": [
        {
          "body": "You just look clean and nice. You don’t have to dress up or wear a suit. My younger relative is an overnight stocker at Walmart. Jeans and a tshirt, they give you the blue vest to wear.",
          "score": 2
        },
        {
          "body": "shorts and crocs, smelling of alchohol!",
          "score": 1
        }
      ]
    },
    {
      "title": "over the past year I filled out 1,541 job applications on indeed and only 11 places viewed my application and I got 2 calls for an interview. what am I doing wrong?",
      "body": "I keep applying and no one even looks at my application, Walmart or McDonald's even look at my application and they're supposed to hire anyone with a pulse. The only places I got an interview at was harbor freight and a box making factory.",
      "subreddit": "jobs",
      "score": 559,
      "url": "https://reddit.com/r/jobs/comments/10g0mml/over_the_past_year_i_filled_out_1541_job/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Probably your resume with an application/call back rate that low. \n\nr/resumes has some good resources for building out a resume.\n\nIf there's an option to apply through the company website instead of indeed, go with that.",
          "score": 213
        },
        {
          "body": "I just got a tip this morning.  Use the [Indeed.com](https://Indeed.com) résumé for Indeed searches, and check your Indeed message box every day.  Then use your other résumé to apply at that company's website.\n\nAlter your résumé to fit the job you are applying for.  You won't be considered if you are overqualified for it.",
          "score": 284
        },
        {
          "body": "Only fill out apps for jobs that have been up for less than 24 hours. Statistically they’ll be choosing their candidates from the first 10% that they receive. \n\nI go one step further and check off “less than 10 applicants”. Don’t use easy apply on LinkedIn, sometimes it’s just your zip code auto populated or something. But do NOT fill out applications. If it can’t auto populate, don’t even bother.\n\n\n\nI only apply to jobs that pay more than I make currently, but never those jobs that say “$50,000-250,000” - those are commission jobs.\n\nApply to literally everything that’s in your commute for the money you want. As long as the application takes less than five minutes. \n\nStop counting! Think of it like Tinder. You’re both swiping and if you shoot your shot and they don’t respond, whatever. If they ghost, whatever, you’ll be ghosting too. Unless you have an email from them, don’t think about it. Check your email.",
          "score": 89
        },
        {
          "body": "It’s definitely a problem with your CV. Let me know if you need any help with it",
          "score": 88
        },
        {
          "body": "I would not use Indeed for hourly roles at restaurants\n\nIs go to a place like JobGet for those roles, it's a job search app built for primarily hourly jobs so companies can make quick hires",
          "score": 65
        }
      ]
    },
    {
      "title": "Walmart Global Technology or Capital One Offer?",
      "body": "Walmart (Sunnyvale, CA) \\[SDE III\\] (Base + RSUs + Performance Bonus + Sign-on + ASPP + 401k)\n\nY0: $230,853.33\n\nY1: $249,920.00\n\nY2: $249,920.00\n\nCapital One (Plano, TX) \\[Senior\\] (Base+ Performance Bonus + Sign-on + ASPP + 401k)\n\nY0: $189,612.50 - $199,112.50\n\nY1: $179,612.50 - $189,112.50\n\nY2: $179,612.50 - $189,112.50\n\nBackground:\n\n1. I planned an international vacation for April. Walmart approved the time off as PTO (unlimited PTO), while Capital One requires me to start after the vacation (Walmart has an earlier start date).\n2. I secured a room for $1,000 in California (a 35-minute commute without traffic, 1 hour with traffic), while my living situation in Dallas remains uncertain.\n3. I have upcoming on-site interviews with Meta, Amazon, Google, LinkedIn, and others in late March and April. However, I need to respond to Walmart and Capital One this week.\n\nWhich offer should I accept? If I accept an offer now but later receive a better one, reneging is an option but could burn bridges. I can’t extend the acceptance deadline any further.",
      "subreddit": "cscareerquestions",
      "score": 21,
      "url": "https://reddit.com/r/cscareerquestions/comments/1j8jh72/walmart_global_technology_or_capital_one_offer/",
      "comments": [
        {
          "body": "The Walmart offer is a no brainer, at least for me.",
          "score": 86
        },
        {
          "body": "take the walmart salary and continue your on-sites. renege after you get one of those offers, where you can leverage the salary you already secured with walmart.",
          "score": 54
        },
        {
          "body": "Go Walmart. They punch far above their weight on the tech side. The Bay Area is higher cost of living but much better for career advancement, activities outside work and future opportunities. \n\nCapital One is a PIP factory to rival Amazon nowadays but without the Amazon compensation and prestige to make up for it. ",
          "score": 26
        },
        {
          "body": "Please do yourself a favor and stay away from the hellhole that is Capital One",
          "score": 24
        },
        {
          "body": "Walmart Global actually builds cool things. Keep your opinion about the store fleet itself out the door. The tech outfit there actually innovates.",
          "score": 16
        },
        {
          "body": "I have experience at both companies actually. Both aren’t too great for their own reasons. Walmart doesn’t have the best wlb. Not the worst but not the best. Capital one is a straight but pip factory where you’re potentially on the chopping block every 6 months. Personally I’d go with Walmart but keep looking for better options",
          "score": 6
        },
        {
          "body": "I'd do the Walmart one assuming that all the on site interviews are all CA based. That way the CA room could be best utilized.\n\nBoth jobs would be fine for either living situation assuming you don't have a family or anything like that.",
          "score": 11
        }
      ]
    },
    {
      "title": "What's the worst case scenario for a failed cs major?",
      "body": "Best case scenario, as everyone knows, is getting a zillion hundred thousand dollar full-time offer at FAANG after doing 6 internships, acing 10 rounds of interviews, and doing a million leetcode hards and system design practice. Living in San Francisco or Manhattan or somewhere, and then buying some big mansion in New Jersey or somewhere idfk. Then you marry a beautiful woman and have 2.5 kids and a golden retriever or something.\n\nBut the worst case scenario, which is what I unfortunately seem to be experiencing right now as a middle-class zoomer about to commence his senior year (and with 18 credits as a commuter student no less thanks to parental idiocy which is another story), is that you basically apply to 800 internships over 2 years, get like 5 interviews, and then you receive 0 offers at all. (Or if you're needy, some unpaid internship that's worth nothing.) So you're left with a literal bloodbath for a full-time job market that you're basically forced to dive into headfirst without any weapons or armor. You're basically going to have to prove you're better than over 1000 other people to a bunch of HR people and managers. It's a fucking humiliation show.\n\nHere's how I think my life is going to play out, barring any miracles:\n\n- I apply to like over 1000 full time jobs between last July and around 6 months after I graduate, both SWE and SWE adjacent. I'll get less than 10 responses that are anything better than an autorejection, but none will result in an offer.\n\n- I try to upskill, with projects and open source etc., but nothing I do improves my chances, as there will always be some other person (including MANY laid off workers) better than me.\n\n- I might be forced to work a fucking McJob with 0 transferable skills anytime between today and 6 months after I graduate.\n\n- I network a bunch but it doesn't help.\n\n- I'm 21 now, and I end up living in my conservative mom's bedroom, shuttling to and from Burger King, Walmart, or maybe Best Buy if I'm fortunate. I probably won't be unemployed, but what I do definitely won't be enough to allow me to live on my own anywhere not excessively remote or violent.\n\n- I keep getting told by a bunch of people on the internet to join the military, and I keep having to explain to them that autistic people aren't allowed to enlist.\n\n- My degree eventually expires due to me not using it. Maybe if I still care, I do some IT certs to get a basic IT help desk job that pays $15 per hour, that I probably could've gotten without (my parents) wasting money on college at all.\n\n- I look up my Chinese friends on Instagram to see how they're doing. Some are high-earners. Some are engaged, or even married. But almost all are making more than me, and almost none are living at home with mom and flipping burgers.\n\n- I struggle with whether to support my parents and how much because of how conservative and intolerant they've been (worst case of this was literally slapping me). Maybe I piss them off so much they slowly cut me off, who knows.\n\n- And then, my parents retire or die. Which sadly happens to everyone someday.\n\n- My suburban house is foreclosed or something.\n\n- I'm forced to live on the street and collect food stamps.\n\n- I do a bunch of political things, like voting or protesting, but none of that magically improves my situation.\n\n- I die in my 50s due to some ailment that was worse than it could've been due to our country's screwed up Healthcare system.\n\nI know I'm being a bit of a doomer so please talk some sense into me. Everything just seems on the downswing, and every year literally feels like it's going to be worse than the last (which is something I've literally been noticing since 2014 as a fifth grader).",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1n4c95r/whats_the_worst_case_scenario_for_a_failed_cs/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 10
        },
        {
          "body": "You’re more than a bit of a doomer. And there’s a ton to unpack here. Social media isn’t real. A lot of people put how they want to be viewed there. \n\nI also don’t understand how you can be so pessimistic but keep putting yourself into more imagined scenarios. Sounds like you’re worried you won’t get a job, but then your house is getting foreclosed. Is this your house? Your parents’ house? \n\nDo you have hobbies? How are your grades? You need to get outside and live some life. It also sounds like you need some therapy, but I’m hoping you would not find a therapist to let you indulge in all these doom scenarios. \n\nIt’s OK to worry about the future, but are you doing anything about it? ",
          "score": 7
        },
        {
          "body": "Worst case, you could become a quadriplegic and everyone you know punches you in the face when they see you.",
          "score": 5
        },
        {
          "body": "Heh. Worst case is you get some horrible disease like ALS or you get sucked into a cult or you get life in prison for some crime you didn’t do or something but what are the chances of any of that happening, really?\n\nMore likely is eventually you realize there’s more to the economy than just FAANG and burger joints, find some sort of normal desk job, meet someone average and live an average-ish life",
          "score": 5
        },
        {
          "body": "Maybe they develop some sort of self-replicating nano bot that turns the planet into a sludge, ending all life?",
          "score": 2
        },
        {
          "body": "a) your life is not going to play out like that unless you want it to, this isn't requiem for a dream\n\nb) you have not actually done any of those bullet points yet, at least get through the first 4 or so before thinking about the rest\n\nc) your 50s are a long-ass time away. things have changed a lot from 1995-2025 and they will change a lot from 2025-2055. which means everyone's prediction about the future is flimsy, including yours",
          "score": 2
        },
        {
          "body": "I suggest trade school in commercial HVAC and refrigeration or electrical systems. Maybe robotics installation and service.",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "Nerd, dem loser taking this too seriously.",
          "score": 1
        }
      ]
    },
    {
      "title": "To take or not to take the unpaid internship?",
      "body": "Can't believe I'm asking this question. I accidentally applied to an unpaid internship and didn't realize till mid-interview and they gave me an offer. Also from the email it sounds like it starts in two days? Or at least training does? Normally I wouldn't consider an unpaid internship, especially since I kinda need money and planned to work part time this semester (I applied to TA roles, but worst case I'll just do like Walmart or something), but since I haven't gotten any other internship offers maybe I should consider it? Though I would still work part time on top of that.\n\nAbout the internship, it's remote and says I need to work a minimum of 10 hours a week, so it's something I could do and maybe treat as a side project. And I guess I could quit whenever as well. It's an iOS and Android app development role, and I do want to go into iOS development. It's also 9 months long (not sure I actually want to do an unpaid internship for that long tho) and the company is A Dollar Class which is a part of BBCMGTai LLC.\n\nAny thoughts? Should I maybe take it for now and drop it when/if I land another internship?\n\nEdit: Also here's my current resume if it helps [https://www.dropbox.com/scl/fi/jdd81mlcobzu94dxvan23/resume-anonymized.pdf?rlkey=tvyrrb1ynlkxji07x4etakqxj&amp;st=c4svayvn&amp;dl=0](https://www.dropbox.com/scl/fi/jdd81mlcobzu94dxvan23/resume-anonymized.pdf?rlkey=tvyrrb1ynlkxji07x4etakqxj&amp;st=c4svayvn&amp;dl=0)",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1mud0f0/to_take_or_not_to_take_the_unpaid_internship/",
      "comments": [
        {
          "body": "Its remote just take work as much or as little as you want and add it to the resume. Literally 0 downside especially if you got nothing else lined up.",
          "score": 7
        },
        {
          "body": "I would not even consider this. \n\nYou look like you already have work experience. With an unpaid internship you're effectively donating your labor. What do you imagine you're going to get out of this?\n\nIf you think they're going to deliver valuable training to you, imvho you need them to extremely clear and specific about what training you're going to get out of it.\n\nOtherwise this is a colossal waste of your time at best, and a potentially weird and predatory situation at worst. I can't find anything meaningful about this company online which makes me pretty suspicious.\n\nSomething smells off here. CS is a field where it is *very* common to see paid internships, and imvho basically unheard of to see unpaid ones. That's not really a thing.",
          "score": 1
        }
      ]
    },
    {
      "title": "2025 Front End Job Search Experience -&gt; Offer",
      "body": "**Here's my job and interview experience in 2025. 14yoe.** To not bloat the main thread, some topics will be in comments below.\n\nI was working at a fintech company and they did huge layoffs after acquiring 2 companies, nearly every engineer from our division was cut. it frikin sucks but it is what it is.\n\n350 applications -&gt;  18 recruiter calls -&gt; 12 tech screens -&gt; 3 final rounds -&gt; 1 offer;\n\ni applied to practically every single front end position in existence.\n\nSankey diagram here [https://i.imgur.com/pwHagNt.png](https://i.imgur.com/pwHagNt.png)\n\nTime elapsed: 3 months.\n\nI landed an offer with Marvell Semiconductor as Staff UI Architect!\n\nThis position is unique- hybrid of Front End Engineering + UI/UX Design. I was tested on designing UI's for semiconductor (switches, data center etc) data visualization, as well as javascript fundamentals. I initially asked, wouldn't you want a graphic designer since bulk of the work is UI/UX design? but they said no, they could never understand the technicals of FE dev nor EE. they wanted someone who knew UI/UX design, FE, AND EE. So i was a unique fit for the role.\n\n**Stats:**\n\n\\-TC: Years 1-4: 248k -&gt; 276k -&gt; 303k -&gt; 330k (Includes estimate of guaranteed refreshers)\n\n\\-High level role with Data Center Network UI design + some front end dev\n\n\\-4 days a week, 30mi commute 10AM-2:30PM, avoids traffic, 45mins. On call for overseas folks 8-10PM. + Occasional travel overseas to india.\n\n\\-highly rated on glassdoor, low layoffs compared to peers\n\n\\-incredibly smart EE folks; I studied EE in college but pivoted to FE dev and now this is almost going back to my roots.\n\nInterview:\n\n\\-I didn't even expect a call back, the position seemed out of my league, but behold, i did. Told recruiter my background in FE dev, not a pro UIUX designer but i know the concepts and i work with them. Said he'll get back to me and the next week they want me for a GIGA HARDCORE FINAL ROUND with 6 directors/vps/staff engineers. \n\n6 1:1's PLUS a presentation to all 6.\n\nOh my god I’ve never got grilled on UX design this hard in my life. \n\nOne of the directors (PhD from MIT) asked me: Say aliens are invading earth. You need to design a control panel for a missile defense system that is user friendly to the operators. Button? Console; command line etc? What’s the design like, how about communication? How do u communicate to others, alarm system? Should there be a mute button? If the operator is in a hurry and needs split second decision how do u ensure the cleanest UI design? Security?\n\nAnother director (ex-AWS) asked: Say u have a data center with servers and switches that transmit data, but data can be failed / low quality / bad transmission, design a gui for this.\n\nVP asked me: Say there’s a bar graph. X axis is quality and Y is number of items. Title of graph is “amount of items of various qualities over the past 24 hours”. Now, we don’t like this presentation and instead want the X axis to be time. But we still want to show the data for quality/# , so we’re adding another data point. How do we display the graph now?\n\nStaff FE dev grilled me on js fundamentals such as closures and promises. I fumbled on a few questions but managed to get most, explaining thought process.\n\nCrazy interviews, hiring manager told me as a closing thought \"This position is challenging to fill\" and i had that thought RACING in my head 24/7. what could it mean? Did he like me and i'm a contender? Or did it mean \"this is a tough role to pass\"; i asked chatGPT and it said \"THIS IS A HUGE GREEN SIGNAL\" i was like lolwut really? ok then!\n\nWeek later recruiter emails me \"I wanted to connect with you regarding feedback and next steps\" im like NEXT STEPS?? GG? lets fkin goooooooooo. and boom offer.\n\nCraziest part is i couldn't prepare for these UI questions, came leftfield, i just winged it and somehow i had enough intuition to pass them. Recruiter told me many candidates were able to pass coding, but struggled/froze on the Design Mission Control System design question. I guess i have some semblance of talent in UI design?\n\nUpdate 12/18/25 - been 2 weeks, i've gotten the repo of the data center network ui prototype vibe coded by offshore folks and i've been tasked to improve it. So far it's all dev work.\n\n\\----\n\nSome FE coding questions I had this year:\n\n**Discord -** tech screen - failed\n\nCreate a UI for a formula parser that has fields a, b, c. You can type numbers in the field and the output of the fields would be those numbers, but you can also type letters in the fields and they would add up the numbers stored. For example in field A if you type 3 the output of field A is 3. \n\nThen if you type A in field B the output of B is 3. In field C if you type in AB you get 6 (3+3) the reqs were so ambiguous so it took me awhile to understand the problem. NO AI, write on own IDE with screenshare.\n\n**Crunchyroll** \\- tech screen - passed\n\nCreate a react app that renders a collection of anime titles and its image, from json data;\n\nfor(var i=0; i&lt;5; i++) setTimeOut console.log(i) \"trick\" question whats the output and why?\n\n**Crunchyroll -** final coding round - failed\n\nPolyfill the \"getElementsByClassName\" function. Aced system design though, the interviewer was impressed.\n\n**Walmart -** tech screen - ghosted\n\nWrite a \"deepclone\" function that copies an object with variable depth and contains anything, including other objects, arrays etc.\n\n**Oracle -** tech screen - failed (passed question but they chose another candidate with more backend exp)\n\nCreate a react app that displays a credit card, with buttons to switch which cc to view, cc data comes from json. Clicking on cc will replace the text with X's- X's correspond to how many words there are, so FIRST LASTNAME will be XXXX XXXX.\n\n**Anduril -** tech screen - failed \n\nYou know in your IDE the directory structure, with folders and files? Given a pic/mock of that, Build it.\n\n**Amazon -** https://www.reddit.com/r/cscareerquestions/comments/1iudddy/rainforest_loop_experience_frontend_l5_12_yoe/\n\n\\---\n\nClosing thought: It's rough out there for Front End devs. There are fewer positions than before, but way more AI/ML positions. However, FE dev compensation is still competitive, u just needa know so much.\n\nI'm not incredibly smart or talented, most other engineers are more brilliant than I. The biggest source of my success is the resilience to failure. The amount of rejections and failures is so high  but every time, i write down what went wrong, study it, and gain knowledge, so over time every failure builds up to more and more knowledge.\n\n*^(Note: I didn't run any of this thru AI.)*",
      "subreddit": "cscareerquestions",
      "score": 170,
      "url": "https://reddit.com/r/cscareerquestions/comments/1p92cy3/2025_front_end_job_search_experience_offer/",
      "comments": [
        {
          "body": "This is one of the most helpful posts I’ve seen on here in a while.",
          "score": 35
        },
        {
          "body": "congrats on beating the slot machine anyway 350 apps for 1 offer lines up with what im seeing too mid level here and even with solid experience and decent portfolio i’m getting like 1 actual loop per 50 submissions it’s just a numbers grind now",
          "score": 35
        },
        {
          "body": "Staff level FE positions in 2025 have been asking:\n\n\\-promise chaining\n\n\\-web vitals / performance (TTFP, LCP etc)\n\n\\-browser render life cycle\n\n\\-react render life cycle (virtual dom\n\n\\-react data persistence\n\n\\-Micro front end architecture and distributed systems\n\n\\-scaling (eg: how to deal with a chatroom where a massive amount of chat was sent at once. UI considerations? Throttle?)\n\nReduced frequency but still know these:\n\n\\-leetcode / json manipulation / tree traversal\n\n\\-event loop\n\nAlso know for mid/sr level:\n\n\\-closures\n\n\\-CI/CD\n\n\\-system and API design\n\n\\-ui/ux design, accessibility, SEO",
          "score": 22
        },
        {
          "body": "Regarding layoffs, i cannot believe how much being \"cheap\" survives layoffs than being \"good\". the 2 that survived was \n\n1- a tech lead doing staff level work having always been denied promos (senior pay)\n\n2- a low paid junior doing mid/sr level work.\n\nIt can become dangerous when people successfully negotiate a high salary, do at your own risk.",
          "score": 24
        },
        {
          "body": "Generally speaking, applying to jobs with recently posted is the best. However this partcular one was so niche, it was posted back in March and they couldn't find anyone. When I applied and interviewed there was no competition, it was just a pass/fail and I passed!\n\nI know yall thinking \"oh great, the only way for front end to get a job is to have 14yoe, know design AND know EE, we're cooked\" and honestly, you're not wrong. job market is just insane rn, but there just may be a job that's a perfect fit for your skillset. good luck out there.",
          "score": 10
        },
        {
          "body": "Congrats and agreed this basically says companies can wait for the perfect unicorn to show up with all the layoffs",
          "score": 10
        },
        {
          "body": "Even for 14 YoE this seems like quite a lot to ask of a candidate",
          "score": 7
        },
        {
          "body": "Most craziest/strangest/coolest position recruiter contacted me for?\n\nErebor, a startup cofounded by Palmer luckey (ceo of anduril), backed by peter thiel (palantir).\n\nThe Founding FE Engineer job description literally said 996 schedule, 6 days a week in office. Base salary 400k + 1.5M stock comp/year.\n\nThe post-final round interview they have you come on site and WORK 2 12-hr days and they judge you based on how you work.",
          "score": 6
        }
      ]
    },
    {
      "title": "Anyone here work @WalmartLabs?Any interviewing tips?",
      "body": "Well folks,\n\nI just got called on for an onsite interview(Full time engineer) there. Any tips on the interview, work culture?Things to look out for .. or even generic tips are appreciated!\n",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/2fkc3o/anyone_here_work_walmartlabsany_interviewing_tips/",
      "comments": [
        {
          "body": "Have you scheduled an interview yet? The reason I ask is because I was also invited for an onsite.",
          "score": 1
        },
        {
          "body": "The one across the street from Youtube in San Bruno?",
          "score": 1
        },
        {
          "body": "Well, its Walmart.  I know it's a job, but seriously...it's probably not your best choice.  Walmart tried to lure me with an enticing 45k salary not that long ago.",
          "score": 0
        }
      ]
    },
    {
      "title": "Can't land a IT, software, cyber job- At all",
      "body": "Hey guys,\n\nI have a 4 year degree, certs like the security+ among others, 3 years of work experience, I've applied to over 1k jobs, I've had roughly 50 interviews, 1 job offer (super underpaid, I rejected). I feel stuck.\n\nI am legit to the point of crying my eyes out when applying. I apply to these jobs, put it in my excel spreadsheet to keep track and wait, despite of me reaching back out or anything, a auto rejection comes in a week or a month later.\n\n**I thought it was a resume issue at first,** I had my software engineering friends take a look over my resume, my mentor, and a few others in the tech space, I fixed and corrected a few things, it looks pretty polish- went to other sub forums for resume help and went on YT as well.\n\n**I thought it was my interviewing skills,** I went over time to time, watched countless interview prep, I ace the technical part, I've had mock interviews with people irl, and I'm fine.\n\nI feel like I'm in a countless loop, I've applied to so many jobs within this tech space, and no response. I am forced to pickup a team lead role at Walmart to live. I feel like everything I do is not working, and I am not alone, I see so many others experiencing this as well, are we doomed lol\n\nI'm applying to a wide section of jobs, IT Tech (Desktop &amp; Network), IT Helpdesk, IT Analyst, Entry level software roles, SOC level 1, mainly in my area (DOD hotspot, south of the USA)\n\nDo you guys have any advise, suggestions, insight?\n\nEdit: Just to put down, the IT job the was rejected was $15 an hour or 31K a year (IT Helpdesk), I know it was a mistake to turn it down, should have attempted to counter offer it but still\n\nEdit: I'm from the USA, my IT experience has been from the USA, degree is within the USA. 2 years working with a IT MSP, and 1 year working with the US federal government in their IT dept (contract role with SAIC) ",
      "subreddit": "cscareerquestions",
      "score": 243,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ldwr42/cant_land_a_it_software_cyber_job_at_all/",
      "comments": [
        {
          "body": "The job market is absolutely bonkers awful right now. Just keep applying, and hopefully get lucky. Networking (the people kind) to try to find someone who can help you get a role is also beneficial, but I think we're all in the same sinking boat ):",
          "score": 157
        },
        {
          "body": "I know this is not what you want to hear but someone should say it. You realize it was a mistake to turn down the offer you had right? Even though it was a lowball offer? Don't make that mistake again",
          "score": 168
        },
        {
          "body": "If you’ve had 50 interviews and only 1 job offer but you rejected it, it seems like you need to work on your interviewing skills.",
          "score": 76
        },
        {
          "body": "[deleted]",
          "score": 32
        },
        {
          "body": "Not trying to pile on, but you really should have taken the super underpaid job",
          "score": 36
        }
      ]
    },
    {
      "title": "Why would a company add such stupid requirements to a job after the fact?",
      "body": "I don't really understand why, but when I was with a consulting firm, they had Walmart as a client, and given my ReactJS experience, they set me up an interview for a job that was with React.  Since previously, I had gotten rejected from other clients for not having experience with something labeled, \"a willingness to learn\", I asked if he was sure this was 100% React like he said and they weren't going to reject me based on not knowing something else, and he confirmed it to me. \n\nI got all the questions right in the first interview, the 2nd round I had completed their project and they sent them the screen shots, and then the hiring manager at Walmart said they needed someone who knows Python Dash which wasn't in the description.  I didn't even know what that was at the time, and I found only one site on the whole web that discusses it, and found it is basically a Python library that creates React class based components for Python developers who don't know React.  \n\nI went back to my first contact and reminded them that I was told it was 100% React and they wouldn't be expecting me to know any other tools not related to React on the front end.  He told me that's what the person at Walmart told him, but then they changed their minds after they recommended me for hire.  \n\nWhat I don't understand is why would they need someone with experience with a tool for people who don't know React when I already knew React? \n\nEvery client interview after that was some BS waste of time as they nit picked any reason to reject me one even saying it didn't look like I used React recently enough according to my resume even though I met the required experience.  ",
      "subreddit": "cscareerquestions",
      "score": 46,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ja7vmo/why_would_a_company_add_such_stupid_requirements/",
      "comments": [
        {
          "body": "[removed]",
          "score": 37
        },
        {
          "body": "I could see myself rejecting you for the attitude, and using this as an excuse for the recruiter.  Wouldn't be surprised if that's what happened.",
          "score": 65
        },
        {
          "body": "I looked up python dash and you failed the interview because you misunderstood what it's good for.\n\nThey want someone who uses that framework to do data viz, not because they need a react expert.\n\nThe idea that any position uses only one technology is naive. Basically every usage of react needs a backend.\n\nThe recruiter probably only knew about the contents of your first interview. I doubt they changed the requirements.",
          "score": 39
        },
        {
          "body": "You sound very immature, but it's call miscommunication, they are using python to generate react, somehow it got to your guy as react, it happens way to often honestly.",
          "score": 50
        },
        {
          "body": "its not realistic for a job to be 100% only react it doesnt even make sense",
          "score": 7
        },
        {
          "body": "Sounds to be like they rejected you because of your attitude",
          "score": 21
        },
        {
          "body": "Imagine being 8hr in the office with this guy lmao, the problem is pretty much here\n\n&gt;Since previously, I had gotten rejected from other clients for not having experience with something labeled, \"a willingness to learn\"\n\nAnd with that attitude, good luck finding job lol\n\nAlso, for anyone wondering, he's interviewing with a talent acquisition company, these companies will find jobs for you, the down side is you're not directly hire by the client",
          "score": 6
        },
        {
          "body": "Let it go and move on- you're going to have a lot of times when the recruiters or the companies don't have a clue. I got rejected because I \"didn't have windows Server experience\"- when every single one of our production systems ran on it (at the time), and other similar stories.",
          "score": 5
        }
      ]
    },
    {
      "title": "McDonald’s SWE hiring process?",
      "body": "Does anyone know what the McDonald’s SWE interview process is like? They seem to have some interesting work available but, I’m curious what the process is. Types of questions, etc.",
      "subreddit": "cscareerquestions",
      "score": 221,
      "url": "https://reddit.com/r/cscareerquestions/comments/wphtft/mcdonalds_swe_hiring_process/",
      "comments": [
        {
          "body": "Yes yes \"he he mcdonal\" -- reminder of our comment rules:\n\nhttps://www.reddit.com/r/cscareerquestions/wiki/posting_rules \n\n&gt; Please do not: troll, make a comment just to brag, or be a jerk.\n\n&gt; Please be thoughtful and professional when commenting. Ask yourself, What Would Turing Do?",
          "score": 1
        },
        {
          "body": "sounds fun to have a high paying SWE job at mcdonalds and when people ask what you do for a living you just say mcdonalds",
          "score": 786
        },
        {
          "body": "Probz managing their McDonald's app. Just give your self unlimited points and deals once your in fam.",
          "score": 119
        },
        {
          "body": "I did the interview process for their new grad program and it consisted of a behavioral interview (1 hour), and a 2-day long final interview stage (1st day just learning about McDonald's with other candidates in a huge Zoom call [4 hours], 2nd day more McDonalds culture learning for 1 1/2 hours + small group activity, 2 1-hour behavioral interviews, 1 technical interview with 3 questions [LC easy-med]). \n\nI see your an experienced dev but hope the info helps",
          "score": 197
        },
        {
          "body": "[removed]",
          "score": 334
        }
      ]
    },
    {
      "title": "What's going on with Walmart?",
      "body": "Hello fellow devs,\n\nWhen I was in a call with my skip many years ago he said noticed from the survey after 3 years a lot of developers at our company end up frustrated and not engaged. After which he laugh and a year later switch companies. Here I am today in the worst job market in recent events asking all the help I can get. It's been hard juggling a full time job and studying on the side because Walmart expects me to write Java code for interviews. I think EM is giving attitude because he knows I am looking for a new gig. Right I am committing and pushing through even though I know it's a bad time to look for a job. I'm focus on building a system rather than outcomes.\n\nAnyways, I finished my phone interview. I was given two leetcode problems but seen them before so each problem I finished in 10 minutes in Java. Interviewer than asked follow up and new requirements. The code is runnable so they past all of his inputs. The interviewer, funny enough, started to highlight my entire code. I suspect he wanted to run them in Leetcode.com. Completed them. It's been 6 days and nothing from recruiter. Stanger, as the time I've spoken to this recruiter, they've always display a sense of urgency and asking for each step I go as fast as possible. I've noticed Walmart is hiring like crazy with all their job posting online.\n\nAnyone knows how the interview pipeline works at Walmart? Are they just really busy right now? Not sure if I will join Walmart but could use their offer for more leverage.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1onrv9q/whats_going_on_with_walmart/",
      "comments": [
        {
          "body": "&gt;The interviewer, funny enough, started to highlight my entire code.\n\nHe likely was just copy-pasting it into his notes doc for the report write-up.",
          "score": 44
        },
        {
          "body": "The big boy move would probably be to send out an email and ask.",
          "score": 18
        },
        {
          "body": "Eh finishing a problem in 10 minutes isn’t necessarily a good thing. It means\nA. You’ve seen the problem before\nB. You didn’t explain your thought process and go over all edge cases slowly enough (it’s not enough to know how to do it, you have to act like you’re thinking of the solution on the spot)",
          "score": 14
        },
        {
          "body": "I highlight candidate code so that I can copy it and put it in my notes that I send to the hiring manager/committee.",
          "score": 7
        },
        {
          "body": "It’s an H1b shop despite their public messaging.  If you’re not from some specific caste you’re not getting hired.",
          "score": 2
        }
      ]
    },
    {
      "title": "Some Tips For New Grads and Job Search in General",
      "body": "Strategy for Applying and How to get More Responses:\n\n* Do apply to any and all big companies. This includes Big Tech (tech companies such as Google, Datadog, OpenAI, FAANG etc.) but also includes big non-tech companies (think Walmart, Target, Ford, Epic to a certain extent). However, be prepared to never get responses from these. The conversion rate of responses from these is a lot lower than other companies. This is due to both the amount of people applying, you applying later than other people (they may just only look at the first X number of applications), but also the amount of company leadership, direction, and planning changes that are typical with these big companies (these are expected). You may not get a response and that may mean nothing with your resume or applications. Which leads us to...\n* Apply to startups and / or small businesses. There are a lot of startups out there that may benefit from your specific experience or skills. Where do you find these though? ycombinator, workatastartup, builtinnyc, wellfound are good places to start. More than applying, here is where you might need to \"network\". Look at the founders, look at the people working there. Referrals here are a lot more helpful than in Big Tech companies, because things at smaller companies are a lot more personal and less automated. This is how I found my early-stage startup job. So you might want to look at founders / early employees; see if you have any connections on LinkedIn or went to the same school. See if you have any secondary connections. Reach out to people. Even if not, you can cold message on LinkedIn. You may not get a lot of responses. That's ok / expected. \n* Startups are less cyclical in their hiring, meaning they may hire at random times / year round / for the right person / after fundraises.\n\n  \nMy experiences:\n\n* Have gone through extensive job searches 3X. This helped a ton. Each cycle required 300-700 apps each. Got a random job in 1, an early stage startup the 2nd time, Big Tech the 3rd time.\n* Anecdotal evidence:  Applying with or without a cover letter does not seem to matter in my case, at least it didn't in my experience. The places I got interviews I didn't use a cover letter.\n* For startups, things are a lot more informal... even cold reached out to someone on LinkedIn (alum from my school) once to ask about their experience at their startup, and it turned into an interview lol (for which I got to the final round). They didn't even have a position open, but were willing to hire for the right engineer.\n* Have gotten Amazon, Datadog offers (and currently work at Datadog)",
      "subreddit": "cscareerquestions",
      "score": 17,
      "url": "https://reddit.com/r/cscareerquestions/comments/1qbb5z0/some_tips_for_new_grads_and_job_search_in_general/",
      "comments": [
        {
          "body": "Created a Discord where I share about this and a lot more, hoping people feel more supported and less lonely when applying, so people can ask each other (and me) questions so that I can help as much as possible (https://discord.gg/HJA4SwG9)",
          "score": 1
        }
      ]
    },
    {
      "title": "How much do internship applications open up spring semester compared to Fall?",
      "body": "So I'm a junior right now at a well known state school in the U.S. I am currently working my app dev internship that I've had since May so I have some experience in my belt. However I've been slacking on actually networking from being admittely lazy; I've only sent out 140 apps inconsistenly, attended career fair and a few club/company events where I didnt rly talk much, and sent out prob 10-15 cold emails throughout the semester. 1 interview, and that was for a company in the same industry as mine but much smaller (so I would've refused anyway)\n\nEspically since apperentally I might not get a summer return offer at the company I'm working for (long story, not for poor performance dw) I'm a bit worried about next year espically since many friends around have submitted around the same as me and have gotten multiple interviews. Definitely gonna try to prioritize at least an hour a day to jobs and networking next sem but I wanna know what my chances are looking like with bigger companies (Chervon, Samsung, JPMC, Walmart) and smaller companies/startsup alike. \n\nAlso would appericate any tips or 1-on-1 talks as well as resume reads from ppl w/ experience cuz I'm abit worried 😭😭",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1pjksof/how_much_do_internship_applications_open_up/",
      "comments": [
        {
          "body": "Big tech and finance orgs typically hire in the Fall. But a tonne of openings will show up across pretty much every organization big to small across the whole spring semester. Most people I know who don't get picked up by big tech end up getting internships mid to late spring.",
          "score": 3
        },
        {
          "body": "Big tech intern hiring happens in the fall semester.",
          "score": 1
        }
      ]
    },
    {
      "title": "What happens after Walmart's Karat round",
      "body": "Finished two Karat interviews for Walmart. I didn't do well but recruiter reached out couple of days later. Said they will push my profile to the hiring manager. Does anyone know what happens next? \n\nRecruiter was pushing hard that I should be ready this week to continue to interview so here we are... Figured Walmart is interviewing 100s of candidates so expect words to be wishy wash ( though, wish the recruiter was more honest so I can  align my busy schedule better).",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1o7zgxn/what_happens_after_walmarts_karat_round/",
      "comments": [
        {
          "body": "They match you out to individual teams, could be one, could be many. There is no standardization, so each team does its own thing. Expect the standard system design questions, behavioral, and maybe another leetcode session. You'll have to work at Bentonville or Sunnyvale office, may not have a choice on which one and most likely its gonna be Bentonville",
          "score": 1
        },
        {
          "body": "Honestly sounds like you're in a weird limbo spot. Walmart's process is pretty chaotic from what I've heard - they'll say you didn't do great but still push you forward because they need bodies.\n\nNext step is probably gonna be behavioral interviews with the actual team. Since the recruiter said be ready this week, I'd prep for those ASAP. If you're not confident with interviews, tools like Final Round AI's mock interview feature help a ton - I used it when I was nervous about behavioral questions.\n\nThe recruiter being vague is typical corporate BS though. They keep everyone on standby.",
          "score": -5
        }
      ]
    },
    {
      "title": "Walmart Karat?",
      "body": "Hey everyone. What’s the interview like for Walmart on the Karat platform? It seems like they outsourced a human interviewer to Karat? \nInterviewer told me it’s in Java. \n\nAny help would be great. I have a full time job and my manager knows I’m looking. He does get piss when I am “sick”. Any help would be appreciated!",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1npizbo/walmart_karat/",
      "comments": [
        {
          "body": "Study your DSA well and work extremely fast",
          "score": 1
        },
        {
          "body": "It doesn't matter what's on your resume, they just java for backend at Walmart",
          "score": 1
        }
      ]
    },
    {
      "title": "What type of positions do I apply to if I have &lt; 1 YR of FT experience?",
      "body": "I graduated in December 2024 and had a full time SWE job at Walmart Global Tech when I graduated. Unfortunately, I was laid off in May, because it was a mass layoff I was protected by WARN but that is coming to an end and I'm starting to get very stressed regarding finding a new position. I've only recieved 3 interviews / non-automatic OA's since, and mostly from positions I was referred to. \n\nMy resume is very heavily focussed on my Walmart experience, both my previous internship and full-time role. I enjoy coding but it is not some large passion of mine that I do in my free time, and most of my projects are either from University, which have very brief or no mentions in my resume. \n\nShould I still be building projects to put on my resume? Do companies really care much once you have real work experience? Am I hurting my chances by mostly applying to New Grad / &lt; 1 YOE positions, as it seems there are less of them than the Entry level 1-2 YOE positions, but I only really have a few months of FT experience. \n\nI feel like I am in an awkward spot between New Grad Level, where many positions don't even start until 2026 and state they are exclusively for 2025-2026 Graduates, and the 1-2 YOE entry level roles. ",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/1memf0k/what_type_of_positions_do_i_apply_to_if_i_have_1/",
      "comments": [
        {
          "body": "You’re not in an awkward spot you’re in a **very normal** one for post-layoff grads. With &lt;1 YOE, you can absolutely apply to both *new grad* and *entry-level* roles. Many companies aren’t strict about that “1-2 YOE” requirement it’s more about whether you’ve shipped code, collaborated with teams, and understand the SDLC, which your Walmart experience already covers.\n\nYou don’t need a passion project portfolio to get hired, but adding 1–2 small, relevant repos (e.g., a clone or tool using modern stacks) can make a difference if your resume lacks breadth. Focus on roles that mention early-career talent or don’t specify graduation years. Also, referrals have been working for you double down on that through cold LinkedIn outreach or alumni networks. If you're interested, [interviewhelp.io]() has solid system design prep and a community of folks in similar situations. Might help you stay sharp and feel less isolated during this stretch.",
          "score": 3
        },
        {
          "body": "Im in the same boat. 1.5 years of experience between 2 roles after layoffs at 2 different companies, 2024 grad.",
          "score": 1
        }
      ]
    },
    {
      "title": "Where to go from here? I’m at a loss for questions that nobody in my life has answers for. ",
      "body": "Hi there! I'm having trouble entering the CS field due to a few different problems (many caused by myself). and I'm not sure how I should tackle them. I can offer more info in comments if people ask.\n\nTLDR:2020 degree no experience or direction send help.\n\nFor those who don't care about how I ended up here feel free to skip this section. I'll be as brief as I can for the background life story. Graduated in 2017 with psych/soci degrees. I had Depression for my whole life until 26, which made my attempts to pursue that goal in life very weak. Pivoted and managed to get a CS degree in two years while clearing all of my debt working at Walmart and getting a tiny bit lucky on the bitcoin gamble. Graduated iiiiin.... 2020. Right as the pandemic hit. While I was still failing mentally I had managed to get interviews that all vanished in front of me, which was another blow that really pushed me far down. Finally decided to take meds, cleared the depression fog, realized my brain still wasn't working well, got screened for ADHD, and have beeen taking meds for that for almost a year now. I am now 29 and this past year has been the best year of my life. I've fixed so much, my weight, my health, confidence, mental. I'm able to do more than I've ever been able to every single day. My problem is that if I'm unsure of what to do it's hard to thrust myself into the problem. So I'd really appreciate any advice, and I will take it seriously.\n\nNow that more foundational issues are good habits and Im able to be more disciplined every day. I have the issue of trying to enter this field with a now going on 5 year old CS degree, no portfolio. I am open to every angle on how to make this work. If it's to drive to every nearby career fair with a binder full of resumes I'll do it.\n\nIf you just want the questions feel free to skip this info dump part. My work experience is retail, some tech related, mostly not. My degrees are bachelors in psych/soci/computer science. I believe I have good fundamentals of coding from my education, and my areas I’m comfortable with are web and mobile app development at a beginners level. I feel confident in my resume and have good people that have helped me significantly with it. The main issue obviously being experience (foot in the door problem).   I live in Connecticut. But I'm open to moving to anywhere that isn't a pure red state(basically any city within a red state is also fine with me), and of course remote/hybrid options. I'm not interested in being pressed about that just please understand for my life that's the only way it can work. If anyone wants more info let me know.\n\nFinally the questions. \nWhat’s the fastest way I can get to where I want to go. I have a unique situation where I can put a lot of time into this now to prepare for next year. Is it the portfolio angle? Do I go to a boot camp? Should I look to get a basic IT cert then job as a stepping stone while building a portfolio?\n\nIs web development still worth investing time into? AI is the craze these days. But if it’s where I can make money I’ll just do it. Cybersecurity is not my strong suit, as math was never my best. I’ll learn whatever I need to to start making as much stuff as I can. \n\nI’m just very lost in how to make this a career and start actually getting interviews for entry level positions because it has been radio silence for a while and I don’t have any feedback which makes pushing to do things hard. After too many years of trying I put it on the back burner this year to focus on myself and now I want to do everything I can to get this going. Any thoughts are appreciated. \n",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1gsyzni/where_to_go_from_here_im_at_a_loss_for_questions/",
      "comments": [
        {
          "body": "You’re a walking case study of why some people never break into tech. Five years after graduating, you have no portfolio, no relevant work experience, and no clear direction, yet you’re still asking strangers on Reddit to spoon-feed you a plan. News flash: employers don’t care about your sob story or the life obstacles you’ve overcome—they care about what you bring to the table. And right now? That’s nothing.\n\nIt’s not 2020 anymore, and the “pandemic ruined my opportunities” excuse has expired. The real issue is that you’ve spent years in analysis paralysis, asking vague questions instead of taking action. Nobody’s going to hand you a job because you finally got your life together. If you’re serious, stop looking for shortcuts. Build a portfolio, contribute to open-source projects, or grab an entry-level IT job to gain relevant experience. Until you do, you’re just another person with a stale CS degree waiting for a miracle that isn’t coming.\n\nProve me wrong—but the way you’re going, I doubt you will.",
          "score": 9
        },
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "You mention you are comfortable with web/mobile already so I would think that is your best bet. Do you currently have a source of income or some means to sustain yourself? I would say yes a portfolio is the best way to.go. Did you do anything in the last few years that you could put on your cv somehow?",
          "score": 0
        }
      ]
    },
    {
      "title": "Walmart Staff Software Engineer Role",
      "body": "I have a Walmart Staff Software Engineer Role interview coming up on Friday. Has anyone done interviews for this company before? Do they ask leetcode questions? I've been doing leetcode questions, but wanted to brush up on STAR questions about my resume and also review some common walmart system design questions.",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1gkp00k/walmart_staff_software_engineer_role/",
      "comments": [
        {
          "body": "You can expect LeetCode-style coding problems, system design discussions, and STAR-format behavioral questions. The coding challenges are usually medium to hard difficulty, focusing on data structures, algorithms, and problem-solving skills. It's smart to continue practicing LeetCode, but don't neglect system design preparation - they often ask about scalable architectures, distributed systems, and real-world scenarios relevant to Walmart's e-commerce platform.\n\nFor the behavioral portion, be ready to discuss your past experiences in depth. They'll likely ask about your leadership skills, how you've handled conflicts, and your approach to mentoring junior developers. Make sure you have concrete examples from your career that demonstrate your technical expertise and soft skills. As for system design, familiarize yourself with e-commerce concepts, inventory management systems, and high-traffic web architectures. If you're feeling anxious about the interview, you might want to check out this [interview AI](http://interviews.chat). I'm on the team that created it, and it's designed to help with tricky interview questions across various job types, including software engineering roles.",
          "score": 3
        },
        {
          "body": "Bootcamp grad from 2020 interviewing for Staff SWE? What's going on at Walmart",
          "score": 16
        },
        {
          "body": "Check https://www.teamblind.com/ and Glassdoor - may find your answer there. Good luck! 👍",
          "score": 2
        },
        {
          "body": "Walmart interviews varies with team. \n\nSome could ask you easy leetcode, some go in depth asking fundamental programming questions.",
          "score": 2
        },
        {
          "body": "Worked as an hourly contractor two years ago. Culture is strictly Manager based. My Manager was as terrible as a roadside vehicle repair owner in a third-world country. Quit voluntarily, and ever since, troubled in this job market, but that's a whole another poor-decision?, I don't know !\n\nHonestly, Walmart isn't FAANG, it's not even FAANG-adjacent.\n\nTread extremely carefully - most FAANG rejects within a thin-line, end up there.\n\nAnd just as any other Retail-Ecomm giant, the focus is on a \"fast-paced\" environment, and all \"Product-Ask\" come alongside with a strict deadline.",
          "score": 2
        }
      ]
    },
    {
      "title": "Convince me otherwise: take-home- quizzes to evaluate candidates for developer roles is a cooperate version of hazing",
      "body": "Have a take home for jpmc, the feds, and Walmart rn \nKill me\n\nCompany’s; hey, what if we…… asked candidates to do 10+ hours of unpaid work before hiring them. It’s not like that’s illegal in other industries or anything\n\nMe; oh my god yessss!! 🤡",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/vralw2/convince_me_otherwise_takehome_quizzes_to/",
      "comments": [
        {
          "body": "You could just not do them.",
          "score": 8
        },
        {
          "body": "It's not hazing. It's the alternative to live whiteboarding, which might be making just as many people cry and piss their pants.\n\nWhich is better to you, take home projects, or whiteboarding during interviews?",
          "score": 5
        },
        {
          "body": "Take-home tests a great if you actually know how to write code. You do a few of them, get a few offers, and it’s over.",
          "score": 4
        },
        {
          "body": "I won't defend them, but as someone who has tried a whole bunch of stuff to evaluate candidates ranging from leetcode questions to take-home projects, take-home quizzes feels like one of the less crappy ways of approaching things.\n\nOn-the-spot algorithm questions put people under pressure and only test algorithm skills, take-home projects ask people for way too much time outside of work, not doing any technical evaluation selects for good speakers...\n\nAnd there are those people who design interview processes where the power they have really get to their heads.\n\nIt sucks all around for everyone.",
          "score": 5
        },
        {
          "body": "I don't see what the big deal is, if you don't want to do take home tests then just refuse to do them and apply at other companies.  Stop being a pushover as nobody is forcing you to do anything.  I say no to interviews all the time when the process is something I do not want to do.\n\nEither enough people refuse that they change their process to hire the SWEs they desire or you are the minority with refusing to do take home tests.  If you are the minority then you either suck it up or do not work at those companies that do not have an interview process that you approve of.",
          "score": 2
        }
      ]
    },
    {
      "title": "How are you guys handling rejections ?",
      "body": "I Have been applying aggresively, got a couple of calls, all of them were rejections one way or another\n\nIn total I had 11 interviews in the last 6 months, and none of them got converted\n\n1. **LeanData (SDE-1)** =&gt; Couldn't pass a 3rd tech round \\[There were total of 3 tech rounds and 2 Leadership rounds\\]\n2. **Amazon (SDE-2)**  =&gt; Recruiter cancelled the call post scheduling, saying they want more experienced candidate\n3. **Wells Fargo (SDE-1)** =&gt; Rejection Post recruiter screen, my hunch is lack of sponsorship\n4. **Blue Yonder (SDE-2)** =&gt; Rejection post tech screen, all went well, there is no specific thing i can point out to i answered every question, the interviewer was overall very satisfied\n5. **Expedia (SDE - 2)** =&gt; Rejection post recruiter screen, no feedback shared\n6. **Walmart (SDE-III)** =&gt; Got Ghosted post a tech screen, no feedback shared, no official rejection, i was supposed to have an Interview with the HM but got ghosted eventually\n7. **Compass (SDE-1)** =&gt; Recruiter emailed 2 hours before tech screen, saying they are preferring local candidates, and are cancelling my interview as i don't meet that \\[ I am located in SF bay area, the role is based out of Seattle\\]\n8. **SquareTrade (SDE-2)** =&gt; Hiring manager Tore me apart, grilled me hard, felt he was expecting a SR. Engineer Qualifications for a SDE-II\n9. **DAT (SDE-1)** =&gt; Recruiter scheduled a call, 2 days before the call, she cancelled it, stating the position got filled\n10. **Harness (SDE-2)** =&gt; Recruiter didn't show up for call, I emailed her, someone else took up the conversation stating that the role has been changed, that specific morning and they are no longer hiring for it.\n11. **Included Health (SDE-1)** =&gt; Had 2 screens, the tech screen and the HM screen, just got a rejection couple of hours back, stating I didn't pass the HM screen.\n12. **Kayak (Java Engineer)** =&gt; Gave recruiter screen couple of days back, waiting for next steps\n\nAt this point I feel embarassed and ashamed that I couldn't land a single interview, how are you guys coping up?\n\nThe only bright side that I can see is that my leetcode skills are way stronger (848 solved, Top 12% contesst rating), and took some time to reflect on fundamentals, making them stronger than before.\n\nAny help, suggestions, reccomendations, advice would be appreciated, just help me out of this phase please.",
      "subreddit": "cscareerquestions",
      "score": 16,
      "url": "https://reddit.com/r/cscareerquestions/comments/1h02g4s/how_are_you_guys_handling_rejections/",
      "comments": [
        {
          "body": "Don't keep track of them. Once u applied, let it go. It only sucks when you keep track and invest emotionally into it.",
          "score": 39
        },
        {
          "body": "I normally send out **hundreds** of applications when I don't have an active contract..",
          "score": 14
        },
        {
          "body": "Delusion and hitting the gym thinking can get the girl back, don’t know if it will or not but we’ll get and trying\n\n….. oh just realized this is for cs career questions and not for girls….\n\nAdvice still applies",
          "score": 9
        },
        {
          "body": "You need a visa. How have you even been in the country for so long without a visa?",
          "score": 5
        }
      ]
    },
    {
      "title": "Should I Take a Walmart Karat Redo",
      "body": "I just finished my Walmart Karat interview for a Senior SWE. I was able to solve one medium problem in the allotted 40 minutes. I think Karat problems can typically be solved in 20-30 minutes.  \n  \nI wasted some time on an edge case. I'm relived to have it over, but this is incredibly important as I've been laid off from my previous job.\n\nThey will take both into account but tend to take the better result into account.\n\nShould I use my 1 redo of my Karat interview?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1jezf9t/should_i_take_a_walmart_karat_redo/",
      "comments": [
        {
          "body": "If you need a job and there is no benefit from not using it, use it?",
          "score": 6
        },
        {
          "body": "If you don't mind me asking, where did you apply through? Every time I've applied I get ghosted by Walmart.",
          "score": 3
        },
        {
          "body": "So solved 1 or 2 questions? I think 2 is passing.",
          "score": 1
        },
        {
          "body": "My brother failed the PayPal Karat coding challenge. He did the redo, but PayPal did not accepted the redo.",
          "score": 1
        }
      ]
    },
    {
      "title": "If a company asks for your current home address, does this mean that their entire inter-view loop is in person? A recruiter from Adobe Firefly reached out to my brother on LinkedIn. My brother replied to him, but the recruiter ghosted him. The recruiter linked the job link in the LinkedIn DM.",
      "body": "When my brother clicked the job link, he noticed that Adobe asked for your current address. The Adobe Firefly job is in San Jose. My brother currently lives in San Jose, but he finished a contract at Walmart Global Tech, so he is moving back to Midway City to live with his parents in a few days. My brother plans to apply to Adobe online using that job link that the recruiter gave.\n\nShould my brother put his San Jose address even though he will no longer live there in a few days? Does Adobe conduct inter-views in person? \n\nIf my brother gets the Adobe job, he plans to relocate back to San Jose. The Adobe Firefly job has 3 locations: Seattle, San Jose, San Francisco. If the entire inter-view loop is remote, my brother can interview while in Midway City, and my brother can relocate to San Jose without a relocation package. He has 2-3 years of savings saved up.",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/1if8uqz/if_a_company_asks_for_your_current_home_address/",
      "comments": [
        {
          "body": "No. The most likely explanation for why they are asking for a home address is because their software was configured to require it for applicants.",
          "score": 22
        },
        {
          "body": "This is what recruiters do. They reach out then they ghost.",
          "score": 9
        },
        {
          "body": "It means they might reject you based on your location if they think you live too far away from their office",
          "score": 7
        },
        {
          "body": "Put a San Jose address. They’re not going to mail anything. If it works out later and he gets a job there, he can update to a new San Jose address. No need to risk a recruiter passing on him because they think he has to relocate or wants to be remote.",
          "score": 3
        },
        {
          "body": "If he plans to relocate to San Jose anyway list the San Jose address but if he leaves too fast and the interview is in person just find a different job",
          "score": 2
        },
        {
          "body": "Address doesn't have anything to do with it. If it's an onsite position, the recruiter will usually ask if you're willing to move or able to make the commute in the initial interviews and then go from there. They typically don't initially filter out candidates based on their address.",
          "score": 2
        }
      ]
    },
    {
      "title": "Walmart global tech cyber security round 1 ",
      "body": "Hey everyone,\n\nI just got an invite to a Walmart round one interview, and I could use some advice! The email says it will last about an hour and consists of **technical knowledge and behavioral questions aligned to the Cybersecurity field.**\n\nHere's a little background about me:\n\n* I’m not super focused on Cybersecurity but have taken a **Cyber Defense** class where we covered tools and topics like **Wireshark, Scapy, Hashcat**, ciphers, man-in-the-middle attacks, and certifications.\n* I’ve been to several **hackathons**, mostly building **web apps**.\n* Last summer, I interned at a **construction company** and built an internal tool using **React, SQL**, and other app dev stuff.\n\ni am honestly not super focused on cybersecurity per say but i will take this interview and give what i have\n\nI’m curious if anyone has gone through this process or has tips for preparing for cybersecurity interviews at Walmart. What kind of technical questions should I expect?\n\nalso how many rounds does walmart have ?\n\nAny advice for behavioral questions or how to frame my background to make it relevant to Cybersecurity?\n\nThanks in advance for your help! 🙏",
      "subreddit": "cscareerquestions",
      "score": 8,
      "url": "https://reddit.com/r/cscareerquestions/comments/1gvjeo2/walmart_global_tech_cyber_security_round_1/",
      "comments": [
        {
          "body": "Is this for a contract role, or is this for a full-time role?",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "hello! how did your interview go?",
          "score": 1
        },
        {
          "body": "I don't know much about cyber security either, but usually what I do in situations like this is to paste the job description into chatgpt to ask what technologies I might use for the job, and then ask it to generate interview questions and answers for the technologies and topics. Maybe download some of the tools too and try them out. If this is a job for someone right out of college though then I wouldn't worry too much, they know you're not going to come in with deep industry knowledge. \n\nI do know a lot about Bentonville though; it's a super fun city, tons of mountain biking and a great tourist destination. They even have a home-grown mountain bike company called Allied which makes carbon bikes locally, and the Allied BC40 is the perfect bike for the area. No pressure but don't mess this interview up unless you hate having fun lol",
          "score": 1
        },
        {
          "body": "Cyber security interviews can be tough! But don't worry, I've been in similar situations and you can totally nail this.\n\nFor technical questions you can expect some basic Wireshark or Scapy-related queries. You might also be asked to walk them through a hypothetical scenario where you need to defend against an attack. Make sure to brush up on your man-in-the-middle attack knowledge and ciphers - those are common topics in cyber security.\n\nWalmart usually has 3-4 rounds. For behavioral questions, just be honest about your experience (even if it's not directly related to cyber security) and highlight any transferable skills you have. You mentioned building a web app at a hackathon? That shows you can work with tech, which is super relevant.\n\nOne thing that helped me when I was in a similar spot was using this AI tool that listens to the interview and suggests responses in real time. If you're interested, I can share it with you - no pressure! Just remember, your background experience is valuable too, so own it!\n\nYou'll crush this!",
          "score": 1
        }
      ]
    },
    {
      "title": "Which is better? Software internship at well-known non-tech company (Target) or at unknown tech company?",
      "body": "I got 2 offers for Summer 2017. Both similar salaries, similar perks, etc. But one is at a company that doesn't primarily focus on software development (Target), and the other is working on all sorts of emerging tech but is relatively unknown. I'm just wondering if one is better than the other in terms of how it looks for future companies? Or is it pointless to consider this?",
      "subreddit": "cscareerquestions",
      "score": 78,
      "url": "https://reddit.com/r/cscareerquestions/comments/5u5hld/which_is_better_software_internship_at_wellknown/",
      "comments": [
        {
          "body": "Pick the internship that will be the most interesting and that will allow you to learn the most. Most people don't care about where you intern, and that should definitely not be your top concern.",
          "score": 148
        },
        {
          "body": "Target is well-known for their big data within the industry. If you'll be working in that department, it could be rather impressive to put on your resume. ",
          "score": 49
        },
        {
          "body": "it really depends what sort of experiences theyre offering you, and which one seems more appealing to you! :)",
          "score": 18
        },
        {
          "body": "off topic but i also just interviewed with target and am waiting for a response, can i ask when you received your offer and when you interviewed? congrats on the two offers!",
          "score": 8
        },
        {
          "body": "If you're a sophomore  and below go with the one that would provide you a better learning experience.\nIf you're a junior consider job stability in addition to compensation + perks. Is the unknown tech company a start up? If so they're not always stable, not saying start ups are bad but I had to make the decision recently between start up and a big tech company, both relatively unknown, but the latter was much more stable. ",
          "score": 5
        }
      ]
    },
    {
      "title": "I was laid off my 85k a year job. After 18 months unemployment I can’t get a job at Walmart. I really very scared.",
      "body": "I am really scared my career earning potential has peaked. My brother makes $120k CAD a year and is barely getting by. I may never get another job that pays what my old one did. At 35. I may never work a job with that pays again.\n\n\nGoodbye dreams home ownership, kids… I’m actually genuinely terrified of what this means.\n\nI mean… life over?\n\nEdit:\nLocation is Canada. I have sent 2200 applications for jobs so far. 1 Interview. I have been doing gig work. plus 6 of  volunteering/pro bono work.",
      "subreddit": "jobs",
      "score": 14626,
      "url": "https://reddit.com/r/jobs/comments/1eq60el/i_was_laid_off_my_85k_a_year_job_after_18_months/",
      "comments": [
        {
          "body": "I feel you...I finally got a nice gig where I'd have probably hit 85-90k this year AND actually like the work environment...and then they downsized by 50%...now I'm having a hard time getting hired. And then these fucking personality assessments...I'm so tired of them.",
          "score": 479
        },
        {
          "body": "I went from a $65k job to $18.50 an hour job out of pure survival. It sucks. Something very wrong is happening right now. I got rejected from Lowe's, home depot, Walmart, and countless other jobs I thought would be easy to get. Everything is fu¢ied right now.",
          "score": 3438
        },
        {
          "body": "Lower wage jobs tend to not hire people who have earned large salaries in the past. I was in a similar spot and made 75k then had a life whirlwind occur. I figured, ok, no problem I will just find some low tier job and wait it out until I get on at something more fitting of my financial obligations. Well, to my surprise those companies don't want to hire over qualified people who have demonstrated they can earn a high salary lol The best I can say is find whatever will take you, driver uber, sell stuff online, whatever while you wait out something in your field.",
          "score": 999
        },
        {
          "body": "Yup...was at 100k a year, now disabled in my 30s and making 8k a year on assistance...  \nBut hey, still alive and with friends...and plenty of time for myself.\n\nI gave up on kids and home ownership for sure tho. That part of life is over for me.",
          "score": 115
        },
        {
          "body": "OP do NOT give up and push through it.  You'll make it. Your post hit me hard in the feels.  \n\n\n In Oct 2008 I went from 80k to Zero.  Lost everything (material), had a wife and two toddlers to care for.    \n\n\nWe lived in a small apartment.  I got like 4 months of salary through severance and unused PTO which carried us through that winter/Xmas.   Immediately filed for unemployment only to find out my employer never switched what state they were paying into when the last relocated me from one state to another.   So they were like, you don't have unemployment to draw from, employer never stopped paying the original state of employment.   I ended up having to collect from the original state through online check ins, which also had a lower max payout than the state I was actually living in.    \n\n\n Long story short, I ended up writing a dumbed down resume and taking a part time job at an Advance Auto parts for something like $8/hr which sucked but I applied myself and was managing the place in a year or so.  Then a walk in customer I helped get parts for who worked at a med device company locally asked for my resume based on our interaction.   \n\n\nBy 2010 I was back into a professional field of work and have been recruited and moved across states again, by 2016 we were able to buy again, and I am just now, in 2024 close to what I was making in 2008.  \n\n\nFactoring in inflation, yeah I'm still behind and as someone else pointed out, I'll never get back the lost years of 401k retirement earnings... but it's possible to regroup and thrive again.  You have to push yourself to focus on the goal. ",
          "score": 438
        }
      ]
    },
    {
      "title": "Ghosted by Walmart after final interview - product manger ",
      "body": "Hi everyone\n\nI have been out in the job market last 6 months and it’s been really hard. I had an offer in April from Taco Bell (145K Base and 10K sign on + benefits + annual target bonus) for Sr Technical product manager I role, I felt a lowballed for a role in LA and I rejected it as I wanted to switch to big tech and look for something more long term. Since I had just started interviewing I felt I would get more opportunities.\nI have interviewed at Amazon, Visa, SailPoint, few startups after that but nothing workout out. One startup rejected me after interviewing me the CEO, because they had a layoff and hiring freeze. Went in final round of Google and got rejected last week.\nI interviewed at Walmart twice for Sr Product Manager role - went until final round for first one but got rejected. second time I did pretty well - I was also asked to do an additional interview after final panel to discuss some questions with another hiring lead. It felt positive and she assured me I will hear back soon. She also asked me if I am still interested in the role as the interview process has taken more than 2 months. I assured her yes I am very interested. But then they ghosted me - it’s been almost 3 weeks now ( tomorrow it will be 3 weeks ) and the HR doesn’t even reply me, the job application still says “in review“ but they have taken down the job posting. I feel very low as I have been working hard in this tough job market and giving my 100% in every interview. Please suggest me what can I do.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1fk62ns/ghosted_by_walmart_after_final_interview_product/",
      "comments": [
        {
          "body": "Just DM'd you!",
          "score": 1
        }
      ]
    },
    {
      "title": "Changed my name to sound more \"American\" on resume and job applications, suddenly getting interviews now",
      "body": "My actual name is an ethnic name from Thailand, which I have on my resume.  I was not getting responses I suspected it might have something to do with my real name because my name is completely foreign so I thought maybe its giving people the wrong idea like I need a sponsorship or something even though I'm American and on these applications it asks \"do you need a sponsorship?\" and I always click no,  2 days ago I changed my first name on resumes and applications to something more \"American\" and also I saw on Reddit people suggesting that too, I chose Sam, and suddenly I'm getting interview requests now...\n\nNote so far this is for retail jobs like Walmart, Nordstrom, Best Buy and a bunch of other places, the very same retail jobs I was not getting responses for 2 months with my real name and now Im finally getting interview requests with my fake name. I dont know if this will work for other types of jobs, it seems to work for retail\n\nI had been desperately applying to summer retail jobs for over 2 months using my real name with absolutely no responses until now, I need these retail jobs for the summer. I'm gone try doing this for digital marketing jobs next (a field I'm trying to see if I can get into), These applications were also mainly on Indeed. I changed my name to Sam on Indeed and my resumes in general and applied to more places with my fake name, and now I'm getting interview requests out of nowhere.\n\nName discrimination looks like a real thing. If youre not getting a response and you have an ethnic name, try changing your name to sound more \"american\" on job applications. Of course when the interviewer ask what my real name is I will tell them and for paperwork but I have to submit job applications with my fake first name because my real name looks like its  used against me, I hope someone finds this helpful",
      "subreddit": "jobs",
      "score": 1560,
      "url": "https://reddit.com/r/jobs/comments/1da2my7/changed_my_name_to_sound_more_american_on_resume/",
      "comments": [
        {
          "body": "It's sadly pretty common:\n\n&gt; Chloé Wang (Chinese: 汪可盈; pinyin: Wāng Kěyíng; born April 18, 1992), known professionally as Chloe Bennet, is an American actress, model and singer.\n\n&gt;In a 2016 interview, she noted, \"Oh, the first audition I went on after I changed my name \\[from Wang to Bennet\\], I got booked. So that's a pretty clear little snippet of how Hollywood works.\"\n\nSource: https://en.wikipedia.org/wiki/Chloe_Bennet",
          "score": 649
        },
        {
          "body": "There is a Harvard study on this exact thing.",
          "score": 166
        },
        {
          "body": "In a previous era I worked in a contact centre, and there was a regular caller named Mr Khan.\n\nMr Khan was known to have a particularly strong accent which often made communication difficult, and this was noted on his file.\n\nMr Khan had the THICKEST GLASGOW ACCENT you’ve ever heard; like you could not do a stronger accent if you were trying to 😆",
          "score": 37
        },
        {
          "body": "Pretty common for immigrant folks working in the US. Many of my Indian friends who works in the US have changed their first name to something which is more common in the US. Siddharth has become Sid, Sumit has become Sam, Abhishek has become Abe etc. This is even more pronounced in people who had to change their jobs a few times, under the Damocles sword of the H1B",
          "score": 128
        },
        {
          "body": "I'm Thai too and maybe I should start doing this...did you change your last name too? Us Thai people tend to have really long first and last names lol.",
          "score": 90
        },
        {
          "body": "Latino here. My parents gave me and my brother some pretty white ass names. \n\nThankful for it.",
          "score": 22
        },
        {
          "body": "This gets me worrying that my first name is a big barrier for me when it comes to job applications. I won’t post because it’s easily searchable on social media but VERY unique (I have a middle eastern background but it’s irrelevant to what I was names) and has me wondering if I should try some applications with my middle name….",
          "score": 14
        }
      ]
    },
    {
      "title": "Walmart interview process for category analyst position",
      "body": "\nCan anyone tell me about the interview process at Walmart for category anslyst? I've had a hr screening and now I have an interview with category merchant. Can anyone provide any more detail ?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1fx06fd/walmart_interview_process_for_category_analyst/",
      "comments": []
    },
    {
      "title": "Applied for a job as a janitor at Walmart then had my interview and went to my orientation only to be bait and switched ",
      "body": "I applied for a job as a janitor at Walmart 2 weeks ago, had my interview for the job last week and it only lasted like 30 seconds. Got a call a couple days later to come in for orientation. I go to my orientation and watch cbls and eventually we walk the entire store. We take a break, then when we get back we start getting our badges and vests along with schedules. I go on the app and see they have me working in the deli and I call the next day let them know that it’s a mistake and they tell me no it’s not a mistake and ask if I can change positions and get told I will have to wait 6 months. I explain that I can’t work in kitchens since they are not my strong point nor my cup of tea and I applied and interviewed for a janitorial position since there’s little customer interaction. So I end up quitting over the phone.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1dg89kp/applied_for_a_job_as_a_janitor_at_walmart_then/",
      "comments": [
        {
          "body": "That sucks. But it seems to be a norm anymore. Places are advertising for one position but plan on putting the interviewee in another.",
          "score": 2
        }
      ]
    },
    {
      "title": "I got hung up on",
      "body": "I need a job desperately. I applied for a Walmart down the street from where I live two months ago, and got nothing back- not even an email saying they didn’t need anyone at the moment. Just nothing. I figured that it was because then I didn’t have a HS diploma or my GED. So I reapplied this month as I now have my GED.\n\nAfter a couple weeks, still nothing so I called and said that I had put in an application and the person on the phone told me “oh he’s on vacation he’ll be back next week” idk who “he” is but I just assumed the hiring manager so I called back last week, and I was told that he was on his lunch and call back later. I forgot but I called back a couple days later and was told that he wasn’t there that day and that I should call back the next day. So I did, and I got hung up on twice. The first time, there was a really long silence after I spoke and then the call stopped so I assumed the call just dropped or something and I waited like 20 minutes and called back only to get hung up on again. That time I just stopped because I didn’t want to bother anyone and it felt like I was (understandably so- I’d be bothered too if someone was calling me repeatedly) \n\nI’m 18, I haven’t had a job before, and now that I’m able to I’m honestly just scared that I’m doing something wrong so I have to ask, is this a me problem or a Walmart thing? \n\n\nEDIT: to anyone wondering: I have an interview tomorrow with a nearby McDonald’s. I’m not super hopeful as I’ve already had two interviews with this place and keep having to come back for some kind of reason but I’ll keep you all posted! \n\nUPDATE: I went for the interview and they told me that the hiring manager wasn’t there today. A little weird that they’d schedule me today but maybe something came up. Always, they told me to come back for the interview tomorrow so I’ll let y’all know how it goes :) \n\nUPDATE 2: The McDonald’s interview went really well!!! They said that they have two part time afternoon and nights positions open, and that I’d should hear something back about it by Thursday or Friday! I’m a little worried that I’ll miss the call but I’m sure that’s just in my head. \n\nEDIT 2: Can ya’ll please stop telling me to join the Navy/military? I’ve been eligible to work for THREE weeks. I’m not going to give up yet. I’m sure it’s a very commendable job but it’s not one I want to first and foremost- without getting too political- my entire being is frowned upon by the current government. I’m queer, transgender, biracial, Hispanic, and born a girl. Anyway you slice it they’re out for blood. I don’t feel safe in many settings already as I live in a state where most people carry something at all times, and I doubt that would go away if I went into a military setting. Second, I’m not gonna pass any physical test. I was a choir/theater/band kid in high school. I’m not very fit. My strengths are in the arts, and my people skills. I have family that’s joined, and I love them dearly and support them choice they made, but it will NOT be one that make unless I absolutely have to years from now. Than you for your suggestions and for trying to help but please stop telling me to join the navy. ",
      "subreddit": "jobs",
      "score": 120,
      "url": "https://reddit.com/r/jobs/comments/1mb73lb/i_got_hung_up_on/",
      "comments": [
        {
          "body": "[removed]",
          "score": 51
        },
        {
          "body": "You aren't doing anything wrong - it's just kind of hard out there right now. I would try applying to a restaurant because they are almost always hiring. Since it is your first job, they will probably start you off as a host but you can work your way up from there. It isn't super hard and hosts sometimes are able to earn tips. One thing I'd suggest is going into the place to want to work so you can meet the hiring manager in person because it definitely helps for these people to see the face behind the application. Don't give up, keep trying and you'll get there.",
          "score": 19
        },
        {
          "body": "Walmart treats their employees like trash. I had a friend work there and her experience was very similar. Super difficult to get a hold of anyone, very rude HR people. She’d call and call, no answer, email and no answer. Look elsewhere. It’s not you.",
          "score": 5
        },
        {
          "body": "It’s not you, IDK how anybody without family connections expects a young person to enter a job market that can’t distinguish pro-actively seeking from being a stalker. What Wal-Mart did was total BS. I wonder if it was a person on the phone flexing their “authority”. You should show up in person, ask for the manager, and shake their hand just to say you did. You have nothing to loose. \n\nI have a feeling others have covered this but when applying in person or showing up for the beloved interview of course be neat and clean and look as ethnically and socially neutral as possible. Smile as genuinely as possible. (Obama explained he realized early on that a big smile was disarming to people.) There is plenty of time for the real you later (which I have a feeling includes bug smiles when ur feeling it.) \n\nAs others have said, try smaller businesses but don’t get roped into staying for more than one year. I’m thinking, hipster cafe, then try again at the corporate retail places. \n\nBut save your money, as much as possible because there are other places in this country where you will blend in and possibly be revered. You need to get to one of them.",
          "score": 3
        },
        {
          "body": "If there’s a Starbucks, Dunkin, random coffee shop try those as well. Look into local insurance offices. They might need someone just to answer the phones. Remote work? Try Teleperformance and TTEC. They’ll send you the equipment. They’re call center jobs and they’ll train you. It’s a start",
          "score": 2
        },
        {
          "body": "Congratulations on getting your GED!  As far as employment goes you will need to be REALLY PATIENT.  Don't put all your eggs in one basket.  Apply to many different jobs in your area.  I am not your age but have been seriously applying for a job (74 to be exact) for months with really good credentials, but the job market is flooded with people coming out of college with Bachelor Degrees.  Although you won't need that for a Walmart job when your just starting out, you will need some type of experience to get in.  My daughter applied to Walmart and the Hiring Manager was extremely rude and hung up on her. I heard their conversation and he was a real jerk.  You should go on Indeed (free job search site) and create an account and look for a job through them.  I hope this helps a little and good luck in your search for a job.",
          "score": 2
        }
      ]
    },
    {
      "title": "Why is it so hard for me as a student to find a job, specifically a dead end one",
      "body": "For the past two years, I have been looking for jobs that basically don’t require much experience, like retail/restaurants/fast food that HS/college students work at part-time to make extra cash since I’m currently a first year college student. Back in December 2022, I snagged a bagging job a grocery store and they hired me on the spot. It was great 3 years ago because it gave me the opportunity to save up for my first car; a year master, I bought my car with cash and began starting looking for another job so I can build my resume, primarily in retail or food service as I kept up with my studies. Although I tried indeed, linked in and directly on the company website. Even in times when hiring is at the prime, like after Christmas and before summertime, I rarely got into any interviews and no one called back and I’m still working at the same bagging job three years later even though my manager all praise me for the hard work. Heck, even Walmart wouldn’t hire me. What is making this job market really bad for the past two years? Is it because of AI taking over bigger corporate jobs or am I dealing with ghost jobs and automated applications? I’m lost. ",
      "subreddit": "jobs",
      "score": 52,
      "url": "https://reddit.com/r/jobs/comments/1px02vq/why_is_it_so_hard_for_me_as_a_student_to_find_a/",
      "comments": [
        {
          "body": "It's weird because you're exactly right. In 2022 I was unemployed, sent a single application to Lowe's, and they hired me on the spot.  I don't work there anymore but I've been reading about how even entry level stuff is competitive these days. Idk what happened the past year or two but it feels like the job market has substantially shifted",
          "score": 40
        },
        {
          "body": "You’re competing with others who have open availability and most likely more relevant experience. The economy is in the shitter.",
          "score": 17
        },
        {
          "body": "Everyone here talking about AI when the reality is that the economy is fucked and not necessarily because AI. Inflation is extremely high, people lost their jobs and there’s not enough jobs out there plus people are not spending money",
          "score": 21
        },
        {
          "body": "Just guessing here but why would they want to hire a student with an ever changing schedule when they can hire someone who is desperate and will work any hours they throw at them (all the while keeping them part-time so they don't have to pay for benefits )",
          "score": 10
        },
        {
          "body": "I'm in a similar boat. I'm 21, and through a lot of sucky shit in my life, I'm a bit late to start. No driver's license, no job. I've put in so many applications to even entry level places. Walmart, it's been weeks since I've put in my apps. I had an interview at chic fil a yesterday that went really well but I was told I'd head back from them today. Nothing. I'm just.. so tired. I'm tired of every day sucking ass because I am so far behind, and I can't even fix that. So you are not alone.",
          "score": 6
        },
        {
          "body": "You're still a bagger? Have you asked for more opportunity within the store? \n\nWhen I worked in a grocery store, we recruited our freight guys from baggers, the ones not chosen were lazy or unmotivated.",
          "score": 6
        },
        {
          "body": "If you haven't done this already, don't let them know you're in college on the application. They're less likely to hire you because you're more likely to leave. Sad but true.",
          "score": 4
        },
        {
          "body": "it's hard because a lot of overqualified people are working those jobs these days",
          "score": 3
        }
      ]
    },
    {
      "title": "My Interview Was Scheduled and Confirmed on September 23rd… and Then It Gets Cancelled on October 1st. Now, I’m No Longer Under Consideration! Is This Common At Walmart or Any Company?",
      "body": "",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/q6g6dy/my_interview_was_scheduled_and_confirmed_on/",
      "comments": [
        {
          "body": "At Walmart or any job in the service industry...probably. They found someone sooner than your interview was scheduled for.",
          "score": 8
        },
        {
          "body": "Why was the interview scheduled two months away???",
          "score": 5
        },
        {
          "body": "Similar thing happened to me this year. I applied for a job on Monday, had a virtual interview scheduled for Friday same week. Thursday they sent me an automated email that they would not move forward. I thought it was odd. Could they send me the wrong email because I was scheduled to interview the next day? There was no interview cancellation notification. No one showed up on Friday interview time either. It’s a well known industry company as well.",
          "score": 3
        }
      ]
    },
    {
      "title": "Any tips on getting an interview at walmart ?",
      "body": "I honestly have been trying for around 5 years now. Never even got to the interview stage. Been trying to become an overnight stocker for the longest.",
      "subreddit": "jobs",
      "score": 22,
      "url": "https://reddit.com/r/jobs/comments/bymnhj/any_tips_on_getting_an_interview_at_walmart/",
      "comments": [
        {
          "body": "In my early 20s even when I had a couple years warehousing and stocking experience, I couldn’t get a damn interview there for night stocker or any position, no matter how many follow up calls or applications I submitted. \nThen you go into wal mart and see some of the employees that some how managed to get a job there and it makes you wonder wtf is going on in their hiring processes. Lol.",
          "score": 22
        },
        {
          "body": "Honestly, most of Walmart's policies, including hiring, are really impersonal. If your application is at the top of the queue when they need a position filled, you might get a call. \n\nI worked there for a little over a month. Everything, from scheduling to hiring, is determined by computer scripts and programs set by corporate offices. Regardless of how qualified you are, you could easily be skipped over.",
          "score": 11
        },
        {
          "body": "I once worked at the bakery and saw a lot or much better qualified people applying and never getting a call back, even though there were open positions. I eventually figured they wanted broke foreigners like me, because they knew we'd stay there for awhile and accept minimal wage.",
          "score": 21
        },
        {
          "body": "I don't want to tell you how to live your life, but I wouldn't be all for Walmart. I don't hear any good stories there.\n\nOther than being a Debbie downer, I'm curious as to why you're looking for a job there",
          "score": 9
        },
        {
          "body": "Go on over to the r/Walmart subreddit. They either help ya and/or tell you to run for the hills",
          "score": 3
        },
        {
          "body": "That’s some serious dedication for a job at Walmart",
          "score": 3
        }
      ]
    },
    {
      "title": "Walmart job interview",
      "body": "okay so I have an interview tmrw at Walmart, but they have not emailed me on who is going to interview me and haven't told me who I need to talk to when I get there. should I call them or just go tmrw. So basically I only know when and what time my interview is at. ",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/jrqoji/walmart_job_interview/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Just go. I work for Walmart and honestly it’s kinda a shit show... at the least the store I work at. What position did you apply for? Sometimes they hire a ton of people at a time. It’s a numbers game. They know an X amount of people will quit and and X will be fired and so on...",
          "score": 1
        },
        {
          "body": "As the other poster said, go to the customer service counter and let them know you have an interview. Theyll point you in the right direction",
          "score": 1
        },
        {
          "body": "Walmart Team lead here. I hire for my area (Front End)\n\nGo to the service desk and let them know you have an interview. They will call the person you will interview with.\n\nIt’s a three question interview:\n\n1. Tell me about yourself\n\n2. Give me an example of a time you went above and beyond for a customer/person\n\n3. What’s your availability like?\n\n\nSeriously, that’s it. Some people add a few other questions but it’s a cake walk. I always take my interviewees to the area they will be working in so they can kinda get a feel of what a day in the life is like. From there if I want to hire that person I do the job offer on site and set up an orientation date. If I don’t want to hire someone I say “we’ll give you a call back if you’re the best candidate” and then I remove from the req a few hours later so they get the rejection email. \n\nDon’t stress, and don’t over talk. I had a chick talk her way out of a job by asking me if loss prevention works mornings. I was gonna hire her, but her saying that made me nervous. \n\n\nBest of luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart job interview passed",
      "body": "I finally managed to get called for an interview at Walmart and I think I passed it. I was given a paper to sign and some stuff to do on my email. I think I’ve done all that correctly, now one of the sites says “eligible for hire” and it’s said that for I believe the past 2 days. I think all I’m supposed to do now is wait for them to contact me for orientation, but I’m worried maybe there’s something else I need to do and maybe they’re waiting for me to do that. Does anyone know how long it usually takes to be contacted for orientation? Thanks",
      "subreddit": "jobs",
      "score": 12,
      "url": "https://reddit.com/r/jobs/comments/l3czic/walmart_job_interview_passed/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Just call them if you have questions dude",
          "score": 4
        },
        {
          "body": "There's very likely a sub for Walmart employees which may be helpful.",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Congratulations! Call the store and ask what your next step is they won't mind and will be happy you care enough to do so!",
          "score": 1
        }
      ]
    },
    {
      "title": "Got rejected from Walmart, what's next?",
      "body": "I've never had a proper job in my entire life. I've only been a tutor and babysitter, never worked for a company. Since January, I am desperately trying to find a job, ANY job, and have had zero luck at all. No interviews, no callbacks, not even a rejection email, nothing. \n\nThis past week I finally got something, an interview at Walmart! It went really well (or so I thought), I dressed nice, I was nice, shook his hand, made eye contact, answered his questions the best I could, ... Literally nothing went wrong at all but I received an emal saying I didn't get the job???\n\nNow I'm completely at loss. I'm legit looking for a minimum wage job, I've applied in person and online to multiple multiple places. I live in a small city and have to take the bus and applied EVERYWHERE in an hour and a half radius. I even applied to places with no job offers posted.\n\nWhat do I do? I live with my mom and she pays for my necessities but nothing more. I can't live like this forever, please help :(\n\nEdit : I forgot to say that I got my resume checked by a “professional” and three other people in my entourage that all said that it was fine. I also make personalized cover letters for every place I apply to.",
      "subreddit": "jobs",
      "score": 167,
      "url": "https://reddit.com/r/jobs/comments/1dh43vo/got_rejected_from_walmart_whats_next/",
      "comments": [
        {
          "body": "For retail and customer service jobs like that, you need to say you're willing to learn, and willing to work almost any shift (since you take the bus you are limited a bit depending on city bus schedules).  *Tell them what they want to hear.*  \n\nAnd keep applying.  Apply to Walmart and Amazon and Target and every other big box retailer every single month.  There are always job opening that pop up...you don't get in the first one, another one appears a few weeks later.",
          "score": 156
        },
        {
          "body": "You have had proper jobs. You have skill sets which are transferrable to other type of positions. Babysitting:  you had the welfare and safety of children in your care, negotiation skills (always with kids), creativity, planning, trouble shooting, thinking on your feel, trouble shooting.  Tutor:  educating others, planning your class, delivering information, presentation skills, responsible for the transfer of subject matter to others.  Start believing in yourself and sell these skills!   Stop thinking you have nothing to offer because you have much more than someone else who may have worked a register or stocked shelves for years.  NOT that they are bad skills, but you can offer other skills.  Good luck!",
          "score": 42
        },
        {
          "body": "Amazon, or any warehouse job like an amazon.  These jobs are usually high turnover and don't require any experience or creditenals....",
          "score": 51
        },
        {
          "body": "Does your city have a jobs center sponsored by the state or local government?  Go there and avail yourself of their resources. They often have resume and job training services along with listings of jobs.",
          "score": 28
        },
        {
          "body": "I got rejected from McDonald's once. Told me I was too good for it, too qualified. I had zero life or academical qualifications when this happened btw",
          "score": 17
        },
        {
          "body": "You were probably denied because you were over qualified. I imagine Walmart is looking for employees that have issues that they can exploit.",
          "score": 18
        },
        {
          "body": "Call centers hire anyone, and they're a good way to get your foot in the door at a company. Call centers really badly, but it's a job.",
          "score": 6
        },
        {
          "body": "Reach out to the person that interviewed you. Ask what you could improve on either your resume or your interview (basically, “Why didn’t I get this job?” But without actually asking that outright.) \n\nIn that same conversation, let them know you would be interested in any current or future opportunity for which they think you might be a fit.\n\nApply whatever feedback this person gives you to your resume and/or future interviews.",
          "score": 16
        }
      ]
    },
    {
      "title": "Walmart interview",
      "body": "So I’ve got a Walmart interview today and I’m not sure what to expect. Anybody tryna help?",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/lyjwsu/walmart_interview/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Not sure what role you are applying to but I worked at Walmart as a cashier about 2 years ago while in college. Their interview is pretty easy tbh, just remember the customer comes first, don't confront or engage with people who are stealing, in case of conflict with coworkers/supervisors know what steps to take etc. There's so much info about their interviews on glassdoor. Good luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "Senior Data Scientist interview at Walmart Global Tech",
      "body": "Hey\n\nI recently cleared the Karat assessment for the role of Senior Data Scientist at Walmart Global Tech and have a technical interview coming up.\n\nI am not sure what's going to be asked, and was hoping that if anyone here recently went through the same or similar process, they could share the details about the interview process and the kind of questions that were asked during the interview",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1956kx6/senior_data_scientist_interview_at_walmart_global/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Check out [Ace the Data Science Interview](https://www.acethedatascienceinterview.com/) there's a few problems from Walmart in there!",
          "score": 1
        },
        {
          "body": "Can you share your interview experience here?",
          "score": 1
        }
      ]
    },
    {
      "title": "What should I do about my Walmart interview error?",
      "body": "I applied to Walmart for a cashier/customer experience associate but I got an email saying I was selected for an interview for a customer service manager. The last Walmart I did an interview at did a 6 person group interview with people interviewing for different positions, I’m kind of thinking I’ll just go to the interview and tell them that I’m actually interviewing for the cashier position. The interview is on Wednesday and I don’t know what to do, I have no job experience so I definitely won’t get hired for the manager position that I didn’t apply for.\nAny suggestions? \n(The Walmart is in Ontario, Canada)",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/nzycmh/what_should_i_do_about_my_walmart_interview_error/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Do you have a degree? Any voluntary or internships etc? A degree with any of those honestly are probably enough to get a customer service management role at Walmart. Just be very prepared for the interview and make them want to hire you as a manager.",
          "score": 3
        },
        {
          "body": "Go with it. If they dont realize their error, maybe it's not an error.",
          "score": 2
        }
      ]
    },
    {
      "title": "Feeling Worthless",
      "body": "https://preview.redd.it/mt0mx1h7mf1g1.png?width=596&amp;format=png&amp;auto=webp&amp;s=14fdf56a0cfdacdaed2687fbd09544c25e42fecb\n\nFeeling so hopeless and depressed ... It's really hard to explain what it feels like being an experienced white-collar professional with an engineering degree without a full-time job over the last 5 years. Doing contract and consulting work with the promise of a full-time offer, only to be replaced by another contractor when the time comes for the offer to arrive. I question myself often, my self-esteem is at an all-time low, everything I worked so hard for is falling apart. Debt is unimaginable, the feeling of being underwater takes away from enjoying things like holidays and family gatherings. And the hardest part is, no one understands.\n\nFriends and family who are happily employed and have been in stable jobs or industries give unsolicited advice like “well, get a job at Walmart in the meantime,” “sell your house,” or “move away while your kids stay with the other parent,” without knowing that I have applied to every entry-level and office clerk job in my area, and it's crushing me. Everyone feels like you must be the problem without knowing how hard the job market is right now. It feels like I'm screaming but no sound is coming out, like a nightmare.\n\nEvery morning I wake up with panic attacks when I see yet another late payment notice and electricity cut-off letters... every morning I put on a positive face for my kids to make them feel like they are safe and I am still the same. But I am not the same person, the same parent, the same professional as I was back when I was working my stable corporate job talking about hard candy and carving pumpkin competitions at my workplace. That life feels so foreign now, so distant, like maybe I just dreamed it all.\n\nI have been surviving, just zombie mode surviving, and it's HARD. Every morning I feel like, is this the day I'm going to break when I see another job rejection or another ghosting after a successful interview process with HR telling me they are sending an offer in a couple of days, only for me to be ghosted when I follow up. It feels so isolating and lonely, like a scarlet letter that is stamped on you: damaged, unhireable, not worthy, not intelligent enough.\n\nJust wanted to share. Hope everyone who is struggling will keep pushing and fighting, and everyone who is safe and has never been in this position sees the other side, the dark side of the job market, and maybe reserves some judgments and condescending comments toward their partner, friend, or family member who is in this position.\n\nHave a great Saturday.",
      "subreddit": "jobs",
      "score": 44,
      "url": "https://reddit.com/r/jobs/comments/1oxt19t/feeling_worthless/",
      "comments": [
        {
          "body": "I think we have a few engineering jobs. https://careers.chobani.com/go/All-Jobs/8610600/",
          "score": 20
        },
        {
          "body": "Check out the power company if you have not already? They are generally thriving and love to hire engineers.  Also when I was in your shoes years ago I had to take meds for anxiety and depression. People talking to me did nothing. My brain works the way it works, telling me to consider my mental health or my childhood or the bright side is useless to me.",
          "score": 6
        },
        {
          "body": "3 years ago, I made over $700k in my commission only sales role. Two years later I was let go in layoffs. Relationships I made during my tenure are still providing for the company, while I live with constant anxiety as I apply and interview tirelessly. \n\nI feel and share your pain. I did everything right and it didn’t matter.\n\nYou’ve done everything right, got a great degree that is not easy to get, and is supposed to be a “guarantee” for the workforce, and that’s not been the case. \n\nIt isnt fair, but that also means it isn’t you. \n\nKeep doing everything right and Karma will correct itself",
          "score": 4
        },
        {
          "body": "at least you are able to get contract jobs. my husband got laid off over a year ago and  even contract jobs are rejecting him because \"overqualified\". like his 17 years of experience is worthless. retail jobs wont accept him either. we are living off of savings and my low paying job.",
          "score": 4
        }
      ]
    },
    {
      "title": "Got an interview for Walmart Canada, is it a bad place to work?",
      "body": "First time user of this sub and I was wondering - is working at Walmart as bad as people say it is? I'm aiming for working as a cake decorator there and I'm really apprehensive about working there. \n\nI live in Quebec, Canada, I've worked in a supermarket, cupcake place, bakery, and restaurant in that order and spent 5 years in the pastry industry with 2 years in the foodservice. I went to school for pastry as well, I'm mainly going for something stable and with benefits for myself and my family. I've been in many different work environments and I would like something that's not going to give me a mental breakdown more than 3 times in the spend of 3 months - that was from working in the restaurant.\n\nWhat kind of things should I be looking for during the interview? What kind of questions should I ask?\n\nI would really like some help on this since I've always looked at companies with suspicion and mistrust, I want to know if this will be a good move for me or if I should keep looking for something else. I really appreciate your help on this one :)",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/jzmeol/got_an_interview_for_walmart_canada_is_it_a_bad/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Walmart is bad period. They try everything to avoid giving any benefits that don’t make them money. Stay away from it like the plague",
          "score": 1
        }
      ]
    },
    {
      "title": "i got a job interview at Walmart and i dont know what to wear and i dont know what to say at the interview",
      "body": "im 16 years old and i dont own any fancy cloths just basketball shorts and nike shirts and this is my first job interview so i dont really know what to wear or what to talk about\n\nso some things i would like answered is \n\n\\- what should i wear and where to shop at \n\n\\-and what kind of questions should i be ready to answer \n\nthe interview is this Monday so its stressing me out a lot",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/8yn5pq/i_got_a_job_interview_at_walmart_and_i_dont_know/",
      "comments": [
        {
          "body": "You don't need any fancy clothes...at that same walmart you can get a pair of khaki pants and a button-down light blue shirt and you'll be fine. Look at the other employees there and what they are wearing for a good example. And don't worry about what to say. Just smile, make good eye contact, answer their questions as best you can and if you don't know something say so and don't try to BS. Shake hands at the end and tell them you hope to get called back, and I'm guessing you will. Good luck!",
          "score": 7
        },
        {
          "body": "(I work in HR and have worked as a Recruiter/staffer for McDonald's)\n\nWear a pair of nice jeans and a polo or a button up shirt with a collar. Wear a nicer clean pair of shoes, no basketball shoes or dirty shoes. They don't have to be dress shoes just nice and presentable. \n\nFor questions don't worry about asking questions, they will lead the conversation and ask you all the questions. You just need to respond honestly and seem excited. There will be a point where they ask you if you have any questions and you can ask things like \"What is the culture like between the employees?\" \"What is the management style here?\" or if you really want to impress them you can ask \"What skills are you looking for in crew members to become a manager?\"",
          "score": 2
        },
        {
          "body": "I worked at Walmart a few years ago as a remodel worker, a gm stocker, and a support  manager for a short while at a Walmart supercenter then a Walmart neighborhood market store. During the interview there really isnt an expectation to dress professionally. I came in with a simple dress shirt and khakis with no tie and comfortable shoes and I still felt overdressed compared to some of the others there. The interview is simple. They ask u situation based questions you get in any customer oriented job like what would you do when met with a disgruntled employee or when did you meet or exceed expectations. The answer is scored on a scale of 1 to 5. If you just use common sense you should get all 4s atleast. Dont tell them about any health questions but do make sure that they can work with your schedule as they are typically short handed and want to hire you so depending on your role you might get flexible scheduling. I managed to get a set schedule that conformed to my school schedule because they saw I worked well and was willing to work multipe departments. If you happen to have an unexpected need to miss work there is a Walmart automated phone line so you won't have to deal with managers to call out.\n\nThe best advice I can give is to stay relaxed and act professional. Some people came in with tanktops and torn jeans. You simply preparing ahead of time already puts you ahead of others that come in unprepared.",
          "score": 1
        }
      ]
    },
    {
      "title": "Why is it so hard to get a job? (Rant)",
      "body": "I am a 22 years old female. I graduated a semester early and received bachelor's in Marketing and Graphic Design with concentrations in IT and Game Design. Gaming and technology are my biggest passions and I hope they can translate to my long term career. \n\nMy frustration lately has been the amount of rejection I've been receiving. I've been job hunting since my graduation in December and my patience is thinning out. The constant rejection makes me question myself and doesn't help with my other worries (financial debt, daily cost of living).\n\nMost of the jobs I apply for relate to my degrees (marketing, social media, and customer service) as well as gaming. Although it's simple to say I'm inexperienced, I have unique experiences on my resume. \n\n1. 3 years of internship experience\n2. 2 years non internship experience relating to marketing\n3. Viral Tik Tok project (30k followers in 3 months,100k+ views) \n4. For gaming related jobs, I emphasize my scholarship for eSports as well as my personal gaming channel. \n\nI'm not just complaining. I've put in WORK, especially with my dream companies. For example, I applied to 100+ openings on Microsoft that I believed I was qualified for. It wasn't mass applying.  I messaged 100+ people on LinkedIn before I found out it was a big no-no. I even tried using connections from real life. I asked around everywhere for connections and finally found one (a former Microsoft Site Leader who was the family member of one of my esports teammates). I spent hours prepping for the interview and spoke with everyone I knew who would direct me to another person. With the less than 1% interview response, I failed the only interview I could get. I was devastated, but I kept going.\n\nAfter that Microsoft experience, I chose another gaming company. Again, I applied to jobs I knew I was qualified or over-qualified for. This time, I had the Global Media Director of that same company as a referral. Rejected. \n\nNow you can say that it's because I've applied to those large and competitive companies. However, I've gotten rejected as a stocker at Walmart. Even with barista experience, I was rejected by Starbucks even though they said they were, \"Urgently Hiring.\" I've been rejected at a grocery store. You name it. I've tried large companies, remote jobs, local jobs.  It seems I can't get an entry level job, a career choice job, or any type of job. I can't afford being jobless much longer. \n\nHere I am...a malleable, young, and eager graduate with more than average experience and decent connections, unable to find a job. I hope this makes you feel better if you're jobless as well. It's a tough job market even with post Great Resignation.\n\nTLDR; 22 year old with 2 degrees, 3 years internship, 2 years career experience, and 2 viral social medias can't even get a job at a retail store.",
      "subreddit": "jobs",
      "score": 261,
      "url": "https://reddit.com/r/jobs/comments/v6nzyj/why_is_it_so_hard_to_get_a_job_rant/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I think it's because you're looking to join an oversaturated field, and otherwise competitive field.\n\nAnother thing, and this is just my suspicion not based in any form of fact, I don't think all job offerings online are legitimately looking for new hires. Rather they're just skimming for possible replacements in the event they need to fire someone.",
          "score": 284
        },
        {
          "body": "What about smaller to mid-size companies or start-ups? Your TikTok campaign should be helping you get to the interview process if anybody who understands social media metrics gets a glimpse of your resume. \n\nI get that you want to swing for the fences at sector giants like Microsoft, but everybody else is applying for them too. Regardless of how qualified you are, it just means your application has to wow HR/hiring teams even more because of the hundreds (thousands?) of applications they get for each role. The analogy made on these subreddits or LinkedIn is would that company's founder be able to land a role there today? Probably not! Then other FAANG companies that slowed hiring and drop people after they've already been given a start date leaves those employees scrambling for opportunities and other companies wanting to poach them for open roles too.\n\nWhile you could be looking beyond early career opportunities, if you can find a role doing what you want to do and it's specifically marketed for new/recent university grads, apply for it! That could be your best way into a company whereas some of these other roles you'll be competing with entry level applicants, people making a career pivot, lateral moves, etc.\n\nThe job market is still screwed despite employers acting desperate to get people into roles. It took me an extra year or so to finally get the opportunity to move into the industry I wanted for a full-time job. \n\nAfter going through 60+ interviews in the last year and a half, all I can say is this:\n\n1. Employers need to stop being so picky on finding the \"right\" person. They most likely aren't going to spend 25 years in this one role anyway, so why are they vetting candidates like they are going to take them to the wedding ceremony? Has the person demonstrated they can do the work we're asking of them and are they willing to do what it takes to learn about the company/industry to be successful in this role? Do the references confirm what the employee has said during the hiring process? \n2. Employers should focus on improving the overall hiring experience. Let's say I want to work for a particular company, just went through three interviews and didn't get an offer for Team A in the end. If Team B has a job opening with the same title/description come open almost immediately afterward, why should I have to apply for it separately to demonstrate interest? Assuming the interview process for Team A was still favorable, Team B should have access to the application/contact info/previous vetting to see if we are a fit. After all, I already demonstrated interest in the company/industry to get into the process with Team A.\n3. If your company's interview process takes more than three interviews (or I guess the equivalent of two interviews and an on-site process), you're doing it wrong.\n4. Pay people what they are worth. Instead of complaining about brain drain and workers leaving left and right, quit making your employees fight tooth and nail for raises that don't even equate to a cost of living adjustment. While some will be constantly looking for the next thing as far as job opportunities, I'm sure a lot of the workforce would be just as glad to stay put at their employer if they were treated well. This would also be beneficial for job seekers because it would take a number of those applications out of the search process since they're looking for an offer to take back to the current company.",
          "score": 51
        },
        {
          "body": "You really messaged 100+ microsoft employees?",
          "score": 34
        },
        {
          "body": "Make sure you’re using a dumbed down resume for the jobs that don’t need a degree. Barista or stocker?  Just put the coffee experience on the resume plus any other part time work. Put your degrees, but if you interview and they ask about why you might be looking for a Starbucks job when you have x degree, just say you love working with customers and would like to do so while you further your education.  It helps if they think you’re just working on another degree, instead of looking for a job right now with a degree. Hope that makes sense. I have an fine art degree and certifications in creative fields but I’ve never made more than $15 an hour and have only worked daycare, food service, and retail.",
          "score": 14
        },
        {
          "body": "Some of the job ads are fake, some are duplicate",
          "score": 13
        },
        {
          "body": "I’m curious, are you not being contacted in the first place, not getting past HR, or not getting past the interview stage with these companies? If you aren’t being contacted at all, there may be something in your resume that is the issue. Most of these companies use algorithms to sort through their applications. If your resume doesn’t contain the right key words, it literally won’t ever be seen by a person. If the issue is HR or the interview stage, it may be that there is an issue with how you’re coming across on the phone/in person that you aren’t aware of. There are people that you can pay for help with these things, but if you have connections you can also try to have someone mentor you and ask them for their feedback on how you come across and what you can improve to make you a more desirable candidate.\n\nAlso, the truth is you are a young woman looking for jobs in a field that is dominated by men. It’s not right, but you are probably going to have a harder time breaking in because of either overt or subconscious biases against you being a young woman. It’s a fine line to walk of showing confidence without appearing arrogant, since people tend to be heavily biased against arrogant women, but also biased against women that they view as passive or weak.",
          "score": 38
        },
        {
          "body": "Just curious, but what experience level are the jobs you're applying to? I feel like your 2 years of career experience and 3 years of internship, you should be applying to jobs looking for 3 to 5 years of experience, not 0-2. I suspect that and your degree are what turned off Walmart and Starbucks when you applied. \n\nI wish I had advice for you, but I'm in a similar boat with you. My years of working means I should be aiming for higher levels of work, but my actual experience is quite low. I don't know what kind of jobs I should be applying to. \n\nI will say that you should be a bit more selective in applying for jobs. Reading 100+ job announcements, revising your documents accordingly, and then actually submitting them is a lot of time. I get that you're trying to cast a wide net, because it is a numbers game. But I think you should consider your mental as well. So much rejection on top of the stress of job hunting can't be good. I'm not saying that you shouldn't apply when you think you're qualified. But be judicious in how you pick where to expend your time and energy. Good luck, OP.",
          "score": 35
        }
      ]
    },
    {
      "title": "Horrible experience interviewing for Walmart Corporate",
      "body": "I went through 6 Walmart corporate interview rounds.\n \nRound 1: Screening call by peer - passed with flying colors.\n\nRound 2: Case study with HM - she was very impressed, she mentioned that she would do exactly what I recommended and I was very fast at coming to the conclusion and completing the case study which is a very strong positive sign. She also asked me to build a slide-deck for the executive leadership based on the case study she narrated in the interview. Which I did and I think it was well received, because right after that they gave me the final interview.\n\nRound 3: Panel interview - Nailed it\n\nRound 4: was initially told that this would be the final interview with the Group director.\n\nThis was one of the worst interviews of my life.\n\nRed flag 1: Asking me how my spouse feels about me getting tech salaries and him not.\n\nRed flag 2: Opened my LI and questioned me about my current job title saying that it confuses him, right after telling me that he is a very important employee at walmart and that if I look at his org chart he is only 2 levels removed from the CEO and not many VPs get that level of attention let alone other group directors, and because of that his team gets a lot of attention and there is no room for error.\n\nRed flag 3: when I mentioned that I like what Walmart is doing with the grocery business, he boasted that he set up Walmarts grocery business for them. Meanwhile constantly telling me that one needs to be very humble to be on his team.\n\nRed flag 4: When he asked me what I dont like about Walmart - I mentioned that I dont like the online shopping experience sometimes because there are not enough reviews, pictures, enhance content, better together recommendations are not personalized even though the item is 40 percent cheaper at Walmart I ended up buying at Amazon.\n\nHe shared his screen and pulled up the PDPS both at Amazon and Walmart and told me that Walmart does not sell this item and that is why it is not good experience because it is on marketplace. When I pointed out that Amazon also has the listing by a marketplace seller, he said that that is because that is Amazon’s primary business. When I told him that but is that not what Walmart is trying to do as well? (Growing the MP business) He got very defensive and said that lets do a role play situation- he will be the PM and I will be the business owner. I was really thrown off by this proposition, because by this time the environment had already become very standoffish.\n\nI did not do my best in the role play and at ine point he got so mad and shouted at me staying that - “You think we should change the entire ML Algorithm because you cannot find your concealer”\n\nConclusion: I did get 2 additional interviews after the GD round and they went very well. But, needless to say, I did not end up getting the job.\n\nIs this standard interview experience?",
      "subreddit": "interviews",
      "score": 78,
      "url": "https://reddit.com/r/interviews/comments/1myuirn/horrible_experience_interviewing_for_walmart/",
      "comments": [
        {
          "body": "I'm sorry this jackass was the final test in a long list of interviews. That's really awful. On the bright side,it sounds like you dodged a bullet. Who would want to work for that?",
          "score": 27
        },
        {
          "body": "It's always the a-hole executives who have to ruin your chances",
          "score": 33
        },
        {
          "body": "At least you found out he was an asshole during the interview and not after you got the job. I’d say you dodged a MAJOR bullet!",
          "score": 20
        },
        {
          "body": "[deleted]",
          "score": 8
        },
        {
          "body": "I'm sorry you went through that but it sounds like working for that guy would have been pure misery.",
          "score": 6
        },
        {
          "body": "As a former Walmart corporate dude, if you report this to ethics they’ll investigate him for the rudeness. Walmart doesn’t fuck around like that especially at that level.",
          "score": 7
        },
        {
          "body": "He’s the bad cop interview after they take your work for free.",
          "score": 5
        },
        {
          "body": "I mean, it’s Walmart",
          "score": 7
        },
        {
          "body": "Their recommendations engine is garbage, you are 100% correct in this assessment.  I just want you to know that, and sorry you experienced this, but thank you for sharing.",
          "score": 3
        }
      ]
    },
    {
      "title": "First ever Job interview at Walmart",
      "body": "Hey guys. I recently got an email back from Walmart saying that they wanted to have an interview with me. This is my first interview ever so I am quite nervous. I don't really know what to expect so some pointers would be nice. I'm a youth btw so this is my potentially first job",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/j2xgjz/first_ever_job_interview_at_walmart/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "- Research potential interview questions for the position you applied for and review them to figure out your answers.  Write it down and review it often.\n- Also figure out an \"elevator pitch\" to open with.\n- Don't forget to be enthusiastic, smile, and wear a nice/professional outfit.\n- internet stalk the person you'll be interviewing with to see if you could bring up any things you have in common (work it into your conversation if possible but don't force it)\n- if it's in person, print out a few copies of your resume to hand out.  And make sure to know your own resume.\n- be confident and optimistic. You're going to do great :)",
          "score": 1
        }
      ]
    },
    {
      "title": "Are there any special requirements for Walmart Stocking ? + Questions about interview",
      "body": "I want to apply to Walmart for a stocking position but I'm unsure of whether they'll hire me or not. I'm 19 (turning 20). I graduated from homeschool a while ago and have zero experience with much of anything. Only thing I have is that I enjoy organizing products, I love mastering boring, repetitive tasks, and I have a lot of time on my hands. How easy or difficult would it be for me to be hired ? Is there anything I need ? And is there anything I should know about the interview ? I've never had a job and I have anxiety so knowing everything beforehand would help a ton.",
      "subreddit": "jobs",
      "score": 3,
      "url": "https://reddit.com/r/jobs/comments/ez4jkj/are_there_any_special_requirements_for_walmart/",
      "comments": [
        {
          "body": "The job description lists results such as being able to lift a certain amount of weight.",
          "score": 2
        },
        {
          "body": "Can you read? If the answer is yes, you’ll get the job. If you can’t read you’ll prob still get the job. Wal Mart ;)",
          "score": 1
        }
      ]
    },
    {
      "title": "Have a interview at Walmart soon and I am clueless",
      "body": "This is my first job interview as I'm a teen and I am being interviewed for the spot of pharmacist assistant. How would I prepare and anything I should know or touch upon. What would I do if they ask me a question with whats my biggest weakness? Also, How should I dress for an interview of this calibre.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/hp1sz4/have_a_interview_at_walmart_soon_and_i_am_clueless/",
      "comments": [
        {
          "body": "For biggest weakness, mention a weakness unrelated to the role you're interviewing for. That would give you a very safe option!\n\nFor more details I explain this video: [https://youtu.be/7Jri4e1dP7E](https://youtu.be/7Jri4e1dP7E)",
          "score": 2
        },
        {
          "body": "Nice quality videos and thanks for the advice",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview questions for a Senior Product Manager role at Walmart",
      "body": "I've got an interview with the HM for a Senior PM role at Walmart. Does anyone have any suggestions on what sort of questions to expect? Would really appreciate it!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oryvf0/interview_questions_for_a_senior_product_manager/",
      "comments": [
        {
          "body": "Congrats on getting the HM interview, how did it go?   \nI’ve been applying to PM roles at Walmart too, but my applications mostly stay stuck at the ‘Applied’ status. Would you mind if I DM you? I’d love to understand how you approached the application or if there was anything specific you did that helped you get the recruiter call. Totally okay if not, just thought I’d ask",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart/Vizio interview for data engineer",
      "body": "Hello everyone, anyone done interview at Walmart-Vizio for the position of data engineer II, please any insight to help me during the prep process for the interview I will appreciate any help and guidance ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1lyj8mr/walmartvizio_interview_for_data_engineer/",
      "comments": [
        {
          "body": "The Walmart-Vizio data engineer interviews typically focus heavily on SQL optimization, data pipeline architecture, and cloud platforms like Azure or GCP since they're moving away from traditional on-premise systems. You'll likely face technical questions about handling large-scale retail data, ETL processes, and real-time streaming scenarios - think about how you'd process millions of transactions or customer behavior data. They often ask about specific tools like Spark, Kafka, or their preferred data warehousing solutions, so make sure you can speak confidently about distributed computing and data modeling for retail analytics.\n\nThe behavioral portion usually centers around collaboration since you'll be working across multiple teams and dealing with both Walmart's massive scale and Vizio's consumer electronics data. They want to see how you handle ambiguous requirements and can translate business needs into technical solutions. Expect scenario-based questions about data quality issues, system failures, or conflicting stakeholder priorities. I'm on the team that built [interview prep AI](http://interviews.chat), and it's particularly helpful for practicing these kinds of complex technical scenarios where you need to think through data engineering problems out loud and articulate your approach clearly.",
          "score": 1
        }
      ]
    },
    {
      "title": "Please Help: Need of  a Job :( Walmart Karat Interview:  Initial 20 minutes , What to expect and resources?",
      "body": "# Hey everyone,\n\nI'm preparing for a Karat interview that includes a 20-minute section. I know it involves choosing two topics from five options:\n\nI have few specific questions:\n\n* What are the topics covered\n* Any resources for those topics\n* Any tips for preparing for this section\n\n",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1mr83mi/please_help_need_of_a_job_walmart_karat_interview/",
      "comments": [
        {
          "body": "Yeah, the typical topics for Karat often include algorithms, data structures, system design, debugging, and coding exercises. For resources, check out \"Cracking the Coding Interview\" for algorithms, and GitHub repositories for different problems. When prepping, focus on understanding the fundamentals deeply, practice under timed conditions, and familiarize yourself with the types of questions asked. Mock interviews can also be super helpful to simulate the experience.",
          "score": 1
        }
      ]
    },
    {
      "title": "Phone Interview at Walmart Software Engineer III-WMS position",
      "body": "Hello All, I have a 30 mins phone interview with Walmart for Software Engineer 3 tomorrow. I'm not sure what it would include since I got the interview invite through Cora Al assistant and not a recruiter who I can ask questions to. Also, what kind of questions should I expect? It would be awesome if anyone could share their experience.",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1jcewm3/phone_interview_at_walmart_software_engineer/",
      "comments": [
        {
          "body": "They'll likely assess your coding skills, problem-solving abilities, and experience with relevant technologies. Be prepared to discuss your past projects, challenges you've overcome, and how you've contributed to team success. Technical questions might cover data structures, algorithms, and system design, so review these areas beforehand.\n\nGiven the short duration, they may focus on a few key areas rather than a comprehensive assessment. Have concise examples ready to demonstrate your expertise and leadership potential. Be ready to explain why you're interested in Walmart specifically and how you align with their values. If you're unsure about any questions, it's okay to ask for clarification. Stay calm, speak clearly, and showcase your enthusiasm for the role.\n\nIf you want to practice answering tricky interview questions beforehand, you might find [AI mock interview](http://interviews.chat) helpful. I'm on the team that created it, and it's designed to help people prepare for job interviews like this one.",
          "score": 2
        },
        {
          "body": "Are you sure the interview is with an AI recruiter? As far as I know Cora AI is just a assistant for managing your inbox and calendars. It might actually be with the human recruiter itself. Regardless think about a couple of key accomplishments that match to the job description, have a crisp answer for why you want this job and why are you moving from your current job. Be open to a question about salary expectations. Good luck",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart Karat Interview: Applied Software Engineering Section - What to Expect?",
      "body": "Hey everyone,\n\nI'm preparing for a Karat interview that includes a 10-minute Applied Software Engineering Discussion and Analysis section. I know it involves choosing two topics from five options:\n\n1. Production\n2. OOD (Object-Oriented Design)\n3. Test\n4. System Issue (Memory/CPU)\n5. Front-end Web Application\n\nI have two specific questions:\n\n1. Will these questions be automated, or will the Karat interviewer ask them directly?\n2. What's the format of the questions - multiple choice, open-ended, or a mix of both?\n\nIf anyone has gone through this recently, I'd really appreciate any insights on:\n\n* Types of questions asked for each topic\n* How in-depth the questions go\n* Any tips for preparing for this section\n\nThanks in advance for your help!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1k3ymp9/walmart_karat_interview_applied_software/",
      "comments": [
        {
          "body": "We won’t know what Karat is or what it does etc. I suggest you google walmart karat interview and go from there unless someone is able to reply here.",
          "score": 1
        },
        {
          "body": "The Karat interview for Walmart's Applied Software Engineering section is typically conducted by a live interviewer, not automated. They'll ask open-ended questions about the two topics you choose, allowing for a more dynamic discussion. The questions are designed to assess your practical knowledge and problem-solving skills in real-world scenarios.\n\nFor Production, expect questions about deployment strategies, monitoring, and troubleshooting. OOD might involve designing a system or explaining design patterns. Test questions could cover unit testing, integration testing, or test-driven development. System Issue topics often include identifying and resolving performance bottlenecks. Front-end Web Application questions might focus on responsive design, JavaScript frameworks, or accessibility. To prepare, review recent projects you've worked on and be ready to discuss your approach to solving problems in these areas. Focus on explaining your thought process clearly and concisely.\n\nIf you're looking for extra practice with tricky interview questions, I'd recommend checking out [interview AI](http://interviews.chat). It's a tool I helped develop that provides real-time suggestions during online interviews. It might give you some additional confidence going into your Karat interview.",
          "score": 1
        }
      ]
    },
    {
      "title": "I have a interview with Walmart on ML Engineering case study.",
      "body": "I have an interview with Walmart on ML Engineering case study , Orchestration, DAGs - in Real vs Batch processing - can you help me prepare? . like Approaches, sample questions, tips etc.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1jk5y9p/i_have_a_interview_with_walmart_on_ml_engineering/",
      "comments": [
        {
          "body": "Focus on demonstrating your understanding of real-time vs batch processing in machine learning pipelines. Be prepared to discuss the trade-offs between the two approaches, such as latency, resource utilization, and data freshness. You might be asked about specific use cases where real-time processing is crucial (e.g., fraud detection, recommendation systems) versus scenarios where batch processing is more appropriate (e.g., daily sales reports, customer segmentation). Familiarize yourself with popular orchestration tools like Apache Airflow or Kubeflow, and be ready to explain how you'd design DAGs for different ML workflows.\n\nPractice articulating your thought process for designing end-to-end ML pipelines, from data ingestion to model deployment and monitoring. The interviewer may present you with a hypothetical scenario, like optimizing inventory management or predicting customer churn, and ask you to outline an ML solution. Be prepared to discuss data preprocessing, feature engineering, model selection, and evaluation metrics relevant to the problem at hand. If you're looking for extra support in navigating these types of technical interviews, I'd recommend checking out [interview copilot AI](http://interviews.chat). I'm part of the team that developed it, and it's designed to help candidates tackle tricky ML and data science interview questions with confidence.",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart Tech Interview",
      "body": "I had my first round of interview for a Senior PM position 2 days back and today the agency who applied on my behalf called and told me the feedback that interviewers were impressed by me and asked to keep in touch with me. They are busy right now with some internal things and will get back in a couple of weeks. What does that mean?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1jo6kqk/walmart_tech_interview/",
      "comments": []
    },
    {
      "title": "Need advice for clearing Walmart GPM Panel interviews",
      "body": "Hey everyone,\n\nI’ve cleared the first two rounds for a GPM role at Walmart and have my final panel loop next week. The panel includes three interviewers, each focusing on different areas:\n\t•\tTech skills, cross-functional collaboration, and influence\n\t•\tProduct management and user-centric thinking\n\t•\tCommunication and decision-making\n\nI’d love some advice on what to expect and how to prepare for each round.\n\nWill the questions follow an Amazon-style behavioral format, or should I also be ready for technical concepts and product sense discussions?\n\nAny insights would be super helpful—thanks in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1j4mk6k/need_advice_for_clearing_walmart_gpm_panel/",
      "comments": []
    },
    {
      "title": "Interview questions for a principal product manager position at Walmart",
      "body": "I have an upcoming interview for a principal product manager position at Walmart. It will be a first-round interview with a hiring manager. What type of questions does the interviewer usually ask? ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1gqlkit/interview_questions_for_a_principal_product/",
      "comments": [
        {
          "body": "For a Principal Product Manager interview at Walmart, you’ll likely face questions around:\n\n1. **Behavioral:** Leadership and handling conflict (e.g., *\"Tell me about a tough project you led.\"*).\n2. **Strategy:** Roadmapping and metrics (e.g., *\"How do you measure success?\"*).\n3. **Technical:** Data-driven decisions (e.g., *\"How would you diagnose a drop in user engagement?\"*).\n4. **Walmart-specific:** Improving the app or handling competition (e.g., *\"What would you do to enhance the Walmart app experience?\"*).\n\nBy the way when I was prepping for similar interviews, I found an AI tool that analyzes your real-time responses and suggests improvements during mock interviews. It helped me feel more confident and polished. If you’re interested, I can share more about it. Best of luck—you’ve got this!",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart interview ",
      "body": "What the hell is going on in survival job ,I had interview at walmart for stockperson which went fine after my interview around 3 hhrs later I was called by the manager if I am interested for cashier job on which I said yes why not ,now it's over a week still waiting response....what the heck is going on",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1g5v9eu/walmart_interview/",
      "comments": [
        {
          "body": "I understand what you're going through, but it's time to follow up with Walmart. Give them a polite call or email, and ask for an update. This shows you’re still interested and keeps you on their radar.",
          "score": 2
        },
        {
          "body": "So frustrating, waiting like that is the worst!",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview tips for Walmart’s senior analyst role",
      "body": "\nI have an upcoming interview for this role at Walmart and would love to hear from anyone who’s interviewed for a similar position (or this one specifically):\n\nhttps://walmart.wd5.myworkdayjobs.com/en-US/WalmartExternal/job/Senior-Analyst--Process-Improvement--Service-Design-Marketplace_R-2113724\n\nWould really appreciate any tips, insights, or red flags from your own experience—doesn’t matter if you got the offer or not! Just trying to prep as well as I can. 🙏\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1jyomdh/interview_tips_for_walmarts_senior_analyst_role/",
      "comments": [
        {
          "body": "Try to copy/paste the job description on a job interview simulator like [www.simulatedinterview.com](http://www.simulatedinterview.com) so you can practice answering interview questions.",
          "score": 1
        },
        {
          "body": "Expect a mix of technical and business-focused questions. You’ll need to demonstrate strong SQL and Excel skills. Case-style questions are common, where you’ll be asked to analyse problems like sales drops or operational inefficiencies and suggest data-backed solutions. They’ll also test how well you communicate. Expect behavioural questions about past projects, handling incomplete data, or working across teams. To prepare, check out platforms like StrataScratch and LeetCode for SQL and case studies. Use Pramp or Interviewing.io for mock interviews.",
          "score": 1
        },
        {
          "body": "Did you get the job?",
          "score": 1
        }
      ]
    },
    {
      "title": "Seeking Advice: Walmart Senior Software Engineer - AI Interview",
      "body": "Hi everyone,\n\nI recently cleared the Karat round for the Senior Software Engineer - AI role at Walmart and have a technical interview coming up. I’d like more clarity on the overall interview process.\n\nHow many rounds can I expect after this? What kind of questions are typically asked? If anyone has recently gone through the process, I’d really appreciate any insights on the interview format and question types.\n\nThanks in advance!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1isto5k/seeking_advice_walmart_senior_software_engineer/",
      "comments": [
        {
          "body": "hey! i recently helped some folks prep for walmart interviews, heres what to expect:\n\nafter karat, usually 3-4 more rounds:\n\n* coding round: lots of ml/data focused stuff. think data preprocessing, optimization problems. they love asking abt handling large datasets n improving performance. brush up on numpy/pandas!\n* system design: focus on ml systems specifically. like how would u design a recommendation engine that scales or real time fraud detection system. make sure u can talk abt model deployment, monitoring, a/b testing etc\n* behavioral: pretty standard but they dig into ur ml projects. be ready to explain technical decisions u made, how u handled data quality issues, model performance improvements etc\n* sometimes theres a machine learning deep dive round too where they test ur ml fundamentals\n\npro tips:\n\n* explain ur thought process clearly\n* ask clarifying qs abt requirements n constraints\n* focus on practical implementation rather than just theory\n* have examples ready of projects where u improved model performance\n* dont forget to discuss monitoring n maintenance aspects\n\nbtw if ur nervous abt any specific round, theres lots of great coaches out there who've interviewed/worked at walmart. worth doing a mock interview to get specific feedback!\n\nlmk if u need more details, happy to help! :)",
          "score": 2
        },
        {
          "body": "Sent a dm",
          "score": 1
        },
        {
          "body": "You can expect a technical interview focusing on AI and machine learning concepts, algorithms, and problem-solving. This round often includes coding challenges related to AI implementations, data structures, and system design questions specific to AI applications. Be prepared to discuss your experience with AI frameworks, deep learning models, and how you've applied these in real-world projects.\n\nFollowing the technical round, there's usually a behavioral interview with a hiring manager or team lead. They'll assess your soft skills, teamwork abilities, and how you handle complex AI project scenarios. You might also face a system design round where you'll be asked to architect an AI-driven solution for a large-scale problem. Throughout these interviews, showcase your expertise in AI technologies and your ability to apply them in Walmart's retail context. To boost your confidence and preparation, you might find [interview coach AI](http://interviews.chat) helpful. I'm on the team that created it, and it's designed to help candidates navigate tricky AI and technical interview questions.",
          "score": 1
        },
        {
          "body": "Hi i have software engineer gen ai karat interview. Can you share your experience this might be helpful to me",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart SDET Interview",
      "body": "Did anyone get an interview recently which was scheduled by cora? I just got one scheduled. \nAny tips and tricks would be much appreciated in terms of experience, questions related.\n\nThanks",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1jf6guv/walmart_sdet_interview/",
      "comments": [
        {
          "body": "Yes! DM",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart Tech interview",
      "body": "I had my first round of interview for a Senior PM position 2 days back and today the agency who applied on my behalf called and told me the feedback that interviewers were impressed by me and asked to keep in touch with me. They are busy right now with some internal things and will get back in a couple of weeks. What does that mean? ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1jm31md/walmart_tech_interview/",
      "comments": []
    },
    {
      "title": "Phone Interview at Walmart for Software Engineer 3",
      "body": "Update: It was a normal phone interview with a recruiter asking general questions. I was told that she'll forward my resume to the hiring manager for scheduling interviews based on availability.\n\n\nHello All, have a 30 mins phone interview with Walmart for Software Engineer 3 tomorrow. I'm not sure what it would include since I got the interview invite through Cora Al assistant and not a recruiter who I can ask questions to. Can someone please let me know what would be the questions like and if it's gonna be with the bot or an actual person?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1gm3fd8/phone_interview_at_walmart_for_software_engineer_3/",
      "comments": [
        {
          "body": "It’s going to be with an actual recruiter. The call will be to go over your resume and to asset if you’re right for the position. Get ready to answer questions like “Why do you want to work at Walmart?”. Just look over your resume and look over the job requirements and you should be fine.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview Walmart",
      "body": "How many days one should wait or should have hope to hear any response from  walmart after an interview there???",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1g4dhba/interview_walmart/",
      "comments": [
        {
          "body": "I've worked for Walmart twice, and both times I was given a contingent job offer on the spot it took about a week to get my official offer after drug test and back round check came back",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart interview ",
      "body": "I had applied for a job on line titled stock person for Walmart in ontario and within 2 days I was called for an interview which went fine,  the same day when I reached home the manager called me that if I was interested for cashier job on which I told her why not I will do it and will require basic training (in my mind i was thinking  so I can understand the software they use)on which she replied that she will communicate it to floor manager.so was my answer appropriate and what's the possibility  will they hire my.as I m worried as it's tough thez days to find a job that simple too :(",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1g31nyw/walmart_interview/",
      "comments": []
    },
    {
      "title": "Karat interview for Walmart ",
      "body": "Hi All,\n\nNeed help for Karat interview Questions! \n\nBefore you start telling me Karat is a s**t to interview with, I know, I agree with that, but I'm unemployed since last 6 months and need a job. So please let me know if you/ know someone has take it ! 🙏🏻\n\nMain question: \nI've a Karat interview for a mid-level backend developer position- Arkansas. I did well in the first interview with Karat, but I didn't clear it as I had syntax errors in my coding and they asked me to retake. \n\n\nI'm retaking it, and of course I want to clear it. Does anybody here appeared for it recently? What were the discussion questions you were asked from topics like testing, ood, etc. \n\n\nThanks y'all!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1bqt6ny/karat_interview_for_walmart/",
      "comments": [
        {
          "body": "Any update?",
          "score": 1
        },
        {
          "body": "How did it go?",
          "score": 1
        },
        {
          "body": "I am in same situation, I applied for walmart and my interviewer was not great. so decided to redo.",
          "score": 1
        }
      ]
    },
    {
      "title": "Karat Interview: Senior Data Scientist at Walmart",
      "body": "The interview is a Karat assessment, but I am not sure what the live 60-minute coding session would be like.\n\nThe interview is a Karat assessment, but I am not sure what the live 60 minute coding session would be like.\n\nShould I expect standard leetcode medium questions or would it be data science interview questions?\n\nIf you could share any information, that would be very helpful",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/18lprz7/karat_interview_senior_data_scientist_at_walmart/",
      "comments": [
        {
          "body": "Hey  \nI have an upcoming Karat assessment for this position. If you don't mind, can you please share your experience and any tips on how to prepare for this?  \nThanks!",
          "score": 1
        }
      ]
    },
    {
      "title": "Have a job interview soon at walmart and never did a interview in my life",
      "body": "I have a job interview at Walmart soon for a pharmacy assistant and I have never had a job interview as I'm youth. So how should I prepare and anything I should know or do. Also, how would I dress for this?",
      "subreddit": "interviews",
      "score": 9,
      "url": "https://reddit.com/r/interviews/comments/hp1rj9/have_a_job_interview_soon_at_walmart_and_never/",
      "comments": [
        {
          "body": "Before I go to an interview I like to check Glassdoor to see if people have posted the interview questions so that I can prepare more. I always feel more comfortable having an idea of what they’re going to ask me.",
          "score": 5
        },
        {
          "body": "Literally type this into Google:  how to dress for Walmart job interview\n\nBe ready to answer questions like 'why Walmart' - and let it be a genuine reason why you like Walmart, their pharmacy services, or both. Cut through the noise of any BS or negative things people say about the brand and answer with a genuine reason you would want to work there that shows you've done research or something about working there would make you feel good. \n\nBe ready to answer 'why pharmacy assistant' - again, how does this fit into who you are or what you want to do now or in the future. Keep it simple. Doesn't have to be some long 10 years from now narrative. You say you're young so it could simply be that you're considering pharmacy as a career and this would be a great way to learn more while making money. Keep it real. \n\nThey obviously know you've never had a job before from your application. What have you done? Have you volunteered? Have you organized anything? Have you worked as a team through other activities in your life? If yes to any of those questions, what did you learn and how can that help you in a job? Think of it as transferrable skills that no matter what context you are in will help you in the future.",
          "score": 2
        },
        {
          "body": "I know someone that got went through the exact thing you are applying for and he says that what you have to do is suck up to Walmart as a company as much as possible. \n\nMake it seem like you worship the organization and that it’s your literal dream to work there.",
          "score": 2
        },
        {
          "body": "Dress smart. Its better to be overdressed than under dressed for an interview so put on your sunday best and get there early. First impressions can go a long way",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart karat interview",
      "body": "I have Walmart karat interview in a couple of days. Can anyone please help me with the question bank?",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/17azjzo/walmart_karat_interview/",
      "comments": [
        {
          "body": "In the same boat!",
          "score": 1
        },
        {
          "body": "Hey did you find anything?  \nHow was your experience?",
          "score": 1
        },
        {
          "body": "Hey, how did it go guys? I have mine in 2 days",
          "score": 1
        },
        {
          "body": "I did my interview yesterday. Answered all the questions. Solved one coding question but there was not enough time for 2nd one so i told my approach. Interviewer told me its correct.\n\nI am planning to reschedule the interview. But i am getting this message \n\n\"Per Walmart’s interview settings, you do not need to complete a Redo. If you have any questions or feel this is an error, please contact your recruiter.\"\n\nIs this a good sign or i need to speak with recruiter?",
          "score": 1
        }
      ]
    },
    {
      "title": "Walmart Program Manager Interview Experience",
      "body": "Hi All,\n\nMy current job is putting some stress on me and I started to apply else where. I got an interview for a PM with Walmart, anyone have experience? \n\nThanks",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/15igx5l/walmart_program_manager_interview_experience/",
      "comments": [
        {
          "body": "Nope. But I’ll bet ChatGPT does. Try asking some questions there. You’ll be surprised at how well it prepares you",
          "score": 1
        }
      ]
    }
  ]
}