{
  "company": "wayfair",
  "post_count": 41,
  "exported_at": "2026-01-18T17:44:53.316Z",
  "posts": [
    {
      "title": "Anyone interviewed with Wayfair for a Software Engineering Internship?",
      "body": "",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/588swd/anyone_interviewed_with_wayfair_for_a_software/",
      "comments": [
        {
          "body": "I was an intern there this summer and have a return offer for full time.",
          "score": 2
        },
        {
          "body": "I interviewed for a full time position there a few years ago. ",
          "score": 1
        }
      ]
    },
    {
      "title": "How do people get multiple offers at once?",
      "body": "Like how are you lining up all the interviews + getting an offer but sitting on it for so long.  \n  \nedit: guys thank you, but I know how to schedule and talk to people. The issue is HR gets back to you when they feel like it, you can't control if they get back to you. so controlling the timing seems difficult unless you guys are getting more screens than me and your response rate is  alot better.  \n  \nSo are you guys doing way more volume than me. I do about 3-10 applications a day?  \nare you guys more qualified? already have fang on your resume? I have Wayfair and a work gap  \nmore educated? arts major.  \n  \n",
      "subreddit": "cscareerquestions",
      "score": 49,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ip44iq/how_do_people_get_multiple_offers_at_once/",
      "comments": [
        {
          "body": "You know how the top 10 percentage of the men gets 90% of the match on tinder? It’s the same for jobs, although maybe not this extreme",
          "score": 74
        },
        {
          "body": "Schedule full loop interviews close together so you are fresh on your interview prep work for all of them. Ask for time to consider on any offers you get (any reasonable recruiter will ask if there's anything they can do to make your choice easier and agree to a timeline). I had interviews at 3 places and received 2 offers at right around the same time when I accepted my current job.\n\nObviously this really only works if you are getting a bunch of interviews to begin with which feels like it would be more rare in the current job climate. If one job is in the offer stage while another one is just at the first outreach you MIGHT be able to step on the gas for the second one (mention you have an offer so they can accelerate your process) while asking for time on the first one. That is a huge stretch though. Realistically anyone who isn't actively interviewing you when the first offer comes in is out of the running unless the offer is pretty bad and/or you don't mind burning a bridge by leaving for another job a month or two in.",
          "score": 34
        },
        {
          "body": "Treat interviewing like a full time job and it happens",
          "score": 55
        },
        {
          "body": "you don't sit on it for long, written offer typically have 1, maybe 2 weeks of expiry date\n  \n&gt;how are you lining up all the interviews \n  \nwdym \"how\"? you just... do, you schedule a bunch of onsites together this way if you get offer from 1 you broadcast it to all other HRs",
          "score": 54
        },
        {
          "body": "You have to be systematic about it. \n\n\n* track the status of all the applications effectively. I used huntr.co, but anything will do. \n* understand lead times. Some companies can schedule next steps quickly, especially if they are keen to fill the position and you look promising. Others are more bureaucratic. You will have a pretty good impression just by how the first stage scheduling goes. \n* Reserve time every day for interviewing. It's a pain if you're still working, but it is frequently the difference between scheduling a stage for tomorrow or for weeks later.  \n* Try to get a lot of interviewing time in as early as you can, even if they are not your top job choices. Interviewing is a skill, you need practice, and time to get back in the rhythm if you're rusty.  \n* Hand hold recruiters on scheduling. Even though it's their job, not all of them do it well. Provide multiple schedule options when asked. If you need to refuse a schedule immediately respond with alternatives. Be explicit about timezones. If the recruiter didn't offer to use a self-service scheduler like Calendly, you can send yours instead.  \n* when getting to later stages, let companies know that you have other processes advancing and what timeline you expect from them. This is helpful in demonstrating value and getting them to push a bit more to find earlier times.  \n* Prepare standard responses for common questions. No need to make shit up, just think in advance how to frame previous experiences in different contexts. how you provided technical leadership, resolved an internal conflict, went above and beyond for a customer, etc. Also have a formed opinion on developments in your field and what you think is a good way to work. E.g. should every company be doing DevOps, yes/no/why?  \n* when you're getting to offer stage, gauge early how they might be delivered. Be clear in advance that you have multiple processes going and that you have options you need to evaluate well. But also show that you can be convinced with a great offer. Recruiters want to know that you are not using them just to prop yourself up (even if that's exactly what you're doing).",
          "score": 11
        },
        {
          "body": "Eventually if you apply to enough jobs and do enough interview prep, at some point it will click. For me, it clicked by the point I had solved 400 LC questions where I was passing interviews pretty comfortably",
          "score": 10
        },
        {
          "body": "When I was doing it, I had multiple onsites scheduled on the same week / 2 weeks (?)\n\nYou have to schedule your phone screens a few weeks in advance and then schedule the onsites a few weeks after that, piling them up back to back. \n\nThen, if they tell you you have a short deadline to sign, try to negotiate to get more time and tell the other companies you have to move quicker because of the offer",
          "score": 9
        },
        {
          "body": "Decades of experience helps.",
          "score": 6
        }
      ]
    },
    {
      "title": "Did I pigeonhole myself with my first job choice?",
      "body": "I am 33 years old, and I just graduated with a Bachelor's degree from college. I came from a strong design/art background, then decided to change my career to tech. I have been taking a long break for the past few months after I graduated. I am pretty lucky that I got a return offer from the previous place I co-oped, and the job is starting soon. My issue is that I am afraid that my first job isn't \"prestige\" enough, and it might curb my growth. My place of work will be a non-profit, there will be no mentorship, and I will be building small 1\\~5k budget project sites. Heck, I don't even know if I can be considered a web developer because half of my role is teaching other people about design and art. The reason why I want to take this job is because I want a piece of mind. I want to have some income and then look for better opportunities.  \n\nOn the other hand, I am confident in my ability because I've had interviews with EA, Priceline, Chewy, Wayfair, ASICS, and many other companies in the past two years. I have had offers from a handful of them, but didn't go because something always came up. My point is, I don't mind doing more leet code grind to try and find a better entry role, but I would hate companies to filter me out in the future because they think my first role is not web development enough.\n\nSo, should I look for another entry job? Or take the return offer for now? Living expenses aren't really an issue for me, but looking for a new job while having a job is obviously the better choice.\n\n",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1dq5qc2/did_i_pigeonhole_myself_with_my_first_job_choice/",
      "comments": [
        {
          "body": "Take the job.",
          "score": 20
        },
        {
          "body": "Take it.  Your next resume entry have an entry like “Awesome Nonprofit - Web Developer and Design Expert”:\n* Made custom websites for multiple $1-5k sites\n* Managed site administration, setup, and management for multiple clients\n* Utilized my specialized design/art background to make awesome, modern sites\n\nA designer that can code and can manage everything so I don’t have to?  Cool!  It’s all in how you want to spin it.",
          "score": 12
        },
        {
          "body": "A job is a job. Take it and when applying to other places, you frame yourself with all the development parts of that job.",
          "score": 1
        },
        {
          "body": "The only hard part is getting into the jndustry. Once ur in pivoting is easier. But working non industry related roles would hurt you. Take the job and then switch when u can if u want. But dont add resume gaps or add non tech roles if possible",
          "score": 1
        },
        {
          "body": "No, you didn't pigeonhole yourself. \n\nIf anything, I think you did yourself a favor. Prestige counts for nothing. If you're happy with the job you have, that's all that matters.",
          "score": 1
        }
      ]
    },
    {
      "title": "Career Advice: Wayfair SWE Offer vs Potential SpaceX Opportunity",
      "body": "I'm a 20-year old college senior graduating in a month and I need some advice. I've already accepted a Backend SWE 1 role at Wayfair with a total compensation of $125K. However, I'm also in the final onsite interview round for a Full Stack role on the Starlink team at SpaceX.\n\nAt Wayfair, I see a clear path to promotion, potentially reaching SWE 2 and a salary of around $170K within a year. I will be close to family and friends. I will also have minimal living expenses (rent is free - less than $1000 a month for everything else. I also get to WFH on Mondays and Fridays.\n\nOn the other side, SpaceX's role is in Washington, so I'd have to move there. I also have to be in person every day, sometimes even working Saturdays. However, the compensation is higher, ranging from $180K to $200K. I haven’t received an offer yet, but I’m contemplating if it's worth considering, especially adding all the added benefits of staying with Wayfair (close to family, friends, and gf).\n\nGiven these factors, would reneging on Wayfair for SpaceX be a wise move if I get the offer? Any other advice on the situation?\n\n*posting for my friend btw because they don’t have 100 karma to post in the community lol*",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1bpsx5w/career_advice_wayfair_swe_offer_vs_potential/",
      "comments": [
        {
          "body": "Both companies use are notorious for long work hours so choose the one you like more 🤷🏻‍♂️",
          "score": 15
        },
        {
          "body": "Don't count your chickens before they hatch, SpaceX hasn't even extended you an offer yet. IMO it sounds like you want to take the wayfair position but are hoping someone on here can convince you to go to spaceX instead",
          "score": 8
        },
        {
          "body": "money is completely irrelevant at this stage in your career unless you have some personal need of it asap. \n\nIf you can work at spaceX do it. Social proof is the true currency of an early career.",
          "score": 6
        },
        {
          "body": "SpaceX for name recognition",
          "score": 3
        },
        {
          "body": "Lucky! Congrats by the way",
          "score": 1
        },
        {
          "body": "Space x probs has terrible work culture I’d pick Wayfair",
          "score": 1
        }
      ]
    },
    {
      "title": "Questions about Wayfair",
      "body": "Hey all,\n\nI applied for a junior SWE position at Wayfair ([https://www.wayfair.ca/](https://www.wayfair.ca/)) and have a recruiter interv\\*ew coming up. I have a few questions\n\n1. What's the engineering culture there like?\n2. Is there growth opportunity?\n3. Whats the work-life balance like?\n4. What's the interview process there like, do they ask System Design questions and what difficulty of leetcode questions do they ask?  \n\n\nI did see some of the earlier posts about Wayfair in this subreddit but those were from 4-5 years ago and I'm curious if it changed, stayed the same or is worse.  \n\n\nThank you",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/16g8ifa/questions_about_wayfair/",
      "comments": [
        {
          "body": "&gt;What's the engineering culture there like?\n\nAsk the SWEs that interviewer you. If you are looking for specific things then ask about those things.\n\n&amp;#x200B;\n\n&gt;Is there growth opportunity?\n\nAsk the SWEs that interviewer you. \n\n&amp;#x200B;\n\n&gt;What's the work-life balance like?\n\nAsk the SWEs that interviewer you.\n\n&amp;#x200B;\n\n&gt;What's the interview process there like, do they ask System Design questions and what difficulty of leetcode questions do they ask?\n\nAsk the recruiter you are talking to.  It's literally their job to make sure you understand the process.",
          "score": -1
        }
      ]
    },
    {
      "title": "Wwyd?",
      "body": "Sr SDE\n\n10 yoe\n\nI started in 2016 as a hardware engineer and then pivoted to Software after so much hardwork - I did a second masters while working to be able to get there. I rejected Microsoft's low-ball offer to take up Wayfair offer in 2022 only to get laid off within months because the job market crashed. Been working at another mediocre company with a lower pay since then and I low-key hate it. I'm tired of interviewing, clueless on the job situation or how to get calls. I have no idea how to get a job at this point. \n\nMy team pivoted from java to a weird power platform internal AI tool building that no one is using and layoffs / product shutdown seems imminent. I've had recruiters message me so much before 2024 but it has just stopped. I do not have much in savings and I'm very pessimistic about the future of my career and full of regret atm.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1qfow5t/wwyd/",
      "comments": [
        {
          "body": "3 yoe experience here so take it for what its worth but i would save up as much as possible, and just start applying WHILE you have a job",
          "score": 2
        }
      ]
    },
    {
      "title": "Daily Chat Thread - September 03, 2020",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/ilong4/daily_chat_thread_september_03_2020/",
      "comments": [
        {
          "body": "I quit my hardware engineering job (verification engineer) almost 8 months back. Spend the time LCoding and System design studying and now looking for a job as a SDE. I have a Masters Degree in Computer Engineering but I feel my background in Hardware Verification may not land me even an interview. (I have applied to some companies so far but havent heard back from them)\n\nIs this a bad time to career change ?",
          "score": 1
        },
        {
          "body": "What is better - having my high school honors on my Resume or adding in another project? Tomorrow I'm going to be doing a hackathon and I'm not sure if I should add that in. On the other hand too, the honors I have received were all computer science based honors as well.\n\n&amp;#x200B;\n\nFor reference, I'm a sophomore at university right now",
          "score": 1
        }
      ]
    },
    {
      "title": "Transitioning from full time to contracting a bad idea? - Advice appreciated (Boston)",
      "body": "Hi all,\n\nI've been working as a SWE in Boston at what I'd describe as an average company in terms of both pay (116k TC) and how interesting the work is, for almost 2 years now. This is my first job out of college and for a while now I've been wanting to move on.\n\nFor the past 6 months I've been putting some effort into grinding LC and sending out applications but have been struggling to even get an interview. Recently, after a short series of interviews through a consulting company, I've been presented with an offer to work as a contractor for Wayfair. \n\nThere's quite a few downsides to this arrangement, the main one being that the contract is only for 6 months with a \"50/50 chance of getting a 6 month extension after that\", and getting a full time offer is far from guaranteed as it depends on my performance and whether an opening is available (according to the hiring manager at Wayfair). Also, being a contractor means there'll be a middle man company that takes a part of the pay and I wouldn't get benefits such as RSUs or even PTO (only sick days and unpaid time off). \n\nIn terms of compensation, it's higher per hour (adds up to 130k), but accounting for unpaid time off and higher health insurance deductibles, it roughly ends up being the same as my current TC.\n\nAll these things make me very hesitant to accept. But on the other hand, the thought of getting to work at a recognizable company on tasks that from what I learned in the interviews seem interesting to me is exciting. Ideally I'd be able to convert to full time or at least strengthen my resume by having Wayfair on it so that I can have better luck in future job applications. With that being said, I'm aware of the current state of the market, and that only 6 months at a company might not carry much weight in terms of resume building.\n\nWorst case scenario I have enough savings to pull through more than 6 months of unemployment. Though the contracting company says they will try to put me somewhere else after the Wayfair contract ends.\n\nI would appreciate insight from anyone as I'm very much torn on this. On one hand this seems like a terrible idea, but on the other I can't help but be somewhat excited.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/1bgx12e/transitioning_from_full_time_to_contracting_a_bad/",
      "comments": [
        {
          "body": "Seems like a terrible idea",
          "score": 4
        },
        {
          "body": "I was contracting for a while. I would only recommend it as a solution to get out of a really bad situation. My contract ended and they didn't renew. I wasn't the only one who was not renewed. I highly don't recommend.",
          "score": 3
        },
        {
          "body": "Once contracting is on your work history you can expect employers to peg you as a guy who couldn't get hired, and it may have been true, but it can also become self-fulfilling.\n\nI wouldn't suggest taking a contract to get your \"foot in the door' when the company has made no suggestion that there is a door.",
          "score": 3
        },
        {
          "body": "Wayfair [just had layoffs](https://www.usatoday.com/story/money/2024/01/19/wayfair-layoffs-2024/72280132007/). They also had layoffs [in 2022 and 2023](https://www.reuters.com/business/retail-consumer/wayfair-cut-1650-jobs-2024-01-19/). I would be wary of working for them as a contractor at the moment.",
          "score": 3
        },
        {
          "body": "Contracting can pay way more and be a lot of fun when you're doing c2c contracts. As you'd have your own LLC and what not. \n\nBut it's hard and can be hard to keep the momentum going unless you get some really solid long term contracts \n\nW2 is just safer and easier to get",
          "score": 2
        },
        {
          "body": "I did something similar. I was at a consulting company, and I got a position doing contracting for a fairly large name company. I have mixed feelings on it. One reason I left my previous company is I didn't have much faith in the general job stability there. There were layoffs and a lack of work, so a lot of bad signs. \n\nI did get a pay bump, so that was nice. I don't enjoy lacking PTO, though. I don't get paid for holidays, etc, so that's annoying. The whole chance to renew is a big crapshoot, and what you'll be working on is also a risk. I was somewhat misled on the work I'd be doing. There were some discussions with the contracting company management and client management about role, etc, but there were a lot of delays mostly by the contracting company. One word of warning I'd give is about your actual contracting company itself. It might be full of idiots. The group I was working with had some competent devs, but the management was a joke. This is somewhat related to my comment about my role. None of this is unique to contracting, though. \n\nIf your current position is bearable, I'd be tempted to stay longer and look for something better. I've interacted with some full-time employees who were converted from a contractor, so it's not impossible. The other question is if you can get some concrete info about the tech stack you'll work on. One reason I switched was because I was going to get experience with some tech stacks I was really interested in. You should try as best as you can to figure out the tech stack and also the level of responsibility you'll have. Also, learn if you'll be working with full-time employees or working with a contractor team. \n\nFWIW, I am working at a place that also did layoffs before I joined. For whatever reason, I have it in my head that Wayfair might not be that stable (I know they've done layoffs). \n\nSorry, wish I could give an definitive opinion. I don't think taking the position is a mistake, necessarily, but tempted to say you could do better, especially if you're current company is stable and your current position is somewhat decent.",
          "score": 2
        }
      ]
    },
    {
      "title": "Your thoughts on Wayfair",
      "body": "I have been contacted by a recruiter for a FTE remote job as a senior engineer at Wayfair.\n\nI have a very stable and enjoyable job now.\n\nI am only considering leaving for pay and to work remotely. (They claim they can meet my “make me leave” salary request).\n\nAt this point the recruiter is sending me in for an interview. Assuming I pass the interview, I will strongly consider accepting the position.\n\nPlease tell my why I should NOT take a job at Wayfair.\n\nThanks!",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/pkjp57/your_thoughts_on_wayfair/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 3
        },
        {
          "body": "I have dev friends who currently work there or formerly worked there, different levels of exp and they're all leaving or looking to leave en masse. They do not have kind things to say about management or the engineering practices there. I think the seniors are allowed to WFH and anyone lower are sol. \n\nNot shocked that they're throwing money to new hires because alot of teams are working at half capacity. I also know people who work outside of dev in other deps and they can't wait to leave either.\n\nThe only nice thing I hear about WF is that the discounts are nice and that's just about it.",
          "score": 3
        },
        {
          "body": "Engineering (like everyone everywhere) is having lots of turnover due to the end of pandemic. People put off job changes for 18 months, now people are all moving at once. Especially given the stock’s performance, plenty of folks are cashing out and moving on.\n\nWayfair has followed the Minimum Viable Product engineering philosophy since inception. As a fast-growing company, this made sense. Why chase perfection if the product will be out of date in six months? As a result, many tangential systems are held together with duct tape and bubble gum.\n\nThe company hired a new CTO in 2020, unintentionally coinciding with the pandemic. His new mandate has been to impose order on what’s now a fortune 200 company.\n\nIf you want a scrappy start up feel, this job is not for you. If you’re looking to get in on the early stages of a mature Amazon/Microsoft/Google, then the job is for you. \n\nThe company has gone through several iterations of business philosophies, and consequently performance management programs. The pace of those changes slows as a company matures, but causes some whiplash if a company grows through phases quickly. Understand that the types of people who would be successful at a smaller startup are not the same people who would be successful at a major corporation. Wayfair went from the former to the later in less than 5 years, meaning several folks who were good in the beginning found themselves floundering a few years later.",
          "score": 1
        },
        {
          "body": "Just got contacted myself. I was hearing bad things. Also wanna know what’s real up there.",
          "score": 1
        }
      ]
    },
    {
      "title": "Applying to jobs out of state. Trying to move to Boston. Mid-Level Software Engineer",
      "body": "Hey guys,\n\nI know this isn't the first thread about this so I am just trying to check if anyone has any additional ideas. Currently, I live in Philadelphia and have been working for Lockheed Martin the past 4.5 years working in .Net, c#, jquery, JS, Oracle, SOAP web services for transactions. My Fiance and I are getting married in Rye, NH and I am looking to move to the Boston area long term. I am just trying to figure out which companies would even interview me since I live out of state. I've had a coding challenge for HubSpot and interviewed with LogMeIn but no luck so far. I've also applied for the bigger places such as TripAdvisor, VistaPrint, and WayFair but haven't heard back for about a month. I also know those places are in demand and with MIT, Harvard, and other top end schools they might not care about someone being in Philly and say well we have enough talented people in the area. LogMeIn was telling me how engineering jobs in Boston go fast and once I am in Boston it's a lot easier to network. I've also tried reaching out to a recruiter on LinkedIn for CarGurus and TripAdvisor but haven't gotten a response from them. So if anyone has any tips of knows of companies to apply to please let me know. I know there is a large startup presence. I've also been trying to use bostontechguide.com to keep up on companies in that area.\n",
      "subreddit": "cscareerquestions",
      "score": 15,
      "url": "https://reddit.com/r/cscareerquestions/comments/4ktyyw/applying_to_jobs_out_of_state_trying_to_move_to/",
      "comments": [
        {
          "body": "I work at TripAdvisor as a PM - send me your resume and some info about yourself, and I can put in an internal referral for you.",
          "score": 17
        },
        {
          "body": "If you want to stay in defense contracting, raytheon has a massive presence in the area, Lincoln labs, drapper labs, plus a ton of smaller/less known places as well like L3 systems, tektron, irobot.\n\nBest thing to do is just get your resume on as many job board sites as you can and just do a search.  There are a ton of smaller companies around.  There is a ton of biomedical so the jobs might not be with traditional company.\n\nOther companies  that I know that are in the area, Dassault Systemes, The Mathworks, Care.com, Constant Contact (just did a merger so that might have been shaken up a bit), Meditech, Google, Facebook, zipcar, samsung pay, ge (they are moving hq to boston but they have other offices), think robotics, amazon, crap load of banks like state street.  Just to name a few.",
          "score": 5
        },
        {
          "body": "General dynamics information technology is In needham, and solidus does the online learning courses in lexington, so far as def. Contractors go. \n\nAlso, plenty raytheon work here. Big four offices too.\n\nAlso, for kicks, gice athenahealth a try. It's php but I hear it pays well and should get you in the area...also try intersystems. ",
          "score": 2
        },
        {
          "body": "If you want to look at slightly smaller companies, NaviNet write software to work with health insurance data, and Cayan write software for processing payments, both good Boston companies.",
          "score": 1
        },
        {
          "body": "How good are you at math? The company where I work is looking to hire a data scientist in our Boston office.",
          "score": 1
        }
      ]
    },
    {
      "title": "I got lucky guys",
      "body": "I landed my first internship at a Fortune 100 in Boston for 40/hr. The pay is perhaps not as great as OTHERS HERE expect, but as an international student and applying to internships for the first time, I feel so thankful (not to anything in particular, just a sense of gratitude). I applied to 15 internships, heard back from 3, failed the coding assessment for 1 of these and landed further interviews for the other 2. Ultimately got an offer from 1 of the 2. Also I left my resume in the Grace Hopper database and got contacted by eBay, LinkedIn, Wayfair, SAS for coding assessments. Failed 2 and passed 2, but I ghosted them after I accepted the offer from HubSpot because I got too busy with 21 credits and 2 research jobs. All's well, I just hope they don't somehow track applicants who have ghosted them to avenge this in the future.",
      "subreddit": "cscareerquestions",
      "score": 9,
      "url": "https://reddit.com/r/cscareerquestions/comments/dsnktr/i_got_lucky_guys/",
      "comments": [
        {
          "body": "40/hr is really really good pay for an internship lol, the internship I had last summer was 15/hr. \n\ncongrats for landing an internship!",
          "score": 19
        },
        {
          "body": "$40/hour is good pay for an internship.",
          "score": 5
        },
        {
          "body": "Time for Happy Meals!  lol",
          "score": 3
        },
        {
          "body": "You got lucky no fucking shit",
          "score": 3
        },
        {
          "body": "Just failed the HubSpot coding assessment so there's that.... Really need that pay and experience",
          "score": 2
        }
      ]
    },
    {
      "title": "How to determine if a company actually has work/life balance?",
      "body": "Hi all,\n\nI'm an SDE currently employed but interviewing with a bunch of companies right now (all in early stages), looking for the next step. \n\nI consider myself to be a very hard-working and reliable team member, and often times, if I feel as though I need to, I'll put in extra hours here and there to make sure something gets done/gets the polish it needs. But that's by my choice. I'm also a husband and father and I take those boundaries with my time pretty seriously.\n\nTwo of the places I'm interviewing -- Amazon and Wayfair -- have tons of poor reviews about W/L balance and stress, etc. But then they also have many who claim it's great. The number one concern about my next position is going somewhere that doesn't respect my time, expects me to work on the weekends or until 9pm every night, sends me emails or chats at 11pm, etc. That kind of stress is just absolutely not worth the prestige of working at a big N or the compensation that comes with it, to me. \n\nIs there a way to know? Are there red flags? Am I being unrealistic in wanting to work somewhere like Amazon and expecting to work only 40 hours and unplug at 5 pm every day?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/lvn6yb/how_to_determine_if_a_company_actually_has/",
      "comments": [
        {
          "body": "Having never worked there, I would say it is fairly unlikely you would always be able to only work 40 hours. Most teams have oncall shifts. That said, if you want most weeks to be 40 hours that is an org by org thing largely, and mananger by manager thing to some extent. Get connected via friends to find out the orgs to avoid.",
          "score": 2
        },
        {
          "body": "I would recommend just straight up asking the hiring manager.  If you have already finished your interviews, I'm sure the recruiter can set up an informal call with the hiring manager where you can ask questions like that.\n\nBetter to be up front about what you want so no one is going into it with mismatched expectations.\n\nIf you are wary of saying what you want, a good way to broach the subject is to ask what their schedule during a typical work week is like, how much PTO do they typically take in a year, etc.",
          "score": 1
        }
      ]
    },
    {
      "title": "Seeking advice on what to join. (prop trading vs Wayfair) (a lot of caveats, please read everything).",
      "body": "Hello, everyone. I am currently a master's student in Computer Science at a normal-ish state university. I will be graduating in a month and I have two offers at hand right now. One is a prop trading shop in Chicago which pays okay (90k, 13k Bonus, 5k Joining) and the other is Wayfair ( 105K, 11K bonus, 7.5K joining) (Labs Program as of now). I have had interviews with other places in the trading industry, even from the best, think Jane Street, TowerResearch Capital, DRW, Citadel, HRT...(reached onsites for all, except HRT)  but fucked up in small parts in all of them because of which I have been really tough on myself and still couldn't get through it (Idk, my interviewing skill might be a big-big problem). My main focus as far as languages go are C++ an Python and I would love to build a  career in the trading/finance side. The offer from Chicago is for  Junior Developer, and one other concern is that they are putting in a non-compete for a year. From what I have seen in my job search, I do not get calls from tech companies a lot (I got just 2) and now if I sign a non-compete, I will be stuck. But I do not think Wayfair is so much better as well because I have heard terrible things about it ([Wayfair review](https://www.teamblind.com/article/Technical-incompetence-at-Wayfair----is-there-anything-worse-43wn8iLT)) and I do NOT want to build a career in web development as of now (I dont know which team I will get because I am in the labs program rn). I am thinking something like taking the Wayfair offer and then applying to these trading companies again, but I am not sure if they will want to interview me again (partly because I will have graduated and I dont know if I could apply to new graduate applications then and also because then my internship will be the only experience I have with C++). This is making it really hard for me to make a decision and I try to blame myself for making those small mistakes in all the interviews. I genuinely do not know what to do here. Can anybody workin in trading or someone who works in the tech side with C++ give me a way out or give some advice on what can be done in this scenario? The thing is, I do not care so much about money, but I do have bills to pay and a HUGE debt that I need to clear fast, which makes a decision not that easy for me.\n\n&amp;#x200B;\n\nThanks.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/bc4oks/seeking_advice_on_what_to_join_prop_trading_vs/",
      "comments": [
        {
          "body": "Which city is your Wayfair offer in?",
          "score": 1
        },
        {
          "body": "I work in the field myself.To be valid, Not Compete agreement have to be very restricted; they can't prevent you to work in the field, specially if not paid.Also, these agreement are often for more senior people.\n\nAlso, it doesn't matter what agreement you sign, if its unenforceable, you cant sign away that fact.\n\nWhen you leave, the employer decides how long they want to enforce if(they may also say you don't have to do any length of time) and will decide on compensation that time.",
          "score": 1
        }
      ]
    },
    {
      "title": "Wayfair Labs?",
      "body": "I'm completing the final portion of the Wayfair Labs interview process (screen, coding challenge, behavioral interview, technical interview) and I wanted to see if anyone on here could tell me about the position and how the last portion works. \n\nInterested in info about:\n\nPay, Interview, Job culture, work/life balance, really anything that you guys know.",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/a5m1js/wayfair_labs/",
      "comments": [
        {
          "body": "I recently accepted with them in their Boston HQ a few weeks ago! From my interview process I really enjoyed what they had to share about the company culture and I've heard that the Labs program has gotten a lot better. 100k + 7.5k signing bonus as a new grad which was higher what I was expecting based on what I've researched online as well as Glassdoor. ",
          "score": 2
        },
        {
          "body": "[deleted]",
          "score": 1
        }
      ]
    },
    {
      "title": "Wayfair comp and negotiations",
      "body": "Hi all - wanted to ask for tips from people here who have had offers from wayfair. I am currently being considered for a position as a manager, business intelligence within a org there (L3 they said ) . Now my experience has been that once they make an offer , you go into a negotiation call. However in this case , the recruiter spoke regarding comp expectations right after the interview . She/he also mentioned a lower pay scale than what I had seen online from sources , but mentioned that the pay for an L3 (manager level) also varies a lot between various teams, and she was trying to negotiate for the cap for me and significant joining bonus to increase cash flow for the first year. I wanted to know:\n1) am I being played that there are different salary ranges for different teams in wayfair .?\n2) what can I leverage to increase my base pay if there is a cap on that ? Since that seems a bit low for the Boston area and I need more \nI am just a bit cautious as they may have other candidates settling for less dollars but at same time I don’t want to sell myself short. \nThere will be equity and a decent yearly bonus , but what ways could I negotiate for a better base salary because I am sure they can create some wiggle room\n\nThanks !",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/dhh835/wayfair_comp_and_negotiations/",
      "comments": [
        {
          "body": "Doesn’t Wayfair sell merchandise to ICE concentration camps",
          "score": 0
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Left full time software eng in 2017, how to stop feeling like companies are wasting my time with the ridiculous online challenges?",
      "body": "So I quit working as a software engineer in 2017 after 2 years at a Wayfair. It wasn't anything about disliking the job, but more exploring an alternate career. I haven't had any employment gaps, but I do get questioned on why I haven't been in a full time software role since then (nothing surprising, I'd also be curious as an employer). Every few months I do about a month of intense job hunting and then decide there just aren't enough openings. To be fair, it's a pandemic and so I think saying significantly less hiring happening is an accurate statement.\n\nIt definitely wasn't like this when I was applying in 2015 for jobs. I'm very used to the whole apply to 10,000 jobs since all it takes is a click basically and you have to spam to hope to get a few responses.\n\nWhat I'm finding myself increasingly frustrated with is the length of the coding challenges and how they ask me to do multiple of them. I have a salaried position currently, but I also do freelance work (for all the people who say more hours doesn't mean you can't make more money). I do actually feel like they're wasting my time because so much of the coding challenges don't seem that applicable after having worked full time at a tech company.\n&gt; For instance, I've worked with multiple ides/compilers that don't tell me what version of a language I'm working with and then throw errors that I assume or language version related since they say method not found, etc.\n\nWhen I went through hiring processes in 2015 (obviously a long time ago), the coding challenge was done live over the phone and shared screen and I could ask about languages, silly syntax errors, etc. They were doing the useful thing and wanted to see my thought process and not my proficiency in syntax in an unknown version of a random language.\n\nI've done the challenges on hired, scored high, and don't get asked to do ridiculous challenges, but also I get no interview requests so...yeah\n\nI'm not jobless and can afford to, so should I just postpone this until post pandemic times? That was my initial plan in April.\n\nDo companies no longer trust my job experience? I went straight into another job so it wasn't like I was fired and have a huge gap. Anyone who has done hiring, how much of a negative is my time outside of engineering and how can I balance that out?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/kivegg/left_full_time_software_eng_in_2017_how_to_stop/",
      "comments": [
        {
          "body": "You have to look at this from the perspective of a company looking for a new engineer. There are hundreds of candidates. Half of them can’t code their way through fizzbuzz. How much time do they spend on each one?\n\nThe time of the interviewers are valuable, much more valuable than your time, which they aren’t paying for. Much more valuable than the time of the guys who can’t do fizzbuzz. So how much time do they spend? As little as possible to get the outcome they want. The outcome they want is to find one engineer at a particular level of skill. \n\nThe fastest(cheapest) way to weed out all the losers is a quick resume scan and an automated test. If there is a gap in your resume, does that mean you weren’t that good? Does it mean you didn’t like it? Either of which could be a red flag. Regardless of if either of those things is true, the guy reading the resumes might be thinking it and just throw out your resume right away. If they have a stack of 35 resumes, do they need yours? No. Will that reject some competent programmers? Yes. Does that matter if there are many more behind him that will meet the mark? No.\n\nAt the beginning of the funnel, you are completely insignificant. A drop in a bucket full of incompetence and spam. Once you prove to them that you are at a certain level, then you will start getting treated like a human.\n\nMy advice to you is to get in touch with a headhunter (hiring agency) that specializes in tech. There are a ton of them, and they will get you through the door. When I interviewed people for a dev role, all of my candidates came from those kinds of places.  They make it easier for you and for the company hiring you. They will probably give you a test as well, but they make money if you are hired, so they are much more incentivized to get you a job than the company hiring you.",
          "score": 5
        },
        {
          "body": "Three or more years of a gap is more than enough for your skills to fully atrophy if you've done nothing related to software. Not to say yours have, but I would he surprised if many employers trusted your 2017 experience without some sort of test or portfolio screen. This is doubly true if your skills are front end, data eng, ML, or devops since the last three years have seen meteoric changes to those specialties and you'd probably be learning a lot from scratch.\n\nThe pandemic certainly doesn't help since the amount of senior engineers getting laid off and applying for the same jobs you are right now is higher than it has been in a long while. However, coding challenges will likely be the norm for a lot of jobs for some time, and the longer you go without a software job the more likely you're going to need to prove yourself with something like that even as more companies start to see reductions in their application rate.\n\nKind of a catch 22 for you, unfortunately.\n\nOf course not every company does a coding challenge. Non tech companies, for example, are more likely to use old school hiring practices.",
          "score": 6
        },
        {
          "body": "CS is much, much more saturated now compared to 2015. Where previously a company couldn't put candidates through too much shit because there weren't enough to go around, now they can basically do what they like to you and still get plenty of good candidates willing to run the gauntlet.",
          "score": 3
        }
      ]
    },
    {
      "title": "Worried about getting a summer internship, need advice.",
      "body": "Alright, firstly I understand that this sounds rather unpleasant but recently I had interviews with Wayfair and Bloomberg (Was able to solve just one question), both of which I didn't do well in. \n\nNow, since I am extremely stupid, I didn't apply much as I thought I will make some changes, which I did now and started applying again. \n\nDo you guys think it is too late for getting a good internship let alone Spring co-op? I mean in terms of even getting the coding challenges, I am really worried that I won't even get them now. (for some reason Amazon never really sends me any too.) \nIf you guys have any suggestions, please let me know, in terms of which companies I should apply to or anything else in general. Trying to solve more leetcode problems in the meantime to get better at it.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/dtazyh/worried_about_getting_a_summer_internship_need/",
      "comments": [
        {
          "body": "Spring co-OP? That chance has come and gone, summer internship? Totally possible. Theres a second round of internship postings in january",
          "score": 2
        },
        {
          "body": "I just finished my interview process with Amazon yesterday, and I have to say it is hard but pretty doable. With Amazon, just keep applying and hope that they reach out. Meanwhile brush up with Leetcode.\n\nTake advantage of resources in your school (coaches, mentors, alumnis, etc), practice a s\\*\\*t ton of leetcode medium/hard. Build up your resume/linkedin/github. It is definitely possible to get an internship for the summer, and I wish you good luck!",
          "score": 2
        }
      ]
    },
    {
      "title": "IBM Aspera VS Wayfair Pricing for a new grad?",
      "body": "Hello awesome people!\n\nPlease give your inputs and help me make a decision between these offers.\n\nA little bit about me-\n\n1. International student with MS CS degree from a SUNY university\n2. Not too good at coding because I have switched careers only through Masters. I did not have CS background.\n3. Pretty comfortable in python because my internship, assistantship and coursework projects were in python\n4. Intends to prepare more and interview with BigN companies next year. I already interviewed with most of them and did not clear onsite. But they went okay that I believe I can definitely get an interview next year if I contact the recruiter. \n5. Wayfair is offering 110k base+5k joining bonus for boston, IBM Aspera 130k base and 10k joining bonus for california. After taxes and living expenses, I think it is about the same.\n\nWayfair-\n\nPros:\n\n1. Work will be in Python. So I can focus on building logics and implementing algorithms rather than learning the syntax of a new language.\n2. I heard that the work in this team is good. not sure how true.\n3. Moderate pace.\n\nCons:\n\n1. No job security. I read a lot of bad reviews on glassdoor about the ruthless firing policies of Wayfair. I read on team blind that it's not happening much now and that it is totally performance dependant. But again, I'm not too confident about my coding skills.\n\nIBM Aspera-\n\nPros-\n\n1. Bay area! More calls in future\n2. Slow pace (I think). It could help me give more time to do leetcode and pick up skills on work\n\nCons-\n\n1. I will be coding in Ruby. Will need to learn the syntax of new language at work while doing leetcode in python at home. Could be confusing and challenging initially. Ruby is similar to python, so may not be difficult to learn ruby.\n2. Not sure if the work is interesting. I might have to work on front end in future. I'm not interested in front end. But this is after 6 months or more. Not immediately\n3. Not sure how ruby on my resume will affect my future applications.\n\n&amp;#x200B;\n\nI'm a reasonably smart person who is moderately hard working. It may not be difficult for me to pick up new skills but working in python will help me get a headstart and I love python. But I'm not quite confident about my coding skills that I can be confident that I won't be fired at Wayfair. I would definitely want to switch in an year no matter which one I choose.\n\n&amp;#x200B;\n\nPlease advise.\n\n&amp;#x200B;",
      "subreddit": "cscareerquestions",
      "score": 3,
      "url": "https://reddit.com/r/cscareerquestions/comments/axsp8y/ibm_aspera_vs_wayfair_pricing_for_a_new_grad/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Does Wayfair Labs Reject Final Round Applicants Over the Phone?",
      "body": "Tomorrow, I get my phone call from Wayfair Labs telling me whether or not I got into their fairly well paying program for new grads. I've had multiple people tell me that the phone call is a good sign since many companies, even past the final interview stage, turn people down via email or just ghost them. But I've heard of companies who call you at this stage to tell you no.\n\nDoes anyone know whether Wayfair Labs rejects you via phone call at the final stage, or do they only call about extending an offer? I had my final interview yesterday and am hearing the result tomorrow, so this should be a short two day response time.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/bmd3d7/does_wayfair_labs_reject_final_round_applicants/",
      "comments": [
        {
          "body": "I don't see why any company would tell you over the phone it allows them to make a mistake. I would bet 95% of the time the very next thing would be \"why was I rejected?\". No company wants to deal with some HR person fucking up and saying because of X.",
          "score": 3
        },
        {
          "body": "@MyCSAnon So what was it about? What's their strategy in this?\n\nI'm in a similar position for tomorrow and very nervous!",
          "score": 1
        }
      ]
    },
    {
      "title": "Wayfair lab information?",
      "body": "I've heard something bad about wayfair lab online, saying they would kick off people without reason. The interviewer told me that it is 100% placed to a team. Anyone knows the recent situation of this lab program? Thanks!!!!!!",
      "subreddit": "cscareerquestions",
      "score": 5,
      "url": "https://reddit.com/r/cscareerquestions/comments/bjsrad/wayfair_lab_information/",
      "comments": [
        {
          "body": "https://www.reddit.com/r/cscareerquestions/comments/b3hnmy/wayfair_name_and_shame_ft_blind/\n\n\nhttps://www.reddit.com/r/cscareerquestions/comments/axcd72/wayfair_labs_layoffs/\n\ni think you have bigger things to worry about",
          "score": 4
        },
        {
          "body": "Glassdoor reviews seem pretty negative on Wayfair labs specifically. I had an onsite with Wayfair recently. Seems to have a nice culture, growing very rapidly (I think they said they doubled from 6.5k to 13k in just a year), and is located in the heart of Boston. But their \"labs\" doesn't seem to be that great.",
          "score": 2
        }
      ]
    },
    {
      "title": "Questions about Wayfair Labs",
      "body": "Has anyone had experience interviewing for or working at Wayfair or Wayfair Labs? How did it work out?\n\nI'm in the process of completing a final round, culture interview over the phone -- what should I expect?",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/5jnvho/questions_about_wayfair_labs/",
      "comments": [
        {
          "body": "Hey there!  While I didn't go through Wayfair Labs myself, I have a friend that did.  It is basically a 3 month training program to learn enterprise software development.\n\nThe key takeaway is that you are NOT guaranteed a full time job when the 3 months is up.  You then have to interview with development teams in the company and if they don't like you, then you're out of a job.  Luckily, my friend was placed onto a team but he said there were quite a few people that ended up jobless after the Labs period.\n\nHe really enjoys it there, but you'll need to work hard and be a strong developer to get placed.",
          "score": 1
        },
        {
          "body": "I haven't went through labs, but I was an intern and got a return offer so feel free to ask me anything ",
          "score": 1
        }
      ]
    },
    {
      "title": "Data platform engineer at Wayfair?",
      "body": "Has anyone had experience with interviewing for a Data Platform engineering position with Wayfair at their Boston office? I’m on their second round of interviews and was wondering if anyone has any advice. What sort of things could I expect to be asked in a python interview with them?",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/ds62rh/data_platform_engineer_at_wayfair/",
      "comments": []
    },
    {
      "title": "Wayfair Post Interview",
      "body": "If anyone has had experience with this…how long did it take for you to get an offer or rejection after an interview? I’m 6 days post interview and haven’t heard a word. It’s for a CSR esque role. Would appreciate any feedback. Thanks!",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/w89tzy/wayfair_post_interview/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Don't know what else to do to even land an interview/stand out",
      "body": "I've been searching for a job since June of this year as I will be moving in December. Due to certain circumstances I am searching for remote only opportunities. I understand the job market right now is extremely extremely competitive and seems like everyone is looking for a decent paying job right now but I'm beginning to lose hope. \n\nI have applied to over 300+ jobs at this point only hearing back from a handful of them and when I do, the recruiters always say how impressed they are with my resume. I recently paid to get my resume revamped specifically to help with my job search and I'm not sure if it's even helping much. \n\nI only apply to jobs I KNOW I'm qualified for. I have over 5 years of experience AND an educational background so what am I missing? Why would they be \"so impressed\" yet I'm receiving nothing but rejection emails without even the slightest idea as to why I wasn't considered. \n\nI'm lost, upset, and exhausted at this entire ordeal and it feels like I will be under unemployment very soon..\n\nI have also applied to in person positions in the local area I'll be moving to and those places haven't worked either.\n\nDoes my resume need work? Should I be reaching out to every application to get an updated status? Am I not qualified enough? \n\nWhat do I do? More like, what CAN I do?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/175d03u/dont_know_what_else_to_do_to_even_land_an/",
      "comments": [
        {
          "body": "I am not in the hospitality industry, but I have been a hiring manager and helped a lot of people with their resumes. One thing that jumps out is the lack of measurable results. For example, in one section, you say “significant increase” then say you kept track of the metrics. If you kept track of the metrics, what are the significant increases? 5%? 200%? Find places that you can quantify your success. \n\nThe other thing is that your resume is too long for some who hasn’t finished school. It isn’t that you have done too much, it’s that you come across as someone who will overinflate their accomplishments. Pare it down to one page. You can start by removing the high school information and the gray section that is obviously designed to trigger keyword searches. You should have a few key proficiencies or points you want to highlight, but not something that looks like you are doing a word dump.\n\nSorry if that seems harsh. Writing resumes is difficult, and overall yours isn’t bad. It far from the worst I have seen. But it was common for me to see 200+ resumes for a single position, so the first thing I would do is look for ones to eliminate.",
          "score": 1
        }
      ]
    },
    {
      "title": "Case Interview",
      "body": "I have a case study interview at wayfair for the supply chain, logistics &amp; operations co-op role. Any advice?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/mbo7su/case_interview/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Case Interviews?",
      "body": "Hello All,\n\n&amp;#x200B;\n\nI have an on-site interview for a company named Wayfair as a talent acquisition person.  Part of the interview entails a case study portion.  It mentions that basic math is part of the case study and I am awful at math. Is there a point of even going to the interview if I can't do this case study portion. Thank you for all advise.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/bmr9ed/case_interviews/",
      "comments": [
        {
          "body": "They are looking to see how you react under pressure and if you can problem solve. Don’t give up, ask questions to get through it if you get stuck and always stay calm.",
          "score": 2
        },
        {
          "body": "anyone who works at Wayfair on here?",
          "score": 1
        },
        {
          "body": " any other advise  I  can get.",
          "score": 1
        }
      ]
    },
    {
      "title": "Wayfair Case Interview",
      "body": "Hello everyone, I have a case interview this Monday with Wayfair for their Operations Analyst early careers and I am just looking for any tips how to get best prepared for it. Never done casing before and my recruiter told me the case will be about pricing and profitability. Any help is needed!      ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p9bxdp/wayfair_case_interview/",
      "comments": [
        {
          "body": "[removed]",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": 1
        }
      ]
    },
    {
      "title": "Looking for interview experience at Insurance/ Financial companies for Technical Manager / Software Development Manager roles",
      "body": "I have 12+ years of software development experience with the last 5 years in Management (People Manager, Development Manager) roles. Due to personal reasons, I have moved to Boston and will soon start applying for jobs. I am aiming for large companies like in Insurance and Finance. I have not been very hands on in the past few years but I have organised and participated in design reviews and helped my teams in some small ways. Most of my job was people management and in organising stuff so my teams can move ahead.\n\nI have read several interview experience of Big 4 that require managers to be very technical and that they are asked Algorithms and DS questions. I want to know if its the same for non- Big 4 companies as well? I am especially looking for experience from Liberty Mutual, Capital One, Wayfair etc.\n\nI am okay with Algorithms, Data Structures and System Design but I will probably fail if they start asking me basic java / jsp /servlet questions.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/6u76ib/looking_for_interview_experience_at_insurance/",
      "comments": []
    },
    {
      "title": "I think I screwed myself what should I do?",
      "body": "So I've been unemployed since July and have been searching desperately for a job since then. In mid January however I was able to get 2 interviews with 2 different companies (one at a regional company and one with Wayfair). The compensation for the regional company is 70k and for wayfair its 96k on the lower end.\n\nThe first interview with wayfair went well so they asked me for 2 weeks of availability for a 2 to 3 hour panel interview however they never got back to me until this week and I already accepted the regional company within that time and I had my first day today. What should I do? I would like to work for more money at wayfair and a closer commute but idk how I'm able to squeeze in an interview with them during business hours.",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1aeambe/i_think_i_screwed_myself_what_should_i_do/",
      "comments": [
        {
          "body": "Emergency doctor appointment. If they push for a doctor's note, just schedule an appointment with your doctor and ask them to write a note that says you were there that day. It doesn't need the time on it.\n\nOr see if Wayfair can work with your schedule.",
          "score": 5
        },
        {
          "body": "Wayfair just recently laid off 13% of its workforce, so perhaps keep that in mind going forward",
          "score": 3
        },
        {
          "body": "If Wayfair is your top choice (besides just the pay, benefits seem good, hours are better, commute etc) I’d try the honest approach.\n\nJust straight up be real with the hiring manager at Wayfair and let them know you accepted a job elsewhere when you didn’t hear back from them. But that you’re still interested in the possibility of joining their company. Now to be clear, you want to make sure you emphasize that while you do generally like to choose to grow within one company, you also recognize what a wonderful opportunity it would be to work for Wayfair. 1. You get ahead of looking like a flakey hire but 2. You also show them you’re in demand. \n\nThe second point is *primarily* why I am leaning towards you just being upfront about taking another position. In this current market, competition is stiff primarily because employers have the luxury of being picky. But letting them know you have options, not only reaffirms your value in their eyes, but also puts them on a timetable where they know they can’t drag their feet with you. And if all else fails, you already have another job to lean back on.",
          "score": 0
        }
      ]
    },
    {
      "title": "I've worked for my family business for 10 years and am considering cutting the cord and going out in the workforce.",
      "body": "I'm 33 years old and have a Bachelor's degree, and 10 years of experience working for a successful small family business (10ish employees, $6M/year revenue). I have worked my way into several managerial positions over the years and make a good salary. I have a significant amount of experience doing everything for the company, including marketing, product development, online marketing (including SEO and managing the Google and Bing adwords accounts, Amazon Seller and Ebay Store accounts), B2B client acquisition, building out and launching our new business management system, managing the integration and processing of state sales tax (post SD vs Wayfair sales tax nexus law in 2018), managing client accounts, billing and accounting, ordering product from overseas and dealing with international transit including full size containers and LCL, onboarding and training new employees, and a slew of other things.\n\nBasically I'm highly experienced in a variety of ways but I have one job on my resume and to be honest the last time I even updated my resume was when I graduated college. I know that I have the skills to bring value to a number of different businesses in either product development, wholesale account/client management, retail CRM, sales, B2B business, inventory management and a number of other things but I'm worried that recruiters will look at my resume and just assume I was handed my position by my family and that I have no outside work experience for other companies. I'm concerned that I'm not marketable even though I genuinely think I would be a valuable addition to a team.\n\nWhat can I do to make myself look more competitive if and when I enter the job market to recruiters before they interview me? I'm confident that if I can win an interview I should be able to impress with my broad skills but I'm worried my resumes will just keep getting thrown in the trash.\n\nIf I'm asked to provide references, it may be difficult to include family members for obvious reasons. Is it acceptable to list clients or colleagues in other companies in my industry that I've worked with?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/p50rfd/ive_worked_for_my_family_business_for_10_years/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Why leave a family business to work for corporate?",
          "score": 2
        },
        {
          "body": "Focus your resume on the jobs you want to be considered for - most larger businesses don't have that need for soup to nuts skills &amp; recruiters will find it hard to figure out what job you can do successfully     \n\nYou can absolutely use a few clients and such as references.",
          "score": 1
        }
      ]
    },
    {
      "title": "Applied and interviewed for one job but saw an opening for another within the same company",
      "body": "I applied for a simple warehouse receiving job at Wayfair maybe a week ago and I interviewed for it as well as sending in the background check. This was done today. I was searching for jobs still and came across an IT position at the same warehouse (my actual job field) so naturally I applied for it. This was also done today. I’m just wondering since im going through the onboarding process for the receiving, will i even be considered for the second position? Should I call back the woman who called me at first and see if I can change the position I’m considered for?",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/ixrl1w/applied_and_interviewed_for_one_job_but_saw_an/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        }
      ]
    },
    {
      "title": "Wayfair case interview",
      "body": "Hello everyone, I have a case interview this Monday with Wayfair for their Operations Analyst early careers and I am just looking for any tips how to get best prepared for it. Never done casing before and my recruiter told me the case will be about pricing and profitability. Any help is needed!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1papjhj/wayfair_case_interview/",
      "comments": [
        {
          "body": "Never done case interviews either but heard they're brutal. Since you know it's pricing/profitability focused, definitely practice structuring your thoughts out loud and walking through profit calculations step by step.\n\nHonestly for something this important I'd get some mock interview practice in. I tried Final Round AI's mock interview feature when I was prepping for analyst roles and it really helped me get comfortable talking through problems without fumbling. The AI gives decent feedback on your approach too.\n\nGood luck, operations analyst roles are competitive as hell right now.",
          "score": 1
        },
        {
          "body": "When I prepped for a Wayfair-style pricing and profitability case, I focused on unit economics and a clean structure first, then practiced doing math out loud. I’d frame revenue as price times volume and costs as variable plus fixed, sanity check margins, and test simple sensitivities like discounting price versus improving fulfillment cost. What helped me was running timed mocks with Beyz coding assistant using prompts from the IQB interview question bank, then trimming each answer to about 90 seconds with a quick recap of assumptions. Also, narrate your approach before calculating imo, interviewers care about how you think as much as the number.",
          "score": 1
        }
      ]
    },
    {
      "title": "Wayfair Interview help",
      "body": "Hey everyone,\n\nI have an interview with Wayfair coming up next week, and I was wondering if anyone could share what the interview process is like. What kind of questions should I expect, especially any coding (LeetCode-style) and LLD (Low-Level Design) questions?\n\nIt would be great if anyone who recently interviewed could share their experience or give some pointers on how to prepare. Thanks in advance!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1oavzzu/wayfair_interview_help/",
      "comments": []
    },
    {
      "title": "Wayfair interview: coding round",
      "body": "**I am interviewing with Wayfair, and my next interview is a coding round. The recruiter told me they will provide unstructured code, and I need to structure it. The language will be Java. Does anyone have a sample code or any tips? Could you please help me prepare for it?**",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1k91ecr/wayfair_interview_coding_round/",
      "comments": []
    },
    {
      "title": "Case Interview for Business Analyst position at Wayfair - Boston",
      "body": "I have a case interview next week for Wayfair. It would be conducted through google meet. I just got an email inviting me to this interview and I applied more than a month ago. Does anyone have any experience with it. I would appreciate any insight from anyone.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/181p1t7/case_interview_for_business_analyst_position_at/",
      "comments": []
    },
    {
      "title": "Wayfair Interview Tips for Category Management",
      "body": "Can anyone please help with the tips at Wayfair category management interview in UK ? Any suggestions would be helpful.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1lfm7oi/wayfair_interview_tips_for_category_management/",
      "comments": [
        {
          "body": "Wayfair's category management interviews are notoriously data-heavy and will test your ability to think like a business owner who's responsible for an entire product category's P&amp;L. They're going to throw scenarios at you about supplier negotiations, pricing strategies, inventory optimization, and market analysis, so you need to demonstrate that you can balance the art of merchandising with the science of analytics. The interviewers want to see that you understand how to drive revenue growth through strategic product assortment decisions and can articulate how you'd identify white space opportunities in their massive home goods catalog.\n\nYour biggest advantage will be showing up with concrete examples of how you've used data to make category decisions, even if it's from retail, e-commerce, or consulting experience outside of traditional category management. Practice common [category management interview questions](https://www.interviews.chat/questions/category-manager) around topics like how you'd launch a new product line, optimize underperforming categories, or respond to competitive pricing pressure. Wayfair moves fast and expects their category managers to be comfortable with ambiguity, so demonstrate your ability to make informed decisions quickly even when you don't have perfect information.",
          "score": 1
        }
      ]
    },
    {
      "title": "Wayfair case study interview prep",
      "body": "I have a case study interview for wayfair coming up (marketing related role). Does anyone have any experience of the case study interview at wayfair? What kind of task is it? Or any examples of the case study questions they had to answer in the interview? ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1jk736n/wayfair_case_study_interview_prep/",
      "comments": [
        {
          "body": "I did a marketing case study for Wayfair last quarter - mine focused on optimizing ad spend across channels using their dataset. Prepin was super helpful for practice - the voice interviews with emotion tracking helped me deliver my analysis more confidently. Their cases typically involve data interpretation and strategic recommendations, so practice explaining your thought process clearly!",
          "score": 1
        }
      ]
    },
    {
      "title": "Wayfair Business Analyst Coop Internship Interview",
      "body": "Find this job on NEU works(many NEU business major would apply for such jobs). I received the invitation to interview many days after I submitted my application, so long that I nearly forgot that I even applied for it.  I receive the invitation to the final round of interview via google interview. There are two cases, mixed with behavioral questions, 60 mins overall. The internship lasts for 6 months.  I got the offer the next day of the interview, and three days to decide whether to accept it or not. I accepted it.\n\ncase 1: delivery options I am provided with data and then asked how to price a new option, and how to cater this pricing strategy to different regions\n\ncase 2: conversion rate I was asked about how to use the conversion rate to decide whether the new periods have errors and where errors come from that make conversion rate go down, and how to solve this problem.\n\nmore interview questions: socaapp",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/125sjkp/wayfair_business_analyst_coop_internship_interview/",
      "comments": []
    },
    {
      "title": "How do you actually tackle a Senior Analyst case study interview?",
      "body": "I have some questions regarding a Senior Analyst interview with a case study round at Wayfair... role is more on the vendor side. I heard they do it on Google Sheets.\n\n1. Do you build charts/pivots, or just analyze &amp; give recommendations?\n2. Do they want dashboards or ppt slides, or is it more about insights?\n3. Are the questions always about the dept you applied for, or random business scenarios?\n4. What makes a “good” recommendation?\n\nI haven't gotten to there yet, just gave the tech assessment... but I am scrolling through to get an idea as I'm kinda new to the case study round. Any tips are appreciated.",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1ly98zo/how_do_you_actually_tackle_a_senior_analyst_case/",
      "comments": [
        {
          "body": "Think like the biz owner not the analyst. They don’t care about how pretty your sheet is if your thinking’s mid. Start w the goal, not the data. What problem are we solving? What’s the biz impact? Build just enough pivot/charts to prove the story then hammer the *so what* in clear language.\n\nInsights &gt; formatting  \nTradeoffs &gt; overexplaining  \nClarity &gt; depth\n\nAnd yeah, always tailor to the dept. But prep for curveballs. They’re testing how you *think under pressure* not just how you filter data.\n\nThe [NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some sharp takes on high-leverage thinking and storytelling that vibe with this worth a peek!",
          "score": 3
        },
        {
          "body": "They typically want to see how you approach problems systematically - you'll likely do some basic analysis in Google Sheets but the real focus is on your insights and recommendations. They're not expecting fancy dashboards or polished presentations, just clear thinking and actionable conclusions. The scenarios usually relate to the department you're applying for because they want to see how you'd handle real problems you'd face in the role.\n\nA good recommendation in these interviews is specific, data-driven, and considers business constraints. Don't just say \"increase marketing spend\" - explain why, by how much, what the expected impact would be, and what risks to watch for. They want to see you can connect data points to business outcomes and think through implementation challenges. The key is showing your thought process out loud as you work through the problem, asking clarifying questions, and being upfront about any assumptions you're making. I'm on the team that built [AI interview tools](http://interviews.chat), which help people practice exactly these kinds of analytical interview scenarios and develop frameworks for tackling case studies confidently.",
          "score": 2
        },
        {
          "body": "I used to work as an analyst at Wayfair up till last week - if u DM me the team, I can probs give you a bit more color\n\nBut yeah agree with the comments below. It really is team dependent. But the likely situation is some ambiguous data with a business problem. You do some calcs(maybe a graph or two). Then you will come up with some recommendation and how you will go thru with it + risks to consider, etc",
          "score": 2
        }
      ]
    },
    {
      "title": "Commercial Analyst Case Interview",
      "body": "Hi everyone!\n\nI have a Wayfair case interview (60 minutes) soon for the Commercial Analyst Intern. I was wondering if anyone had insights into what questions they could ask? And what I should prepare beforehand? Will it be just technical or also behavioral questions? \n\nThank you so much &lt;3 ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1owa7e1/commercial_analyst_case_interview/",
      "comments": [
        {
          "body": "Short answer to your question: expect a mix of technical and behavioral. When I interviewed for a similar analyst case, they probed SQL basics, quick mental math on margins and CVR, a scrappy Excel model, plus a few STAR stories on ambiguity and stakeholder pushback. What helped me was running two timed case drills where I clarified the goal, listed key levers revenue, conversion, AOV, margin, CAC, and did a simple sensitivity table. I used timed prompts from IQB interview question bank with Beyz coding assistant to practice talking through queries and tradeoffs. Keep answers around 90 seconds and narrate assumptions out loud.",
          "score": 1
        },
        {
          "body": "lol when is your interview?",
          "score": 1
        }
      ]
    },
    {
      "title": "Biggest joke of an interview that never happened",
      "body": "Hey Reddit,\n\nBefore I bash on this company, Wayfair, I want everyone here to know that I have nothing against the workplace itself. I worked there for 3 solid years and loved it, they really helped jumpstart my career as a software engineer. That being said, their recruiting is seriously messed up with the way that things are handled. In fact, Wayfair ruined my father's day (so much for building a \"Happy Home\" as they advertise).\n\nTLDR if you don't want to read the whole thing:\n- They scheduled me to fly in for an on-site interview\n- Cancelled a few days before the flight\n- Told me that they cancelled the flights too.\n- Didn't actually cancel the flights\n- Ghosted me (an ex-employee, who left the company on good terms after doing solid, hard work for 3 years)\n\nI left Wayfair because I wanted a new adventure on the West Coast, and pretty much all of their engineering is handled in their Boston HQ. So after 1 year having left the company, their recruiting contacted me:\n\n\"Hey I see that you left Wayfair 1 year ago and moved to California, so I wanted to let you know that we now offer fully remote software engineer opportunities\".\n\nThat sounded totally ideal for me. It has been my dream to work fully remote.\n\nI talked to the recruiter, and he contacted my old managers. Everyone gave a good word, so they expedited the process to interview me on-site. I was very excited.\n\nI get an email \"we're flying you out this Thursday to interview you Friday, just to confirm\" I was not ready to fly across the country that suddenly, not sure where they made that assumption. So I asked them to schedule the interview around Father's Day weekend (3 weeks later), I'm from the area and was planning on visiting home then anyways. I booked PTO and made a lot of plans, invited all of my friends to my Dad's, and my father was so very excited about everything.\n\n3 days before the flight, Wayfair gave me a call. \"Hi, sorry but the position has been filled and we're cancelling\". I have had about a dozen on-site interviews, and never has someone cancelled on me like that. I asked, \"well I made a lot of plans around then and took PTO, any chance you can just not cancel the flights and I'll pay for them at the price you got them weeks ago\". \"No, sorry, the flights are already cancelled\" they replied.\n\nSo I asked my boss for the PTO back, apologized to all of my friends and my father (he was very upset &amp; disappointed by the way) then carried on.\n\n\nHere's where it becomes even more of a slap in the face....\n\nI kept getting notifications about the upcoming flight, expenses, study up on the interview emails, etc and so I'm asking for answers. All 3 recruiters ghosted me, as if I didn't work hard there for 3 solid years prior and didn't deserve any respect.\n\nThen the day of what was supposed to be the flight, I decided to try to check in the flight. Even though it was too late, and I was told that it was cancelled.\n\nI was able to check in the flight. They never cancelled my flight, lied to me and destroyed all of my father's day plans.\n\nWhat a joke. A week or so after the interview (never) happened, I get an automated email \"Thank you for your interview with us at Wayfair! Please fill out this survey and let us know about your experience\". Wow. Then I had a different one of their recruiters contact me about a \"remote position\" after that. Is this a joke?!\n\nAnyways, this whole experience was so horrendous that I decided to post on Reddit. I hope that this gets their attention, so that they can fix up the way that they handle things.",
      "subreddit": "interviews",
      "score": 13,
      "url": "https://reddit.com/r/interviews/comments/cehrf1/biggest_joke_of_an_interview_that_never_happened/",
      "comments": [
        {
          "body": "That certainly sucks! To this day I wonder if recruitment is full of mean people, if someone up above them instructs them to do so or what... But I know my only positive experiences with recruiters came at a personal level, never professional.\n\n&amp;#x200B;\n\nEither way, I take it you took the flight? If so, then you could had gone ahead and fulfill your plans, right? Or did you cancel them upon hearing the bad news?",
          "score": 2
        },
        {
          "body": "Though them sending you a notice after the interview is kind of messed up, it seems like just an automated oversight. I am assuming in three weeks that they filled the position, it's not really anything against you or your father, as you seem to suggest.",
          "score": 1
        }
      ]
    }
  ]
}