{
  "company": "wbd",
  "post_count": 4,
  "exported_at": "2026-01-18T17:44:53.316Z",
  "posts": [
    {
      "title": "Warner Bros: Final Interview to Offer/Rejection Timeline Expectations",
      "body": "Had my final round with a VP at WBD last week for a Manager position and thought it went well. My entire process consisted of four interviews plus an assessment. It’s now been a week since that last round, and I haven’t heard anything from the recruiter. My Workday portal still shows “In Progress,” but I noticed the job posting was removed yesterday (Sep 24).\n\nFor anyone who’s been through WBD’s hiring process: how long did it take to hear back after a final round? Is the posting removal a bad sign, or is this fairly normal?",
      "subreddit": "interviews",
      "score": 5,
      "url": "https://reddit.com/r/interviews/comments/1nqkllw/warner_bros_final_interview_to_offerrejection/",
      "comments": [
        {
          "body": "Hey op - unrelated but how did you get your application selected by hr thru the ATS? I’ve been applying to WBD (I’m in the industry) but unsure on my resume format.  Congrats!",
          "score": 2
        },
        {
          "body": "Congrats on making it so far!!! Rooting for you hard.",
          "score": 1
        },
        {
          "body": "What was the interview process like? How",
          "score": 1
        },
        {
          "body": "I also interviewed for WBD, but for a Software Developer position. The whole process started a month ago. I've done the HR/Recruiter round, a first tech screening round, 3 back to back 1 hour rounds and am now waiting to know what the next steps are. My last interview was almost 10 days ago and I'm still waiting to hear back from them. This job was posted briefly and then suddenly disappeared. I've sent them a follow up after one week with no update yet. I've read on other posts that for some folks it took almost 2 months to finish the whole process, although I'm not sure what caused it to take that long. I've also seen other people claim that they went through a couple of rounds and got completely ghosted. Here's to both of us, waiting for their response. If I'm not selected, I really hope that at the very least they send me a rejection email (bot or otherwise).",
          "score": 1
        }
      ]
    },
    {
      "title": "Hiring in Tech Sector is Outpacing Job Cuts",
      "body": "https://www.wsj.com/economy/jobs/tech-layoffs-keep-coming-why-is-head-count-barely-budging-760a314b",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1b42ovo/hiring_in_tech_sector_is_outpacing_job_cuts/",
      "comments": [
        {
          "body": "There is a mistake in the title. Here is the correct one: \"Hiring in Offshore Tech Sector Is Outpacing Job Cuts\"",
          "score": 2
        },
        {
          "body": "Hmm wonder why I haven’t gotten an interview as an intermediate to senior role with a good resume with experience from WBD and references. It’s maddening. One of these days.",
          "score": 1
        }
      ]
    },
    {
      "title": "Warner Bros Marketing Interview ",
      "body": "I'm interviewing with the director at WBD next week for a position, and I'm feeling a bit nervous, even though I know I'm fully qualified. Has anyone here interviewed with them before? What types of questions should I be prepared for?",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1hcn1fw/warner_bros_marketing_interview/",
      "comments": [
        {
          "body": "Have you asked the recruiter for questions?",
          "score": 1
        },
        {
          "body": "They're looking for passionate, creative individuals who understand the entertainment landscape. Expect questions about your marketing experience, your knowledge of WBD's brands and content, and how you'd approach specific marketing challenges. They might ask about your favorite WBD shows or movies, so be ready to discuss why you love them from a marketing perspective.\n\nBe prepared to share concrete examples of successful marketing campaigns you've worked on, and how you measure their impact. They'll likely want to know how you stay up-to-date with industry trends and emerging platforms. Don't stress too much - your qualifications got you this far, so focus on showcasing your enthusiasm and unique ideas. If you need help preparing for tricky questions, I'd recommend checking out this [copilot interview](http://interviews.chat) app. Full disclosure: I'm on the team that created it, and it's designed to help people navigate challenging interview scenarios like this one.",
          "score": 1
        }
      ]
    },
    {
      "title": "Warner Brothers Discovery interview insights.",
      "body": "I am about to have a final round interview with WBD soon. \n\nThe position is something of middle management like project or product manager.\n\nNow what they call as a final round is a 4 interview \"interview-loop\" of 1 hour each by 4 different people based on 4 different competencies.\n\n1. Problem solving\n\n2. Communication\n\n3. Software literacy\n\n4. management skills\n\n  \nHas anyone recently gone through any interview loop like this at WBD or any other company in USA/Canada? What could be some interview questions or styles I might expect here?\n\nI am a bit bummed as to the scale of the interview..Like do they expect me to solve Leetcode in the problem solving round or how do they assess my \"software literacy\"? I have been told the questions get quite technical but not in what way like problem solving related to project management or problem solving related to code issues!\n\n",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1gjuvdx/warner_brothers_discovery_interview_insights/",
      "comments": [
        {
          "body": "Hello! \nI'm just starting interviews with WBD for a project/program manager role. \n\nCan you explain me what happened in all your previous interviews? Any questions or pointers you can share?",
          "score": 1
        }
      ]
    }
  ]
}