{
  "company": "workday",
  "post_count": 69,
  "exported_at": "2026-01-18T17:44:53.316Z",
  "posts": [
    {
      "title": "I was not prepared for how hard finding an entry level role would be.",
      "body": "I knew it would be hard, just not this hard. I'm going on seven months post web dev boot camp and I feel like I've done everything right. My portfolio is snazzy, I have personal projects, I reach out directly to every job I applied to. I have so many workday profiles that I lost count. The rejections keep piling up and I can count how many interviews I've got on one hand. I got a part time gig tutoring for the boot camp I graduated from but it barely covers poverty level living expenses. At this rate I'm thinking about going back to painting houses just to keep afloat considering the rising cost of living.\n\nI know I can do an entry level job, I just need somebody to give me a break.\n\nSorry for the rant I guess I could just use some words of encouragement or advice or just acknowledgment that others have struggled the way I am now.\n\n&amp;#x200B;\n\nThanks for reading.\n\n&amp;#x200B;\n\nedit: Thank you all for the replies! I posted this and then walked away from my computer to decompress for a bit! I'll try to get to everyone that I possibly can, I really appreciate everyone's feedback and advice.",
      "subreddit": "cscareerquestions",
      "score": 689,
      "url": "https://reddit.com/r/cscareerquestions/comments/tbvqjv/i_was_not_prepared_for_how_hard_finding_an_entry/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 348
        },
        {
          "body": "Try reaching out to recruiters at contracting companies. The barrier to entry is way lower for contractors than it is for hiring FTEs. Make sure to only consider contract to hire positions as they'll want to convert you if they like you. Pm if you want more info",
          "score": 103
        },
        {
          "body": "Don't give up!\n\nUnfortunately, the whole \"learn to code\" and bootcamp movement has created a large pool of entry level candidates, and the entry level is extremely saturated as a result.\n\nJust keep applying to as many places as you can. Once you get your first job, it will be much easier from then on.",
          "score": 230
        },
        {
          "body": "Yup, entry level is the true filter for our field. 6 figures with no barrier to entry is a lie and was obviously too good to be true. You are fighting with degree holders who spent years and highly motivated self taught. Bootcamp helps you against self taught but some of these self taught have been learning longer than you. Keep learning and making yourselfer stronger as a candidate.",
          "score": 56
        },
        {
          "body": "There are soooo many entry level developers looking for jobs right now. The competition is fierce. We opened an entry level position and one of the jrs on my team posted it to her LinkedIn and we got 200 resumes over night, just from her link alone.\n\nBest advice I can give you is keep applying and don't be picky. Most of the applications I see for jr positions are self taught or straight out of bootcamp. Having some real world experience, even if it's only 6 months at some company we've never heard of, will put you above 90% of the other applicants applying for jr positions. Just focus on getting into the industry and every thing becomes much easier after that.",
          "score": 137
        },
        {
          "body": "If you’re not getting callbacks, your portfolio is not as snazzy as you think it is.\n\nYour projects need to be:\n\n1. Unique. If the employer sees multiple of the exact same project from different candidates, you’ll get the same result as all the other candidates (rejected)\n2. Custom. If you’re applying to medTech companies, you need medTech projects.",
          "score": 38
        }
      ]
    },
    {
      "title": "Complicated situation within Workday for job I interviewed for",
      "body": "My situation is confusing. I applied for two positions at the same company with the exact same title. I interviewed for one of them last week. Both have been greyed out in Workday indicating they are no longer accepting applications. This morning, my application for one of them was moved to inactive. The issue is, since I can no longer see the ID, I have no idea which one was changed. I also have not received a rejection email. Is there anyway to see which job was moved to inactive? Should I reach out to the recruiter? I was told they were hoping to make a decision by the end of the month, which is technically Friday. Any advice would be appreciated!",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1n1i3ul/complicated_situation_within_workday_for_job_i/",
      "comments": []
    },
    {
      "title": "Finally attained a 125k salary (in DC area), fully remote, fun job, lots of freedom 2 years into my career, and yet I'm avoiding work...?",
      "body": "I finally did it. I finally negotiated an 80% raise. I'm fully remote. I'm soon to get a clearance. I'm finally able to engineer the part in the work project I've been waiting to do all this time. It's something really fun and interesting I've been looking forward to. Job literally has no stress at all and there's only like a single 15 minute meeting each day. Even if I'm not working 9-5 the company wholly allows you to stretch your work hours to any time of the day/night to accommodate.\n\nYet I find myself... avoiding working and just watching youtube videos, playing video games, checking discord, etc.???!?\n\nWhen I started this job I was super eager to get stuff done, learn, rise up, and get recognition. All throughout school I worked my butt off to get a perfect 4.0 and also rock several extracurricular projects too. Well, now that I've got the magical 6-figure fully remote job 2 years in to my career, I feel like I don't care anymore?\n\nIt doesn't help that the past 3 weeks I've burned myself into the ground by A) grinding interviews/applications for other jobs so I'd have negotiation tools/opportunities B) endlessly shopping for a car during every hour of the day (including the workday) hoping that I'll soon have a car to take into the workplace and C) playing a brand new video game with friends that I've been waiting for years.\n\nMy actual attention span and work discipline is at an all time low. I can't even bring myself to wake up in the morning. \n\nAny help here? How do you find the motivation to do your best when you've achieved what you wanted?",
      "subreddit": "cscareerquestions",
      "score": 515,
      "url": "https://reddit.com/r/cscareerquestions/comments/xkoebq/finally_attained_a_125k_salary_in_dc_area_fully/",
      "comments": [
        {
          "body": "You might be burnt out. You can take a short vacation and work on the tasks they need you to do using the pomodoro system or something similar.",
          "score": 440
        },
        {
          "body": "Im a pharmacist and Im experiencing this too. 2 years ago I was begging just to have a job. Now Im close to home and have a decent pay, not the best but decent. \n\nAll of my life I worked to be in this position, and now I dont have the motivation. \n\nI think we humans are always seeking to brtter our situation. Are you this way too? Like now Im thinking more about \"how can I get rich?\" And \"how can I escape the 9 to 5?\" \n\nYou reach what you thought was unreachable and then you want more. At least thats what Im going thru. \n\nLike yeah, I want to be good at what I do and stuff, but at the end of the day, no matter how efficient and knowledgeable I become at it, its still just a job and I still just work for some corporate millionaires that are above me no matter how cool I am or knowledgeable.\n\nI guess the advice is , have a balanced approach. Dont get too comfortable. You could lose it and then begging to be back in this situation. But also see why youre being the way you are. Are you lacking interest or passion in this type of job and the nature of the subject? One thing that will help is surrounded yourself with ambitious people, that inspire you to enjoy your job and try to be the best at it, and those that have insane gratitude. But for you thats difficult working from home.",
          "score": 58
        },
        {
          "body": "[deleted]",
          "score": 128
        },
        {
          "body": "Are you depressed maybe?  Your life doesn't have to be defined by your job.  You work to survive, but is there anything else that motivates you to wake up in the morning that you always wanted to do?  Maybe take a class or volunteer or something?  Start a family with your fiance or look after your nieces/nephews?\n\nIt's hard to get out of a rut when you get stuck in it and it's okay to feel that way.  Just try not to sabotage yourself and get into a situation where you lose your job and you don't know what to do.  I hope you can figure something out.",
          "score": 52
        },
        {
          "body": "Great, you can finally afford the therapy you need.",
          "score": 13
        },
        {
          "body": "From the time I was around 12 or 13, I was constantly doing things last minute, overworked, had no time for myself, and that lasted for about 15 years.  When I finally was settled in my current job, I did almost nothing.  More than that, when we went WFH, I did even less.  I also wasn't cleaning much around my house, and I was using caffeine to give me motivation to do anything other than watch YouTube, browse Reddit, and sleep.  There were all these really cool opportunities I was being handed, and I was putting them off because I could never stay focused on them for more than a few minutes at a time.\n\nI had also switched departments from one that required only a surface level knowledge about 3-4 different things, and I could jump around between them whenever my focus started drifting.  My new department has a steep knowledge requirement on a lot of varying subjects, which I knew going in and I had volunteered for.  But my lack of focus made it particularly difficult, along with the fact that I didn't have anyone closely monitoring to see what I did.  I'd get the bare minimum done, and push off everything else for hours or days.  And the really sad part is I was still getting praised by my bosses.  I hated what I was doing, and I hated myself for doing it.\n\nI did a bunch of Googling and research, listening to people's stories and experiences, and came to the conclusion that I had ADHD.  The reason it hadn't been a major deterrent up to this point in my life was because I have an amazing memory so I could regurgitate anything for tests (homework and projects dragged down my grades in middle and high school), and once I got into college and had my butt kicked, everything became an emergency HOLYSHITIHAVETOGETTHISDONERIGHTFREAKINGNOW.  It worked for me, I burnt myself out hard, but I graduated with honors after basically failing out of some of my classes and taking them multiple times.  And I ended up with a pretty awesome job right after graduating.  Once I got comfortable and nothing was an emergency anymore, I lost all focus on everything.\n\nAbout 5 weeks ago I got my official diagnosis, started on meds (20mg Adderall), and holy crap is it a life changer.  I'm now writing up proposals I was never planning on actually doing, I'm showing my bosses that they're making a good investments with tangible benefits in the short term and explaining my plans for long term benefits, I'm proactively doing work to speed projects along, and I don't have an issue working the whole day.  I've already planned out some side projects with my team lead once we finish a few of the things we're working on now, like redoing our entire AD system, and shifting a bunch of internal applications to containers after we build the infrastructure for it all.\n\nI'm only mentioning all this because it took me literal years of being in the same place as you before I started looking to see if maybe something was wrong with me, or worked differently than it does for most people.  All the chaotic thoughts that jump every few seconds are calm now, I'm able to focus on stuff that would've normally had me pushing it off and loading up YouTube (I actually closed all the \"distraction tabs\" that I kept open for months so I could pick what my mood of the minute wanted to do).  I just want to shed light on the fact that there is potentially something else going on now that you can finally relax.  I wish someone had told me that, and I wish I'd been self-aware enough to ask questions back then.",
          "score": 22
        }
      ]
    },
    {
      "title": "Has anyone interviewed for the APM role at Workday before?",
      "body": "I have a phone interview coming up for the fulltime APM role, and I'm not sure what to expect. My tech skills are very rusty and I've heard that their interviews will have a good amount of technical design questions.",
      "subreddit": "cscareerquestions",
      "score": 4,
      "url": "https://reddit.com/r/cscareerquestions/comments/42h90e/has_anyone_interviewed_for_the_apm_role_at/",
      "comments": [
        {
          "body": "If it's the HR phone interview, you'll get some simple questions about your resume and background. Make sure to practice questions such as \"Why are you interested in Workday?\" and \"Tell us about your past product management/software engineering experiences.\" For your onsite interview, you'll get a mix of technical design and non-technical fit interviews.",
          "score": 2
        }
      ]
    },
    {
      "title": "Has anyone interviewed here at Workday?",
      "body": "Hello, I am wondering if any one as interviewed at Workday specifically as a new college grad?\n\nFeel free to PM me if you have.\n\nThanks",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/57bgde/has_anyone_interviewed_here_at_workday/",
      "comments": []
    },
    {
      "title": "Confidence was shook during a Tech Screening. What do I do?",
      "body": "The recruiter (recruiting agency, not a company recruiter) asked me to add Hibernate to my resume. This recruiting agency has their own tech screening... so then their screener asked me hibernate questions and I was shook. At work we add objects more manually using RowMappers.\n\nI'm not one to lie on my resume, this would be a first for me. It flavored the rest of the screening as I seemed low energy and low confidence in the rest of the questions afterwards. \n\nI was also screened after a long workday and commute at 6pm... The recruiter also appears to have assumed I have been working with Spring Boot at my workplace when we just use Spring Framework. While I originally coded in college using SpringBoot, it's been awhile since I coded using that specifically. Some of the screening questions were also geared towards that.\n\nJust feeling super dumb and like an imposter as a mid level Java software engineer. At least 20-30% of the questions at some point I said \"I don't know\".\n\nIn the end the screener said I answered all the questions but appeared to lack confidence. I then gave some truth and said that I'm not always good at talking tech (some of the vocabulary I'm supposed to know goes right past me) but I am better when I can just sit down at the computer and write code. \n\nIn the end the recruiter said if they like my personality they will find a reason to hire me, which was nice to hear but also felt like it confirmed I didn't do very well in the screening? Or maybe I read too much into that.\n\nThe recruiter will now decide if they will send me stuff over to the hiring manager and ask for an interview. I'm debating on whether I should send him a message clarifying what I have said here about Hibernate / Spring Boot. What would you do? Maybe I just need to wait it out and see what he tells me today.\n\nI really need a remote job because I live 70 miles from any city and this company is 100% remote and hire a lot of devs, so I'd really like a chance there.\n\nI've had a few interviews so far since I started looking in August, about one per month, so maybe I should just be glad I am getting interviews at all.",
      "subreddit": "cscareerquestions",
      "score": 7,
      "url": "https://reddit.com/r/cscareerquestions/comments/1pi6cm8/confidence_was_shook_during_a_tech_screening_what/",
      "comments": [
        {
          "body": "It’s kind of weird for the recruiter to ask you to add something to your resume that you don’t have experience in. If you do make it to the next round, you should definitely bone up on that before interviewing.",
          "score": 12
        },
        {
          "body": "Hibernate is mandatory skill and it's used everywhere. I have no idea who decided to use RowMapper in your project, but you can thank him for tanking your skillset.",
          "score": 2
        },
        {
          "body": "I'd expect a mid level java engineer to have all of these in the back pocket, but even then, I think you'll be alright unless your personality was off as well. Did you seem at all reserved or combative or adversarial? Did you communicate your knowledge clearly and with intent? Was it strained or effortless getting information to and from you?",
          "score": 2
        },
        {
          "body": "What kind of questions were you asked about Spring Boot that you weren't able to answer while actively using Spring?\n\nHonestly if I got hit with hibernate questions I'd fail them too and I've used it countless times (unfortunately), I think all hibernate usage can be summed up like so:\n\n1. User hibernate for something that isn't basic CRUD\n2. Enable database query logs\n3. Have a stroke at what the fuck it's generating\n4. Write the SQL yourself\n\nBut yeah sometimes interviews just start off on the wrong foot and you don't fully recover until the end, happens - this is why I always try to interview for a few places i'm *not* willing to work at before I start interviewing for real, to get warmed up a bit.",
          "score": 1
        },
        {
          "body": "I don't do well on oral exams. Even when I know the answers in practice I just don't think that way.",
          "score": 1
        },
        {
          "body": "20-30% \"I don't know\" is pretty decent for anything actually technical TBH. People who use Hibernate every day frequently fail to understand basic behavior surrounding save().",
          "score": 1
        }
      ]
    },
    {
      "title": "Applied for Data Scientist position, company really wants WebDev",
      "body": "Just came out of an interview over a Data Scientist position in a HUGE company. In the job description: \"statistics, modelling, machine learning &amp; big data\" are listed as requirements. I have experience and published in some of those fields. Therefore, I decided to give it a go.\n\nDuring the interview, I started describing my previous work experience about using machine learning and other techniques to solve computer vision / NLP problems. The interviewer : \"great, our tasks are much simpler, you will be able to go through them easily\". I think: \"GREAT.\"\n\nBUT THEN I decided to ask what would be a regular workday at the company. The answer: \"well, we want an internal communication system to use instead of email, and we are just looking for some one to develop a web interface. Also we want to be able to edit excel files simultaneously, can you do that?\"\n\nUh. Really? Why the fuck do you want a \"data scientist\" for that?  How about hiring a web developer? OR JUST USE SLACK AND GOOGLE DOCS YOU FUCKING DUMBASSES.  Are those guys  posting \"data scientist\" positions just because it looks cool and trendy, and have no idea what it actually means, or am I missing something here?\n\nNow on to the question: The interviewer kinda implied that the job is mine if I want it. Do you guys think is it worth to accept this position? It seems to be easy work and this company pays really well. Also, its one of the largest companies in the world so it kinda looks good on the CV. Should I accept the job and keep easy money flowing in while I look for something better?",
      "subreddit": "cscareerquestions",
      "score": 372,
      "url": "https://reddit.com/r/cscareerquestions/comments/e6cexp/applied_for_data_scientist_position_company/",
      "comments": [
        {
          "body": "Well those excel files and internal messages must have data in it so it is obviouslly a data scientist job. jk",
          "score": 309
        },
        {
          "body": "&gt; OR JUST USE SLACK AND GOOGLE DOCS YOU FUCKING DUMBASSES.\n\nLmao\n\nYou really want to work under these people? Sounds unbearable\n\nYou sound like you have enough of a resume to land an actual job, so not sure why you’re considering it. But, if you’ve been interviewing and got getting traction, and you feel in your gut the job search might take a while, then I guess",
          "score": 227
        },
        {
          "body": "It's absolutely no secret that a fuckton of companies have re-branded their previous [x] analyst / analytics positions into the much hotter \"data [engineer / scientist / researcher / etc.]\". \n\nThe only way to really know, is to ask the right questions beforehand.",
          "score": 104
        },
        {
          "body": "What would be your actual job title?\n\nIf the pay is great and it’s something you could do for a bit, it might be worth adding to the resume at the very least. Do it, maybe keep networking and job seeking.",
          "score": 30
        }
      ]
    },
    {
      "title": "Workday Software App Dev Engineer Intern Question",
      "body": "The role is Software Application Development Engineer Intern in Pleasanton which I have an interview for. I want to know how this internship is? How does it look for resume value? What things will I learn?\n\nI already have a Capital One TIP offer for Richmond as a SWE Intern, but will probably have to come 1-2 weeks late to it and they don't extend the end time.\n\nWhich one would be better for me to do? This would be my first internship and I am a second year currently.",
      "subreddit": "cscareerquestions",
      "score": 2,
      "url": "https://reddit.com/r/cscareerquestions/comments/1oumqit/workday_software_app_dev_engineer_intern_question/",
      "comments": []
    },
    {
      "title": "Has anyone ever interviewed or worked at Workday before?",
      "body": "I've been contacted by them so im wondering does anyone have experience with them?",
      "subreddit": "cscareerquestions",
      "score": 12,
      "url": "https://reddit.com/r/cscareerquestions/comments/2s32mg/has_anyone_ever_interviewed_or_worked_at_workday/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 4
        },
        {
          "body": "[removed]",
          "score": 3
        },
        {
          "body": "Some of the folks I interned with a few years ago left and joined workaday. They have been there for a few years now (based on LinkedIn profile). So based on that I am *guessing* they like it. It was also rated as one of the best places to work. ",
          "score": 2
        },
        {
          "body": "From others' replies, it sounds like a good place to work. As an end user, it is shittily implemented.",
          "score": 2
        },
        {
          "body": "I have a friend who interned with them for a summer, and went full-time after graduating.",
          "score": 1
        },
        {
          "body": "Depending on the job, it's a great company. You just don't want to be an App Dev. Really good work/life balance, and a great place to grow as an engineer. The location (Pleasanton) kinda sucks but the commute from SF is better than a commute to Mountain View.",
          "score": 1
        }
      ]
    },
    {
      "title": "How to: get a software engineering internship at a technology company",
      "body": "Everything below is a synthesis from my experience over the last several years in college. I wrote it up for someone I know who is an underclassman studying computer science at a state university who is interested in trying to get an internship at a competitive technology company. I wanted to put it here because I think it's useful, and I'd be happy knowing others found it useful as well.\n\nTo validate the information I share below, I am a new grad working as a software engineer and just graduated from a strong state school computer science program. Over the last few years, I have interviewed at a majority of the hot tech companies, both large and small, trading firms, been rejected a lot, learned a lot of lessons, and received offers from some of the most \"desirable\" places to work. Unfortunately, the one thing I cannot account for is any bias or privilege due to the school I attended, but I assure you, I did not go to MIT, Stanford, Carnegie Mellon, or Berkeley.\n\nThis is a simple set of what I think are the core pieces of information and steps to position yourself to get an internship at a reputable technology company.\n\nCompletely non-jokingly, I think it boils down to two stages, which require completely different areas of preparation and requirements:\n\n1. Getting the interview\n2. Passing the interview\n\n**Getting the interview**\n\n*Note: this section is assuming you have a properly crafted resume. Quite frankly, I am too lazy to write about how to make a good resume, and I think there are plenty of resources online for that.*\n\nFor younger students and students without as much experience, getting interviews at technology companies can present a challenge. However, I think there are a few tips and tricks that can be used to make your life a lot easier.\n\n**Referrals**: this is the undisputed number one way to get an interview at any company. Find a friend that works somewhere, or a friend of a friend, and ask if they'd be willing to refer you or connect you to their recruiter at the company. When possible, referrals should always be the absolute first choice for how to apply to a company. This isn’t just something you ask for when you need it. Throughout your curriculum, try to make friends with your peers, upperclassmen, and surround yourself with people that are strong students--right from your first year. 3 years later, all of those students (including yourself) will have strong internships, and you’ll all be able to help each other out. If you stay in your own small bubble and work through your coursework that way, you’ll be less well off.\n\n**Career fairs:** they work. The line for Google isn't worth it since they just tell you to apply online, but career fairs are worth going to and the lines are generally worth waiting in. It's a few hours of pain for long-term success. Just go. There are also ways to make these conversations more worthwhile. Take some time to talk to some of the shorter-lined companies that still have great programs that you may just not know about. A lot of these can lead to genuinely interesting conversations with an engineer that can lead to an email for you to reach out to later.\n\n**Cold emailing**: in my opinion, cold emailing is very underrated. Outside (or in addition to) career fairs and when you don't have a referral, I think it's the best thing you can do. Your success rate from cold emailing will depend on the timing of which you send the email so that it doesn't get buried in the recruiters inbox, the quality of the email, and how impressive of an applicant you are.\n\nFinding the email of a university recruiter at the company and sending them an email expressing your interest in the company, the work they do, and that you're interested in an internship is a good way to get in contact with a company. I think cold emailing can be as effective as career fairs depending on the company, and it's infinitely better than throwing your resume into the black hole of online applications. In the absolute worst case, you just don't get a response from the recruiter you email. \n\nAn additional note is that I usually apply online to the company around the same time that I send the cold email because there's no reason not to, and sometimes the recruiter could miss your email or forget to respond, but your online application will get picked up and put you into the interview process.\n\nThree questions you might be having at this point are:\n\n1. How do I find the email address for the university recruiter at X company? \n2. What do I put in the cold email?\n3. When should I send it?\n\nLet's answer them separately.\n\nFor question one, I use a gmail plugin called \"Clearbit Connect\". I have found this plugin extremely useful and does everything I need it to do. You can install it easily for gmail, then within gmail, you can search for email addresses of employees at companies by position, very easily letting you find the email address for \"university recruiter Facebook\", if that was your search query.\n\nFor question two, I will include an example email edited for anonymity directly from my inbox that I sent last year when applying for new grad roles. I think there is a key to it to stand out beyond \"I am interested in your company's internship / new grad program.\" You need to specifically mention WHY you are interested in this company. What is it about the work they do, their company culture, etc., that makes you want to apply. I know it's hard to think about that specifically because many times you are just applying to anything and everything, but believe me, finding a way to make it specific to the company, even just a little bit, goes a long long way. \n\nAnyways, onto an example. I sent this email (and included my resume as an attachment) at the end of July 2019 to a recruiter I found through clearbit, inquiring about full-time jobs:\n\n\\---\n\nSubject line: COMPANY NAME New Grad 2020 SWE Interest\n\nHi RECRUITER NAME,\n\nMy name is JOHN SMITH, and I’m a senior in computer science at the University of Anonymous. I’m graduating this year (Spring 2020), and this fall / late-summer I’ll be looking for a full-time software engineering role for after graduation.\n\nI’m currently a software engineering intern at COMPANY A. Previously, I was a software engineering intern at COMPETITOR working on PROJECT.\n\nFrom my time at COMPETITOR, I gained a strong affinity for the type of work done at YOUR COMPANY — particularly working on RELEVANT DOMAIN DETAIL, and I have also heard wonderful things about the environment and culture at YOUR COMPANY.\n\nI’m very interested in starting a conversation about potential full-time roles for after graduation in 2020. I know it’s a little bit early, but since return offers from previous internships will likely have a deadline a few weeks into the school year, I figure it's better to get the ball rolling as soon as possible. Additionally, I went ahead and attached my resume to this email, so that you can learn a little more about me.\n\nI’m excited to start the conversation and learn more about YOUR COMPANY!\n\nBest,\n\nJOHN SMITH\n\n\\---\n\nFor question three, I think emails should be sent so that it arrives in the recruiter's inbox close to the start of the workday (anywhere from 8-9am in their timezone should suffice). You're probably thinking to yourself, do I have to wake up at 8am to send an email? The good news is no, you don't. There is a gmail plugin called Boomerang that lets you write an email and schedule it to be sent at a future time. For example, you can write the email the night before at 9pm and schedule it to automatically send at 8am the next morning, when you're still peacefully asleep.\n\nFor all of the above, again, having a well-prepared resume here is a prerequisite.\n\n**Passing the interview**\n\n95% of technology companies will ask leetcode (leetcode.com) style data structures and algorithms problems. The interview will generally be 45-60 minutes in length and ask 1-2 leetcode style coding questions around the \"medium\" difficulty level. The amount of help you're expected to receive will depend on the company, but generally speaking, you should be able to come up with working code to solve the problem with an optimal time-complexity solution in roughly 30 minutes for a \"medium\" difficulty question without too much assistance. Some interviews might be an exception on the easier side and ask a couple of questions that are more \"easy\" difficulty, and some might ask a question closer to the \"hard\" difficulty.\n\n**What interviewing is actually all about:** You’ll hear people complaining all over about how technical interviewing is bogus and algorithms problems are irrelevant to real world work, etc. One thing to keep in mind is your actual process and discussion with the interviewer. At some companies, solving the problem may be all they care about. But at most places, they are actually very forgiving and want to see how you code and how you approach the problem. Your discussion about trade-offs, your thought process, your verbal communication, your ability to implement once an algorithm is in place--these are all way more important than the actual solving of the problem to most companies. Of course, it’s difficult to focus on these things a lot of the time since many interviewees will get stressed out about solving the problem and not handle it well. It’s mostly important to keep a cool head--start with the dumbest solution you can think of and discuss from there. As long as you can communicate and move forward and keep coming up with ideas and thoughtful genuine technical discussion, the interviewer is likely to think you have good general problem solving ability even if you didn’t come up with a perfect solution right away. With that being said, preparation is still important and that’s discussed more going forward.\n\nMy general view is that technical interviews can be a bit of a crapshoot, and you might be fully qualified to work somewhere, but you just happened to get an interview question that you were unable to solve effectively. That happens sometimes, and all you can do is learn to move on. There are plenty of good technology companies out there. HOWEVER, I think that your goal should be to do sufficient leetcode practice such that you go into an interview comfortable with your programming and problem-solving ability for these kinds of questions, aiming to reduce the performance variance based on any question specifically as much as possible. There is absolutely a pattern to the kinds of questions asked, and you can definitely be in an interview and given a question that is similar to something you have seen before, either in a different interview or in your practice, and it will make the interview substantially easier.\n\nIn my opinion, for internships, if you can comfortably solve arbitrary leetcode \"medium\" difficulty questions in roughly 30 minutes or less with the optimal time-complexity solution, you are good enough at these problems to pass a good amount of technical interviews. As a reference point, by the beginning of my junior year fall, I had solved roughly 100 problems on leetcode (I have currently solved 110 problems). It varies per person, but I think this is generally a reasonable number such that if you hit the right areas, you can go into your interviews feeling confident. If I had to guess, the breakdown of those 100 problems is 30-40 easy questions, 40-50 medium questions, and 5-10 hard questions. I have only come across a \"hard\" difficulty question a handful of times in my interviewing experience, and to be honest, I'm not sure that difficulty level is worth preparing for, at least for internships, since they don't appear very often. However, the bar could be increasing for internships, and companies could start asking harder questions as the field becomes more competitive.\n\nI also want to include that these types of questions are not easy. Even the medium level questions, and some easy ones, can be quite challenging when first starting out. There will definitely be times you struggle very hard and just can't figure out a question, and that's okay. Practice makes perfect, and it's all about practice.\n\nCertain data structures topics come up more often than others in these kinds of interviews. Here is a dump of the topics I think are the most important to focus on. These correspond to the \"Tag\" of the problem type in leetcode (ordered roughly by importance, but all of them are important):\n\n1. Hash table\n2. Tree\n3. Linked list\n4. Array\n5. String\n6. Dynamic programming\n7. Stack\n8. Heap\n\nFeel free to PM me if you have any questions. I'm happy to help.",
      "subreddit": "cscareerquestions",
      "score": 1134,
      "url": "https://reddit.com/r/cscareerquestions/comments/htrai2/how_to_get_a_software_engineering_internship_at_a/",
      "comments": [
        {
          "body": "&gt;  There is a gmail plugin called Boomerang that lets you write an email and schedule it to be sent at a future time\n\nJust wanted to mention this is a regular Gmail feature now, so there's no need to install this extension",
          "score": 217
        },
        {
          "body": "Something to consider for cold emailing is that most recruiters that work for companies WANT to hire people (it's their job after all).\n\nPolitely asking them about opportunities can be good. \n\nBut, make sure it's actual fulltime inhouse recruiters and not 3rd party ones.",
          "score": 126
        },
        {
          "body": "I’m coming up to my last year of undergrad and haven’t been able to find an internship for this summer. I heard some companies start new grad hiring for spring 21 around late summer/fall so I was wondering if I should just stop looking for internships and start doing some projects(I already have 3 but maybe I can add better ones or refine the ones I already have)/leetcode practice instead in preparation for this?",
          "score": 40
        },
        {
          "body": "\\[As a graduate\\]\n\nIf you go to a top tier, or upper tier school, your best bet is university recruiting. They're there literally LOOKING FOR YOU.  Don't skip this.  Go to it.  Apply.  Do the on-campus interview (if your school does it).  It is, 100%, the easiest way to get your foot in the door at a high end tech company.  I got my graduation job at \\[BIG 5 COMPANY\\] this way.  DO NOT DISCOUNT IT.\n\n\\[As an interviewer\\]\n\nUnless your coding skills are \\*terrible\\*, I am completely more interested in seeing how you work on a problem than caring about if you manage to find the correct solution in the given amount of time.  As long as you're on the right track, asking the right questions, showing momentum, and paying attention to the hints I start dropping so I can see you write code then you're in good shape.\n\nDon't panic.   And never, ever, stop talking.  Even (especially) when you're stuck.",
          "score": 23
        },
        {
          "body": "There's a lot of problems on LeetCode, so I want to focus on ones that matter the most. Would you say that the \"Top Interview Questions\" category is a good representation of real interview questions? Also, if you paid for LeetCode premium for the company specific questions, were they worth it?",
          "score": 15
        },
        {
          "body": "I want to +1 the part about communicating during the interview. The technical question isn't some kind of exam question where the only thing that matters is having the right answer at the end. Being able to talk through your process is good, and being able to show how you broke the problem down into smaller steps is a great thing to say/show the interviewer.",
          "score": 11
        }
      ]
    },
    {
      "title": "Hey guys, how hard is it being a lead?",
      "body": "I only have 2 YOE, then got laid off and by divine intervention, got reached out by a recruiter from capital one saying they were impressed with my resume and wanted to schedule an interview for being a full stack lead. Job entails managing a team of \"deeply experienced engineers\". I've had experience tutoring people and was a swim instructor at some point. That's really about all the people management skills I have.\n\nEDIT: I gave myself an extra YOE just to clear the 3YOE requirement they had on their applications. \n\nUPDATE: it was legit, you guys are actually dumb lmao. Verified capital One workday HR reached out to me to confirm it's real. I will be having an interview sometime in April. ",
      "subreddit": "cscareerquestions",
      "score": 28,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ioc5d0/hey_guys_how_hard_is_it_being_a_lead/",
      "comments": [
        {
          "body": "If someone gave me 10 yoe, a lead with 2yoe.  I'd fucking quit so fast",
          "score": 373
        },
        {
          "body": "Bro that’s a scam. Ain’t nobody at capital one being a tech lead as a not even mid level engineer\n\nAlso 95% of management jobs hiring outside candidates require previous management experience (and no swim team doesn’t count)",
          "score": 144
        },
        {
          "body": "Lead’s job is very hard. In essence, you are the responsible one. You must manage up and down. But you can’t manage down exactly since you are not the one with power to fire people or give out bonuses, so you find other ways to enforce your decisions. Managing up is really being the person who gets yelled at on behalf of your team in VP and product meetings.     \nPersonally it’s not worth it. Too much responsibility for the sake of responsibility ",
          "score": 31
        },
        {
          "body": "don't worry you're not getting hired as a lead\n  \n2 possibilities, either they'll ghost/reject you after the initial interview, or the hiring manager decides \"meh, I guess /u/neverTouchedWomen will make a fine junior SWE\" and that's the job offer you'll receive",
          "score": 61
        },
        {
          "body": "i was at crapital one, and ive never heard of anyone being a tech lead with only 2 YOE. the TDP's become SA's in 2 years and dont manage shit until they have like 4-5 years.",
          "score": 54
        },
        {
          "body": "Sorry to be the bearer of bad news...  But most likely it's just a recruiter trying to fill their pipeline and show their client that they are actively looking for candidates for them. \n\nNo one with 3 YOE would ever be considered for an outside hire team lead, it's possible for an internal hire to get bumped up to team lead at 3 YOE with a company, but not an outside hire with so little experience.",
          "score": 15
        }
      ]
    },
    {
      "title": "How to not be unhireable",
      "body": "I feel like I'm just a leech doing nothing useful every day I'm not getting a job. Thousands of applications and only a small handful of interviews / calls have gone nowhere so they have amounted to a total waste of time. I'm applying all over the place, for pretty much anything remotely CS related I have most of the experience for so it's not like I only look for remote stuff or $100k+ stuff (in fact I don't even apply to positions that pay that much anymore because I know their standards are too high for me to meet). I have more personal projects that aren't on my resume but they are not really something that I can put on my resume as they don't generate money, aren't complete projects and have no users and aren't particularly impressive in any way, so in effect I am not doing anything at all every day.\n\n[worse resume link](https://imgur.com/a/eUrbC84)\n\nHere's a version of my resume where I removed the non programming stuff, the imperfect GPA, the irrelevant degree, the skills not related to positions on the resume as well as the video game projects as they probably don't count as real projects. To me it just looks even worse in every way and there is zero chance I can get hired with it? Does this mean I am unhireable? It looks like I didn't get anything for the past few years and thus I am a terrible employee that nobody should ever hire. There's also way too much white space because there is nothing more to say about each position that isn't just restating the same things over and over or saying extremely basic stuff (like they don't need to know the exact random libraries I used and it probably would look bad on me for talking about those? I also heard that me talking about something as basic as ajax requests is also bad?)\n\n[more complete resume link](https://imgur.com/a/iaYDKYg)\n\nEven with the more complete resume it still feels very terrible in terms of me competing with other people (I feel like maybe the bar for entry level is having several years of highly relevant non internship experience which I'm never going to get if I don't get a job). Adding in the skills for each position also breaks it when I put it into Workday so I have to get rid of them? It doesn't matter if it looks better to a human recruiter if the system parses it so badly I get trashed immediately so I should remove them?\n\nI just don't know at all what I should be doing to get a job? I haven't been working on \"real\" projects because I don't know how to make those (a project isn't real unless it's generating money and/or has a ton of users?). I know there is a definitive thing I should be doing but I don't know what it is? No amount of \"just do it\" is going to help me find that correct answer, I can't \"just make a game\" like my parents want because that is something that requires years of (non programming) work to make something profitable, and even then companies don't even see video game projects as real projects so all that effort would not help me even slightly?",
      "subreddit": "cscareerquestions",
      "score": 16,
      "url": "https://reddit.com/r/cscareerquestions/comments/1o4yzi1/how_to_not_be_unhireable/",
      "comments": [
        {
          "body": "Don't have any advice for you. \n\nI've made the complex AWS applications start to finish, and have everything well documented and a nice visual devops pipeline setup complete with protected secrets and etc. \n\nManually trained a CV vision model, solving a real world problem for a government agency.\n\nI've conclude unless it looks like it has real market value with active users, then no one cares about them period.\n\nAll the bullshit about, \"Solving a real problem,\" is just all bs.. unless they can look at something and it looks like dollars potentially for them somehow, they don't care.\n\nI fucking hate it myself dude. I did the suggestions, heard the rhetoric here over and over, and it's just a club now, and we aint in it.",
          "score": 21
        },
        {
          "body": "Just want to say that I'm finishing my Master's in math at PFW, after a Bachelor's in math at PFW.  I don't even have internships.\n\nSo...it could be worse.",
          "score": 9
        },
        {
          "body": "IMO, put experience on top. And swap out your projects that will have more keywords that match the job description.",
          "score": 6
        },
        {
          "body": "I'm a hiring manager at my company. I think your resume looks good. I wouldn't worry so much about whether or not you worked on an application that has lots of users or made a lot of money. I would rather see a candidate at your level contributing to an open source project or their own passion project where I could see their source code.\n\nThe market is difficult right now and competition is tough. I had three great candidates for the last role I hired for and could only pick one. Any of them would have done a fine job in the role, but I only had one opening.\n\nI also would still try for higher paying roles, even if you think that you're unqualified. Someone might see your resume and be willing to give you a chance,. especially if you're more affordable than the other candidates. Don't sell your skills short.\n\nIf you get the interview, be passionate and knowledgeable about the company you're interviewing with. Be able to talk about the items on your resume in detail. Be a good communicator and a team player. Make the person think you're a hard worker. I know that sounds silly, but you'd be surprised at the number of candidates who I interview who only want to work with certain technologies and don't want to do anything outside of their degree.\n\nTry to be one of the first people to apply for every role you see. Candidates who apply early at my company have a huge advantage.",
          "score": 11
        },
        {
          "body": "For most people, it’s not the resume it’s the job market. You either need hard experience and/or solid networking. This is how most (not all) entry level jobs are given out nowadays. \n\nAI, offshoring/h1b in a slowing economy mean it’s primarily being used streamline company operations not grow it. Outside of a few companies for which AI is a direct or major part of of their services or product, everything has slowed down . And until it does most people especially in tech are going to struggle to find a job because there aren’t many\n\nYour first resume is shit, but there was a time before 2021 where I saw my peers get regular interviews and eventually jobs with less experience and worse looking resumes",
          "score": 3
        },
        {
          "body": "[deleted]",
          "score": 2
        }
      ]
    },
    {
      "title": "Over 5 YOE and genuinely kinda lost right now",
      "body": "My first job out of college was with a company that controls 70% of its industry's market share, but it's not well-known at all and located in Florida. I've been wanting to get out for the past couple years but I picked up a personal project that's kinda meandered. I've been here for over 5 years now.\n\nI've applied to about 5 companies a week within the Fortune 500 since April, and I'm not even getting requests for a phone interview. I've upgraded to LinkedIn Premium so I could message recruiters, I'm paying for Resume Worded so that I can tailor my resume to the job description, I have AWS and ScrumMaster certs, but none of these have been of any benefit.\n\nThe only interaction I've had is with a competitor to my current company that's even smaller. Just before a scheduled phone interview, the recruiter messaged me to let me know the interview wasn't gonna happen because the team reviewed my resume and didn't see enough Java experience, even though I've worked mostly with C#.\n\nSince I'm applying to senior positions with many years under my belt I didn't think I'd have these problems, but given the lack of responses I'm wondering if any of these are contributing to my problem:\n\n* Florida is so far away that a company wouldn't want to pay for relocation\n* My current company isn't ranked well or recognised when I apply to Fortune 500 companies\n* Not enough Java in my experience\n* My certs are expired\n* I don't have enough connections on LinkedIn\n* Workday has a history of my applications when I was trying to find a job post-graduation and thus I come across less experienced than I actually am\n* I'm waiting too long to re-apply to a company after being ghosted or rejected\n* I'm applying through company websites when I should be applying through something else\n\nBut really, I feel like there's something else that I haven't considered yet. Any clarity would be really helpful.",
      "subreddit": "cscareerquestions",
      "score": 140,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ef00ar/over_5_yoe_and_genuinely_kinda_lost_right_now/",
      "comments": [
        {
          "body": "The main problem is 5 applications a week. At least make it 5 applications a day.\n\nWhat people don’t get is finding a job is a low fidelity business process. It takes a thousand applications to generate 10 leads, and 10 leads to acquire one offer.",
          "score": 203
        },
        {
          "body": "&gt;Since I'm applying to senior positions\n\nAre you *only* applying to Senior positions? If so, I think you're limiting yourself.\n\nDifferent companies have very different expectations of titles. At some companies you may be considered Senior, but at many you aren't. A lot of companies don't consider someone as Senior until around 8 YOE. You may be a SWE 2 at companies like that.\n\nSome companies have very flat title structures as well, where someone's just \"SWE\" for the first 8 years. Some companies might not even have a \"Senior SWE\" title at all. Some companies don't even call their SWE roles SWE, they use non-traditional titles like \"Application Developer\", \"Project Engineer', \"Ninja\", etc.\n\nDon't get hung up on titles. Look for job postings that have a YOE expectation close to 5 years. Those are the roles you're qualified for, doesn't matter if they have the word \"Senior\" attached to them or not.\n\nIf you're not getting calls *at all* the problem is either your resume, or the roles you're applying to. It can't be anything else. Your resume is all these companies see about you at this stage.\n\nDo not use a resume service. Learn what makes a good SWE resume so you can know how to write one yourself without relying on an AI platform, or feedback from internet strangers. *You* should know how to write a resume. It's weird that people spend 4 years getting a degree, hundreds of hours grinding leetcode, and then.... 30 minutes on a resume. SWE resumes follow the rules of tech comm, which is a whole field of study. Look into tech comm, and what makes a good technical document, and rewrite your resume from scratch using that knowledge. Don't ask others for feedback, don't listen to an AI.\n\nI'm positive Resume Worded has done you more harm than good.",
          "score": 38
        },
        {
          "body": "It’s probably your resume.  I don’t know anything about the Resume Worded service but I doubt it is any good.  Post your resume here or at r/EngineeringResumes .",
          "score": 28
        },
        {
          "body": "5 years of experience in this climate attempting senior is a bit ambitious (imo). Experience got severely devalued because of the amount of applicants. I've seen people 10+ years of experience applying for senior while hiring. On top of that, you're applying for far too few jobs. And applying for jobs outside of Florida is probably low hit rate because there's too many candidates. The first thing recruiters will do is filter for location unless you're an exceptional candidate in a very niche role.\n\nAlso in this market, if someone's looking for a Java dev, they don't have to settle for a C# dev. Because there's a lot of Java devs looking for a job. You will get filtered for that too. This is not the market to be jumping tech stacks or fields.",
          "score": 20
        },
        {
          "body": "You only have 5 years of experience and are applying for senior positions. I would suggest you look at mid positions instead.",
          "score": 14
        },
        {
          "body": "A few suggestions \n* renew your certs \n* grow your presence on LinkedIn \n* rewrite your resume with help from r/engineeringresumes\n* go to networking events \n* work on side projects to get more experience with things like Java \n* send more applications, 5 per week is not a lot \n* consider starting a technical blog ",
          "score": 15
        }
      ]
    },
    {
      "title": "Has anyone here ever been referred to Barclays? What was your experience like?",
      "body": "Hey everyone,\n\nI recently got a referral for a role at Barclays and submitted my application through Workday. I was curious if anyone else here has gone through the referral process with Barclays for tech/SWE or data roles.\n\nDid your referral actually seem to make a difference (like faster response time or interview invite)? How long did it take to hear back, and what was the interview process like afterward?\n\nI’ve seen mixed things online since some say referrals don’t help much, others say it at least gets your resume reviewed. Would love to hear any firsthand experiences or timelines from people who’ve been referred or interviewed there recently.\n\nThanks in advance!",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1nwxlu4/has_anyone_here_ever_been_referred_to_barclays/",
      "comments": [
        {
          "body": "barclays suCCs",
          "score": 1
        }
      ]
    },
    {
      "title": "How do you handle asking for more time to consider a potential first job offer?",
      "body": "I have an interview with company A coming up and I think its gonna be a one and done situation. Before this, I interviewed with company B a couple weeks ago but have not received a response when it comes to a followup technical interview (I did check workday for this one and im still in consideration). Nothing is set in stone for either company, but in the event I am extended an offer, how should I go about asking for a time extension to consider the position? Company B is my preferred place, but would it even be worth it to wait and see? ",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/1lwpygl/how_do_you_handle_asking_for_more_time_to/",
      "comments": [
        {
          "body": "Follow up with company B, explaining that you are under time pressure with company A. \n\nLet company A know that you’re still interviewing with company B and that you’d need some leeway regarding your decision timeline.",
          "score": 2
        }
      ]
    },
    {
      "title": "Am I getting Scammed? Dick's Sporting Goods Recruitment Experience",
      "body": "I was sent an email by a \"@dickssportinggoods.work\" email, informing me that I'm a good fit for a software egnineering role, and that they want to interview. To set up the interview, I have to message the hiring manager on Teams or via email. I message her via Teams. \n\nWhile waiting for her response, I start to do some research. Both the hiring manager and the person who reached out to me have less than 50 LinkedIn connections. Also, the pay mentioned in the prejob briefing pdf (that was attached to the email) is $90/hour which is very, very high for the entry level). I also log into my workday account for Dick's sporting goods and see that I have no active applications, and that my last one was in September.\n\nThe hiring manager replies to me on Teams. After some pleasantries, I'm informed that it's a text based interview, and that the hiring manager's ready to take the interview right now if I'm ready. I say yes. I'll be asked some technical questions to which I'll have to respond and sign off with \"DONE\" to signify that I'm ready for the next question. I'm asked some basic, open ended questions about multithreading, security, and scalability. At the end, I'm asked about my location, email, and phone number. At this point, I have my suspicions, but in case this is genuine, I don't want to blow it off, so I can't fake my phone number or email. I give a different location but send my real phone number and email. \n\nThis is the last message the hiring manager sends me. The english definitely has quirks:  \n  \n\"Alrighty. Thank you for your time, that will be all for now. We have come to the end of the questionnaire, your answers are being forwarded for review. You will be contacted with updates on your stand regarding the position via email or phone so ensure you stay reachable okay!\n\nAlso, you should have the teams app installed on your mobile for quicker reach.\n\nYou, have a good one!\"\n\nAnd that's all. Does this make anybody else suspicious? ANybody have any idea about what the process looks like for Dick's sporting goods?",
      "subreddit": "cscareerquestions",
      "score": 0,
      "url": "https://reddit.com/r/cscareerquestions/comments/1h5016o/am_i_getting_scammed_dicks_sporting_goods/",
      "comments": [
        {
          "body": "Scam. The domain is newly created. Nobody hires someone for $90/hr without actually interviewing them (a questionnaire isn't an actual interview).\n\nThe next step will be a congratulatory email for you being selected, eventually telling you that you'll be receiving a check for equipment and software.",
          "score": 29
        },
        {
          "body": "[removed]",
          "score": 10
        },
        {
          "body": "https://www.whois.com/whois/dickssportinggoods.work\n\nThe domain was registered last week.  2024-11-25\n\nIt is unlikely that this is actually Dicks Sporting Goods.\n\n---\n\nedits...\n\nThe actual jobs domain is https://www.dickssportinggoods.jobs\n\n(Yea, that's not a great thing to be using those non-dot com domains - they bug me)\n\nHowever, looking at the ICANN lookup there https://lookup.icann.org/en/lookup for dickssportinggoods.jobs you will see:\n\nCreated: 2005-12-06 05:00:00 UTC\n\nAlong with a public registration:\n\n    Name: Domain Admin\n    Organization: Dick's Sporting Goods\n    Email: administrator.domains@DCSG.COM\n    Phone: tel:+1.7242734042\n    Fax: tel:+1.7242734042\n    Mailing Address: 345 Court St, Coraopolis, PA, 15108\n    ISO-3166 Code: US\n\nThat verifies that yes, that domain is who they are.  So the .work domain is not likely to be proper.\n\nYou may wish to report this to the email for the domain administration for trademark violation.",
          "score": 9
        },
        {
          "body": "I would never even open an email from such an obviously fake URL",
          "score": 8
        },
        {
          "body": "&gt; @dickssportinggoods.work\n\n\nYou're clearly being spammed. What's that entire wall of text needed for?",
          "score": 5
        }
      ]
    },
    {
      "title": "Look for other jobs or stay at chill remote current job? [New grad advice]",
      "body": "New CS grad here looking for advice. I started my job 3 months ago at this mid sized-company. TC is 100k (base 83k, and 17k bonuses at 1 year anniversary). \n\nHere are the pros:  \n\\- Fully remote  \n\\- 7 hour workday (35 hour work week)  \n\\- Great team and WLB\n\nCons:  \n\\- Not traditional SWE (DevOps)  \n\n\nWhen I first joined, I planned to stay here until I get into a FAANG company because I wanted to do SWE and not DevOps. I have been grinding hard for the past 3 months (LC count 300+). I have not applied anywhere yet even though I have had recruiters reached out. Now I am debating whether or not I should switch jobs and apply, or stay where I am. It is a difficult decision given all the factors like the current job market, layoffs, hiring freeze, etc...  \n\n\nI am genuinely asking:   \n1. What would you guys do if you were in my situation?  \n2. If I stay only for 1 year to get the 17k bonus, would it be difficult for me to get interviews for SWE? Since I would have 1 year experience in DevOps by then and no SWE experience.  \n3. New grad advice in general\n\nPlease give me your advice. Thank you.",
      "subreddit": "cscareerquestions",
      "score": 32,
      "url": "https://reddit.com/r/cscareerquestions/comments/x3c4r4/look_for_other_jobs_or_stay_at_chill_remote/",
      "comments": [
        {
          "body": "I think looking after a year won't be an issue assuming you still can do the programming interviews. Dev ops experience is typically desired regardless of role if you're in software, just because having an understanding of dev ops can help for everyone. \n\nAssuming you enjoy dev ops work though, you could probably land a really nice role as a dev ops engineer because those are typically in high demand compared to regular software engineering.",
          "score": 31
        },
        {
          "body": "I love to see that you are making progress towards this goal and I whole heartdly wish that you get the job of your dreams. Man I am in kind of a similar position to you. I started working just a few weeks ago and I want to go for the FAANG comapnies, because I feel like I deserve better, I desrve a higher paying job. My 2 cents, is that keep the current job and keep applying for other jobs, the ones which fulfills your dreams. Please do let me know what becomes of you. I wish you all the best and may your days ahead be fair.",
          "score": 13
        },
        {
          "body": "get some certs at the company's expense",
          "score": 7
        },
        {
          "body": "Honestly, if you love your team, are not crunched for more pay, and generally getting more experience and knowledge, just stay. You're only 3 months there and right now you're probably comfortable and maybe even thinking about all the high TC's we see on this sub and on youtube. \n\nI would say after 1-2 years, if you feel you're not being ambitious with your career, then make the jump for big tech. There is absolutely no rush for bigger pay unless you truly want it. Since you're a new CS grad, this is most likely your first real job. Get as much experience and knowledge as you can first. I'm in the same boat as you too. I think about getting into big tech, but I want to gain experience and knowledge working on an enterprise level code with a team first. I want to experience being a useful and integral part of a system, then strive for more ambitious things later on.",
          "score": 5
        },
        {
          "body": "Stay at your current place. Peace of mind + WLB &gt;&gt;&gt; anything-else",
          "score": 9
        },
        {
          "body": "It’s great to be making six figures as a new grad. I would say stay but my situation for me is different. That is why I’m looking.",
          "score": 2
        }
      ]
    },
    {
      "title": "How do you all stay sane while applying for jobs?",
      "body": "Whenever I’m on here, the #1 piece of advice given is to just keep applying to more jobs. But applying to jobs is exhausting and idk how anyone does it. \n\nI just graduated college with a cs and math degree and I’ve been applying for pretty much my whole senior year, and I am going insane. I get some responses but nothing ever seems to work out. Now that I’ve graduated, applying to jobs is my main priority and it’s only been a few weeks but damn this is awful. \n\nI’m trying not to base my life around doing these applications, but damn it’s so demoralizing getting ghosted and rejected all the time. \n\nThis is what’s been helping me so far, but I’m still going insane. \n\n1. I never fill out applications at home, I always go to the library or a cafe or something\n\n2. I don’t apply for more than 3 or 4 hours at a time. \n\n3. I only apply on weekdays. My goal is to never work a job that makes you do weekends, so I apply the same way\n\n4. I have job descriptions written out in sentences to copy and paste into workday applications \n\n5. I have hobbies and regularly go out with friends \n\nThe best things that lead to interviews for me is finding stuff through connections, but working to build those takes a minute but I am working on it. \n\nEven with all of these strategies, I still feel awful while I’m applying to jobs. Does anyone have any other advice?",
      "subreddit": "cscareerquestions",
      "score": 20,
      "url": "https://reddit.com/r/cscareerquestions/comments/14hgng1/how_do_you_all_stay_sane_while_applying_for_jobs/",
      "comments": [
        {
          "body": "A recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface .\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n&amp;#x200B;\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of r/reddit.com, who are the admins of the site: message [/u/reddit](https://www.reddit.com/u/reddit/): submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on [r/reddit](https://www.reddit.com/r/reddit/), such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at [r/ModCoord](https://www.reddit.com/r/ModCoord/) \\- but please don't pester mods you *don't* know by simply spamming their modmail.\n3. **Boycott** ***and*** **spread the word...to Reddit's competition!** Stay off Reddit as much as you can, instead, take to your favorite *non*\\-Reddit platform of choice and make some noise in support! \n\nhttps://discord.gg/cscareerhub\n\nhttps://programming.dev\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I'm not staying sane. I don't think anyone around me can tell but these applications and rejections are killing me. I was managing until this week and idk it crossed a threshold and now I'm just so broken down. Part of it is trouble getting a regular job rn too to hold me over--I've never seen so few jobs like the kind I used to pick up in college just for pocket money--rn even many of those, at least in my city, seem to have nearly vanished. I feel like I'm in a parallel universe.",
          "score": 19
        },
        {
          "body": "Relatable. It's tough out there :(",
          "score": 9
        },
        {
          "body": "Just a tip to make applying for jobs slightly more bearable: use simplify. The plugin/extension basically auto-fills the usual fields job postings ask for (name,education,work experience, race,etc). It doesn't do this for every website, but when it does works it makes applying for things faster.",
          "score": 7
        },
        {
          "body": "[removed]",
          "score": 6
        },
        {
          "body": "When I was doing it last summer I used an autofiller: [https://simplify.jobs/autofill](https://simplify.jobs/autofill) \n\n90% of the questions are the same and it works on Workday, Greenhouse, and Lever.\n\nWake up, make coffee, turn off brain, and carpet bomb applications. Don't put any emotional investment into your applications because doing so will strip away your soul. I could do 10 applications in an hour, and I never used the \"Easy Apply\" button.",
          "score": 6
        },
        {
          "body": "Your points are good, I have no complaints with them.  \n\nThe job search is exhausting, and also you just get lucky when the right interviewer finds you, chats to you, likes you and gives you a job.\n\nAccept that there are thousands of applicants going for one job.  Companies have ways to filter out applications and you may need to adjust yours slightly to try to stand out.\n\nYou are right though, networking is the way to go as well.\n\nKeep at it buddy.  Some people just get lucky with getting the job before finishing college. I got my job about a year and a half of applying, but I was also working in customer service in the meantime to make sure I had money coming in (and putting my mind elsewhere instead of stressing about getting a cs job).\n\nAll the best, the job hunt is a slog",
          "score": 6
        },
        {
          "body": "Honestly 9 months of it drove me insane while doing it but once it’s done you do feel rewarded and it’s all good again",
          "score": 3
        }
      ]
    },
    {
      "title": "When an employeer asks if I have any questions, what are some good ones that I can ask?",
      "body": "This has probably been posted before(?) But I tried using the reddit search function in here but didn't really get any relevant results :/\n\nI have a job interview coming up as a backend Java developer and I am completely lost at what kind of questions I should be asking them about the company. All I have been able to come up with myself are some basic ones \"What will my first week look like?\" and \"How does a typical workday usually play out at your company?\"",
      "subreddit": "cscareerquestions",
      "score": 82,
      "url": "https://reddit.com/r/cscareerquestions/comments/8as6kw/when_an_employeer_asks_if_i_have_any_questions/",
      "comments": [
        {
          "body": "* What do you use for configuration management?\n\n* How are code reviews conducted?\n\n* What does your current test coverage look like?\n\nBasically, Google “The Joel Test.”",
          "score": 75
        },
        {
          "body": "Have you worked at any other jobs yet? Remember that you are interviewing the company too, not just being interviewed. Here are a few questions I like to ask based on what I look for:\n\n1. How much heads down coding time is there compared to meetings?\n2. How long have you worked for the company and others you work with?\n3. How would you describe the team mentality and atmosphere? Do people like critique or is everyone in their own silo and defensive about what they have created? (This reveals a lot about if there are assholes that can't take advice and are awful at collaborating)\n4. What do people typically do during lunch and how much time do they normally take? Does anyone go for runs or does everyone order in food and eat at their desk?\n5. What are the core office hours? Do I need to be in the office at 8am sharp till 5pm or are there core hours between say 10am-3pm?\n6. What to you would make me successful in this position? \n7. (Finally in the last interview in person) **I want this job.** Is there anything that concerns you about my ability to perform the job duties and be successful in this position? (At this point you can qualify and ease any tensions they do have, or get a good idea if you are a good fit or not)\n\nThis all depends on your own values, so if you want a large company, maybe don't focus so much on bureaucracy because there will definitely be some. I prefer a small company where I can write a ton of code and feel productive without a bunch of unnecessary meetings and I also want to ensure that I can live my life while also contributing to the company significantly. I find no reason to be bound to an office from 8AM-5:30PM for example if you really aren't being productive that entire time and they allow remote work either at the tail end or start of the day.",
          "score": 51
        },
        {
          "body": "[deleted]",
          "score": 85
        },
        {
          "body": "“If I’m successful, what would be your expectations of me in the first 6 to 12 months”. My mate told me to ask this question on my last interview last week and my interviewer loved it, got him excited. I just got the job this week as a junior mobile developer. I have been clueless asking employer questions after interview. I think it has contributed to me not being able to find a job before I got this. ",
          "score": 12
        },
        {
          "body": "[deleted]",
          "score": 13
        }
      ]
    },
    {
      "title": "I got this Workday email that seems legit but no interview scheduled",
      "body": "I got this email, went to the link which took me to the general job opening list. In my \"candidate profile\" I have no tasks and my application says \"application reviewed.\" What do you think?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1m1szba/i_got_this_workday_email_that_seems_legit_but_no/",
      "comments": [
        {
          "body": "If you read the email it says they will be in touch with you.",
          "score": 2
        }
      ]
    },
    {
      "title": "No update after two in-person interviews, Workday status says “process completed”",
      "body": "I had two interviews almost 3 months ago with a NYC government agency, never got an update despite both moving quickly. Today, I checked my workday portal and it says Process completed with my application moved to inactive. \n\nI followed up with the operation manager last month and never heard back. I’d think they will be fair enough to even give an update after two in-person interviews that I traveled 3 hours for both times.\n\nI am so disappointed and it’s my 18th month of getting rejected from every interview so it particularly hit me hard.\n\n\n",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1nobrk1/no_update_after_two_inperson_interviews_workday/",
      "comments": [
        {
          "body": "Oof, that's frustrating, I'm sorry you're going through this. Gov agencies can be slow, and sometimes status change to 'inactive' after they've filled the role internally or with another candidate. Tbh, keep your chin up and maybe use this to reflect on your experiences, are there patterns in the feedback you can address? It might help to also revisit your interview approach, and maybe try a platform that gives personalized feedback based on mock interviews to tweak your strategy.",
          "score": 2
        },
        {
          "body": "Three months with no update after in-person interviews is rough, especially after you put in the effort to travel. Unfortunately, government hiring processes can be extremely slow and sometimes communication is poor. “Process completed” usually means they’ve moved on with another candidate.\n\nIt sucks, but try not to take it personally. Keep documenting your applications, follow-ups, and networking, you never know which connection will finally open a door. Your persistence will pay off eventually.",
          "score": 1
        }
      ]
    },
    {
      "title": "Daily Chat Thread - November 09, 2018",
      "body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all).\n",
      "subreddit": "cscareerquestions",
      "score": 6,
      "url": "https://reddit.com/r/cscareerquestions/comments/9vid2x/daily_chat_thread_november_09_2018/",
      "comments": [
        {
          "body": "do you get a email from amazon if someone refers you? because my friend referred me but I never got a email",
          "score": 0
        },
        {
          "body": "Has anyone interned at Squarespace?",
          "score": -1
        },
        {
          "body": "A company scheduled an onsite with me that was kind of unavoidable. So I had to contact another company to reschedule my phone screen, I mentioned what happened. Did I fuck up? ",
          "score": 0
        },
        {
          "body": "What is Capital One TDP SWE pay like?",
          "score": 0
        },
        {
          "body": "Is there any thread about “How many times people apply to get a job/internship”?",
          "score": 0
        }
      ]
    },
    {
      "title": "Slowly slipping into depression due to work possibly. Not sure if lazy fook or i should move to the mountains with goats after just 2 years",
      "body": "Tl/dr: scrum? ruining my life? :) Being low mooded for the rest of the day due to work frustrations. \nHow would you deal with almost everyday feeling like taking a sick leave / longer unpaid vacation / quiting (not wanting to work)?\n\n\nThis is my first job (over 2 years there), learned a buncha, was going up and down in terms of amount of work, from overtime to just a few hours, pressure, depends on the project etc. I dealt with it, it was okay. \n\nOn current project, organisation (scrum?), those timely tasks combined with semi pushing for deadlines make me frustrated with work, not having will/want to work(or it could be just me being lazy fuck, but i kinda do feel like i wanna learn something new, expand knowledge, just the stuff on this project, makes me, really not wanting to work, and not have energy for learning other stuff on the side). \nOn top of that project i interview people sometimes and do some research work so to say (for questions for the interviews lets say). And those are cool. It's all the project i think that makes me not wanting to wake up on a workday (except Friday, i like Fridays).\n\nSo, i figured, my non work time of the day (even some weekends) are highly affected by it. Im more down in general, frustrated, low mood etc. (I do workout every other day or so, trying to be outside after work, tho i kinda sleep bad, 6-7h a night max). \n\nNot to go for too long, I don't know what to do atm. \nShould i just quit, should i ask for some 1-2months of unpaid vacation/sick leave. I see my well-being slowly deteriorating. I am just not sure if its the work or is it me being down that reflect on work. (Which i know, should be a question for psychologist, and not here.)\nDid you have such periods, how did you dealt with it?",
      "subreddit": "cscareerquestions",
      "score": 34,
      "url": "https://reddit.com/r/cscareerquestions/comments/wjy5v7/slowly_slipping_into_depression_due_to_work/",
      "comments": [
        {
          "body": "If you find yourself in a difficult place in your life, we urge you to reach out to friends, family, and mental health professionals. Please check out the resources over at /r/depression, /r/anxiety, and /r/suicidewatch. Feel free to [contact the /r/CSCareerQuestions mods](https://www.reddit.com/message/compose?to=%2Fr%2Fcscareerquestions&amp;subject=&amp;message=) for more information or help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Ok so when I was doing bachelors while working full time only thing that helped was periodic vacation and full at least 8 hours of sleep when I could. In your case I would probably try to take vacation for 1 month and see how it goes, during this time you can have a rest and maybe check what offers can you get from other companies, if you leverage fact that you are still employed and not afraid of rejection, you can get some juicy offers",
          "score": 18
        },
        {
          "body": "I've been there. Here's what I did and it helped:\n\n-see a psychiatrist and check with him if you have a depression - get pills if he says you need them\n\n-sleep 10h a day\n\n-work from home\n\n-gym/swimming after work on regular basis,\n\n-change your job if you hate it,\n\n-Google: Harvard med healthy eating - follow their advice on nutrition.\n\nThe longer you wait, the deeper hole you're digging for yourself and the harder it will be to get out.",
          "score": 10
        },
        {
          "body": "I've been working in engineering for a bit now, and a shocking number of my colleagues live in the mountains (or whatever their local equivalent is) with goats (actual goats that they own)... So that's normal maybe?\n\nIn all seriousness though, I know that feeling of being too drained to do your hobbies, then feeling bad about never doing anything fun.  If you have something you like to do that can be picked up and put down, reading, drawing, whatever (I paint wargaming miniatures), force yourself to do it for like 15 minutes every day like it's your job.  Most of the time you'll probably be glad to be done with it, but with more and more frequency that 15 minutes will morph into a couple of hours.  Then your job will be facilitating your life rather than getting in the way.\n\nAs for sleep, it's very important, but listen very closely to what your body wants.  I wake up, wide awake after 6-7 hours no matter how early or late I go to bed and don't get any benefit from trying to force myself to sleep longer.\n\nEdit: Oh and congrats on exercising!  That's great, and really hard to keep up with!  I need to start doing that...",
          "score": 9
        },
        {
          "body": "I'd suggest alpacas over goats",
          "score": 3
        },
        {
          "body": "I just made a similar post. In the same boat. Mental state is in the shitter. Good luck to you",
          "score": 3
        },
        {
          "body": "i think some people define themselves by their jobs and their ethos is i am my work or all i want to do is code or solve a problem but not everyone is like that; in SE or otherwise\n\ni find it waxes and wanes with project\n\nsometimes it’s super interesting\n\nsometimes it’s boring af \n\ni say try to focus on being well rounded and get fulfillment in general and be more focused on specific things within your job that are interesting to you\n\nif you can’t and are inundated with bullshit and toxic colleagues and culture, consider looking for a role elsewhere\n\nif at a better job with more down time, good balanced culture and opportunities for growth/learning and you still hate day to day, consider a pivot into different kinds or work, either adjacent or completely different career wise",
          "score": 3
        },
        {
          "body": "Older, retired developer here. \n\nI think the younger generations have been sold a bill of goods wrt work. The \"work is my passion\", \"I love my work\", \"Love what you do and you'll never do a day of work\" crap. And then, laid on that is all the pressure of \"I have to keep up with my peers\", \"I have to always be learning\", \"I have to plan my career from day 1\", \"I need to grind leetcode\". Sigh. I get tired just thinking about it.\n\nI mean, yeah, I enjoyed my job. But it was never my passion. I never wanted it to be. There were lots of frustrations, lots of aggravation. I couldn't wait to retire. \n\nThe key is to leave work at the office. You go to work. You do what you have to do. When it's too late to start anything new, go home. Relax. And get a good night's sleep with a clear conscience. Fuck side projects (if its just work relabeled). \n\n&amp;#x200B;\n\nAnyway, final thoughts:\n\n1. If you honestly feel like you need 1-2 months to recover from this job, then leave. \n2. When you do find a new job, tell them your starting date is 2 weeks (or more) later than it really is. Take the vacation then. \n3. Don't take your work home. \n4. Stop worrying about \"sexy\" projects or \"boring\" projects. You're going to work on both. It's just work. \n5. Learn because you enjoy it, not because its expected. \n6. It's not a race.",
          "score": 3
        }
      ]
    },
    {
      "title": "is every dev job a dysfunctional feature factory?",
      "body": "Bit of a rant. I've been in the industry for like ten years now and every place I worked the software is a huge ball of mud. \n\nMy most recent project made me lose hope things would ever be any different. I've been working on this project for 4 years, since the first line of code was laid down. For the first couple years the code was great, but the despite my best efforts, it's turned into a turd. All the other original devs are gone. The new guys don't give a shit about keeping the code nice, and it's degenerated to the point where everything is a huge spaghetti mess. When I'm tough on PR's not being dumpster fires I get talked to by my boss for being too hard on people. So I've given up.\n\n I've joined the dumpster diving crew and write shit hacky code so we can fulfill our ultimate goal of moving jira tickets across the board. It's not fulfilling. I'm not learning. \n\nThe other aspect of the degeneration is replacement of our technical PM's with idiotic talking heads. Our latest PM has never even used the product, in 6 months. They create multiple feature tickets a week and have never touched the functionality. Even though it takes maybe 20 minutes to learn enough to use it. So naturally, the tickets are shit but nobody listens to the devs. Especially jaded ones that have been around forever. I hate to admit it but our shitty PM's are more guilty than the devs for this product becoming trash. I used to push back on all the dumb shit coming down the pipe but I've given up on this too. Being contrarian is pointless when it doesn't buy you anything because the system is so dysfunctional. We've reached the point where about 2/3 of new features are never used by anyone. And 2/3 of existing functionality is and was never used. At least we've hit an equalibrium. \n\nI've been looking around for something more exciting and less dysfunctional, but part of me thinks it's pointless. Every place I've worked has been like this, and I have no reason to believe a new job would be any different. \n\nAre there dev jobs out there where everything isn't a mess? Are there enough of them where it's worth looking? I don't want to go through the interview gauntlet just to end up in the same situation. At least it's comfortable where I'm at now. Like a ratty old chair, every crease of my workday is perfectly molded to my lazy ass.",
      "subreddit": "cscareerquestions",
      "score": 62,
      "url": "https://reddit.com/r/cscareerquestions/comments/idq8tp/is_every_dev_job_a_dysfunctional_feature_factory/",
      "comments": [
        {
          "body": "I feel you man. Aim for greenfield projects and keep changing jobs or do contracting, that's what keeps me sane, I'm never ever taking up a contract for working with legacy code again.",
          "score": 27
        },
        {
          "body": "This is why people change jobs so often. Even if somethings good, it doesn't always last. You say the technical PMs were changed out. Did tech leads, engineering leads change? Good leads dictate the engineering culture. Pay attention when the good people leave.",
          "score": 18
        },
        {
          "body": "[deleted]",
          "score": 33
        },
        {
          "body": "Lol everything's always a mess. Thats why technical debt theory is so prevalent. \"How much of a mess can we tolerate\" \n\nUnless youre talking about personal projects OP you need to stop owning the code you're working on. You are there to do jira tickets and, assuming you're sr dev with your experience, give your opinion on technical architecture and issues.\n\nIf you want ownership over something start a project of your own. You have the experience to make something great. So do it if you're so inclined.\n\nNie mój cyrk,  nie moje malpy\nNot my circus, not my monkeys.",
          "score": 37
        },
        {
          "body": "The biggest benefit of working at a software-first shop is that people *do* actually care about quality, and not just short-term functionality. My experience working in FAANG has been very good along this axis. Developer experience is unparalleled, but ultimately this depends on the team you land on.",
          "score": 7
        },
        {
          "body": "First off, that last sentence belongs in a quote book. Second, I think you might be out of luck. Unlike infrastructure (e.g. electronics, chemical plants, manufacturing facilities, bridges), software is not constrained to specific infrastructure patterns. Heck, even in the physical world this problem exists. Did you know that a good 2-5% of the U.S.’s crude oil sits in one site and all it would take is a single Molotov cocktail to destroy it all? Guess who’s idea it was to progressively build larger and larger tanks instead of planning a distributed structure with less risk in one area and significantly easier+cheaper long term maintenance? It didn’t come from a competent engineer, I can tell you that much. Technical debt isn’t exclusive to software. It’s just a natural virus that evolves with businesses. \n\nBack to your question. If something as critical and regulated as energy infrastructure can become a dysfunctional feature factory, I have low hopes that any software company larger than 15 people doesn’t eventually become one as well. In fact, I think the steady state solution to any network of developers usually ends up being a mudball. Even the large renowned companies mess this up frequently. A lot of them throw 5 juniors at a problem instead of 1-2 seniors because they think that’s how scaling works. In effect, mudballs are what you get when you try to make 9 women have 1 baby in a month. You might have better luck with a small specialist consulting company that works on one product for one type of customer very well. But you’re also sacrificing a lot of stability and pigeonholing yourself into becoming very good at one thing that might not be marketable at any other company 4 years later.",
          "score": 6
        }
      ]
    },
    {
      "title": "Should I take a 6 month Contract dev job as a December New Grad?",
      "body": "I just had an interview with a pretty big Silicon Valley tech company (not FAANG, but big) after applying for the role 2 days ago. They seemed pretty impressed with me and said during the interview they'd get back to me in the next week or so. Less than 2 hours later, the hiring manager emails me for a final interview tomorrow saying she wants to \"finalize things\", which sounds like I'm probably getting an offer. \n\nIn the current climate for jobs I'm inclined to accept the offer, but I'm a little worried that a 6 month contract position will just end up with me high and dry looking for another job as soon as it ends. Then again, I'm an Amazon intern who also has the slim to none chance of getting a return full time offer.\n\nShould I take the big tech contract if offered? I appreciate any advice\n\nEdit: I just got the offer, $55/hour for a hybrid 3 days in office. I appreciate all the advice and I think I'm going to take it. Idk if I should say the name of the company since it all happened so fast and it doesnt look like I've been hired through the normal workday portal (literally I've been applying for months and then I get an offer from a big tech company withing 4 days of applying). I can't fathom a reason to say no because I'm out of college with a 6 figure offer when other people are struggling. If there's some big catch (other than it being a 6 month contract) I'll name and shame, but for now things are looking a lot brighter than the previous doom I've been seeing on r/csmajors",
      "subreddit": "cscareerquestions",
      "score": 18,
      "url": "https://reddit.com/r/cscareerquestions/comments/1ame8lg/should_i_take_a_6_month_contract_dev_job_as_a/",
      "comments": [
        {
          "body": "Great way to get your foot in the door, especially as a new grad with no experience. I left a FTE job for a 6 month contract, wound up getting hired as a FTE at the end of the contract, and stayed there for 6 more years.\n\n\nP.S. bust your ass for those 6 months ",
          "score": 44
        },
        {
          "body": "For new grads, never give up the chance to \n\n1. get work experience. \n2. grow your professional network. who knows, a co-worker may know someone who needs someone.",
          "score": 11
        },
        {
          "body": "Absolutely.  Its hard for new grads to find work right now.  You can always keep looking for something better after taking it.",
          "score": 8
        },
        {
          "body": "How is your search going? Are you really struggling? How many positions have you applied to?",
          "score": 7
        },
        {
          "body": "Don't take it if the pay is low and you think you can find something better. It sounds like a good opportunity to gain some experience so take it if the pay is decent.",
          "score": 2
        },
        {
          "body": "Yeah sure or wait a few years to get a permanent one.",
          "score": 2
        },
        {
          "body": "Personally, I would take it unless it's underpaid. Sometimes you have to tread water.",
          "score": 2
        }
      ]
    },
    {
      "title": "Where Can I Take a Zoom Interview Near Times Square During the Workday?",
      "body": "I’m currently working in an office near Times Square and it’s difficult for me to take time off for interviews, especially since my job doesn’t offer much leave. I’m trying to find a quiet place nearby that I can rent for a Zoom interview during the day . I’m really exhausted from my current job — my boss is often rude and talks with an attitude, and the coworker I’m paired with is very lazy, so I end up doing most of the work. I don’t want to quit without having another job lined up, especially since I know how hard it is to find something new right now. I’m doing my best to hold onto this job while quietly looking for a better opportunity. ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1odfs4d/where_can_i_take_a_zoom_interview_near_times/",
      "comments": []
    },
    {
      "title": "'Interview stage' email from Workday, but still 'Under Review' online — what gives?",
      "body": "Hey everyone,  \nI received an automated email from Workday saying:  \n**\"Your application has been moved to the Interview stage.\"**  \nI got super excited — but when I logged into the portal, it still just says **“Under Review.”** There’s no calendar invite, no details, nothing about an interview anywhere.\n\nHas anyone else experienced this?  \nIs this just a general status update (like being shortlisted), or does it usually mean they’ll definitely reach out to schedule an actual interview soon?\n\n",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1lbgvoe/interview_stage_email_from_workday_but_still/",
      "comments": [
        {
          "body": "It doesn't mean anything. These statuses are completely meaningless and you should never bother looking at them. The status could say \"Hired as CEO\", but until you actually get an email or a phone call from the company, it doesn't mean shit.",
          "score": 1
        }
      ]
    },
    {
      "title": "Got an interview and it was a mistake",
      "body": "I was so excited to get an interview for this job only to get an email 20 minutes later saying there was a “glitch”.",
      "subreddit": "jobs",
      "score": 840,
      "url": "https://reddit.com/r/jobs/comments/1jp67nm/got_an_interview_and_it_was_a_mistake/",
      "comments": [
        {
          "body": "Hurts to say this but this might be the most depressing April fools joke for you to swallow",
          "score": 389
        },
        {
          "body": "I've done this. It isn't a glitch. It was likely a similar name. The issue is the excuse. I interviewed them anyway. They should have just interviewed you. They never know if you were a good fit or not until they get you in that chair.",
          "score": 66
        },
        {
          "body": "Show up like you didn't get the follow-up email.",
          "score": 159
        },
        {
          "body": "This happened to me a couple months ago and it was soul-crushing. That was the first interview request I had since being laid off only for it to be an accident. Very sorry.",
          "score": 29
        },
        {
          "body": "While we're here.  \nFuck Workday.\n\nWhat do you mean you've created a platform for multiple companies to standardise their hiring processes, but you have made it so applicants need to make a new account for each company you apply for so you cant save passwords.",
          "score": 14
        }
      ]
    },
    {
      "title": "Why does it say “interview” on workday even after completing it?",
      "body": "I recently attended panel interview at wellsfargo 3 days back. The status of my application hasnt changed, still stuck on \"interview\". Does someone has any idea when the HR would get back to me? How long does it take? Will they let me know if i didnt get selected? This is actually holding my other decisions as well",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1duxt8j/why_does_it_say_interview_on_workday_even_after/",
      "comments": []
    },
    {
      "title": "Took job offer and another place got back to me to schedule and interview during my workday. What do I do?",
      "body": "So, it was a long dry spell of looking for work and when place A extended an offer I said yes because I hadn't heard from anyone else in weeks. Finally, place B gets back to me to schedule an interview. Problem is it'll barely be my second day of work at place A. \n\nI want to give the interview a shot because the salary is a lot bigger. The interview would be through zoom, so I would just need a couple of hours. However, I have no idea how to approach my new job for time to take the interview. Honesty? Make an excuse? What do I say?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/15zkswc/took_job_offer_and_another_place_got_back_to_me/",
      "comments": [
        {
          "body": "If you were their first choice, they would have gotten back to you sooner. Work this place for a year or two and move on.",
          "score": 1
        },
        {
          "body": "You say, I apologize as I have a prior commitment that date and time, can we reschedule for something later in the week?\n\nBut if I'm understanding you.. They called you to schedule an interview and you somehow chose your second day of work?",
          "score": 1
        }
      ]
    },
    {
      "title": "Application status in workday says \"Application Received\" but I'm interviewing...",
      "body": "Recruiter reached out for a job opportunity and it sounded great and I was happy to talk to them. I have since had the phone screen with the recruiter and a meeting with the hiring manager but my workday application status still says \"application received\"...has this happened to anyone else?\n\nI know there's always a million possibilities with these status questions but this is a first for me. The status usually changes at least once if I've started the interviewing process.",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/16j1f4v/application_status_in_workday_says_application/",
      "comments": []
    },
    {
      "title": "Post interview radio silence and workday status change",
      "body": "Two weeks ago, I had my second interview for a job at big pharma. I felt the interview went well and during our conversation, we spoke about how it would look if I took the job. Our conversation ended abruptly, hiring manager had to leave for another meeting, but I was told I would hear from him next week. Followed up with a thank you email, no response. Followed up the end of last week since I was told I would hear from them that week and had not heard anything, no response. Tuesday of this week I sent an email to the recruiter I spoke with to see if they had any information, no response. I am not sure if I am losing it, but at one point I am fairly certain my workday status said “interviewing” and it has since been changed to “in process”. I am still actively looking and applying to other jobs, but does it seem like I am out of the running on for this position? It has only been two weeks since I interviewed and crazier things have happened *cough* global pandemic *cough*, but the lack of communication is concerning. ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/s8hig6/post_interview_radio_silence_and_workday_status/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Honestly you’ve followed up twice in one week, I would not follow-up again at this time. Nobody can speculate as to what the change in status means.",
          "score": 4
        },
        {
          "body": "To not hear from the hiring manager, or recruiter is troubling.  Now maybe in process means they just haven't sent you the offer yet and the lack of communication is because of the \"crazy times\".  But I would suspect if you don't get an offer, update by Friday to move on.\n\nIt would not be out of line to message the manager with something like this \n\n\"Hi Dave, hope you are well.\n\nI thought our conversation on Jan 5 went well and wrote down that I would hear from you about next steps by the following week ending Jan 14.  If I was mistaken I apologize and I understand with Covid and the new year things can get busy. \n\nI not sure I mentioned it but I'm interviewing with two other companies who have told me an offer is forthcoming soon. I'm really interested in this role, think I would be a great fit but if I'm not longer a candidate would appreciate an update.  Thank you and look forward to hearing from you \n\nBest of luck \n\nXYZ\"\n\n\nSomething like that and CC the recruiter.  Just clean it up into better sentences etc as I'm trying this on my phone and very quickly",
          "score": 2
        },
        {
          "body": "Did you ever hear back?",
          "score": 1
        }
      ]
    },
    {
      "title": "Do you tell manager if received an interview for an internal job if manager gets notified through Workday that one received an interview?",
      "body": "Large company and uses Workday says on company page employees should let manager know of interview received from internal job application as manager will be notified.\n\nWould it best to let manager know of internal job interview or not tell them because telling them will jeopardize current job because they will be suspicious want to leave current role and am possibly applying for external roles as well and maybe even terminate for this reason.",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1jo3k52/do_you_tell_manager_if_received_an_interview_for/",
      "comments": [
        {
          "body": "&gt;says on company page **employees should let manager know** of interview received from internal job application as manager will be notified.\n\nYour question literally answers itself...",
          "score": 2
        }
      ]
    },
    {
      "title": "“Interviewing” Status on Workday",
      "body": "I applied for a position with a bank on 8/1 and on 8/5 the status changed to “interviewing”. I have not been contacted by anyone yet. Has this happened to anyone else/any recommendations on what my next steps might be?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1emcviw/interviewing_status_on_workday/",
      "comments": [
        {
          "body": "You don't have any next steps. You sit and wait for them to contact you. Until you have actually been contacted for an interview, you aren't \"interviewing\". These workday statuses are meaningless until the company actually takes action towards you.",
          "score": 1
        },
        {
          "body": "Did you ever get an interview?",
          "score": 1
        }
      ]
    },
    {
      "title": "Workday status is \"Interviewing\" but 2 weeks and no interview invitation",
      "body": "This is my 6th time applying in the last 4 years to this large &amp; global (5-10k category) company, and I've had clear status updates in the past from them. This is the first time my status has been marked as \"Interviewing,\" but I haven't yet heard from the recruiter or from the company at all in 2 weeks.  \n\n\nHave you seen this before? Is this just a waiting game with a big company or could this be an error?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1c1heqy/workday_status_is_interviewing_but_2_weeks_and_no/",
      "comments": []
    },
    {
      "title": "7 week interview process to be ghosted? What does “completed” mean in workday if I haven’t gotten a follow up?",
      "body": "I applied for a position and have had 7 interviews over the course of 7 weeks. My last interview was April 11th. I’ve followed up two separate times with the recruiter and have yet to hear any response. \n\nI just went in to the workday portal and see my application status has moved from “in process” to “completed”. I haven’t gotten a rejection email…but I also haven’t gotten an acceptance email.\n\nFor those of you with experience in workday on the recruiter end…does this mean I’m rejected or is there “hope”? \n\nDebating if I should follow up one last time, but to be honest I am frustrated with this process so I’m not even sure what I would say. Any ideas?",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/1355pq9/7_week_interview_process_to_be_ghosted_what_does/",
      "comments": [
        {
          "body": "Completed means you’ve been rejected. Sorry about that. They can configure workday to send a rejection email when changing to that status. They didn’t. It’s rude and unprofessional to ghost candidates after an interview.",
          "score": 7
        }
      ]
    },
    {
      "title": "Workday status went from \"interview\" to \"offer process\"",
      "body": "Hey everyone, \n\n&amp;#x200B;\n\nI recently did an interview today and was told I would hear from the recruiter sometime this week. I'm really excited and nervous (because it does not determine if I got the position or not). I decided to look on workday to check the status of my application and it states \"offer process\". What exactly does this status mean? I've tried searching online but haven't found much information. \n\n&amp;#x200B;\n\nThank you so much!",
      "subreddit": "jobs",
      "score": 15,
      "url": "https://reddit.com/r/jobs/comments/vwtoqr/workday_status_went_from_interview_to_offer/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Sounds like.an offer may be in the works.",
          "score": 17
        },
        {
          "body": "You should be getting an email offering you the job soon",
          "score": 9
        },
        {
          "body": "Update: I got the job! Thank you so much everyone!",
          "score": 8
        },
        {
          "body": "It could mean anything.  Unfortunately, status updates are a fairly internal thing that can be unique from one company to another.  It could just be what it shows after they click 'interview complete' or whatever.\n\nBut if I were to guess, it sounds like you passed the interview and they're writing an offer letter",
          "score": 6
        },
        {
          "body": "Probably selecting and reviewing candidates.",
          "score": 5
        },
        {
          "body": "Congratulations!",
          "score": 2
        },
        {
          "body": "Probably means an offer is coming but workday is such a garbage HR system. I have not recieved my correct pay for my new position for over a month now and the offer they sent today was incorrectly calculated again..... really incompetent people I think.",
          "score": 1
        }
      ]
    },
    {
      "title": "My average day's work while jobhunting is 10x my average day's work while having a job.",
      "body": "Wake up. Shower and breakfast and at my work-from-home desk by 10am because I *insist* I keep a regular routine lest my life fall off into the void. Email follow-ups to recruiters and HR teams from past interviews. Archive the 5-6 unread rejection emails. Check for new posts in my area in my field on half a dozen different sites. Apply to said new posts and use AI resume scanners for help to make sure I can pass ATS.\n\nLunch at my desk. Widen my search and look for postings 21-30 days old. Recent is better but I've covered those already. \n\nDone eating, apply to a few. Search for similar jobs to my resume and other positions in places like Austin because God-knows I don't want to move to Austin but if I get an offer I will if I have to. Apply and ATS tweak the material as necessary.\n\n3pm, braindead now. On craigslist looking at gigs because come on guys, I need a job, something, anything, I'll get up early on Sundays and wrap cables for a church or do an online focus group for a few hundred bucks if it means that much less credit card debt when this is all over.\n\n4pm, the monkeys on \"Kingdom of the Planet of the Apes\" are fighting on my 3rd screen while I apply to my \"longshot\" finds of the day. Positions that I only 60-70% match but hold a particular interest to me. I can parlay this interest into a passionate cover letter and make my case, and it would be fun if I got one, and the ATS AI stuff helps a lot with getting the keywords right.\n\n6pm, done and off to play video games. I have to keep clear boundaries between \"work time\" and \"not work time\" lest I go crazy and all of life descend into a numb blur. Gotta rest up because tomorrow it all starts again...\n\nWhen I was gainfully employed?\n\n10 am at desk. Respond to emails. Take a zoom meeting or two. Get some morning work done. Lunch at desk while reading up on something new and techy related to my field. After lunch headphones on for a stretch of un-interrupted work for a few hours. In the zone happily working on a report or review or whatever. About 4pm check in with the other departments and teams just to say hi and ask how their day is going. 5pm a few EOD notes and I use the final minutes of the workday for mundane checklist work like make sure the backups are still running, scheduling overnight restarts, or hammering out a final piece of a project. Head off at 6.\n\n/sigh.\n\n🥂 Here's to a prosperous 2025. I know we'll all get there in time. Just right now it's 10x the work for 1/10th the pay. Just gotta keep plugging away. Take inspiration where you can. Take breaks from thinking about it when you can, and (advice from my wife), there is NOT REALLY a material difference between sinking $2,000 a month and sinking $2,080 a month. My instinct is to clamp down on all spending everywhere, but she's right. Go out to a movie every once in a while. Get a pizza from a local restaurant instead of only eating Kroger on-sale frozen meals. We'll be okay, even if we can't see it right now.",
      "subreddit": "jobs",
      "score": 370,
      "url": "https://reddit.com/r/jobs/comments/1i6wxr4/my_average_days_work_while_jobhunting_is_10x_my/",
      "comments": [
        {
          "body": "Love the hard work but you gotta chill. Go for a walk or spend an hour at that museum you always wanted to visit. You’ll be in a better headspace during actual interviews. I would cut out the long shot stuff because that seems like busy work that will never pay off. Maybe take some classes to show how productive you’re being if you want to stay busy",
          "score": 105
        },
        {
          "body": "I totally empathize with you. I’ve been out of work for over a year after being laid off. You have to maintain a daily routine or you’ll fall into despair. You’re doing everything right. The other thing I added to my daily routine is to make sure I find a reason to laugh every day. It helps to keep my spirits up. And remind myself that this too shall pass and I will find a great job eventually. I also started taking classes so I could tell future recruiters what I’ve been doing with my time between jobs. Treat yourself now and then and hang in there.",
          "score": 22
        },
        {
          "body": "&gt; #”Nobody wants to work anymore!” 🥴",
          "score": 20
        },
        {
          "body": "Not only that but you’re getting zero compensation for your hard work and constant rejection - if you’re lucky because so many jobs ghost. I’m so sorry. You’ve got this.",
          "score": 11
        },
        {
          "body": "Yup, I like to say that being unemployed means you are on the job from the minute you wake up, till the minute you fall asleep! \nGood luck on your hunt.",
          "score": 7
        }
      ]
    },
    {
      "title": "Workday job status says interview in progress",
      "body": "What does this mean i completed a small assessment for the company but am still waiting to hear back it says for the application status that interview is under progress can anyone shed light on what this means thanks",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/t3eb3r/workday_job_status_says_interview_in_progress/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I have the same thing rn. Notice the post is from a year ago. Do you remember what it meant?",
          "score": 1
        }
      ]
    },
    {
      "title": "Workday status went from \"Interviewing\" to \"In Process.\" What does this mean?",
      "body": "I'm deep in the process for a permanent role for a senior-level role with a financial institution in my area and my application status changed from \"Interviewing\" to \"In Process\" the other day, but I haven't been able to get in touch with anyone from HR. I had the final interview nearly two weeks ago and the manager indicated I was a strong contender for the role and that we'd have a decision made 'very quickly' but I don't know if this means I just have to be patient for an offer or if I should just assume \"In Process\" means they're waiting for an answer from someone else and I'm going to be declined shortly. Anyone else have experience with Workday that could help clarify?",
      "subreddit": "jobs",
      "score": 6,
      "url": "https://reddit.com/r/jobs/comments/g6so7j/workday_status_went_from_interviewing_to_in/",
      "comments": [
        {
          "body": "It probably means that the interviews are over, and if you haven't heard back in 2 weeks then they likely have another candidate they are following-up with and trying to onboard as you suspected.",
          "score": 1
        }
      ]
    },
    {
      "title": "Finally secured employment!",
      "body": "After 7 months of straight unemployment, strenuous gig work and no luck I finally got somewhere with interviews on last week and I accepted an offer today! Here are some things I’ve learned:\n\n- Absolutely nothing.\n\nI read dozens of reddit posts regarding the best ways to apply which were to go directly on the company sites. Tons of recommendations on that so I did it for a while, maybe 15-20 a day. It did not do a single thing for me. \n\nReworked my resume probably 10 times and even made it universal, dumbed it down for any job I could get anywhere. Didn’t work much either.\n\nThe most success I’ve had and the way I secured my offer was legitimately through indeed. I would spam apply to 40-50 “easily apply” jobs that fit the broad search of “customer service” in my area, remote or in person, and hoped an interview landed. There may be a lot of ghost jobs out there but indeed has legitimately given me the most response/interviews back. Anyone telling you to apply through a company site is telling you to do twice as much work to get the same chance as someone applying through indeed. I have like 50+ eternally unused workday accounts.\n\nBut overall, it’s really just luck. There’s literally not a single job out there that doesn’t have 300 people already applying to it and a few thousand more from different countries. \n\nI resonate with you all deeply and wish you nothing but secure employment and happiness in the days to come. It’s only getting worse out there so please take it easy on yourselves. One day at a time!",
      "subreddit": "jobs",
      "score": 149,
      "url": "https://reddit.com/r/jobs/comments/1mieli9/finally_secured_employment/",
      "comments": [
        {
          "body": "Lol now you know why some companies make you apply through their own sites instead of places like indeed. They'd rather save that money from paying a recruiter and have you do x3 amount of work (like refilling experience / education a million times WHEN ITS RIGHT THERE ON YOUR RESUME). Im not schilling for indeed, but its just more convenient to shotgun my resume to a bunch of places than sit there and create all those accounts. Good luck on your new job and hopefully its at least tolerable, asking for a \"good\" workplace nowadays seems to be asking for too much.",
          "score": 16
        },
        {
          "body": "Congrats yooooo!!!!!",
          "score": 2
        },
        {
          "body": "Congrats",
          "score": 2
        },
        {
          "body": "Indeed is the best",
          "score": 2
        },
        {
          "body": "Did you use other apps like Glassdoor or ZipRecruiter?",
          "score": 1
        },
        {
          "body": "[removed]",
          "score": -9
        }
      ]
    },
    {
      "title": "Workday Status - Offer in Progress",
      "body": "I have been through 3 interviews (including the final one) for a large company. They are down to two people (I was told in a fairly offhand manner during the final interview, with supervisor of potential boss) and they have done reference checks.\n\nI have not heard from them but references were requested Monday, the day of the last interview and the last one turned it in on Wednesday. The pay range was listed in the job posting so I am not too worried about that aspect.  \n  \nIn Workday my status is \"Offer in Progress\" soooo...how excited should I be? ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1q8n6or/workday_status_offer_in_progress/",
      "comments": [
        {
          "body": "I'd be pretty hopeful with that progress. When was the last time you had contact with them? \n\nToday would be a great day to reconnect send a an \"end of the week\" check-in email.",
          "score": 1
        }
      ]
    },
    {
      "title": "WorkDay Principal Engineer Interview Experience",
      "body": "Workday’s interview process consisted of **two technical rounds**, Post introductions and few basic probing on your past projects, each round focused on **system design** and **live coding**. All coding was conducted directly on **HackerRank**, with screen-sharing enabled throughout to ensure the candidate isn’t relying on AI assistance or external tools. \n\nFor questions, please do refer the below article\n\n[https://open.substack.com/pub/doniv/p/workday-interview-questions?r=5l1mo&amp;utm\\_campaign=post&amp;utm\\_medium=web&amp;showWelcomeOnShare=true](https://open.substack.com/pub/doniv/p/workday-interview-questions?r=5l1mo&amp;utm_campaign=post&amp;utm_medium=web&amp;showWelcomeOnShare=true)",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1p6ckrc/workday_principal_engineer_interview_experience/",
      "comments": [
        {
          "body": "Thanks for sharing this! The screen-sharing on HackerRank sounds pretty intense but makes sense for a principal level role. Did you end up getting an offer or still waiting to hear back",
          "score": 1
        }
      ]
    },
    {
      "title": "Job posting disappeared from Workday after final interview",
      "body": "Hello all. I had my final interview on Thursday, and the recruiter told me they will try to make a decision by \"next week\" (aka this week now). I decided to check the Workday portal just now, and the posting is no longer active, and is also gone from LinkedIn. The company never really changed anything on Workday throughout the process (always said \"Application Submitted\" even when going through interview stages), so now I am ultra-stressing about this big change. When I checked yesterday afternoon, the posting was still up, so likely happened this morning. \n\nBe honest, would you think they took down the posting because they gave an offer to a different candidate and they accepted? I did have a weird feeling since it has now been almost three work days + a weekend since the final interview and there has been no word. Please, I am desperate for any sort of advice or input. ",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1p0iwos/job_posting_disappeared_from_workday_after_final/",
      "comments": []
    },
    {
      "title": "Workday interview tips",
      "body": "I’ve interview scheduled for senior software engineer AI with workday dublin . The recruiter did mention that the first call would be with hiring manager, followed by a hackerrank pair programming and finally a panel interview comprising of 2 people. Anyone who’s interviewed recently, could you share some tips on what to expect for each of these rounds and your experience of the interviews? Thanks in advance.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1om2sbb/workday_interview_tips/",
      "comments": []
    },
    {
      "title": "7 months. 1000+ apps. Endless rejections. One offer. I’m in.",
      "body": "Started my BA (Business Analyst) job search back in October while still in school. It was an on-and-off process until the end of May when I finally got an offer. In total, I applied to over 1,000 positions, got 19 interviews, and eventually accepted an offer from a Tier 3 consulting firm doing data-focused BA work.\n\nThe hardest part wasn’t my resume or skills — it was how draining the process was. Job boards, resume tweaks, endless applications… I was spending at least 2 hours a day just on repetitive tasks, and it really wore me down.\n\nHere are a few things that helped me stay on track:\n\n✅ Be intentional when searching\nInstead of randomly scrolling through jobs, I built a system. I split my search into two sets of keywords:\n\nSkills: SQL, Tableau, stakeholder communication\n\nIndustries: healthcare, public sector, non-profit\nThen I used these combos to reverse-search for roles that fit.\n\n✅ Structure your interview prep (don’t just memorize answers)\nFor behavioral interviews, I broke my past projects into STAR stories and reused a small set of well-prepared examples. It made interview prep much more manageable and authentic.\n\n✅ Automate the boring stuff\nLater in the process, I started using Correlate AI to auto-fill applications and get tailored job recs. It saved me a ton of time, especially for Workday listings (one-click apply!). I used that extra time to focus on interview prep and researching companies.\n\nOverall, BA roles tend to have longer hiring cycles and put more weight on soft skills and business context. My advice: start early — don’t wait until you’ve finished all the Leetcode to explore your direction.\n\nThe market is still very competitive, but with the right tools and a good pace, the whole process becomes a lot more sustainable.",
      "subreddit": "jobs",
      "score": 43,
      "url": "https://reddit.com/r/jobs/comments/1lg9pqy/7_months_1000_apps_endless_rejections_one_offer/",
      "comments": [
        {
          "body": "When you see this kind of chart about finally getting an offer.\n\nJust know you will open the post and see an AI tool being mentioned, then you'll realize it's an ad.",
          "score": 114
        },
        {
          "body": "AI post with AI bot comments peddling an AI tool to scam people thinking it’ll help the get a job \n\nThe internet is dead fuck this planet bro",
          "score": 28
        },
        {
          "body": "You had me in the first half. Ngl!",
          "score": 16
        },
        {
          "body": "Were you also using AI to write your resume? ",
          "score": 23
        },
        {
          "body": "The tools you used weren't very good if it took you 1000 applications.",
          "score": 11
        },
        {
          "body": "AI garbage. Downvote this Bot Garbage.",
          "score": 8
        },
        {
          "body": "I had an interview within a week of knowing someone at a company. Network and get that inside man/woman. I would have never had that first interview without my friend passing my resume to management.",
          "score": 3
        }
      ]
    },
    {
      "title": "Therapist went beyond what is acceptable for open job?",
      "body": "Long story short, during a meeting, my therapist told me his family member had a job opening that would be a decent fit. Lower than my previous job, but that is that job market for you.... He told me she'd pull the job from the pile and give me an interview. One week goes by, therapist cancels my next appointment. \n\nRadio silence from the job. Then therapist cancels again\"\"feeling sick\"). \n\nNext appointment he tells me he heard some feedback about my resume \"my photo made me look too young\". \n\nNext day workday send me a decline email for the position. \n\nI took that as the message to cancel my sessions with the therapist as shit just didn't feel right. \n\nWhat are your thoughts? He feels like he crossed a boundary, then made promises he couldn't keep, then as far as I'm concerned, he lied about why he couldn't make his session.\n\nAt $200/pop I feel like was was fucked over by him, especially for him knowing how vulnerable I was in my job search. All in all, therapy has managed to make me feel worse than I did before I started. Good job shrink. ",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1pg9orz/therapist_went_beyond_what_is_acceptable_for_open/",
      "comments": [
        {
          "body": "Never put your photo on your resume. Whomever told you to do that is in error.",
          "score": 23
        },
        {
          "body": "Your therapist needs to go back to school. Never cross personal lines like that. Get another therapist",
          "score": 12
        },
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "200 a pop regardless of the context youre getting absolutely finessed even my psychiatrist doesn't run that high",
          "score": 0
        },
        {
          "body": "Send a bill for your time for those cancelled appointments. You have value too.",
          "score": -1
        }
      ]
    },
    {
      "title": "I'm currently designing a dashboard to organize my jobs and interviews better. Any feedback or ideas on how I can make it better?",
      "body": "I got sick of managing all my applications and interviews in spreadsheets, so I thought of creating a little tool to make job hunting a bit more fun.\n\nRight now it's all manual, but there is a chance to create some automation and maybe even integrate with some companies who use larger HR systems like workday (anything that has an open API basically).\n\n**EDIT: I'm not looking for a job! I'm a a freelance designer / software engineer, building this out as a side project as an actual tool for anyone to use. Hence the question of collecting feedback.**\n\nCurrently, the 3 main elements being tracked are\n\n* Applications (basically any job you applied to)\n* Interviews (any upcoming interview -&gt; Potentially I can also do a calendar integration for this with iCal / google calendar)\n* Interview notes (track anything important that you discussed)\n\nInterviews (any upcoming interview -&gt; Potential I can also do a calendar integration for this with iCal / google calendar)\n\nhttps://preview.redd.it/y8w4n7b1sir81.png?width=2406&amp;format=png&amp;auto=webp&amp;s=9b4131c1ce7688c4672c234613b3f8bcbd018310\n\nAny feedback is appreciated ! :)\n\n&amp;#x200B;",
      "subreddit": "jobs",
      "score": 362,
      "url": "https://reddit.com/r/jobs/comments/tw31je/im_currently_designing_a_dashboard_to_organize_my/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "A place you can save/attach the pdf of the job description.",
          "score": 49
        },
        {
          "body": "I’m kind of leery of the “We estimate you will be hired in 30 days”. \n\nSeems kind of mean to me to be saying something like that, and you can actually drive people off your product when it keeps saying stuff like that and it doesn’t happen. Just for that, I personally wouldn’t try it.",
          "score": 32
        },
        {
          "body": "I created something very similar during my job search in Airtable. Love the separate table for interviews, especially listing who they were with. I included attachment fields for the cover letter / unique resume as well. Stats would be cool (how long since first app, percent of apps that went to each stage, etc) because I had to calculate those separately. \n\nNot sure what else would set it apart from Airtable, though, apart from the interface and stats. Super cool project!",
          "score": 9
        },
        {
          "body": "Add a space to enter the job ID/requisition number.  This useful when applying for a role, where multiple regions, business units, or divisions are hiring in the same company.  For example a company may be hiring 4 sales account managers,  the job description is the same, the region covered could be different.",
          "score": 6
        },
        {
          "body": "Love this idea. I recently had to go through this process and it was a headache. But I did land a great job as a result. I was using Notion to organize my applications and notes, a saas tool like this would have been great. \n\nFrom my most recent interviews, here are some features that would be nice. \n\n1. Agree on PDF of the job listing for reference. \n2. Some positions require multiple interviews with different team members. Would be great to have a way to document who you interviewed with, what time and their title, and if you sent a thank you note. Because my position was a manager, I was meeting people at, above or below my level. And so I found myself mostly preparing answers to questions from those above me, and then asking questions of those below me. So having a section for notes is great, but also to be able to organize your own questions and responses you get back. \n3. If you are receiving multiple offers, it can be difficult  to determine which options offer a better outcome. So having a section to include offer details for cross-comparison between offers or jobs would be awesome. \n4. This would be awesome through an API: the ability for your platform to pull up a “wiki” on the company such as an “about us” bio, or relevant news links. \n5. A field or dashboard for comparable salary ranges. The job description may not list a description, but having a metric for what people are making with similar titles would be a great tool for negotiation.  \n\n\nHonestly, if you’re looking to monetize this platform, having some sort of AI analysis or AI writer would be great. The key would be in trying to help people write an application that hits the major keywords of the job description for ATS software. If you can’t do this, then perhaps having a section where your system creates a score based on how well you’ve crafted your resume as it relates to keywords in the job description. I think this grade would be more meaningful and beneficial than “we estimate you’ll have 30 days until hired,” especially since you can’t control the factors on the company’s side of the process.",
          "score": 6
        }
      ]
    },
    {
      "title": "Interviewing at Workday for P3 Product Manager Role – What to Expect? Any Tips?",
      "body": "\n\nI’ve got an interview R3 - Presentation Round coming up for a **P3 Product Manager** role at **Workday** and would love any insights.\n\n* What does a P3 PM typically own/do?\n* What are they evaluating in the Presentation interviews (product sense, execution, metrics, etc.)?\n* Any tips or things you wish you knew before interviewing there?\n\nAppreciate any advice – thanks!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1occkq0/interviewing_at_workday_for_p3_product_manager/",
      "comments": [
        {
          "body": "On your questions about P3 scope and the presentation, here’s what I’ve seen: P3s usually own a feature area end to end, drive the roadmap with eng, and partner with sales and CS on adoption and metrics. For the presentation, they tend to evaluate problem framing, prioritization, measurable outcomes, and how you navigate tradeoffs in an enterprise context like security, compliance, and change management. What helped me was building a tight deck with this flow: problem, users, success metrics, 2 or 3 options, recommendation with risks, measurement plan, and next 90 days. I practiced timed dry runs using Beyz coding assistant with prompts from the IQB interview question bank, and kept sections to 90 seconds.",
          "score": 2
        },
        {
          "body": "&gt;What does a P3 PM typically own/do?\n\n&gt;What are they evaluating in the Presentation interviews (product sense, execution, metrics, etc.)?\n\n&gt;Any tips or things you wish you knew before interviewing there?\n\nWe can't give you this info. If we do its 100% speculative and good chance we can give bad interview questions/advice. We don't know what  P3 PM does or how to do a presentation. Also workday hiring managers have their own set of presentations they look for. \n\nI suggest you google research the role, plug it into a free AI tool and have it spit out presentation suggestions etc.",
          "score": 1
        }
      ]
    },
    {
      "title": "Workday Reporting Brain Teasers Wanted for Interview Practice – Hit Me With Your Best Shot",
      "body": "Hi everyone! 👋  \nI’m currently preparing for an upcoming interview focused on **Workday reporting and analytics**, and I’d love to tap into the collective knowledge of this amazing community.\n\nIf you’ve interviewed for, conducted interviews, or currently work in Workday reporting/analytics roles (consulting, HRIS, customer side, or partner side), could you share **any interview questions** you’ve encountered or asked from **technical** (composite reports, calculated fields, dashboards, Prism, etc.) to **strategic** (governance, stakeholder collaboration, data storytelling)?\n\nYour insights would mean a lot and will help me (and others preparing too!) feel more confident going into interviews. 🙏\n\nThank you in advance and if you’re open to a quick chat or sharing your experience, please feel free to DM me too!\n\n\\#Workday #WorkdayReporting #WorkdayAnalytics #CareerGrowth #HCM #InterviewPrep #HRAnalytics",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o2fwgx/workday_reporting_brain_teasers_wanted_for/",
      "comments": [
        {
          "body": "I’ve been on a couple Workday reporting panels and what helped me prep was practicing out loud how I’d design a composite report from a blank page: name the business question, pick the primary data source, map joins, then justify each calculated field and its performance impact. I also rehearsed one Prism use case where I’d ingest external survey data and secure it with the right domains. I ran timed mocks using prompts from the IQB interview question bank inside Beyz coding assistant and forced 90 second answers with STAR. Bonus drill: explain the difference between report fields vs calculated fields and when you’d use each, then walk through stakeholder handoff.",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone recently interviewed or interviewed candidates at Evisort / Workday for Senior Software Engineer roles?",
      "body": "Hi everyone,\n\nI have upcoming interviews for a **Senior Software Engineer** position with the **Evisort team at Workday**. Since Evisort is now part of Workday, I wanted to check if anyone here has recently gone through interviews for this team—or has been on the interviewer side.\n\nI’d like to get a better sense of what to expect, particularly around:\n\n* **System Design** (scope, type of systems typically discussed)\n* **Coding / Data Structures &amp; Algorithms** (difficulty level, leetcode-style vs. practical)\n* **Behavioral** (team collaboration, leadership principles, values fit)\n* Any **Evisort-specific focus areas** (e.g., AI-driven document processing, contract lifecycle management)\n\nIf you’ve interviewed for (or with) this team recently, I’d really appreciate any insights, tips, or experiences you can share.\n\nThanks a lot! 🙏",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n82wsw/anyone_recently_interviewed_or_interviewed/",
      "comments": [
        {
          "body": "For the System Design, focus on scalable, distributed systems, think of services handling large loads efficiently. Coding usually tends towards leetcode medium-hard level with a mix of DS&amp;A and real-world problem-solving. Behavioral tends to explore collaborative scenarios and leadership in projects; reflect on past experiences where you demonstrated these. For Evisort-specific focus, AI and document processing are likely key areas, so be ready to discuss AI-driven solutions or related project work. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "HR Solutions Architect Interview (Workday) Questions",
      "body": "Hi I havs an upcoming interview for the HR Solutions Architect position and I have a good background in HRIS but I am not sure what kind of questions should I expect can anyone please share their thoughts? what should I expect and how should I approach answering those questions?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n13nhr/hr_solutions_architect_interview_workday_questions/",
      "comments": [
        {
          "body": "Expect a mix of HRIS concepts and practical problem-solving scenarios. They'll prob ask about your experience in deploying systems like Workday or SAP - how you've handled challenges, optimized workflows, etc. Use the STAR method for behavioral questions, especially those diving into leadership and conflict resolution. Focus on showcasing your ability to integrate tech solutions with HR functions effectively. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "Workday status was changed to in process. Should i be scared? This was after my second interview with wegmans",
      "body": "",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1kl44a0/workday_status_was_changed_to_in_process_should_i/",
      "comments": [
        {
          "body": "They have to change your status to in progress in order for them to move forward with your application. They use workday to track applicants.\n\nI would not worry about it. I would also not set any expectation you will get the job or else you get more worried and let down at the end.",
          "score": 3
        },
        {
          "body": "When I was going through workday for my current job, I would constantly check, in progress I’m pretty sure means then are checking over everything. If you have already interviewed it may also be they could have moved you into the hiring process, possibly, don’t quote me on that. But I had already been hired and they made me fill out an application. So I’m not totally sure, but there’s a slight possibility.",
          "score": 2
        }
      ]
    },
    {
      "title": "Workday interview process.",
      "body": "I completed my interviews for a SDE role. But did not hear back for a couple of weeks after which the recruiter emailed saying he was on a vacation since a couple of weeks and just got back and is getting everything ready. And it's been 4 days since he hasn't emailed anything. The status of my application is In consideration. Is there a chance that I'm being considered?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1l8oin5/workday_interview_process/",
      "comments": [
        {
          "body": "Sure. If the recruiter is on vacation I guess. But it’s a bit weird why they left in the middle of the process. I would guess somebody would at least have taken their place in the interim. Maybe they are a smaller company?",
          "score": 1
        },
        {
          "body": "Hello, how did it go?",
          "score": 1
        }
      ]
    },
    {
      "title": "Saw no longer under consideration on Workday after internal interview",
      "body": "I just finished my interview last Monday and thought that it went well. Today I just check on workday and see that I am no longer under consideration for the position. I message the recruiter, asking if she heard any updates from the hiring manager. She said yes, and will get back to me on Friday. Ugh, I wish she can just tell me now so I can confirm I didn’t get it.\n",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1k6e9kl/saw_no_longer_under_consideration_on_workday/",
      "comments": []
    },
    {
      "title": "Hello, I have a interview for a Senior HRIS Workday Analyst. It’s my final interview with the HR Business Partners and I’m feeling a bit nervous on what types of questions they might ask me. Does anybody have any suggestions on what types of questions could be asked?",
      "body": "",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1i2e3mo/hello_i_have_a_interview_for_a_senior_hris/",
      "comments": [
        {
          "body": "Thank you so much for some examples of some possible interview questions that might be asked of me. That will definitely help me get more prepared. I am curious to know more about that AI tool even though I may not use it as I probably would be to nervous to even attempt using it. Thanks again for your response 😀",
          "score": 1
        },
        {
          "body": "I totally get it, interviewing for a Senior HRIS Workday Analyst role can be intimidating! For this position, you can expect behavioral and technical questions that assess your experience with Workday, leadership skills, and ability to drive business outcomes.\n\nSome possible interview questions might include: \"Can you walk me through a time when you successfully implemented a complex Workday module?\", \"How do you prioritize and manage multiple projects simultaneously?\", or \"What strategies would you use to communicate the value of HRIS to stakeholders?\".\n\nOne thing that helped me during my own interviews was using this AI tool that listens to interview questions and suggests responses in real time. It actually helped me feel more prepared and confident, especially with the behavioral questions. If you're interested I can share it with you! Just remember, your experiences and examples are what'll truly shine through - focus on showcasing your skills and passion for HRIS, and you'll nail this interview!",
          "score": 0
        }
      ]
    },
    {
      "title": "Workday interview experience for, Sr. Associate ui ux developer/ Reactjs, Nodejs",
      "body": "Hi, has anyone here gave interview for the role Sr. Associate UI UX developer or any other roles involving React, Node.js, in Workday? Can you share your experience here.\nTIA",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1g9iy8t/workday_interview_experience_for_sr_associate_ui/",
      "comments": []
    },
    {
      "title": "Workday “Application Received” email after final interview a week ago",
      "body": "Has this happened to anyone? Maybe a talent acquisition/HR/Workday expert can provide some clarity. A week or so ago I was contacted about applying for a role that had an additional opening. I go through with the interview , told I’ll hear back either way, and kind of just wait. Some time goes by and I begin to get  frustrated until I receive a “Application Received” email today.\n\nWas this an indirect rejection email? Sent as an app received email? Or maybe they need to have a formal/updated app on file because they may extend an offer? Kinda confused  \n\nEdit: IT WAS AN OFFER!!! Just got a call from the recruiter not too long ago! Was pleasantly surprised. ",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1n7s9bt/workday_application_received_email_after_final/",
      "comments": []
    },
    {
      "title": "Phone screen interview at Workday company vfor Prism and Reporting Analyst. What to expect?",
      "body": "Its a senior role and its been a decade since I gave my sat for my last interview. What are some of the things I should expect for a phone screen and how is the structure of interviews at Workday?\n\nIts bit nerve wrecking to be honest! On one hand, I feel like I have enough experience to get through the process but then interviews these days seem whole another ball game.\n\nHow do you prepare for questions like\n\n* Are you interviewing at other companies?\n* How much pay are you expecting?\n   * I plan to delay this question as much as I can with statements like \"I am looking forward to see if we are a good fit for each other and then work through the finances\" \n   * I am sure there are better ways to answer that. But if they press on it, what is a general safe strategy?\n\nIf this isn't allowed here, feel free to remove. Thanks everyone!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1l2gzze/phone_screen_interview_at_workday_company_vfor/",
      "comments": [
        {
          "body": "&gt;Are you interviewing at other companies?\n\nI would just tell the truth if you are being interviewed for other companies than say it. They might ask this question and might not. If you are not being interviewed than say you are not being interviewed at other companies. This question has no right or wrong answer.\n\n&gt;How much pay are you expecting?\n\n   * I plan to delay this question as much as I can with statements like \"I am looking forward to see if we are a good fit for each other and then work through the finances\" **(Don't say this)**\n\nGive them a pay range that is within line on what they are offering. Do not low ball them. Example: If you see them listing the role between salary range of 50,000-85,000 I suggest you give them a range of 80,000-100,000.\n\nYou want to start off high but is within range on what they are looking for. If they do not have the salary listed start researching that role's salary and offer it on the high end range. If they ask where you got that from let them know I researched it from the Department of Labor or looked at the same roles that are currently open that is offering that salary range.\n\nThis will not only have to accept your salary range but they will see you have other options to go to if you don't get the role. So if they like you so much you got leverage on the salary. Always give them salary range in the beginning and do not delay. If you don't they can screw you over and if you ask for higher they can rescind the offer.",
          "score": 1
        },
        {
          "body": "Hello, I saw your post and wanted to ask you if you dont mind. Did you ever get the job or did you do a few interviews with them?",
          "score": 1
        }
      ]
    },
    {
      "title": "Interviewing at Workday for P3 Product Manager Role – What to Expect? Any Tips?",
      "body": "I’ve got an interview coming up for a **P3 Product Manager** role at **Workday** and would love any insights.\n\n* What does a P3 PM typically own/do?\n* What are they evaluating in the interviews (product sense, execution, metrics, etc.)?\n* Any tips or things you wish you knew before interviewing there?\n\nAppreciate any advice – thanks!",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1kk3csh/interviewing_at_workday_for_p3_product_manager/",
      "comments": [
        {
          "body": "as far as i know P3, it's their mid-level PM (similar to Meta's L4 or Google's L4). \n\nWorkday P3 PMs typically:\n\nown features or smaller components within a bigger product area\n\nwork with cross-functional teams (eng, design, etc)\n\nrun most of the day-to-day execution\n\nhave some autonomy but still get guidance from senior PMs\n\ntheir interview process usually focus on:\n\n\\- product sense (ability to define problems, scope solutions)\n\n\\- execution (can you prioritize, handle tradeoffs, etc)\n\n\\- analytical thinking (how do you measure success)\n\n\\- leadership/collaboration (how do u work w/ others)\n\nwat i'd suggest:\n\n\\- research Workday's business model &amp; products deeply\n\n\\- be ready to talk bout enterprise software use cases\n\n\\- prepare stories about cross-functional collaboration\n\n\\- be familar with HR/finance workflows since thats their core\n\ntbh the best way to prep for these is to do a mock interview with someone who's actually worked there or interviewed sucessfully - helps identify blind spots u might not realize. \n\nPS - check out some older glasdoor reviews too, they sometimes have super specific question examples",
          "score": 2
        },
        {
          "body": "Going for the same role. Did you get the offer? Can you please give me what exactly did they ask u?",
          "score": 1
        }
      ]
    },
    {
      "title": "Workday status is \"Approved for Interview\" / Job reposted after applying.",
      "body": "I applied for a job for a company on Jan 29 via Workday and after checking my status, it now says \"Approved for Interview\".\nI assume that means they're interested in meeting me for an I/V?\n\nAlso... the job was reposted 5 days ago.  Should I be concerned that I'm now not a good fit and they're lookong for better candidates?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1j6tt4l/workday_status_is_approved_for_interview_job/",
      "comments": [
        {
          "body": "Reposts are sometimes auto-posted. Also, why are you worried if you haven't already interviewed or invited for one yet?",
          "score": 3
        }
      ]
    },
    {
      "title": "Workday Data Scientist Intern Interview",
      "body": "Hello,\n\nI have a 30-minute phone call scheduled with a recruiter for a Data Scientist Intern position. This is my first interaction with the company, and I want to be well-prepared.\n\nWhat kind of questions should I expect during this call? Will it mostly focus on my background, technical skills, or behavioral questions? Should I be prepared for coding or technical problem-solving at this stage, or is that typically saved for later rounds?\n\nAny tips or insights on how to make a good impression during this conversation would also be appreciated!\n\nThanks in advance for your advice!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1i6ugux/workday_data_scientist_intern_interview/",
      "comments": []
    },
    {
      "title": "Workday Application Status-Good Luck with Interviews",
      "body": "So I was reached out by a recruiter and they wanted to move forward with the interview process. At this point, my workday application status was 'In review with Hiring Manager'. Post our call, I sent the recruiter my availability and she did not respond back yet, been 2 business days already. Today I checked my application status is 'Good Luck with interview'. Does anyone have any idea what this application status means?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/1e9iozq/workday_application_statusgood_luck_with/",
      "comments": [
        {
          "body": "\"Good Luck with Interviews\" usually means the recruiter liked you and your application is being passed along to the hiring manager for consideration. The recruiter might be waiting to hear back from the hiring manager to schedule your next interview. It's totally normal for there to be a bit of silence between interview stages. That being said, it doesn't hurt to send a quick, polite email to the recruiter just checking in.\n\nIf you're feeling nervous about the next steps, you might want to check out [interviews.chat](http://interviews.chat) - it's a tool I built to help people land (and ace!) their interviews. Good luck!",
          "score": 1
        }
      ]
    },
    {
      "title": "2026 can I leave in piercings?",
      "body": "I have not had to job interview since 2017. I only had a lip ring back then. I figured the obvious would have to come out, my septum, my lip. But a have a small stud in my nostril that is much less noticeable than the hole if I take it out. Also do I still have to take cartilage piercings out?  Also do you disclose that you have piercings? Or just show up to work with them?\n\nClarification: I am asking is with the nose ring, which is a stud l,and is very small smaller than the hole that is in my nose would it be more obvious if I took the start out and left that hole there for my interview versus having the stud in? The second part of my question was if anybody has been in this situation did you disclose if you had piercings at the interview or after you got the job? \n\n\nUPDATE : there have been a lot of repeat questions. \n\n-The interview place is for an office job. \n-I'm not opposed to having to take my piercings out for my workday\n",
      "subreddit": "interviews",
      "score": 11,
      "url": "https://reddit.com/r/interviews/comments/1q47sca/2026_can_i_leave_in_piercings/",
      "comments": [
        {
          "body": "Just depends on the workplace culture, industry and area you live imo",
          "score": 36
        },
        {
          "body": "I have never once removed my cartilage piercing for an interview. And I was interviewed recently by someone with a nose ring.",
          "score": 12
        },
        {
          "body": "This depends a lot on the field and potential employer. If you leave them out for the interview, will they also expect you to leave them out on the job?",
          "score": 10
        },
        {
          "body": "The general rule is to not do anything controversial during an interview and be conservative. Once you get the job you can loosen up. Employers are not supposed to judge an applicant by such things but they do it without commenting on it.",
          "score": 5
        },
        {
          "body": "Take out everything for the interview and once hired, show up with nothing in. Observe the other employees to see what they have and ask a co worker if you have questions. Also read the new hire handbook but more often you can look at the workplace environment to get a feel for what they allow",
          "score": 3
        },
        {
          "body": "Professional consulting, we would not care about small piercings.",
          "score": 3
        }
      ]
    },
    {
      "title": "Made it through to the end of the interview process, was told they’d make a decision this week and I just noticed the job was reposted?",
      "body": "I had a fourth and final interview for a role on Monday, which is only two days ago. The interviewer told me they had a few more finalists to speak with and would make a decision within the week. \n\nThey have been pretty adamant throughout the process that they really wanted to fill the role quickly, and thus I made it through all four rounds in two weeks.\n\nI just saw today that the job was reposted in workday, and my candidate portal still says “in process” but the job is open again. Is this just something that happens while they make a decision and are about to make an offer? I can’t imagine they’d be starting this process over, especially with all the positive feedback I’ve received throughout the rounds.",
      "subreddit": "interviews",
      "score": 42,
      "url": "https://reddit.com/r/interviews/comments/1l37idu/made_it_through_to_the_end_of_the_interview/",
      "comments": [
        {
          "body": "I have seen some companies reposting jobs automatically for maximum exposure. This could be what is going on, which would mean no human hands were part of the process.",
          "score": 23
        },
        {
          "body": "Bumping this job posting, er... thread, for visibility!\n\n(Some recruiting services/tools do this for clients automatically. It's nothing to worry about, and doesn't mean you did poorly. It will close once the position is filled.)",
          "score": 6
        },
        {
          "body": "[deleted]",
          "score": 5
        },
        {
          "body": "Multiple people have told you it is nothing to be concerned about as it is not unusual for certain recruiters however you don’t seem to believe them. Regardless, there’s nothing you can do about it at this point so why lose sleep?\n\nAnyways , good luck.",
          "score": 3
        },
        {
          "body": "Unfortunately, reposting can mean a few things—budget shift, internal delays, or they didn’t find the ‘perfect fit’ yet. Doesn’t always mean you’re out. Still, I know how crushing the silence can feel after giving it your all",
          "score": 3
        },
        {
          "body": "Don’t read into the reposting. It may not have any bearing on your candidacy",
          "score": 2
        }
      ]
    },
    {
      "title": "What does \"process complete\" mean on Workday when job said they will set up interview?",
      "body": "I applied for a job that uses Workday job site. I had a phone screening, then person said she going to send over my info to hiring manager and they will call for interview within 2-3 days. Next day the job listing said \"process complete\" and listing is still posted online.\n\nAm I to assume I got rejected before interview? At one point in time I applied to another job with different company and they used Workday. Same thing happened - said active, then they called for phone screening. They said hiring manager will call in 2-3 days for interview. It said active until I heard from manager/supervisor for interview. After interview I just didn't get job tho, which at that point they put \"process completed.\" During whole time it said \"active\" until end of interview and decision was made. This time it was instant for \"process completed\" before interview. Which I guess means rejected?",
      "subreddit": "interviews",
      "score": 2,
      "url": "https://reddit.com/r/interviews/comments/17m5tdw/what_does_process_complete_mean_on_workday_when/",
      "comments": [
        {
          "body": "I would follow up with the recruiter, I manage to receive an offer and the status was changed to “process completed” - sometimes it takes a while for the recruiters to get all documents put together, the job posting for the position is still out there, it may just be taking a while for them to close the job req.",
          "score": 3
        }
      ]
    },
    {
      "title": "Interviewed 2 weeks ago and now recieved this from HR",
      "body": "Hi all,\n\nI interviewed for position 15 days ago. It was a 2nd stage video call interview with the hiring team across multiple locations.  \nThe 1st stage was a 10 min phone HR screening. \n\nAfter constantly refreshing my Workday for the past 2 weeks and patiently waiting for a response from the hiring team I got this email today from the HR Talent Acq rep:\n\n\nThank you for taking the time to interview for the ***** position.\n\nI apologize for the delay in providing you with a final decision. We are still in the process of finalizing the outcome.\n\nI hope to have an update for you by the end of next week. Thank you for your continued patience as we complete this process.\n\n------------------------------------------------------------\n\nHow are my chances looking?\nTo me it sounds like I'm the backup candidate - not a defo yes but not a definite no. \n\nCan anyone make sense of this?\nOne thing I am unsure of is how many rounds of interviews there'll be. \nIs it worth me asking to confirm if _I am successful_ if there's another round of interviews after this or will it be an offer?\n\nAny advice is appreciated :)\nThanks!",
      "subreddit": "interviews",
      "score": 42,
      "url": "https://reddit.com/r/interviews/comments/1ox7udi/interviewed_2_weeks_ago_and_now_recieved_this/",
      "comments": [
        {
          "body": "Dude .. regardless of outcome, keep moving, keep looking",
          "score": 50
        },
        {
          "body": "I'm starting a new job next week. They were looking to hire right away and I had the phone screening, the first interview the next day and then had a second/final interview several days later. The recruiter told me that the second interview would be the final one. You may have gotten the job or they're still interviewing other candidates. But you should never bank on having a job until you have the written offer in hand. You need to keep looking for other jobs in the meantime; just keep swimming.",
          "score": 14
        },
        {
          "body": "You got an update, so that's a win in today's world. You could be the backup, but things happen. The hiring manager could have been sick lately or had to deal with a deal in the family. Or it could have been a budget issue that forced them to relook at their open positions. \n\nMy husband was once put on pause for 6 weeks while they hired the direct manager for the role, and he was still a final candidate. Go figure. \n\nNo need to confirm because HR just told you what to expect. Sit tight. The time for the next steps question has passed. \n\nI wouldn't really look at it by \"chances\" because we've all been there. It looks good and then BAM! rejection. You're not out today, but definitely keep applying elsewhere.",
          "score": 14
        },
        {
          "body": "You’re still in it. Celebrate the moment and then get on with the pieces of your life that are under your control. This egg won’t hatch until it’s ready no matter how hard you think about it or watch over it",
          "score": 6
        },
        {
          "body": "They probably already selected someone, but are keeping you warm just incase.",
          "score": 7
        },
        {
          "body": "A recruiter is always going to lock in the candidate of choice before releasing the other candidates. I think that's the stage you're in. It sucks, I know. I've been there. Just keep applying and pushing through.",
          "score": 5
        },
        {
          "body": "Assume it’s a no until you have a written offer and keep applying and interviewing elsewhere.",
          "score": 3
        },
        {
          "body": "Don't think too much about it. This is mostly not about you. In today's economy, companies have open positions but they are not very keen on filling it up because of budget cuts. \nI had 2 interviews with the top notch companies but they both came back to me saying, we are not hiring anymore at this point because of budget.",
          "score": 3
        }
      ]
    },
    {
      "title": "Offer or rejection?",
      "body": "I finished a final round of interviews about a week and a half ago. I was supposed to hear back last week but the hiring manager had an emergency then the recruiter was on vacation. Recruiter replied to my follow up this morning saying \n\n“I apologize for the delay, as I have been out of the office.  Catching up with the leader today and will be in touch.  Do you have time tomorrow to connect?”\n\nAnd later followed up with simply “does 9:30am\nTomorrow work?”, then “Great – I’ll call you then!”\n\nMy workday status is still set to “under consideration”\n\nDo we think this follow up call is likely for an offer or for a rejection, based off how vague they were?\n\nI have another offer from a different company but have been waiting for this company to reply since it’s more money and more stable.",
      "subreddit": "interviews",
      "score": 4,
      "url": "https://reddit.com/r/interviews/comments/1p0pdut/offer_or_rejection/",
      "comments": [
        {
          "body": "Highly unlikely they would set up a call to let you know they’re not moving forward with you. Hopefully it’s an offer, good luck!",
          "score": 5
        },
        {
          "body": "They don't schedule a call with candidates they reject.",
          "score": 3
        },
        {
          "body": "Probably an offer, you’ll know tomorrow. Most companies don’t call and make rejects. Good luck!",
          "score": 3
        },
        {
          "body": "A rejection would likely just be an email! :)",
          "score": 2
        },
        {
          "body": "It really could be either but I wish you the best of luck! Let us know how it goes.",
          "score": 2
        },
        {
          "body": "Update: it was an offer thankfully",
          "score": 2
        },
        {
          "body": "Probably not a job offer yet but more then likely since they were away, to touch base with you and see if your situation has changed.",
          "score": 1
        }
      ]
    },
    {
      "title": "Anyone know how long LSEG takes to decide after final interview?",
      "body": "Does anyone know how long it typically takes for LSEG to make a hiring decision after the final interview for an analyst position? It’s been two weeks since my final round, and I’ve sent follow-up emails to both HR and hiring manager but haven’t received any response yet. I haven’t gotten a rejection letter either, and Workday status still shows in process. I’m starting to think they might have already moved forward with another candidate, but I still have a bit of hope since I really like this role. I’d appreciate any insights or experiences anyone can share.",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1ouwqk7/anyone_know_how_long_lseg_takes_to_decide_after/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Hi. My final round is tomorrow. Can I ask was it completely technical or general HR questions? I already had 2 rounds interview, one was technical and the next was managerial.",
          "score": 1
        },
        {
          "body": "Had my final round with the director and got the results in 2 days (Final round on Friday, result on the following Monday)\nJoining next week",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 1
        },
        {
          "body": "Bro they just dont reply at all. I'm so sick and tired of calling so many times. Theyre slower than a leap year *** leap year tbh",
          "score": 1
        },
        {
          "body": "Bro did you receive a update?? Even mine I'm waiting for 11 days now. Sent a follow up email but no response tho",
          "score": 1
        }
      ]
    }
  ]
}