{
  "company": "zoom",
  "post_count": 62,
  "exported_at": "2026-01-18T17:44:53.318Z",
  "posts": [
    {
      "title": "Impossible to get a job since 2022",
      "body": "What the hell is going on with the job market? Why is it like climbing mount Everest to get a job now? There's tons of ridiculous steps you have to take in the application process now, multiple interviews, zoom interviews, assessment tests and all kinds of other nonsense thrown in there making it next to impossible to even talk to someone. Then if you finally get an interview they just ghost you. Most of the time I can't even see the hours i can work until i make an account on the website wtf. what is the point in this. Why is it 100x harder now to get a job than it was before covid?",
      "subreddit": "jobs",
      "score": 1628,
      "url": "https://reddit.com/r/jobs/comments/1chpklq/impossible_to_get_a_job_since_2022/",
      "comments": [
        {
          "body": "The process is also like 70% longer than it used to be. Is it just me or did it only take a few weeks to go through the hiring process from the time you submitted your application in years past? Like I just got a request on one I put in back in February.",
          "score": 536
        },
        {
          "body": "its 1000x times harder.  \"cost efficiency\", \"strategic realignment\", offshoring, AI.  This is the utmost worst.",
          "score": 420
        },
        {
          "body": "I hear you man. I network, reach out, write my heart out on a fucking substack. Nothing works. WTF. I am so tired of constantly hustling without any progress.",
          "score": 217
        },
        {
          "body": "I tried to apply on Target and get rejected 3 times in 2 months. All of them passed interview process. It felt weird because i thought Target is one of the easiest place to get a job.\n\nSo definitely something is going on in job market",
          "score": 108
        },
        {
          "body": "I am having the EXACT same issue. Got laid off in 2022, was a highly sought after candidate before that and have not been able to find a good job since.",
          "score": 62
        },
        {
          "body": "I have no idea. I have never had this much trouble looking for a job until now, and I’m not even anyone special or highly skilled. Now I feel lucky to get an interview, and even then I can count on three or four rounds and maybe hearing something, or employers calling my references without making an offer rather than as the final step in confirming an offer. \n\nI’m so tired of even applying at this point. I tried to force myself to do applications last night and just couldn’t but at least I have a job in the meantime if I need to breathe for a day or two.",
          "score": 120
        },
        {
          "body": "[deleted]",
          "score": 93
        }
      ]
    },
    {
      "title": "Got put “on hold” after 9 interview rounds, meeting 27+ people, and a 45-person Zoom talk. Healthcare research hiring is absolutely broken",
      "body": "I applied for a junior research role at one of the biggest hospital systems in the Midwest. Already had a small research job, but this felt like a big opportunity. Turns out it was just a big waste of time and energy.\n\nHere’s the breakdown of the 9-round circus:\n•-Initial screen: SIX people on the call.\n•-Meet the boss: Chill director, seemed like the only normal part.\n•-Presentation: Full 45-minute research talk, 45 people showed up to the Zoom.\n•-Code review: THREE software engineers. Literally started the session by saying “we don’t know much about data science.” So why are you reviewing my code??\n•-Case study: 5-person panel. One guy kept saying “I’m just a doctor looking for answers, so your answer is the final conclusion.” Like bro, that’s not how research works. I’m not Moses coming down from the mountain with divine statistical truths.\n•-Behavioral: Another 6-person round.\n\nThought that was it. Nope.\n\nTwo days later:\n•-Culture Fit 1: 3 people, 2 had cameras and mics off, 1 asked a couple questions.\n•-Culture Fit 2: Just the manager, 30 minutes late, rushed the entire thing in 15 minutes, told me to send all my work to him. I sent it by EOD.\n•-Culture Fit 3: Senior team member, finally someone respectful—walked me through projects and actually made me feel human.\n\nAfter Round 9, I sent a personalized thank-you note to everyone. Waited. Two weeks—nothing. Sent a follow-up. Still nothing.\n\nOne month later, I get a generic email: “Your application is on hold.”\n\nNo feedback. No explanation. Nothing. Just the corporate version of a shrug emoji after I prepped for weeks, jumped through hoops, and spoke to an army of people for a junior role.\n\nIf this is how major hospital systems hire, no wonder people are leaving academia and healthcare research in droves. Absolute clown show.\n\n⸻\n\nTL;DR:\nApplied to a junior research role at a major hospital system. Went through 9 rounds of interviews, spoke to 27+ people, gave a 45-min research talk, did a case study, code review (by software engineers who didn’t know data science), and 3 culture fit rounds. Sent follow-ups. Ghosted for a month. Got told “your application is on hold.” Healthcare hiring is broken.",
      "subreddit": "interviews",
      "score": 115,
      "url": "https://reddit.com/r/interviews/comments/1kgyp2a/got_put_on_hold_after_9_interview_rounds_meeting/",
      "comments": [
        {
          "body": "I’m dealing with this now. 7 rounds of interviews/presentation. It’s been a week since the final round of 4 individual interviews with c-suite folks. I emailed the recruiter this morning, as it’s been ample time for a decision. Still, makes me sick to my stomach awaiting my fate — I have been screwed over so many times at this point.",
          "score": 16
        },
        {
          "body": "Name and shame on glassdoor",
          "score": 12
        },
        {
          "body": "That’s so frustrating. They should give you a personal message after going through so much.",
          "score": 6
        },
        {
          "body": "What is the salary range?  Hard to tell if it is a 80k role or 300k.  It would be overkill for a 80k job and waste everyone’s time.",
          "score": 4
        },
        {
          "body": "Sorry you had to go through that. They have some issues as if you are a lab rat in a “big experiment” using the scientific method over and over, just overkill right?",
          "score": 4
        },
        {
          "body": "Didn’t a bunch of medical research work just get cancelled because of government cuts? Maybe that’s what happened here.",
          "score": 3
        },
        {
          "body": "Any place that relies on federal money for research is in turmoil at the moment. Their hiring practice sounds sucky, but they could be scrambling inside right now too.",
          "score": 3
        },
        {
          "body": "Had a somewhat similar (but not as bad) experience… I did 6 interview rounds (5 interviews and a test) for a role that required “1+ years of experience.” Then was told they had budgeting issues and would not be hiring after all. \n\nA lot of people who aren’t interviewing right now don’t realize how common this stuff is. It’s no longer as simple as “tailor your resume and do well on the interviews”- so many companies cancel roles after interviews or just straight up ghost. I think I actually get ghosted more often than I get an actual rejection email",
          "score": 3
        }
      ]
    },
    {
      "title": "Is it OK for me to ask the HR to delete the recorded Zoom job interview?",
      "body": "I interviewed for a job via Zoom a few days ago and they told me that I had to record the whole interview process so I did. They haven't responded about the results yet, but it has been a few days and they told me that if I don't get the results in a few days that I am probably not considered for the job.\n\nI am concerned about the recorded interview. I hope they just use it for the interview process and delete it afterwards, but I am afraid that won't be the case.\nI've heard so many people talk about their experiences about zoom interviews and although it was just for job interview, some of the companies used it for their promotions, even though they didn't get the job.\n\nSo is it OK to email them and kindly ask to delete my interview? Or would that be weird?\n\nI am sure that I won't be doing any interviews for them in the foreseeable future or in that industry,so I don't think it matters whether I look weird or not but I don't wanna sound insane.\n\nWhat do you guys think I should do?",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1l9c5qo/is_it_ok_for_me_to_ask_the_hr_to_delete_the/",
      "comments": [
        {
          "body": "If you’re going to reach out, you should inquire about your status as a candidate first.",
          "score": 7
        },
        {
          "body": "What do you think they’re going to use it for???",
          "score": 2
        },
        {
          "body": "I'm honstly curious - why do you care so much about the recording? Do you mind sharing the role description?\n\nYou clearly want the job. Do you still prefer them to delete your interview if they end up making you an offer?",
          "score": 1
        },
        {
          "body": "If you're really concerned then ask (although I have to point out that there's no way to know for sure that a recording was actually deleted). Mostly, though, I'm having trouble figuring out how a recording of an interview of an unhired candidate could be used for 'marketing purposes', or any other purpose for that matter.",
          "score": 1
        },
        {
          "body": "why would they use an interview recording for marketing purposes? i dont see how that even translates to marketing at all",
          "score": 1
        },
        {
          "body": "How will you know that it has been deleted?  Is there a way to verify?",
          "score": 1
        },
        {
          "body": "If they didn't hire you, yes",
          "score": 1
        },
        {
          "body": "I understand your concern, but for the purposes of trying to get the job, don’t bring it up until you either get accepted AND start the role, or find out you didn’t.\n\nIMO it might come across as a weird request and could be misinterpreted that you want it deleted because you aren’t confident in that interview, or you are trying to hide something.",
          "score": 1
        },
        {
          "body": "It's your right to ask. However, they won't tell you if they decide they want to keep it for training purposes.",
          "score": 1
        }
      ]
    },
    {
      "title": "What are some indicators that you landed a job during a Zoom interview?",
      "body": "Hi! I’m new to this sub and had an interview yesterday for my dream company via Zoom. Everyone was really nice but what were some indicators that could potentially indicate that I might have landed the job? Other than the obvious offer letter lol. The recruiter said that she received positive feedback about me but they still have to allow other interviewees the opportunity to interview as well so I should hear back next week.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1j5xq07/what_are_some_indicators_that_you_landed_a_job/",
      "comments": [
        {
          "body": "Positive signs are when they dig into start dates, salary ranges, or onboarding, or loop you in with future teammates instead of just surface questions. If they ask for references quickly or talk about specific projects you’d own, that’s also good. Still, hiring can stall even with great signals, so keep applying this week. If you want more leads in the meantime, wfhalert is a simple service that emails real remote job listings, stuff like admin or support roles, so you’re not stuck wading through obvious junk.",
          "score": 17
        },
        {
          "body": "Do not look for signs. There is no way to predict the outcome of an interview if the interview went well. Interviewers will ask when you can start, introduce you to future coworkers, show you your future desk/office, say \"We look forward to you starting to work here!\" and then reject or ghost you. This happens all the time. There is only one good sign: the offer letter.",
          "score": 15
        },
        {
          "body": "Speaking from any video call interview really, not just Zoom. No, never. I’ve had the opposite experience. The ones that went really well where I was “a joy to talk to” and had “great answers” never panned out. It just feels like pandering and I write them off, hasn’t worked out once.\n\nThe ones where it’s business as usual and you fit with what we need so that box is checked off type of vibe get me further usually, still haven’t landed anything though.\n\nIt’s best I’ve found not to get your hopes up, that up and down rollercoaster will wear you out. Stay neutral and level headed. If something happens, then it happens.",
          "score": 12
        },
        {
          "body": "Don't believe anything they tell you or how they react.  Past history and you can read it in Reddit from many situations where the interviewer seems the more openly positive about you during the interview, the worse it is for you.",
          "score": 6
        },
        {
          "body": "There are none. It's impossible to tell. You don't know you have the job until they say 'Congratulations, we're pleased to offer you...\"",
          "score": 4
        },
        {
          "body": "There are no indicators that you landed a job. No matter how much people like you, there can still be someone who is a better fit or has a connection. There could be an internal candidate but they need a second choice in case they can’t offer it to their first choice. \n\nIn general I do well in zoom interviews and usually get to the next/final round. Some indications it went well are if the interviewers ask follow up questions and respond to my thank you notes. It’s easier for me to tell when a zoom interview isn’t going well…I stumble over questions or use examples that aren’t on point for my audience. I have a PhD, and if during an interview I’m asked about long term future career plans, if I’ve seen and am okay with the salary, etc, I’m not going to get the job even if I have all the right answers. The interviewers are nervous i’ll leave for a better job.",
          "score": 3
        },
        {
          "body": "Unfortunately I learned the hard way to not get attached or assume that just because they said I had good answers I will get the role",
          "score": 2
        },
        {
          "body": "Yeah. I even had nice responses from hiring managers after sending the obligatory thank you note post interview - and got a rejection a two days later. That one crushed me cause I thought I was going to move forward for sure and that the interview went great. \n\nI’m currently looking for a new job again (though because I hate where I’m working not because I was laid off like last time) and I’m already feeling all the anxiety hitting me like a freight train. Unfortunately I waited until I feel like I can barely stand another day where I am before starting my search.  I found something online that “feels” like I should be a shoe-in and I have a former colleague working there who is helping put me forward but I know the crushing feeling I will have if it doesn’t pan out. Ans I don’t even know if I am getting to the interview phase of things yet.\n\nIf anyone has advice on how to weather this difficult season, I would love it.",
          "score": 2
        }
      ]
    },
    {
      "title": "Zoom and teams interview questions ",
      "body": "When I do interviews on video I don’t do as good as a in person interview. \nCan someone give me any advice? Do I look maybe more nervous? Could it be my camera? I will admit I do always worry how I will look and weather is lighting and background is good enough. ",
      "subreddit": "interviews",
      "score": 6,
      "url": "https://reddit.com/r/interviews/comments/1hnwhao/zoom_and_teams_interview_questions/",
      "comments": [
        {
          "body": "I am the opposite; I much prefer zoom interviews. Commuting to the interview and wearing full on office attire in a strange environment is just not my thing.\n\nSomething that helps me is putting a little sticker right next to the webcam lens so I can remember to look up when I'm speaking. It's a nice way to maintain focus. \n\nIt also helps to prepare common interview questions. ChatGPT has helped me so much in crafting these! I keep a log of the questions and my responses based on the type of role I'm applying for. I make sure not to copy paste blindly. You need to put your own voice into this to have it sound authentic.\n\nLastly, no one in the world will never say they enjoy interviews or that it comes easy to them. The key is practice. I'm someone who struggles with anxiety and I have a perfectionist streak, but I centre myself in the knowledge that if something is meant to be, it will be.",
          "score": 5
        },
        {
          "body": "Man this sub is flooded with responses that are actually ads.\n\nIf your zoom and teams are updated, then you can blur background. Perfectly professional to do so. Also, if I’m nervous I hold a pen or rubber band or something in my hands in my lap to play with as I speak, making sure to still look forward. As long as it’s small motions, they won’t see. Also, I put multiple beside me on my desk, so if I drop it, I’m not fumbling to pick it up again, I just grab another one. I also put my resume or the job posting up on my second screen.",
          "score": 2
        },
        {
          "body": "Wear glasses...worked for me.",
          "score": 1
        }
      ]
    },
    {
      "title": "UK-based job seeker looking for someone to practise mock interviews (via Zoom) 🙏",
      "body": "Hi everyone!\n\nI’m currently based in the UK and have been job hunting for the past 5 months. I’ve submitted over 50 applications, and I’m about to attend my 6th interview—which I really hope will be the one that works out!\n\nSince I don’t have much interview experience, I’m hoping to find a kind native English speaker who’s willing to help me practise mock interviews or just improve my oral English through casual conversation (Zoom / Skype / Google Meet, whichever works).\n\nPlease feel free to message me or leave a comment—thank you so much in advance! 🙏",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1lb6bhc/ukbased_job_seeker_looking_for_someone_to/",
      "comments": [
        {
          "body": "Just shot you a message!",
          "score": 1
        },
        {
          "body": "DM me, can help out.",
          "score": 1
        },
        {
          "body": "Getting to your 6th interview means you're doing something right with your applications and you're clearly qualified for these roles. The challenge now is translating that on-paper potential into interview success, and practicing with native speakers is a solid approach. Your instinct to focus on oral communication is spot-on because interviews are as much about how you say things as what you say.\n\nThe reality is that finding consistent practice partners can be hit-or-miss, and you need something reliable as you prepare for upcoming interviews. You might also want to consider practicing with AI tools that can simulate real interview scenarios and help you work through common questions until your responses feel natural. I'm actually on the team that built an [interview helper](http://interviews.chat), which lets you practice with an AI interviewer that adapts to different job types and can help you navigate those tricky questions that often trip people up in real interviews.",
          "score": 1
        }
      ]
    },
    {
      "title": "PSA: Please do not cheat",
      "body": "We are currently interviewing for early career candidates remotely via Zoom. \n\nWe screened through 10 candidates. 7 were definitely cheating (e.g. chatGPT clearly on a 2nd monitor, eyes were darting from 1 screen to another, lengthy pauses before answers, insider information about processes used that nobody should know, very de-synced audio and video).\n\n2/3 of the remaining were possibly cheating (but not bad enough to give them another chance), and only 1 candidate we could believably say was honest.\n\n7/10 have been immediately cut (we aren't even writing notes for them at this point)\n\nPlease do yourselves a favor and don't cheat. Nobody wants to hire someone dishonest, no matter how talented you might be. \n\n\n\n\n\nEDIT: \n\nWe did not ask leetcode style questions. We threw (imo) softball technical questions and follow ups based on the JD + resume they gave us. The important thing was gauging their problem solving ability, communication and whether they had any domain knowledge. We didn't even need candidates to code, just talk.",
      "subreddit": "cscareerquestions",
      "score": 4442,
      "url": "https://reddit.com/r/cscareerquestions/comments/1g9l83u/psa_please_do_not_cheat/",
      "comments": [
        {
          "body": "man i dart my eyes around sometimes and/or pause, then get paranoid that they suspect cheating, which just makes it worse",
          "score": 3433
        },
        {
          "body": "Hey if my eyes dart to the other monitor when you ask me your damn “tell me about a time” questions it’s cause I have a page open with my professional projects in bullet point outline format.\n\n\n\nI’m not doing chat gpt just cause I prepared well or cause I gather my thoughts before answering the question I’m expected to answer with 3-5 minute story in STAR format.",
          "score": 1274
        },
        {
          "body": "And the 1 honest candidate took 30 seconds too long to reverse the linked list so he’s no good",
          "score": 887
        },
        {
          "body": "We let people use whatever resources they want while completing our coding challenge (which is simple and relevant to the job, not leetcode), with the one caveat that they let us know what resources they are using.\n\nWe still have people trying to cheat. It only hurts you. I watched a candidate copy a stack overflow answer line by line, complete with errors, before I totally wrote her off. If you do it, prepare to get an immediate no from any competent hiring committee.\n\nEdit: sorry y’all, we’re not currently hiring.",
          "score": 581
        }
      ]
    },
    {
      "title": "I just had a \"clap-along\". I had no idea this is how they tested entry-level.",
      "body": "I just had my first interview (yup! very happy, after like 12 months of searching!). It was over zoom, and it was with my would-be supervisor (director of engineering) and the director of marketing, and one other person, not even sure who they were though. \n\nI knew it wouldn't be a very difficult interview cause it's with a very small non-tech company in my state, and the position would be doing web development for our clients and partners. Anyways, the recruiter just told me that \"entry-level CS knowledge would suffice\"\n\nSo after talking about myself for 5-10 minutes, the director of engineering said \"are you ready for the technical part of the interview\"\n\nMe: \"Sure\"\n\nHim: \"Don't worry we don't like to have candidates stress. We just want someone that is motivated and willing to learn.\"\n\nMe: \"Awesome, that sounds great.\"\n\nHim: \"Okay, now I want you to \"clap\" when the right answer is read aloud, okay?\"\n\nMe: \"Okay\" \\*thinking, okay did I hear that right? That's strange\\*\n\nHim: \"First question. Which tool is used for styling a webpage? A.) HTML, B.) Javascript, C.) Django, or D.) CSS\"\n\nMe: \\*claps when I hear CSS\\*\n\nHim: \"Great! Next question: API stands for A.) \"App Programming Initiative\", B.) \"Angular Programming Interface\", C.) \"Application Programming Interface\"\n\nMe: \\*claps when I hear the correct option for API\"\n\nHim: \"Excellent!!! You're one of the best candidates we've had so far!\"\n\nMe: \\*trying not to laugh\\* \"thank you!\"\n\n  \nSo basically, yeah the interview was just that for like, 10 minutes (the questions were legit mostly that easy, yes, with a couple questions asking what a particular paradigm or basic python function might do). \n\n  \nSo yeah, has anyone ever had a clap-along interview before or just me?",
      "subreddit": "cscareerquestions",
      "score": 3182,
      "url": "https://reddit.com/r/cscareerquestions/comments/1df6nro/i_just_had_a_clapalong_i_had_no_idea_this_is_how/",
      "comments": [
        {
          "body": "I can confidently say that I have interviewed many, many times as both the interviewer and the interviewee, and not once have I clapped during an interview.\n\nThat's a very... unique interview process.",
          "score": 2951
        },
        {
          "body": "You were happy and you knew it",
          "score": 990
        },
        {
          "body": "Why don't I ever get one of these technical interviews",
          "score": 676
        },
        {
          "body": "Which company is this?  I’d like to apply",
          "score": 314
        },
        {
          "body": "&gt; Him: \"Excellent!!! You're one of the best candidates we've had so far!\"\n\nYou should have clapped here too IMO.",
          "score": 148
        },
        {
          "body": "[deleted]",
          "score": 488
        },
        {
          "body": "I’ve had to make it clap for a job before. Industry standard",
          "score": 185
        }
      ]
    },
    {
      "title": "RIP",
      "body": "~120 applications...\n~17 first round HR/Leets...\n~6 final round interviews... \n\nJust received a phone call from one of my top choices... 5min of the recruiter telling me how great my scores were and how much everyone enjoyed talking with me (combined 13hrs of Zoom personality/white board style interviews for this one position)... after fluffing me up, he unfortunately says, “I am sorry, but we can not rationalize giving you the position over an applicant with a PhD.  In normal times we would have offered you the position in a heart beat.  But we are finding the applicant pools are becoming stronger than we have ever seen.” \n\nCan I get a RIP in the chat friends? \n\nPS... I still have 4 more of the final round interviews to complete, so I am still extremely grateful for the opportunities to atleast interview.  But I am feeling extremely defeated after putting nearly ~40hrs into that single companies application process.\n\nEDIT:  Thanks for all the support friends!  I really just needed to let it out.  Thank you for refreshing my spirits!",
      "subreddit": "cscareerquestions",
      "score": 1739,
      "url": "https://reddit.com/r/cscareerquestions/comments/jpe1q1/rip/",
      "comments": [
        {
          "body": "It took me 800+ applications to land a graduate job. \n\nThe entry level market is fucked.",
          "score": 1002
        },
        {
          "body": "You'll get a job soon.  17/120 for callbacks and 6/17 for final rounds is very good.",
          "score": 266
        },
        {
          "body": "&gt;Can I get a RIP in the chat friends?\n\nRIP\n\n&gt;But we are finding the applicant pools are becoming stronger than we have ever seen.\n\nRIP for everyone. I guess this isn't surprising after nearly a decade of people saying \"coding leads to high paying jobs!\", not to mention the economic crisis the world is in rn. Demand, meet supply.",
          "score": 332
        },
        {
          "body": "13 hours of interviewing. Any company requesting that of me can accept my invitation to eat my ass. Fuck that. \n\nF for you bro.",
          "score": 191
        },
        {
          "body": "That seems like some very good statistics. Hang on tight and you will soon get a job. That’s way higher than my bite ratio, and I recently got 3 offers about 3 weeks ago.",
          "score": 93
        },
        {
          "body": "Kind of a shit move of them to interview you if they we're going to go for the applicant with a PhD no matter what imo",
          "score": 122
        },
        {
          "body": "RIP man I haven’t even graduated yet and am terrified, I’ve been trying to get to internships and I can’t even get one right now",
          "score": 81
        }
      ]
    },
    {
      "title": "Time to push back on coding challenges",
      "body": "I've been interviewing for jobs and have now done a few coding homework projects.\n\nI don't have a problem with the homework so much as the process.\n\nI submit the work,  they reject it without explanation.\n\nGiven the time I've invested in coding, I would think it's only fair that I can get some actual feedback and a chance to defend my decisions.\n\nSo from now on, if I'm asked to do a coding challenge, I will agree, on the condition that the review is done in person and I get a chance to explain my decisions and learn from their critique.\n\nSo I'm calling on the community to join me in expecting a fair return for the effort we are putting in.\n\nLet's make it the norm that we expect an in-person (zoom) review.\n\nIf you are the person doing the interviews, then I'm calling on you to change your processes and do an open review with the applicant. You are taking the time to review the code anyway and you just might learn something from the applicant.\n\n&amp;#x200B;",
      "subreddit": "cscareerquestions",
      "score": 555,
      "url": "https://reddit.com/r/cscareerquestions/comments/17nypzm/time_to_push_back_on_coding_challenges/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 396
        },
        {
          "body": "[deleted]",
          "score": 264
        },
        {
          "body": "I’m sure this reddit protest will change hiring practices in an employers market.\n\nGo OP, don’t let your dreams be memes",
          "score": 64
        },
        {
          "body": "I feel your pain but otoh employers do not want to entertain an argument &amp; you can't make them.\n\nOn a few occasions when I've felt particularly annoyed about the whole business, I've done coding exercises for jobs that I didn't particularly want, submitted them and then blown off the next-stage interview. Yes, I need help.",
          "score": 68
        },
        {
          "body": "&gt;So from now on, if I'm asked to do a coding challenge, I will agree, on the condition that the review is done in person and I get a chance to explain my decisions and learn from their critique.\n\nInterviewer: Hey /r/bsutto! We love your resume and before we proceed, please do this takeaway assignment! Let me know if you have any questions!\n\nbsutto: Hey, oh sure! on the condition that the review is done in person ....\n\n**Interviewer: Unfortunately we have decided to close the role / We have decided to go with a different applicant. Thank you for applying.**",
          "score": 44
        }
      ]
    },
    {
      "title": "My CEO’s rating on Glassdoor is so bad that all we are getting are shitty hires",
      "body": "So I work for a company that probably no one has heard of as a full stack developer. I have been there for a year. Last year my company appointed a new CEO after I started and let me just be frank, he is a fucking asshole. I swear he has an open disdain for his employees, and he yells at them over Zoom, talks to them like children, and in general has a smug and demeaning tone. I don't think I have heard anyone say anything good about him, but that's who the board wants.\n\nRight now he is sitting at a 20% Glassdoor rating. For comparison sake, Vince McMahon, a guy who literally made his employees kiss his ass on international television on multiple occasions, is at 50%. Even Glassdoor reviews that give the company 5 stars give the CEO bad ratings.\n\nWith that, we have lost a lot of good people. Like, a third of engineering including 2 CTO’s in 6 months and other management. We have even turned over our executive VP, CFO, and head of HR (yeah...). The company’s solution was to mass hire to make up for the losses.\n\nWith the market being super hot, developers are keen to weed out companies with ratings like this. The result is that we have had to scrape the bottom of the barrel with new hires. Our interviews and assessments are now easier, we are hiring managers who are sub par and don't fit in, we are hiring job hoppers who have 3 month tenures at several companies, and we are starting to outsource work for the first time ever and train folks who barely speak English.\n\nSo my question is, am I over thinking that this will have any negative impact on my career or is this a textbook example of the [Dead Sea Effect](https://brucefwebster.com/2008/04/11/the-wetware-crisis-the-dead-sea-effect/)? Or do I just need a reality check that none of this shit is normal or OK?",
      "subreddit": "cscareerquestions",
      "score": 1109,
      "url": "https://reddit.com/r/cscareerquestions/comments/sofqaq/my_ceos_rating_on_glassdoor_is_so_bad_that_all_we/",
      "comments": [
        {
          "body": "There's really nothing you can do about this. And you don't have to worry. If people ask why you're leaving just point out the rating of the CEO on Glassdoor ;)",
          "score": 838
        },
        {
          "body": "[deleted]",
          "score": 273
        },
        {
          "body": "Vicious cycle: good people leave (since they can find jobs more easily) -&gt; bad people stay (toxic or can’t find good jobs) -&gt; worse place to work -&gt; GOTO 10\n\nhttp://brucefwebster.com/2008/04/11/the-wetware-crisis-the-dead-sea-effect/",
          "score": 247
        },
        {
          "body": "Hey what company is this, I’m a shitty hire looking for work lol",
          "score": 58
        },
        {
          "body": "Job hopping employees are competitive as fuck. They basically are their own company.",
          "score": 84
        }
      ]
    },
    {
      "title": "My work is hiring for a Head of Software Development and I really love the candidate we have narrowed down, but the other guy I'm with says no for petty reasons. Any advice?",
      "body": "I currently work for a tech company in a bi\ng city as a lead manager. I've been assigned with another delivery manager to find a new head of software engineer/development for the team.\n\nWe have interviewed this one woman who is very early 30s. She has a very impressive resume and conducted herself very well over Zoom. She passed our programming tests in half the time as other candidates and got everything correct. She says she's been teaching herself code since she was around six and likes to build PCs. She dropped out of college where she was earning a computer science degree and went elsewhere to get a degree in a non-science field because of costs. She has spent her entire 20s working for the same social media company as a software engineer and then spent one year as a senior head of department where she was unfortunately made redundant due to the current climate.\n\nI know she doesn't have a lot of experience leading, but she definitely shows that she can do it. I've looked her up and she's done a few TEDtalks on women in tech as well as had a tech crunch article published about her.\n\nThe other person I'm tasked with on the hiring process thinks she won't fit in with the company for petty reasons such as she doesn't drive, age, she admitted she doesn't own a home or have children, etc. He said he would rather someone on the team like the rest of them: homeowner, married, kids, longer time as head somewhere else, etc.\n\nShe can't help her circumstances though and she seems nice. Are these valid reasons or a lost cause?",
      "subreddit": "cscareerquestions",
      "score": 828,
      "url": "https://reddit.com/r/cscareerquestions/comments/lce3dv/my_work_is_hiring_for_a_head_of_software/",
      "comments": [
        {
          "body": "That is not petty, that is one of the most common examples of illegal descrimination (Edit: [link](https://www.eeoc.gov/pre-employment-inquiries-and-marital-status-or-number-children)).   You shouldn't even know a person's family status because it is wildly inappropriate and explicitly illegal to be asking someone about romantic relationships and children in an interview.",
          "score": 1459
        },
        {
          "body": "&gt;petty reasons such as she doesn't drive, age, she admitted she doesn't own a home or have children, etc. He said he would rather someone on the team like the rest of them: homeowner, married, kids, longer time as head somewhere else, etc.\n\nIf you're in the US, much of that would bump right up against the limits of legality, some parts cross the line. People around here get twitchy when you mention HR, but IMHO this is definitely a situation you need to bring to HR. If this individual doesn't get hired _because_ of the reasons your colleague has expressed (have they done so in writing, either via email or text chat?), that puts the company in a dangerous position.\n\n\"This person isn't like the people we already have\" is actually a _very good_ reason to hire someone - it brings new perspectives to the table. Homogeneity breeds stagnation.\n\nIt sounds like the biggest question mark here is the amount of time she's spent in a leadership role and it can be very hard to get promoted into those roles without changing companies. She's got technical chops and knows how to get up in front of people and deliver a presentation. With the right support and maybe some leadership training, she'll probably do very well.",
          "score": 694
        },
        {
          "body": "Sounds like it might be in the best interest of the company to hire this candidate.  May also want to start looking for a new delivery manager, if this is normal then it is not good for the growth and success of the company short or long term.  Companies need a mix of personalities, ages, and backgrounds to be successful.",
          "score": 200
        },
        {
          "body": "Women get discriminated on for having kids and a husband, and now they're getting discriminated for not having those things? Damn we really can't win.",
          "score": 450
        },
        {
          "body": "Hire her or send me her resume",
          "score": 113
        },
        {
          "body": "sounds like sexism why would you want someone can drive she’s going to be Software Engineer not a driver.",
          "score": 150
        }
      ]
    },
    {
      "title": "My team is pulling 90+% of one of my coworkers weight and just discovered they blatantly lied when applying",
      "body": "I work for an extremely large and profitable tech company in the Bay Area, CA.  Approximately 10 months ago, we hired on an engineer into a senior role even though there were some red flags.\n\nThis person seemed like they had a fantastic attitude during the four interviews in which I was present.  I voted not to hire this person into this fully remote role after the second interview because their communication skills, both spoken and written, were mediocre at best.  My team scheduled two more interviews with this engineer, mainly to give me a chance to see that they were hirable and would work well on our team.  This engineer's technical acumen seemed great on paper and in certain moments during the interviews but whenever I dug into any topics in detail, their skills seemed to disappear and it seemed like the engineer was hiding behind Zoom technical issues / communication problems.\n\nI was bewildered how my team was sold on this engineer... but they were and I couldn't convince them otherwise.  The other two members of my team are all incredibly smart, hard working, and experienced engineers.  Since I was the least experienced engineer on the team, I deferred to my more experienced counterparts.\n\nWhile the interviews weren't stellar, it seems like the engineer we interviewed and the engineer that's now on our team are two different people.  I speculate they had somebody sitting just off screen helping them throughout the interview process.\n\nMy boss asked me to mentor this engineer about 10 months ago.  Me and the rest of my team have been pulling 90% of this engineer's weight in work.  The mentoring process hasn't been going well, especially from a coding perspective.  My boss recognizes this and has been coaching me on it trying to help me grow as an engineer myself.  My boss said something along the lines today like, \"well, they have a CS degree so they should understand XYZ.\"  My boss seems to agree with me 100% that a lot of things are not \"clicking\" like they should.\n\nI was very surprised when I learned they have a CS degree and curiously checked out their Linkedin profile to find out from where.  I was floored when I saw they're also stating they have a CS Masters and 11 years of experience (including 3 years as a Security Engineer, 2 years as a Lead Network Engineer, etc., 5 years as a Senior engineer).\n\n\"Well, everyone embellishes to some extent.\" I thought, until I expanded the section to see what they've worked on in their current role on our team.  The bullet points couldn't be further from the truth.  This individual would not be able to BEGIN to explain some of the concepts they are including on their LinkedIn profile (nor are they things that the engineer, much less my team, has worked on).\n\nThe rest of their LinkedIn profile is just as bad.\n\nI enjoy mentoring engineers but this person misrepresents EVERYTHING and never wants to put the work in to learn anything new.  How should I proceed?  Is there anything I can do?   We never should have hired this individual.  Our interview process should have disqualified them as a candidate on so many levels.  It did not and my day-to-day has suffered greatly as a result.  I don't enjoy my job like I used to but my team can't succeed without me helping this engineer.  \n\nI'm really not sure what to do.",
      "subreddit": "cscareerquestions",
      "score": 365,
      "url": "https://reddit.com/r/cscareerquestions/comments/112kwzs/my_team_is_pulling_90_of_one_of_my_coworkers/",
      "comments": [
        {
          "body": "This guy just got 10 months of FAANG salary. Mission accomplished",
          "score": 476
        },
        {
          "body": "You interviewed them, wtf is your hiring process where you have to check their LI for their credentials and not the resume you should have reviewed before interviewing them? What did you even discuss in the interview if you didn't know anything about their education and prior work experience? Every time I interview someone the majority of my time is spent drilling into their resume to avoid the exact same issue you're experiencing now. It's easy to put on a resume that you've done something, it's not easy to have someone asking you to drill into details of something they put on their resume that they didn't actually do.  \n\n\nBut here you are, so what do you do going forward? #1 is overhauling your hiring practice to prevent this in the future. If you don't do this, you'll simply fire this person and hire a similar person to replace them. #2 is providing feedback to them that they are not performing. You need to let them know in blunt terms that expectations for this role are x, y, and z, and provide direct expectations they'll need to meet in order to continue working there. The more specific and quantifiable these expectations are the better, but a lot of roles that isn't always easy to do. You then work with them and try to get them up to the expectation, and if they can't get there you let them go and hire someone new.",
          "score": 86
        },
        {
          "body": "Document everything and try to schedule a 1 on 1 with your manager.\n\nIf you have other teammates that also feel the same way, bring them along in the meeting to discuss or encourage them to also schedule a 1 on 1 with your manager.\n\nIn the meeting, try to keep it factual and focused on your workplace environment. No need to bring up LinkedIn since that stuff is unrelated to your day-to-day work, unless of course, the conversation steers towards talking about your colleague's integrity, or there's incredibly damning stuff on their profile that is worth bringing up (like confidential information or misrepresenting your company brand/team)\n\nExtra emphasis on keeping it professional, don't name call or bash your colleague. You'll have a much stronger case if you document the proof and stick to facts. \n\nI know it's probably hard since it's been almost a year and there's built up frustration, but at this point it's up to your manager to protect your team.",
          "score": 219
        },
        {
          "body": "&gt; I was bewildered how my team was sold on this engineer.\n\nSimple. They hate interviewing and if they say no, they have to go through all of it again. That's all there's to it. \n\nIt's a massive problem in our industry and no one seems to even recognize how big a factor this is. Interviewing sucks. \n\n&gt; How should I proceed?\n\nI've been in a similar situation a few times and eventually I got fed up enough that I actively looked for and worked together with devs also fed up with the person to go tell the manager a bad hire was made. Happened 3 times in 20 years. 2 of them were fired. 1 of them was moved to another team, where the same thing happened a year later, and they got fired.\n\nFocus on their lack of performance. Make sure they are isolated and don't get others to do their work for them. After a while the lack of output becomes too much an issue to ignore.\n\nA lot of these people manage to hide in organizations for a very long time by being in 'meetings' a lot and getting juniors to 'pair with them' so that they get them to do the work. As a lead I tend to 'isolate' them by excluding them from meetings that are not required to be in (because they often bring up 'meetings' as an excuse they didn't have output) to 'give them more room to be productive' and instructing junior devs to not pair with them because they are 'really really busy'. Doing this they can't bullshit management anymore, so the problem becomes self-evident quite fast.",
          "score": 36
        },
        {
          "body": "I had a similar experience, except I was the person with “less experience”.  We brought on a senior principal architect for a project who was never online, always blames it on technical difficulties.  Then come a hard deadline, he took PTO claiming it was an emergency family circumstance - I had to take what he had been working on for 3 months and do it in one week.  When I checked his “branch” he hadn’t done anything.  As soon as this occurred, I talked to my manager; our project lead, our department lead, as we had noticed he tends to not communicate well and blame everything on technical difficulties.  \n\nAnyways, from there just document everything.  We eventually had another deadline; and he did the same exact thing again, but this time I had one) - been already doing the work for him but not telling him (but let the rest of the team know) and two) had the whole team already been suspicious of him.  It was our last week at the client and he took off on vacation again without telling anyone he would be.  We immediately had a call with our department lead and he wasn’t asked to return to our project.\n\nChecking his LinkedIn, I saw a pattern, this man had held down a job for less then a year for the last 5 years.   I brought up the fact that he was exhibiting signs of moonlighting, or just, not actually working as it’d take 5 hours for him to respond on slack.  \n\nAnyway, I did the work our staff architect did (they also get a $70k bonus annually) had it all documented, everyone on my team only got a 1% raise this year (this is including my “promotion” to senior engineer) so it’s like why did I even bother trying to do the right thing.  Someone gets away with not working for like 6 months and I can’t even get my promotion raise.",
          "score": 117
        }
      ]
    },
    {
      "title": "god, recruiters are so annoying",
      "body": "got a referral from a friend of a friend for a startup tech consulting company in my area. i began the interview process that began with a 30 minute recruiter zoom screening. screening went perfectly. afterwards, the recruiter sent me a take home project to complete. i completed it quickly, making sure to answer every question and going above and beyond. at the time, i didn't have any offers pending so i was really looking forward to hearing back. the recruiter told me it would take 1-2 weeks for the team to review my work.\n\nthree weeks later and i had an offer on the table at another larger company. i emailed the startup to let them know of my offer deadline because i was genuinely really interested in working there and had conversations with the friend of a friend about how my take home project was exactly what they were looking for. the recruiter had also told me to let her know of any offer deadlines as they were really interested in me joining the team.\n\nthe recruiter responded and said, \"i sent you an update two weeks ago. you never opened the email.\" i checked my email including spam. nothing. i responded again and asked if they could just resend that email. at this point, i figured it was rejection, and was okay with that, i just wanted to know before i accepted the other offer.\n\nshe replied and said, \"we already sent you the update.\" she hadn't. is it just me or is this entirely unprofessional? like just tell me you rejected me... why the attitude? honestly i should've known she would be like this when she said, \"everyone here knows each other, this company is sort of like a continuation of college. everyone is family\" red flag dodged lmao. ",
      "subreddit": "cscareerquestions",
      "score": 410,
      "url": "https://reddit.com/r/cscareerquestions/comments/1gyd7mp/god_recruiters_are_so_annoying/",
      "comments": [
        {
          "body": "It seems to me that you’ve fallen through the cracks of this recruiter and she’s not going to admit her mistake. Move on.\n\nIt’s would also be perfectly reasonable when she told you they’ll get back to you in “a week or two” to reach out to her after those 2 weeks have passed and ask if there are any updates. Not because it would help you in any way but exactly to avoid being a victim of mistakes like this.",
          "score": 318
        },
        {
          "body": "I have you beat.  I interviewed and it all went well.  I got the offer shortly after and was told to sit tight for the official paperwork.  \n\nA few days go by and I email the recruiter.  He says “oops I accidentally sent your offer to someone else and they signed it and it is already processing”.   \n\nSaid company did end up hiring me 6 months later onto a much better team, but they legitimately gave my position to someone else all because of an email mix up.",
          "score": 119
        },
        {
          "body": "Definitely happens. I had a call with a recruiter who had a pretty decent hybrid job I felt I could land quickly, so I told her to submit me. Checked in about 3-4 days later to ask for a status update, and she tells me she could have sworn she remembered emailing me about something else she needed. Any additional conversations with her were just infuriating, especially the, \"Lol I could have sworn I emailed you about that!\"\n\nLanded another, much better hybrid role which I accepted this past Monday. As soon as my background check cleared (wasn't concerned, just a habit of mine) I disconnected from that recruiter on LinkedIn. Literally have not heard back from her on anything for nearly a month.",
          "score": 65
        },
        {
          "body": "Recruiters in this industry and others are just regarded. This is the 1 area where I hope AI does take over because they are very useless.",
          "score": 30
        },
        {
          "body": "Devil’s advocate: go triple-check your email address on your resume or whatever other system they might’ve used to be sure it’s correct. Was probably their mistake &amp; she’s probably full of it, but it’s in your interest to verify anyway.",
          "score": 14
        },
        {
          "body": "Recruiters and \"talent acquisition\" human resources people are almost always incompetent.",
          "score": 25
        }
      ]
    },
    {
      "title": "Are We Powerless To Impact Hiring Practices In Our Industry?",
      "body": "Specifically I mean live-coding interviews and their format. I am currently employed but am lightly applying around to remainin competitive in terms of salary and growth opportunity. The company I currently work for and the one I am currently interviewing at are not crazy big companies with a need for massive hiring standards/practices; it's all low to mid-level stakes here.\n\nRegardless, in all my years in this industry (software engineering specifically) I notice a trend of how the vast majority of live-coding interviews are the leetcode format; this includes the company I currently work for. I've also talked to several devs and non-technical hiring managers and they seemingly universally agree that it's not a great format. You remove your candidate from their work env., put them in a time crunch, and take away any ability to research native methods or implementations; effectively placing a standard on candidates to arbitrarily remember leetcode algos and arbitrary native methods to X SDK.\n\nI've screamed into the ether for years about, 'Why can't we just curate a repo that mirrors real problems and intentionally poorly written pseudo-code and let candidates work in the actual env. that mirrors the job?' That idea always gets shot down by my peers and superiors. 'Well, what if the download/setup for the test repo takes a while/their connection drops?' Well, if their connection drops then the Zoom call we're having with them drops too; kind of the least of our concern, and you tell me the last time it took more than a couple min. to clone/download a small repo and get it ready for use? So many managers I've worked with say they don't always prefer hiring Jrs because all they know is code regurgitation; they prefer people at the Sr. level like me and acknowledge that your average Sr. will actually struggle with these types of interviews because of the reasons I stated above, yet they paradoxically want the interview to remain the same.\n\n I find it lazy and ineffective. It ends up favoring candidates who cram leetcode and memorize code, but can't actually explain their code or pick it apart. We activelt create environments that are hostile to dynamic problem solving and the ability to converse about one's own code. The example I always use is, If I am a contractor who was hired to build a shed, you're going to want to see me talk about the structure of the shed I built and maybe explain why I made certain decisions, not if I remembered some arbitrary setting my nail gun needed to be set to to drive a nail into a board while simultaneously disallowing me to look at my nail gun's user manual to reference the specific setting needed.\n\nI also feel, though, that mosty of my peers dread the social aspect of interviews and aren't very good at embracing the dynamic approach any given candidate might take in an env. that better mirrors the real job. I feel it's a double-edged sword of technically minded people being incapable of developing social skill to dynamically test candidates and non-technically minded uppers who think the max depth of a binary tree algo is a wonderful test because it looks like coding to me, and I have no real frame of reference for what a problem in your field really looks like.  \n",
      "subreddit": "cscareerquestions",
      "score": 76,
      "url": "https://reddit.com/r/cscareerquestions/comments/1g1frn9/are_we_powerless_to_impact_hiring_practices_in/",
      "comments": [
        {
          "body": "the reason why hiring process is the way it is, is simply because nobody, not FAANGs, have figured out [a better way than leetcode](/r/cscareerquestions/comments/d7uees/perception_hiring_managers_are_getting_too_rigid/f15u84x/) (notice I wrote that comment 5 years ago, and it is still true today)\n  \nyou have so many candidates (100s of thousands), and you don't want to reject someone who's primarily working with language X just because your team's language is Y, there's also concerns of cheating (cheat/leakage on leetcode? whatever... immediately ban that question and switch to another one but cheat/leakage on project? now you have to come up with another fair project, same idea with university exams on why professors really don't like to change questions, otherwise how is it fair to the previous people)\n  \nso, you need a quick way (leetcode 1h, vs. some take-home) to immediately filter out the masses\n  \n&gt;If I am a contractor who was hired to build a shed, you're going to want to see me talk about the structure of the shed I built and maybe explain why I made certain decisions, not if I remembered some arbitrary setting my nail gun needed to be set to to drive a nail into a board while simultaneously disallowing me to look at my nail gun's user manual to reference the specific setting needed.\n  \nbut you aren't going to be building \"shed\" necessarily, you may be building shed today, building tomorrow, office the next day... and what do all of those have in common? the nail gun",
          "score": 84
        },
        {
          "body": "we had &gt; 10,000 applicants apply to our intern posting before we shut it down. gotta thin down the pool one way or another",
          "score": 37
        },
        {
          "body": "It’s mostly time and investment to maintain an interview repo.  You can’t give candidates access to internal infrastructure or ip so everything has to be maintained separately on a public github which is a lot of investment for hiring that might not be done often (maybe once or twice a year).\n\nI just try to use the tools I have (Hackerrank) to get candidates to show their problem solving skills, debugging and ability to communicate.  I care less about having a complete solution and always stop candidates early to ask them to consider alternative implementations.\n\nInterviewing is a skill and as an interviewer just have to extract the evaluation you want with the rubric you have. Some engineers just need to work on it.\n\nAlso sometimes your manager overrides your interview feedback and hires a guy even though you know he’s shit, and he shows up, underperforms, undermines, but you can’t get rid of because your organization doesn’t really do PiPs or layoffs. And the 20-80 rule is proven once again.\n\nHonestly the more I interview and give interviews it really doesn’t matter all that much since everything is so variable with the people and teams involved.  It’s truly just vibes based and we use leetcode cause it masks the arbitrariness.",
          "score": 6
        },
        {
          "body": "But there are actually alot of companies that don't do leetcode style interviews. Usually the ones that do those types are wanna-be FAANGS or they're just trying to get a body to fill a position. In which case they'll fulfiling the purpose which is faster process, and get a body, any body.",
          "score": 22
        }
      ]
    },
    {
      "title": "8 yoe with first job, just got laid off. Tips? Is there work out there?",
      "body": "Thanks for taking the time to read and respond.\n\nI was a full stack dev, focusing on .NET Core, C#, MSSQL, and Angular/React/Next. My official title was \"Senior Software Engineer\". Got laid off because my old company is probably going under in a few months.\n\nI feel so lost. I could use some tips on how to help land a job and stick out. I have 5-6 more months of emergency funds, but I would take a job tomorrow if offered.\n\nI am...\n\n1. Doing 2 -3 applications a day on LinkedIn\n2. Networking with old coworkers\n3. Reviewing common programming interview questions\n4. Reached out to a staffing recruiter\n5. Doing 3 - 4 problems a day on Hackerrank\n6. Responding to basically every mail I get on LinkedIn\n7. Keeping a publicly available \"passion project\"\n\nI have had 2 zoom interviews in two weeks. First was a horrible flop, taught me I couldn't rest on my experience, they were going to expect pop trivia answers. Other than those two, I am not hearing back from anywhere I apply.\n\nWith 8 years of experience, am I safe to be applying for Senior Software Engineer positions? Should I lower my expectations? Are there any other tips people on here can give someone at my stage?\n\nThank you for your time!\n\nEDIT: \n\nI just wanted to say thank you to everyone who has replied. I wish I could respond to each of you, I didn't expect the post the blow up this much while I slept. You all have made me feel a lot more confident.\n\nObviously my most actionable feedback is \"more applications\". I had gotten some bad advice that I should limit myself to 2 - 3 apps a day to \"avoid tangling my callbacks\", but obviously that is not the market we are in anymore, so thank you for that.\n\nI'll also keep grinding away at my interview game. I feel I am rather personable during interviews and not a machine, but I admit I am dusty on the usual interview questions. \n\nThere were also some good suggestions for learning and certs, I'll check those out.\n\nI also appreciate recommendations to specific companies, I'll be sure to check those out.\n\nHave a great day everyone!",
      "subreddit": "cscareerquestions",
      "score": 263,
      "url": "https://reddit.com/r/cscareerquestions/comments/14j83vv/8_yoe_with_first_job_just_got_laid_off_tips_is/",
      "comments": [
        {
          "body": "A recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface .\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n&amp;#x200B;\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of r/reddit.com, who are the admins of the site: message [/u/reddit](https://www.reddit.com/u/reddit/): submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on [r/reddit](https://www.reddit.com/r/reddit/), such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at [r/ModCoord](https://www.reddit.com/r/ModCoord/) \\- but please don't pester mods you *don't* know by simply spamming their modmail.\n3. **Boycott** ***and*** **spread the word...to Reddit's competition!** Stay off Reddit as much as you can, instead, take to your favorite *non*\\-Reddit platform of choice and make some noise in support! \n\nhttps://discord.gg/cscareerhub\n\nhttps://programming.dev\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "[deleted]",
          "score": 262
        },
        {
          "body": "[deleted]",
          "score": 55
        },
        {
          "body": "Ton of c# angular job out there. In fact there is a company near me that’s desperately looking for a super senior C# engineer to accept a junior-mid pay. The job description say ‘looking for an expert .net 4.7 engineer to come and build out the application and mentor everyone’ they got nobody that’s ab expert, they want an expert for cheap. Senior to staff for the price of a junior to mid. First 90 days is in office mandatory",
          "score": 90
        },
        {
          "body": "2-3 applications per day are rookie numbers. I pound through 10-15 minimum per day and I'm not even unemployed.",
          "score": 212
        }
      ]
    },
    {
      "title": "PSA: be aware of fake job scams",
      "body": "I just helped a friend identify that he was being recruited by a scammer. The way it went down was very similar to this article: https://www.howtogeek.com/410387/scam-alert-fake-job-recruiters-tried-to-catfish-us-here%E2%80%99s-what-happened/\n\nBasically they offered him a part time programming job that paid insane amounts of money. There was a fake interview process where they had him answer some behavioral type questions. There was no face to face meetings in person or over zoom. There was no technical interview. As part of the job he was going to get paid a good rate for \"training\" then would get his full rate a few days after that.\n\nThe scam came when he was told that he was going to be sent a company check that he could then use to pay for his company issued macbook and software. Never do this. Thankfully he felt like something was up and started asking people he knew before doing anything else.\n\nHe did send out his address, email and phone number. Hopefully this information won't be too bad...\n\nSome of the red flags to look for:\n1. a non cooperate email address (@gmail, @outlook, etc)\n2. urgency to finish everything quickly (Have you signed it yet?!)\n3. No in person meetings or video calls\n4. English is bad or off (not always bad, see below)\n\nThe article above recommends to report these scams to the FTC: https://reportfraud.ftc.gov/#/\n\nGood luck out there and stay vigilant!\n\nEdit:\nA note about #4 above. Many legit people have learned English as a second language. This may not alone be an indicator that there is a problem. However, many scams originate from non English speaking countries. Just because someone has bad English does not make it a scam, but be alert if things feel off or appear along with other red flags. If you feel funny about a job, its better to be safe about it.\n\nNever send money to anyone you don't know.",
      "subreddit": "cscareerquestions",
      "score": 723,
      "url": "https://reddit.com/r/cscareerquestions/comments/lrlw0b/psa_be_aware_of_fake_job_scams/",
      "comments": [
        {
          "body": "I just had this happen to me. The scammers posed as a reputable company. I talked to the hr department and someone on the team of the REAL company and they said to only trust the positions on their website. The scammers made a catfish burner linkedin of one of the team members and posted a fake job through linkedin. They sent an email under this fake name and username, so if you go search them in linkedin, you see a match with the REAL person, when two pages later, you'll see the fake account.\n\nThis email shuffled me along to someone else that was head of the recruiting department, also used a name and photo of someone who does in fact work in the very real company to seem legit. They had a fake hr specific email too. The process was the same above. \n\nIt sucks, I was so excited to get some kind of offer but they prey on that energy. I'm glad my girlfriend and I managed to uncover the scam before anything bad happened but 🤷\n\nBack to the job hunt",
          "score": 229
        },
        {
          "body": "&gt; The scam came when he was told that he was going to be sent a company check that he could then use to pay for his company issued macbook and software\n\nThe article you linked details some  scams that are not that common from my experience (trying to get your credentials to your phone provider account, etc.) The big one that is very common is the fake check scam: if an \"employer\" says they're sending you a physical check to buy equipment, it's 1000% a scam. They're exploiting a feature of US bank accounts where your bank will give you access to a portion of a deposit before the check has actually cleared. By the time you find out the check is fake, you've spent your own money--on a portal the employer sent you to, so basically sending them your money and/or you've sent some portion of it back to them for some reason that they explain--again, your money since the check will bounce.\n\n[Edit] I see questions about such scams on this sub maybe every few weeks",
          "score": 75
        },
        {
          "body": "#sent a company check  \n  \nThis is called [chargeback fraud.](https://chargebacks911.com/chargeback-fraud/)  \n  \n- Scammer sends you a fake check with real routing numbers from a big corporation.  \n- Check clears immediately  \n- The scam is where the scammer says he wants you to wire back him X amount.  \n- Company finds that this is a fake check and \"charges back\" your bank account  \n- When you try to charge back the wire, you learn that you can't charge back a wire.  \n- You are left with a negative balance. However much you gave the scammer.",
          "score": 71
        },
        {
          "body": "This happened to me, but i contacted the recruiter on LinkedIn. They confirmed the job was a scam and they  were being impersonated. But I ended up getting a job at the company anyway because I was interviewed for a second position the same week from a legit recruiter. \n\nIt was a weird situation, one fake, one legit, both same company",
          "score": 34
        },
        {
          "body": "Did a job hunt around the start of the pandemic in the USA. Job scams are awful and truly evil IMO. Taking advantage of someone in a vulnerable position. People really want a job (especially now) and they pose as a recruiting firm or something like that. Worst of all, I noticed they became more prevalent when covid started(I was browsing jobs before shit hit the fan). Only to be complete BS. It’s a huge waste of time for those who don’t know how to identify them. Seriously so f***ed up",
          "score": 23
        }
      ]
    },
    {
      "title": "What is the interview for BuildZoom like?",
      "body": "What were the difficulty of the coding problems in terms of Leetcode? What is the salary like?\n\nThis is for the SWE intern position.",
      "subreddit": "cscareerquestions",
      "score": 1,
      "url": "https://reddit.com/r/cscareerquestions/comments/61v2mu/what_is_the_interview_for_buildzoom_like/",
      "comments": []
    },
    {
      "title": "Dressing nice is important, at least in my case",
      "body": "I recently got offered a position as an associate software developer at big company.  I was interviewed by three people remotely, two of whom I've now met in person.  \n\nOne of the managers told me that a big part of the reason they hired me was because I was easy to talk to, and I seemed very willing to learn.  I did complete a coding challenge during the interview (it very easy), but it seems like a big reason they hired me was because of my personality.  \n\nThen, I met another one of the managers that was interviewing me and she mentioned that I got the \"best dressed award\" for my interview.  All I wore was a dress shirt, tie, and khakis... not even a suit, and she said I was the best dressed.  She told me a lot of people just showed up in shorts and a t-shirt for their zoom interviews and she liked that I dressed up.  I was surprised, I thought everyone dressed up for interviews, remote or not.  \n\nAnyways, I think dressing up gave me a slight upper hand against other applicants.  Also, dressing up gives me more confidence, which is great as well.  So yeah, dress up for your interviews.  At least wear a dress shirt and khakis, but a tie will take you to the next level.",
      "subreddit": "cscareerquestions",
      "score": 255,
      "url": "https://reddit.com/r/cscareerquestions/comments/x44nj1/dressing_nice_is_important_at_least_in_my_case/",
      "comments": [
        {
          "body": "How can you tell if someone wears shorts on a Zoom call? Do they ask you to stand up?",
          "score": 170
        },
        {
          "body": "[deleted]",
          "score": 113
        },
        {
          "body": "This really depends on the company/industry. I showed up to my first job with a tie and got laughed at (in a joking manner).",
          "score": 316
        },
        {
          "body": "A year or so into the pandemic, I interviewed a candidate in a tuxedo ...\n\n... t-shirt. Tuxedo t-shirt.\n\nI would have hired him, he interviewed well and I appreciated his lack of time wasted on unimportant details.\n\nI've also been interviewed by people in hoodies during the pandemic, including people at Microsoft.",
          "score": 55
        },
        {
          "body": "Pajama-wearing basement-dwellers who go into CS because they don’t want to adhere to social norms in shambles.",
          "score": 25
        }
      ]
    },
    {
      "title": "Does my wife have the job or not?",
      "body": "Hello all, my wife was recruited by a tech firm and went through two rounds of interviews plus a sit down zoom chat with the lead of a project. She received all good news saying she was a good fit for the project, but that they’re waiting for approval from the client to add a developer to the project. It took a week of waiting to get this response from them after she followed up too. \n\nIs this normal? I am wondering why the company would go through hiring and then request approval for bringing on a new dev? \n\nAre they stringing her along, should she look elsewhere?",
      "subreddit": "cscareerquestions",
      "score": 323,
      "url": "https://reddit.com/r/cscareerquestions/comments/vjb88q/does_my_wife_have_the_job_or_not/",
      "comments": [
        {
          "body": "you don't have the job until the ink has dried",
          "score": 1074
        },
        {
          "body": "Dude I’d always look until you have an offer. One company I went 5 rounds with over 5 weeks, ending with an interview with the CEO. They rejected me and I wasted all that time hoping on them and not applying to other companies during that time.",
          "score": 321
        },
        {
          "body": "So, what exactly is the downside of continuing to look while awaiting the final approval?",
          "score": 65
        },
        {
          "body": "If I had to guess, she's the 2nd choice and they're waiting to see if their 1st choice accepts the offer or not.",
          "score": 127
        },
        {
          "body": "it's hard to say. if the clientis a large company,  it might take that long to get budget approval.  also. the client maybe waiting on signatures.\n\nhowever,  this a flag I would keep an eye on. yes I would start looking elsewhere",
          "score": 30
        }
      ]
    },
    {
      "title": "Lead / Full stack engineer who's specialty disappeared twice, struggling to pivot",
      "body": "I'm a 35 yr old ex-FAANG full-stack engineer, with a 12-year old degree from a top school, and a solid career history. I can stand up an entire application stack, if I get to choose the technologies, and I do my best to make it concise, reliable, and well-documented. My work has always been thorough, and has been a contributing factor in an employer being acquired more than once.\n\nI am proficient in a variety of languages, and am capable of using several others with a little refresher. In no particular order, I have worked on or with:\n\n- Language bindings for C libraries, capable of cross-platform development\n- Built game, physics, graphics engines for desktop and mobile (lots of OpenGL and C)\n- Networking and video streaming for mobile apps\n- APIs and relational databases (server-side and client-side)\n- User login and account management systems\n- Purchasing and point-of-sale systems\n- Cryptography and security\n- Source-code management, code reviews, and automated pipelines\n\nI have achieved all of this in spite of difficulties with interacting in-person due to non-obvious speech and auditory processing disorders; I am not always capable of being immediately responsive, and my medication sometimes leaves me foggy on bad days. Nevertheless, I have excellent written communication and note-taking skills, and I have also developed considerable team leadership skills, if I have someone else to assist with the actual speaking for me. I am capable of sprint planning, distributing tasks, reviewing pull requests, and performing retrospectives to improve the process, and in general work well with a small team.\n\nUnfortunately, my specialty has died, twice. First, I used to build and optimize game engines from scratch, but that died when everyone started using Unity and Unreal. Then, I switched to native mobile app development, because the skills for a tight game engine transfer really well to developing tight mobile apps. That went great until everyone started switching to cross-platform middleware with a low emphasis on efficiency and optimization. Now, my specialty is dead for a second time, and I have had trouble navigating the industry ever since.\n\nWhen my last employer got bought by FAANG, they vanished my position after I finished delivering a software product more than 6 months ahead of schedule. They didn't fire me, my position simply stopped existing. I have since sent out 800+ resumes, over two years, and in that time I have received exactly thirteen responses. For twelve of them, I underwent 6-8 interviews plus multiple code tests, a process often taking up to 2 months - only to be rejected at the final moment. The most recent interview was an instant rejection, and the only feeling I had was that at least they were honest and didn't waste my time.\n\nUnfortunately, it is very clear that my communication disorders are a large factor in a company's willingness to hire me. Everything is based on verbal interviews over Zoom, where I have to constantly ask people to repeat themselves, or speak more clearly so that I can understand, or type things out in chat, and nobody has the patience for that. I can engage in and pass any relevant and well-thought-out engineering tests, but it doesn't matter if management is blatantly uninterested in any conversation that I may have to make - and they are often as rude as to pull out their phone or obviously be performing other tasks while I struggle to speak to them. Ultimately, someone high-up rejects me for 'culture fit' or some other corporate-approved euphimism.\n\nI have been unemployed for more than 2 years now, and I have no idea what to do about it. My doctor has urged me to prioritize finding a remote job that will accommodate my needs, but I haven't had any luck navigating this crazy maze of job application systems. I have tried applying to more junior positions with lower salaries, but get rejected outright because they assume I'll want a higher salary because of my experience. Appropriate positions reject me because I don't specialize in their niche tech stack even though I could learn it easily.\n\nWhat can I do? I can't pass a verbal interview to save my life. I've been trying to pivot to a new specialty, but I don't know where to find a company interested in an engineer like me, and LinkedIn and a dozen other job sites have been useless.\n\nI don't really care about the tech stack as long as it isn't atrocious, and I can help you fix it, if it is. I'm just looking for a small company that prioritizes results and isn't too picky about the stack, and doesn't mind mostly communicating through written means.\n\nSlow is smooth, and smooth is fast. I'm slow to talk to, but I write smooth code, and it makes things go fast. If you want to go fast, send me a message.\n\n---\n\nEDIT: Y'all have given me a lot of good feedback to think about, and I am already rewriting my resume a bit to take it into account. I've got to take a bit of a break from responding here, but I'll be back.",
      "subreddit": "cscareerquestions",
      "score": 182,
      "url": "https://reddit.com/r/cscareerquestions/comments/1bl3dgp/lead_full_stack_engineer_whos_specialty/",
      "comments": [
        {
          "body": "Have you thought of launching your own development firm? It sounds like your work speaks for itself. Selling is hard but a lot of it can be done via written text. Otherwise, there are companies out there that genuinely want to accommodate people. If you briefly mention your disorder early in the process, the right company will be understanding.",
          "score": 108
        },
        {
          "body": "I also have a mild speech impediment, stutter and delayed auditory processing, so I really understand your pain. On good days it's barely noticeable, but on bad days I actually have difficulty saying what I need to say. I have talked to my manager about this, and he understands that sometimes text communication is better for me (Slack). Depending on your jurisdiction, it may be more advantageous for you to claim disability and ask for reasonable accommodations for interviews.\n\nGood luck man.",
          "score": 46
        },
        {
          "body": "Kind of unrelated: Reading through your comments, I really appreciate how well you succinctly convey your thoughts through text, while still maintaining a distinctive tone. \n\nI believe your communication skills would be well sought after in an asynchronous work environment!",
          "score": 15
        },
        {
          "body": "I would break it down, it sounds like you're pretty specialized in low-level programming. Ideally I'd tailor your resume to that, and apply specifically to those jobs to increase your response rate (hardware, HFT, maybe compute teams?).   \n\n\nCompanies also seem to prefer flexible engineers who have extensive experience in slightly higher level full-stack work; working in C++, Java, GoLang etc. C++ Devs are pretty hard to find, I'd maybe have a resume version that tailors to those types of roles as well? Either way goal is to increase the response rate on your applications.   \n\n\nNext up, we need to weed out what's going on in your interviews. Maybe there's a workaround to your disability, asking to type out parts of your communication in a chat if you're stuck? Assuming that's the only issue.",
          "score": 13
        },
        {
          "body": "Large companies are very much interested in optimization, Meta has entire teams working on it and several of the most senior (director-level) ICs at the company work in this space.\n\nHFT firms are another thing that comes to mind.",
          "score": 25
        },
        {
          "body": "I've been seeing a lot of C/C++ jobs popping up for hardware driver development. I'd frankly love to do that stuff myself, but my C/C++ is comparatively pretty weak vs my web stack abilities. Might be worth a try.",
          "score": 10
        },
        {
          "body": "This is the best-written post on the sub in a long time.\n\nSince you are an exceptionally clear writer, as well as (by your account) an excellent developer, develop your brand by working online. Ways to do this:\n\n* Contribute to open-source projects in your area of interest and speciality.  (Pick one or two areas, not \"everything.\")\n\n* Tweet technical insights, about one or two specific technical areas. I'm not joking. This was recommended by Jeremy Howard.\n\n* Identify senior technical experts in your chosen field, and try to get to know them via written exchanges. *They* can get you past HR and the bureaucracy.\n\n* Join LinkedIn Groups in specific technical focus areas, and slowly become known as the expert, through your comments and your answers.\n\nWithin a matter of months, you'll be recognized. There's a desperate need for real technical experts. Make \"verbal impairment\" part of your brand, so that people will expect that up front. Hard-core tech companies (not B2C apps) care much more about what you can do.\n\nYou'll get bites. Not tomorrow, but soon. *Explain your disability up-front, in clearly written prose like you did for us*.\n\nGood luck!  (But I don't think you'll need it.)",
          "score": 9
        }
      ]
    },
    {
      "title": "I moved to a higher paying coastal job a year ago and today I lost my job. I think I made a mistake.",
      "body": "This morning I lost my job as a senior platform engineer at a California-based company. I live in a LCOL area in the US and the jump in pay was close to 30% of what I was making. I liked my previous job and I was only kind of looking when I got the offer but I saw this as an incredible opportunity for our family. I was excited and hopeful that this would be a way to help me grow as a devops engineer.\n\nFast-forward to today. I was sent a 1:1 meeting invitation for today with my manager last night. I thought that was odd because our 1:1s are usually on Thursdays. I had a feeling though this was not going to be good. When I opened Zoom and saw an unfamiliar face of an HR person there, my heart sank into my stomach. I was told I was terminated immediately.\n\nI knew this could have happened after about 6 months of being at the company.  I was not keeping up with the other seniors in terms of performance. It didn’t help that my former manager and some other senior team members quit about the same time 5 months ago. I then had no manager for a good three months.\n\nThe stack was more complex than I anticipated and the learning curve was basically a mountain. I basically bit off more than I could chew. Why wasn’t this sussed out during the interview process? I don’t know. I feel like a failure. I’ve been in devops for 6 years now. I’ve built out entire cloud systems and made Lambdas and step functions to automate all kinds of things before I got to this company but then it took me 4 dang months to get through one simple IC project I was responsible for related to gathering K8s observability metrics. I struggled with Pulumi and Typescript. I was constantly asking other people for help. It just fell apart.\n\nAnyway, let this be a lesson that even though there’s more green in remote work, the grass isn’t always greener.\n\nEDIT: I completely forgot to say that I was working as a remote employee and still living in the LCOL area. I know that makes a huge difference in terms of how this whole situation is perceived. We did just move to a nicer house and a nicer neighborhood. But it’s probably not as bad of a situation as someone who moves cross country for a job!",
      "subreddit": "cscareerquestions",
      "score": 324,
      "url": "https://reddit.com/r/cscareerquestions/comments/15fhy1g/i_moved_to_a_higher_paying_coastal_job_a_year_ago/",
      "comments": [
        {
          "body": "A recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface .\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n&amp;#x200B;\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of r/reddit.com, who are the admins of the site: message [/u/reddit](https://www.reddit.com/u/reddit/): submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on [r/reddit](https://www.reddit.com/r/reddit/), such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at [r/ModCoord](https://www.reddit.com/r/ModCoord/) \\- but please don't pester mods you *don't* know by simply spamming their modmail.\n3. **Boycott** ***and*** **spread the word...to Reddit's competition!** Stay off Reddit as much as you can, instead, take to your favorite *non*\\-Reddit platform of choice and make some noise in support! \n\nhttps://discord.gg/cscareerhub\n\nhttps://programming.dev\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Doesn’t sound like a year of higher salary and experience was a mistake. Don’t beat yourself up. It wasn’t a good fit, but you’ll find something else that is—with 6 years of devops experience, you’ll probably get more money too.",
          "score": 321
        },
        {
          "body": "That sucks. Maybe a positive note, but do you feel like you learned a lot in your time there?\n\nI hope you're able to find something soon. Don't beat yourself up too much. It can be good to take on challenges and stretch roles. That's one way of learning. And we all need to bounce back from our failures. It's a bit cliche, but it's the truth. \n\nGood luck.",
          "score": 72
        },
        {
          "body": "You didn't make a mistake.  You learned a lesson.  What the lesson is will be based on what you got out of your time at the company.\n\nWho knows.  The next opportunity you get could be the best thing that ever happened to your professional life.  Which you couldn't have got if you didn't move to your current location.\n\nAnd you couldn't have predicted that your entire team would leave one month into the job.  But you got some valuable experience on what warning signs to look for next time about the technical setup that gave you problems.\n\nLife humbles us all the time, that's nothing to be ashamed of.  Pick yourself back up (chastened) and get back into the ring!",
          "score": 47
        },
        {
          "body": "Sorry to hear, I hope everything works out for you!",
          "score": 92
        },
        {
          "body": "[deleted]",
          "score": 16
        }
      ]
    },
    {
      "title": "Got an \"offer\" from Adyen but this now seems absolutely fake. Can anyone help confirm?",
      "body": "  \nEdit: thanks, I felt like it was a scam more and more. I just want a fucking AI/ML job. So sick of this job search \n\n  \n\n\nI know Adyen has a better hold in EU that the US. I'm in the US now and I got messages for a remote AI Engineer offer. I replied that I wanted to continue. I then got sent a questionnaire to fill out after 180 minutes of receiving the email. Then I sent it back and this morning I received an email saying I was selected for the role.\n\n  \n\n\nBut to get automatically accepted puts me on the absolute edge. I can't exactly find an HR number from Adyen to contact to see if this recruiter is even real at this point. It seems fake at this point. I realize that more and more as I type this but now even I'm too curious to not contact someone from Adyen.\n\n  \n\n\nHas anyone who either works for or attempted an interview process with Adyen see their emails end with @adyencareers.com?\n\n  \n\n\nBelow is the received email. \"Dear Syntrikan,\n\n  \n\n\nWe are delighted to inform you that your experience and working skills have left a positive impression on us. It is with great pleasure that we offer you a position as a Full time Artificial Intelligence Engineer (REMOTE) with Adyen. We believe that your skills and creativity will make a significant contribution to the success of our organization.\n\n  \n\n\nYour daily tasks will be communicated to you via email, and we will be available to provide guidance and support throughout your training period. Upon setting up your workspace, you will undergo an online training program via Skype that will last between 3 to 5 days. This position is typically staffed during business hours (Monday through Friday, 9 a.m. to 5 p.m.), with some after-hours work for incident troubleshooting or project work. You will choose your own flexible schedule and work 30 to 40 hours each week.\n\n  \n\n\nYour starting rate will be $70.32 per hour, and your pay will be issued weekly through your preferred method of wire transfer, direct deposit, or check. Benefits attached to this position include Flexible work schedule, Short term disability insurance, Sixteen (16) days Paid Time Off, Life Insurance, Six (6) Paid Medical Leave, Retirement Accounts, Health Savings Accounts (HSAs), Vision insurance and 401k. plan.\n\n  \n\n\nDuring the first 5 days of your employment, we will conduct virtual communication with you. After this period, we will provide you with access to our company server with a username and password, along with contact phone numbers for various departments. We will also send you all necessary forms to fill out, and before you start, you will receive a check to purchase the office equipment and software required for your training and work.\n\n  \n\n\nOn the first day of your training, you'll be having a zoom meeting with the company CEO with senior officials and other team members you'll be working with. We will communicate with you via digital means till you have completed 5 days of work with us. Following that, you will be given a username and password, as well as access to the company server through the internet, a list of contact phone numbers for various departments, and all essential forms to complete.\n\n  \n\n\nYou will receive your Employment Offer Letter via email, and we look forward to commencing your training as soon as possible. To receive and register your offer letter, kindly provide us with the following information:\n\n  \n\n\nYour Full Name\n\n  \n\n\nFull Home Address\n\n  \n\n\nPhone Number\n\n  \n\n\nEmail\n\n  \n\n\nOnce again, we extend our congratulations on your new role. We are excited to work with you and anticipate great things from you.\n\n  \n\n\nSincerely, Adyen 167 N Green St Chicago, Illinois 60607 USA\"\n\n  \n\n\nYeah rereading this now makes it seem more fake.",
      "subreddit": "cscareerquestions",
      "score": 143,
      "url": "https://reddit.com/r/cscareerquestions/comments/1awde35/got_an_offer_from_adyen_but_this_now_seems/",
      "comments": [
        {
          "body": "[deleted]",
          "score": 254
        },
        {
          "body": "Yeah scam. The fake check will be in the mail soon after, followed by the request to send back X amount of the funds. Very common fake job scam. The majority of the time, it's the regular [fake check scam](https://consumer.ftc.gov/articles/how-spot-avoid-report-fake-check-scams).\n\nThese scammers use real company names, addresses, and employee names of the company website.",
          "score": 118
        },
        {
          "body": "The word “kindly” is almost always a sign that it was written by an Indian scammer. It’s a thing.",
          "score": 395
        },
        {
          "body": "It’s fake. No phone screen or nothing.",
          "score": 74
        },
        {
          "body": "Who uses Skype",
          "score": 35
        },
        {
          "body": "The scam is that they will make you buy equipment and software you need to start the job with your money from a specific store because the cheque they sent is delayed but on its way and you need to start working immediately.\n\nHave heard about this one before.",
          "score": 21
        }
      ]
    },
    {
      "title": "When they don't show up to the Zoom Interview.",
      "body": "Man. the absolute disrespect. \n\ni researched the company, got ready, ran the dogs this morning so they would be tired, had my questions all ready.  \n\nThis isnt a GREAT job, it is a lateral move for me, but my last employer went under and I am currently unemployed, so I am willing to take a transition job. \n\nBut to not show for the video, or send an email saying your running behind, or there was a scheduling issue?  So disrespectful. I am so pissed. I am even more pissed with the idea that I will do the rescheduled interview and take the job if only to reposition myself for a job that really suits me.  \n\nOof. I am so mad. As I go farther along in this time of unemployement it gets harder to be \"excited\" about a job.  it's fucking ridiculous.  i am so mad right now.  i am going to go clean something. \n\nI wonder if there is a scream into the void club i can join.",
      "subreddit": "jobs",
      "score": 414,
      "url": "https://reddit.com/r/jobs/comments/15xcfuj/when_they_dont_show_up_to_the_zoom_interview/",
      "comments": [
        {
          "body": "It happens and it sucks.  \n\n\nAll you can do is take a screenshot to show you were on time, contact them to see what happened.",
          "score": 89
        },
        {
          "body": "![gif](giphy|qLkmn46mxPgY0)\n\nCome here baby child.",
          "score": 84
        },
        {
          "body": "I had this happen once.  I spoke to the recruiter and we rescheduled.\n\nI got the job and it was a very cool place to work, and the person who missed the interview was a good boss.\n\nShake it off and reach out to them.",
          "score": 20
        },
        {
          "body": "I had an in person interview for a job at a hostess processing factory. Drove 45 minutes and went in and told them I was here, my appointment time came and went, and tried calling with no answer.",
          "score": 10
        },
        {
          "body": "I once experienced something a little bit different, left me a little disgusted.\n\nI got contacted by a recruiter for a company, that same day we scheduled a meeting with the hiring manager for the next day. I received the call and this person tells me that “they no longer had the position available after a discussion with the executive team”.\n\nDisgraceful",
          "score": 18
        },
        {
          "body": "I know i hada job interview today anf two of the three people interviewing me was late.  They actually had several fires to put out and i was asked if they minded if i waited.",
          "score": 9
        },
        {
          "body": "While it sucks, you now have leverage. If you appear gracious and understanding it could give you an advantage over other candidates.",
          "score": 7
        }
      ]
    },
    {
      "title": "Update: Got the interview invite… then got CC’d on the “he’s out” email. What would you do? Part 2.",
      "body": "Good afternoon, everyone!\n\nFirst off, a huge thank you for all the interest and advice on my previous post about the job application email. The comments were amazing – some serious, some hilariously funny, and some truly thought-provoking.\n\nI ended up going with a professional yet witty approach, aiming for a \"mic drop\" without burning any bridges.\n\nI sent the email out at 8 AM. I'm not really expecting a response, but I'll be watching to see if anything comes in. Unless I hear back, this will likely be the final update on this situation.\n\nI also wanted to give a quick shout-out to a few Redditors who helped me craft that email. Your input was invaluable!\n\n * [u/Academic_actuary_590]\n * [u/Snarkerson]\n * [u/blscratch]\n\nAnd so many others it’s hard to keep track. \n\nThanks again to this incredible community!\n",
      "subreddit": "jobs",
      "score": 44150,
      "url": "https://reddit.com/r/jobs/comments/1l7dk9g/update_got_the_interview_invite_then_got_ccd_on/",
      "comments": [
        {
          "body": "The madlad actually did it",
          "score": 7081
        },
        {
          "body": "Incredible👏🏼We must know if they respond",
          "score": 1957
        },
        {
          "body": "This is the update I needed. I need to know if there is a response.",
          "score": 686
        },
        {
          "body": "Love it!",
          "score": 401
        },
        {
          "body": "I imagine Marge’s blue hair turning white reading this as Mr. Burns gives her the side eye.",
          "score": 108
        }
      ]
    },
    {
      "title": "Got an interview invite… then got CC’d on the “he’s out” email. What would you do?",
      "body": "So I recently interviewed with a panel of four people at a county courthouse for an IT developer role. One guy couldn’t make it to the interview. A week later, I get an email from that same guy asking to schedule a Zoom meeting to get acquainted. Cool, right?\n\nWell… not for long.\n\nShortly after, another panelist replies to that email CC’ing everyone, including me — and says:\n\n“Bart is out. Lisa is not the authority on this matter. Cancel the request to Bart and apologize.”\n\n…and yes, Lisa is the one who actually seemed to like me during the interview. So I guess I got the boot and a live show of their messy internal drama.\n\nI knew some people in the panel had reservations, but this? Come on. If your team can’t even handle email coordination or basic professionalism in a hiring process — why would I want to work there?\n\nNot sure if I should hit them with a polite “thanks for the opportunity” or go full scorched earth and call it what it is. Thoughts",
      "subreddit": "jobs",
      "score": 13650,
      "url": "https://reddit.com/r/jobs/comments/1l4xcl7/got_an_interview_invite_then_got_ccd_on_the_hes/",
      "comments": [
        {
          "body": "Respond to everyone on the email and suggest you may be a good fit for the job of the person who cc’d you.",
          "score": 2695
        },
        {
          "body": "Respond and tell them your strongest trait is awareness and proofreading.",
          "score": 6497
        },
        {
          "body": "I would reply “I thought we all agreed Bart was in”",
          "score": 2967
        },
        {
          "body": "what do homer and marge think of all this?",
          "score": 1115
        },
        {
          "body": "Maybe ask, “So WHO said Bart is out? I’m confused.”",
          "score": 435
        }
      ]
    },
    {
      "title": "Was I wrong to leave the Zoom interview?",
      "body": "Today I was set up for a zoom interview for a project manager position. The pay was really good and I felt like I had a good shot at being hired. My interview was set for 11 AM. I showed up about five minutes early and I waited 20 minutes and the interviewer never showed so I left and sent a follow up email stating that no one showed up after 20 minutes and I had other obligations/ did not want to rush the interview. Did I do the right thing?",
      "subreddit": "jobs",
      "score": 1140,
      "url": "https://reddit.com/r/jobs/comments/wh3jnp/was_i_wrong_to_leave_the_zoom_interview/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "You did the right thing.\n\nJust a quick question and I am asking because this does happen a lot. Are you located in the same time zone as the company?",
          "score": 888
        },
        {
          "body": "I had something similar happen. I had a 3rd round interview on Zoom and sat there for about 20 minutes with my thumb up my ass waiting. Eventually left. Interviewer, who would have been one level above my manager, called me to reschedule an hour later. I went through the entire process but ultimately rejected their offer. Management just seemed completely unorganized and it just seemed like a red flag.",
          "score": 244
        },
        {
          "body": "Project managers need to be able to stay on schedule, be proactive,  make decisions, and communicate effectively. You demonstrated all of those qualities when you left.",
          "score": 93
        },
        {
          "body": "[deleted]",
          "score": 162
        }
      ]
    },
    {
      "title": "Applied for a job and the employer sent me a video of myself at 8 giving a testimonial about the company. What should I do?",
      "body": "I applied for a job at a local music school I remembered attending when I was younger, and the employer sent me a video of him giving a tour of the school and then a student testimonial to help me see if this job was a good fit for me. The funny thing is, this student testimonial was a video of 8 year old me and my mom giving out testimonial of our experience with the school. I don't remember taking the video, but it had our full names (or at least, the name I used to go by back then), so I don't know if the employer sent that knowing it was me or if it's a really funny coincidence. The email didn't mention it at all, it just said to watch the videos and then send my video audition for my instrument. Should I mention that that's me in the video?\n\nUpdate: I just finished the first interview. The employer actually recognized me! Not much to say now, I have a second interview scheduled for next week. I'm a little (very) nervous.\n\nI guess I feel like I did poorly. The interview only lasted around five minutes. It started 10 minutes late due to some confusion because my email automatically auto-filled my mom's name because she was still in the system from when I went there. I was stammering a lot and the only question he asked me was what I wanted to teach and then I was told to sign up for a second interview over zoom. I'm just so embarrassed right now.",
      "subreddit": "jobs",
      "score": 7968,
      "url": "https://reddit.com/r/jobs/comments/1o7u1kc/applied_for_a_job_and_the_employer_sent_me_a/",
      "comments": [
        {
          "body": "Lol! They probably don’t know it’s you, but it would make a great joke for you to use in the interview.",
          "score": 3048
        },
        {
          "body": "I'd definitely try to bring it up in a witty way. Imagine the recruitment video they could make now with both versions of you!",
          "score": 441
        },
        {
          "body": "I would definitely tell them you actually are the child in the video, maybe re-make the video of child-you.",
          "score": 367
        },
        {
          "body": "![gif](giphy|1201hONkUdpK36)",
          "score": 150
        },
        {
          "body": "Ask if they would hire that kid today. When they say yes, ask when you can start. ",
          "score": 231
        }
      ]
    },
    {
      "title": "Be warned... Covid-19 interview practices: it happened to me. They're recording Zoom interviews",
      "body": "As I said, I asked and they answered.  This was yesterday afternoon.  They seem to think recording these things \"for later review\" without a release form will somehow be helpful to their process. Be aware and stand up for yourself if you don't want your likeness and voice stored on a stranger's hard drive like you're auditioning for a part. If they email you questions beforehand, that may be a sign that this is what they're planning.  \n\nUpdate: I've since had another employer admit they were planning to record the interview and pass it around after I asked. edit: they're reluctantly going to interview me without recording but \"no promises' that everyone can make it lol.",
      "subreddit": "jobs",
      "score": 961,
      "url": "https://reddit.com/r/jobs/comments/jx0a6p/be_warned_covid19_interview_practices_it_happened/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "I don't know for sure but it sounds illegal to do without your consent or knowledge that a recording would be taking place.",
          "score": 545
        },
        {
          "body": "I was asked to take a screenshot of the candidate before the interview and when I informed the interviewee that I’d be taking one she immediately positioned the camera in such a way that only her chin was visible.\n\nDidn’t know where to go from there.",
          "score": 103
        },
        {
          "body": "Tell them that’s ok as you are recording it as well. I have a feeling employers will stop that practice real fast.",
          "score": 84
        }
      ]
    },
    {
      "title": "Stopped a zoom interview in the 3rd minute.",
      "body": "The woman was interviewing me via zoom and i could not take it. \n\n1- her camera was set up so that on the bottom half of my screen i saw only her eyes, forehead, and hair … and the rest of my screen was the ceiling of the room she was in. At home i assume. \n\n2- the questions she asked me were almost insultingly bad. “What parts of the job description are you most excited to do?”  \n\n3- her tone when asking these questions was so dry. She spoke to me as if I was an inconvenience to her day. It felt almost like she was being obnoxious. \n\n4- she never even said Hello. \n\n5- she never looked at the zoom screen. She was obv looking at a different screen. \n\nSo i interrupted her, told her i was cutting the interview short. That I didn’t feel good about the interview. She immediately sat up and looked right at the screen. Jaw dropped. I continued- “I appreciate your time, i really do. I am definitely not a fit for your company.”\n\nThe interview i had immediately before this one was great. But again w the misleading pay in the ad.",
      "subreddit": "jobs",
      "score": 1173,
      "url": "https://reddit.com/r/jobs/comments/pyab3q/stopped_a_zoom_interview_in_the_3rd_minute/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "There are several interviews where I wish I’d just ended them early. I admire your directness.",
          "score": 747
        },
        {
          "body": "Nice work!  I tell everyone I interview to remember that it’s a two-way thing we’re doing.  I need to make sure that they are a good candidate for the job, but it’s just as important for them to leave the interview knowing we are a good fit for them as well.\nI’d have been frustrated too.  She is that face of the company at that point and she showed that they don’t value your time",
          "score": 98
        },
        {
          "body": "you're ballsy af",
          "score": 205
        },
        {
          "body": "I am so proud of you. Not everyone has the confidence to do such a thing, and I’m so glad you do.\n\nI recently cut an interview short (about five minutes in), when the hiring manager on the other end made it extremely clear the job description had been inaccurate/misleading and I’d just be answering phones as a CSR all day (JD said it was an IT *chat* position). \n\nAnother time (the same week), I made it 45 minutes into the interview only for the hiring manager to tell me, “your resume says you expect $XX-XX/hourly, and while our range is $XX-XX, I’m only prepared to offer you $X.” (Yes, she literally offered me $9/hour for a job advertised as paying $20-25+/hr.) I asked her why, and she said, “while your experience and education are admirable, and you’re an obvious leader, I feel that since that leadership hasn’t been displayed in this field it warrants a lower starting wage.” (The position was QA for a health insurance provider, which I’ve done before.) I tried to stifle my laughter when saying, “thanks for the honesty, but I am not a good fit for your company, good luck!” She tried to talk me into reconsidering and I told her I already had two offers on the table and simply wanted to see if this company could offer more, and they obviously couldn’t. She asked why I had wasted *her* time, as if offering less than half of the advertised pay at the end of an interview wasn’t a clear waste of *mine.* I sent an email to her director. \n\nTo level it all out, though, another interviewer that week told me within the first five minutes that she couldn’t offer more than $13/hour, and she felt I deserved much more and suggested I go find a position somewhere deserving of my experience. I appreciated her. \n\nI went from getting zero interest for six months to scheduling five back to back interviews over the course of three days, and wound up with three offers to choose from. It was wild.",
          "score": 137
        },
        {
          "body": "Great job mate! Always stand up for yourself and what you belive in! However, the next time this happens please don't say \"I am not a good fit for your company...\". Rather go with your company isn't a good fit for me! Hold yourself above them and show them that! Good luck",
          "score": 44
        },
        {
          "body": "Yes, I did this with two interviews so far:\n\n1. The interviewer kept correcting me on questions she didn’t like my answers too like it was a test.🤣. I asked are you going to be my supervisor?  When she said yes, I said no thanks.  This was for a local major hospital’s IT department not remote.\n\n2. The interviewer didn’t have any answers to the most basic questions why is this position vacant?  What’s the typical turn around time for someone in this position?  What qualities did the last person have that was a bad fit for this position and so forth.  Also, their caller ID said NJ, but the accent was so thick I’m sure it was from another country.  Not that there’s anything wrong with that, I just prefer that they be upfront with me.  It was a remote tech position for Anker.  From the Indeed &amp; Glassdoor reviews, I probably wasn’t going to take the job anyways.",
          "score": 22
        }
      ]
    },
    {
      "title": "Stupid ZOOM interviews",
      "body": "First of all I just want to rant how much I hate zoom interviews . I hate hate hate them . They’re so awkward!!! \n\nToday I got another zoom interview 😏 I was interviewed with 2 ladies . They never show their faces . I was the only one sharing my face . I thought that was rude and weird . Why waste my time ? Why not just do a phone interview instead of wasting my time trying to logged in and get my shirt and tie . Ugh I’m sick of all this job hunting. I’m taking a break from searching for jobs .",
      "subreddit": "jobs",
      "score": 797,
      "url": "https://reddit.com/r/jobs/comments/icc30z/stupid_zoom_interviews/",
      "comments": [
        {
          "body": "And if you haven't had a HireVue interview yet, you haven't lived.  Its even worse.  ; p",
          "score": 351
        },
        {
          "body": "All the better to see &amp; judge you with, my child.",
          "score": 84
        }
      ]
    },
    {
      "title": "My interviewer is 1 hour late. Should I just leave?",
      "body": "I have a job interview and arrived on time. His staff told me he is running late, so I have been sitting alone in a back room for an hour. \n\nShould I stay, try to reschedule, or just leave? Because this feels very unprofessional.\n\nI’m 22, haven’t had many interviews before. Is this normal?\n\n\nUpdate: just had the interview, this guy doesn’t apologize for being late, just tells me “thanks for waiting”. \n\nHe didn’t mention a single thing about the job, my pay, or even what I’d be doing. Then offers me the job immediately. I said no and left.\n\n\n\nEdit: Wow this blew up like crazy! I see a lot of questions so I’ll try to answer some here. \n\nPrior to this interview I had a zoom one with two ladies. They were both professional and respectful, which is the main reason I waited so long for this one. \n\nI was already skeptical waiting, but decided to stick it through because I had already spent like 40 mins sitting there. After I met the guy, I immediately knew I didn’t want to work for him. That’s why I didn’t ask any questions about pay, hours, etc. \n\nThe interview in total lasted maybe 10 mins. He asked for my availability, and the basic “what are your skills, how can they apply here” type of questions. But that was really it, nothing about the actual job, pay, or what I’d be doing. He asked if I had any questions to which I said no. Then said they are looking to hire immediately and asked if I wanted the job.",
      "subreddit": "jobs",
      "score": 7030,
      "url": "https://reddit.com/r/jobs/comments/13ww59x/my_interviewer_is_1_hour_late_should_i_just_leave/",
      "comments": [
        {
          "body": "One of two possibilities. Either he’s so disorganized that he’s legitimately an hour late (or not showing up) to an interview, or he’s one of those managers who “test” you by making you wait. Either way, it’ll be a nightmare to work for this person.",
          "score": 2634
        },
        {
          "body": "Imagine if you were late on your first day.",
          "score": 497
        },
        {
          "body": "Good for you for saying no and leaving.",
          "score": 531
        },
        {
          "body": "You did the right thing. \n\nNever take a job you’re offered on the spot. It’s a sign of desperation and toxic work places. \nEverything else that happened during and before is just feeding into that",
          "score": 280
        }
      ]
    },
    {
      "title": "Just got my first 6 figure job offer! Just wanted to share with someone",
      "body": "Hi everyone! I don't have too many people I can talk about this with, so I just wanted to share the news with someone. I work in software, and my current pay is $75k per year. The short version of my past few years is that I dropped out of college and have been making $45k/ year for a while pre-COVID. From there, 2020 hit me really hard. I was unemployed for about 6 months. I was looking for $18/hour jobs, then I got an opportunity in software sales. I started at a base salary of $50k per year. I got promoted once and then moved over to operations within my company, and my salary went up to $75k (where it is now).\n\n&amp;#x200B;\n\nHaving been at my current company for 3 years, I've known that I was underpaid compared to the market for a while, so I started looking a few months ago. I applied to this job that's a manager-level position, which is one level above my current role. I had my final round interview at this company last week and it went pretty well. \n\n&amp;#x200B;\n\nThe hiring manager set some time with me yesterday afternoon. When we hopped on the call, we talked for a few minutes before she offered me the job! $120k per year! In the moment, I didn't react much outwardly or inwardly beyond being pleasant and expressing thankfulness and excitement about the offer. I was trying to keep my hand close to my vest I suppose. I ended up thanking her and agreeing to follow up on Monday after I had the weekend to think about it (as I was in the process of a few other interviews as well). \n\n&amp;#x200B;\n\nFor the hour after we hopped off Zoom, I didn't feel much. Then the offer letter hit my inbox. Seeing $120,000 in black and white is when it hit me. $10,000/month. I broke down and started crying. That's more money than I've ever made before by a long shot. I wanted to call my dad and tell him because I know that he'd be proud. He died in 2020, so I got hit with a wave of emotions from excitement to relief, to grief hitting me super hard. I've had a lot of money stress over the past few years, and this feels like a game changer. I'm hoping that this will accelerate my ability to build up savings and I want to be smart with it.\n\n&amp;#x200B;\n\nAnyway, that's my ramble. Thanks for listening. Today I'm excited and am looking forward to accepting on Monday. I still wish I could call my dad up and tell him though; I know he'd be happy.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nEdit: wow, I appreciate all the love! The positivity is really great to see.",
      "subreddit": "jobs",
      "score": 6104,
      "url": "https://reddit.com/r/jobs/comments/14u8dad/just_got_my_first_6_figure_job_offer_just_wanted/",
      "comments": [
        {
          "body": "Congratulations dude!  Pops is smiling down on you my friend.  Proud of you bud!",
          "score": 435
        },
        {
          "body": "Awesome. You're getting to a point where even a 3% annual raise means a good jump in income. At 120k, 3% is $300/m. Almost a full car bill.",
          "score": 211
        },
        {
          "body": "So let me get this straight- you have worked bottom up, staying at the same company for three years while knowing you were under paid, not letting Covid or lack of degree keep you from knowing your worth, and you are now finally in the career of your dreams?????\n\nDude. You are my hero. \nI am proud of you for seeing a goal and reaching it, and you did it without a college degree and without any help. You are amazing! 🙌💪🔥",
          "score": 72
        },
        {
          "body": "That’s fantastic!! Congratulations. 😊",
          "score": 36
        },
        {
          "body": "Good for you. I was happy when I broke the 40k barrier. I’d love to make 100k one day.",
          "score": 30
        }
      ]
    },
    {
      "title": "Pretty pissed and wanted to vent about a zoom interview ",
      "body": "I scheduled a phone interview for today and I was sent a zoom invitation that had the time set as 10am. I login in to the meeting at 9:55 and wait.  No one logs in and at 10:30 I drop off the call and send an email to the person I was scheduled to talk to.  They email me back 3 hours later and say that the meeting was scheduled for 10am daylight savings time and I missed the interview. \n\nFirst off the interviewer is in the same state as me and we are not currently in daylight savings time, why the hell would you schedule it that way without disclosing that anywhere.  \n\nSecond the meeting invite I was sent in the email showed on my calendar as 10 am standard time and the scheduling software I used for them doesn’t specify anything but time zone.\n\nThird, I emailed you 30 minutes before they thought the interview was so why are they not taking responsibility for the software they chose to use causing unnecessary confusion? \n\nI’m really pissed and tempted to call the main office about their unprofessional interview scheduling process.  Is this a bad idea or should I do it to call someone out about it? \n",
      "subreddit": "jobs",
      "score": 244,
      "url": "https://reddit.com/r/jobs/comments/1b3d5li/pretty_pissed_and_wanted_to_vent_about_a_zoom/",
      "comments": [
        {
          "body": "don't forget to rate the company on Glassdoor :)",
          "score": 221
        },
        {
          "body": "This sucks and is super frustrating. Someone there messed up and is trying to pin it on you with the daylight savings time nonsense. However, you really will gain nothing from calling to complain—it will just make you look unhinged since you’re not entitled to an interview. If you’ve already explained the confusion to them in an email and they’re not relenting, then that’s all she wrote. If not, you can write a polite email expressing that you’re sorry you missed the interview and that so-and-so told you on the phone that it was scheduled for 10 AM DST, and that you didn’t realize this since DST doesn’t start until March 10 this year. Try to be matter of fact in your email and act like this is not absurd. It might help them realize you’re not actually a no-show.",
          "score": 62
        },
        {
          "body": "That response makes no sense. Daylight savings kicks in, in the middle of the night, and almost all electronics update this. If they meant a different time ZONE- why? Maybe some of the interviewers are in a different zone but your computer would have made the adjustment.\n\nI had a recent interview that they sent through teams with a zoom address- then logged in through teams, which made me late, and them cranky- until another interviewer came even later and loudly complained about the change they made. They were also clearly interviewing while setting up for the office holiday party.",
          "score": 40
        },
        {
          "body": "Name and shame them on Indeed and Glassdoor and everywhere else on the net and cost them potential hires. If enough people start badmouthing them, they're going to have an awful time trying to fill positions.",
          "score": 23
        },
        {
          "body": "I understand you need a job and you’re frustrated, but you’re wasting your energy. This place is obviously a shit show if they can’t even schedule an interview correctly. Why would you want to work there? Just move on.",
          "score": 17
        },
        {
          "body": "i always reply (even when i get a calendar invite) to the recruiter and confirm:\n\n* time with time zone\n* type of interview (phone, video, in-person)\n* topics (if any)\n* who i am meeting with\n\nupdate/edit: a sample response\n\n***\"i am sending you this email to confirm that i responded to and accepted your invite for the scheduled the interview on friday, april 19th at 4 pm eastern dst (1 pm pacific dst), via zoom with \"mr. joe reddit\" for the position of executive viceroy.\" \"thank you for the opportunity to interview for the position.\" \"if you need any additional information, do not hesitate to contact me.\"***\n\ni let the recruiter know:\n\n* saying that i confirm the appointment\n* how i am responding (email)\n* let them know that i responded to their invite (not just verbally saying)\n* i accepted their invite, so they should see acceptance\n* the month, day of the week, and date (incase they looked at the wrong month)\n* time, am/pm, time zone (i am in), dst/st, and their time (if i know they are in a different time zone)\n* how the the interview will be conducted (phone, video, in-person) and specify the video service (zoom, teams, etc.), address if in-person\n* who i am meeting with\n* position i an interviewing for\n* i thank them for the opportunity. \n* tell them if anything else needed/missing, contact me. this way they can't say something like \"you never submitted your transcript...\"",
          "score": 9
        },
        {
          "body": "There was no issue with the time zone nor confusion with daylight savings. Someone made a mistake and they’re trying to blame you.",
          "score": 9
        }
      ]
    },
    {
      "title": "Zoom Interview Background Advice",
      "body": "I’ve got a big interview tomorrow that will hopefully lead to a job offer. This is in a corner of my studio where I have my desktop computer set up in a little office. Would this bookshelf be an inappropriate background? Should I remove the lego sets and leave the books? ",
      "subreddit": "jobs",
      "score": 61,
      "url": "https://reddit.com/r/jobs/comments/1dcefiu/zoom_interview_background_advice/",
      "comments": [
        {
          "body": "Depending on the company, it may or may not be appropriate. It wouldn’t bother me. 😊 \n\nYou can make the background blurry in Zoom, if you want to. \n\nGood luck for the interview! 🙏🏼🍀",
          "score": 63
        },
        {
          "body": "Depends on the job, if it’s a friendly work environment, showing off your legos shows off your personality.",
          "score": 75
        },
        {
          "body": "I’d at least remove the Kama sutra book. I kid! But if it would at all be a thing to consider is to organize the 2nd left shelf from tallest to shortest. Or if you could group like colors together just for the visual, that would be cool. Not a big deal tho",
          "score": 19
        },
        {
          "body": "None of it is inappropriate id have a hard time seeing a job not hiring you because they thought the cars on your shelf was childish or something of that nature",
          "score": 22
        },
        {
          "body": "Put a dildo up on the top shelf, they'll remember you 😂",
          "score": 13
        },
        {
          "body": "Need more leatherbound books and some mahogany. A bottle of scotchy scotch scotch may be necessary as well. Be sure to mention your gullet at least once. and end your interviews with \"go fuck yourself, San Diego\"",
          "score": 3
        },
        {
          "body": "You know you can use a virtual background right...?\n\nJust use one of those.  You interviewer(s) should be used to the available default options by now.",
          "score": 13
        }
      ]
    },
    {
      "title": "Got an interview with a county wide agency in a different state and the interview is in person, I sent them an email asking for a zoom meeting, could this hurt my chances?",
      "body": "I got an email saying I was moving forward with the interview, but it is in person. My wife and I are planning on move to the area regardless to help take care of my elderly grandmother. My cousin offered to help pay for a flight for the interview but money is tight.\n\nI put in my cover letter and resume that I am planning on relocating to the area. I sent an email explaining my situation and I'm wondering if it was the wrong move and I should've just scheduled the interview and fly in. Anybody else run into this situation?",
      "subreddit": "jobs",
      "score": 0,
      "url": "https://reddit.com/r/jobs/comments/1q24lq4/got_an_interview_with_a_county_wide_agency_in_a/",
      "comments": [
        {
          "body": "It's not the wrong move, per se, but you will probably be at a slight disadvantage to everyone who shows up in person, unless you are noticeably better than other candidates.",
          "score": 3
        },
        {
          "body": "Last time I was invited to an in-person that was a long way away I just reminded them where I was, and to confirm travel expenses would be available. They switched it to Zoom, and then when I moved onto the next stage they paid my travel and hotel to actually meet them.",
          "score": 2
        }
      ]
    },
    {
      "title": "Salary decreased post-offer",
      "body": "I’m floored, y’all. I applied to a staff position with a university. One zoom interview led to one 3 hour long in-person interview. While in the interview, I asked the director what the salary for the role would be. She told me “The salary is set for $56k.” \n\nFast forward 2 weeks to today. I get a call and am offered the job. Yay! But then the HR rep says, “The salary is set at $42k.” \n\nI pause her and say, I was told the salary would be 56k. She tells me that they ran me through their “experience calculator” and found that my experience puts my max salary at $42k. \n\nI have a masters degree and 3 years of relevant experience.\n\nI ask if this is negotiable. Nope. I tell them I’m sorry, but an experience calculator was never mentioned in my interview, and I was led to believe that $56k was the starting salary and that I would accept no less. She said they “probably won’t budge,” but that she’ll relay that info to the director. \n\nAm I crazy, or is this ridiculous?? Has anyone had something similar happen to them??\n\nUPDATE: The university has reposted the job opening, so I guess their other candidate also didn’t accept their bullshit offer.",
      "subreddit": "jobs",
      "score": 2607,
      "url": "https://reddit.com/r/jobs/comments/yaae1v/salary_decreased_postoffer/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs!\n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "You are right and you handled it the proper way.",
          "score": 2235
        },
        {
          "body": "Honestly hilarious they thought you would take a job for *14k* less than advertised!",
          "score": 401
        },
        {
          "body": "Thank you for standing up for yourself and what's right. It helps all workers",
          "score": 682
        },
        {
          "body": "That’s fucking ridiculous",
          "score": 288
        },
        {
          "body": "I’ve had companies offer a little less than they verbally offered. But never had them come back with 82% of the original offer. That’s insultingly low",
          "score": 122
        },
        {
          "body": "So they're fully confident you can do the job, and were prepared to pay $56k, but now, for \"reasons\", they want to pay you much less? Yes, that's ridiculous. Even if they were to agree to pay you the $56k, I'd still turn it down.",
          "score": 186
        }
      ]
    },
    {
      "title": "My new boss that I’ve never met asked me to come to their home. Is this normal or should I be concerned?",
      "body": "Hi all! I (26F) recently accepted a remote job after two rounds of interviews. The job seems to be with a legitimate company and the owners I met over zoom match up to the website but after accepting the job I was never sent anything to sign. They haven’t done any background checks or even asked for my full name or date of birth. It is a small business so maybe that’s not odd and it just slipped their minds? The part that made me a bit uneasy is that during the interview process the owners stated the position would be fully remote and there was no mention of travel even for training. Now that I’m “hired”(in quotes because there’s no proof and I haven’t signed anything) they’ve asked me to travel about an hour and a half to one of the owners homes for training. I thought this was odd because although the company operates remotely I’d think they’d at least want to meet somewhere public because we’re all essentially strangers at this point. I was trying not to overthink it but after telling some family members about this (who owned their own business in the past) they expressed that this isn’t normal and I need to be careful walking into someone’s home who I don’t know. I tried to communicate my apprehension with the owner and they stressed that going to their house was extremely important in the training process. Can anyone offer any insight? Am I thinking too much into this? Thanks in advance!\n\nEditing for more context so no one thinks I’m a clueless moron- this job is in a very niche industry that I’m extremely qualified in. I did criminal searches for the names of the owners through the state they reside in and searched for home addresses to no avail. I thought this was strange also and wanted to confirm my suspicions.\n\nEDIT AGAIN SO EVERYONE WILL STOP INSULTING MY INTELLIGENCE- I AM NOT GOING! I POSTED THIS TO CONFIRM MY SUSPICIONS THAT THIS ISN’T NORMAL AND WILL BE SAYING NO AND EXPRESSING THAT THIS SITUATION HAS MADE ME FEEL EXTREMELY UNEASY. THANK YOU FOR EVERYONES INPUT.",
      "subreddit": "jobs",
      "score": 1818,
      "url": "https://reddit.com/r/jobs/comments/15buk45/my_new_boss_that_ive_never_met_asked_me_to_come/",
      "comments": [
        {
          "body": "“Hi new boss. Thank you for the invitation, but I am concerned we don’t have any formal employment agreement, outlining expectations, hours, accommodations, benefits, etc. I am excited about this opportunity and look forward to a healthy and productive, working relationship with your organization, so I would like to request all the above note details in writing ahead of me traveling for training.”\n\nAny legitimate organization is gonna respond and agree with your request 100%. If they don’t, you have your answer and you should run the other direction.",
          "score": 246
        },
        {
          "body": "This sounds shady and I would abort mission ASAP if I were you.",
          "score": 916
        },
        {
          "body": "Can you meet at a coffee shop or libraries let you book rooms for free too",
          "score": 122
        },
        {
          "body": "No job requires this. None at all. I wouldn’t entertain this.",
          "score": 232
        },
        {
          "body": "[removed]",
          "score": 102
        },
        {
          "body": "If they did not ask you for you ssn#, how are they going to take taxes out of your paycheck and give the money to the government? Also, how will the government know how much money you made and how much social security you will get when you retire?\n\nThis is a total scam. Run. Run very fast 6ans don't look back!",
          "score": 29
        },
        {
          "body": "No paperwork = no hire. This is nothing but a giant red flag.  You might either end up working for the cartel or kidnapped.",
          "score": 80
        },
        {
          "body": "Post this over in /r/scams to see which scam this is. It sounds scammy.",
          "score": 43
        },
        {
          "body": "This isn’t a real job. I don’t know what they’re doing, but it’s not a real company if they didn’t have you sign any sort of paperwork to get hired. If they don’t have a employment agreement of some sort, they have no obligation to pay you, so even if it IS a legitimate job they may be trying to get work out of you without paying - which they easily can get away with with no contract.",
          "score": 24
        }
      ]
    },
    {
      "title": "Just did a zoom interview for my dream job",
      "body": "I'm freaking out, I just finished my interview and I think it went super well! They seemed to really like me and we interacted well and I answered all the questions confidently! I was told the hr woman I spoke to would get back to me some time this week!!! Fingers crossed :D I really just wanted to share this with someone!!\n\nEdit: Just a quick edit incase anyone was wondering but I got a job offer!!!!!!!!",
      "subreddit": "jobs",
      "score": 395,
      "url": "https://reddit.com/r/jobs/comments/js00o6/just_did_a_zoom_interview_for_my_dream_job/",
      "comments": [
        {
          "body": "Hello, thank you for posting to r/Jobs! \n\nWe just wanted to let you know that we have a new [discord server, come join the chat!](https://discord.gg/TY6ErXV)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/jobs) if you have any questions or concerns.*",
          "score": 1
        },
        {
          "body": "Like a couple of others have said, don't get your hopes up. Act mentally as if you won't get it and keep looking and applying. This way, you won't be as gutted if you don't get it but it'll feel even sweeter if you do get it.\n\nI recently got a job offer for my dream job over Teams which I thought I bombed the interview in, but got asked for a second interview and then an offer.\n\nI also had an interview which I worked for hours on an assignment for them and thought I had got it but got told it was \"too senior\" for me. \n\nYou really never know until they get back to you.",
          "score": 150
        },
        {
          "body": "[deleted]",
          "score": 37
        },
        {
          "body": "Congratulations... U won the battle, but the war is still on \n\nNothing is finalized until U have that confirmed offer letter.. Until then, keep looking🧐🧐",
          "score": 18
        },
        {
          "body": "GLuck",
          "score": 9
        },
        {
          "body": "dont get your hopes up. keep looking",
          "score": 40
        }
      ]
    },
    {
      "title": "Phone or zoom interview?",
      "body": "For my next interview, I was given the option of either a phone or a zoom interview.\nFrom the employers perspective, is zoom better? \nI personally hate them, but if it means getting a job I’m willing to make the sacrifice ",
      "subreddit": "jobs",
      "score": 2,
      "url": "https://reddit.com/r/jobs/comments/1o6tidh/phone_or_zoom_interview/",
      "comments": []
    },
    {
      "title": "Email and Repeated calls from Agon Inc. for a  Zoom interview for a Sales Manager role even though I’ve never applied to this company nor for this role.",
      "body": "Mainly just curious why they are asking for an interview for a sales manager role and why they repeatedly called me within an hour. \n\nAre they desperate or is this a tactic? I’ve never applied for that role nor I don’t remember applying to this company. Did they like what I had on my resume from a sales perspective which is available on my Indeed/Linkedin. I am only looking for IT or Cybersecutity jobs. I do have retail experience so maybe that’s why? Is this all simply just a scam? Regardless, I am not replying since I am not even interested in the role.\n\nAny info is appreciated!",
      "subreddit": "jobs",
      "score": 4,
      "url": "https://reddit.com/r/jobs/comments/1mqhjcp/email_and_repeated_calls_from_agon_inc_for_a_zoom/",
      "comments": [
        {
          "body": "Ive been getting calls from them same number as well but for an account management position, ive only worked as an process assistant in amazon that does not involve anything in account management.. please update if you find out any more info!",
          "score": 1
        },
        {
          "body": "Don't put too much stock on the number being displayed. This can be spoofed to show any number. This display number doesn't have to match the number they actually called you from. You want real ways to verify that the caller is who they say they are. Agon not only could be a scam, it could also be a legit company but the caller is impersonating them.\n\nGenerally, if you didn't receive an invite to interview on a platform beforehand, meaning this call is totally unexpected, it's 90% a scam.\n\nEmail isn't a \"platform\". Because this 3rd party didn't have to verify themselves to the email provider.\n\nIf you are curious just in case this is a real opportunity, then I would google this company, go to the website listed on their Google maps address, find their contact # on their official site, then call that number and ask if this position exists. \nAt least this way if you still got scammed it means google has their registration info and you have a path of recourse with the police.",
          "score": 1
        }
      ]
    },
    {
      "title": "Interview question I didn’t care for",
      "body": "I had a zoom interview with five people, and I could tell they were a friendly group. The interview questions were old school basic questions so I was prepared with answers. One question I feel is outdated which is where do you see yourself in five years. I understand the intent but I didn't see Covid coming five years ago so...\n\nBut that's a typical question. The one I didn't like was - What makes you a better candidate than other people we are interviewing? I was taken aback because how do I know what other people are bringing to the table? If you asked me why am I a better candidate than Mary, I can tell you the differences between us. I just mumbled something about not knowing because maybe the other candidates are great too. Not my finest moment, but it's a dumb question imo. Luckily, it wasn't a big deal because I have an in person interview tomorrow. ",
      "subreddit": "interviews",
      "score": 1005,
      "url": "https://reddit.com/r/interviews/comments/1l8fcpa/interview_question_i_didnt_care_for/",
      "comments": [
        {
          "body": "When I was asked that, I said: “To be fair, I can’t say I am better than Anyone. I can tell you how I can deliver what the company needs. I can’t tell you about someone’s traits or personality. I can tell you about mine”. \n\nAnd then I gave some examples of myself. It was weird.\n\nI did not get the offer.",
          "score": 330
        },
        {
          "body": "If you are ever asked that question again think of it more along the lines of \"what can you uniquely bring to the role?\"  Granted you don't know the other candidates, so you cannot be 100% sure, but you do know what about yourself you can bring to the role that is beyond what would be considered the minimum or standard for the role.",
          "score": 87
        },
        {
          "body": "Don’t get too cute. Expect this question and tell them it’s because you have superpowers.",
          "score": 38
        },
        {
          "body": "Been there. Got asked that too and just said, “I can’t speak for others, but here’s what I bring.” Felt way more honest and grounded. Good luck tomorrow!",
          "score": 39
        },
        {
          "body": "Retired corporate recruiter here.\n\nI agree -- those are ridiculous questions, and for the very same reasons you mentioned. I was asked that same \"what makes you better\" question in an interview years ago, and by a company's talent acquisition manager. You'd think someone in that position would know why it was a silly thing to ask, but not this one. My answer was along the lines of \"I can't say, since I know nothing about the other people you're interviewing\". That's true, but it also highlights to the interviewer how ridiculous their question was.\n\nI didn't get an offer, either, but no loss.",
          "score": 43
        },
        {
          "body": "\"Where do you see yourself in five years?\" isn't asking you to predict the future. It's asking you to establish yourself as a person with goals for personal and career development that align with the company's paths for progression or demonstrate that you'll be trying to learn and grow while working with them. \n\nLikewise, \"what makes you a better candidate than the other people we're interviewing\", aka the better-phrased \"what makes you the best candidate for this position?\" isn't asking you to be psychic and break down the weaknesses of the other people they're considering for this position -- although I just got a great idea for a screenplay. Even if you did have the other candidates' CVs in front of you, you'd struggle to use that information to formulate a great answer to this question. \n\nThat's because it's *really* asking you to lay out the qualities that make you unique or rare in your field that will be beneficial to you in the role. Maybe you have an interesting personal experience that gives you insight into a specific part of the job description, or you have an uncommon but useful (and at least slightly relevant) skill, like a second language or being a world-ranked sudoku solver. If you can link it back to the job description or a quality mentioned on the person specification, it's something you can use to answer this question. \n\nIf you get really unlucky, you could end up bragging about how your summer as the escaped-animal wrangler at your local petting zoo prepared you to be great at problem solving and thinking on your feet, only to learn afterwards that Mary was the escaped-animal wrangler at the real zoo for a year and personally handled tranquilising big cats. You get my point.\n\nGood luck with your interview!",
          "score": 15
        }
      ]
    },
    {
      "title": "Zoom interview TILT BIOTHERAPEUTICS?",
      "body": "Has anyone heard of this company or job opportunity?\nI was speaking with someone through fb messenger and they sent me to zoom for an interview \nI’m going through a tough time and  weary of scams ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1f2y6ms/zoom_interview_tilt_biotherapeutics/",
      "comments": [
        {
          "body": "It feels off that they would be talking to you via FB messenger.\n\nThe actual company seems to be based in Finland. \n\nNot sure where you are but  I'd look at what time they are getting in touch and see what the time in Finland when they are.",
          "score": 3
        },
        {
          "body": "This has to be a scam. They reached out to me and they wanted to \"interview\" me through Skype but only by chat, no video or anything.",
          "score": 2
        },
        {
          "body": "So is this a scam or not, my mother has been contacting a tilt bio therapeutics person for the last few days. And they are going to send a check for startup. Does this sound familiar to yall?",
          "score": 2
        },
        {
          "body": "[removed]",
          "score": 2
        },
        {
          "body": "Just had a Zoom meeting with Julia Adams and once I typed is the a scam and he said no. Then she quit doing the Zoom meeting.",
          "score": 2
        }
      ]
    },
    {
      "title": "Companies with reasonable interview processes for a front end developer? Like, 'a screening call, an onsite, and a reference check', not \"5 rounds of zoom calls with homework and then an all day trial period'",
      "body": "I have been in tech for about 10 years and for the first 7 of those years, the interview process was quite reasonable. A screening call, an onsite, and a reference check. You always heard about google and amazon having tons of interviews but those were by far the exception in my experience. Most small and medium sized businesses in tech had a screening call, an onsite, and a reference check, more in line with every single other industry on the planet. But I am on the market again and between then and now, all these tech companies now feel like they need a million rounds of interviews. I am not interested in hearing about how it's good because quite frankly I've heard enough and do not feel I need to relitigate it. If you don't believe that most people are specifically psychologically tortured through these 5 interview processes, enough that it alters your behavior so they're not even a good metric, if you think that's good, then fine. But I, specifically, am someone who is great at my job but bad at handling the stress that comes with interviews. It's not that it affects my interview performance, it's that after the interview is over I cry and gasp for breathe from the ptsd. It wrecks my psychological health. So in the previous years when I was looking, I had developed enough coping systems that I could go through a more reasonable job interview process. But every single company I talk to is 5 rounds over like three months, and I'm just staring at having to go through these awful, humilitating, ptsd-inducing interview processes all over again, for a third time, and I just am wondering how to do it. \n\nLet's say I'm the type of person who is a great, 5 star, 10/10 developer. I've gotten 2 offers in the last eight months but, due to this being the worst 8 months of my life for reasons i'm not going to get into, I had to turn both down. Now I am on the hunt for a third, and while I'm sure, if I had the stamina for the next 3 months, I could land an offer...I must admit my stamina is diminishing. Are there any places that need a 10/10 developer but understand that long interview processes make it harder, not easier, to determine if someone is a good dev? A screening call, an onsite, and a reference check? My mental health is literally wrecked from this job search, even as I have gotten offers, just from having to go through this crazy process the tech industry has adopted in the last three years. And hey if on that onsite you determine me not to be a 10/10 developer, then fair enough, but atleast you'd be seeing me under my best circumstances and get the truest judge of my skills and character. Do ANY companies ANYWHERE exist like that for a react developer anymore?",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1jyzah4/companies_with_reasonable_interview_processes_for/",
      "comments": [
        {
          "body": "Other industries do this shit now too. I'm not a developer and the shortest process I've been in is an hr call, a call with a hiring manager, a call with a coworker, an on site day with an exercise (project management), references which many people fail, then offer. Most have 3-5 calls before you come in and it's worse in a bad job market for seekers like this because the hirers have a ton of options and no incentive to move faster.\n\nStartups with a job they need done quickly might be your best bet?",
          "score": 2
        },
        {
          "body": "For the job I have it was one with the headhunter, an interview with the board of the company, and another interview with the location operations manager and the people working there. Then reference checks. Then salary negotiations. Unfortunately, it’s a thing that’s here and not going anywhere. \n\nI suspect that it came about when people began to tell more than “little white lies” on their applications and so it became increasingly necessary to do your DD on a prospective new hire. Idk when it started but I remember it hitting my line of work around 2021.",
          "score": 1
        }
      ]
    },
    {
      "title": "Invited to Final Zoom Interview After Being Asked for References - Good Sign? Normal?",
      "body": "Hey y'all,\n\nA couple weeks ago I posted some advice about being flown out for a job interview. Well, the flights worked out (almost got stuck in Detroit for a second due to a delay lol but I did make it home), and the job interview went (by my standards) pretty well. At the end of the interview, they said that they'd be doing interviews next week (so this current week) and would get to me after that.\n\n  \nWell, a couple days after my interview they emailed me asking for some references, before they had even done the last interviews. I sent them over, and my references told me that they would be contacted either today or tomorrow. \n\n  \nToday, I just got an email inviting me to a \"final zoom interview\" next week. Super short email compared to all the other ones I've gotten so far, previous emails have given more details on questions I can expect, length of the interview, etc. Obviously I know the job isn't mine until I have the offer in hand, I'm still applying to jobs and have interviews scheduled for other positions, but is this a good sign? For other jobs I've interviewed for/gotten an offer for, usually the in-person interview and reference check is the last step. ",
      "subreddit": "jobs",
      "score": 1,
      "url": "https://reddit.com/r/jobs/comments/1kyb1qn/invited_to_final_zoom_interview_after_being_asked/",
      "comments": [
        {
          "body": "The good sign is ... you're still being considered.\n\nWhile not always true - in my experience - most companies do reference checks for one of three reasons:\n\n1. Only on the final candidate as a formality\n\n2. On a candidate they are on the fence on - my company typically only does reference checks on a candidate where we like the candidate, have some concerns, the team isn't 100% on board\n\n3. Decision is down to 2 candidates and reference checks to determine who gets an offer\n\nI'd say it's not a done deal, but you're getting closer to an offer.",
          "score": 2
        }
      ]
    },
    {
      "title": "Mom walked in my zoom meeting in the middle of an interview",
      "body": "Title says what happened. I was on a zoom meeting to interview for a position I am really excited about and hope I get. In the middle of the interview, my mom comes home from being out for a bit and starts mouthing and whispering to me on the other side of the computer. From this, I get distracted and start fumbling for a couple minutes. Was already nervous for this interview bc like I said I really hope I get this position. She stood there until the interview was over. Out of nervousness, since our front door is kinda loud I said that I was a bit distracted bc my mom just got home. Will this mess up my chances of getting the job? It was so embarrassing. Also the person who interviewed me was the director of the whole county for this company. She seemed super chill about it but ahhh \n\nUpdate: got an email to schedule a second interview for this position. Feel like I got lucky after this whole thing but at the same time second interview doesn’t mean u got the job. At least I’m working my way up the process… not going to be home at the time of the next interview so currently researching some places I can go in the area I’ll be in so I don’t have to do it in my car :/\n\nUpdate 2: GOT THE JOB! Hope I don’t regret my decision bc after seeing that contract it’s going to be a lot but going to college for this and already being in the field for 5 years I kinda signed up for it lol - first time doing a full day of it though in a couple years. \n\nUpdate 3: I quit after 4 days… there was some stuff going on that shouldn’t have and was having a mental breakdown every chance I could get the whole time. Let’s just say I’m in a grieving period still… it’s been a couple weeks now but it’s still hurting. I’m grateful to be at my mom’s job until I can find something else but this is all I can think about. This was the career I was meant to be doing but after this experience it has really turned me off almost completely. Don’t even have the energy to look for something else rn ",
      "subreddit": "interviews",
      "score": 6556,
      "url": "https://reddit.com/r/interviews/comments/1mhy26c/mom_walked_in_my_zoom_meeting_in_the_middle_of_an/",
      "comments": [
        {
          "body": "What was your mom’s reaction to this? You may need to rent a library room or something for interviews if she acts like this.",
          "score": 352
        },
        {
          "body": "If the job is hybrid or remote, then your mother’s conduct probably had a negative impact on.\n\nEither she has no clue about business etiquette or this was a passive aggressive move to undermine the interview.\n\nIf you are on the phone and inadvertently interrupt, you are supposed to say sorry snd leave… unless the house is on fire.",
          "score": 482
        },
        {
          "body": "I am reading this and I am frustrated for you.   My son had a hybrid interview the other day for an on campus job and I made sure I was in another part of the house because he told me he would be nervous if I was listening to him interview.   I respected his wishes because him being comfortable is more important than me listening to give him feedback.   With that said, I hope the interviewer overlooks that and you still get the job",
          "score": 75
        },
        {
          "body": "Interruptions can happen, working from home sometimes it's just part of the territory. I would have paused the interviewer and said \"Sorry, one second...\", then said to your mother: \"Hi, I'm in an interview right now, I'll get back to you shortly.\" Then returned attention to your interviewer and said \"Apologies for the interruption\" and then just simply carry on.\nAt home and in the workplace people can and do interrupt and dealing with it in a calm and controlled manner shows leadership and professionalism.",
          "score": 65
        },
        {
          "body": "Why didn't she leave? She just stood there, like a zombie???",
          "score": 43
        }
      ]
    },
    {
      "title": "Zoom Interview in car or cafe?",
      "body": "Accidentally double booked myself, work christmas dinner and zoom interview for a summer research project.\n\nWant to ask if it’s unprofessional to do this interview in (1) my car in the parking lot (might be horrible lighting at night), or (2) a Tim Hortons cafe across the street (which should be fairly quiet at 7:30pm, but you never know)\n\nThe xmas dinner is at 7pm and the interview is scheduled 7:30-8pm, so I’d have to leave 20 minutes in to do my interview really quick. Or I could just skip the xmas dinner, please advise, what would you guys do?!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1pcs2me/zoom_interview_in_car_or_cafe/",
      "comments": [
        {
          "body": "Reschedule the zoom interview.",
          "score": 2
        },
        {
          "body": "don't do it in your car, looks unprofessional. It's not a good idea to do it at Tim Hortons either. Don't attend the dinner at all or go late to dinner",
          "score": 1
        }
      ]
    },
    {
      "title": "I accidentally fixed their live dashboard during the interview and now they want a writeup before the offer",
      "body": "So this was a data role with a small product team. Final round on Zoom. I get paired with the hiring manager and one dev for a live case. They share a dashboard that shows daily signup conversion and ask me to walk through why the number dipped last month. Cool. We poke at filters, I ask a few questions, nothing wild. Then I notice a little note that says refreshed at 7 12 AM even though it is afternoon. I ask who schedules the refresh. The dev says cron is fine and waves it off.\n\nWe keep digging and I open the query editor they gave me read only access. I spot a subtle where clause that drops any events with a null device field. I ask if web events sometimes land with null device. Dev says maybe. We flip the filter and boom the conversion jumps back to a normal level in the preview. I explain the hypothesis. Data backfill missed devices for a few days. The manager goes oh that would explain support tickets. I am feeling good but also nervous because I was not supposed to change anything. I did not write to prod. Only showed the fix in the preview and talked through it.\n\nThen the weird part. After the call the recruiter writes that the panel loved the analysis and would like a short writeup of the fix so the team can push a patch. They say this will help them move to the offer stage. My brain goes wait a sec. You want my steps in writing before you decide. I reply that I can summarize the approach at a high level and I add that my notes are for interview purposes only. They respond with smiley emojis and ask for screenshots. I am not kidding.\n\nI do want this job. Pay is solid and the team seemed nice. But the ask smells off. I already gave them the why and the likely where. Sending a neat step by step doc feels like unpaid consulting. If they want it in detail then just hire me and I will spend the first hour fixing it. Also I worry about IP stuff. I have no access agreement and zero desire to be That Candidate who handed them a free patch then got ghosted.\n\nHow would you reply. Is a short summary ok or should I set a boundary like happy to share more after an offer letter is in progress. Any scripts that keep it polite but firm. And for future rounds how do you avoid becoming free labor when a live case accidentally turns into real work.",
      "subreddit": "interviews",
      "score": 5381,
      "url": "https://reddit.com/r/interviews/comments/1oto36c/i_accidentally_fixed_their_live_dashboard_during/",
      "comments": [
        {
          "body": "Tell them that it would be inappropriate to create company documents on a personally owned device, and you’re happy to do so on a company device.",
          "score": 1207
        },
        {
          "body": "“If you’re good at something, never do it for free.” I don’t remember what movie it’s from, but it still applies.",
          "score": 148
        },
        {
          "body": "You didn't make any change if you had read-only.  The person sharing a screen with you is 100% responsible, so don't feel bad for anything like that.\n\nI would say that I was more than happy to do a technical write up as your first assignment once all the hiring HR documentation is signed.",
          "score": 133
        },
        {
          "body": "I am happy to see you already know not to work for free.\n\nAs they say, the cookie is free. The recipe costs money. They can pay for the recipe.\n\nEven asking this would really turn me off of working for them TBH, but YMMV. Predatory hirers aren’t going to be thoughtful employers. I’m also honestly a little worried that they don’t actually want to hire you despite your very successful interview at this point. Why would they even want a write up at all if they are hiring its author? I might offer a consulting rate, maybe with a premium since you clearly have their attention already. Best case you get paid as a consultant AND hired, worst case you don’t get walked all over.",
          "score": 508
        },
        {
          "body": "Thing is, do you want to work for a company where no one understands what the bug is even after you explain and show them exactly how to fix it? You’d want to work with people who slap themselves across the forehead and exclaim ”of course!” And have a PR ready before the interview is over.",
          "score": 56
        },
        {
          "body": "Send the summary and then mention due to your lack of access to the system (for understandable security reasons) you're unable to write a step by step solution from memory.",
          "score": 210
        }
      ]
    },
    {
      "title": "I told them I was interviewing elsewhere and they ended the call",
      "body": "\nThis just happened yesterday.\n\nHad a second-round Zoom interview for a business analyst role. It was going well, and at the end they asked if I was “actively interviewing elsewhere.”\n\nI said yes, I had two other companies I was in later rounds with.\n\nTheir faces instantly changed. The HR person said, “Oh, we prefer to focus on candidates who are genuinely interested in our company.”\n\nThen she literally said, “In that case, we’ll let you pursue those other opportunities.”\n\nAnd ended the call.\n\nDidn’t even give me a chance to clarify. I guess being transparent is disqualifying now.",
      "subreddit": "interviews",
      "score": 5540,
      "url": "https://reddit.com/r/interviews/comments/1on7eu4/i_told_them_i_was_interviewing_elsewhere_and_they/",
      "comments": [
        {
          "body": "They were hoping to send you a lowball offer and now they know they can’t. They probably didn’t see any reason to continue the call if they know they can’t compete against other employers. They were hoping to pay you very little and it didn’t work.",
          "score": 1130
        },
        {
          "body": "Employer: \"Are you actively interviewing elsewhere?\"\n\nApplicant: \"Are you actively interviewing other applicants?\"",
          "score": 411
        },
        {
          "body": "But, of course, it's OK for them to be interviewing multiple candidates.",
          "score": 264
        },
        {
          "body": "You reminded HR that it's a free market. They were hoping to take advantage of you.",
          "score": 65
        },
        {
          "body": "[removed]",
          "score": 147
        },
        {
          "body": "You are too expensive for them.",
          "score": 83
        },
        {
          "body": "They wanted desperate workers for a job that nobody wants, like too low salary, too far away or other issues...",
          "score": 36
        }
      ]
    },
    {
      "title": "Companies lying about salary ranges is getting ridiculous!",
      "body": "Had an interview with a company I was really excited about… until I found out they completely lied on their Indeed posting. The job description said $90–100k, but during the call, the hiring manager told me the pay was actually $60–65k thats about 40% less!\nI told him what I was expecting, and he said, “Can we still talk? I might be able to make things work.” So we had a great Zoom call and he even said I’m exactly what they’re looking for and that he’d get back to me.\nBut seriously… why do companies lie about salaries like this? It’s so misleading and such a waste of everyone’s time.",
      "subreddit": "interviews",
      "score": 2708,
      "url": "https://reddit.com/r/interviews/comments/1o36mjj/companies_lying_about_salary_ranges_is_getting/",
      "comments": [
        {
          "body": "Be prepared for...\"So I spoke with the manager that controls the purse strings, and I told them how excited I was to hire you, and how perfect you are for the role, and I was able to convince them to offer **70k**, plus you'll be eligible for benefits like our great blah blah blah.  Isn't that great?\"",
          "score": 189
        },
        {
          "body": "If they're going to lie on their job posting, they're not all of a sudden become honest in the interview.\n\n\"Can we still talk\" is the person trying to manipulate you into taking lower pay.\n\nUnless you are desperate, understand that this place is bad.",
          "score": 332
        },
        {
          "body": "Speaking as someone who has been a hiring manager at a couple of very large companies, the HM won’t be able to change the budget by 40%\n\nIt’ll have been agreed between HR and finance\n\nName and shame them and drop out of the process\n\nYou know what happens if they *do* manage to get you that salary? You’ll not see a pay rise the whole time you’re there because you’ll be earning more than the salary range for that role",
          "score": 70
        },
        {
          "body": "“Yeah the job pays 40k, but the value and experience you get is worth at least 60k, so you’re salary is 100k”",
          "score": 21
        }
      ]
    },
    {
      "title": "Had to stop in the middle of an interview (zoom)",
      "body": "I just started my zoom interview. It was my final one out of four total. 3 of my interviews went really well. This last one was with the hiring manager, and I had to stop just as we got started.\nMy office is by the front door, which has never been an issue, until now. As soon as my interview started, my daughter came home and my husband proceeded to have a really loud whisper conversation with her. They all knew I had a job interview.\nI got so distracted, that I had to stop, ask to pause for a moment, muted myself, and then shortly after start again.\nI got rattled. I had to ask her to repeat a question. And then I failed once again at the stupid question of how do you fit an OKR into a project management model.\nMeanwhile, husband thinks nothing wrong happened. Sigh… I feel like I can’t win.\n\nCame back to update: I didn’t get the role. More in part because I didn’t provide specific enough examples of how I influenced leaders and what my outcomes were in the examples I provided. Stupid STAR structure 🙄.",
      "subreddit": "interviews",
      "score": 201,
      "url": "https://reddit.com/r/interviews/comments/1mu653o/had_to_stop_in_the_middle_of_an_interview_zoom/",
      "comments": [
        {
          "body": "Tell your husband to not do that again and it did impact you.",
          "score": 143
        },
        {
          "body": "I felt like I recovered okay. And at first I felt okay asking her to repeat the question, as they do offer to repeat questions, but I wondered if this time around she wasn’t keen on having to repeat.",
          "score": 49
        },
        {
          "body": "Ugh I feel you, I had a fuggin Jehovah's witness knock and ring the door bell twice (my car was in driveway and my home office is right by the entryway door), which set my dog off like crazy....it was during one of my third rounds for a company I really wanted and it just screwed me up the rest of the Interview...",
          "score": 21
        },
        {
          "body": "I am so sorry. Your husband ITAH ( wrong group? lol) but seriously he is dead wrong. I hope you get the job because you can pivot and still can do the job.",
          "score": 34
        },
        {
          "body": "Oof, interruptions happen, esp. at home. For \"How do you fit an OKR into a project management model?\", focus on aligning project deliverables with overarching OKRs, ensuring they contribute to broader goals. It's about showing your project supports business objectives. Next time, maybe a \"Do Not Disturb\" sign can help avoid home disruptions. Hang in there!",
          "score": 9
        },
        {
          "body": "Fill a spray bottle with water and keep it at your desk for such emergencies. If that doesn't work, try a hose.\n\nSorry, OP, I get it. Sometimes it's the little things that throw us off no matter how calm and collected we usually are.\n\nIf it makes you feel any better, I was once in a meeting with a director level person and a whole chain of managers presenting my project, and my father, who had dementia, came up behind me in his Obi-Wan Kenobi robe completely open to ask for food. Even though I always had a fake background, my camera chose that time to pick up every single motion, and I had to act quickly to cover my camera with my hand. Fortunately, no one else saw his naughty bits, but I certainly got an eye full when I looked back to tell him I would get something for him real soon. Fortunately, it was during Covid and everyone added their funny stories to the chat.\n\nI did change my setup after that, though. But it's still a little hard for me to watch Star Wars.",
          "score": 6
        },
        {
          "body": "you didn’t blow it by pausing—interviewers are human too and most would rather you reset than stumble through chaos in the background. the part that matters is how you carried yourself after. if you regrouped and kept going, that’s what they’ll remember.\n\nas for the OKR question, nobody nails every single one. what they’re actually checking is how you think, not if you spit out the “perfect” textbook answer.\n\nstop replaying the distractions like they’re fatal. they’re just noise. what they’re weighing is the whole package of your four interviews, and three already went strong.\n\ncontrol what you can, let go of what you can’t. and maybe have a serious chat with your husband about respecting the space when the stakes are high.\n\n[The NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some sharp takes on bouncing back mid-interview and not letting small stumbles wreck your confidence worth a peek",
          "score": 6
        }
      ]
    },
    {
      "title": "Got a job after 6 months....of hell.",
      "body": "6 months (vp+ level)\n\n471 Applications  (approx 425 website/linked in and 50 via recruiter)\n\n22 First round / HR screening interviews / direct retention recruiter (all web based)\n\n20 Second Round Interviews (hiring mgr and/or c-suite) (mix 75% web based / 25% in person)\n\n13 Third/Fourth Round (Final) interviews (hiring mgr/C-suite/other executives/peers and/or the team I would be running) - typically between 2-3 candidates total. (12 in person, 1 web based)\n\n1 Offer - Accepted (1 title level below what I was at previously and 75% of my past salary, and 25% of my past bonus)\n\nNotes:\nHCOL area\n\n10 of the 13 final round jobs were 100% in office, 1 was fully remote, 2 were hybid (3in/2out or 4in/1out)\n\nI've never not had a continuous job or a Job I chose to leave in my 25 years of employment since graduation.  Laid off in March.\n\nI have a highly coveted professional designation.  \n\nI've had nothing but progressively higher/more experienced/greater money roles until I landed my first director level type job 10 years ago, and remained at vp/sr director / SVP level for past 10 years.  6 jobs total, hopped around for first 14 years, then 2 jobs in last 11 years (approx 5 yrs each).\n\nFor the first 3 months of my search, I only applied to jobs at VP+ level (executive) and only specifically in my very specialized field within my industry.  After a few 3rd round rejections and knowledge of the real world being way harder than I remembered (a huge gulp of swallowed pride)- and a realization that executive and senior level jobs are far far fewer than mid-level jobs - I started to apply to mgr/director (2-3 levels below last job) for approx 60-100% of my previous pay. \n\nI realized there are \"forever open positions\" that HR must have just let go on autopilot and never update but keep reposting that 1000's of people still apply to... \n\nI realized there are \"ghost positions\" that don't actually reflect any need at all and are rarely reviewed by HR (why?) \n\n- I had 7 different versions of my resume.  \n\n8 different cover letters ready and crafted for different types of positions.  \n\nLunch with 15 former bosses/former co-workers (none of which panned out) and about 12 different recruiters.\n\nPs. To the rest of you, I sincerely feel for you and know some have been going a year or more .  If I can do anything - blind fake reference lol just dm me, fug employers and HR!  That said - I will never take working for granted again (which sadly I did a lot during my career) and I will absolutely run through walls for this employer for selecting me.\n\nPss. I went through a very dark month where I really questioned everything and even life itself ... If you're out there pls know things can turn around.  I'm still in disbelief I have a job...\n\nEdit: I can't, but yet can believe how many people are out there that have seen, understood, and feel/go through so much of what I went through -- thank you all for congrats/comments/dms, I seriously have never had this expectation on a post I wrote to just get closure for myself on my hellish journey - and hopefully help some others along the way.  Thank you all.  \n\nA lot are talking about the confidence crush... I had to get a schedule to keep my mind busy and body busy - devoted specific times of the day to apply, work on resume, call people and try and go out, also to exercise, volunteering helps tremendously, and seeing and talking to other people even if random about something other than this defining thing that I put so much self worth into - it helped to know I had other talents and uses and kept me positive.  \n\nOne tip ... Try and schedule interviews in the morning if possible, turn off or don't look at your emails I til after said I terview...getting rejections even if automated on things you applied for a month ago and never got a round 1 on or worse getting a rejection from a round 2 or 3 you had last week right before you get on a zoom or walk into a building.....it was so hard to not think about it or focus on not believing you are a loser etc.  \n\n",
      "subreddit": "interviews",
      "score": 2167,
      "url": "https://reddit.com/r/interviews/comments/1muh964/got_a_job_after_6_monthsof_hell/",
      "comments": [
        {
          "body": "This is a fantastically real and useful post.",
          "score": 104
        },
        {
          "body": "Congrats, this is helpful. I’m mentally prepared to go a level down as well. Did you find your role via cold application?",
          "score": 51
        },
        {
          "body": "Congrats. I’m currently in this same storm.",
          "score": 15
        },
        {
          "body": "Congrats on pushing through—your perseverance and honesty about the setbacks are powerful, and landing the role after such a grind shows incredible resilience that others in the same spot will find inspiring.",
          "score": 11
        },
        {
          "body": "I have a very similar story.  Thinking and interview went great, only to hear rejection is an awful state to be in",
          "score": 7
        },
        {
          "body": "Congratulations, it kind of helps me to read that someone got hired, 1 year of hell right here! I was working as a VP and when I realized that the search was harder than I thought, I also had to lower my expectations and still nothing yet, It had never been this hard before, I have worked for the same company for almost 7 years, 3 roles there, when I was able to join the company back then it took me a month or less and I was working and was invited to apply for the role, I can’t believe how much the job market has changed and the “forever open roles” OMG I just can’t believe it, at least 3 of the roles that I applied and got interviewed are like that open for as long as I can remember, I just don’t understand. So I’m truly happy to read that this hell got to and end for you, hopping to hear that all of us that have been waiting for an opportunity finally found it.",
          "score": 6
        }
      ]
    },
    {
      "title": "What's up with interviewers not showing their faces on online/zoom interview",
      "body": "happened to me several times: \n\n\\#1 Two panelists were both off camera, and I (the interviewee) was the only one with my camera on. I wondered whether I should turn mine off too or not.\n\n\\#2 the interviewer was wearing a mask in her private office (to my knowledge, not shared with others). I struggled to understand her questions, partly due to the mask and also because she had a very soft voice. I felt terrible having to ask her to repeat herself multiple times. Lip reading certainly aids in speech comprehension.\n\nI am genuinely curious why people would do this. Are they too shy? or just being rude?",
      "subreddit": "interviews",
      "score": 41,
      "url": "https://reddit.com/r/interviews/comments/1lpo8q7/whats_up_with_interviewers_not_showing_their/",
      "comments": [
        {
          "body": "I would take another look at everything and just make extra sure these aren’t scams. There are so many job scammers trying to take advantage of people right now and if someone is avoiding showing you their face, it doesn’t hurt to be extra cautious.",
          "score": 22
        },
        {
          "body": " They also record the interview. They do not turn on their own camera. ",
          "score": 7
        },
        {
          "body": "Trust me same thing happened to me I hate this. I did take 2 interviews recently and they asked me to switch on my camera and they did not on which really pissed me off. And both interviewers were freaking late almost 15min late for 30min interview. It’s really frustrating at this point 🥲",
          "score": 6
        },
        {
          "body": "They're hiding that they're overseas outsourced minions instead of legit workers for the company, or they're AI",
          "score": 3
        },
        {
          "body": "Simply put. I will not do a remote interview one way. If their cameras are off I am declining. It is just not professional nor respectful. In the days before zoom, phone interviews were common. But with video now everyone thinks they have a right to anonymity.",
          "score": 11
        },
        {
          "body": "I was on one once. If it happens again I’m just bailing mid interview. The first one took me by surprise",
          "score": 2
        },
        {
          "body": "I'm a manager that interviews and during COVID and right after I would mostly WFH and just went to work straight from bed so I didn't want to be on camera disheveled. I also never turned my camera on during meetings internally or externally. No one except the department heads really turn on their cameras. Now that we are forced to RTO it's just a habit not to turn on my camera.\n\nI don't hold it against any candidate that doesn't turn theirs on and one of our hires did not interview with their camera on. I honestly don't really see any value personally. I just focus on their work experience and answers to my questions.",
          "score": 2
        },
        {
          "body": "it’s not you—it’s them. camera off = low effort, low respect. they want full engagement from you but can’t bother to show their face? that’s not shyness, that’s a power move or straight-up laziness. treat it like a red flag for culture. if they can’t show up for an hour, what makes you think they’ll show up when you work there?\n\n[The NoFluffWisdom Newsletter](https://NoFluffWisdom.com/Subscribe) has some sharp breakdowns on interview power dynamics and reading hidden signals worth a peek",
          "score": 2
        },
        {
          "body": "I don’t know, but I consider it pretty unprofessional  ( and frankly rude) to not have your camera on during an interview.  interviews are hard enough, if you ain’t gonna have your camera on just make it a phone interview.",
          "score": 2
        }
      ]
    },
    {
      "title": "What would you do if your interviewer didn't show for TWO Zoom interviews?",
      "body": "**Honestly, I am over this job market.**\n\nYesterday, I had a scheduled Zoom interview for 2:30 PM with a job I was really excited about. I had already done an intial short phone interview with the interviewer and it had gone well enough that he wanted to go forward with another interview. We had this meeting scheduled for a week. When it finally came time to log in for said meeting, I logged in a few minutes before the scheduled time, and waited patiently for them to join. By 2:34 I started to panic a little, had I clicked the wrong link? Was my computer broken? Did Zoom sabotage me and send me to some non existent room? So I left the meeting, and rejoined. Unfortunately, it was the same. I waited for 30 minutes before I left that meeting. I sent an email to the manager/interviewer and let them know I had waited and I was understanding of the mishap, and to let me know about rescheduling. They emailed me back **within 4 minutes** and were extremely apologetic and offered another chance to interview the following day (today) - I accepted because like I said, I thought this was a job I really wanted. \n\nNow fast forward to today. Interview was scheduled for 1 pm, I joined 1 minute early... and proceeded to wait, again. this time I left the meeting after 15 minutes and I haven't sent any follow up email or anything yet. I was wondering, if you were in my situation, what would *you* do? \n\n  \nTLDR; interviewer didn't show up for 2 Zoom interviews two days in a row for a job I was excited for, or so I thought. would you send ANOTHER follow up or just move on with some of your dignity still attached? lol",
      "subreddit": "interviews",
      "score": 10,
      "url": "https://reddit.com/r/interviews/comments/1n1p733/what_would_you_do_if_your_interviewer_didnt_show/",
      "comments": [
        {
          "body": "I'd move on. The best they'll ever treat you is during the interview process. Sure, sometimes things come up at the last minute, but it doesn't take more than 30 seconds to cancel or reschedule.",
          "score": 19
        },
        {
          "body": "I’d reschedule and not turn up myself.",
          "score": 5
        },
        {
          "body": "Personally, I would send an email that you were sorry that you and the manager couldn't make your calendars line up and you wish them good luck in filing the role.",
          "score": 6
        },
        {
          "body": "Forget about them and move on… that’s a place that’s going to forget to authorize your paycheck or not book other important things like client meetings that you worked hard to get on the schedule.",
          "score": 3
        },
        {
          "body": "I had an hr person who didn’t call me for our scheduled phone screening twice. I sent a professional fuck you email formally rescinding my application on account of their bad communication.",
          "score": 3
        },
        {
          "body": "I'd ghost them.  Don't reach out and don't respond. It's probably childish but we put up with ghosting and no shows all the time, time to push back and say we won't take it anymore.",
          "score": 2
        },
        {
          "body": "Something similar happened to me last week. I’d withdraw and move on. If they can’t be professional and respectful of your time now, imagine how it’s going to be when you are actually working there.",
          "score": 2
        },
        {
          "body": "They no-showed twice and responded to your email in 4 minutes? They're at their desk, they just don't care about your interview.\n\nThis isn't about being busy or having emergencies. Someone who misses two scheduled interviews - especially after apologizing profusely for the first one - is showing you exactly how they'll treat you as an employee.\n\nDon't send another email. They know they missed it. If they wanted to interview you, they'd be reaching out right now with a massive apology and concrete plan to make it right.\n\nThe company culture analyzer in CareerCheck.io actually flags interview behavior patterns from candidate reviews. Companies that ghost interviews typically have terrible ratings for \"respect for employees\" and \"work-life balance.\" This manager just saved you from finding out the hard way.\n\nMove on. A company that can't manage a basic Zoom interview will be a nightmare for performance reviews, promotions, and daily communication. You're not losing dignity by walking away - you're maintaining it.\n\nIf they reach out again (they probably will, with more excuses), decline politely. \"After two missed interviews, I've accepted that this role isn't the right fit. Best of luck with your search.\"\n\nThe job market sucks, but working for people who don't respect your time sucks more.\n\ncareercheck.io",
          "score": 3
        },
        {
          "body": "Wow!  I was on my 3rd interview with a company and was being interviewed by SR. Leadership who didn’t show up after 15 minutes.  The recruiter entered the Zoom and didn’t give a reason  and said would be in touch  and never heard from them again.  Common courtesy has turned into ghosting.",
          "score": 1
        }
      ]
    },
    {
      "title": "Zoom interview w/Japanese interviewer",
      "body": "I’m a candidate for a job with an American division of a Japanese company. I’m doing interviews by Zoom mostly with other American prospective coworkers, but in a few days I will interview with someone based in Japan. I have no professional experience working with Japanese people or companies.\n\nCan anyone provide any tips on what I should expect and how this interview may be different? Any and all advice is welcome!",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1o0ykxl/zoom_interview_wjapanese_interviewer/",
      "comments": [
        {
          "body": "Tho I’ve never personally interviewed with a Japanese company, I’ve heard from a bunch of people (and read a few guides) that it’s way more formal than what we’re used to. Be on time like, early early. They really notice that.\n\nTry to keep your tone polite and calm, even on Zoom. They appreciate structure in your answers to be clear, short, to the point. And if there’s silence after you talk, don’t panic, they’re probably just thinking.\n\nOne thing everyone says: don’t oversell yourself. Be confident but humble, talk about teamwork and how you fit into a group. Also, say thank you at the end, even a simple “Thanks for your time” really matters.\n\nSo yeah, just go in respectful, well prepared, and a bit formal, and you’ll be fine.",
          "score": 1
        },
        {
          "body": "Formal, more traditional and respectful. They are really into hierarchy and showing respect to people based on age and title. To greet, even though on zoom, you may want to do a quick bow of your head with your eyes pointed down. You can also learn to say, hello in Japanese: Koneechiwa - that will go a long way\n\nHumility is valued, but that does not mean you need to sell yourself less, just be aware of your body language and the words that you use. They don't like grandiose gestures or language (don't be boastful). Show an interest and eagerness to work and learn about Japanese culture. Don’t overly emphasize individualism or challenge authority. For dress: a black or dark navy suit with a white shirt is standard.\n\nArigato zymas is a polite way to say thank you at the end of the interview.\n\nGood luck!",
          "score": 1
        },
        {
          "body": "um, it's a small tip. sometimes Japanese people's pronunciation is hard to underdstand.  \nif you have language problem to understand what they say, i use Deeptrue.",
          "score": 1
        }
      ]
    },
    {
      "title": "Zoom Interview",
      "body": "So I have my first interview since COVID. It's for a TV producer opening, something I have experience doing years ago. I am going in with the mindset the worst they can do is say no.\n\nMy question - since it's over Zoom what is the dress etiquette? I know what TV people wear but I don't want to be too casual either.",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1nj31da/zoom_interview/",
      "comments": [
        {
          "body": "Dress for the job that you're applying for, as if you are going to walk into the interviewer's office in person. Yes, even shoes. It'll feed your confidence and you also leave no chance that your computer/camera pitching downward will lead to embarrassment.",
          "score": 5
        }
      ]
    },
    {
      "title": "To request or not request a Zoom interview?",
      "body": "I have been looking at jobs in cities 2-3 hours away from me. If I do get called for an interview, is it ok to ask for a Zoom interview, assuming I'd relocate there, or suck it up and drive 2-3 hours for the 1-hour interview? ",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1mfy352/to_request_or_not_request_a_zoom_interview/",
      "comments": [
        {
          "body": "If this is a white collar job, the first interview is typically over the phone. Sometimes, it's through Zoom / Teams.",
          "score": 2
        },
        {
          "body": "I think you take the interview you get.",
          "score": 1
        },
        {
          "body": "Ask for the accommodation, the worst they can say is no and then you know you have to drive.",
          "score": 1
        },
        {
          "body": "If they want you in person AND you don't show up in person, it kind of calls your entire work ethic into question. \n\nOh, so you really live in the city 2 hours away, and you're going to rent a cheap room here three nights a week until you ask for remote?\n\nUm. No.",
          "score": 0
        }
      ]
    },
    {
      "title": "Just started a new job yesterday, but I have a final Zoom interview for another opportunity - where should I take it?",
      "body": "Hey everyone,\nI just started a new job yesterday, but I’ve been interviewing with another company and things have progressed pretty far. Today, they emailed me saying they’d like to schedule a final round Zoom interview (about 15 minutes), and they also mentioned they’d be contacting my references. So this seems like a serious final step.\n\nI let my current manager know I’d need to briefly step out tomorrow afternoon for something personal, and she was fine with it. My question is -  since I’ll be in the office, where should I actually take this Zoom interview? I don’t want to risk being overheard, so I was thinking maybe my car, but I’m not sure if that looks unprofessional. There’s no clear private space at the office I could use.\n\nHas anyone been in a similar situation or have tips for how to handle this smoothly? Appreciate any advice!",
      "subreddit": "interviews",
      "score": 3,
      "url": "https://reddit.com/r/interviews/comments/1lkiwlb/just_started_a_new_job_yesterday_but_i_have_a/",
      "comments": [
        {
          "body": "Do it in the car and use a background image on zoom",
          "score": 6
        },
        {
          "body": "Is there a local library that's close by? They often have study rooms that you can use. You'd have to look up if you need to reserve it but it's usually really easy and I don't expect that all of their rooms will already be reserved.",
          "score": 3
        },
        {
          "body": "Done that a few times.\n\nFirstly, do they know you're currently working? If so, then it's completely understandable to take the call remotely (in a car). \n\nSecondly, once you've landed this new role. Expect the proverbial to hit the fan with your current new job. Done that a few times too.. \n\nAll the best.",
          "score": 2
        },
        {
          "body": "Take it in the car and use zoom background image which the app only has blur for default will suffice. You can upload if you want but the Blur version worked. I had to do this for an interview and it worked for me.",
          "score": 1
        },
        {
          "body": "Say you have a doctors appointment and head out early?",
          "score": 1
        }
      ]
    },
    {
      "title": "Zoom interview recorded",
      "body": "I completed an initial interview this morning and it’s just hitting me that it was recorded… \n\nI’m so, so thankful that didn’t throw me off and I just dismissed it. \n\nIs this normal? \n\n",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1m9gm0w/zoom_interview_recorded/",
      "comments": [
        {
          "body": "This is not normal for recording without consent. This is normal for a lot of interviews as long you were given consent they can record you. They should have asked you for consent for electronic recording. This is different then voice recording. Look up your state laws if this is allowed. If they move you forward to next interview and they record the interview without consent let them know you did not consent to recording. This is a big red flag for recording without consent. Even if they don't need to get your consent this is not respectful and they should have at least told you this was being recorded.",
          "score": 2
        },
        {
          "body": "I had a zoom interview that was recorded. \n\nBut they sent me mail in advance letting me know that it’ll be recorded. They also gave me an opt-out option and let me know that opting out wouldn’t impact my candidacy in anyway.",
          "score": 2
        },
        {
          "body": "yeah it’s normal  \nand no one cares how you feel about it\n\nevery ATS platform auto-records now  \nthey're scanning for keywords, eye contact, ums, pauses, tone, even fake smiles\n\nyou’re not crazy for noticing  \nbut don’t overthink it  \njust assume every screen is being watched and act accordingly\n\nnext time: prep like you're on stage, then forget the camera's there and get the win\n\n**The** [**NoFluffWisdom Newsletter**](https://NoFluffWisdom.com/Subscribe) has some sharp takes on interview mindset and mental clarity under pressure worth a peek!",
          "score": 0
        }
      ]
    },
    {
      "title": "Video/teams/zoom interview etiquette",
      "body": "If the interviewer doesn't show up on video, but, expects the interviewee. How does one go about with the rest of the call?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1mdctzf/videoteamszoom_interview_etiquette/",
      "comments": []
    },
    {
      "title": "Is it weird to request the HR to delete your recorded Zoom job interview?",
      "body": "I interviewed for a job via Zoom a few days ago and they told me that I had to record the whole interview process so I did. They haven't responded about the results yet, but it has been a few days and they told me that if I don't get the results in a few days that I am probably not considered for the job.\n\nI am concerned about the recorded interview. I hope they just use it for the interview process and delete it afterwards, but I am afraid that won't be the case.\nI've heard so many people talk about their experiences about zoom interviews and although it was just for job interview, some of the companies used it for their promotions, even though they didn't get the job.\n\nSo is it OK to email them and kindly ask to delete my interview? Or would that be weird?\n\nI am sure that I won't be doing any interviews for them in the foreseeable future or in that industry,so I don't think it matters whether I look weird or not but I don't wanna sound insane.\n\nWhat do you guys think I should do?",
      "subreddit": "interviews",
      "score": 1,
      "url": "https://reddit.com/r/interviews/comments/1l9c4y1/is_it_weird_to_request_the_hr_to_delete_your/",
      "comments": [
        {
          "body": "I’m not sure but this seems new. Never heard of a place recording my interview. I could be under the subject of a retention policy. So they might have to hold it for 10 years but that is based on email. Not 100% sure about this scenario",
          "score": 1
        }
      ]
    },
    {
      "title": "Notes + Teleprompter with Zoom integration to nail the next interview",
      "body": "I have ADHD and lately, I’m having a more difficult time trying to recall my prepared STAR responses for my upcoming interviews. Has anyone used a teleprompter app where you can quickly select which STAR scenario you’d like use to address the interviewer’s behavioral question; kind of like a script selection via drop down menu? I’m trying PitchHub but it lacks that extra punch for this use case. Bonus points if there’s an AI application that can auto-select + start a response based on the interviewers question in real-time as it’s spoken. ",
      "subreddit": "interviews",
      "score": 0,
      "url": "https://reddit.com/r/interviews/comments/1k7bnyu/notes_teleprompter_with_zoom_integration_to_nail/",
      "comments": [
        {
          "body": "Just throwing this out there. I interview a lot of candidates on zoom and teams and we immediately, and I mean immediately count someone out when they are obviously using interactive AI interview tools. The thinking is: if they can’t handle an hour interview, how can I trust them dealing with my clients and customers. Not dissuading you from using this, just wanted to give you that perspective.",
          "score": 3
        },
        {
          "body": "We would automatically disqualify you and end the interview right away if you are using any AI application or your answers don't feel natural. Don't do it. \n\nI have ADHD and none of the AI stuff will help you. You want to nail the behavioral questions? Be honest to what you did from your previous roles to match what they are asking.",
          "score": 1
        }
      ]
    }
  ]
}